{"name": "NBA Live 2001", "ref": "https://multiplayer.it/recensioni/nba-live-2001_b.html", "text": "Presentation Having discarded the dvd-style package (much hated by most gamers who love the good old box, yours truly excluded being biased ^_^) and beautifully ignoring the 2 enclosed manuals (bad!!!), let's launch into the complete installation of the game which amounts to about half a gig (to have faster loading and eliminate swaps) and we prepare our trusty pad (Microsoft's Sidewinder is highly recommended); after the EA Sports logo and the copyrights screen, the introductory full motion begins which mixes digitized sequences from reality, phases of the actual game and the big face of Montell Jordan (author of the very famous ~This is how we do it~ released a few years ago), famous rap author, intent on humming as only he knows how to do, so those who love rap music turn up the volume of the speakers to the maximum. Game mode Before starting, let's start with the system requirements, in the minimum order, recommended and those used by myself for this review: at a minimum you will need a P 200, 32 mb of ram, 4x cd rom, 100 mb on hard disk, DirectX 8, Direct 3d compatible 4MB accelerated video card; the machine recommended by the manufacturer consists of a P2 450, 64 mb of ram, 16 mb D3d compatible accelerated video card, 10x cd rom and over half a gig of hd space (excluding space for save games). The test was performed on a P3 500, 256 mb of ram and GeForce DDR with 32 mb of ram. Arriving at the main screen we find the game modes and the slew of options that have distinguished the saga, especially in recent years: you can take advantage of the arcade and simulation modes or, by setting the various parameters at your disposal, a perfect hybrid of the two: do you want remove Traveling? Okay! Do you want to defenestrate the Out of Bound? Very free to do it! A piece of advice from the writer of these lines: the easier you will make your life and the more gently you will put NBA Live 2001 on the shelf, so if you really want to play with a 5v5 clone of NBA Jam where anything goes at least raise the difficulty level at most, otherwise you will win even with gaps of hundreds of points, with an average time for each quarter set at 3 minutes! In addition to the classic exhibition, you can start a season or even just the playoff, which can also be customized in terms of duration. Also present in the 2001 edition is the franchise mode, which will allow you to sell, buy basketball players at your convenience and the one to create a new player from 0, inserting hair, glasses and which also gives you the possibility to choose the height, weight and the skill for individual skills (such as 2-point shooting, 3-point shooting, ball stealing, dunking, etc etc). The one on one mode is also included, where 99% of NBA fans will certainly choose Michael AIR Jordan, the Chicago Bulls legend of the 90s! By night or day, on public basketball courts, you will challenge your opponent in an exciting head-to-head match, whose rules are fully customizable as usual (score necessary for victory, who scores keeps possession of the ball or not and so on) . Unlike the console version, the Windows version of EA basketball features online play (via the internet and via modem with a device of at least 56k or via tcp/ip), whose settings can be activated with disarming ease via a very comfortable panel where you will set all the fundamental parameters such as the game mode, the seriousness of the fouls, injuries and the presence (or not) of rules. The classic icing on the cake is represented by the possibility of saving one's replays via .avi files, the quality of which is decided by the gamer. Graphics From this point of view, the results are the same as those obtained from the comparison between the PC version and the Playstation 2 version of Fifa 2001: stellar resolutions and very good fluidity for the first and ~low~ resolution (640x480x32) with terrific frame rates for the second; Nba Live 2001 does not escape this rule, indeed the PC version really has a few clicks too many if you use all the details to the maximum, even with the aforementioned resolution. Fortunately, there are not many moments in which the poor fluidity peeps out (especially if your view has a not very marked zoom), so for as long as you play and you will see Shaquille O's last alley hoop dozens of times Neal you will not fail to exalt yourself seeing the number of polygons that assembles the single basketball player, absolutely stunning! If all this seems little to you, take a look at the beautiful textures introduced by the American coders: goggles, beard, eyebrows and stockings make many of the stars faithfully reproduced here dangerously similar to reality (Jordan, O'Neal, Bryant, Grant and Malone above all!). The animations are also quite varied, given that between applause (perhaps after a free throw), dunks (exhilarating the 2-handed one, especially if Pippen is hanging on), shots, insults (after having suffered a foul) it will seem really to watch a game on your trusty TV. The reflections on the parquet and the system of dynamic lights and shadows are also excellently implemented (if your PC is able to handle everything), especially in the pre-match phases, when the teams take the field. Final annotations for the graphics: while not at the levels of NBA 2k1 of Visual Concepts for the Dreamcast, the audience is made light years better than that seen in the year 2000 edition of NBA Live, placing it deservedly as the second best audience never seen in a sports video game; the game arena always seems the same, when in another Electronic Arts title, Nhl Hockey (in this case the 2001 edition), the stadiums are very different from each other and, inexplicably, the central scoreboard at times lag Sound Nothing to do, but Bagatta is not as convincing as always: it being understood that the commentary has improved by some measure compared to that of the prequels, the US version is still unattainable from this point of view. However, if you love rap or all those hip hop sounds, typical of Montell Jordan here or his illustrious colleagues like LL Cool J or Coolio... well, I can already see you looking for the soundtrack on the net, since some songs deserve to be heard and resentful even 3-4 times in a row (and the undersigned is only a sympathizer of this kind of music, let alone if I was a huge fan!!). The championship speech of the individual athletes is also absolutely excellent (who knows how many of you will be thrilled to hear your NBA star speak) and the sound effects, of which worthy of mention are the noise of the shoes, of the ball when it hits the backboard or when it is used for a dunk. Playability and longevity Nothing practically nothing has changed since the last release of NBA Live (and I don't think there were any significant changes even compared to the 1999 edition); What does this mean? That aficionados of the saga will not have the slightest hesitation in rushing to buy it and that its detractors will certainly continue to be such, at least until the next edition. For those who are about to enter the world of the NBA for the first time according to EA, it is good to say right away that the game is quite fun, I would even say exhilarating in the case of lightning-fast action that culminates with a dunk or when you block a shot. under the scoreboard, of an old glory like John Stockton (present together with other big stars in the legendary All Stars teams of past years). Too bad that once again the rebounds in defense are entrusted to athletes incapable of such a burden (even if the updated rosters in their statistics are found on the net, slightly improving the situation), too bad that the level of difficulty is not the highest ( we don't talk about it if you play without fouls and with a low level of difficulty) and that these defects have been brought forward (albeit to a lesser extent, fortunately) for 7 years, i.e. from the release of NBA Live for Megadrive! Again, I played many games but never a single case of injury, despite the possibility of omitting it or not (I'm sure I didn't omit it, evil ones!!!) and if you try to auto-update from the Internet (feature already seen and appreciated in Fifa 2001) the game will ask you to wait even more than a whole day! Result? Classic bug of the last hour!! Despite these defects, the game is certainly not bad and the fun it gives does not push the basketball video game enthusiast to buy a Dreamcast immediately just for the thrill of trying his majesty Nba 2k1, the true paradigm of the genre, which hopefully peek on PC thanks to Sega's new trend of producing software on various platforms. Conclusions Graphically superb (but have a good pc), fantastic music, commentary by the Bagatta still slightly down, good playability, fun game modes and the possibility of playing multiplayer, among other things much easier than in the past. Definitely the best basketball game available for owners of medium-high range PCs, but for those who own a PC below the requirements recommended by the manufacturer, I recommend the 2000 edition or the 1999 version, sold at a budget price or, in which case you own even a brand new Playstation 2 and you are not interested in multiplayer, I recommend the console version, which has no hardware requirements problems. Moral of the story: if you don't have a Dreamcast, this is basketballto buy! Finally among us! Usually before the end of the year, the updated editions of Tomb Raider and Electronic Arts sports franchises such as Fifa, Nba Live and Nhl Hockey make their appearance, always on time. If the rumors are true, Christmas 2001 will see the absence of the famous Miss Croft as she prepares for her (inevitable) landing on the PlayStation 2 (which will take a few extra months for the effort) but Christmas just ended saw Nba Live 2001 absent in the release schedule! Gradually postponed until the last week of February, the PC version of the popular EA Sports basketball saga is finally available, winking at the basketball enthusiast from the shelves of Italian shops together with the version for the 128-bit console from Sony. been out for quite some time now. After this brief introduction we can go into the heart of the review which promises to be fairly long having the firm intention of analyzing point by point the peculiar aspects of NBA Live 2001, guilty of a certainly not slight delay.", "date": "2001-04-30", "grade": null}