{"name": "MechWarrior 4 Vengeance", "ref": "https://multiplayer.it/recensioni/mechwarrior-4-vengeance.html", "text": "The first impression.. is the wrong one The first few minutes of playing MW4 were decidedly disappointing. I couldn't believe what they had done at Microsoft since MW4 seemed inferior to the previous chapter. For example, the graphics from the Mechs and the damage management seemed worse to me, if you remember in MW3 (which was the first episode made by Microprose after the rights were sold by Activision) the Mechs could fall to the ground if hit by a particularly powerful salvo and could be raised again, moreover they lost the pieces where they were hit. It doesn't happen here, and this, at first, disappointed me. But that's only at the beginning, as I was actually making an error of judgement, wanting to directly compare the two games. In reality MW4 represents, not an evolution, but a totally new game without, however, distorting the atmosphere that has characterized the whole series. However we proceed with the usual order starting from the plot and the singleplayer. They just killed our family. Not a bad start! For the few who do not know the world of MW, you must know that we are around the year 3060 and this time we impersonate Ian Dresari, a young heir to the throne on the planet Kentares IV, but Katrina Steiner of the Lyran Commonwealth has decided that he needs the planet and decides to take it without first asking permission. At this point it becomes clear that we must regain what is rightfully ours and that our family has defended with its blood. In fact and differently from the other times, the plot has a greater thickness and we can only be happy about this. In any case, there are 26 missions and they take place on different battlefields and which prove to be an excellent challenge even for MW veterans, ah, I almost forgot about the inevitable training stage which is preparatory for driving a Mech . No news regarding the gameplay, which certainly does not shine for originality. The missions are linear and take place after the inevitable briefing, from which we have the possibility to choose our Mech and that of our wingmen. Graphics and other technical aspects The graphics of MW4 are very nice and accurate, especially the landscapes are convincing. We can also fully interact with the surrounding environment and therefore we can cut down trees, move rocks, and so on. In my opinion, what is subdued compared to MW3 is the graphics of the Mech, certainly the animations are excellent (a little less those of the other vehicles, such as for example the tanks), and the explosions are spectacular, but the previous chapter was made of another dough. The 3D engine is very performing and manages to push everything on the screen, with all the options selected, even at high resolutions and at 32 bits without significant slowdowns. The whole sound behavior is also good, with evocative music (but not comparable to that, for example, of MW 2 which was a true masterpiece) and appropriate sounds. 10,000km. It's cutting time The Mechs are the usual, thanks also to the FASA license, and their management is also always the same, so we will be able to freely customize our Mech with a whole series of not exactly peaceful weapons and devices. As usual, the management of the wrecks that we can obtain on the battlefields and which prove to be an inexhaustible source of supply will be important. In this MW4 it reappears the same as the previous ones, and on the other hand if a game reaches its 4th edition with so much success, not counting the countless add-ons, there will be a reason. No? However for the uninitiated, the Mechs can carry three different types of weapons: cannons and rockets, which have the only defect that they run out of ammunition, lasers and other pulse weapons which have no ammunition, but heat up the Mech and which therefore they should be used with caution. However, I really liked the Mech management interface which was simple but complete. A special mention goes to the artificial intelligence that has reached full maturity, both that of our comrades and that of enemies. It is not uncommon to see an enemy hiding and using all the advantages provided by the environment, furthermore the Bots that can be used during Multiplayer games (whose skill is selectable) are really effective. Well done Microsoft! The real news. Multiplayer! Already up to now MW4 has proved to be a good title, but nothing more. What makes the difference are the modes in Multiplayer. In this MW4 it looks more like Quake 3, since we have many modes available such as King of The Hill, Capture the Flag, Steal the Beacon, Teammate, Melee and many others! It is possible to play on the Internet, in Lan or between two PCs with direct connectionsta, but it is also possible to use Bots to create furious clashes even if we are alone. As it is easy to see, all this attention placed on Multiplayer makes us understand the true spirit of MW4 which is not single player, despite an excellent storyline, but online challenges. And this explains many whys, especially of the graphics engine. You should know that it is possible to play On-Line with a very low Lag due to the specific engine that was created for this game, which evidently also influenced other aspects of the game but it was worth it! Conclusions What to say? MW4 is a great title with outstanding multiplayer which is the flagship of this product. In short, we can extend our collection with this new chapter. Can't you find? Quick hand doesn't stop And we are at 4!! Mechwarrior is one of those titles that made the history of videogames: how can we forget the first incredible chapter of the saga, which showed off an incredible (obviously by then) graphics in 640x480 in pure 3D? Since then the game has undergone a slow but constant improvement reaching what is now proposed as the state of the art in the field of this type of game. Well, then we just have to put on a suit and helmet and let's take a seat inside one of these beasts that can weigh up to 100 tons and which takes the name of Mech.", "date": "2001-04-30", "grade": null}