{"name": "Motocross Madness 2", "ref": "https://multiplayer.it/recensioni/motocross-madness-2.html", "text": "Seen up close For all those who have not been able to appreciate the first title, (and who will not want to put up with my review) I will briefly summarize the main features: a motorbike, a rider and many spaces in which to give vent to one's motoring vivacity. The ~how~ and the ~where~ are up to you; you will have many different types of races available, various makes and models of motorbikes (some really existing, others fictional), divided into the various engine capacities of modern off-road vehicles, and just as many different places in which to give vent to your competitiveness. To complete the picture, there are three selectable modes for each event: practice (don't ask me to explain what it is), single race and tournament (a certain number of rounds of your choice). This very high degree of customization allows the game to enjoy excellent longevity both in singleplayer and in multiplayer, given that this option supports up to 8 players on the local network and up to 4 on the MS Zone in each of the types of races provided. Events Baja, Stunt, National Race, Supercross, Enduro and Pro-Circuit: are they enough for you? Each of these six modes (the last two brand new) offers an equally different and original type of race. Stunt, for example, consists of a particular race, held in open spaces (no circuits within which to chain one's imagination), and in which victory is obtained with the points deriving from your evolutions on the saddle. The more classic National Races and Supercross are no less spectacular, but they are more part of the classic schemes of the circuits in which you compete against the clock and against your opponents. Baja and Enduro, on the other hand, allow you to travel wide spaces through circuits defined exclusively by waipoints that must be ~stuck~ in order to complete the race. The difference between the two types of competition lies in the overcrowding of the competition fields: those of baja are semi-deserted, very crowded (from the most imaginative fixed or animated objects that come to mind). Pro-Circuit allows you to face a real career as a professional driver in the various disciplines available, managing a budget that can be increased with podium successes, or squandered with disappointing performances and staggering medical expenses: you will give work to a team of orthopedic to put all your bones back together after each race. The gameplay One of the best aspects of MM2 is the very gentle learning curve, combined with pure fun-oriented game physics. The setting is certainly not that of an off-road racing simulator, but neither is it 100% arcade: you will feel like experienced centaurs although most of the more daring maneuvers make you smile for the ease with which they are performed. Controlling the vehicle is easy both with the keyboard and with other more advanced ~game tools~ (joystick and gamepad are perfectly supported). Even the combination of keys to be used in the game reflects the setting of the mixed arcade / simulation gameplay: neither too many nor too few. The technique As mentioned before, the graphics of this sequel have definitely improved compared to the first title, following the natural technical evolution of the machines on which it will have to work. The graphics engine is the same as the previous game, with some modifications mainly aimed at increasing the details of both the moto-pilot system (animated separately) and those of the landscape in which you move. One of the things that most strikes the attention of those who try out this title, with the memory of the previous one still fresh in mind, is the very high number of ~objects~ that enrich the environment: trees, bushes and shrubs, typical of the localities they form the backdrop to the settings, but also helicopters, planes, large work vehicles, trains, tractors and many others, stationary or in motion. Sound and hardware requirements are the only cons of MM2. The first, although improved compared to the previous title, does not come close enough to the acoustic exuberance produced by a racing motorcycle (the most realistic sound is that of the 125 CC, although it is more similar to that of the smaller displacements), nor is it able to follow the engine rpm; it's a side dish. The system requirements, to have access to the graphic marvels of which the game is capable, are proportional to these. The machine on which we tested it was an Athlon 600 with 128 Mb of Ram and V3 3000: it was not infrequently put into difficulty by the management of the polygons and by that of the AI, above all in the presence of large spaces and crowding of the video , also because we have certainly not spared resolution (1024 * 768) or level of detail (at full speed and without discounts). I go back to playing imgI think it's not difficult for anyone who has had the patience to get this far to understand that I'm enthusiastic about MM2. The few limitations that I encountered during the test do not in the least affect the fun that the title ensures to those who try it, so now I'll go back to riding my beloved dusty tracks. I recommend: lights on, even during the day; helmet on head, well fastened; and caution, always! Winning team does not change This was probably the philosophy that guided the programmers of Rainbow studios when making the second episode of the successful Motocross Madness. If this were not the case, perhaps this new episode would not have been as interesting: the improvements made to the first title have made MM2 a beautiful and fun title.", "date": "2001-04-30", "grade": null}