{"name": "Might & Magic VIII - The Day of the Destroyer", "ref": "https://multiplayer.it/recensioni/might-magic-viii-the-day-of-the-destroyer.html", "text": "That certain little pain in the neck Your party effectively acts as a single person with two legs and ten arms (and a serious neck ailment I would add... for reasons you will understand later): in fact, being all in first person, your party (at most 5 characters) will be united in a single ~entity~, so they will move together (imagine 5 people glued elbow to elbow... that's it!), etc. etc. The serious discomfort in the neck derives from the fact that in MM8 you will not be able to use the mouselook (i.e. control the inclination of the gaze with the mouse).. you will have to resort to the traditional method to raise/lower the gaze.. From the point of view of the rules system , each character is characterized by a series of skills that will influence the success of operations such as the disarming of traps or the power of spells. At each level up you will receive a series of points that you can distribute as you see fit. There are also various levels of knowledge for skills, in fact one of the (few) functions that non-player characters will have will be to improve your level of knowledge (expert, master or grandmaster). In this regard, a small parenthesis should be opened: according to the particular conception of Might & Magic, in the cities you will see a number of characters bouncing from part to part of the city without a fixed destination. If you try to talk to us you will not get anything concrete except the usual sentence of circumstance. In the houses you will find either the various coaches mentioned above or other NPCs who will entrust you with missions, the rest will limit themselves to saying phrases of dubious utility. Which is a bit humiliating for the NPC ~class~.. if there was a union of NPCs, they would undoubtedly go on strike and push for the redefinition of a contract with ~working~ conditions more suited to their situation! The actual game consists in solving the various missions that the characters will give you, which can be reduced to two types: ~go there and kill everyone~, or ~go there and recover this object (killing everyone along the way) Of course the Might & Magic series has the famous tradition of often putting you in front of tons of enemies at the same time (imagine a first person Diablo...)... Luckily for you combat can be done both in real time (and Might & Magic turns into an additional .WAD for Doom or rather Heretic 1) which is turn-based where you can better ~plan~ what to do. And actually there is a certain perverse pleasure in facing hundreds of enemies with the most colorful liveries.. . The Brawling Ogre Finally, the game we tested was completely translated and dubbed into Italian. Nothing to say about the quality of the translation, except that the language used is a bit out of context and has an average quality given that the translation seems to have been carried out rather to the letter, but not having the original texts available it is difficult to express oneself. However, there is something wrong... and it mostly concerns the ~system phrases~: when the character ~Dude~ wounds the enemy ~Dad~, ~Dad wounds x damage Dwarf~ or ~Dad. rolls x~ will appear damage Caius~ (when you hit an enemy with a ranged attack). The rest goes more on the comic let's say: you will find yourself facing the fearsome ~worker wasps~ or the ~brawling ogres~, or the animal rights activists and wild animal rights activists. In conclusion, what to say about this Might & Magic? In light of the current production, one gets the impression that the making of this product has something amateurish about it. But the winning team does not change ... In short, this title is recommended only for those who appreciate this kind of games or have played the previous episodes and want more: if you are among these lucky ones, then you can ignore any criticism expressed so far and rush to purchase Might & Magic 8. And that's eight. The Day of the Destroyer is the new installment of this popular video game series. The Might & Magic series draws its origins from the same reason that animated the birth of many other very famous series, namely the attempt to imitate the tabletop role-playing game on computers / consoles. In fact, during the early 80s (the era in which the first Might & Magic dates back) tabletop role-playing games such as AD&D spread. Simultaneously on the PC there was the advent of games inspired by the tabletop equivalents, games that were almost all destined to be the progenitors of long series of video games. In fact, at that time Ultima 1, Wizardry 1, the first Gold Box games from SSI were released. controversial~. The Might & Magic seriesis not known for having brought about great innovations, on the contrary the gameplay of M&Ms has been substantially unchanged for over 20 years (whether it is an advantage or a defect depends on one's tastes), but more than anything else due to a very strange phenomenon: the Might & Magic ~of 'modern era~ (from the sixth onwards) have almost all been mistreated by the critics but every year, punctual as always, we can swear that in addition to the Tomb Raider (n+1) we will also find a Might & Magic (n+1), a sign that even at the expense of the actual value of the title, it is a series that sells enough to be able to justify a sequel. But what is the actual value of Might & Magic 8? At a first glance (but also at a deeper one) it would seem like Might & Magic 7 with a different user interface and some improvements, but... also M&M7 was basically an ~M&M6 with a different user interface~. For the transitive property (forgive the professional deformation, but Mathematical Analysis I is at the gates!) it ~follows~ that also M&M8 is practically an M&M6 with some improvements. Astute observers will surely have noticed that almost nothing has changed between M&M6 and M&M8! Might & Magic 6 came out 3 years ago or so and even then it featured the same engine that the eighth episode puts before us. In particular, the MM6 engine is one of those that were called in ~false true 3D~, i.e. a mix between polygonal 3D and sprite 2D: a legacy of the era in which it was too expensive to have PCs calculate even drawn characters through polygons. So in Might & Magic 6 we will only have the landscape and polygonal buildings while the various creatures on the screen are rendered using the old method of the two-dimensional sprite drawn in the direction of the 8 main directions (i.e. taken from the front, in profile, from behind, etc. etc.). The problem is that the graphic engine of Might & Magic 6 was already old at the time it came out (Quake was a consolidated reality at the time and Duke Nukem 3d or Daggerfall (games with the same kind of 2d/3d graphics but better) were been out for a long time). So today in 2000 it is simply unacceptable for a game to present itself with a genre of graphics that has been abandoned for almost 5 years! But as if that weren't enough the REAL problem is that MM8's graphics are just.... ugly! Forget the beautiful landscapes seen in Daggerfall, here each house will have the walls covered by the same texture and since it will be literally impossible to find where the entrance is, you will often have to go around the whole building due to the uniformity of the coloring. Let's not talk about the rest of the landscape.. the lawn? An immense green board, just a few steps higher than the old EGA flight simulators (eh well the MM8 one is textured! Do you want to put?). And the various characters on screen? Perhaps some of you will remember the old games for Commodore, Nintendo or other 8-bit systems where as you progressed in the game you found the same enemies but with different colors (all this was done because there was not enough memory to use other sprites , so to save space, it was enough to change the palette of colors used, to get something different)? Exactly so it is from the sixth episode that it is like this in Might & Magic: there are various ~families~ of monsters, whose most powerful versions have different colors (for example the ~shack~ model pirate will have a white bandana, while the deluxe will have a red bandana and so on). But don't despair: in Might & Magic 9 we will finally have a fully polygonal engine! After all this interminable discourse on the graphic aspect... you will say to me: ~Oh well, but a game, especially a CRPG (or at least presumed such) cannot be judged only by the graphics..~. ~Precisely!~ I would answer! In Might & Magic you will take on the role of an unknown adventurer from the continent of Jadame, the ~frontier~ land of the world of M&M: a sort of fantasy meltin'pot in which a swarm of races find themselves living together. Without an unspecified reason, such an Escaton (~the destroyer~) is threatening the very existence of the world of Enroth (Come on, Escaton! Come on, you can do it! ...don't look at me like that, I'm kidding!). He is in fact the architect of the creation of a series of gigantic crystals, located in the various corners of the continent, which have caused the opening of a series of portals with the elemental plans, from which the invasion of the world of Enroth is taking place! Yours will be the task of stopping the cruel Escaton. We immediately observe a substantial difference with the previous episodes: instead of starting by creating a party of adventurers, in MM8 you will only create one character and the others you will recruit along the way. You can also impersonate or find non ~traditional~ characters such as vampires, trolls, dragonsi or necromancers, also endowed with characteristics that make them unique.", "date": "2001-04-30", "grade": null}