{"name": "Soldier of Fortune", "ref": "https://multiplayer.it/recensioni/soldier-of-fortune_a.html", "text": "SoF finds its strong point in the single player session, the various chapters of the game are therefore connected to each other by a plot which, even if it does not reach the glories of that of Half-Life, performs its task well which is to bind the various episodes of the game. The title of the game, Soldier of Fortune, is taken directly from a famous American magazine (also available in Italy, in some specialized newsstands) which deals with soldiers of fortune, mercenaries and the various guerrilla events that take place in various parts of the world. so this is already a good clue to understand what the game is about. An important role in the development of the game was played by John Mullins, currently a military ~consultant~ and with a truly impressive past of military missions and a true muse of Raven in the development of the game, so much so that he was chosen as the protagonist of the game. In the game you will therefore find yourself in the role of John Mullins having to recover stolen nuclear bombs and to counter terrorist groups in various areas of the world. SoF has been created using the Quake 2 engine, suitably modified, an excellent job has been done with the textures that are of remarkable quality and with the dynamic light effects that reach levels never seen in any other game based on the Quake 2 engine. Quake 2. But the strong point is the GHOUL Rendering System, a new animation system adopted by Raven which makes the animations of the characters extremely realistic through the use of 26 ~Gore Zones~ positioned in the various points of the body of all the characters present in the game. This system introduces new gameplay opportunities and tactics. At first, as soon as I tried the game, this animation system didn't impress me that much, but then on closer inspection it revealed all its potential. In fact, you can shoot at any part of your opponents' body and see the effects that the shot produces. A close shot to an arm, for example, will cause its amputation, the same goes for the legs and head, while a shot at a longer distance will only cause the wounding of your victim and you will see him writhe on the ground in pain. But the thing that impressed me the most was when I tried to shoot the weapon my opponent was holding, it fell to the ground and as soon as he found himself unarmed he started begging me. Let's now review the SoF paraphernalia, the basic weapon is a dagger, or rather to be exact there are 6 daggers that you can also throw, a well-aimed blow can get you out of trouble if you are out of ammunition. Then there are 2 pistols, one 9 mm and another of a larger caliber, the first very effective for more distant targets, the second lethal in close combat. The shotgun, the classic shotgun, has proved to be one of the weapons that give the most satisfaction in close combat, it has a deadly effect on your opponents by literally tearing them to pieces at close range, it proves to be ineffective at long range. Another weapon that proves to be irreplaceable in the game is the sniper rifle, it has a very powerful zoom that allows you to hit targets at very long distances with millimeter precision, just to give me an example you can blow away the helmet of a soldier who is tens of meters from you. Then there are 3 types of machine guns, one of medium power, another with a silencer (very useful for not being discovered) and the third extremely powerful capable of mowing down a group of soldiers in a few seconds. Complementing the conventional weapons featured in the game are the classic rocket launcher and flamethrower that causes untold suffering to your opponents by turning them into real human torches. Then there are 2 unconventional weapons, one is a kind of rifle capable of shooting very high speed projectiles, and the other is a microwave rifle capable of literally cooking your opponent as if you put him in an oven. micro waves, and in secondary fire mode you will see it literally explode. Another aspect that I didn't really like about the game is the excessive demand for RAM, if you have ~only~ 64 Mb you will have to resign yourself to not really short uploads with sporadic uploads even during the game. A suggestion for those who have 64 Mb of RAM, avoid putting the audio at 22 kHz and 16 bit, leave it at 11 kHz and 8 bit, otherwise it will be constantly loaded during the game and therefore completely unplayable. In conclusion I can say that SoF proves to be extremely enjoyable in single player, if you are a FPS lover and you are tired of killing the usual monsters SoF is the game for youOne of the most talked about games of recent times due to the extreme violence present in the game is finally available, and the fame that has been made up to now, once you try the game cannot be denied, candidate to become one of the most violent FPS ever.", "date": "2001-04-30", "grade": null}