{"name": "Midtown Madness 2", "ref": "https://multiplayer.it/recensioni/midtown-madness-2.html", "text": "Today Here Microsoft effectively releases a sequel to its highly enjoyable racing game even if the word sequel turns after a while into the Anglo-Saxon saying ~more of the same~ since the differences compared to the prequel are reduced to 2 completely new cities (San Francisco and London), 6 game modes (4 of which via the Internet via tcp/ip protocols or via Microsoft's MSN gaming zone service, not counting the game via LAN), new vehicles (police cars, buses, trucks, etc) and some miscellaneous tweaks. Let's analyze the play package in question starting from Graphics engine and sound department Let's start with the recommended requirements which, in my opinion, are the minimum for at least a fair enjoyment of the title: P2 266, 64 mb of ram and 8 mb accelerated video card which fully supports Direct 3d; to have good fluidity, with a good level of detail and a moderate visual depth you will need a P3, at least 128 mb of ram and a 16 mb accelerated video card given that at 800x600 with all the details at maximum my P3 500, equipped with G-400 max and 256 mb of ram it showed some snaps to scream at the scandal, if it weren't for a good overall fluidity (we are on the average of 26 fps). Going to analyze the graphics of the game in more detail, I can say that the Microsoft programmers have obtained the broadest horizon ever seen in a racing game, including Namco's Ridge Racer V, which makes me doubt that the graphics engine is the same as the prequel The selectable vehicles, present in a more than fair number without counting those to be unlocked, are well made with a convincing refraction effect and a sufficient number of polygons to avoid my usual (and perhaps fussy for someone) tinkle that comes though for all the other vehicles in motion, which also includes pedestrians, made fairly better thanks to the better behavioral routines compared to other bad examples such as those of Carmageddon 2000. The backdrops are overall well done, given that the monuments, bridges, houses and skyscrapers have benefited from a truly noteworthy treatment from the point of view of fidelity compared to the real counterparts with textures of an all in all discreet workmanship (perhaps a little less than the London underground) and note of merit to a whole series of gems such as traffic lights that you can throw down like pins and the different climatic conditions such as fog and rain which together with the possibility of playing in the morning, afternoon or night show a minimum of effort to make the races as boring as possible. The views available are the canons of the driving game genre, so we have the external ones (close or far), the one with a steering wheel and dashboard (which is not in the least comparable to the one in V-Rally 2) and the internal one (my favorite since the Ridge Racer coin-op came out). Analyzing the sound side, we must say that once again the music is below the average of this genre of games since there are no melodies of those that are no longer forgotten as per tradition of racing games (one above all: passing breeze of the legendary Out Run!), making you opt for the choice of one of your audio CDs or well-made noises of the metropolis, above all the noises of the means available, each one different from the other! Playability and longevity Before analyzing the 6 game modes, it is good to spend a few words on the artificial intelligence of the vehicles that populate San Francisco and London: they stop at traffic lights, they follow their lanes but... they don't care what you do! To clear my doubts following a collision with a taxi that was going in its lane without trying to dodge me in the third round of the blitz mode, I redid the same maneuver 3 times in a row and all 3 times the taxi continued with the driving at medium speed... if you then take into account that you can set the traffic yourself and that it would be most fun to set it at motorway congestion levels (limits of the PC in question permitting), it is also true that frustration could cause peek, especially if you don't reach a checkpoint for a measly jailer. After this long analysis of the I.A. of your fellow citizens and not, let's move on to the available game modes: Cruise gives you the opportunity to roam freely through the streets of the 2 cities included in the package (sometimes it can also be pleasant, but it is certainly not the best mode present therein); Blitz will test you against the clock, as you will have to reach one checkpoint after another before crossing the finish line, thanks to an arrow that will always indicate the position of the closest checkpoint and in this mode your opponent will be the only traffic ; Checkk is an identical mode to Blitz but here you will have to deal with rivals; Circuit (as the name suggests) presents various races within the most disparate areas of the 2 metropolises and is perhaps the least intriguing of the available modes being the most rigid in terms of structure, being able to run only in the unfenced areas of the city; the crash courses, which are used to unlock the extra vehicles, are different tests depending on the city that put us in the shoes of new taxi drivers or stuntmen; unlike the latter mode for single game only, Cop and Robbers is the exclusively online mode that makes you participate in a kind of hunt for the gold bar that in a completely random way will be found in one area or another cities waiting for the lucky one to find it. Beeeep, beeeeeeepppp! Overall, the Microsoft title is not bad at all but the graphics with ups and downs, almost non-existent music, 2 cities that know each other inside out in less than a week of play and some weak modes (cruise and circuit) do not help the longevity of the title, although the ~treasure hunt~ mode in multiplayer mode can only help her. A good game that would be great if there are extra maps, modes and cars available for download....knock knock, is anyone at Microsoft? One year ago It's been a year since Microsoft released Midtown Madness, a driving game as funny as it is bizarre in which you had to compete in the very busy Chicago, passing checkpoint after checkpoint before your opponents. Equipped with good graphics (which in any case cut the legs of those who owned older computers, given the heaviness of the graphics engine) and a faithful representation of the famous American metropolis, the Microsoft game was struggling in the longevity sector, given that only one city for may seem immense at the beginning, it can't resist 2 intense days of online and offline games and the lack of expansions to follow made the game branded with a phrase that makes the editor so cool like ~too bad, it will be for the next occasion~ or ~ any sequel will certainly have more meat in the fire~ and the like.", "date": "2001-04-30", "grade": null}