{"name": "Romance of the Three Kingdoms 14 Diplomacy and Strategy Expansion Pack", "ref": "https://multiplayer.it/recensioni/romance-of-the-three-kingdoms-xiv-diplomacy-and-strategy-expansion-pack-recensione.html", "text": "Although it is relatively little known in our area, translated a few times into English and mostly in its PC versions, the Romance of The Three Kingdoms series is one of the most appreciated by that slice of the public passionate about Chinese history and strategy. Last year, with Romance of The Three Kingdoms XIV, Koei Tecmo wanted to offer it also on PlayStation 4, with its dizzying succession of wars, alliances and betrayals, but in a significantly simplified form in terms of controls, and with a handful of new options to make the experience smoother. And now, after about a year, the software house releases an expansion to further expand the experience of players in the Three Kingdoms: here is our review of Romance of the Three Kingdoms 14 Diplomacy and Strategy Expansion Pack. A new mode and new scenarios For all the details relating to the base game, we refer you to our review, while here we prefer to focus on what the contents of this DLC are. Three, in this sense, the main additions introduced: the first is the new War Chronicles mode, which adds five new short scenarios on the battlefield, each including original unpublished events, plus the possibility for players to be able to take command of forces that cannot be chosen in normal scenarios, such as Zhou Yu in The Battle of Chibi. This session is characterized by the presence of more arcade mechanics than those of the base game, with reduced missions and fewer management elements to consider. At the end of each scenario, among other things, the players receive a score determined by the way they conducted the game, and therefore taking into account factors such as the turns used, the number of orders given or how many times a tactic was performed coordinate, and so on. A decent addition to vary the scheme of the main game, but nothing more. More interesting is the second introduction in the Diplomacy and Strategy Expansion Pack that concerns four new scenarios, thanks to which videogamers can interpret warlords active during different time phases, and relive other moments of the war of the Three Kingdoms, opening different paths for their respective attempts to unify China. With The Intentions of Two Yuans (October 191), the user witnesses (and participates in) the collapse of the Anti-Dong Zhuo Coalition, while in The Battle of Chibi (October 208), also known as the Battle of the Red Cliffs, at the decisive clash between the Chinese Empire of the Han dynasty and the army of warlords Liu Bei and Sun Quan. In The Conquest of Liaodong (July 219), the player is involved in the events related to the alliance between Wei and Wu to prevent Guan Yu from advancing north, as well as in The Conquest of Liaodong (January 238), in the subjugation of Gongsun Yuan, the King of Yan, by Sima Yi. In addition to the classic events, players can also customize and recreate their own highlights with the new Event Editor, where you can mix and match backgrounds, background music, messages and officer images. Traps and trades Finally, Romance of the Three Kingdoms XIV Diplomacy and Strategy Expansion Pack also offers novelties in the gameplay area, to further expand and diversify the campaign. With this in mind, for example, new buildings have been added, for a more specific topography, a calendar that allows you to reflect on previous activities in the game and, above all, new features related to officers and tactics, including a new function that allows you to sabotage structures on the map and even to set traps. Also included in the expansion pack is the ability to trade with the great Eurasian empires such as Rome and India. Of course, the interaction is limited only to this aspect, but it is undeniable that their presence fascinates and perhaps opens the door to new possible future scenarios for the saga. On the other hand, the approach granted by the developers to contacts with foreign tribes operating in the neighboring regions is of a different nature. Now it is in fact possible to fully interact with the tribes of Wuhuan, Xianbei, Qiang, Nanman and Shanyue. In this way the game opens up new fronts to which the player must pay attention: focusing on the war in the central areas of China must not distract him from what may be happening behind him. Sending subjects to develop relationships and open trade with foreign tribes can prove decisive for the continuation of the campaign. Not only because it can ensure stability and avoid wasting military resources on several fronts, but also because it allows for certain geographical advantages to be acquired. For example: the conquestof Yo Province allows you to form friendships with Wuhuan, while conquering Bing Province to forge strong relations with Xianbei. Alliances and loyalty always remain two of the most important elements of the game, as they can often literally decide the fate of a campaign. The use of diplomacy to cement agreements with other groups is crucial, as well as strengthening ties with one's officers is essential to control and develop an area, as well as avoiding betrayals during war. Just as strengthening ties with your officers is essential for controlling and developing an area, as well as avoiding betrayal during war. Once you've established strong relationships with or conquered tribes, an Outlander Officer will join their forces. These are extremely powerful officers who use the Siyi formation to gain the upper hand in mountainous areas or forests. Each tribe is assigned a unique trait: Qiang officers, for example, can activate cavalry made up of skilled archers, while Xianbei officers are equipped with the ability to lead war chariot units.", "date": "2021-02-16", "grade": "6.0"}