{"name": "Soulbringer", "ref": "https://multiplayer.it/recensioni/soulbringer.html", "text": "The snow is falling, but what does it do.. The story takes shape during the Dark Ages of Rathenna, during the fall of King Horath's reign. The entire city of Talendrah was destroyed and with it the nobles of the city. The Crown is taken, and with the disappearance of the last Warlock Tamaran, the magic present on the continent disappears as well. As if that weren't enough, after a short time King Horath VII dies, leaving the kingdom and what little remains of it to Rafaela, his daughter. After the mysterious disappearance of the new regent, the royal dynasty ends, leaving the cities of Ravenscar, Madrigal and Shadowguard in ruins at the mercy of the brigands. For his part, Cardinal Mortan also takes part, who goes mad and murders his followers and the pupils who attended his studies in Ravenscar, with the power of evil he creates an army of undead who make the city theirs ~ headquarters~ occupying unopposed all the towns in the area. The city of Madrigal bordering the south across the mountain pass erects a barrier that forever isolates the cursed Ravenscar. After fifty years it seems that evil has left Rathenna for good but (there is always a but) Galdon Thor resurfaces in the ocean, as evidenced by the sailors who have glimpsed it among the waves. It was in ancient times the center of power of the powerful League of Six. The snow is falling, but what does it do.. Evil has now descended on the world of mortals, as evidenced by the frequent attacks on the city of Tortalan brought by an army of vampires led by the cruel King Lightstealer, who with the passage of time increasingly consolidates his power over the adjacent lands. Empress Cerebella herself transforms from just ruler into terrible tyrant, depriving the earth of its resources, and setting the stage for a war of devastating proportions. It seems that, just like Harbinger, the world needs a hero who can drive out evil once and for all and lead the people of Rathenna into a new age of peace and prosperity. And who could it be? Well done you got there, in fact...~...it was the coldest of all winters, and I was at the bedside of my dying father. - Go to my brother...here is the map of the city of Madrigal.. .- And here I am on a journey, starting from Kalaran towards a distant and unknown land, armed only with my courage...~ Here are briefly the events that introduce you to the game and if we certainly don't distinguish a great originality, they still leave a question mark: who is the figure fighting a demon in a mysterious tower that disturbs your sleep? These and other doubts will creep into you during the game and this can only be a positive point, given that it's hard to resist without knowing the reason for so many mysterious events... here's a good reason to go all the way. But now your first goal is to find Uncle Andrus, your new guardian. So, after thanking the ferryman who gave you a lift to the Madrigal pier, you are about to set off on your adventure. The story is over Soulbringer presents itself as a dark RPG with Adventure cues: the dark atmosphere that hovers in the land of Rathenna is seasoned with twists in the unraveling of the plot that promises to be intricate and long. Along the course of your wanderings you will meet and face various enemies, drawn from the classic fantasy ~bestiary~, therefore brigands and assassins but also evil creatures such as gargoyles, vampires and rock monsters which will be joined by hosts of undead in the form of zombies and skeletons. That's all? Not at all: there are also the bosses of the League of Six, very powerful beings who have emerged from a forgotten past ready to make the world their party banquet. To start you will have on the screen everything you need to keep your character under control. The game screen is divided into three parts: the actual game window with a view that can be rotated at will, a menu at the bottom where the compass is located, the inventory access icon, the 2 classic health/aura bars ( mana) in red and blue respectively (there's also room for the health of the opponent we're dealing with...useful!), a button for the options and the icon to access the character's characteristics screen. Finally there is a vertical bar on the right called the action bar, which is worth spending a few more words on. In fact, from this menu you can interact with each object in your possession, performing all the actions required for it. Suppose we select the food icon: for example, de will appear at the topl bread and automatically under EAT; select the icon of the particular objects, you will see a key and more under OPEN, and so on. The story is over happy? No more Hamletic doubts like ~What do I do? I throw an apple at my opponent? Or do I try to break into a door with a healing potion?~ Life is easier with Soulbringer! Another idea that pleasantly struck me is the possibility of creating ~combos~, i.e. sequences of actions to be performed in combat. Entering the special menu you can create up to 10 combos (for a maximum of 15 actions each, interchangeable as you like) by dragging the name of the action in the central column with the mouse and that's it! My first combo, renamed ~Contropelo~ for the occasion, consists of two normal cut strokes with the dagger, a low cut and a lunge and I guarantee you that it works..at least at the beginning! The beauty, however, is that the choice of actions is not restricted only to those of weapons, if you want you can integrate the evocation of a spell, the use of a healing potion, shooting an arrow and more. At the end you can recall your sequences simply by pressing the keys from 1 to 0 on your keyboard. Very comfortable! Mind you that this is not just a diversion to make the combat more interesting but a vital factor for survival in the brigand-infested moors. In fact, when we see an enemy, what is more natural for us to do? Naturally click at breakneck speed to give him many good blows ... nothing could be more wrong! Every time you click the left button, which is used to perform almost all actions, including moving and attacking, the system recalculates the movement from scratch. In this way, if you strafe five clicks on the opponent, you not only don't give him even a blow, but you stand there motionless letting yourself be pierced from side to side! Luckily over time you will get used to it and you will discover that fighting is not impossible... the secret is all about finding the right weapon for the right enemy. In fact, trying to skewer a skeleton won't lead to great results, but hitting it with a club will clearly change the match in your favor. To do this you will make use of the most varied attack strategies and weapons (there are so many! More than 50 weapons in total, between normal and magical). Study, grow and work Initially you will not have knowledge of the magical arts but you can make up for it soon, starting to read the spell books that you will find in particular places called Manors. These places evoking the mystery are scattered and hidden somewhere and must be found thanks to a special compass donated by Uncle Andrus which always points towards one of these ~centers of power~, the one that ideally is closest to you. Read these books avid adventurers, and you will be initiated into the magical arts of the elements: fire, earth, air, water and spirit which together form your Seculorum, or rather a sort of inner balance which varies according to the magical energy conveyed to a given element . Think of it as a kind of specialization that will reflect on your resistance to a given element and the magic connected to it. There are also very special books such as the book of Knives and that of Arrows, which add spells directly linked to the nature of their name. In the same way, the distribution of experience points earned by solving minor quests or by killing opponents must be as accurate as possible, given that the basic characteristics of the character (strength, speed, combat, health and magic) will already determine from the second level (you can get up to It's a game for gourmets, and you'll understand it also because dealing with the merchants is difficult.You'll never sail in gold, on the contrary, to be able to afford a weapon that is not your initial potato peeler you will have to sweat seven shirts for scrape together some cash.But the road to glory can't be paved with gold, can it? Graphically With a touch of sarcasm it can be said that if there is a sensation that the creators of Soulbringer have managed to visually convey, it is that of poverty and solitude in which the world around you is pouring. The environment is bare and desolate and the 3D engine that creates it could be exploited more, not limiting itself to some light effects for spells and a bit of interpolation on the characters. Mind you, the view rotates smoothly at your command and system the ~virtual camera~ always in the right place and it must be said in defense of the programmers that such a choice does not castrate in the bud the possibility that the game will be used by those who canand less powerful machines, therefore accessibility to a large number of people. Furthermore, the movements of the characters are in motion capture, a technique that will please those like me who prefer lean and precise movements, also by virtue of collision routines calculated to the thousandth. The textures that cover the landscape are sometimes approximate, both in terms of colors (sometimes few and repetitive) and in how they are treated ... you can also raise the video resolution but you will only have shovelfuls of pixels surrounding you everywhere you go, but you will end up forgetting them behind you, the more you play with it. Then there is darkness that extends in all directions about 20 meters away from you, beyond that is nothingness. Another gimmick already known to mask the shortcomings of a graphics engine which, although fluid, is slightly below average. Purists of pumped-up graphics and those chasing the latest 3D card on the market will be able to turn up their noses and it seems right to me to warn them about the anti-aesthetic aspects of this RPG, but it should be remembered that in any case it does not make for ~extreme~ aesthetics an absolutely necessary strong point, favoring the aspects already discussed before. As far as the sound is concerned, I think that the music is a bit absent, except in key moments (and there it goes very well) and the sound effects will accompany you sporadically. All, however, topped off with an ambient sound that will surround you (the storm around Madrigal will make you want to wear a sweater...^_^). The localization is completely in Italian (text and speech) and overall it is enjoyable. For those who don't hold back I'll continue with the minimum system requirements: Pentium 233 Mhz with 32 MB of RAM, 500 MB of HD space plus the usual stuff. Recommended a SB Live for 3D sound .. these are the official data. I say that a mid-range P2 will be enough to run everything but I would significantly tweak the RAM by recommending AT LEAST 64 MB (the usual rule, the more the better) and if you can, the full 1.3 GB install which will take away your continuous access to the CD player for the dialogues. In conclusion we have in our hands a game that doesn't make you cry out for a miracle for technical realization and suffers in some points from a bit slow rhythms, but if you are willing to be indulgent enough on these points, if you are patient people and you manage well to get into the right atmosphere you will probably go beyond the first impact, rediscovering an intriguing and engaging game over the hours by carving out a space of your free time every day for this dark and damned beautiful Soulbringer. The missed opportunity There is a category of games known as ~missed opportunities~. They are those games that could stand as masterpieces but due to several small flaws they risk going unnoticed. Let's try to understand together why Soulbringer is part of this group, and above all why we must not leave him alone.", "date": "2001-04-30", "grade": null}