{"name": "Scrabble", "ref": "https://multiplayer.it/recensioni/scrabble.html", "text": "speaking Who has never played Scrabble? Of course, that board game in which one to four people can challenge each other to compose the greatest number of words on a grid using randomly drawn tiles. Already converted several times into video game form with little success, Scrabble was finally chosen by EA as a title for mobile phones, with a move that proved to be at least spot on. Everything is like in the original board game, including scores, bonus boxes and the ability to change letters if necessary: the only small note that can be made in Scrabble lies in the limitation of word control, limited to seven characters : any composition that exceeds this quantity is therefore not checked by the game. However, the EA production deserves applause especially for the excellent compatibility of the title with mobile support: playing Scrabble on mobile is simple and fast, thanks to an extremely functional control system and a clear and complete interface. the board occupies most of the screen, while on the lower side you can see your set of tiles and on the upper side the scores of the two players take position. speaking And precisely with regard to the type of user Scrabble is striking for its completeness: in fact, it is possible to play both alone and against the CPU, or by challenging a friend in the Pass and Play mode, in which - quite simply - you take turns on the same device. A series of apparently obvious elements, but which have rarely been implemented so well and which in Scrabble stand out particularly given the peculiar play structure. The game works so well on mobile phones that it really seems to have been born on the same support: composing and crossing words proves to be an excellent pastime that finds its rightful place on a mobile phone display. Furthermore, the apt auto-save function preserves the pick and play character of the product, seen and considered as when you exit the application the game in progress is recorded and can be resumed at any time. Small details that put together contribute to making Scrabble a surprisingly pleasant and engaging experience, a rare fact for a vidual conversion of a board-game. The roundup closes with a clean cosmetics characterized by a sober and elegant color palette, while the sound is limited to some minor effects. Game tested on Nokia 6630. Comment Scrabble on mobile phones is one of the few examples of board game that also works great on electronic media: this above all thanks to the perfect compatibility of the board game mechanics with the hardware, capable of combining clean and functional graphics with a extreme portability, not to mention an intelligent multiplayer design. Appreciable alone and very entertaining in company, Scrabble is therefore an excellent example of what mobile entertainment should be, as well as a paradigm for the next conversions of board games. Pros Fun and engaging Excellent conversion from the board game Clean and functional interface Cons Almost no sound Missing an option for 4 players The latest product from EA Mobile is none other than the mobile phone version of the famous board game Scarabeo, originally Scrabble, to be precise. Although it is legitimate to initially turn up one's nose at yet another electronic incarnation of a board game (traditionally not exactly fertile ground for exceptional quality titles), in this case Scrabble definitely deserves a little more attention...", "date": "2006-11-27", "grade": null}