{"name": "Stunt GP", "ref": "https://multiplayer.it/recensioni/stunt-gp.html", "text": "The game is serious business. And who said that? One of the absolute funniest games I've ever played is Mario Kart from Nintendo. Well this is one of those absolute videogame miracles, after all it is a technically modest game, but it is also one of the games that receives the most acclaim in the absolute sense, even in the public not accustomed to video games. In short, a true miracle of digital entertainment! Who knows how many of you have happened to start playing and spend hours with friends challenging each other with Mario Kart. I bet many And have you ever wondered why this enormous success? I've always attributed it to its simplicity and incredible playability, after all Mario Kart is an immediate, fun and engaging game. It only takes a few minutes to learn the game mechanics and practice the controls. Now let's go back to the previous discussion, PC vs Console, to say that it is clear that this is one of the classic examples in which the console doesn't win but wins hands down. Sitting comfortably on a sofa and playing on a large TV while munching or drinking something with friends while taking turns at the controls is a completely different thing from taking turns in front of the cramped monitor of a PC. Can't you find? Well at this point you will surely have understood that Stunt GP is nothing more than a ~clone~ of Mario Kart, but this is not meant to be a negative judgment, on the contrary! Being compared to one of the most beautiful games ever is nothing more than a compliment, especially considering that the result we have before our eyes is of excellent workmanship. But now let's get into the purely technical discourse. Team 17. When the name is a guarantee I remember them from the epic days of Commodore Computers and they were synonymous with well-crafted arcade games. It is very pleasing to see that time has not changed them and their latest effort deserves particular applause. Then the recipe is very simple, take the old car tracks, full of parabolic curves, bumps and crazy jumps and insert them into our powerful 3D cards, add effects and textures, fry with a good sound and serve hot. I'm sure you'll make a great impression, just as Team 17 did. In reality, there's not much to say about the game, given the extreme simplicity of the plot and context. The game modes are the usual singleplayer and therefore we will find the classic Arcade mode, a trial mode, one against the clock, one called acrobatic and the championship. The latter is the main mode of the singleplayer, since it is very articulated and it is the one that allows us to make upgrades on our dear electric toy car, thanks to the credits that we earn after each race based on the arrival position. Don't be afraid of any complicated adjustments, but only upgrades that change the parameters of speed, handling, Stunt (the car's ability to withstand bumps and rollovers) and electricity consumption. This last parameter is fundamental and covers a primary importance in the management of the tender. Let's try to understand better. The Stunt GP cars are electric and consume their charge during their performance, it is also possible to use a turbo mode, which increases the speed of our car, at the obvious cost of greater current consumption. If we run out of charge, our car will slow down drastically. Team 17. When the name is a guarantee Well at this point all that remains is to explain how our car is recharged during the race. As? Simple, just make a nice pit stop! There is a bridge, always placed close to the finish line and which crosses the track at right angles, where the car regains the lost charge inside it, obviously this operation also costs time, even if physically the car does not stop, but only slows down. So it is evident that the correct energy management during the race is one of the important keys to the final success. I will never get tired of repeating it, the game is deliberately simple, so no power-ups or missiles, just a damned fun ride! Another way to recharge the batteries is to perform stunts in the air that are performed thanks to a special button. This too is a lot of fun, even if you end up doing them more for the pleasure of seeing our machine perform these evolutions than for its actual usefulness. The digital enemies are not too bad, but after having taken their measures we will see them trudging in an attempt to reach us! But the real highlight of a title like Stunt GP is the splitscreen multiplayer for up to four players at the same timeon screen (provided you have as many control systems). Here we could beat each other up with our friends and longevity, which in Singleplayer is certainly at the highest levels, reaches considerable heights. Is the PC like the Dreamcast? The game will be available for both platforms, but unlike what usually happens with titles designed for a console and then ported to the PC, the execution is top notch. Above all, the circuits are beautiful, varied, well-kept, with lots of touches of genius, but above all fun! The cars are of different types and have unique characteristics, so we will find those suitable for pure speed or those that make resistance and grip their strength. Graphically they are well done, nothing striking, but they look good. The control system is easy and immediate, but above all the physics that governs them are very well done, seeing a car in full drift inside the curve is extremely satisfying. Music and sound, in a game like this, take on an important and fundamental value is their contribution. Also in this case Team 17 succeeds in the enterprise and provides us with a tasty mix of Rock and Techno music that goes perfectly with the type of game. Let's conclude quickly that I have to go back to playing!! Let's face it plainly, the gamer of 2000 begins to suffer from a strange syndrome: that of video game stress. What do I mean? Games are becoming increasingly sophisticated and demanding, then with the advent of online games they have become beautiful, but very, perhaps too much, competitive. For example, to race Quake 3 or Counter-Strike without being humiliated, you have to spend hours and hours training, not to mention simulators or strategy games. The result of all this? A lot of satisfaction and a remarkable quality of play, but also a lot of stress! So if you are among them, I suggest a videogame treatment based on Stunt GP, which makes simplicity, immediacy and above all great playability its best weapons. Defects? In reality there are none in the game, rather they derive from the PC, which as I have already said, is not the most suitable platform for this type of game. $1,000,000 question! Is it better to play a console or a PC? This is the classic question to ask in a NewsGroup if you want to unleash a good flame. However, it is undeniable the anger and frustration that many feel when they see that a box of a few hundred thousand lire attached to a nice 32-inch TV equipped with stereo sound churning out games that are much more entertaining than those that our dear (in the sense of expensive!!) and sophisticated PC is able to provide. How do I see it? Well it is undeniable that the two systems give their best in different sectors, but the main thing to evaluate is the game and not the hardware support on which it runs. Of course, each support has its own characteristics that enhance one typology rather than another. Well let's try to keep this last concept in mind, we'll come back to it later. In any case, let's end this general discussion and focus on the title we are going to review but which has a close relationship with what we were saying due to the simple fact that Stunt GP is nothing more than a typical console game but which also runs on our PCs . The result? Exciting! But let's continue without being in too much of a hurry.", "date": "2001-04-29", "grade": null}