{"name": "Lego Alpha Team", "ref": "https://multiplayer.it/recensioni/lego-alpha-team.html", "text": "A bit of history If you are a fan of video game and cinematic history heroes such as Solid Snake and Rambo (just to mention the most representative), it will be a real pleasure for you to drive Sprint, the first member of the Alpha Team at your disposal! When I alluded to the first member of the Alpha Team anti-crime team, I was referring to the fact that your first mission will be to find the members of your team, imprisoned at the hands of your arch-nemesis, or rather Ogel! In fact the 5 unfortunates, among which we mention Tritolo (who said he is one of the seven dwarfs, ehhhh??), Molecule and Lightning were caught red-handed by the perfidious Ogel while he was intent on his experiments with a mind control machine . Once the members of the Alpha team are freed, you can obviously take advantage of their peculiarities. Graphics and sound The minimum requirements to play with this new Legomedia production are: P2 233, D3d compatible 8mb accelerated video card, 32 mb of ram and Dx7 (in any case included in the package) while a P2 300 and 48 mb of ram are recommended; the game test was carried out with a P3 500, 256 mb of ram and GeForce DDR and, as expected, even with the resolution of 1024x768 with 32-bit color depth and all details at maximum there were no frame drops rate, which remains stable on 30-40 frames per second; the characters have obviously been made as if they had just been built from the now well-known bricks and the same goes for stairs, buildings, factories and machinery, all rigorously made up of Lego blocks! The music, taken directly from adventure and action films such as those of 007, cheer the gamer while he makes the gray matter work while the dubbing is typical of cartoons with so many voices that certainly those who (like me) are interested in voice acting will not be slow to recognize. Finally, the (few, actually) sound effects are well done. Playability and longevity Even if the game is for all ages, the target to which this Lego Alpha Team is aimed is obviously that of children aged 7-8 and up since a more mature user will certainly prefer games such as Sacrifice, Hitman, Deus Ex to this, moreover, more than discreet, video game. To explain the game mechanics properly, let's take a small step back in time towards the times of 16 bits and more precisely the underrated Lost Vikings by Interplay: the game, at first sight a very normal platform, was a kind of puzzle continuous where it could only continue with the cooperation of the joint peculiarities of the 3 funny sprites subjected to our wishes given that (just to give an example) if the Viking with the shield could parry a fireball thrown by an enemy, the other sprite, armed by sword he could instead eliminate him; going back to today we now have a very comfortable interface that allows us to change view using the mouse and keyboard, zoom in and out of the screen, use (and modify, rotate, etc, etc) objects of various types, as well as make your alters move or stop -ego. Before starting the adventure mode there is a nice tutorial with help from the Tee-Vee robot, whose voice, as mentioned a few lines further up, we will all have heard a bit in cartoons or TV films like the Muppet Show ! Obviously no less cartoonish are all the funny series of enemies you'll have to deal with, including zombies (you'll hate the ones who push barrels), guards, soldiers up to the evil Ogel, after a whole series of doors that you'll have to open , orbs you'll have to find and so much more! Conclusions Well done in graphics, acoustically cared for at the right point (music is certainly not the workhorse of this genre of videogames), quite amusing and certainly not very simple for those under 10 years old, it can be disappointing only for those who do not want to a game too ~childish~, but who among us does not yet have something of the child that was? Miiii, the bricksiiiiii, voioooo them! I believe that all, more or less, have had to deal with the legendary Lego constructions in our lives... it doesn't matter if they were houses, airplanes, castles, space bases or ranches, we have all left at least once in our life the greyness of the same to enter a world that ranged from parallel to the one we live in, however futuristic or alternative! However, times change for everyone, it is useless to deny it and therefore it is not surprising that Lego also produces video games suitable for children, teenagers and even, why not, parents of families. Already last year, (yes, it's already been a year since I've been here with all of you!!), we had clear proof of it with Lego Racer, an excellent clone ofSuper Mario Kart, which did well both in the PC version and in those for Playstation, Game Boy Color and Nintendo 64!! Let's now completely change genre with this Lego Alpha Team, which at first, once you take a look at the photos scattered here and there on the very special package, can give the impression of a clone of Hideo Kojima's masterpiece which responds to the name of Metal Gear Solid !", "date": "2001-04-27", "grade": null}