{"name": "Swat 3 Elite Edition", "ref": "https://multiplayer.it/recensioni/swat-3-elite-edition.html", "text": "Swat3 has a 3rd person perspective a la Quake3, but this is not a bloody shoot'em up, you are a cop and your main duty is not to try to kill people whether they are hardened terrorists or not yet identified suspects . You must be prudent, meticulous, attentive to everything around you, firm and decisive in your orders; Certain! Because you have great power over your men you can order them to search, break down and open a door, look around the most hidden corners, you can order them to cover you, to pick locks, all at your complete pleasure. Their AI is amazing, they will hunt down the bad guys and force them to surrender without ~a shot being fired~, applying the same procedure with the suspects. The same goes for the bad guys who arrive when a shooting is in progress and flee when they realize they are outnumbered, to be less meticulous than their virtual police alter-egos. Skirmishes are quick and deadly, you need to bring down your enemies by disarranging your team to be able to attack them on multiple fronts. One of the things that struck me the most was the personalization of the AI, oh yes! because from the options menu you can assign the AI of both your team and that of the terrorists to your liking via a cursor, really brilliant! The menu is then articulated through a series of choices ranging from graphic resolution, mouse scroll speed, game difficulty, musical sound volume, special effects volume and keyboard command customization. As soon as the game is started we find ourselves in the main menu from which we can access the mission mode where each level played is a case in itself; then we have the career mode in which your every success or failure will determine many variables to the game such as eg. the percentage of charisma exerted on your teammates, or the number of medals awarded and the overall score. But it is the section dedicated to multiplayer that takes center stage in this edition, offering us the game on the LAN or on the Internet. There are two types of matches for these modes: co-op and deathmatch. Both modes can be played by up to five players. In cooperative mode, players are part of a Swat assault team, the team is made up of a squad leader and four assaulters who can be players or computer-controlled characters; Mission objectives range from hostage rescue, protecting VIPs to maintaining security. In deathmatch matches players fight all against all and are organized into two teams the good guys and the bad guys and the objectives include both the ultimate survival and the elimination of the greatest number of opponents. In both types of games, the chat can clearly be used to be able to plan every aspect of the mission to perfection. Obviously the sour note for multiplayer concerns the limit of five players, on the net it is possible to read on the sites suitably equipped for this game many complaints about it, actually if we think of Counter-Strike ... If it were all ~roses and flowers~ In fact, my criticisms are painful and relentless. Poor interactivity with the surrounding environment, leaving out the classic opening of doors or the occasional breaking of some glass, it is not possible to interact with any other element that surrounds the environment in which we move; paucity of the quality of the same with clear reference to both the internal and external environments, but above all it is the interiors of the houses that are very scarce and sometimes poor in details. When working as a team, we sometimes happen to observe our colleagues at work and we notice with annoyance that first of all they seem to crawl and not walk on the ground and then when opening a door, for example, they remain very far away making the action seem unlikely . Sometimes I have not been able to understand the final outcome of the mission, that is, there is a discrepancy between the initial briefing and the continuation of the mission once the objectives have been completed; certainly a program bug that is difficult to solve, moreover occasionally they appear out of nowhere without understanding where from subjects that we are trying to track down or occasional passing individuals who in any case necessarily serve us in order to complete the mission show. If it were all ~roses and flowers~ Graphicallythe game is normal, without smudges and without noteworthy details, clean graphics with supported resolutions up to 1600x1200 special effects without great detail, tested with a Pentium III 733mhz, 128 mega ram and a GeForce Annilathor Pro 32mega DDR at 1024x768 not Has never shown slowdowns always smooth on every occasion. Overall, a game that without the aforementioned shortcomings would certainly have deserved more attention, I would like to remind everyone that it is localized, even if with some imperfections, in our mother tongue. It should be noted that for those who already own the original version of Swat3, the files for installing multiplayer support, also in Italian, are available on the Sierra website on the official page of the game, carefully divided by ~capacity~, for a total of 58mega if you know what I mean Almost a year after Swat3: Close Quarters Battle, Sierra releases this new version called ~Elite Edition~ which differs from the previous one for the addition of 5 new missions, multiplayer options and a set of tools dedicated to the community to be able to create new expansions; options, the latter all absent from the previous edition. As a SWAT tactical team leader you are in command of a five man team, in the year 2005 where an important peace treaty is about to be signed in Los Angeles, your job is to protect this gathering from anything oppose the city hosting the ceremony, be it terrorist groups or free citizens gone mad.", "date": "2001-04-27", "grade": null}