{"name": "Heroes of Might and Magic III", "ref": "https://multiplayer.it/recensioni/heroes-of-might-and-magic-iii.html", "text": "The Restoration of Erathia The mission to which you are called aims to recover the kingdom of Erathia, which fell into total chaos following the invasion of the dark forces and the occupation of the main cities of the realm. This is just one of the many campaigns at your disposal, which can be tackled at will and in the order you prefer. But how does all this work? The scale map of the world appears on the screen, with lands and wastes to explore. On this playing area you will move your heroes, which you can recruit at the tavern in the city. They will grow in experience and acquire new skills and mystical artifacts along the way, and to survive each of them will have their own troops at their disposal, which can be replenished by ~purchasing~ new creatures and putting them in the pay of your cause. When you meet opponents who will resist, the game view approaches the battlefield, showing the two armies lined up on the sides of the screen. In addition to this you will have to take a look at the cities in your possession, making sure you grow them both in quantity and in quality. At this point someone will exclaim: ~Hell, how do I keep everything under control? Simple, HOMM3 is a turn-based strategy game, so you have all the time you want to plan your actions. Once you decide the changes to make in the city , after having made your heroes move (you can have up to 8 of them traveling at the same time, plus those protecting your fortifications), after all the engagements of new creatures and the exchanges of raw materials at the market, with a simple click of the mouse you declare finished your turn and pass the ball to your opponent. Attention! Do not jump to hasty conclusions thinking that everything is a colossal beard, on the contrary! Talking about it seems more complicated than acting ... everything has been made very simple and intuitive, and even those who are not practical can immediately start improvising as a strategist of the most disparate enterprises.You can also try your hand at new Indiana Jones in search of the Holy Grail, sacrificing a movement turn to dig the ground or exploring the subsoil by entering from ancient portals (effectively doubling the size of the maps). In order to contain and deal with such vast adventures and situations, the events are told in detail by useful pop-up windows that excite the imagination and immerse you in the situation (do you know the old paper gamebooks or text adventures?). The graphics are very detailed and the sound spot on, with the music even changing within the same map, depending on whether your hero is in green plains or on snowy peaks. In terms of multiplayer, you can take advantage of the IPX, TCP/IP protocols, via modem and direct cable connection to challenge your friends and in addition you can have the ~Hotseat~ mode available, i.e. fight up to eight on the same computer, thanks to the turn based nature of the game...great! The game plays like in singles: while you wait for your turn to play, you can explore the map and view any available information displays. However, you cannot move your heroes, increase their supply, build in cities and make changes to the game environment. It's your turn when the screen bar changes to the color of your kingdom's flag; you are notified by a window and a specific sound. You can also ~chat~ with other players, simply by pressing TAB and writing the message, or send messages to a specific player, selecting it with the keys from F1 to F8. Think that you can also check when you want who is connected and who is not, and also at what connection speed he is playing, by displaying his ping on the screen ... in any case, the game takes care of checking itself every ten minutes. A truly noteworthy packaging should also be mentioned in honor of the production, containing one of the most extensive and detailed manuals I have ever seen plus the special color cards illustrating the tree diagrams of the constitutions and creatures in your possession. Obviously you can find everything completely localized in Italian, both game and manuals. 3DO online assistance and support are always present, a sign that the player is always taken into consideration and never left to himself. But I know you can't get enough of them, so it's time to talk about expansions... Armageddon's Blade (Data Disc 1) The first HOMM3 data disk is called Armageddon's Blade, a name given by the campaign-guide that sees you copitted against the demon king Lucifer Kreegan. After the defeat of the great king Xenofex by the forces of good of Erathia a dream disturbs the sleep of the evil lord. The flaming Sword of Armageddon that dominates the scorched and purified lands by hellfire accompanied by the dark presence of the fallen king are a clear omen: he needs to possess the blade together with the cursed artifacts of the Brimstone Chestplate and the shield of the Damned to fulfill his purposes. You must absolutely precede him, taking possession of the holy relics before him. There are several new things in this expansion, but let the numbers speak for themselves: first of all, six new campaigns, all playable separately since each one has its own storyline. Then there are 38 single scenarios to explore and play separately from the storylines, and I guarantee you that even a single scenario will ~capture~ you in front of the monitor for a long time. If we add to this a real random map generator and 10 new maps specifically designed for multiplay, the longevity is almost infinite. There are as many as 23 new creatures and 16 heroes, 1 new type of city, called the Confluence of Elementals that emerged perhaps to symbolize the prosperity of Erathia, as perhaps to mark its total catastrophe. There are also smaller but no less important improvements such as the control of tower archers during the defense of a city under siege or the possibility of putting creatures to guard mines and strategically important locations. The expandability and versatility of the original game has not been forgotten, also paying attention to the editing part: a new Map Editor, which includes all the objects present in the game plus the random function mentioned above. But the icing on the cake in my opinion is the Campaign Editor. Listen to this: you can link different scenarios together, define a plot, the cinematic sequences (!) the initial objects and those to be carried forward in multiple scenarios... an unprecedented boon!!! That's why the term data disk fits a little tight to A'SB...it's a real improvement on the basic fundamentals of the original game! The Shadow of Death (Data Disc 2) The second and most current expansion of HOMM3 is fresh off the press, given that the version I tested is exclusively in native speakers, and even in this case we cannot speak of a simple series of extra levels. In fact this is a real revised and corrected version of the original game, a deluxe version containing all the campaigns of ~Restoration of Erathia~ plus the new seven campaigns of Shadow of Death which follow the non-linear politics of Armageddon's Blade, therefore playable in any order you like. Basically a ~stand alone~ product that doesn't need to have the original game installed, like most of the expansions, since it itself contains everything you need to jump back into the fray. The guiding plot this time sees the lust for power of the Necromancer Sandro (perhaps one of our treacherous compatriots? ^_^') supported almost unconsciously by four ~heroes~: the barbarian Yog and the archer elf Gelu, who are convinced that they can reach their you dream of glory following the dark lord's unorthodox cause. The mercenary Crag Hack, on the other hand, has something simpler in mind: gold. Finally, fresh from the Succession Wars is Gem who wants to leave behind the ghosts of her fallen comrades on the battlefield. If the four manage to ~wake up~ in time realizing that the Necromancer aims only at domination for himself, together they will be able to create an army capable of countering the invasion that is about to fall on Erathia. Also this time there is a lot of substance, and as before there is no shortage of irons in the fire. Again, I could limit myself to making a list of the new features that are really many, but I prefer to tell you that all the improvements that make HOMM3 a Mr. Game have been made. Imagine that everything I wrote about earlier in the review is expanded to the nth degree, both in numbers and in quality ... you will have Shadow of Death as a result. Definitely a gift from the creators to all fans around the globe of this epic saga, which seems far from the end. In the end... Believe me, it is extremely difficult for me to give an unbiased judgment, since HOMM3 has always thrilled me to the core and I certainly place it in my small ~pantheon~ of all-time favorite games. On the other hand, I've always been someone who attaches importance to the substance behind the first initial impact, that's why I first took thea on the turn-based strategy genre as a strong point, precisely because its nature has made it possible to create ever-changing situations, without limits to the imagination, both for those who program and for those who play. Furthermore, this real ~parallel world~ of Heroes is usable by a large slice of the market, given that the minimum system requirements are really negligible (my word: from a P200 with 32 MB of RAM you can already expect a decent performance) and allow you not to suffer at all from the infamous times on the net in our area. If we really want to bring out a little flaw, perhaps we could say that in the long run the mechanism could seem repetitive and who is used to being ~guided~ in the events in all respects (I also mean visually, with an always explicit representation of what is happening) he might initially be a little lost...Guys, with Heroes the mind is fantastic and flies! A horde of enemies is drawn on video by a single opponent with a box at the bottom showing the total number (you can see it alone in the shots) but I think it's not difficult to imagine the tremendous sword blows and bloody clashes. I guarantee you that you will become more and more attached to your heroes who will gallop through the maps of Erathia, surviving the thousand pitfalls told for you on the screen. Then there is the longevity ensured by the ductility of the engine which will give you infinite material on which to create your worlds and your sagas, the web community consolidated for months now (just think that the title in question was at the top of the TOP 100 ever until two months ago, I went to check for myself). In conclusion, I can only put my hand on the fire and say: if you see it around, make it yours, in the name of Erathia! (and healthy fun, which is what matters most!) Introduction The phenomena of the moment pass, the great ideas remain. I wanted to open with this sentence because I think the game we're about to talk about really fits perfectly. The mechanism underlying Heroes of Might and Magic 3 (henceforth HOMM3) and which made it a masterpiece of last season is made up of simple but winning ideas and concepts, presented as they should and as it should is. A success confirmed by the fact that today, more than a year after its release, we are here to play not one but two official expansions: a clear sign that the substance is there, guys. I don't mind the game experts, but I think they can give me a few minutes to give those who don't know HOMM3 yet a chance to get passionate about this title (and to make up for the time they lost elsewhere! ^_^). Alright gentlemen, let's get started...", "date": "2001-04-27", "grade": null}