{"name": "Hellboy", "ref": "https://multiplayer.it/recensioni/hellboy.html", "text": "The beginnings of 3D cards Playing Hellboy you have this ~sad~ deja-vu... it seems to be back to the era of the first 3DFx. But before the technical aspects, let's see what it consists of. It is basically an Alone in the dark style game, that is a character who moves in fixed camera locations, between solving puzzles and four slaps with the bad guys. Given that the genre is more or less understood, I jump to the nodal points: the puzzles that you will find yourself doing are children of the clichs of the adventures (enough with the spinning statues, enoughaaa!) and the more times you will find yourself proceeding by attempts, the more than for intuitions or deductions, and the path in some sections is obligatory. The worry, as I said at the beginning, however, is the graphics that are decidedly not in step with the times, especially in the detail of the textures (look at the 2D fire in the screenshots and... we shudder!) which will make you turn up your nose... moreover, HB's bad luck is to come out in a period where the 3rd person view gives us many jewels of a different kind, such as Runes, Alice ... and beautiful company. Oh well... continuing to walk with our red light appears sooner or later we run into a dialogue and... here too there are ear pains. I don't know if there are different categories of dubbers, but unfortunately those from C2 were hired here, to use a football comparison. But why, I wonder, does any zombie speak like a normal person, moreover in a polite tone, when on video he's coming towards you with a crowbar in his hand... I'll never understand. Even the protagonist, no matter how good he is, can't have the voice of a peaceful soap-opera protagonist...heck he's an infernal marcantonio two meters tall! Peteeer! Everything gets cold here! I'm sorry to be lapidary but summing up, a game recommended for fans of the original comic (who?), and which heavily points out the lack of budget in the project. It feels like it was born in a hurry, with the result that we have a game that could be good for frightening the younger brother, who still doesn't know what technical marvels his beautiful PC can give him. You can play, but forgetting that there is something else... damn what a pity though... They gave me horns San Remo. Year 19XX. Nino D'Angelo sang: ~Vaaaai, dove il sole non c' maaaai, senza te te vaaai shoes, add nisciuno ce st..~ Who would have thought that this is Hellboy's favorite song? Explanation: brought into our world by an invocation of the Nazis, Hellboy has now been enrolled in the Paranormal Investigation Department (of course with the unemployment we have here, it is almost angering that the sicker they are, the more they hire them ...). Our dear Man-Devil with sawn off horns is always sent to the darkest and tenebrous places (the sun is never out), he walks around like the mother-devil did, including clogs (without shoes go), possibly in desolate cemeteries (add nisciuno ce st). Here is the plot of this game in brief: an agent of the department, such Peter Johnson, was sent to investigate a mysterious debilitating disease in Czechoslovakia believing that there was behind the hand of the notorious Nohox Kanis, demons who 700 years ago tried to enter our world. Since Peter is late coming back for lunch (I made this up) it's best to send someone a little bigger, like Hellboy... Peteeeer, where seeeei???? You will find out soon...", "date": "2001-04-27", "grade": null}