{"name": "Fallout Tactics: Brotherhood of Steel", "ref": "https://multiplayer.it/recensioni/fallout-tactics-brotherhood-of-steel.html", "text": "War... War never changes... But something went wrong and many Vaults (the bunkers) were destroyed or lost... among them there was a particular Vault made up mostly of military personnel who re-emerged practically unharmed after the nuclear holocaust. These survivors began to study and replicate the technologies of the now bygone civilization... they were the ones who would found the Brotherhood of Steel, dedicated to safeguarding and protecting the technology in the hope of one day being able to build a better world. Among these events is that of the first Fallout 1, in which an army of artificially genetically mutated men tried to conquer what little of the world that was left. The protagonist of what was one of the best CRPGs in the history of video games managed through various vicissitudes to foil the plans thanks to the help of the Brotherhood of Steel. The events of Fallout Tactics instead narrate the deeds of a particular group of the BoS which was sent on reconnaissance towards the interior of the USA to follow the retreat of the army of mutants thanks to the ~rediscovered~ airships. However, a storm ended up damaging them and forcing them to land on the outskirts of what was once a large metropolis: Chicago. And so it was that the BoS found itself alone in a desolate world once again... And it is in a scenario that is probably so unrealistic that the spin-off of the famous Fallout CRPG series takes place. In Fallout Tactics the gameplay focuses almost entirely on the proven combat system implemented in Fallout, similar in concept to that of X-Com (a feature that certainly contributed to their success). In the game you can create your own alter-ego through the Fallout rules system and join a group of BoS recruits. The game has an almost linear setting, being organized in missions (but during the game you can return to places you have already visited) and also being a tactical team game there will be no room for the ~role elements~ that made the fortune of Fallout (for example the dialogue will not be free..). But FT is not a role-playing game, and it is precisely with games of its same caliber that it should be compared... one at random: Jagged Alliance 2! And this is where the pains begin. One wonders how it is possible that the programmers of FT have not even tried to imitate the features that made Jagged Alliance great, in fact the result seems to have produced a game of low pretensions that instead of trying to surpass JA2, ~starts over~ , retracing the same steps as JA2 but finishing its journey much earlier. One at a time Examining the FT combat system in detail, it turns out that it has remained almost unchanged from that of RPGs, plus we will have the possibility to kneel and crawl (thus being able to take advantage of the conformation of the battlefield), but for example, he will be able to retreat or ~strafe~ like in Jagged Alliance 2 (and the list of missing features is long..). The game will then take place either in real-time or turn-based. Playing in real time can be done, but since there is no possibility of slowing down time (as in X-Com 3 Apocalypse) you will have to rely completely in the hands of the soldiers' AI (naturally poor) (choosing with what minimum success percentage they they will have to try to shoot). If, on the other hand, you want to try to control them directly by indicating where to shoot... well, it will be very complicated, given that the number of enemies is very high and therefore you will often find yourself facing multiple targets... but the real problem is that you will have to be absolutely precise in indicating who to shoot. Very often you will point instead of moving in the areas immediately close to the target, thus exposing your soldiers to enemy fire. In the turn-based game, however, there is something wrong and this is mainly due to the lack of ~interrupts~. In fact, in games of this genre, to counterbalance the fact that there are two distinct phases in which the good guys and the bad guys have to make their choices, this system has been implemented which allows enemies (if it's your turn to move..) who have not used all their chances to move and attack on their turn to ~surprise~ your soldiers in your phase and act accordingly. But a practical example will be better than a thousand words.. A typical situation: you have to enter a building where you are sure that some of your enemies are inside.. there is only one door to enter. Leaving aside the possibility of being able to open other entrances (as in X-Com or JA2, but not in FT) thanks to explosionsmiscellaneous, what you will have to do is enter through that door (or lure the enemies out). Logically all of you can imagine that if you entered the building suddenly you would find all the enemies prepared for the event and that consequently they would kill you in a short time. In turn-based games, you and your enemies can earn this chance thanks to each other's quick reflexes. There is no such system in Fallout! So everything boils down to a trivial ~first I shoot - then you shoot~, so you can very well enter a building full of enemies, shoot everything you can and exit sure that nobody will be able to do anything to you (unless for unfortunately you forgot to remove your soldier from the range of enemy fire). Other characteristics Another thing that puzzled me is the probabilistic model used in the game: it is not uncommon for people to miss each other for rounds and rounds from a few meters away. this fact and the lack of interrupts, the game seemed very easy to me, allowing you to linger over mistakes (which Jagged Alliance 2 doesn't allow you) also because of the rules system: in JA2 a wound affects the chance to hit and other things, in FT only some ~special wounds~ (such as a broken leg or arm) will have such consequences, while if you were to be reduced to death but full of ~normal wounds~ you will suffer from the negative effects to a lesser extent if instead you were in the same situation in JA2 (and keep in mind that JA2 is famous for all the people who walk around with several holes in the head...). Also in FT it takes seconds for your field medic to heal your soldiers of blindness! In Fallout, every medic will be a sort of messiah. Absent is also the possibility of verifying your line of fire or the cover you have, in fact, sometimes it is difficult to know which of your soldiers can see the enemies and which instead have the line of fire blocked by some obstacle. One thing you can only do in FT is the ability to drive (and shoot if possible) vehicles, as well as Fallout's ~aimed shots~ system (in JA2 you can choose whether to shoot at the head, chest or legs, in FT instead you can choose whether to shoot in the eyes, in the hands and so on). Distinguishing marks: more than discreet Ultimately Fallout Tactics definitely loses the comparison with Jagged Alliance in terms of characteristics .. but it is not a complete disaster. It may be that I'm a fan of the series but I still enjoyed playing it, because it's one thing to play in some remote land like in JA2, it's one thing to play in the ruins of American cities. However, from its FT it has an exciting story, all in all graphics up to par, and a ~classy~ realization (the introductory scene deserves applause in which the camera frames a sort of road sign bearing the words ~Welcome to Chicago ~ to then scroll up and frame the ruins of the skyscrapers of the former metropolis - a must for fans of this kind of thing), however the problems plaguing the game are mostly due to the fact that the features that are missing in FT make instead Jagged Alliance 2 is much more complex and detailed. So it is precisely the lack of these features that can disappoint and not what remains of the game or its realization. In conclusion, if you were looking for a successor to Jagged Alliance 2, it's not really the thing, but if you're a fan of the series and you don't mind all this, FT could prove to be a very interesting game.. it will depend on your degree of tolerance. I played it in ~Iron Man~ mode (called Tough Guy in FT - i.e. the possibility or rather the impossibility of saving in the game if not once back in the headquarters, to eliminate the temptation to save everywhere and reload whenever the things should go wrong) and I enjoyed it. Particularly recommended for those who want to introduce this kind of games for the first time, in fact in my opinion FT is definitely a good ~base~ to start with before moving on to JA2.. War... War never changes... Twenty-first century. The oil crisis is at its peak and the great planetary powers are trying to grab what little is left to be able to lay down the law in the immediate future. China invades Alaska... The United States invades Canada... and nuclear war begins. The United States of America, deeming defeat inevitable, prepared for iimminent bombing by building gigantic anti-atomic bunkers, where the best part of the American population and their technological baggage would find shelter, so as to be able to repopulate the Earth once the time has come.", "date": "2001-04-27", "grade": null}