{"name": "Tony Hawk's Pro Skater 1+2", "ref": "https://multiplayer.it/recensioni/tony-hawks-pro-skater-12-recensione-nintendo-switch.html", "text": "The race based on ~flips~, ~grinds~ and other bad words (which are actually necessary technicalities) continues: our review of Tony Hawk's Pro Skater 1+2 on Nintendo Switch confirms it. And why an article dedicated to the hybrid console of the Grande N? Well, maybe you didn't notice, or it didn't concern you, but until now Tony Hawk's Pro Skater 1+2 wasn't available everywhere. Last September 2020, the remake debuted on PlayStation 4, Xbox One and PC; most recently, last spring, it received the next-gen update (PlayStation 5 and Xbox Series X). From 25 June 2021, finally, the great absentee is also available, that is, the port for Nintendo Switch. Now the path is complete, the goal achieved: anyone can enjoy the production of Vicarious Visions, regardless of the reference platform. But, precisely, after the review on PlayStation 4 it's worth taking a look at how Tony Hawk's Pro Skater 1+2 also performs on the hybrid console. Well, quite well, we anticipate it. The conversion to Nintendo Switch When it comes to a conversion to Nintendo Switch, there's always a little fear. This is because on the one hand the Nintendo hardware is necessarily limited, also and above all due to the hybrid nature of the console, fixed and portable at the same time; let's add to this that in the last four years there has never been a lack of lazy conversions by equally idle developers. Fear, therefore, is permissible; luckily Activision and Vicarious Visions immediately dispelled all our doubts. A few hours in the company of Tony Hawk's Pro Skater 1 + 2 on Nintendo Switch were enough to be convinced of the goodness of the port; this beyond its limits and some obvious compromises, let's clarify it immediately. And how could it be otherwise? If you are looking for 4K, but also simply 1080; if you are looking for super detailed images, high quality textures, impeccable lighting systems; if the glance is more important to you than everything else, then you have the wrong platform. It's not on Nintendo Switch that you should buy Tony Hawk's Pro Skater 1+2: better a standard fixed console, better still the next gen and better than any other ~best~ is the PC version. However, you already imagined this, didn't you? Tony Hawk's Pro Skater 1+2 and his tricks The fact is that there is a reason why the graphics of the remake are less good on the Nintendo Switch than elsewhere: the developers have made a choice. Instead of persisting in not giving up anything (which would have led to a disaster) it was seen fit to preserve the gameplay. Here then is Tony Hawk's Pro Skater 1+2 on Nintendo Switch expecting practically granite 30 fps (the drops are really very rare, there will have been a couple of them in hours and hours of play), while the whole experience flows smoothly, pleasantly , smoothly. And nothing has been cut from the main offer: so you will find all the contents, all the modes, and also the online features on Nintendo Switch (although a subscription to the Nintendo Switch Online service is required, as always). A word of advice, though: this isn't one of those titles where controller drift is tolerable (elsewhere it often is): one wrong tilt, one late press, one sudden and unexpected mistake, and you lose the imperfect score. So choose your pair of Joy-Con carefully. An almost perfect remake Tony Hawk's Pro Skater 1+2 is a perfect remake As the good Serino also pointed out at the time, Tony Hawk's Pro Skater 1+2 is a practically perfect remake. The intent of Vicarious Visions was to transport the essence, the feeling, the contents, the use of two titles that marked the genre into modern times: Tony Hawk's Pro Skater (1999) and Tony Hawk's Pro Skater 2 (2000) . Objective fully achieved, because practically the new buyer finds in his hands that exact, precise experience, simply updated to the technical sector now accessible to contemporary industry (which can be 4K on nextgens, 60FPS on consoles, portability on Nintendo Switch) and to the comforts of our years (manual saves, online features, sharing, customization, and so on). Of course, the social soul of Tony Hawk's Pro Skater 1 + 2 is evident, but not so pervasive or unbearable: yes create your own skater, upgrade him if you want, think of your favorite track and share it online with the rest of the network. Anyone who finds all of this a useless surplus can simply turn the brim the other way and enjoy the basic experience: that is, the nine levels of the first Pro Skater and the eight of the sequel. There are an immensity of things to do: secrets, side missions, simplece exploration disengaged. But it is track records (and above all personal scores) that inexorably lure the player into a trap. From then on, it's useless to think about escaping. Tony Hawk's Pro Skater 1+2 becomes a center of gravitational attraction: you have to continuously improve yourself, repeat and repeat certain routes, improve your ability to execute tricks, until you get perfect scores. Perfect until an acquaintance of yours, online or locally, has passed them, of course. And there the challenge will start again.", "date": "2021-06-26", "grade": "8.5"}