{"name": "Ground Control: Dark Conspiracy", "ref": "https://multiplayer.it/recensioni/ground-control-dark-conspiracy.html", "text": "Not familiar with Ground Control? I think that everyone knows what was one of the most interesting titles of the whole of 2000 and that for once brought together critics and the public, resulting in one of the best games of its genre. We have dedicated a substantial review to it which you can find at this address and which I consider absolutely preparatory for this article, on the other hand consider that Dark Conspiracy repeats 100% what we had already seen in GC, obviously, with some new features. Let's start with the beautiful and difficult 15 missions that make up this expansion and which end with the Eh eh to find out you'll have to play them!! But the wizards of the Massive know that these new missions alone would not have been enough to bring us back to the battlefields of GC, and in fact, in addition to some new units of the Crayven and the Order of the New Dawn, a new army is also introduced made up of Mercenaries and known as the Phoenix. New terrains and graphical effects have also been added that make the GC gaming experience even more beautiful. Another juicy novelty concerns the multiplayer which has been one of the strengths of the game. Obviously we find all the old modes, but we also find totally new ones created specifically by Massive for this Dark Conspiracy. Concluding So let's sum up, without forgetting to tell you that Dark Conspiracy, as well as the previous Ground Control, is totally in Italian whose localization is really very accurate. So 15 missions, a plethora of new units, a new faction, new game modes for multiplayer as well as other little things. Well can you want anything more from an expansion? Sarah and Jarred's adventures continue Do you remember where we left off our fearless heroes of Ground Control? Well believe it or not, they are once again waiting for our help to finish their fight against Crayven. We've been talking about this GC expansion for some time, and it's finally on our tables, ready to be inserted into our trusty PC and so we quickly proceed to install the silver disk.", "date": "2001-04-26", "grade": null}