{"name": "Typing of the Dead", "ref": "https://multiplayer.it/recensioni/typing-of-the-dead_a.html", "text": "Zombies what a passion! The mid-90s will be remembered, videogame speaking, as the era of horror, of undead creatures, given that if a ~certain~ Bio Hazard (in the West Resident Evil) began to rage on the Playstation, in the arcades The House Of The Dead reaped numbers of coins perhaps comparable to the monstrous number of creatures to kill! Aesthetically stunning, THOFTD was one of the last masterpieces based on the now elderly Model 2 and allowed two AMS special policemen to thwart Dr Curien's crazy plans; between them and the fulfillment of their mission there were hundreds of zombies, worms, giant spiders and much more to blast good! Evidently videoplayers still didn't have enough of horror themes, as demonstrated by the many sequels and spin-offs of R.E. as well as the birth of other titles similar to it; Sega was no less and released the sequel to its popular monster slayer on Naomi hardware, converted after a couple of months in an IDENTICAL way also on the former Sega flagship, the 128 bit Dreamcast. The Smile Bit game was so successful that the genius authors of Jet Set Radio brought it to produce a more er alternative version and here we come to the very original The Typing Of The Dead! Forever keyboard First of all, a small premise: unlike the prequel, converted for our PCs verbatim from the (very painful) Saturn version, TTOTD has had a different fate which, despite some graphic problems, is almost identical to the original coin-op! For all those who know THOTD2 the photos accompanying this review may seem completely identical to the famous Sega gun game but it is not so, or at least not entirely: yes, the monsters, the locations, the bosses, the secrets, everything in short, it is taken verbatim from ~la casa dei morti due~ but that ~Typing~ instead of ~House~ and some revealing photos should have made you understand what we are facing: a typing game (I claim the copyright for the coinage of this new video game genre, do we understand each other? ^_^)! This time you absolutely won't have to shoot like hell with the gun located at the bar under your house and put the mouse away, since only the keyboard is used here: every monster, object or weapon thrown at you is marked by a number of characters variable with which, once typed, you can perform an offensive, defensive or possession action of bonuses and various objects. Let me explain better: a character indicates, for example, a knife or a barrel that has been thrown at you but also a chest or a padlock to be shot to get bonuses or to open up new paths; generally a word or two is enough to splatter the regular monsters while whole sentences await you in the presence of the tough bosses, gradually more and more tamarri! History Your task will initially be to find your colleagues in the AMS, but soon you will understand that only you and your partners can put things right, by slaughtering monsters and stopping the evil mind that created them, Goldman . Before coming to him you will visit undergrounds, abandoned cities, a kind of Venice, colosseums, highways until you get to the final confrontation with the supreme entity created by the madman who even relegates him to the role of penultimate boss Magician, the tenacious final boss of THOTD . All this takes place for a number of levels that are certainly not exciting but fortunately there are various ways to finish a level even if the boss who will wait for him at the end will always be unique. How to find the various streets? By rescuing certain civilians, taking down certain monsters quickly, paying attention to the various interactable elements scattered throughout the various locations, and more. Graphics and sound After the conversion of Sega Rally 2 I was definitely optimistic about this Typing Of The Dead and luckily the final result is of a good standard. Mind you, those who have seen the coin-op or the Dreamcast version will not be slow to notice drops in frame rate, some bad pixellone here and there while the super-attentive will notice a few fewer polygons in the human characters; needless to say that we are certainly not talking about huge defects and certainly those who have never seen the two aforementioned versions will drool at times due to the excellent visual performance. The audio quality of the title has instead been preserved in full, so we will find excellent pieces of music, always suitable for the various situations in which we will find ourselves, good digitized speech in the case of A.M.S. agents, grunts and moans discreetly curations for the display included in the video game package while the sound effects are absolutely superlative, perhaps even better than those on the console while I was unable to verify this difference in the games room because.er. the coin-op near my house doesn't have a very high volume to be able to judge it System requirements You will need at least a P2 233, 64mb of ram, accelerated video card with at least 8mb of ram and (well) 800mb of hard disk space. Yours truly was unable to test the game in this configuration, but I think with a fast P2, 128mb of ram and a card like a Riva Tnt2 or G400 you should play it just fine. A curious note: the game, testifying to its console origin, does not have any type of setting from a graphic point of view!! The resolution used is only 640x480 which still makes a good impression, if coupled with 60 fps, unfortunately not constant! Sky-high fun or not? The first time my girlfriend and I (avid fan of THOTD) caught the news of this remake we looked at each other in amazement about the reason for this new release from Sega. After playing it, however, everything is very clear: the game is very fun and has many modes! In addition to the predictable training, the discounted story mode (whose levels can be visited individually except the last one) and the ~Boss~ mode (where you can train yourself to defeat the various bosses of the game) we have a really well done typing course, enclosed in ~Tutorial~ and ~Drill~ modes! Surely it is not essential to be good typists; Yours truly, able to chat quickly even with thirty people at the same time in icq, had no problem mowing down monster after monster with his trusty, ahem, keyboard! Fighting bosses becomes exhausting when in addition to being splinters in pressing the keys, you will also have to pay attention to the meaning of the sentence shown! Example illuminated is the third boss of the game represented by 3 dragons: you can hit them only after you have typed the correct answer (out of three) to the question asked but the game is in English; It's one thing to type a sentence like crazy, it's one thing to read the sentence in English, translate it in the space of a second, read the 3 answers, translate them and type the right one! Obviously the monster doesn't wait for your comforts, especially if you think of the fact that you won't be able to type the first answer that comes to your mind, since the only right answer causes damage to the damned enemy! And if I tell you that the subsequent bosses are even more difficult ... well, it is clear that the ranks of possible buyers decreases! To be sure of what I say, I've had loads of friends play this curated Empire conversion and, as expected, those who aren't quick to type have been set in frustration even at the first boss (and the lowest of the three difficulty levels), since it is ESSENTIAL to know the layout of all the keys on the keyboard, dashes, question marks and exclamation marks included! Note that cooperative play is provided, exclusively via Lan! Conclusions To summarize in a couple of lines: those who are very fast typing on the keyboard or typing are welcome! They will certainly have a lot of fun and it will be a great challenge for all those who want to learn how to write quickly with the keyboard, perhaps to hurry up on work or to chat with several people at the same time. All those who still write with one hand or who do not believe they can sometimes type something like hundreds of characters in less than a minute should forget this production right away, the frustration would rise to a thousand! Historical preamble About fifteen years ago the first cabinets equipped with reproductions of firearms began to be glimpsed in the then crowded arcades all over the world! Even if the first game to mount this peripheral was set underwater and we had a kind of harpoon gun at hand, the progenitor of the genre is (globally recognized) Operation Wolf by Taito! With a machine gun we had to kill soldiers, helicopters, tanks trying not to massacre even inanimate shapes pretending to be blonde nurses! Water has flowed under the bridge since then, we played the sequel Operation Bear and slipped many coins into this by now appreciated videogame genre, which has also evolved thanks to the countless clones but, as with all ~driving~ genres, the 2D used in shooters with pistol is now shelved, except forand Namco's hilarious Point Blank saga. With the advent of the polygon and the texture, gangsters, secret agents, soldiers, helicopters and aerojets have a more real, more solid appearance than the (glorious) past and obviously the forerunner was the (very unfortunate these days) Sega with his Virtua Cop. Strengthened by a predictable success, the third title based on the Model 1 arcade motherboard (the same board as Virtua Racing and Virtua Fighter) is converted to Saturn in an excellent way, making the wait for a sequel less and less utopian, which obviously won't happen wait! Virtually identical to the prequel (except for the scene in a car) except for the shiny graphics that are choppy at sixty frames per second and with double the polygon count, Virtua Cop 2 (based on Model 2) will lead Sega to put aside the fruitful franchise until 2000, the year of the release of Confidential Mission, a VC spin-off based on the Naomi card) to replace it with another one that will prove to be much more appreciated by the public!", "date": "2001-04-26", "grade": null}