{"name": "Tomb Raider Chronicles", "ref": "https://multiplayer.it/recensioni/tomb-raider-chronicles-2.html", "text": "[***data incomplete: game card or image number missing***][***data incomplete: game card or image number missing***] Novelty? few! Let us immediately remove any doubts about the innovations brought to this new episode. They are few (as always) and concern hand-to-hand combat, the search function, the use of the grappling hook and the possibility of walking on ropes, among other things, the latter is a little more than a choreographic feature, given the ease with which this ~difficult~ maneuver is performed. That's enough. Even the graphics engine is that of the last episode and has no news of any kind. It must be said that Tomb Raider's game concept and gameplay are its strong points and it is difficult to be able to change or innovate them, on the other hand it is clear that the public wants precisely this type of product. However, it must be emphasized that the lack of a plot causes the whole game to lose some interest, which is obviously just a pretext to publish a new episode. Conclusions? Well it could be said that this Chronicles remains true to itself and can be considered almost a data disk completing the Tomb Raider saga if it weren't for the presence of a second, very important, CD included in the package. Do you want to know what it contains? I believe that the most observant of you already know this, given that it has been highlighted several times in the preview phase. However it contains a level editor for Tomb Raider. Indeed, to be precise, it contains the level editor for TR, the one with which the Tomb Raiders were built. I want to focus on this aspect rather than the game itself, which I repeat, tastes a lot like Deja-Vu. [***data incomplete: game card or image number missing***][***data incomplete: game card or image number missing***] Tomb raider VI? Let's start by making a general consideration: this is definitely the last episode of Tomb Raider, at least as we know it today. Otherwise it would make no sense to also publish the editor (which I want to repeat and the official one) which in fact gives the go-ahead to all level designers who, in this way, can indulge themselves in creating new levels that see the most popular heroine as the protagonist. sexy in the history of video games. To confirm this, we can read this situation in the introductory part of the manual. The current Tomb Raider engine will no longer be used to produce new games and therefore they distribute all the development tools, which have now become useless. The realization is accurate as is the splendid manual in Italian (even if in digital form) supplied with the editor which is composed of 120 pages. The thing that immediately catches the eye is that almost everything can be done, it certainly isn't very simple, but the manual takes us by the hand and guides us in creating a level. I bet you have a doubt arisen? But how are we going to play our level if TR doesn't have a console or option to load the map from? The editor includes a ~Special~ version of Tomb Raider 4 that allows you to load your own levels. Easy isn't it? [***data incomplete: game card or image number missing***][***data incomplete: game card or image number missing***] Conclusions! (the real ones) As you may have noticed by reading these lines, the really innovative thing about this last chapter of Lara's adventures consists in the editor and what this powerful program represents. Let's not forget that the desire to produce something to expand the game has been raised several times by TR lovers, which being exquisitely single-player, makes the beauty and size of the levels its most precious asset. If you are a Lara lover and you consider yourself a good level designer this is the title you were waiting for, otherwise we are faced with the ~usual~ data-disk containing some beautiful adventures of Miss Croft. The soap opera continues Do you remember the sad epilogue of the last chapter of the Tomb Raider saga? Well, our beloved heroine was given up for dead in Egypt and only Von Croy can't rest for her disappearance and does his utmost in a desperate search. Less optimistic are his closest friends, to the point that they find themselves in the garden of the famous Croft's Mansion under a statue depicting Lara and which was placed there in her memory. The sad ceremony is followed by a moment of reflection where her friends recall some of Lara's most fascinating adventures, which we haven't had the opportunity to play in all these years. As you may have understood this is a pretext, but that's okay... and then the idea of retracing Lara's old adventures isn't exactly a bad idea.", "date": "2001-04-26", "grade": null}