{"name": "Army Men: Omega Soldier", "ref": "https://multiplayer.it/recensioni/army-men-omega-soldier.html", "text": "But what age are we? I will be brief and circumcised to save you connection time and because there are, alas, few things to say. The green people are under attack and are preparing to capitulate, the last hope is hidden in the Omega project: the creation of a super-soldier by means of the fusion of plastic (basically we are talking about toy soldiers) which makes up the members of the heroic Team Good boy. The villains have become aware of this project and are determined to prevent this soldier from becoming operational by all means. Are you all still there? Well, know that Omega Soldier is in all respects a remake (an elegant word to say 'clone') of the very old Commando, with your alter ego you will have to advance through the stage without the possibility of changing the default path and having stuff like the trusty machine guns and the inevitable hand grenades. But then what differentiates this game from the old coin-op?1) The graphics here are polygonal, but it is a tinsel that is of little use and due to its crudeness and for the Crash Bandicoot-style scrolling, which differs little from the vertical scrolling in 2D graphics of games of this type available until a few years ago. 2) Commando was (is) in all respects more fun: much more frenetic and demanding than this Omega Soldier which will always make you face the same situations in monotonous and very long levels. But maybe they seem endless just because you get bored walking through them. And so it was evening... A quick excursus on the technical realization: terrible. Cubic and not very varied textures, slow but unstable scrolling, very low resolution, total lack of noteworthy effects (for example if you cross puddles you will not see the slightest splash of water), camera that frames what it wants, cutting out enemies that do not they stop shooting at you I conclude with a good tirade of ears to 3DO for shameful titles like this: guys, try to try harder because stuff like this only keeps the novice gamer away from this beautiful means of entertainment. pros: Er my tooth doesn't hurt anymore cons: Spartan graphics Not fun The infinite series It is not the title of a film, but the first comment that can form in the skull taking a look at the amount of games, released and released, in the ranks of the Army Men series. Stuff that EA and Capcom are amateurs in comparison. Often these are titles that have little in common with each other other than the presence of the nice green toy soldiers and their customized world; the impression is that 3DO tends to incorporate the weakest products into this franchise which, without a prestige appeal, would go unnoticed. This is certainly the case with this Omega Soldier, one of the ugliest games I've ever played on Playstation (to which I apologize again, already knowing that things between us will never be the same again).", "date": "2001-04-17", "grade": null}