{"name": "Dungeon Siege II: Broken World - Recensione", "ref": "https://multiplayer.it/recensioni/dungeon-siege-ii-broken-world-recensione.html", "text": "Nothing new... After just a few moments of play, the main reason for this add-on will be clear and obvious: did you want the bicycle? Now pedal non-stop and, possibly, give an oil to the gears of your trusty mouse. A few steps beyond the bridge that separates us from the base camp that welcomes us to the game are enough to be attacked by whole swarms of reckless beasts and angry monsters. All in a kaleidoscope of polygons that move frantically on the screen and make it really difficult, if not impossible, to understand what is happening and, above all, what your main character is up to. The color palette (always rather uniform) and the relative polygonal poverty of the three-dimensional models certainly don't help. In short, if you hadn't figured it out yet, this expansion is definitely designed for all those who have finished, refined and possibly devoured Dungeon Siege II with the (excellent) intention of offering players an up to the challenge level. Also this time therefore, a large part (if not all) of the success of the clashes will be decided before the clashes themselves, thanks to the setting of the behavior of our adventure companions and the preparation of the various automatic spells which, on the occasion of this expansion, they saw the available slots increase to four. again much (if not all) of the success of the matches will be decided before the matches themselves Nothing new... Micro-management, as far as possible and helped by the game interface, is therefore optional and irrelevant. In the same way, also in this add-on, the possibility of being able to build customized weapons seemed purely aesthetic to us since, just like in the prequel, the best and most delicious sets of weapons/armours were always and in any case those found in the our pilgrimages throughout the game world. Still on the subject of additions and innovations, we mention the return - practically irrelevant for the gameplay - of the dwarves as a player race and the introduction of two new classes: that of the blood assassin and the fist of stone. Following the first, you will prefer combat combined with the use of fire magic. With the second one instead, you will have a real melee and close combat tank in your hand. There are even new animals to take with you and grow freely as in a sort of fantasy Sims Pets. ...except the rent for me. Also technically nothing really new from the front. Graphically we were able to really appreciate minimal graphic improvements, with the introduction of secondary visual effects, such as the new spells (some really ~noisy~, at least visually speaking), the leaves falling from the trees, the reproduction of the different courses and currents of water which  if memory serves us correctly  now appear more refined and convincing. Despite these additions, the graphics engine that moves Broken World, now more than ever shows the inevitable signs of aging, offering us - despite a couple of truly inspired dungeons, unlike the average offered by the title - an overall impact that is not exactly exceptional, considering then that even on systems that are not really to throw away (we tested it on a 3.2 GHz processor and GeForce 6600 GT) the game doesn't seem to be very generous in terms of framerate. As for the audio instead, beyond the always epic and persuasive orchestral music, there really is no real news except - negatively - the lack of translation of the dialogues, localized only as regards the text. Yet, given the title's target (already in itself further reduced given the nature of the expansion), we don't feel like criticizing the distributor. Conclusions Dungeon Siege II: Broken World, in the face of an addition of content and new features that are not exactly unmissable, seems to have been conceived mainly to test all the most faithful players of the prequel with a scant ten hours, full of fighting one more challenging than the other. So if DSII hasn't fully convinced you, don't hope to change your mind with this expansion. Pros More difficult than the prequel A few neat additions (like the four automatic spell slots) Cons Lame main story and side quests No major changes Come on, now we can tell each other: Dungeon Siege II wasn't quite finished well. Yes of course, we had beaten the evil Valdis and, while we were at it, the evil Dark Wizard as well but all this led to a not so secondary secondary effect: the final battle had practically leveled and destroyed the continent of Aranna. And since the only ones who remained alive from this clash were the members of theour group of heroes, the few survivors of this catastrophe did not seem very inclined to want to thank us, indeed pointing to us as the cause of all their problems. It lasts the life of the hero. Dungeon Siege II: Broken World, begins just one year after those baleful days, taking us to a desolate, destroyed world full of hatred and, above all, with a new enemy to defeat. Yes, the hero's life is definitely hard.", "date": "2006-11-22", "grade": null}