{"name": "Call of Duty 3 - Recensione", "ref": "https://multiplayer.it/recensioni/call-of-duty-3-recensione.html", "text": "Call of Duty 2 was one of the best games released at the launch of the Xbox 360, and managed to carve out a large space for itself among the enthusiasts who dedicated themselves to it for months, also populating the servers set up for online battles, albeit complaining in this respect some heavy limitations, limited only in part by a patch released after a few months. Activision starts from here to present the new chapter of the saga, perfecting the single player mode and with a much better online experience. WWII This time the campaign, which is divided into 14 missions, is entirely focused on the long series of battles that led the allies to reconquer Paris, which lay under the check of the Nazis. Hitler's troops also in this new episode represent the enemy to be defeated in order to bring freedom to the lands of Europe. To succeed in the enterprise you have to rely on four different armies, impersonating different soldiers from time to time, American, English, Canadian and Polish. They therefore take on the role of American troops, fighting side by side with soldiers who often lose their lives, even if the main subjects, however very well characterized, follow us throughout the story. Her Majesty's army, on the other hand, will have to deal with the French resistance, which will collaborate to complete all the most delicate tasks to weaken the German brigades. The Poles and Canadians make their appearance in the Call of Duty universe for the first time, and we can only be happy that the importance of their contribution and their means to defeat the Nazi beasts is underlined. The origin of the game is not betrayed by making it remain in the elite of fps The game mechanics of this first person shooter hasn't changed since the second episode, there have certainly been some additions to the gameplay that we will analyze, but we can state without fear of contradiction that the origin of the game is not betrayed by making it remain in the elite of fps set in World War II. The sensation we experienced during our tests was certainly that of a clear general improvement of the Activision title, and realism has never been the master as in this chapter. Call of Duty 3 manages to reproduce on the screen, especially at certain times, the feeling of being on the battlefield. Climbing over a low wall and finding yourself in the midst of thunderous explosions, bullets that graze our heads, comrades running in search of protection and returning fire from the Germans engaged in a strenuous defense. In the background crumbling buildings and a sky crossed by planes engaged in bombing. This is Call of Duty 3. To the front with honor At a normal level, the title already proves to be quite challenging, but the real challenge is experienced at a veteran level, in which it will be crucial not to make a mistake and always seek the right coverage of the structures arranged on the scenario. To break the rhythm of the game, driving interludes have been inserted, for example the English jeep and the Polish tanks, which prove to be decidedly amusing and contribute to a better identification with the campaign. One of the innovations introduced, which has more implications on gameplay, is that relating to enemy grenades which, if they arrive in our vicinity, can be collected with the X key and then quickly re-launched with the RB bumper. The right timing will guarantee a perfect boomerang effect that will hit the incredulous German positions properly. Obviously in case of slow execution we will leave the feathers or, in the event that the grenade we relaunched ends up under the feet of one of our teammates, game over is guaranteed, as always friendly fire is not allowed. The gameplay was then also enriched by some hand-to-hand combat scenes that must be performed by pressing the dorsal triggers with the right speed, ending with a knockout of the opposing soldier. When we place the explosive charges, on the walls of the buildings or on the tracks of the tanks, a sort of real-time cut scene will start in which we will have to press the correct keys in sequence to insert the charge, and start the trigger. The interlude scenes, as usual for the Activision saga, serve to explain the situation from a historical-strategic point of view and also to let us know our fellow soldiers and allies. At a first glance, some of them may even arouse some laughs, due to the crude military jokes, but certainly the Treyarch developers would have done better to insert the possibility of skipping these clips which, if seen more than once, definitely succeed to bore. Brute force or superfine technique? TechnicallyCall of Duty 3 is placed on another level, obviously superior, compared to the first release of the saga on Xbox 360. The engine is improved and able to manage more complex combat scenes, with interactive scenarios, and dozens of characters on screen . The soldiers appear absolutely realistic, not only in aesthetics but also in behavior routines, they defend themselves, take turns with rifles and, replacing their dead comrades, properly cover the open spaces between their ranks from our artillery shots. The reactions of the allies, like those of our opponents, are truly credible: we will see the former advance by covering each other, and the latter, once crushed, retreat or regroup and counterattack. The game engine manages to handle almost all situations with fluidity, inexplicably hesitating only in some short pieces of the game, such as inside some buildings or on board vehicles. The atmospheric agents are faithfully reproduced and the rain, with thunder and lightning to accompany everything, is creepy for how it is made. On the scenario the countless explosions are rendered at their best as well as all the particle effects dedicated to the smoke of battle, such as that of grenades. Some goodies, such as the blur effect that simulates heat and distorts the view you have using fixed machine guns, make the overall experience truly immersive. What we would like to underline is the clear detachment from Call of Duty 2 that you feel by playing this third episode, above all for the feeling of unity that the Treyarch developers have managed to make. Perhaps for the first time ever, Halo aside, it really feels like fighting alongside an army against another organized entity, no longer just as lone wolves in the heat of battle. For the first time ever it feels like fighting alongside a real army Brute force or superfine technique? Obviously we encountered some small problems, in addition to the fact that the game innovates too marginally an already tested formula, and it is not so much the linearity of the missions (follow the radar to the next objective expresses the concept well) which is present but which it was mitigated by the possibility of choosing, in some moments of the game, the itinerary to follow between the two available. The defects are more technical than anything else, some inaccurate collisions create annoying situations such as getting stuck between elements of the scenario or hindered by our own fellow soldiers. Interaction with the environment is present but only up to a certain point, emblematic examples of which are the lamps that illuminate the rooms which, if hit by bullets, emit sparks as if they had broken but which instead remain intact even if targeted by long bursts of shots. The interaction itself, as well as the management of physics, are in principle cured, guaranteeing credible situations, such as the thunderous explosions of the fuel barrels that splash in the air, overwhelming everything they encounter, and soldiers who roll on the ground. A particular mention from a technical point of view should be made to the creation of the vegetation as a whole, from the polygonal grass that moves in the wind to the leaves of the trees. Truly possibly one of the best greens ever seen in a video game to date. 24 online The improved online multiplayer compared to last year is the juiciest addition of this Call of Duty 3, although we must not forget that the multiplayer modes are also present via split screen for 4 players and via system link up to 24. Also on Xbox Live you can play up to 24 at the same time and, as far as we have been able to verify with our own eyes, without annoying lag to affect the games. The modes, to be faced in ranked and unranked matches, are more or less the classics: deathmatch and team deathmatch, here renamed battle and team battle, neighborhoods, capture the flag and a brand new War mode which provides for the presence of some game to catch and keep under control for as long as possible. There are also game classes: rifleman, light and heavy assault, medic, recon, support and anti-tank. Every time we are killed we will be able to change class and therefore modify our game attitude trying to exploit the relative peculiarities of each one. Many usable vehicles fill the great schemes of online modes, tanks and vans above all. The game engine is also exceptional online and you hardly notice the difference with what was seen in the single player campaign, the frame rate keeps pace and is constant, guaranteeing decidedly fluid and enjoyable games. To the delight of all of us gamers, the lobbies fthey work correctly and at the end of each game the group of teammates will come together to face new challenges. Goals The 1000 points up for grabs from Call of Duty 3 are concentrated above all on the offline campaign, but not forgetting the online matches. Nine of the 26 achievements, in fact, are dedicated to multiplayer. We will score points in the traditional way by finishing the game or finishing at least 2 levels with the different soldiers at our disposal, but also in a less appropriate way, by performing reckless acrobatics aboard the jeeps or by relaunching the grenades thrown by our opponents. There is definitely something to enjoy! Comment Call of Duty 3 picks up where the second episode of this beloved saga set in the Second World War left off, filling some gaps, but not innovating much of an already successful formula. COD 3 is the classic ~more of the same~, the offline campaign while remaining in the tradition has been made increasingly realistic, thanks to an excellent game engine that guarantees truly satisfying and exciting moments. The online has been enriched and is not even remotely related to what was seen in Call of Duty 2; every aspect has been detailed, with classes, vehicles, and lobbies working just fine with up to 24 players. We have no doubts Call of Duty 3 is certainly the best fps set during the second conflict currently in circulation. Make the purchase and you will not regret it. Pros: Increasingly realistic Technically remarkable Improved online Cons: Needs a twist to the series Mission linearity Interaction with the seabed still needs improvement", "date": "2006-11-20", "grade": null}