{"name": "Surfing H30", "ref": "https://multiplayer.it/recensioni/surfing-h30.html", "text": "Between you and the sea... In the Pal version of Surfing H30 we will find ourselves competing in a conventional surfing competition, which winds along six tracks, which can be unlocked by acquiring points during the competitions. There are basically four ways to get points: performing aerial tricks, finishing the race in first position, collecting colored balls and surfing in the ~tube~. After completing the six levels you will have access to their more difficult versions, and all this contributes to a feeling of ~already seen~ that characterizes the game. The control system is very original, it is based on a mini-surfboard, included in the package, to be applied on the DualShosck2 sticks, and which according to the Ascii team should make the driving experience much more realistic. Unfortunately, in some circumstances there is a delay in the response, compared to the input given on the controller, but in general the controls are immediate and simple to use. Graphic-sound compartment! From a graphic point of view we are faced with a good title. Excellent textures used in the creation of the surfers (you will have 11 available) and their boards, a frame rate that always remains around 60 fps and the effects of the waves are well done, the only discordant note is the framing system which, especially inside the tube, makes orientation difficult. A positive note comes from the sound sector, where both the music and the sound effects play their role very well. Better a hundred today than a table tomorrow! We are faced with a good idea, which has not found an equally good realization. Those positive notes that have characterized the Japanese version have been mysteriously censored, and the title has been affected. If you are a hardcore surfer, then consider buying Surfing H30 (it is the only one available on the PS2 market), otherwise keep your hard-earned one hundred percent. pros: original idea good music cons: monotonous disappointing conversion From Japan with fury! In a market dominated by sequels and titles based on successful franchises, it is increasingly difficult to find original and innovative games. Rockstar Games moved along this line of experimentation, which decided to bring a Japanese surfing simulation to Western markets, which had not already enjoyed great success at home. Unfortunately, in the course of the adaptation for us Westerners, those positive notes that had characterized Surfroid (name of the Japanese game) were lost, such as the original plot centered on an interplanetary surfing challenge and the immediate control system.", "date": "2001-03-02", "grade": null}