{"name": "Spec Ops Ranger Elite", "ref": "https://multiplayer.it/recensioni/spec-ops-ranger-elite_a.html", "text": "ACTION! The third-person view therefore brings this action-game closer to other titles of the same genre, such as the aforementioned Metal Gear and the more recent Siphon Filter and Rainbow Six. To be honest, it has very little in common, however, from a qualitative point of view, especially with the first two. But let's try to analyze it point by point. A short FMV with images of war tries to introduce us right away in what will later be the whole setting and style of the game. The first mission takes place in Alaska, where an FBI agent has been taken prisoner in an oil pipeline by a gang of terrorists belonging to a local far-right militia. It will be up to our team of special agents to free the hostage and clean the plant from bombs scattered everywhere to blow it up. A first screen invites us to choose our two characters that we will guide in guerrilla actions among the five professionals at our disposal. Each of them has specific weapon skills; they range from the machine gunner to the grenadier, from the sniper to the stormtrooper, and so on. We therefore understand that we have to choose the most suitable ones in order to be able to act quickly and effectively. In fact, the peculiarity of this game consists in the fact that we will not command a single man during the missions, but, as mentioned before, two. Throughout their development we will therefore be able to order our second to carry out some simple actions, such as advancement or cover, or we will be able to directly take his total control, skipping whenever we want between him and the previous one. The premises for a good spy game (as defined on the package) would therefore be all there. WITHDRAWN! Unfortunately, however, once in the field, we immediately realize the various problems that irremediably punctuate the entire course of missions. In fact, the bad graphics engine used and the animations of the characters, jerky and almost non-existent, immediately catch the eye. But you just have to walk a bit to realize that these are nothing compared to the frightening bad-clipping and pop-up effects that plague the vast environments in which we move. Polygons that pop up out of nowhere, disappear and then reappear, mixing objects that have nothing to do with each other, are the order of the day. Ungraceful and rough scenarios from every point of view are just the outline and the premise for a frustrating and not at all engaging game action. In fact, to combine the two things, just think that if you want to hide behind a tree it is not really possible to do so, because the graphics engine does not recognize it as an integral part of the game, but only as an ~embellishment~ of the paths that we will find Do. The difficulty levels of the game are three, but even setting the lowest one we will still find ourselves in front of missions that defining difficult is very little. The enemies will be found in the same position every game, and, once memorized, they will make us want to run towards them with guns blazing until what from afar looks like just a very grainy pixel will gradually transform into a terrorist ready to do anything to kill us . What was supposed to be a title with a tactical setting and with espionage at the center of attention thus turns into a bland B-series action game. Among the many problems that are immediately noticeable is the lack of a detailed map that makes us understand where we are and where we should go. What is there is in fact only a half summary representation of the stage area, in which it will be very easy to get lost given their size. Even the sound is not far behind, with sound effects and tunes that have not been heard perhaps since the days of the Commodore 64. Wanting to find at least something decent in this game, as well as the price, on closer inspection there would be the game mode two, in which a friend of ours can play the second ranger. In this case, in fact, the screen is divided in two horizontally, leaving both players the complete freedom to organize at least a minimal tactic of action. WHITE FLAG! In any case, if you suddenly feel an irrepressible desire to play a spy game, turn to Metal Gear Solid without a doubt; if, on the other hand, your desire is to try an action-game with numerous military operations, instead catapult yourself into Siphon Filter. In short, unless you have already finished and exhausted the aforementioned titles to boredom, or sleep wearing camouflage instead of pajamas, with a mitrunder your pillow and with the Rambo poster on your bed, well... you'd do well not to consider buying this mediocre video game too much. WHITE FLAG! Pros: it costs only 29,000 lire..., you can play in two; Versus uh..., ...where do we start? HOW MUCH DID YOU SAY IT COST?!?! Let's start immediately by saying that Ranger Elite is above all a mission pack for Spec Ops, a game converted from PC and released for Playstation last year on the wave of success of Metal Gear Solid games. However, unlike other add-on CDs, this one does not need the original title to function, as the team that developed it, Rune Craft, while having maintained the style and graphic setting of its predecessor, is managed to include a sufficient number of missions to consider it if not a sequel, at least a game in itself. Precisely because of these characteristics of a ~hybrid~ product, Cidiverte, its official distributor for Italy, has decided to place it on the market at the modest sum of 29,000 lire. Wanting to look closely, after a careful and precise analysis of the game, this will turn out to be the only real positive note in Spec Ops: Ranger Elite.", "date": "2001-02-12", "grade": null}