{"name": "Grand Theft Auto 2", "ref": "https://multiplayer.it/recensioni/grand-theft-auto-2.html", "text": "Fortunately, we are almost completely faced with a new game that has eliminated at least half of the defects present in the old episodes, including many trifles (like not knowing how bad your car is, now the car catches fire) and some truly remarkable problems, such as the graphic quality, with a truly giant step forward, although I haven't played the PSX version much I can safely say that I have seen some good ones on the Dreamcast and I was pleasantly surprised and reassuring all those who thought GTA too poor graphically: now there are very accurate and highly spectacular light and flame effects and more detailed sprites, cars and buildings. However, the biggest novelty of this second chapter (almost third, let's not forget the London 1969 data disk) is the presence of some criminal gangs such as the rough farmer Loony or the terrible Japanese Yakuza mafia, for which we will carry out missions and consequently , we will wage war against the opposing gangs, at the same time facing the usual policemen who, for the occasion have become more aggressive and in addition to driving more resistant cars, we will also see them slaughter the other criminals and, if the situation gets too heavy, they will call the special squads, in large numbers, well armed, armored and above all distinguishable from the orderly policemen because they are not stupid enough to think twice about pulling the finger on the trigger, and with their main directive of ~shooting on sight~ In short, a stylistic revolution, at least spot on and which, among other things, also has a more ~polite~ language (less vulgarity but more bloodshed, however we won't be called coglioncelli for having made the slightest mistake...) which will contribute to make the game really pleasant and fun for a fair amount of time, thus letting us overlook some small defects that undermine playability, such as the character who sometimes gets stuck in the middle of the stairs, chooses to steal a car close to the one we have chosen or , it is controlled stubbornly above all because of the analog stick of the console not immediately immediate. To tell the truth, in my opinion the game should be taken as a very simple arcade where to raise your score you will only have to destroy as much stuff as possible but, ~officially~ the game is divided into missions which, although various, will never entertain you how much to wreak havoc throughout the city... But that's just a personal opinion. Even the sound may or may not like it, having kept the old car radio structure with different music in each car, with quite catchy songs mostly by American rock / punk artists, the effects are spot on and pleasant even if unfortunately already heard. Arrived at the end, my advice is that this sequel has numerous positive elements that perhaps manage to make it surpass the previous episode in beauty and that could make both fans of the series and those who hate it forget the numerous past defects. to treat yourself to many hours of destructive fun. THE SNEAKEST TRICKS! Dearest, THIEVES (I write like this just to offend you, since you are playing a rogue video game, and that moreover you are in the gabo list), I have bread for your teeth. Are you incompetent at this game? You can't even pass the first level, without your own mafia killing you... dear RED has the right medicine... Level select Enter SESAME as a player name. All weapons Enter BIGGUNS as a player name.99 lives Enter BIGCATS as a player name.Invincibility Enter INFINITY as a player name.Infinite double damage power-up Enter DBLWAMMY as a player name. Infinite invisibility power-up Enter SCOOBYDO as a player name.Infinite Electro Gun Enter BIGFRIES as a player name.Infinite Flame Thrower Enter TOASTIES as a player name.Have same weapons after losing life Enter LOSTTOYS as a player name.No police Enter LAWLESS as a player name.500.000 Dollars Enter MUCHCASH as a player name.$10 million Enter ULTIMATE as a player name.5X multiplier Enter BOYAKASH as a player name.Maximum respect for all gangs Enter ALLFREND as a player name.Maximum Wanted level Enter BADBOYZ as a player name.Gore mode Enter WOUNDED as a player name.Elvis pedestrians Enter ERRHUH as a player name.tnx to hype.se The second episode of one of the most transgressive games currently on the market makes its appearance, even though the game has already been released for some time on PSX, even on the new Sega monster, amid constant rumors of an imminent third chapter completely in 3D (for now the Rockstar developers and the DMA deny everything about it, that the mass is ~confused~with Driver 2?) For those who have never heard of it, Grand Theft Auto (more familiarly GTA) is a simulation of the perfect car thief; or rather of a gentleman predominantly of pure American origin who in his spare time rounds off with kidnappings, extortions, murders and other trifles of the kind, traveling through cities usually carrying out missions on behalf of people worse than him or simply sowing death and destruction.", "date": "2001-01-23", "grade": null}