{"name": "Star Wars Demolition", "ref": "https://multiplayer.it/recensioni/star-wars-demolition.html", "text": "Game mode Let's start right away with the description of the game modes. In Single Player we will be offered the possibility of challenging opponents managed by the CPU in battle mode, and here it will be enough only to destroy the enemy vehicles; in Tournament, in addition to destroying the opponents, we will also have to pay attention to the damage indicator and to accumulate a fair amount of money. Bet: every comment seems superfluous to me; droid hunting, a sort of points time mode. Tournament is the fulcrum of the Lucas title: we will start by fighting against a single vehicle, in the last round we will have to face four. During the clashes we will be able to take advantage of various bonuses and different weapons, which will be upgraded as in a classic shooter. In addition to this, various devices such as brand new deflectors and prodigious stealth gadgets are found randomly throughout the level. If you are good enough to have accumulated at least 10,000 credits, you will be able to unlock new vehicles and levels. The 2 Player mode is reduced to the bone: Tournament in cooperative mode, bets, one against the other, hunt for the droid, challenge one on one to whoever shoots down the most in the shortest time. In Multiplayer mode you can compete in a maximum of four participants. The last survivor will be the winner. The technique Graphically speaking S.W. Demolition is a mediocre title. Very little of the technical realization is saved. The battle vehicles are without infamy and without praise: the polygonal models are discreetly built and mapped, with sufficiently defined skins. Instead, the light effects of weapons and explosions are very poor. The only positive thing in this area is given by the effect of using the stealth device: truly exceptional. The refraction of the ambient lights on the contours of the vehicles is beautiful: seeing the silhouette of the enemy flash in the dark and seeing the impotence of your own targeting systems is not exactly pleasant, especially when a proton torpedo suddenly hits you. Totally negative is the screen refresh. Apart from an obsessive pop-up of the polygons, in some levels such as the one set on the original planet of Joda, the fogging, already regrettable in itself, adds up to an environmental mapping that is nothing short of ridiculous. As a portion of the backdrop is discovered, the gray halo that covers everything gives way to the actual textures of it. The effect is terrible: it reminds me of an old Commodore 64 golf game, where after each shot the environment was updated, element by element, from bottom to top. Feels like we went back 15 years!! As if that were not enough, the definition of them is not even very detailed, settling on just sufficient levels. The sound is good: the soundtrack is very John Williams, and that's good; the sound effects sometimes gave me the impression that they were used a bit inappropriately: the same for multiple sources, and this is not good. Playability is not the best: the control method is immediate and easy to master, however it acts as a counterpoint to a system of displaying data relating to the vehicle that is unclear and difficult to read. 5 Definitely... Getting to the point, the Lucas title is not very fun: going around arenas shooting enemies unwilling to attack you, and moreover for a long time, given their incredible armor, is lethally boring. In short, it lacks that something extra that makes you want to go on playing. There is no challenge, and even when it is one against four, the enemies behave like certified imbeciles; in addition, a good blow landed does not reward you with a good explosion and a big bang. Even the challenge in four, all against all for the first two games likes, then tires quickly. It's hard, to be honest, to find anything totally positive about this game. Each sector has its beautiful flaw: the polygonal models are discreet, then the backdrops are poor and the screen update ridiculous. The music and effects are the original ones, but used inappropriately. That's great, now I fire a photon torpedo at Boba Fett! If I had thrown a fuse I would have made more noise. It's really a shame to see such a good idea so badly done. There is very little to save in Lucas' latest effort. Only if you are an avid fan will you be able to appreciate this title a little, the others would do better to abstain. The last born SW Demolition is the latest franchise in order of appearance to come out of the fertile minds of the guys at Lucas Arts. The title is an unoriginal arena shooterclosed, along the lines of the much more appreciated Virtual On. Instead of giant robots, pilots from all 4 episodes of the Lucasian saga compete in matches to the death, such as Boba Fett, Dug, the same as the opposing pilot of the young Anakin of the 'Episode 1, a Lando Carlissian in disguise, and unpublished competitors aboard well-known vehicles such as an imperial At St, a radio-controlled mini-tank complete with a droid (see E. 1) and a modified snowspeeder, I believe a remnant of the battle of Hoth . However, all this variety of means comes at the expense of a minimum of chronological coherence; saga purists will turn up their noses at seeing space opera continuity so brutally raped, but this is a shooter and perhaps this unscrupulous merger is totally justified.", "date": "2001-01-15", "grade": null}