{"name": "TONY HAWKS PRO SKATER 2", "ref": "https://multiplayer.it/recensioni/tony-hawks-pro-skater-2_a.html", "text": "Go-go game mode In Single Session Mode, on the other hand, we will have to try to give our best in the two-minute time limit: the more money we accumulate, the more levels we will unlock. Free Skate, on the other hand, is the level of training: I dare to say that thanks to the incredible playability of the title, this mode would be enough to justify the purchase of the title. The 2 Player and multiplayer modes are very varied: Graffiti, against a human opponent and in split screen, those who have played Jet Set Radio will find themselves pleasantly surprised; Trick Attack, when Road Rash meets Tony Hawk; Horse which consists in making better evolutions and giving the opponent the title of loser; Tag a kind of VS Puzzle Bobble model on board and Free Skate in which the little level explorer in us comes to light. In short, these are the main game modes, but we will also have fun with the Create Player, for up to 4 athletes to use in all modes. Here we will be able to customize every parameter relating to your skater, from tattoos to the color of the socks; in addition, as in any good role-playing game, there are skills to be maximized, otherwise no Pro circuit. We are also given the possibility of editing the tricks. Really interesting is the Skate Park editor, which as in the case of the editable skater, we can use in any mode. Technique: graphics and sound Finished the description of the game content, it's time to move on to more technical comments. Graphically speaking, the game stands at levels of excellence. There are no graphic exploits like Soul Calibur or Dead or Alive, but what is striking is the attention to detail bordering on the pathological, placed in the modeling of the environments and skaters. The former are a perfect reproduction of real structures, in which the textures applied to the polygonal models stand out above all. Being a skate park, the flooring, the plaster of the walls and the graffiti on them are not in good condition; the refined effect of structures falling into disrepair is perfectly captured, even the smallest stains and imperfections of the surfaces can be seen. The realization of the skaters is of the highest level: if the first title was already stunning, this dwarfs any game that comes close to it. The detail and cleanliness of the applied textures is very high. The clothes they wear are made in a more than excellent way, they are not equipped with particular animations, but they amaze if they are crumpled and dirty. But the most striking thing are the real skins, the skin of the skaters. Here too the speech made for the backdrops applies: the skaters are not very great, given that Tony Hawk is not a polygonal fighting game in meetings, however noticing the tattoos sticking out of the shirt or the hair on the legs has a great effect. The sound is on very high levels, at least for those who appreciate punk / crossover songs shot at full volume. The best of the best is included in the soundtrack: it starts with the aforementioned Rage Against The Machine, then continues with Bad Religion, Anthrax, Papa Roach and many others. In addition the sound effects are very well done, the screams of pain and the crack crack of broken bones will make you turn up your nose many times. Of course, if your musical idol is Laura Pausini, mute the audio and continue playing anyway. Yes but... is it playable? We now come to the strong point of the title, the gameplay. And here gentlemen we are at the highest levels ever seen. If the rule says that the soul of a sports game is multiplayer, Tony Hawk is the exception that confirms it. Rarely has such a fun, immediate and at the same time complete and specialized game been seen. Even if the booklet rants about incredible tricks with rather improbable names and very complicated key combinations, 5 minutes of practice are enough to perform evolutions worthy of the best professional. The important thing is to understand when to stop pirouettes in the air and prepare for a good landing. Having said that, we indulge ourselves with combos, ollies and various figures. There are levels where the only goal is to reach a certain score to win the hard-earned gold medal. Well, the adrenaline and involvement achieved in these cases is so high that even when you finish first, you will continue to play just for the sake of improving, forgetting the other levels waiting to be overcome. All this fun doesn't end anytime soon. The Single Player is so well thought out that even after watching and unlocking each level of the title, skater exincluding, you will never dream of putting Tony Hawk back on the fateful shelf to collect dust. I personally am still playing with the first version, and only thanks to the continuation of him will retire. The multiplayer then, even if it does not reach peaks of shocking competition, such as those that are touched in Winning Eleven, does its duty. 5 Gozzer think so... I consider Tony Hawk to be the best Single Player sports title ever made, and this merit is even greater given that skateboarding is not played football or any other national sport. Ultimately we are facing an absolute masterpiece that excels in every sector, a point of reference in the field of playability, fun and immediacy. Intro After a beautiful introduction based on videos that show us incredible evolutions on the background of Rage Against the Machine, the main menu appears. In the Single Player mode you are given the possibility to choose between Career Mode, in which you start practically from scratch, choosing from a very large roster of professional skaters, and gradually completing the quests (if you pass me the term) of each level, type of evolutions, breaking barrels and the like, you will be rewarded with new levels, new tricks and money, which can be spent in making your alter ego even more tamarro.", "date": "2001-01-08", "grade": null}