{"name": "SWING AWAY GOLF", "ref": "https://multiplayer.it/recensioni/swing-away-golf.html", "text": "Graphics, game physics & CO Let's start with the graphics sector: the bare minimum, in short. The textures appear discreetly defined as regards the golfers' clothes: you don't get to the orgy of details and colors of Dead Or Alive or Tekken, however certain particularities, such as striped trousers or decidedly gaudy feminine outfits, have succeeded quite well. The animations are very well done, and even the physical model of the ball, jumping from pole to pole, seems to be quite realistic. The light effects which, depending on the quality of a shot, underline the outcome of the shot, are ugly, given what happens in Fantavision. The backdrops and the environment in general around the green are rather scarce: the trees are clearly in bitmaps, the grass on the lawn is a uniform mass of green that is not at all defined and without visible signs of yellowing and similar ugliness. It's not that ~realism~ necessarily means playing at the San Siro, but a little more likelihood wouldn't be spoiled. Honor to credit instead for the menu system and for the breaks between one shot and another: the first is very reminiscent of certain games with a cartoonish look from the 16bit era; the ~montage~ between the various phases of the game is achieved through drop-down fades and variations on the theme of the page being browsed. The discourse concerning the control method is very important: I state immediately that the EA title uses all the keys, even the little-used ones L3 R3, deputies here for the intensive exploitation of the personalized direction. Hand to the clubs As befits any good golf game, every typical parameter affects the success of the shot. This means that depending on your needs you can change your club, and in the meantime the diligent caddy will comment on your choice, the position of your feet, the effect and therefore the direction of the shot and where to hit the ball. Once this preliminary part has passed, we proceed with the actual shot: the Shot Meter appears and, through this, we will decide the strength and type of swing to give to the ball. The bar is in fact divided into two fundamental areas: the high one, in which the over swing is decided, i.e. a power out of the parameter, and the low one where if you make a mistake in pressing the X in time (timing) you will get an undesired effect right or left. Pressing the X once the Shot Meter goes up, X again to stop it at the desired power, X again to avoid or look for the effect. More than practice you need a lot of attention, given that the bar tends to go down quickly once the force has been set. Easier said than done anyway. In light of all this, the judgment on playability can only be extremely positive: the level of difficulty is well balanced, and even the disorientation in making the first shots vanishes after 5 minutes of play. In short, fun is guaranteed: the single player, a sore point of many sports titles, is well thought out here. The Story Mode is extremely long and varied and offers very different tournament modes. Unlocking secret goodies also imposes a tendency to replay already passed levels, one is never sure if one has seen and achieved everything. As a result, longevity benefits enormously. The path editor is certainly an extra gem, not a simple add-on to lengthen the broth. The scenarios created can in fact be used both in Story and in Normal Mode. The little tunes are very annoying in the long run. In the end, do we like it or not? So, summing up we can say that Swing Away Golf is certainly a title to be taken into consideration. An extraordinary playability and a very high longevity both in the singles and in the multiplayer, make it an extremely varied and long-lived product. Certainly, graphically speaking it is not the state of the art, it is not the definitive software, nor even a paradigm of the kind: it will not make visiting friends drop their jaws in amazement, simulatively speaking it pales in front of certain PC products, but it is really funny and immediate. What more could you ask for in a game? Let's begin... After a sober presentation, several options await us: Story Mode, Normal Mode, Options and Create Course. The Story Mode is the flagship of the entire product: the setting plays a lot of role play: you choose a golfer, you assign points to the various characteristics (distance, accuracy, control and recovery, i.e. the ability to perform come out of the bunkers or tall grass as if you were on the green) then you start playing, as an illustrious amateur, to then win the world title. Of course, this title also enteredis part of the trend of the moment, i.e. that of goodies to collect. Winning tournaments means, in addition to climbing the world rankings, also earning good money to invest in brand new equipment and nicely tacky style clothes. In addition, new hidden game modes will be unlocked. Normal Mode allows us to challenge one or more friends in Stroke Play or Match Play modes. Here too we will be asked to choose the player to play, but now with already defined characteristics. Once this is done, you choose the caddy, the route and off you go to swing. Clearly there is also a Training mode to learn the basic rudiments of this no longer elite pastime. Create Course is a simple course editor, to be saved on the memory card, which allows us to create from scratch or modify already made greens, both in the Story and in the Normal Mode.", "date": "2001-01-08", "grade": null}