{"name": "Chrono Cross", "ref": "https://multiplayer.it/recensioni/chrono-cross.html", "text": "Chrono Trigger Chrono Cross is inspired by a subplot of Chrono Trigger and from this it takes up the characters and some situations. In the game you will take on the role of Serge and starting from a small fishing village you will travel to the world of El Nido in search of a magical sword of immense power. Unlike Chrono Trigger where you traveled back and forth in time, the game offers you the possibility to reach a world parallel to yours where life flows differently. All this offers game possibilities hitherto unknown to RPGs, which bring Chrono Cross closer to the graphic adventures that were in fashion a few years ago on PC. To give you an example, at a certain point in the game you will need a potion obtained from the skin of a monster that lived in the swamps of El Nido, but this creature became extinct due to man; what to do then? You simply have to teleport to the parallel dimension where this monster is still alive and defeat it. Furthermore, by showing particular objects to the people you meet during the game, you can unlock subplots or make new characters join your party. And speaking of characters, it must be said that it is possible to enlist more than forty, each well characterized and endowed with its own personality and a particular way of expressing itself. Chrono Trigger In some points of the game, then, it is possible to make decisions that will influence the development of the plot: we cannot speak of freedom of action but it is already something. The combat system is different from that usually used in Squaresoft RPGs and incorporates, improving it, the one used in Xenogears. Random attacks have been eliminated and enemies are always visible on the screen, so you can avoid them; instead of the classic rounds you will have three types of blows (of increasing power) which consume the seven ~stamina~ points available: the weak blow will take away one point, the medium two and the strong three; once the ~stamina~ is over, you will no longer be able to attack until you have at least one point. Each successful hit will ~unlock~ the different classes of spells with the same system as the ~stamina~: land a strong hit and you will have access to third level spells, add a weak hit and you will access the fourth and so on. Chrono Trigger In Chrono Cross spells are called Elements and are distinguished by color and type (consumable and non-consumable); there are six colors that contrast in pairs (green with yellow, black with white and blue with red) and you have to take into account the affinity they have with the various characters (Serge, for example, is linked to the white Elements). The Elements must be placed in a grid which determines their use: on the left there are the first level elements and, moving to the right, those of a higher level. It will be up to you to decide where to place the elements taking into account that the further to the right in the grid you place the Elements, the more hits you will have to land in order to use them in battle. As in every GdR Square there is no shortage of ~Summon~ (or evocations), to use which it is necessary to use three spells of the same color in a row; this will fill the upper left meter (Field Effect) and you will be able to ~call~ the guardian associated with that color. There is no shortage of bosses (in this case very tough) who will force you to use careful battle planning to defeat them; however you can escape at any time to review the choices made and return to face them when you are better organized. Let's talk about the game Technically the game is flawless with clean and detailed graphics and with character animations even better than those of Final Fantasy VIII. The completely hand-drawn backgrounds are beautiful and full of moving details. The same goes for the numerous computer graphics movies (made by the same Final Fantasy VIII team) that highlight the most important stages of the game. The spells and evocations of the guardians are also beautiful, taking full advantage of all the graphic effects of which the playstation is capable. The sound is also the best ever heard on consoles and the initial FMV is enough to get an idea of what awaits you during the game; the sound effects however, although well done, do not reach the levels of excellence of the music. In all this good things the only flaw that can be detected is a very slight slowdown when there are too many enemies in the combat arena (nothing serious anyway).In conclusion In short, summing up, Chrono Cross is a title to buy (alas imported) without any reservations; it is, in my opinion, the best RPG currently available on the market (waiting for Final Fantasy IX) and a worthy successor to Chrono Trigger. If I can give you some advice, first play the latter via emulation (but there are rumors of a 32-bit re-release by Square), so you won't miss all the references in this new chapter that will surely enter the history of video games . 16-bit In the period in which 16-bit consoles reigned supreme, a title destined to revolutionize the world of Japanese RPGs was launched on the market. Developed with the help of the great Akira Toriyama (who designed, among others, the ~Dr. Slump~ series and his majesty ~Dragonball~), Chrono Trigger is one of the most popular RPGs ever. Now, five years later, Squaresoft hopes to repeat its success with Chrono Cross, entrusting the task to a new team (which created Xenogears) in which there are some members of the previous team (unfortunately Toriyama is absent).", "date": "2001-01-04", "grade": null}