{"name": "Driver 2", "ref": "https://multiplayer.it/recensioni/driver-2.html", "text": "What's new? There are certainly two striking novelties of this sequel: first of all the very welcome implementation of two-player game mode in spit-screen, which was absent and limited the playability of the first title. It starts from the simple ~go for a run~, to then move on to the more adrenaline-pumping ~cops and robbers~ in which you can challenge a friend by chasing him while he plays the fugitive's car and we play the police car, or vice versa. As for the other two modes, they are still fun, but they serve more to improve your driving style. The second novelty is that of being able to control Tunner outside the car and thus being able to appropriate other vehicles at any time. The usefulness of this new feature, in addition to the obvious one of lengthening our hopes of completing a mission (car destroyed, get out and change cars) is to give variety to them; in fact now about 10% of the game will have to be played on foot. What about old? For the rest, the whole game is divided like the prequel into various missions to be completed, connected to each other by many well-made FMVs that narrate a plot worthy of the best gangster movies. Once again we will have to help Tunner to restore the balance in the criminal life of cities such as Rio De Janeiro, Havana, Las Vegas and Chicago (with Newcastle, home city of the Reflections, included as a bonus), all meticulously reconstructed on the computer. Apart from the already described improvement of being able to take possession of other vehicles on the road, we can see that the traffic in the cities is much higher than before and the curves, absent in the previous episode, have finally appeared. Driver 2 bugs But it is precisely in the missions that the biggest flaws of this game begin to come out; in fact, it seems that the Reflections have not had time to eliminate the various bugs that haunt us in carrying them out. The main problem lies in the graphics engine, which is not very fluid, it struggles enormously to keep up with the detail present on the screen, and in situations where the processor is loaded it tends to drop the frame-rate fearfully until we see shots that also turn into non rare blocks. Other problems are added to this non-negligible defect, such as the switching off of the analog mode of the Dual-Shock between one mission and another; Tunner's poor maneuverability outside the car; some slow loading. All this brings down the excellent level of gameplay present in the game, which however is higher than in the first episode, also thanks to the presence of a good plot, an appreciable variety of objectives, and the high number of missions (40 throughout). In them the artificial intelligence seems to have improved, even if the difficulty in completing them has remained almost the same. Finally, as regards the sound, here too as in the first Driver, there are adrenaline-pumping music at the right point. The speech of the protagonists, in Italian like every part of the game, remains at good levels of translation. PSone vs PS2 So what to say about this ambiguous Driver 2? Surely it was the hasty technical realization that had a negative impact on a truly remarkable gameplay. For this reason, the advice is to take this game into serious consideration, especially if you plan to buy the Playstation 2 as soon as possible, given that by trying it on the new Sony hardware, the slowdowns almost completely disappear and the textures suddenly improve, making it a masterpiece again. playability. 9 Winning team does not change Although Driver had been received by the ovations of the critics and by an excellent sales response, this did not mean it was free from some shortcomings, not so much and not only in the gameplay, but in the technical realization; aware of this Edmonson and his associates (the Reflections) have revised some aspects that for reasons of time had been little considered during the development of the original work. But if in certain points this long-awaited sequel has really managed to improve, there are unfortunately many others that have worsened which weigh heavily in a negative way on the overall judgment of this game. But let's go in order.", "date": "2000-12-13", "grade": null}