{"name": "Gods Will Fall", "ref": "https://multiplayer.it/recensioni/gods-will-fall-recensione.html", "text": "Clever Beans (former creator of When Vikings Attack!) today releases their new game: Gods will fall. It's a dungeon crawler with some good ideas but too many problems. Here is our review of Gods will fall in the Nintendo Switch version. Plot Let's start by analyzing the narrative premise. For millennia, humanity has been enslaved by undefined deities, but the rebellion arises and sends a gigantic fleet against the island of the gods. Supernatural waves wreck all the ships, however, and only eight warriors manage to survive. Our task will be to lead them to victory. During the adventure, we will be able to find scrolls containing short texts that should give a context to each deity. These are a few lines that contain a handful of unclear and forgettable information. The whole plot is actually contained in the final movie: once the game is completed, a sort of final explanation starts which, in less than a minute, illustrates all the ~lore~ at the base of Gods Will Fall. It would certainly have been better if all the details of the (however limited and not original) story of the game had been scattered on the island, so as to intrigue the player throughout the adventure. However, the narrative also continues on another level, namely that of the warriors. The eight characters (graphically randomly generated and also ugly and generic for this) have links with the various deities and with their companions: in various situations, the narrator will explain that a certain character had nightmares about a certain god, while a another is eager to avenge a fallen ally. These little skits actually serve to set gameplay bonuses in motion, which we'll get to shortly, and do little to characterize the warriors. There are also some bugs, with dialogues activated incorrectly. Exploration If the narrative disappoints, can the gameplay lift Gods Will Fall? No, unfortunately not. Don't get us wrong, Clever Beans has clearly had some interesting ideas, but overall it just doesn't work. But let's go in order. The game environment is a small map where there are 10 portals that let us enter the dungeons, with a classic top view. Each area offers a more or less linear path full of enemies to kill. Finally, there is of course the boss. This one has a life bar, visible from the start of the dungeon. Our goal is not to reach it as quickly as possible, but to start damaging it as we explore. As? Mostly you just need to defeat certain enemies, in one case you have to destroy parts of the level. This is one of the interesting ideas of Gods Will Fall and I'm sorry that it hasn't been studied in depth: it would have been better if each level had been almost a sort of puzzle in which to understand a unique method to weaken the boss, while instead it is something mostly automatic and limited. But let's come to a second idea of Gods Will Fall: if a warrior enters a dungeon, he will be able to leave it only after the defeat of the boss. If the warrior is defeated, the entire area must be replayed with another character. The moment we defeat the deity, every fighter leaves the dungeon. Theoretically, therefore, it is possible to fail and lose all the warriors inside the boss lairs, forcing us to start a new game. However, ~theoretically~ is the key: in our game we have always managed, even in the most complex dungeons, to beat the boss within the third warrior. In fact, all we have to do is simply not overestimate ourselves. The ten dungeons are all accessible immediately and can be tackled in any order. The difficulty level is not indicated, so the best solution is to enter it with a weak warrior to test its complexity and then decide whether to put one of the stronger ones at risk. At best, we'll come back when we've empowered ourselves. Combat In fact, fighters have stats and equipment that determine their power. We have Vigor (i.e. life points), Strength, Speed (of movement) and weapon (ranking from one to four). We will have maces, hammers, swords, spears and double weapons. Each has its own attack speed and moveset. In fact, we have a fast attack, a heavy one, a jump to make slam attacks and a dodge which, if used with the right timing, allows a parry (deflection of the weapon) which exposes the enemy to an enhanced slam attack. Finally, we can pick up enemy weapons and use them until they break, even throwing them. The character who beats a boss gets definitive bonuses and the whole team has access to new higher-grade weapons, as well as single-use items (heals, upgrades, uno shield which makes you immune to a certain amount of damage). The aforementioned narrative interludes then activate temporary bonuses and maluses that prompt us to use/not use certain characters in certain dungeons. On paper it all seems interesting, but the truth is that the limited enemy AI and a generic woodiness of the combat system make the experience quite repetitive and not very intriguing. The solution is almost always to throw enemy weapons to do extra damage from a safe spot and then get ahead of the enemies with a heavy blow. Opponents have an attack routine that is always the same and repeat themselves for the bulk of the adventure, visually changing but falling into the same archetypes. Furthermore, after taking damage, it is possible to accumulate ~Bloodlust~ by hitting enemies. By activating the bloodthirst obtained, we will be able to heal ourselves and, depending on the quantity, obtain short-lived bonuses. The system is designed to be exponential, ie: the first segment of Bloodthirst requires several hits to fill, while subsequent attacks double the Thirst already obtained. Having high Vigor, therefore, allows you to have time to accumulate a lot of Thirst to heal yourself, making it the most important stat. You don't need manual skill, just 12 or more stamina and a high-ranking weapon to easily win even the most difficult dungeons. Bosses also fall in seconds and have one or two attack moves maxed out. Therefore, adding a difficulty that drops very quickly, levels limited in design and variety, repeated enemies and forgettable bosses, Gods Will Fall turns out to be a video game of little impact, as well as very short. In a maximum of five hours the end credits are reached and there is no reason to revisit the adventure. Finally, as well as being graphically limited, Gods will fall has huge frame-rate issues on Switch - a patch could fix that, but we always played below 30 FPS during our run, dropping below 20 frames in larger areas. The automatic camera also moves strangely, almost swaying: added to the terrible frame rate, there is a strong risk of motion sickness.", "date": "2021-01-29", "grade": "5.5"}