{"name": "Spire Blast", "ref": "https://multiplayer.it/recensioni/spire-blast-recensione.html", "text": "Do you know the classic Jenga, that board game with wooden bricks in which the goal is to build a tower and then take turns extracting the aforementioned bricks trying not to make it collapse? Well, because the new Orbital Knight title, available on Apple Arcade, asks us to do exactly the opposite. Dealing with a long single player campaign and levels that gradually become more complex, we will in fact have to deal with towers higher and higher, which we will have to try to drop by shooting bullets of the same color as the bricks we want to eliminate, thus trying to undermine the stability of the structure until it collapses. Are you having fun? Find out in our Spire Blast review. Gameplay Through a rigorously vertical display, Spire Blast's gameplay is immediately very simple but far from trivial. As mentioned, we are presented with a colored tower in each stage and our task is to bring it down by shooting projectiles of different shades and trying to hit the bricks of the same color to eliminate them. It is clear that making the load-bearing elements disappear will result in in a collapse of the walls, as the blockbuster Angry Birds taught us all too well, with which the title of Orbital Knight shares the attention for a physical rendering of weights but not of materials. The variable in this case is therefore represented by special blocks and unpublished situations (see the dragon to be fed with a certain number of bricks) with which we will have to deal as we go forward. The touch controls are extremely immediate (even if in some moments they lose reactivity) and require the use of a single finger, with horizontal swipes to rotate the tower and a simple touch to shoot against a specific brick. It is also possible to exchange the projectile with the one immediately following it, where this shade is useful, and to use three different types of special maneuvers. The latter make it possible to resolve otherwise rather complicated situations, given that at a certain point precise objectives begin to appear to be respected for the completion of each mission, beyond the fact of having a limited amount of shots. To buy them you can use the gold collected with each victory, since of course there are no microtransactions. Structure and technical realization As mentioned, Spire Blast can count on a rather long campaign, visually represented by the traditional map on which the individual missions and the ~stars~ that we have earned by completing them appear. The feeling, however, is that the game was actually born as a freemium production and only later did the developers transform it for its debut on Apple Arcade. In any case, we are talking about aspects that do not change the final result, solid and convincing even from a visual point of view: the increasingly tall towers are a good show, extra elements such as the dragon, the special bricks or the shields appear well done, and the action is accompanied by nice music, which does not enter the head but does not disturb either .", "date": "2021-01-27", "grade": "8.0"}