{"name": "The Last Worker", "ref": "https://multiplayer.it/recensioni/the-last-worker-recensione.html", "text": "If we took a break from our lives and stopped to reflect on their absurdities, we would surely come away sick of it. Capitalism, consumerism, globalization, all aspects of everyday life so rooted in our experience that they do not cause us the slightest thought. However, the Wolf and Wood development team stopped to reflect, and what it returns to the public is The Last Worker, a narrative adventure with puzzle elements characterized by a captivating script and excellent acting performances. The version we have reviewed is the most engaging one, namely the one in virtual reality. We therefore tell you our experience in the review of The Last Worker for PlayStation VR2. Incipit and narrative cut The narrative scenario of The Last Worker is dystopian but not so far from reality The Last Worker opens with a short incipit in which the setting and background of the protagonist, Kurt, is explained. The man works at Jungle, a dystopian version of our Amazon. In fact, Jungle ships everything all over the world, and this is our Kurt's job. Sitting on his hovercraft, his job is to check and send packages, or possibly take care of returns. Once there were many workers in the company, and at that time Kurt even had a partner; little by little, however, the Jungle has replaced the fallible human labor with robotic systems ... but not Kurt. In fact, ours is a model employee, never replaced by an automated system and, therefore, the only human worker in his shipping structure. Kurt lives and works in that building, spending his days shipping packages in hopes of not getting fired. To keep him company a small and annoying robot, Skew, voiced by the always masterful Jason Isaacs. Kurt's monotony is broken when a group of activists contact him, asking him to find information about the Jungle and help them destroy it from within. The story itself is more linear than expected but there are pleasant moments and funny jokes. Knowing that the pen behind the Last Worker is Jrg Tittel, a writer and developer known for his caustic tones, the expectation was to find himself dealing with a more politically engaged work. Like the best sci-fi stories, The Last Worker is both a reflection of the present and a projection into the future, but where the strong anti-capitalist critique never finds particularly involved expression, remaining rather on the plane of satirical humour. When we saw the announcement we imagined a sort of union between a title like Disco Elysium and a Papers, Please, where the social criticism of the first mixed with the essential yet very painful gameplay of the second. Gameplay phases The gameplay is divided into two distinct phases The adventure is essentially divided into two distinct phases, in which Kurt will complete different tasks: on the one hand there are the expedition tasks for the Jungle and, in parallel, the espionage ~jobs~ for the activists. These moments are distinguished by two different gameplay mechanics, which rarely cross during the 5/6 hours necessary to complete the game. In both cases we will always have control of Kurt's forklift, which will be the main method of transport. Always available to the protagonist there will also be the gun with which to grab and manipulate the packages, which will evolve during the adventure. During Kurt's shift, we will have to orient ourselves in the gigantic structure to retrieve the right package, using a holographic compass, verify that the box is of the size and weight indicated, evaluate any dents and take it to its destination. After this phase of analysis and delivery, we will be able to know the contents of the box, then receiving an evaluation for our work at the end of the day. When Kurt is on a mission we will have to face stealth and puzzle phases Dismounting from the turn, we will follow Kurt in his spy actions: here the gameplay changes completely, offering stealth phases and small puzzles to solve. Given all the process of robotic automation, these moments of play will be very mechanical, reducing everything to a lot of observation and timing. The patrolling robot guards have standard vision cones and movement speeds so it will be enough to analyze the situation well and take your time, ditto for electric walls or other traps that will hinder Kurt. Unfortunately neither phase really manages to find a maximum peak, making The Last Worker an interesting but somewhat held back experience. There are rare moments where the player is asked for something a little more complex than the standard effort, but they are quite sparse throughout the adventure. We do not knowif the repetitiveness of the mechanics is intentional or casual: on the one hand, it could be read as a device to convey the melancholy of Kurt's life, but, if this were the case, then the undercover phases should be markedly more adrenaline-pumping and put us in front of really shocking moments. Technical compartment The choice of cell-shade is spot on for The Last Worker The Last Worker has been released on multiple platforms and, as anticipated at the beginning, we tried it on PS VR2. The title performs well from a technical point of view and the stylistic choice, characterized by cel-shaded graphics, gives personality to a setting that would otherwise remain quite monotonous. Unfortunately, the mobility of the protagonist undermines the possibility of including multiple navigation systems in VR, opting for only fluid movement mitigated by a not always effective vignetting. If you suffer from motion sickness The Last Worker is not exactly the title that we feel like recommending to you, despite the story and game mechanics being perfectly suited to the platform and, indeed, perhaps it is precisely this that makes the experience a little more stimulating than the flat version. The problem is precisely given by the transport system, Kurt's hovercraft, which can move both horizontally and vertically. The smooth navigation could give some problems to VR sufferers The strong verticality of the levels certainly gives dynamism to the game world, but at the same time in virtual reality this aspect could be highly destabilizing. Kurt's floating forklift also frequently gets stuck in corners, since the rotation is only six degrees. The controls are well responsive and the vibration of both the viewer and the controllers are well implemented. On the technical front, perhaps the part that we liked the most is the audio sector, with a multitude of sounds that repeat themselves rhythmically in the background. The noise of robots, machines, gears, scans and all the symphony that the Jungle fortress produces really enters the ears, together with the splendid accompanying music.", "date": "2023-04-05", "grade": "7.5"}