{"name": "Override 2: Super Mech League", "ref": "https://multiplayer.it/recensioni/override-2-super-mech-league-recensione.html", "text": "There are two types of human beings: those who enjoy it during the Christmas holidays, and those who instead work to offer readers the review of Override 2: Super Mech League as soon as possible. The writer - for better or for worse, perhaps in this case for worse - falls into the second category. Beyond the results, which will be discussed a little later, it is still important to underline the publication of Override 2, sequel (in terms of content, numbers and in ideas) of that first Override: Mech City Brawl which landed on consoles and PC exactly two years ago, on the occasion of Christmas 2018. Since then several aspects have changed, and where possible the franchise has evolved; then let's see why (and who) should be interested in the new production published by Modus Games. Plot? More or less Override 2: Super Mech League would also have a plot, but it is better to use the conditional: in fact it is so limited and sketchy that, more than narration, we should talk about ~lore~. That is, a general narrative context also common to the previous Override: Mech City Brawl, from which Super Mech League openly restarts. Thus several years have passed since the wars between the mechas and the kaiju that had invaded the Earth: now the planet is at peace, and given that battle robots never go out of fashion, human beings have seen fit to build a particularly market around them. lucrative, and a real sport that receives continuous acclaim. The identity of the player is not clear, which is always vaguely hinted at in the background: the undisputed protagonists of the production are the mechas. And in addition to the mecha also Zoe, halfway between the brilliant mechanic of the sector and the sports agent. It is Zoe who will introduce you to the world of Override 2, explaining well how, when, where and why the big robots fight, and what are the possible job opportunities with them. Basically, the player is offered different leagues and competitions in which to participate, to unlock credits on credits, build a name and buy (then upgrade and customize) the mechas in his possession. The set of these narrative cues, which continue occupying a balanced number of hours, constitutes the plot of Override 2: Super Mech League; you might also consider Zoe's lines and lines of dialogue interesting, in which she will tell you about her life, some details about the game world and the stories of her grandmother in the great war of the past. But that's all, more (for the moment) is not given. Gameplay: Go down to the arena Override 2: Super Mech League is a particular fighting game, and the main reason for buying for all interested parties lies (or should reside) in the gameplay. Explaining it and starting to practice it is very easy, while it is more complex to master it adequately at advanced levels. The battles take place within individual arenas (Override 2 offers a dozen of them) of limited size, where a certain number of mecha battle at the same time. The standard match is 1v1, against a robot controlled by another real player (online or locally) or artificial intelligence (CPU). Regardless of the variations in the combat rules, the possibilities remain the same. That is, each robot has a very specific moveset available, made up of two light attacks (kick and punch, with L1 and L2) and two charged attacks (R1 and R2). Each mecha can also get up quickly after being knocked down (X), dash and jump, dodge incoming shots (Circle). Finally, a certain number of combos enriches the player's possibilities: the basic combos are linked to the rapid pressure of L1 + L2 + R2, but it is also possible to simultaneously combine the front (R1 + L1) and rear (R2 + L2). If the amount of damage inflicted remains almost the same, obviously the individual attacks, even scenically, launched by the robots change; and the fighting style changes, given that the ~heaviness~ of the single character and his movement possibilities vary from mecha to mecha. The possibilities of Aura (a mechanized angel) and Sprinkles (candy-powered damsel), for example, will initially seem limited; then you will understand that both characters give their best in a certain chain of combos, or in very specific situations. Playstation 4 trophies On PlayStation 4 and PlayStation 5 Override 2: Super Mech League offers two distinct platinum trophies, but still obtainable by respecting the same conditions. That is: unlock all the unlockables, obtain all the obtainable, boast the S rank in a league, get 15 more mechas, and much more. In short, you will certainly have to play quite a bit with the title in question; also consideredere that currently matchmaking, well... there is and there isn't. Mostly there isn't. Contents: quality and quantity From the point of view of content Override 2: Super Mech League spares no chance: the player will immediately have 20 mechas at his disposal, all different and immediately recognizable, in order to be able to choose the one that stylistically pleases him the most, and which from the point of view from a gameplay point of view responds more to his way of playing. Later, some customization and purchase possibilities are also unlocked, through the garage: but it is nothing really fundamental, on the contrary in most cases it is the mere application of questionable aesthetic objects to your favorite robots. The variety in the proposed arenas and the game modes present is also good: you can choose between 1 VS 1, 2 VS 2 clashes, or between customized mini-tournaments in which several robots take over, and again between totally different modes. In the latter cases you will either have to complete very specific tasks, or respect new victory conditions: for example, launch the opponent in a certain point, or occupy an area without letting your rivals conquer it. The entire title can be played online against real enemies, even the main story (i.e. Competitions). However, matchmaking very simply cannot find other challengers on PlayStation 5 for now, and this for obvious reasons: the Sony console is not yet widespread enough, and those who own one may have preferred to buy other titles than Override 2. The Competitions they can still be played against the CPU, while the online Versus mode remains unusable for now; you'll have to fall back on local multiplayer, just in case. Defects We have tried to illustrate the main strengths of Override 2: Super Mech League: lots of content and sufficiently varied, good amount of playable characters, also able to offer different fighting styles. This does not mean that Override 2 also has numerous defects, many of which prevent it from reaching full sufficiency. Overall, the title is a good fighting game between mecha, but without particular virtuous elements; and those few virtuous elements are counterbalanced by the negatives. Starting with the size of the arenas, which are simply ridiculous: they are too small. There is not enough space to design real strategies, and in most cases the player bumps either against indestructible elements of the scenario (the writer managed to get stuck in a rock) or against random power ups, which simply have to be collected at random and just as casually hurled. The scenographic elements are a further obstacle to understanding what happens on the screen, between lava, boats in the water and buildings in the city areas. The situation quickly becomes confusing in 1VS 1, let alone with more robots on the screen when you simply switch to randomly repeating keystrokes in the hope of hitting and eliminating someone present. All of this is largely aided by an unmanageable, annoying and stupid camera and a lock system on opponents that is such in name only. Finally, technically speaking, Override 2 is not a phenomenal title on PlayStation 5: it does not exploit the possibilities of Dualsense in any way, but regardless of this it also shows discrete frame rate drops on a console that would be able to handle much more complex and full-bodied titles. The soundtrack, anonymous and repetitive, is also perfectly forgettable.", "date": "2020-12-29", "grade": "5.5"}