{"name": "Marvel Realm of Champions", "ref": "https://multiplayer.it/recensioni/marvel-realm-of-champions-recensione.html", "text": "We have been waiting for a long time to be able to write the review of Marvel Realm of Champions: the new tie-in created by Kabam for iOS and Android devices draws on some of the lesser-known narrative implications of the famous comic universe, catapulting us into a world where alternative versions of the most famous superheroes do battle. The scenario that opens before our eyes is that of the Battleworld, the remote planet that we learned about during the first Secret Wars, until recently controlled by the powerful Master. Without him, this wild place has once again become the center of a bloody battle between champions, and we will have to fight to survive in the New Universe. Loot Let's start by saying that there is one thing that Marvel Realm of Champions does very well and that Marvel's Avengers is lacking, rather blatantly: the aesthetic customization of the Champions through the equipment of the loot conquered during the matches, which the game bestows with surprising generosity. This is probably the most interesting aspect of the game for fans of the House of Ideas, given the large amount of objects that can be obtained and with which to change the appearance of your characters, obviously referring to the many sagas that they have visas involved. The interface lends itself to very fast and intuitive management, allowing us to upgrade worn parts and disassemble unused ones. Structure Then obviously there is the discussion relating to the structure, i.e. the contents with which we will be able to grapple with in order to unlock these objects and the seven Champions that currently make up the Marvel Realm of Champions roster: Hulk, Iron Legionnaire (Iron Man base), Black Panther (female), Supersoldier (Captain America base), Storm (Apocalypse version), Web Warrior (Spider-Man base) and Sorceress Supreme (female variant of Doctor Strange). To be a freemium product, it must be admitted that a lot is obtained in a short time and without spending any money: the section linked to the rewards is filled with gifts for each game won and you can therefore have fun modifying and developing the various heroes while you grapple with three different modes: Conquer Arena, Fortress and Deathmatch. Conquista Arena is a stipulation that starts from the rules of MOBAs but declines their mechanics in a purely action field, within three-on-three multiplayer-based clashes in real time. The map is very small and this unfortunately prevents matches from aspiring to any thickness, but the values on the pitch are those that fans of the genre know well. The goal is to destroy the opposing BODOK after capturing the central area, and to do so you need to land two or three sorties.Fortress is a cooperative variant in which three players must work together to defend their base against three waves of enemy-controlled opponents. artificial intelligence and finally led by a boss (yet another alternative version of the Champions), while Clash Mortal is a death match involving three teams of two players, called to carry out the greatest number of eliminations within a time limit. Gameplay We were talking about the action declinations: although the starting formula of Marvel Realm of Champions undoubtedly draws on the MOBA genre, the control of the characters is direct and takes place through the use of a virtual analog stick placed on the left side of the touch screen, while performing a swipe on the right side it is possible to perform a useful dodge to avoid potentially harmful attacks. Always touching the right side of the screen you perform the basic attacks, holding down you switch to the powerful ones and there are three different icons for as many special maneuvers, different for each Champion and characterized by a more or less long cooldown period. Depending on the situation and the forces in the field, making the most of these moves proves essential to be able to aspire to victory. Also on this front, moreover, the developers have studied the characters well, assigning them characteristic attacks: Iron Man who uses repulsors, Spider-Man his cobwebs, Hulk his disruptive force, and so on. there is to despair: after a few seconds we will be able to get back on track thanks to the respawn, in the hope that it is not too late. The brevity of the matches and the small size of the map, which we have already mentioned, make a scenario in which a team could aspire to a miraculous comeback unlikely. Technical realization As expected, Marvel Realm of Champions is chock full of beautiful artwork but the actual graphics are also well done, although there are no settings foradjust it according to the device and therefore increase the rendering resolution, apparently not very high. Once in battle the small size of the characters inevitably sacrifices detail, which is a shame, but the animation set appears rich. We have already mentioned the excellent interface, which allows you to manage characters, loot, upgrades and all the rest with incredible speed and immediacy, but the touch controls also deserve applause for their precision, responsiveness and for some small but important tricks, such as the virtual stick that automatically repositions itself when we touch the screen. The rendering of the impacts is typical of MOBAs, unfortunately: don't expect the shots to have pure action game feedback. This element certainly takes away something from the fun and general enjoyment of the experience, in concert with a collision detection that is sometimes lacking, especially as regards hand-to-hand combat. Finally, a note of demerit for the music: it could really be done just to endow Marvel Realm of Champions with a thick soundtrack, but the solutions adopted in this case appear a little too repetitive and lacking the epic nature that we would have expected from a tie-in of this type, with so many heroes and atmospheres close to those of the final battle of Avengers: Endgame.", "date": "2020-12-23", "grade": "8.0"}