{"name": "Gears 5: Hivebusters", "ref": "https://multiplayer.it/recensioni/gears-5-hivebusters-recensione.html", "text": "The review of Gears 5: Hivebusters has allowed us to try again the extraordinary experience of the shooter signed The Coalition, which is enriched with this DLC by a beautiful campaign lasting about three hours in which the origins of the Scorpio Squad are told. of the three protagonists of the Escape mode, the ones we usually see wearing a respirator, getting swallowed by a Snatcher and then coming out of the cocoon to place a chemical bomb in the center of a beehive and pave the way to escape with a shotgun. Well, what is the origin of the curious procedure? And who are these characters? The Gears development team has decided to tell us about it with a package that can be purchased for 19.99 euros, but whose download is free for all Xbox Game Pass Ultimate subscribers. History The story of Gears 5: Hivebusters begins with an island mission in which former COGs Jeremiah Keegan, Leslie ~Mac~ Macallister and Lahni Kaliso face off against the creatures of the Swarm but also discover the existence of a mysterious beast who somehow manages to counter the Locusts using a lethal acid. Returning to report from Colonel Victor Hoffman, the three decide to get to the bottom of the matter and to find out what secrets are hidden in this remote place, revealing an uncomfortable truth dating back to start of the war as they face ever more lethal hordes of enemies. Starting from the comic miniseries of the same name, Hivebusters undoubtedly has the merit of introducing literally explosive situations, many of which are new to the Microsoft franchise, but to do so without losing sight of the solidity of the narrative and the characterization of the characters. The feeling that Keegan , Mac and Lahni were mere ~skins~ for Escape mode disappears in the course of this extra campaign, where the three soldiers reveal their past as they struggle to survive, eventually becoming more than just teammates. A journey rendered very well also in the Italian version, thanks to the excellent dubbing (especially that of Mac). Gameplay The interesting thing about Hivebusters is that it does not introduce particular novelties in terms of gameplay compared to Gears 5: there are no new weapons or enemies, apart from one important exception, and what we are faced with in the course of the three hours necessary to complete the campaign is basically a reshuffling of already known and acquired mechanics, to which only the speech of the Ultimate that can be upgraded by collecting specific objects is added. Despite this, the expansion is capable of keeping us literally glued to the TV while exploratory phases alternate, meaningful dialogues and of course the firefights, which on the normal difficulty level only in rare cases prove to be sufficiently challenging. Naturally, nothing prevents you from playing and replaying the story at a higher degree of challenge, perhaps in a cooperative relationship with two other friends. On the bestiary front, nothing is missing: the creatures of the Swarm gradually increase in number while more tough and threatening types are introduced, up to real boss fights, even quite chaotic. There is even room for some stealth action, where desired, but the game provides great freedom regarding the approach and is therefore not limited in any way. Obviously, among the six chapters of the DLC, a sequence could not be missing which closely resembles the aforementioned Escape mode, and in which Keegan, Mac and Lahni have to flee like hell from a beehive after releasing a gas that kills the Locusts in a few moments but which is also toxic to humans. The variety of situations, however, is surprising as well as the goodness of the artistic direction. Technical realization There are truly evocative moments in Gears 5: Hivebusters, others frenetic and incredibly spectacular, to the point of making it difficult for the dynamic scaler we relied on to obtain granite 60 fps on PC, despite the 4K resolution and the adjustment of all parameters at most. With the same values but without this expedient, our configuration does not go beyond 30 fps, and it is a pity that today DLSS is still missing among the options: it would be interesting to make a comparison between the two technologies. However, there is not only technique in this DLC. As mentioned, we found the art direction of Hivebusters to be excellent, with some atmospheric moments and truly evocative landscapes. In one of the final stages, as we were about to explore a green setting while a round of acoustic guitar accompanied us, we couldn't help but think of a tribute to The Last of Us 2: who knows if this was really the intentionand the developers.", "date": "2020-12-21", "grade": "8.0"}