{"name": "Call of the Sea", "ref": "https://multiplayer.it/recensioni/call-of-the-sea-recensione.html", "text": "Lovecraft's mythology has always been a boundless basin from which to draw, in small or large part, to give life to stories and experiences that eat away at the sure contours of reality to filter a madness where everything stops being as it seems: a slow descent in horror which, not surprisingly, has always stood as a reference genre for many video games that have been inspired by the American writer's cosmogony. Just think of the more recent Black Mirror, Call of Cthulhu and The Sinking City, which have built themselves around the purest horror. It is therefore surprising to find similar themes in Call of the Sea, the debut title of the Out of the Blue studio which makes the Lovecraftian myth the cornerstone of a colorful and fascinating adventure - in which the madness of those who come into contact with the Ancients is always perceivable but in a different, less horrific way. There is a sense of ineluctability in the story of the protagonist Norah, but there is also room for a feeling as pure as love to filter through and the point up to which it can push us to save those we love. Our Call of the Sea review will show a game that is not perfect but which is undoubtedly an excellent business card for the Spanish studio. History The protagonist of Call of the Sea is Norah Everhart, a young woman afflicted by a disease of unknown and hereditary origin which manifests itself in the form of strange spots on the skin, while weakening the body and spirit in an increasingly evident way: slowly but inexorably, has folded Norah up to make it at times the specter of the sunny woman she was and that is why Harry, her husband and companion, decides to leave with an expedition to a remote Pacific island to find an impossible cure. If she didn't, Norah would die just like her mother and her grandfather did. Reassured by the initial letters that were sent to tell her of the journey and of any discoveries, the woman however finds herself having to leave in turn when she stops receiving news and finds a mysterious ritual dagger delivered together with synthetic coordinates on where to go: worried for what may have happened to her husband, Norah takes courage and embarks on a journey in search of him destined to reserve many surprises for her. As we have written, Call of the Sea is loosely based on Lovecraftian mythology (as stated by the developers themselves) but takes a completely different direction from the horror to which many productions have accustomed us. No cultists, human sacrifices or deities that it would be better not to disturb but rather a series of surreal and dreamlike dynamics which, inspired by the father of Cthulhu, give life to a colorful adventure even in its darkest features, a story of love and resilience in which Norah's willpower and love for her husband are put to the test, which will push her deeper and deeper into a bittersweet story in which the last word will be up to us players. The path to arrive at the truth is not long, it requires a handful of hours, nor does it involve threats of any kind. Call of the Sea is a game designed to test your intellect, with a series of puzzles that between ups and downs will lead you to discover what lies behind Norah's mysterious illness. Gameplay Where the aesthetics and the narration are the points in which the game shines the most, also enhanced by the voice of Cissy Jones (Delilah in Firewatch) who makes Norah a multifaceted character and perfectly outlined in her personality, a lack of ambition weighs on the gameplay leads the experience to be a little less stimulating than expected - although it still stages a fascinating adventure that especially in closing raises its head for the final shot. Based on one of the pillars on which the development studio is based, namely puzzles and puzzles, Call of the Sea is a game that revolves around the search for clues and the resolution of more or less complex puzzles. The view is in first person and sorry to note that walking camera effect for which Norah's body does not exist, with the exception of her arms that occasionally appear on the screen to perform certain actions: it loses some immersion when you look down and see nothing, not even the hint of a shadow, but it's not such a deficient detail for the experience. In keeping with Norah's physical state, her movements are rather composed even when running; equally in keeping with the spirit of the game, which intends to tell an incredibly intimate and personal journey, there will be no combat or human interaction during this solitary but profound adventure in the middle of the Pacific. Above all, Norah's voice will accompany us throughout the journey, with anecdotes or rinflections on what is happening that help to enrich the narrative, interspersed from time to time by the letters that Harry has written to her but for one reason or another has never been able to send them. Call of the Sea is, like other games that preceded it, an experience halfway between point and click and walking simulator, in which the puzzles represent the perfect brainy interlude in what would otherwise be a purely narrative adventure. They are witty distractions, although not in all cases they have such a logical resolution as it might seem and it is often easier to proceed by trial and error, which in any case favor the narrative and not lose the thread of the events. However, there are some exceptions in the central phase, where the game undergoes an unexpected and unjustified surge in difficulty that breaks a smooth path. This lack of balance partially compromises the experience, above all because the game does not prepare us for such a sudden turn and where generally it is enough to combine the spirit of observation with lateral thinking, right in the middle we find ourselves forced to an effort that does not matches what has been experienced up to that point. Technical and artistic sector Also in this respect Call of the Sea is convincing, although there are reservations: the debut title of Out of the Blue is less refined and cared for than expected but many of its limitations are hidden by a good artistic inspiration. With the exception of a few postcard views, in general the impression one gets of this apparently uncontaminated and lost island in the Pacific is that of a more artificial setting than one would have expected for a sort of natural paradise. There is little next gen but it is more a note than an attributable defect, above all because at a glance the game still manages to remain impressed due to the vividness of the colors, so strange for an experience that has its roots in the Lovecraftian myth. However, we must not forget that Call of the Sea is above all a narrative adventure aimed at exploring the depth of a complex and only apparently banal feeling like love, which can take on different facets. In this Call of the Sea convinces and, thanks also to being available on Game Pass, undoubtedly deserves a chance.", "date": "2020-12-20", "grade": "7.3"}