{"name": "Drawn to Life: Two Realms", "ref": "https://multiplayer.it/recensioni/drawn-to-life-two-realms-recensione.html", "text": "We return with the review of Drawn to Life: Two Realms, finally ready for the final verdict on the production of Digital Continue, published today by 505 Games on mobile devices, Nintendo Switch and PC. The name should evoke some pleasant memories in you: it was the years of the Nintendo DS, and the new franchise known as Drawn to Life showed the player all the potential of the portable console's stylus. These were adventures lived with strokes of stylus, creativity and colors. This new chapter tries to remain faithful to the original soul of the series, but also taking it a little further in terms of ideas and its potential. Structure Let's start from the structure of Drawn to Life: Two Realms, that is, from the way in which the main adventure was organized by Digital Continue; we had begun to analyze this aspect in the trial. Once you have purchased the title, you will start again from the well-known (or maybe not, but you soon get into confidence) city of Rapoville. It is a nice world in which equally nice little creatures live, halfway between kittens and turnips. Once again, this reality is endangered by the darkness. Very soon, therefore, the second ~realm~ of the game (which is called Drawn to Life: Two Realms for a good reason) is unlocked, namely that of Belleville. Human beings live here, completely unaware of the existence of the world of Rapoville: the passage between the two worlds is allowed only to those who are in possession of the Book of Imagination. A lot of luck for the protagonist of the story, who receives one a few minutes after the start of the adventure. Drawn to Life: Two Realms oscillates continuously between Rapoville and Belleville: depending on the needs of the plot, the player switches from one to the other, not always according to his will. He must then complete now the missions of the turnips now of the human beings, in order to please everyone a little; these short-term goals add up to make up the long-term goals. The final task will in fact be to defeat the bad guy who wants to dominate both realities. The possibility of exploring two different worlds, with a fair amount of freedom in exploration, is perhaps the main novelty within the series. Gameplay Cornerstone of Drawn to Life: Two Realms are the creative possibilities related to the gameplay. In both worlds, in fact, there are various levels, each of which must be completed by taking full advantage of the mechanics, which oscillate between the platform and the puzzle game. Before you get confused, let's explain in detail how things stand. The levels are small, but very dense and made with extreme care: in short, no detail is out of place, or left to chance. Some players will be able to spot the right path right away, at first glance; but continuing in the adventure it will take more time. The main objective is to get from point A (left) to point B (right), the latter consisting of a dimensional door. And to do this you will have to rely on platforming, that is, jumping from one platform to another, going down, climbing up, bouncing on enemies, and much more. However, this is not enough, because often the point of arrival will present various types of obstacles to be circumvented or rendered harmless. And this is where the puzzle game mechanics come into play: you will have to exploit the environmental elements to your advantage; later accessories or particular objects will be required to be collected in other points of the level, for example by eliminating a specific enemy (rubies and other precious stones can open otherwise impassable doors). It should be noted that, except in rare cases, Drawn to Life: Two Realms does not present forms of violence. Everything is sweet and cuddly, and the enemies take the form of animated toys (they're called ~toys~ in the context of the title). This aspect also makes the production of Digital Continue simply perfect for the little ones. Creativity and customization Creativity and personalization are two fundamental elements of Drawn to Life: Two Realms; fans of the franchise will rediscover the peculiarities that have made it instantly recognizable since the Nintendo DS years. The protagonist, for example, must be created from scratch using a very nice and full of possibilities drawing editor. It's not that you are forced to be Michelangelo: for the laziest there are pre-loaded models, which you can then color as you like. Funny and bizarre ideas pop up everywhere, just note that the writer has completed the adventure by impersonating a skeleton with a hat, all done in yellow and purple. Style above all. Further on, continuing in the aadventure, the possibilities increase, with stickers to customize your creation and also with new objects with which to furnish the game world, or to deliver to other NPCs. Does Mike need a new watch? You go back to the editor and create the clock from scratch to your liking, color it, customize it; or, if you are in a hurry, you can take advantage of the model already provided by Drawn to Life: Two Realms, at the most by coloring it. Nothing is ever definitive, you can go back to your drawings at any time via the pause menu. Drawn to Life: Two Realms is clearly aimed (also) at those who love to draw, but it's not an exclusive game for artists.", "date": "2020-12-07", "grade": "7.2"}