{"name": "Sakuna of Rice and Ruin", "ref": "https://multiplayer.it/recensioni/sakuna-of-rice-and-ruin-recensione.html", "text": "Before going into the review of Sakuna: Of Rice and Ruin, it is right to say a few words about the software house that created it. Edelweiss is an independent studio formed by only two people, which has never missed a beat so far. He is not well known, because he has always made niche titles, such as the excellent classic shooters Ether Vapor and Astebreed, and the action Fairy Bloom Freesia (to which Sakuna owes a lot), but he deserves much more appreciation from the gaming community, especially the one passionate about Japanese titles. Sakuna: Or Rice and Ruin is Japanese to the core, so much so that it proudly displays its origins, of which not only the representation, but the gameplay itself is steeped. Wanting to define it, it is a cross between Harvest Moon, a 2D action (the authors spoke of Devil May Cry and ActRaiser as the main sources of inspiration) and a Japanese role-playing game, therefore a title with marked management elements, but also many fights and a particular focus on storytelling. History Sakuna is the goddess of the harvest. In appearance she still looks like a young girl, but in reality she has an age that goes far beyond the normal life of a human being. She is also spoiled and snobbish, to the point that at the beginning of the game we see her drunkenly attempting to drive a group of starving humans out of the world of the gods. His attempt will not only prove in vain, but will also result in a disaster: the explosion of the warehouse containing the offerings for the mistress of the divine world, Lady Kamuhitsuki. As punishment, Sakuna is exiled to an island teeming with demons, called Hinoe, in order to take control of it. To help her precisely those humans who triggered the whole story, with whom over time she will develop an ever deeper relationship, based on sharing work and understanding problems of the lower world (that of humans ed), which she simply ignored before. From a narrative point of view we are therefore faced with the classic tale of growth and maturation, with the main character who will change a lot during the story, supported however by a multifaceted gameplay, which makes it richer than it might seem at first gaze. Management side Once on the island, Sakuna and the humans settle in a small house in front of some agricultural land and divide the tasks: she will hunt and they will devote themselves to agriculture and other activities, such as cooking, weaving or building equipment. In reality, the little goddess soon has to get busy personally with the cultivation of rice, to which she is inextricably linked: the more good the rice produced in the fields around the base, the more her statistics improve. After all, she is a goddess of the harvest, like her mother, so that is bound to be the case. This means not only that the managerial side directly influences the action one, but also that the player is led to pay much more attention to its various aspects, so as not to have penalties in the fights. So during the game Sakuna plants the rice, removes the weeds from the field so they don't suck the nourishment for the plants, regulates the level of the water that submerges it, collects it and finally works it, trying to get the best product possible. Then, with the passing of the seasons, he has to carry out other tasks, such as tilling the soil after winter to make it softer, creating fertilizer by mixing excrement with objects found during hunting sessions, useful for improving the quality of the rice, and engage in command activities, such as sending humans to gathering points to find raw materials or fulfill their wishes, such as constructing buildings useful for the production of items. In the meantime he will also have to take care of preserving the food and always find fresh, deciding from time to time the dinner menu. In addition to filling her up, the quality of the meals improves her stats for the next day. For example, it can give her a longer automatic energy recovery time while hunting (Sakuna does not have any healing items and energy only recharges out of combat), or it can make her stronger. In addition to working with them, Sakuna talks often with humans, who willingly tell him their personal stories, their customs and their motivations. In particular, during the dinners many interesting details on the mythology of the game are learned, with the words of the protagonists that soon become a direct contact with the balances that regulate the two worlds, that of humans and the divine one, balances that are the main theme of the entire adventure and which find their maximum expression in the representation of the relationship between Sakuna, humans and the fieldsof rice. The developers have focused so much on this aspect that they wanted to directly reproduce part of the Japanese traditions of rice harvesting, transforming them into a unifying element, that is capable of creating cohesion between the characters. It should be noted that if desired, it is possible to automate almost the entire management part, leaving the most onerous tasks to humans. In reality, this way the game loses some of its meaning and ends up lasting even less (it took us about thirty hours to finish it by doing all the jobs). Furthermore, you give up controlling part of Sakuna's growth, causing the whole to lose thickness (if you have not understood it, it is better not to use shortcuts). Action gameplay But Sakuna: of Rice and Ruin is also a 2D action with RPG elements a la Muramasa: Demon Sword. The little goddess's main task is to explore the island of demons to find new resources and understand the reason for the proliferation of evil. To do this, he will have to go to the unlocked places, clearly visible on the island map, where he will have to carry out the objectives indicated to obtain exploration points, which will unlock new places that can be visited. At the start of the game, Sakuna has only two weapons, which she uses simultaneously: one handed for weak attacks and the other two handed for powerful attacks. She also wears a magical scarf that allows her to stick to walls, so as to reach otherwise inaccessible areas with simple jumps, or to go around enemies, using them as handholds. As the adventure continues, the goddess unlocks various skills related to weapons and the scarf and obtains new equipment (more powerful weapons, clothes, masks and hats), so much so that it becomes possible to manage their progression more completely. If we link the bonuses derived from harvesting rice to this, we get a much more complex character development system than what the early stages of the game might suggest. The enemies are essentially demonic animals, with the bosses being very big, but always derived from the fairs that populate the island. Sakuna must therefore face fire-eyed rabbits, warlike owls, giant boars, black deer and many other creatures, which get stronger and stronger as the game progresses. The hunting levels themselves are often very small maps dedicated to the collection of specific materials or special items, if not boss dens. In general, they all hide some secrets and can be explored several times to be completed, i.e. to obtain all the exploration points. This aspect is exacerbated towards the middle of the adventure, when the need for materials requires repeating some levels. Unfortunately this is an inevitable situation due to how the game is structured and, we imagine, it is also wanted by the developers (not for nothing they are Japanese, so they have grinding in their blood). Nothing really tragic, but someone could be affected. One of the defects of the combat system, at least in our opinion, is the impossibility of hitting enemies on the ground, which wastes attacks and combos. In fact, it is natural to try to finish off an exhausted opponent and, until you get used to the idea of not being able to do it, you often end up uncovering yourself, lending your side to the countermoves of the other enemies. The fact that you're often fighting a large number and variety of creatures at once makes missing shots particularly dangerous. Over time, you get used to and also begin to enjoy the combo system, especially in more crowded situations, but some headaches could have been avoided. Graphics From a technical point of view, the Edelweiss title makes its mark, thanks to a good artistic direction. The style is decidedly anime, both in the modeling and in the visual language used, in particular to represent the emotional states of the characters, but everything makes it really well and goes perfectly with the underlying theme of the game. Naturally we must not expect who knows what technical marvels, given that the graphics were created by a single person, but there is no doubt that there are some excellent things, such as the special effects of the skills or some creatures that are not very complex, but decidedly successful (in particular some bosses). The audio is also on the same level, with very pleasant songs and a decisive but spot-on use of traditional music, which goes well with the general atmosphere.", "date": "2020-11-30", "grade": "8.8"}