{"name": "Tiny Robots Recharged", "ref": "https://multiplayer.it/recensioni/tiny-robots-recharged-la-recensione.html", "text": "Snapbreak is a development studio specializing in puzzle and escape video games, and in this review of Tiny Robots Recharged we talk about its latest production, which really does not take it out of its comfort zone: it is in fact always a puzzle, available in free download on the App Store and Google Play. The fact that the title is a free to play could induce more than someone to turn the page, considering the bad reputation that this label has made over the years: however, it would be a mistake to dismiss Tiny Robots Recharged in this way, because it is a video game capable of honestly entertaining for its entire duration, requiring the user only to watch a few commercials between one level and another. Three robots to save The story in Tiny Robots Recharged makes no secret of being a mere pretext to justify the 40 stages that make up the adventure, and in fact it is liquidated in the very first seconds of starting the application with a sequence that sees three automatons being kidnapped by a villain mysterious: it will be up to the little robot protagonist to go and save them, overcoming levels made up of a series of puzzles that lead to the unlocking of the exit for the next stage. It is evident how intuitiveness and immediacy have been put in first place by Snapbreak, for a game that really needs very few trivial tutorial steps to illustrate its gameplay. Framed from an isometric view, the levels are small environments that can be rotated by dragging the finger in search of points of interest, on which to tap or swipe to perform various types of contextual actions: a touch and you can collect a key object, a few swipes will serve to remove the debris that hides a useful element, while with a rotation of the finger on the touchscreen it can lead to opening a container, tightening a bolt and so on. These are just a few examples of a level design which, although based on a few concepts, always tries to propose something new during the adventure, actually succeeding quite well: Tiny Robots Recharged rarely shows moments of tiredness, proving to be enjoyable and stimulating from the beginning in the end. All without however pressing the accelerator too much on the difficulty, with puzzles that never appear too cryptic, at least in the eyes of those who can boast the completion of some puzzle game or graphic adventure in their curriculum. More than from being able or not to pass an internship (there is also an aid system for those who feel the need), the challenge coefficient is represented by obtaining the proverbial three stars at the end of the level, which are bestowed on the basis to the residual charge of the robot upon reaching the exit: the battery indicator decreases over time, and can be integrated by finding and collecting the three accumulators hidden in each scenario. Speaking of settings, it should also be noted the good work done by the developers as regards the graphics, with the stages that appear almost like dioramas, with great attention to detail and quite diversified from each other, even if equipped with a color palette (deliberately ) tending to rust which after a while is necessarily repetitive. The final merit note, however, can only be addressed to how Snapbreak has decided to interpret the free to play formula, limiting microtransactions to a few optional in-app purchases, avoiding any kind of bottleneck and supporting its work through commercials that appear between one level and another, undoubtedly a bit annoying in the long run but definitely preferable to the sinister forms of monetization that have now become a sad standard in the mobile market.", "date": "2020-11-27", "grade": "8.0"}