{"name": "Destiny 2: Oltre la Luce", "ref": "https://multiplayer.it/recensioni/destiny-2-oltre-la-luce-recensione.html", "text": "We've taken our time (this review comes 85 hours after opening the Beyond Light expansion servers and completing the Deep Stone Crypt raid) and thoroughly explored all the content available so far: we're ready to write our review of Destiny 2: Beyond the Light. The premise is very simple: Destiny 2: Beyond the Light is a new beginning, a restart, a concept that we have repeatedly heard coming from the mouths of the developers in Bungie and which has actually found confirmation once the major expansion has been launched. The cycle of three DLCs (this one, the one from 2021 and the one from 2022) is clearly the ~Destiny 3 project~ remodeled and implemented according to Destiny 2, to avoid further fragmenting a community already very tried by the 2017 schism. This is it is essential to understand to understand the motivations behind some choices, to better judge certain actions. Despite this, these very choices become a double-edged sword, a sword of Damocles hanging over the heads of the developers who have chosen to risk a lot and not to save on ambitions. Countryside and location After the first few days together with the new expansion, we told you our opinions on the Beyond the Light campaign. What accompanies the players during the first hours of the new expansion is a plot full of fascinating branches that draws lifeblood from well-established roots within a sci-fi universe, that of Destiny, unconventional and which also winks to some canons of the purest fantasy. The unicum of this universe is enhanced by the choice, already illustrated several times previously, to put the narrative universe and the events of Light and Darkness at the center of everything. The Guardians therefore embark on a journey, with Beyond the Light, which it will lead to questioning one's own certainties by further thinning the already blurred line between what is right and what is wrong (let's remember that good and evil do not exist in Destiny, everything revolves around two paracausal entities). As far as we are concerned, the narrative of this new expansion and its campaign (net of the problems related to Eramis) is compelling and stratified, divided equally between the main campaign, end-game activities and raids. If Eramis lacks personality and bite (despite a solid background), Clovis Bray (or what's left of it), the Unknown Exo and the whole story of the Crypt guarantee a charm that makes us say, from this point of view, that the road is the right one. Even Europe, as mentioned above, is truly a marvel. The Jovian moon is a beauty to behold, a prime example of how locations will play a pivotal role in the universe created by Bungie moving forward. All this also in view of the rework that some of the destinations removed with the Destiny Content Vault (DCV) will most likely undergo. Although the management of fast travel inside the map could have been decidedly better (why not put one for the upper part of the map?) given the size, what the players are facing is a planet full of mysteries, surprises and beautiful to explore. The world building, structured to offer a variety of settings even vertically, demonstrates how Bungie has really pulled an excellent rabbit out of the hat. Vex structures, Golden Age settings and hyper-technological laboratories are at odds with the snowy and icy expanses of Europa's surface, yet they prove to be an irresistible and enveloping combination. Snowstorms and blizzards then add a ~next-gen~ accent to a franchise that has now seen two generational leaps. Endgame and loot activities Having concluded the discussion on the campaign and narrative, moreover deepened in a dedicated article, we dive into the thorny juniper bush made up of end game and loot activities. Once the campaign is over, the player is placed before his eyes a large range of activities and enterprises that are part of the endgame. These activities, which make up the core of the content package that will have to keep players interested, come as a two-sided coin. On the one hand we find the rewards and the basic idea behind these activities, while on the other we find the structure and how they work. The positive side is clearly the first face, able to offer stimulating rewards in all respects (starting from the various types of stasis customization and passing through the new exotic armor) and a very substantial level of challenge especially in the new Sectors Legendary Lost. In fact, this reinterpretation of the famous mini dungeons is incapable of making life difficult for even the most skilled Guardians. The negative side instead lies in the playful structure of these activities, once again based on two versions of farming that are now decidedly heavy and obsolete in concept. Here appears the first major problem of Beyond the Light: precisely farming. The ~repeating activities~ to increase your Power is a classic of MMO-based games and certainly not new for Destiny lovers. The structure designed by Bungie for this new expansion, however, is decidedly more incomplete than normal. Indeed, the revisiting of the search for Powerful Engrams and the drop of Prime Engrams has greatly limited players. To date, the only real way to effectively level up Power is by continuously completing matches in the competitive Crucible playlist (the PvP component of Destiny), effectively forcing players to try their hand at an activity that is not suitable for everyone. The beauty of a title like Destiny has always been the variety of the range of approach possibilities offered to players, with people free to play the title through the method that best suits their tastes, without too many limits. Beyond the Light obliges (being efficient in the shortest possible time is a clear need for all) players to tackle an activity which, among other things, hides numerous problems that have remained unresolved for some time. The component of clashes between the players is in fact marred by a poor sense of reward (even more so now that the companies of the pinnacle have been reduced and the old ones eliminated) and by numerous cheating (on PC) and balancing problems. Farming is therefore a big point against, not in itself, but in the way it was conceived and revised in this expansion. To increase the dose of the less exciting aspects of Beyond the Light there is the loot (we are aware of Bungie's latest statements on the subject, but at present the gist of the speech does not change). Uncovering Pandora's box that lurks under the veil formed by the DCV is difficult, but we will try to face it as best we can. Months ago on the sidelines of the new expansions, Bungie announced the introduction of the Destiny Content Vault (DCV), a content management system for developers that allowed, when necessary and according to the needs of the team, to switch off and on in- game as well as to re-introduce some from the first chapter of the franchise. What followed in the following months, in addition to revealing which destinations would have been ~turned off~, was a series of statements explaining the reasons behind the partial ~turning off~ even of a large part (a good 70%) of the loot accumulated so far. The latter would have been subject to the so-called ~Sunset~ (Tramonto in Italian) or the stop to the infusion of that given armament and a pre-established power cap for weapons and armor subject to Sunset. This choice obviously shows itself as yet another double-sided coin. Those who are accustomed to certain development mechanics know that behind this choice there are hidden reasons of game economy (trying to balance the use of weapons and armor by opening the player's range of choices), but also of redistribution of the loot in sight of a future expansion of the game. On the other hand, however, as a player it is clearly not very stimulating to have your pool decimated from which to draw for the various activities and this leads to a lack of variety in the action as well as a lack of possibilities. Sunset both of the destinations and of the ship offers two interpretations: one positive and one negative. To give a sprinkling of positivity we think two facts: the first concerns the distribution of weapons and armor in what is the whole year of life of Beyond the Light (which also includes the three seasons following the initial one) and that therefore it will propose new introductions in terms of loot. The other is the probable massive insertion of armament within the 2021 expansion. As for the negative aspects, however, we are faced with a huge loss of stimuli for players who like to vary equipment often and for those who want to see your own collection full of memorabilia from past exploits unchanged (the sweat and toil for the Revoker, for example, no one will give it back to the players). Also from the point of view of the locations, it is a pity that unique destinations and moments are removed which, for better or for worse, have marked various periods of the game. Stasis, Season of the Hunt, and raids Out of the aforementioned speeches we have left some considerations on three key aspects of the Beyond the Light experience: the Stasi, the Hunting Seasonai and the raid. As for the manifestation of the Darkness that we will be able to control, or the Stasi, we are faced with a large introduction regarding the playful experience. A new element capable of crystallizing (woe to say freeze, it is in fact a cosmic crystal) anything it comes into contact with, is a real revolution in terms of approach to gameplay and the way to implement strategies. If on the PvE side the Stasi has had an excellent impact in terms of variety and stratification, it is in the PvP that the notes are sore. In fact, the possibility of crystallizing the enemies, rendering them helpless for a few seconds, has made the already complex world of player versus player a real primordial chaos in which the blindfolded goddess plays a more predominant role than necessary. The situation will therefore see the next weeks (although a first hotfix has already been released) full of changes and adjustments to the new subclass. What is good now could stop being good in a flash and vice versa, so it is difficult to judge how long it will take for the situation to balance out. What we can say is that as far as we have seen and experienced, the Stasi has amused us, as well as having intrigued us in lorisistic terms in the phases of approaching and acquiring this new power. To be taken into account, however, is the fact that the customization that can be implemented at the Stasi will continue to evolve over the weeks. As for the Hunting Season that began on Tuesday, November 17, the judgment remains partial given the philosophy of Bungie's Seasons system. Those activities and missions that we have been able to carry out so far are only the beginning of a path that will bring us closer to the next expansion. The return of Uldren Sov, Xivu Arath, the new corruption and all the mechanics of this great chess challenge with Savathun will be revealed over the weeks and over the next few seasons. What we have noticed is a greater narrative contextualization of the proposed activities (something that everyone has been clamoring for some time) and a variation on the theme of the same. The Endofuria Hunts and the various implications that derive from them are an excellent way to begin this approach and therefore from this point of view they give us hope. Even at a playful level, the activity introduces some ideas, such as following the trail, which seem trivial, but which actually contextualize and do justice to the concepts behind these assignments. Finally, a mention of the raid. The end-game activity par excellence is certainly a little gem from several points of view. Although the final boss has blown everyone away in terms of ~who is it~ and ~why is it there~, the Incursion into the Crypt of Pietrafonda has satisfied us in terms of mechanics, settings, structure, set of equipment and fun. We are not facing a level of magnificence and challenge as in the case of the Last Wish, but compared to many other raids, the one proposed with Beyond the Light was really an excellent surprise. On more than one occasion we found ourselves exclaiming astonishment as well as exulting. Moments that made us understand that what was proposed both in the encounters and in the platforming sections were very spot on.", "date": "2020-11-24", "grade": "7.5"}