{"name": "Football Manager 2021: la recensione del manageriale calcistico di Sports Interactive", "ref": "https://multiplayer.it/recensioni/football-manager-2021-recensione.html", "text": "Let's start the review of Football Manager 2021 with an attempt to describe to those who don't know it everything that the Sports Interactive football manager represents. Not an easy feat on the whole, but to accomplish it the smile that you will have seen on the faces of many fans of this series comes in handy when Milan borrowed Diogo Dalot in the last transfer window. In fact, playing Football Manager also means knowing the names of the so-called wonderkids, before they come to the fore of the biggest lights on the world football scene. For more than twenty years now, the Football Manager brand has been more than just a game for its fans, we dare say a real religion that fascinates the many gamers who love football to whom the dynamics of titles such as FIFA 21 and PES 2021 do not enough to satisfy the thirst for football. Like its predecessors, Football Manager 2021 is in fact a three hundred and sixty-degree experience on the world of football, where you can lose hours and hours studying tactics and training sessions, or, as we said, discovering the names of the young talents who will become the Messi and Ronaldos of tomorrow . A game capable of unleashing a real addiction in those who are in front of the monitor, through evenings spent pronouncing the fateful ~another one and then I'll stop~ before realizing that they had spent the night. So, like every year, we went back to sitting on the bench to see what the team led by Miles Jacobson has prepared for us, grappling with a season strongly affected by the Covid-19 pandemic. New interactions, old problems One of the most interesting news of Football Manager 2021 is, at least on paper, the new way of interacting that our coach has with the various figures who populate his day when he is not studying tactics and preparing matches. Relations with players, technical staff and the media are in fact a central aspect of the life of every manager, and for this chapter the developers have decided to intervene precisely on a series of dynamics that have already shown all the signs of their age for several editions. Most of the answers that we find ourselves giving during an interview is now accompanied by the possibility of linking our words to a specific body language, which with its options thus replaces the words ~calm~, ~assertive~ and so on. saying that they were instead present up to Football Manager 2020. The possibility of making gestures such as pointing the finger or spreading one's arms as a sign of welcome is undoubtedly a step forward to generate less confusion in the player when replying, but the main problem in the relationship with the media it unfortunately remains present even after the application of this new design. The questions that we are asked by journalists are in fact only to a small extent pertinent and stimulating, resulting instead for the most part repetitive to the point of exhaustion and/or not very interesting. Slightly varying the theme, they are also placed in duplicate both in the press conference and in the tunnel between the field and the locker room, ending up boring the player who is thus forced to send the deputy to answer to shake off at least part of these passages Continuing to talk about interactions, the dialogues in the locker room with the team are the ones that benefit the most from the new body language. While remaining very similar to what was seen in the past, the addition of clearer behavioral options allows the manager to better express his state of mind, thus obtaining a greater possibility of avoiding misunderstandings. However, the way in which what we say is received by the eleven on the pitch is another story, given that in some cases there still isn't a specific reaction where we would expect it instead. Transfers More convincing in general is the ~quick dialogue~ mode, which allows the player to comment on the last match with a squad member or a transfer in just a few clicks, quickly and without leaving the main window where he was until that moment. In a similar way, it is possible to quickly contact the agent of a player we have bet on to buy, asking him to give us information on the availability of the assisted player and on the possible figures that will need to be involved in the deal before making an offer formal to his team. On the transfer front, the new system of periodic meetings held within the club proves to be quite interesting, to obtain progressive feedback on the club's objectives and quickly direct the staff of observers to the roles that need to be covered in the squad. By the waytrading site, after completing a season and having faced three transfer window windows, the impression is that the historical defect remains linked to a transfer market that often exceeds the evaluations of the players owned by the teams controlled by the CPU, resulting vice versa when the same treat the purchase of a member of our team. The artificial intelligence that manages everything in our opinion urgently needs a review, also considering that at the end of the season we managed to sign a player like Gianluigi Donnarumma. On a free transfer, as a free agent after the end of the contract with Milan and without any other team to compete with our Turin. Even if the third place conquered was worth participation in the Champions League unlike the Rossoneri who remained out, the possibility of ensuring the performances of one of the strongest players in the database so easily left us with a few too many doubts about the management of the market from part of the game. At this point it is worth specifying that the version of Football Manager 2021 in our possession for the review is not yet the definitive one which will be released tomorrow 24 November, in which we strongly hope that things like this will not happen. Interface and management In visual terms, the Football Manager 2021 game menu remains very similar to that of its predecessor, thus allowing those who have already ventured into the art of coaching on last year's edition to be immediately familiar with the various sections. Barring a few minor tweaks here and there, the most important options remain where you expect them to be, including the tactics creation screen. The only break from this point of view is represented by the disappearance of the green, yellow or red circle with which the familiarity of a player with the assigned role was reported, replaced by a system of stars placed on the right side of the screen where the list of names appears. Also in this case the changes made leave a few too many doubts, as part of the immediate glance that you had looking at the left side of the tactics screen is lost, starting from the definition of the module in the pre-game, but above all in the quick changes made during the match. Let's go back for a moment to the championship we played, because precisely in the light of the result obtained, we feel like raising some doubts also about the overall difficulty of the game. As already said, with Torino we reached an unexpected third place, among other things with extreme tranquillity. Champions League qualification was practically never in doubt throughout the season, played with the initial squad to which we only added a few young prospects to be employed in the future. Considering that Football Manager 2020 also gave us the same impression after a large number of hours spent in his company, it is clear that the developers must work to better balance the level of challenge. The danger is in fact that of not being able to give the career of the coach on duty a successful mix between growth of the club's ambitions (especially by choosing the lesser ones) and satisfaction for the achievement of the result. 3D engine and match The time to take the field is also anticipated in Football Manager 2021 with a pre-match meeting, streamlined however to accommodate the indications of the technical staff on possible changes to the standard tactic in a single screen. With the possibility of making changes to the upcoming match only, advice can be accepted quickly to move immediately to the green rectangle. It is precisely in the management of the match from the sidelines that other of the innovations reserved for us by Sports Interactive for this edition are concentrated, which start from an almost complete redesign of the screen dedicated to the match. All the management buttons have been moved from the top to the bottom of the screen, where the classic list of players also appears with their mood and level of form. Again, however, we must say that the changes made by Sports Interactive have not fully convinced us. The sensation is in fact that of a loss of the overall vision of the state of the players during the game, up to the 2020 edition effectively traceable with a simple glance at the main screen. Now, for example, an additional click is required to access the detail on the morale of each individual player, otherwise represented by a simple happy, normal or sad smiley on the main screen. Similarly, fitness status is no longer shownor with a percentage value but with a colored heart icon depending on the player's level of tiredness. It is clear that even in reality the energy in the field is not measured with an exact value such as that of a percentage, but in an attempt to make this aspect more realistic, something better could probably have been done so as not to lose ground on the point of clarity Moving on to the 3D engine, even on this occasion we can record some progress from a technical point of view. The twenty-two players on the field can in fact enjoy greater fluidity in the actions thanks to a series of new animations, also generally gaining in terms of contrast with the field thanks to improved management of lights and shadows. The introduction of the xG (expected goals) statistic which measures the number of goals ~expected~ by the two teams contributes together with other analytical data to obtain greater clarity in the phases in which our team fails to score in the face of so many shots taken , one of the problems that actually afflicted past editions. If anything, it seemed to us that the xG estimate evaluates everything a bit downwards, but we'll see how it will be in the version arriving tomorrow. As far as the behavior of the players on the pitch is concerned, we have noticed more realistic game choices by the artificial intelligence. In particular, the impression is that there is no longer the obstruction on the frontline that could often be noticed in the past, thus leading to more heterogeneous game situations in the attack phase. Furthermore, the percentage of goals scored by the attackers also seemed to have increased, but it is clear that to evaluate all these aspects properly it will be necessary to grind up a considerable number of hours of play. Some particularities of the match remain similar to those we already knew. This is undoubtedly the case with the VAR, which while enjoying a change in the way it is invoked remains rather predictable in the outcome of its checks. Finally, we record a good job of optimizing the game, which on the same machine on which we played Football Manager 2020 seems to be able to enjoy a greater level of responsiveness. All this becomes particularly tangible in the game saving phase, significantly faster than in the previous edition.", "date": "2020-11-23", "grade": "6.8"}