{"name": "Call of Duty: Black Ops Cold War", "ref": "https://multiplayer.it/recensioni/call-of-duty-black-ops-cold-war-recensione-pc.html", "text": "With the review of Call of Duty: Black Ops Cold War for PC we want to provide you with a picture of how the new episode of the Activision series runs on new generation hardware, with particular reference to the introduction of ray tracing, after having tested the game on PS4 and awaiting any insights on next-gen consoles. The return of the single player campaign naturally represented an indispensable opportunity to reaffirm the technical figure of the franchise, also and above all in future projections, and the Treyarch developers (assisted on the platform Windows by the now experts Beenox) have not wasted it, on the contrary, creating an engaging show with an inevitable cinematic cut. History A direct sequel to the original Black Ops, Call of Duty: Black Ops Cold War is set in 1981, during the Cold War period. A mysterious Russian agent, codenamed Perseus, seems intent on attacking the West, and so President Ronald Reagan mandates Russel Adler to create a special team to locate the enemy's position and eliminate the threat. Adler, a man of the CIA with a large scar on his face that unequivocally highlights the negative implications of his long military career, decides to hire not only old acquaintances such as Alex Mason, Frank Woods and Jason Hudson, but also specialists Helen Park, Lawrence Sims and Lazar Azoulay , in addition of course to the character we will control, ~Bell~. Thus comes the first novelty of the game, that is, the fact of being able to create the protagonist from scratch by choosing his name, gender, background and psychological profile. This last element not only has an accessory value, but influences the character's abilities with perks that are activated according to the type of agent we are going to generate, by selecting two character traits from a list of six. As per tradition for the Black Ops saga, however, the setting of the early 80s is not the only one that we will face during the campaign, which also includes several missions that take place during the Vietnam war in order to to tell memories and antecedents related to the protagonists and the mysterious secret agent they are hunting, in the context of a plot that between high-adrenaline sequences and powerful twists does not disappoint at all. Structure The Call of Duty: Black Ops Cold War main screen provides a clear preview of what the future of the series could be, should the need to churn out a package every year to sell to the public at full price cease. In fact, the idea of a real platform is perceived in which the campaign is supported by the multiplayer sector, the Zombie mode and the inevitable connection to the battle royale Call of Duty: Warzone. Even in practical terms, it is all modular: the installation on PC can be managed in a very simple way, through the Battle.net client, adding or deleting portions of the experience that we consider useful or superfluous in order to save space on the SSD. The high-resolution texture package, for example, is about 40 GB entirely optional; and the same goes of course for the campaign, Warzone and/or traditional competitive modes. Net of the long and annoying process of compiling the shaders, which fortunately you only have to undergo at the beginning, the system proves to be decidedly accessible and well thought out, with the icing on the cake represented by the cross-platform approach as far as progression is concerned : a real game changer, if we consider what Call of Duty's approach has always been, and which is now inevitably destined to change. However, the concept of the modules can also be found in the structure of the campaign itself, which despite being usually too short (its duration stands at four and a half hours) it leverages a series of narrative crossroads determined by our choices, which produce different endings, and tries to manage the collectibles in a peculiar way, transforming them into clues and making them useful for unlocking further content, as well as improving the report that is drawn up at the end of the experience. Gameplay These small but important innovations, which emphasize the replayability of the campaign or at least of the individual missions that make it up, fit into the gameplay of Black Ops Cold War in a natural and interesting way, similar to what was done in Call of Duty: Modern Warfare. There are moments in which we can make choices, and these choices affect the progression of events in a more or less relevant way. During the first assignment, for example, it happens to be able to kill or spare an enemy, then discovering that keeping him alive is poIt is possible to obtain valuable information in the context of a secondary mission, in a coming and going between the Vietnam War and the Cold War period which is once again managed using the expedient of flashbacks. Going forward such situations multiply and become even more interesting, however. In one mission, for example, we control a double-crossing Russian officer who must give us a key to access a section of the KGB headquarters in Moscow. There are several ways to proceed, all valid and equally feasible, just as the character's objectives can change, in an excursion into the territories of stealth that appears intriguing although not particularly elaborate. However, the fulcrum of the in-game action remains the firefights, and on this front there is unfortunately the usual approach of the series, a shooter with the babysitter in which we are constantly guided in the missions (when not by a companion, by his voice...), with enemies moved by an basic artificial and in which freedom of movement is only apparent, while we move from one shooting to another in a linear way. The multiplayer modes Call of Duty: Black Ops Cold War gives you direct access to the various modules that make up the experience, and which include multiplayer modes, the battle royale Call of Duty: Warzone and Zombie mode. Given the usual brevity of the campaign, it is clear that the emphasis has been placed precisely on the online sector, which naturally proves to be solid and well balanced, with only some perplexities linked to some of the innovations introduced with this episode. For details on multiplayer, however, we refer you to the review of Call of Duty: Black Ops Cold War for PS4. The PC version Call of Duty: Black Ops Cold War can count on excellent graphics, enhanced by highly detailed and well-animated polygonal models, as well as excellent explosions. Although perhaps these qualities are often not perceived in the context of multiplayer modes, the cinematic narrative of the campaign is supported by highly spectacular sequences, see for example the chase scene of the plane taking off. The technical improvements bring obviously with it a greater computational load, and this translates into the impossibility of running the game at maximum on configurations that until a few episodes ago were perfectly capable of aiming for 4K at 60 fps with all the settings at maximum. In our case, we played the campaign using both a GTX 1080 Ti and an RTX 2070 Super, evaluating the behavior of the title with both GPUs. Let's start with the options, which are really numerous and allow you to scale the experience even on not very pumped hardware. They range from resolution, with the now inevitable scaler that allows you to decrease the effective value while leaving the output unchanged, to vertical synchrony (which in our case, however, did not work, forcing us to use that of the video card), from NVIDIA technology Reflex for low latency at the limit for the frame rate. Then there are the more advanced adjustments: the quality of the textures (with optional HD pack, as mentioned) and of the models, of the effects and of the screen space reflection, the visual distance and the volumetric lighting, finally arriving at shadows, ray tracing and DLSS 2.0. Needless to say, these last two elements make all the difference in the world in terms of visual impact and performance. Let's see why. Tested with a GTX 1080 Ti, Call of Duty: Black Ops Cold War does not exceed 30 frames per second when setting the resolution to 2160p and all effects to maximum. Obviously it makes no sense to play a shooter in these conditions, but to aim for 60 fps you have to compromise and the easiest way to do it is to use the convenient scaler we mentioned above, going down to 70% of the value real (therefore 1512p) in less stressful situations, but going even further in open scenarios (1440p). With the RTX 2070 Super, the situation changes radically thanks to DLSS, which features four different presets, gradually becoming more aggressive. Playing with the balanced preset and setting all ray tracing effects to maximum not only results in a very stable 60fps, but it's also difficult to distinguish the image quality from real 4K, so sophisticated is this resampling technology. Of course, there are missions that take place outdoors, especially towards the end of the campaign, with a lot of characters and objects in motion: in that case it is necessary to recall the DLSS Performance preset from the options, which also keeps the i 60 fps but obviously loses somethingin terms of detail and cleanliness. In all cases it is absolutely worth activating ray tracing: although some reflections appear less enjoyable than others (see the meeting table in the KGB headquarters), this feature has the effective ability to elevate even seemingly trivial glimpses, giving them that feeling of expensive post-processing that in the past was a prerogative of only static images.", "date": "2020-11-21", "grade": "8.5"}