{"name": "Just Dance 2021", "ref": "https://multiplayer.it/recensioni/just-dance-2021-recensione.html", "text": "Oh yes, dear sirs: it's that time of year again. Our review of Just Dance 2021 reminds you that, at the time of writing, the new chapter of the series is already available for purchase in stores; but given the not particularly favorable historical period, we advise you to order it online, if you really feel the irresistible impulse to dance. And maybe it's right now, that there's more need to dance: dancing not to think, to forget at least for a few minutes about the problems of the world out there. Who knows, with the hope that maybe you can take Just Dance 2021 with you to Christmas lunch, as you have done in the past few years. Melancholy aside, it's time for the verdict: what has changed, compared to all the other Just Dances? What's new? Gameplay: always the same Most likely you weren't waiting for who knows what great news from Just Dance 2021: it's better this way. The Ubisoft title, once again, reminds everyone of wanting to always remain the same. So much the same that, once you put aside some insignificant and mainly aesthetic details, you forget which version you are playing. Try starting a Just Dance 2021 song while you are alone, then call a family member in the same room: will they be able to tell if you are playing the new version or Just Dance 2020, 2019 or 2018? Answer: no. After all, why should Ubisoft change a gameplay that has been convincing consumers for so many years now? The basic offer therefore remains identical. One player (or two, or three, or four) holds a Nintendo Switch Joy-Con (one is enough), starts his favorite track among the 41 present, and starts dancing. The detection system assigns scores to each ~step~ shown on the screen, and at the end of the piece you are rewarded with a certain amount of stars (from one to five, the latter for the phenomena). It seemed to us that Just Dance 2021 has become a little more demanding than its predecessors, in the attribution of the score: especially in relation to the fifth star. Songs Offering the same offer and game modes, it's the songs that make the difference in a new Just Dance. Just Dance 2021 offers a total of 41 unreleased songs, which we want to bring you back to you in a nice list - so you won't need to look elsewhere. Starting from these songs, then, it will be possible to unlock 12 other alternative versions, through the game coins unlocked at the end of the game; it will take a while to get them all, because the game prefers to prioritize avatars, gamertag phrases, backgrounds and so on. So here are the songs from Just Dance 2021: Adore You by Harry Styles, Alexandrie Alexandra by Jrme Francis (Claude Franois), All the Good Girls Go to Hell by Billie Eilish, Bailando by Paradisio ft. DJ Patrick Samoy, Blinding Lights by The Weeknd, Boy, You Can Keep It by Alex Newell, Buscando by GTA & Jenn Morel, Dance Monkey by Tones and I, Dibby Dibby Sound by DJ Fresh & Jay Fay ft. Ms. Dynamite, Don't Start Now by Dua Lipa, Feel Special by Twice. And now we'll just continue with the song titles, or finish next year: Georgia, Get Get Down, Heat Seeker, Ice Cream, In the Navy, Joone Khodet, Juice, Kick It, Kulikitaka, Lacrimosa, Magenta Riddim, Paca Dance , Rare, Que Tire Pa Lante, Rain on Me, Runaway (U & I), Samba de Janeiro, Say So, Seorita, Temperature, The Other Side, The Weekend, Till the World Ends, Uno, Volar, Without Me, Yameen Yasar, Yo Le Llego, You've Got a Friend in Me, Zenit. Game mode With Just Dance 2021, various game modes already seen in the last three years return: these are variations, more or less interesting, of the usual soup, always composed of the coupling ~piece of music to be performed with dance in real time~. Especially in a period in which many are forced into the house, the Sweat Mode therefore allows you to create your own routine, and above all to keep track of the calories burned while dancing. If the player can't go to the gym, the gym goes to the player, and becomes music. Clearly Ubisoft has not forgotten the children, indeed accessing their songs is easier than ever: it is even possible to do it even before starting the actual title, from a minimalist menu immediately on the screen. Just Dance Kids this year presents about ten songs designed ad hoc, all very pleasant (even for adults, actually). Finally, the Online mode is back, to challenge all the other players around the world on the basis of random songs or your favorite songs; in this case, however, a paid subscription to Nintendo Switch Online will be required. Just Dance Unlimited There would still be some room for the sThe controversy dedicated to Just Dance Unlimited: Ubisoft's commercial strategy has never really convinced us to the end. It is not clear why a loyalist of the franchise should continue to pay 60 euros for each new title with its 40 basic songs, and then still have to pay the subscription (daily, monthly or yearly) to access Just Dance Unlimited. It is a catalog that now boasts hundreds and hundreds of songs, but it is not free: it costs 3.99 euros per month and 24.99 euros for a 365-day subscription. They are not astronomical figures, it is true, but we are still talking about a title that is basically sold as easily as any Triple A, in the face of innovations that have now been absent for several years. At least the physical version includes a free month of subscription, enough to spend the Christmas season in joy.", "date": "2020-11-19", "grade": "7.5"}