{"name": "Gears of War - Recensione", "ref": "https://multiplayer.it/recensioni/gears-of-war-recensione.html", "text": "Gears of War The inspiration for GOW's gameplay clearly stems from Resident Evil 4, Capcom's masterpiece from last season. Even in the Epic title, in fact, the protagonist is filmed from behind with a third-person shot that narrows the field every time he takes aim to try to hit the Locusts with greater precision. The similarities, however, end there. GOW is pure adrenaline. The playing field is dotted with concrete walls, car wrecks, furniture, columns, buildings behind which one can and must hide, to avoid a sudden and sudden death, especially at the two highest difficulty levels, of the three available. Marcus' interaction with the backdrop takes place entirely thanks to the use of the A button, with which, also giving the direction with the left lever, you choose the closest wall behind which to crouch. Once you have caught your breath, or without waiting, you can decide whether to jump to the side with a somersault, whether to climb over the wall or go around it. Finally, still with A and keeping it pressed, our hero bends down on his legs and starts running wildly until he stops exhausted behind a shelter. To become good GOW players, especially in online games, you need to learn how to read the seabed, understand where you can take shelter and from which walls or ledges you can launch yourself with somersaults or leaps, in order to be able to surprise the opponents. The marines' journey is exciting and in several moments it finds us looking around, lost in a sumptuous landscape, happy to have survived These, especially at the more difficult levels, have a good artificial intelligence which, apart from some uncertainty in hand-to-hand combat, makes them perform excellent attack and cover maneuvers. Marcus, among other things, is accompanied for almost the entirety of the game by three fellow soldiers to whom he can give simple orders with a series of key combinations. The striking thing is that these prove to be fairly reactive and capable of resolving various intricate situations, it being understood that hotter potatoes can only be handled by Fenix, and turning a blind eye to some somewhat strange situations, especially in clashes with the berserkers. Once you become familiar with these mechanics and learn to use the melee techniques, GOW runs off smoothly, with only some uncertainty due to the continuous pressures of the A button which can lead to unwanted results in the most complex situations. The other aspect to be mastered properly is that related to reloading weapons. Indeed, once the relative command has been given, an indicator with a flashing cursor along a line of three shades of gray appears under the ammunition counter. The reloading must be performed in the bands indicated by the two lightest shades, so as to be completed more quickly or, even, so as to give the reloaded bullets a damage bonus. Failing to coordinate, however, Marcus will take much longer, cursing and making himself an easy target of the Locusts. The journey of the marines is exciting and in several moments we find ourselves looking around, lost in a sumptuous landscape, happy to have survived yet another battle. Arsenal Some of the weapons available will certainly remain impressed by Gears of War. One above all is the Hammer of Dawn, a rifle that can only be used in open spaces and which sets off a devastating and remote-guided ray of light from an orbiting satellite. Furthermore, each weapon has a specific function for hand-to-hand combat, which can be activated with the B button. The chainsaw of the basic rifle is certainly memorable, which makes a sensation difficult to describe, as well as the grenades. These can be driven into the body of opponents who leap into the air, also overwhelming their nearby teammates. The same fate, however, awaits the player who used them, but who did not have time to get away from his victim. At this address, the Video Review of Gears of War! Shooter with panache Gears of War is for the most part one of the funniest action shooters of recent years. This, however, must not distract attention from the fact that the level designers, led by Cliffy B (project lead designer), have not limited themselves to ringing the game elements in an infinite series of shootings, albeit predominant, but they are also taken the trouble to set up some ideas of sure impact. Over the five chapters, in fact, we learn to be afraid of the dark and of the creatures that inhabit it, forcing us to scrutinize every corner of the seabed in search of improvised light sources and neon lamps still full of gas. He gets stuckIt is also possible to interact with one's travel companions, in what is one of the most successful co-op modes ever (see Multiplayer paragraph). It is not the case here to indulge in further insights, above all in order not to spoil the surprise for the many who decide to play GOW, just know that the approximately ten hours it takes to complete the adventure, at the basic level of difficulty , fly away in a flash. That of longevity, on balance, is the main flaw of the Epic title. At the end of the race, when by now one feels master of every ability of Marcus and his associates, one would like to have other internships and other situations available in which to test oneself. However, the alternative paths to take within the various chapters and the other two difficulty levels remain, which constitute the real challenge of Gears of War and, obviously, the multiplayer. There is life after the end... All single player modes of Gears of War can be played, both locally and via Xbox Live, with another player taking command of Dom, one of the soldiers accompanying Marcus. The novelty is that at any time you can invite one of your contacts to participate in the game session in progress without interrupting the action and continuing exactly from where you are. The invited player can abandon the game, just as he has begun to take part in it, always without interrupting anything. GOW seems to have been designed around this feature, a real trump card, given that the fun increases exponentially by tackling the stages with a friend by your side. each game is a flash of shots, hits and chases between walls, columns and car wrecks. There is life after the end... Being an Epic title, however, a substantial online versus mode could not be missing. There are ten maps available, and each seems designed to explore the characteristic gameplay of GOW. Xbox Live, since the game was released, is teeming with players who compete in the three available modes, divided into two teams of four elements. In addition to the classic Survivor variant, which sees the team that survives the other triumph, and the mode that sees the player who has scored the most points excel, there is also a novelty, called Assassination. In this, the two teams, that of the locusts and that of the COGs, have a leader who must be protected, since only by killing him can the round be won. Strategy, in this case, is king, and teammates must go hunting for the opposing leader, but without forgetting their own, on pain of immediate defeat. The melee techniques and those same weapons, which in the single player seem little more than graphic tinsel, become unique in online games, highlighting the excellent balancing work done by Epic. Also noteworthy is the care placed in the design of the different maps, as well as in some game features such as the state of shock into which a wounded player falls, but not killed instantly. In fact, he ends up on the ground panting, and there are usually 20 seconds to heal him, before he bleeds to death, or before an opponent eliminates him completely by breaking his spine with a kick. Companions always have the choice whether to take cover from enemy fire or rush to the rescue, exposing themselves to often decisive risks, given that the maps are small, proportionate to the 8 players on the field, and given that every game is a flash of shots, shots and chases between walls, columns and car wrecks. Unbelievable The most disruptive aspect of Gears of War, surely, is the visual one. Nothing like it had ever been seen before. No game comes close to the graphic detail achieved by the artists and developers of Epic, who put the Unreal Engine 3 to the test with results that defeat all the productions released so far on Xbox 360, and beyond. The ruins of the cities of GOW are spectacular, the textures that cover the seabed are treated in detail, rarely letting go in terms of definition. The polygonal models of marines and locusts certainly strike the eye, both very rich and endowed with a physicality with few precedents. Even more impressive are the cut scenes, made with the polygonal engine and which, in fact, tend to have a more unstable frame rate than that of the actual game, always anchored to 30 frames per second, even online. Some settings and some moments of GOW mark a new limit for what can be expected from the new generation consoles. The most disruptive aspect of Gears of War, surely, is the visual one. Never seen anything like it,before now. Unbelievable Equally accurate is the sound profile of the Epic title, especially as regards the excellent dubbing in Italian, not helped by some small translation sin, as in the case of the basic level of difficulty which becomes Casual from the original Casual, to indicate the player occasional and, therefore, less skilled. The expressions of Marcus and the locusts also become fundamental for multiplayer, since you don't need to look at the ammo counter to know you're out of them. In fact, it is enough to hear our soldier exclaim ~Exhausted!~, in the middle of the battle to know that he has run out of water. Also noteworthy is the soundtrack, of course, epic and symphonic. Goals GOW's objectives are split between online and single player modes. To get all the points related to the latter, you have to finish the game on all three difficulty levels, learn how to reload your weapons perfectly and collect all the medals of the marines who died on the field. Which forces you to scrutinize every inch of the seabed. To get all 1000 points, you must then try your hand at online ranked matches and participate in co-op mode as a guest, taking control of Dom. It will be some time before you have unlocked all of them, then. Comment Gears of War is a feeling of power, a thrill of brutality that overwhelms and enraptures, from start to finish, anyone who gets in front of a TV with the pad in hand. The end credits probably come a little too soon, but it will be difficult for anyone to consider the single player adventure over before completing the game on all difficulty levels. Because GOW is a line on the ground, a clear boundary that separates yesterday's emotions from those that will be possible to experience from now on; a combination of technology and involvement that was difficult to predict in all its nuances. It's not a perfect game, no doubt, but we can't imagine any reason why a video game enthusiast would give up this frantic race organized by Epic for Xbox 360; even more, for those who want to throw themselves into online matches that are already to the death. In the truest sense of the wordPros Intense and irresistible Unprecedented graphics Exciting multiplayer Cons About ten hours of Single Player Shallow story Gears of War is the story of a group of marines, thrown into the middle of a conflict they know practically nothing about. The one who within a few levels becomes their leader, Marcus Fenix, is released from jail specifically to be sent to war and launch an assault on that intricate mass of underground tunnels in which the Locusts live, an alien race that is devouring the planet from 'internal. Nothing is known about the origin of the conflict, nor about the reasons that made Marcus end up behind bars. Gears of War is the journey of this handful of soldiers, told in five chapters, divided into about thirty levels, which will see them descend to the heart of the earth to emerge victorious from a lake of blood and explosions. The world in which they move is a pile of ruins, pervaded by a sense of desolation that cloaks every game screen from start to finish. This and little else is known, and it is one of the few defects of GOW; a missed opportunity to describe in greater detail the story of a truly fascinating setting, which hosts the first undoubted Xbox 360 killer application and one of the best titles of 2006.", "date": "2006-11-13", "grade": null}