{"name": "Badlanders", "ref": "https://multiplayer.it/recensioni/badlanders-recensione.html", "text": "The Badlanders review marks the arrival on iOS and Android devices of an interesting variation on the battle royale theme. The new title from NetEase Games, in fact, does not place the emphasis on pure and simple competition between players in order to stay alive at the end of the match, but rather on their ability to collect valuable loot within the map and have the shrewdness to take it home after the game.Similarly to what happens in titles such as Escape from Tarkov on the one hand and HUNT: Showdown on the other, Badlanders launches us into a substantially less extensive setting than the various Fortnite and PUBG Mobile , with a ten minute countdown that will lead to the activation of different vanishing points. We will have to reach them to return to the lobby safe and sound, of course, but not without having obtained the maximum possible in terms of weapons and equipment. Checks From the gameplay point of view, Badlanders is very similar to the aforementioned PUBG Mobile, with a fairly crowded touch interface in which there are two virtual sticks to manage the movement and view of the character, complete with automatic running activated, and a series of buttons used to shoot, use the scope for precision shots, crouch, reload the equipped weapon, lean left or right and finally access the inventory. The commands can be customized from the options, so as to move every single icon or hide the ones we don't use and thus thin out the layout, but in any case there is unfortunately no setting for automatic fire: a questionable choice, in stark contrast to some of the best and most popular shooters mobile currently available, which inevitably ends up making gunplay cumbersome. Gameplay At the beginning of each game of Badlanders you are immediately projected onto the map, without expedients such as parachute jumping, and you can choose whether to start without any objects or to already carry weapons with you to be able to return fire in case where you get attacked before you even find anything in the world. Even the mechanics for collecting objects are very reminiscent of those of PUBG Mobile: fortunately, the automatisms are here and help speed up the procedure. While waiting for one of the vanishing points to be activated, our task will basically be to wander far and wide within the setting to find objects of the greatest possible value and possibly face the other players to steal their equipment possession. Twenty-five participants is a good number if we consider the small size of the map, but during our tests it often happened to play with far fewer people, creating frankly boring sessions: a serious alarm bell for an experience of this type. Structure As mentioned at the beginning, the focus of Badlanders is more on collecting loot than on eliminating opponents, which means that in theory we can complete the match even without killing anyone. At the end of the game, the system calculates the value of the objects we have obtained and which we can then sell, exchange or modify, with the possibility of auctioning off the best weapons and armor after a while. The structure adopted by the game implies inevitably a clear impact of microtransactions on the competitiveness of the characters. This means that users who spend to speed up their progression will find themselves at an advantage over the others, especially if they decide to bring the modified weapons they have into the match. Of course, cunning and precision can still make the difference and eliminating ~rich~ opponents, causing them to lose their premium equipment, can give great satisfaction. Technical realization The technical realization of Badlanders unfortunately represents one of the limits of the game. The graphics are in fact too derivative and devoid of their own personality, the map doesn't boast interesting glimpses and it too only repeats what has already been seen in other titles of the genre, but suffers from numerous pop-up effects that don't help to enhance the visual impact of the experience. At least the fluidity is not discussed, and also thanks to the options it is possible to scale the graphics so that they are more or less detailed, with a variable frame rate, exploiting the capabilities of your device. As for the sound sector, it too does not provide memorable ideas, proving to be flat and anonymous.", "date": "2020-11-17", "grade": "6.7"}