{"name": "The Pathless", "ref": "https://multiplayer.it/recensioni/the-pathless-recensione.html", "text": "While the eyes of the public dream of the next gigantic Triple A built with the next generation in mind, developer Giant Squid tries to slip its new indie game into the pile by again focusing on a marked poetic vein, but this time embellished with a gameplay that, however simple, it offers equal measure of challenge, fun and freedom. How did it go? Find out in our review of The Pathless. Muscles vs Dreams For Giant Squid, The Pathless is the second game after the timid success of Abzu, do you remember that? Their first work joined the great wave of so-called ~walking simulators~ starting from Dear Esther, a definition that we do not feel like supporting since it was born with the aim of diminishing the quality of often very beautiful and satisfying experiences, despite the 'usual lack of a real challenge. With Abzu, the formula was used to let us explore deep seas as familiar in color and fauna as alien in their alien and alienating beauty. However, the game did not enjoy great success precisely because of not exactly impeccable timing, which led to its debut just when the public began to want something more substantial than a new narrative walk. Why are we telling you this even though The Pathless is a profoundly different experience from Abzu's? For the simple fact that this new game also risks arriving last or nearly so, at the end of a cycle, as well as at a time where the arrival of the new consoles will inevitably push the public towards more muscular graphics instead of into the arms of the most dreamy. Corrupt nature And damn if it would be a shame to see this The Pathless sink into indifference, since we're not talking about a great game but undoubtedly a great game, a precious cross between the beloved Journey and Rime. Here, in the role of a huntress who has just landed on a continuum of plateaus shrouded in magic and mystery, we will have to give her a thrashing to the Godslayer, a dark, evil entity capable of shrouding the natural idyll of senseless corruption. To do this, we will have to free the different areas, one perched on the other on ever higher slopes, until we reach the final infector. The particularity of The Pathless is primarily in its movement system: you walk, run and fly a lot, but these simple actions put the player in an active rather than a passive role. To move with more boldness than that necessary for simple walking, we will consume a bar that will be constantly filled by hitting these talismans scattered everywhere with the huntress's bow and arrows. It is not a slow and painful exercise that requires meekness, but the exact opposite: thanks to the automatic aim and the dynamic movements of the protagonist, hitting the running or flying talismans turns out to be a fun and rhythmic action, as well as necessary to continue traveling at maximum speed. Furthermore, continuing in the adventure, we will be able to accumulate more power to run and hover in the air for longer and longer without having to fill up on magic, slowing down the hunt for talismans every few seconds that distinguishes the first explorations in the world of The Pathless. Magical highlands The second most original aspect of The Pathless is also the one that partly explains its title: in this adventure there is no map and the sense of progression is marked by the bosses to be defeated but by no intermediate turning point. By activating the magical view of the huntress we will see in the sky where the runes and towers are located in which to place them after having conquered them, having done this we will finally have the opportunity to challenge the corrupted animal that dominates the area. There is no precise order in which to move, or right or wrong directions in which to explore; like there are no puzzles to solve after instead of before, maybe because you don't have a particular skill yet. Of course, we won't be able to move on to the next plateau before defeating the boss of the one we're on, but that's good and not bad. In The Pathless the fights take place almost exclusively against the bosses, and are practically all focused on the speed of execution of the attacks and the accumulation of magic to continue the chase; the rest of the game focuses exclusively on exploration and environmental puzzles that are never impossible but not even obvious. Fortunately, we will not be alone on this journey: an eagle will keep us company, which is essential for solving puzzles: it is she who, for example, will be able to grab and carry amphorae that are often decisive, and it is always she who will allow us to hover in the air to get around the jumps out of the bringsta of our nimble legs. Sound forests However, a substantial part of the charm of The Pathless derives from its colorful setting in visual terms, but monochromatic from a narrative point of view, where every shred of narration is entrusted to memories of light scattered near the lifeless bodies of victims caused by past battles. Like Abzu, The Pathless is a stylistic concentrate that strikes hard at the lover of the beautiful, alienating the slave of absolute photorealism. All supported by a soundtrack that recalls a new wave of magical workmanship, and which gives foundations in notes to a game that seems to hover in the clouds. Giant Squid's new adventure as we have seen is not particularly elaborate or long-lived (it takes between five and six hours for the end credits) but not so original either. After all, it is only pure excellence, from a development team that perhaps could now aspire to something more.", "date": "2020-11-16", "grade": "8.0"}