{"name": "The Sims 4: Oasi Innevata", "ref": "https://multiplayer.it/recensioni/the-sims-4-oasi-innevata-recensione.html", "text": "Snowy Oasis, the latest expansion for The Sims 4, arrives on November 13th on PC (Origin and Steam), Xbox One and PlayStation 4 with a good load of new features and accompanied by a free update that completes and accompanies the new features present in the last Expansion Pack of the Maxis simulation. We had already anticipated in our tried some of the introductions of this expansion dedicated to winter activities and set in Japan: in today's review we will complete our story by finally summing up. Eastern snow Having already given a fair amount of space in our experience to hiking, skiing and climbing activities, we would now like to focus on another very relevant element of Oasi Snowevata, i.e. the festivals. In reality, the concept of festival is not new to The Sims 4 players who have already had the opportunity to take part in it together with their Simmers in the City Living expansion. However, here the activities were slightly more limited and repetitive while in Oasi Snowvata the festivals offer many opportunities for entertainment as well as being carefully themed. One of the things that struck us the most in our first encounter with Snowy Oasis was the care with which part of the Japanese tradition had been entirely absorbed into the game elements. Festivals are no exception and, for the uninitiated, these occasions of celebration are very important and widespread throughout Japan, practically covering the entire calendar and the whole country. In Oasi Snowvata there are three different festivals: that of Lights, Snow and Youth. Each anniversary is celebrated in a specific moment of the week and celebrated in a specific place; in fact, the Monte Komorebi district is divided into different areas depending on the altitude, so there will be different meeting places. Depending on the occasion, a particular dress code is required, themed activities are offered and there are also different snack stalls. To get more information about the festivals, just interact with the bulletin boards scattered in the common areas of the neighborhood and to participate in a festival, just view the information on the pop-up that will appear on the notification bulletin board before the party starts; in this way it will be possible to travel directly to the festival site. A big heart Climbing, walks, festivals, these are all certainly fun activities but there is a large part of Oasi Snowevata that impacts the entire gaming experience, the one dedicated to lifestyles. This, as we anticipated in our previous article, was not a testable novelty in the short term, we needed to try it... but first it is good to explain in detail how it works. Lifestyles are particular conditions that are activated after a Sim performs certain actions and that modify some behavioral and growth parameters of the Sim. We're talking about a total of 16 different lifestyles where some are in stark contrast in terms of theme (junk food versus healthy food, sedentary versus energetic...) while a small handful don't find an opposite counterpart (like workaholic). If you keep the lifestyles feature active (which you can exclude from the options menu if you wish) during the course of a day you will be notified with a notification when the maximum number of actions that affect this lifestyle is reached, so that it gradually grows and it just becomes a daily habit. For example, if you are interested in unlocking the ~coffee fanatic~ trait, it won't be enough to drink liters and liters of coffee until the lifestyle is unlocked; once you drink a certain amount of cups and reach the maximum level of activities that can be performed for that day, your Sim will no longer advance in that lifestyle, even if you continue to kill yourself with coffee. In the beginning, most lifestyles will be hidden and will be discovered as you explore different daily routines. This allows the player, who can keep track of active lifestyles (maximum three per Sim) in the Simology panel, to adjust the Sim's behavior and possibly counteract the onset of that lifestyle; in order to be definable as such it must in fact be daily and must persist over time. Lifestyles can therefore acquire the status of ~stuck~ (you know what it is but you are not following it), ~in progress~ (you are working on it), ~active~ (it is part of your Simology and you are influenced by effects) and ~at risk~ (lifestyle is neglected and about to get stuck again). Once achieved, the lifestyle will be fully part of the Sim, settling into their behavior and activating modifiers within the life of the Sims. Let's talk about modifiers and non of bonus/malus because the game doesn't make a distinction on good or bad, right or wrong, but only mentions a list of effects. For example, Sims who acquire the single lifestyle live a fulfilling life without the need to have a romantic relationship: among the effects these Sims acquire skills faster if they are single and increase their job performance reaching promotion more quickly, they feel uncomfortable when other Sims flirt with them and are immune to romance of any kind. Is it good? Is it bad? The game does not assign any meaning to the effects of lifestyles and this is perhaps the thing that most convinced us of this novelty. For this reason, the way to get rid of an unwelcome lifestyle is also very nice: ignoring the ~goodbye lifestyle~ potion, which can be obtained in the rewards shop, to effectively get rid of a lifestyle, you can use the interaction ~Go to therapy lifestyle of your phone or computer. New in combos In the face of the maxi update released in conjunction with Snowy Oasis, it is clear how lifestyles are paired with feelings, or all those attitudes that influence the relationships between Sims. Feeling deeply bonded after tackling a steep climb together or holding a grudge against another Sim for working too hard are clearly mechanics meant to go, pass the term though maybe it's a little out of place for the Sims, in combos and create deeper situations for Sims who have not been fully denied agency in the game options. Obviously the varied nuance of emotions introduced by the new update is highly enjoyable even without Snowy Oasis, but with the presence of lifestyles, story-telling lovers, who enjoy creating narrative arcs for their Sims, will certainly have bread for their teeth. A little game, that of inserting a big free novelty in the basic package, which marries beautifully with the features of Snowy Oasis, and which Maxis also does in the build mode: the latest update introduces the platforms, i.e. editable gradients inside of the same room. And will it perhaps be a coincidence that this comes precisely with Oasi Snowevata, which offers houses in a typical Japanese style where the difference in height of a few steps between rooms is heavily used, especially at the entrance? So even the unbridled builders will have something to rejoice in, indulging themselves in the 15 lots available in the Monte Komorebi district... what do you say? Do you count only 14? Prepare for a beautiful high-altitude hike: one of the most beautiful lots ever seen in The Sims 4 awaits you at the top of the peak! Snowy Oasis is a must-have expansion for The Sims 4 that goes far beyond mountain activities. It introduces delightful building and furnishing options, especially if you felt the need to make your homes more oriental, a host of new objectives and new interactions (which we invite you to discover for yourself among new places to hide away to silly ways to die). But above all, Snow Oasis offers a series of inevitable tools and possibilities both to those who love to create stories with their Sims and to players who focus more on building, finding the exaltation of these novelties in the free update at the beginning of November.", "date": "2020-11-16", "grade": "8.0"}