{"name": "The Great War: Western Front", "ref": "https://multiplayer.it/recensioni/the-great-war-western-front-recensione.html", "text": "Those involved in developing first-person shooters have always had something in common with those who instead create strategic war games for PC, that is the incessant search for a setting little explored by the competition, which could justify the publication of a new product in a market which for both genres is dramatically saturated. If in the case of shooters there are several products that have recently tried to tell an underrepresented theater such as that of the First World War, it is curious to note that, before this week, there was almost no strategic experience dedicated to the Great War, even if the what has quite obvious reasons behind it. wars between great nations: stuck in trenches in inhumane conditions, the armies of the Allies and Central Powers remained frozen in the same position for years, while entire generations of young people were thrown into the crossfire of enemy machine guns, often as a simple diversion. There was nothing strategic about it, which is why when we first heard about The Great War: Western Front, we genuinely wondered how it was possible to effectively translate trench warfare into an RTS not so different from any Total War. Will the experiment have been successful? In the review of The Great War: Western Front we talk about why, on balance, the project developed by Petroglyph and published by Frontier Developments has proved to be much more interesting than what we could have ever imagined at the beginning Something new on the Western Front This is what the front of The Great War: Western Front looks like in 1918 Not having the same resources available as realities such as Paradox or Creative Assembly, the authors of The Great War: Western Front have wisely abandoned any grand strategy ambitions and packaged a compact and functional strategic experience, which however in terms of mere contents does not it is sadly so deep. The Petroglyph title offers a sufficiently small board in the campaign, which goes from the Somme to Switzerland, occupied exclusively by two playable macro-factions representing the two great warring coalitions. Forget about being able to choose whether to interpret the forces of the ~Kaiser von sterreich~ Charles I, those of the US expeditionary force or the French skycoats, the two sides of the Allies and the Central Powers control each other in a unified way, and this is a great pity considering how interesting it would have been to manage just one country and interact with all the others while being governed by the AI. Once you have chosen your campaign, difficulty and starting point (you can choose between 1914 and 1916), the aim is for better or worse that of any other war-setting strategy, that is to break the enemy lines to advance towards the opposing capital. However, unlike many other titles of its kind, The Great War: Western Front in no way intends to keep players engaged in the careful and complex financial management of their empires, but rather to put them in the shoes of their general staff, which is why they are completely absent are those systems for internal administration which in other RTS allow you to carefully follow the development of the provinces, for example by building economic or military buildings. In reality, there are advances that improve the effectiveness of the various departments of the army, but they are conquered only through the branches of a fairly large technological tree, which over time will produce innovations capable of distorting the way war is fought. In the meantime, our main focus will be on constant micro-management of each segment of the front, making sure we get supplies and reinforcements where they are needed most. The campaign is all in all well structured, and the same can be said of the other content available. In fact, we find six historical battles that can be tackled individually outside the campaign, including Verdun, Somme and Ypres, but also a skirmish mode, which instead fields a quick battle not inspired by any famous theater. Finally, there is also a draft of multiplayer, even if at the moment it is not possible to face a campaign in two, but only a single battle. Attrition, another key to victory During the campaign of The Great War: Western Front we will be able to come across events with very tasty rewards If thehe Second World War ended with the close siege of Berlin by the Red Army, the great empires of the Great War all capitulated by force of armistices, that's why to tell the truth it will not always be necessary to conquer territories to win, in The Great War: Western Front. Each province on the board, represented by a classic hexagon, is accompanied by a number of stars, which is equivalent to the strategic importance that the region has in the conflict. Calais, landing point for British troops, has four, for example, just like Brussels, the nerve center of German operations in Flanders. Quite simply, when a region loses all its stars it passes into the hands of the enemy and consequently advances the front. The interesting thing is that a province only loses a star after overwhelming victories, which are quite complex to achieve and require huge number of resources. However, it is not certain that, in a war, whoever obtains the most centimeters of land will be able to triumph. In fact, in one of the very first battles of the campaign we found ourselves thwarting a huge German advance by inflicting very serious losses on the enemy, without however seeing the stars of the region from which the attack had started diminishing in any way. Instead, the Kaiser paid a different, but equally high price: following the defeat he lost a lot of ~national will~, a value that sums up how much the factions are inclined to continue the war, and which if it drops to zero leads to immediate defeat . In The Great War: Western Front, the damage taken by the setting carries over into all subsequent battles Battle after battle, the front may not move at all, but the wear and tear of fighting may drive a people to surrender permanently, as indeed happened in the First World War. Although the downside is equivalent to feeling a pinch of frustration when trying to conquer provinces without success, we found this dynamic really interesting, very centered on the historical setting and therefore particularly apt. Draw trenches freehand In The Great War: Western Front you can draw trenches, fortifications and machine gun nests freehand As we said, in the absence of more complex systems, the player just has to carefully manage the flow of supplies, but above all the supply chain, which represents one of the two currencies of The Great War: Western Front together with gold. If the latter is important since it allows you to buy tanks, airplanes and artillery pieces to send to the front, the number of resources in the hands of a province is crucial in case a battle breaks out, since whoever has the most can generally deploy more troops and, consequently, have the upper hand. The battles are totally manual, providing us with the possibility of disposing of trenches, artillery, defenses and infantry companies in total freedom. However, each element of the battle, be it a group of riflemen going into action or an aerial bombardment of enemy defenses, has a specific cost in supplies, which is why whoever has the most can count on more tools to win. An artillery barrage to cover the advance of the troops costs a bit of this precious resource, as well as making the planes take off to shoot down the balloons that widen the opponents' field of vision or invade the enemy trenches with lethal gas at the chlorine. The battles are constantly in the balance and The Great War: Western Front offers the player a huge number of tricks, to turn them in his favor. Technical compartment Unfortunately, the visual impact offered by The Great War: Western Front is penalized by very superficial models Unfortunately, one of the most critical aspects of the Petroglyph production lies in its technical sector, which is simply not up to the studio's ambitions. From a purely visual point of view, the developers have not built bad panoramas and indeed, the settings are made more than discreetly, which is reflected in a software that, apart from being a strategic one, also proves to be too demanding for PC configurations. However, if you aim to stage massive real-time battles between thousands of soldiers, in a triumph of explosions and destruction, it should be a priority that everything is in its place. The feeling is that the developers had no possibility of packing everything without facing big compromises: the models are very superficial and the animations terrible to say the least, which inevitably dilutes the immersionion. If the studio had paid a little more attention to this area, The Great War: Western Front would have really had nothing to envy of the competition, despite its size.", "date": "2023-04-01", "grade": "7.5"}