{"name": "NBA 2K21", "ref": "https://multiplayer.it/recensioni/nba-2k21-recensione-xbox-series-x-ps5.html", "text": "The review of NBA 2K21 for Xbox Series X and PS5 begins where we ended the one dedicated to the version of the basketball simulation for older generation consoles, which you can find here. After having detected the conservative aspect of the latter, we had in fact made an appointment at the release of the game on PlayStation 5 and Xbox Series X|S, to see all the innovations put in place by the Visual Concepts team. News with which the developer and publisher have also justified in recent months the choice to offer the version for the new generation console at a higher price than that for PlayStation 4 and Xbox One, while allowing the direct transition from one generation to another only to buyers of the special Mamba Forever Edition. The edition of NBA 2K21 for Xbox Series X|S and PlayStation 5 therefore presents itself as a launch title for the two competing consoles, finally allowing us to satisfy the curiosity of seeing the steps forward made by Visual Concepts both from a technical point of view, thanks to the new generation hardware, both in terms of content for the game. While waiting for PlayStation 5 to officially arrive in our area, we took advantage of the Microsoft flagship to go back to shooting hoops for a few days. Next gen graphics Testing NBA 2K21 on Xbox Series X requires us to make an exception for once with respect to the classic review lineup, starting our analysis from the paragraph dedicated to the technical aspects of the game usually kept last. As regards the graphics in particular, we can say that the work done by Visual Concepts does not disappoint expectations at all, presenting itself with a renewed look from all points of view. The glance offered by the field is remarkable right from the first game, which can be played while waiting for the console to complete the download of the 101 GB (welcome to the next gen!) which contain the complete version of the game. Once down on the parquet, it is possible to appreciate the many details that the developers have added. The quality of the textures and models of the most famous players was promptly adapted to the arrival of NBA 2K21 on the next gen, while for what concerns the minor stars, the work is still being completed. Then there are the elements on the sidelines, where there are now many non-player characters: television operators, the public, staff and others, all contributing to the game the level of atmosphere and entertainment that only an NBA game can give. Among the aspects improved with the use of ray tracing there is obviously also the management of the lights, especially appreciable by looking at the reflection of the lighting on the polished wood of the field. In the list of shots available to the player, the one that best allows you to admire all this is the new rail cam view, designed precisely to enhance the television aspect of the NBA 2K21 game experience. Naturally, let's not forget the resolution: the possibility running everything at 4K with 60 frames per second is a feature of the new generation of consoles that we will soon get used to, but at the moment we can't help but gasp at the fluidity of the action. With the addition of HDR technology the colors are more vivid and consistent, however placing the need to properly calibrate the parameters on your screen to avoid witnessing an incorrect management especially of the darker tones. One last note concerns the times of loading, practically zeroed by NBA 2K21 next gen thus solving the root of the problem that continued to afflict even the same edition of the game on the old consoles. In light of this, it is not clear why the developers continue not to allow the player to quickly skip the interludes dedicated to timeout and halftime show, especially considering that the latter continues not to shine particularly in quality. MyCareer: Still The Long Shadow, but bigger The first mode we relied on in NBA 2K21 on Xbox Series X is MyCareer, to see what differences pass between the rise of Junior that we had the opportunity to experience a couple of months ago and the current one. The background of the character and the main story remain practically identical, so we refer you to the review of the old gen versions linked at the beginning of the article to learn more about these aspects. As already mentioned, Visual Concepts has introduced some novelties in NBA 2K21 also from the point of purely content-related, as in the case of this mode: after the initial phase dedicated to high school, the player can in fact now choose whether to take Junior to college (where he can possibly play even moreyears) as previously, or entrusting one's future in the NBA to the passage through the G League, thus giving life to an alternative strand of history destined to rejoin the one we already know at the time of the draft. Having chosen the new path of the development league, we must say that we liked this part more, focused on the inclusion of the protagonist in the new team populated by companions such as the legendary Andrei ~Vlad The Impaler~ Hagi. Speaking of news, also the editor dedicated to your player has been revised by the developers to allow greater freedom in the creation of the athlete we are going to check, hoping that this will also translate into greater variety in online play. As for the latter, the most important aspect of NBA 2K21 is linked to the transformation of the District into the City, with the welcome return of affiliations to add that bite that was missing. After an initial series of games played in Rookieville we can move on to the city itself, where we will find a whole series of activities waiting for us including some ~quests~ entrusted by non-player characters. What has been described so far undoubtedly represents a significant addition to the MyCareer of NBA 2K21 on old gen, with respect to which we must say that unfortunately the same propensity towards microtransactions remains. Whether it's single during The Long Shadow or multiplayer in the City, the impression is always that the game wants to throw the possibility of buying VC in our face to speed up the growth process of our character, thus allowing him to do better faster figure in the field. We really hope that Visual Concepts can use the year that separates us from NBA 2K22 to take a step back on this aspect that has become particularly sensitive in recent years, also considering the price increase of the next gen version. The real risk is to see an increasing number of people lose affection for this brand, and it would be a real shame given the excellent starting point represented by this version on next gen. The other modes MyCareer archived, NBA 2K21 next gen does not let us miss updates in the other areas of which it is made up. In particular, MyNBA is now a single mode, which incorporates what were MyGM and MyLeague. The player can now combine elements that were part of one and the other through the configuration parameters proposed by the game, thus giving life to the franchise mode with the most congenial characteristics possible to him. Once the management of the chosen team has started, whoever is in front of the screen can also return to dealing with the G League in this case, by activating the relative option. In this case, the games of the development league will be displayed in the calendar in an interval with respect to the main ones in the NBA, giving the player the possibility of playing them regularly or simulating them. For the benefit of those who prefer to play with WNBA teams, the developers have reserved some new features also in the mode dedicated to women's basketball, greatly enriching this component of NBA 2K21 as well. The new The W is practically the version of MyCareer dedicated to the WNBA, where we can therefore create an athlete to take to one of the league's twelve teams in which to establish herself. The same player can then also be used online, giving rise to three-on-three matches. Like MyNBA, the MyWNBA mode instead allows you to have access to the franchise mode dedicated to women's basketball. Finally, there are few new features for the MyTeam mode, which has already been renewed in the old gen version to offer a few more rewards. The progress obtained is imported from the old consoles, so as not to lose them in the eventual passage on PlayStation 5 or Xbox Series X | S. Gameplay The update of the aesthetic quality of the game is accompanied by other technical elements that directly influence the gameplay. In particular, the general physics has been renewed, which taking into account the characteristics of the players makes their movement on the pitch closer to what we would expect in reality. Playing NBA 2K21 next gen it is possible to immediately notice a clear difference in control between the different types of physiques with which the various athletes are equipped, for example obtaining greater control by exploiting agility or the possibility of resorting to the use of brute force to overwhelm your opponent. Thanks to the now famous Impact Engine, player collisions have also been updated, now much more credible and realistic. However, the situations in which the clash between bodies leads to somewhat clumsy outcomes have not completely disappeared, as inpast. As anticipated in our latest preview dedicated to NBA 2K21 next gen, players now show that they also have greater awareness of where they are at, adjusting their position to allow us to make three-point shots instead of two-point shots points from long range. Speaking of shots, NBA 2K21 on Xbox Series X retains the new aiming model already developed in the old gen version, however treasuring the latter and the changes made to it to improve its yield. The player is granted greater control over the shot thanks to the possibility of defining its parable with the movement speed of the right stick, thus also influencing the final result through this aspect. The post-launch problems of the new shooting system seem to be definitively behind us, even if for those who missed the very last appointment with the old gen there will probably remain a learning period to take into account. Thanks to the additional use of the shooting speed movement using the right stick and the new contact management features, we also found dribbling significantly improved, intended to give the player more control in order to be able to evade the opponent's marking. Also in this case a little additional practice before being able to make the desired movements proves necessary, however potentially allowing you to create remarkable plays once you become familiar. Finally, let's not forget the animations, introduced by Visual Concepts in such an amount as to make the flow of the game more fluid and mitigate (but not eliminate) the sliding effect also thanks to greater control by the CPU on the movement of the players' feet.", "date": "2020-11-16", "grade": "8.3"}