{"name": "All of You", "ref": "https://multiplayer.it/recensioni/all-of-you-la-recensione.html", "text": "After adventures and daring experimentation in art and expression, it's nice to return to Apple Arcade to play a good old puzzle game, especially one as well done as this one examined in the All of You review. Alike Studio is one of those teams that can find perfectly at ease on mobile platforms and especially in an area like Apple Arcade, where stylistically curated creations always have a particular prominence, all the more so if they manage to combine a reasoned and well-constructed gameplay with the pleasant presentation. We notice a common idea and similar characteristics that run between the productions of this team, starting from Love you to Bits, passing through Bring you Home and arriving up to All of You. Beyond the composition of the titles, which already seem a stylistic figure, the developers focus on game solutions based on interaction with more or less static scenarios and also on the manipulation of the very rules of cause-effect relationships and level composition as an element of gameplay. In this sense, All of You seems to be an evolution of Bring You Home, refining and making the idea that already appeared in the previous game more complex and functional. Also in this case, the basic concept is to get to the end of the levels avoiding various obstacles and threats, making sure that the protagonist hen can gradually embrace all the chicks lost in a tender story of gallinaceous maternal love. Just like in the previous game, the interaction system is based on modifying the constituent elements of the level itself in order to achieve the goal, i.e. avoiding enemies and obstacles not so much by facing them, but by modifying ~reality~ so that you don't even have to ask yourself the problem . It is a system similar to that also seen in Framed, but which here reaches even more daring levels by playing with the rules of physics and with the passage of time, prompting us to find solutions that are even paradoxical but still responding to rather strict logic. Gameplay as level design manipulation Already looking at the images, it is clear how the general setting of All of You is particular: the levels are screens made up of round images, within which there are various elements of the scenario and where the hen moves, passing from one image to another. other. These circles are to be understood as ~tiles~ that make up the level and each one can have specific characteristics, being able to be moved so as to change the position of platforms, paths, obstacles and various objects and the logical sequence of actions, or ~activating~ them in alternately with a simple touch, which starts the passage of time in that particular tonto or fraction of level. From time to time some limitations or partial interaction possibilities are set: only some tiles can be moved, or while some are always active (i.e. the elements inside them move regardless of the player's action) while others must be activated by the touch. The combination of the various possibilities of interaction on the individual rounds and of the elements within them hides the solution that allows the hen to reach the beloved chick and, although the game starts slowly with a rather gentle learning curve, going forward the choices are by no means simple to carry out. Compared to what we had found in Bring you Home, in which trial and error often became the main rule to rely on, often having to simply go on trial and error due to a certain unpredictability of the actions on the screen, All of You seems based on a very level design more logical and structured. It is often necessary to first of all experience the tremendous threats that await the hen to understand precisely what to do, but most of the many levels (there are more than 70 at the moment) hide ingenious solutions, which encourage thinking outside the box. Beyond more logical and obvious situations, such as the need to activate the rounds with the touch in the right timing to avoid enemies or traps, in some cases the game stimulates lateral thinking, making us look for solutions outside the most obvious logical schemes, applying a sort of space-time relativism all its own. By flipping a circle, for example, it is possible to double the distance for a rolling snowball to travel, which can be used to increase its size more than simply sliding it from one square to another, for example, or by tapping a square it is possible to stop time for the surrounding scenario but not necessarily for the hen, or vice versa, with surprising results. In short, there is a certain rigorlogical sity in solving the puzzles, but these can play with the basic rules pushing to find creative solutions, even if in the end it is above all us players who have to understand and interpret the way in which the game bends the physical and temporal rules, rather than being able to experiment with bold solutions in freedom.", "date": "2020-11-13", "grade": "8.0"}