{"name": "Bakugan: Campioni di Vestroia", "ref": "https://multiplayer.it/recensioni/bakugan-campioni-di-vestroia-recensione.html", "text": "The review of Bakugan: Champions of Vestroia comes only at the end of a long journey, made up of tests, studies and also a genuine interest in the title developed by the WayForward guys. In recent weeks, there have been reasons to approach production: Bakugan are some of the best-selling toys in the world, sort of marbles that can be transformed into fighting monsters; it goes without saying that they already had their own anime series, which became famous just in the last decade. And then there are the developers mentioned, the WayForwards: not the latest arrivals, we owe them (among others) the chapters of the Shantae series. And so, after the preview and after the most recent test, we are ready for the verdict on Bakugan: Champions of Vestroia. It's not flattering, but all in all it could have been even worse. Gameplay: Go, Dragonoid! If you've ever seen an episode of the Bakugan anime, you've probably already imagined, in a very intuitive way, the gameplay first conceived and then proposed for Bakugan: Champions of Vestroia on Nintendo Switch. Nothing particularly imaginative, nor able to exploit the hardware and the peculiar characteristics of the console in any way, and this is a pity since it is an exclusive; however the formula somehow shows its why. The protagonist of Bakugan: Champions of Vestroia challenges the other contenders to the sound of transformable marbles: he can bring a maximum of three with him in his team, and this means that on the battlefield at the beginning of the game there will always be two gigantic monsters, one for the player and one for his challenger. During the fight, both present can exchange their Bakugan with another of the two in the inventory, until all three end up KO under enemy blows. The initial choice of those who edited this review is very obvious: Dragonoid, of course, one of the most famous faces of the series. The Pyrus type monster (ie Fire) made it possible to win all the first duels easily, until some NPCs started giving away some of their own creatures, with which to enrich the collection. The presence of Bakugan of different types certainly enriches the title, partly because of collecting (you have to find them all, with extra skills attached) partly because of the combinations on the battlefield (obviously, some Bakugan are more effective against certain types, and weak against the rest). The limitations Beyond a gameplay very similar to that of Pokmon-style and Pokmon-like productions, which works great on several occasions and especially in the presence of the little ones, the limitations of Bakugan: Champions of Vestroia are many. And it's worth starting where we ended in the previous paragraph, that is, from the gameplay. You should know, in fact, that the player does not control the Bakugan fighting on the battlefield: they continue to beat each other up in the background, animated by acceptable cel shading. No, the player controls the protagonist. And the protagonist does nothing but run around the arena, within an arid area with no game elements: his aim is to run around on some luminous platforms, which contain the power of the Bakugan. Having reached this small platform, the hero picks it up from the ground and throws it at his monster to power it up; the energy allows, provided you wait for different types of cooldowns, to launch the attacks in the possession of the Bakugan. Each kaiju comes with four moves, which can be modified and changed later, offensive and defensive. To complete the adventure, it is enough to fall back nine times out of ten on the offensive ones, since the enemies seem to almost sleep standing up. However, the limitations of Bakugan: Champions of Vestroia do not end there. For example, the technical sector of the entire production is not convincing: except for sporadic slowdowns during the execution of the most spectacular moves of the creatures, in any case never invasive, polygonal models and details on the screen seem those of a series C production, or at least of the last generation of consoles. In short, the title is not nice to look at and doesn't make you want to explore the various areas of a city that is also quite vast, and full of new places to unlock. These places are then simply empty, or filled with some random trees and cars, in the worst case by characters who remain motionless like mannequins, even during conversations. Positives Thankfully some positives save Bakugan: Champions of Vestroia. Meanwhile, let's pay a little praise to the Italian language localization for all the texts on the screen and for the dialogues: this makes the use of the title very pleasant, especially for the more piousccoli. Even the customization of the characters is discreet: at the beginning of your adventure you can choose from a whole series of hairstyles and colors, and then later you can unlock even new possibilities or modify the previous ones. Bakugan: Champions of Vestroia also values collecting: there is a shop in the main town, where you can spend the money accumulated in battle to enrich your catalog of monsters. Main and secondary missions, then, will allow you to obtain Bakugan of each element and above all skills with which to upgrade and modify them. Finally the plot. Bakugan: Champions of Vestroia certainly won't win the Oscar for the most brilliant storytelling of 2020, and yet the story flows very pleasantly. Also in this case it is the opinion of the writer that WayForward has taken into consideration, as recipients, above all children: after all, they are above all the ones who buy and play with the Bakugan, right?", "date": "2020-11-03", "grade": "6.2"}