{"name": "The Collage Atlas", "ref": "https://multiplayer.it/recensioni/the-collage-atlas-la-recensione.html", "text": "If you are ready for a melancholic and fascinating journey through a kind of explorable picture book, then join us in this review of The Collage Atlas, because it is a very special experience. The search for artistic expression through the video game is an integral part of the Apple Arcade manifesto and the projects that tend to this end, or at least try to, are now varied, but few seem as genuine as this title, built practically alone by John William Evelyn. It is also difficult to evaluate it, because it is an almost intimate work and an admirable work in any case, considering the skill with which it was composed and the fact that it was developed entirely by one person. In short, in short, The Collage Atlas is one of those games that is easy to love and that pushes you to overlook even obvious gaps, which are also very present, because it is able to strike certain chords and arouse emotions generally positive, regardless of its shortcomings. The main feature of the game is already clear at a quick glance between images and videos, and it is its particular graphic style: entirely composed of dark lines, which outline scenarios drawn in Indian ink on paper, this representation seems to come directly from an illustrated book by the surreal style, triggering the concrete sensation of moving within a story or a dream. Simply moving in this setting and turning your gaze, with the surrounding landscape that also changes according to perspective, comes alive and is composed in various ways, is a real feast for the eyes, to which is added a practically perfect musical accompaniment to reinforce the dreamlike sensation that dominates the whole experience. From an aesthetic point of view, in terms of graphics, sound and coherence between one aspect and another, The Collage Atlas is practically perfect and easily manages to arouse pleasant and melancholic sensations. If anything, the problem is the fact that it does not have a playful structure, or that it has just been sketched out and is very uninteresting, as well as being supported by a narrative that is a little too fragmented and pretentious. Exploring a dream If you're the type who easily indulges in melancholic contemplation, The Collage Atlas can immediately drag you into its world and make you dream with the simple power of surreal drawing and its rarefied music. There is a perfect match between exploration and sound design, with pleasant arpeggios underlining the strange composition of the scenery around us and ambient sounds that reinforce the feeling of being in the middle of a wonderful dream journey. The surrounding world is a strange dimension made up of meadows, woods and recurring objects that fit together to form bizarre architectures: pinwheels moved by the wind that play when we walk near them, pendulum clocks leaning against each other, fluttering butterflies and lanterns, street lamps, small and large structures built with Art Nouveau railings or woven wood and everywhere anchors and beached boats, in a continuous reference to maritime, bucolic and domestic themes at the same time. It is a seemingly decadent but also lively setting, resulting from intersecting memories and thoughts. The other side of the coin, in a world so well built from an aesthetic point of view, is the fact that the game structure is essentially missing. In The Collage Atlas we essentially have to move within this setting designed in search of the pages of a book, to be able to reassemble the thoughts and memories contained therein. There are some simple puzzles to solve and some platform crossing stages that require a minimum of skill, but in principle it's just a matter of finding your way to some points on the map, looking for objects such as memories locked in jars, keys to open doors to new areas and finally the aforementioned pages of the mysterious atlas, which can also be hidden in more remote places than the settings. There is very little to think about and a lot to explore and admire, which makes this a contemplative experience rather than a real game, especially since the interaction with its world is extremely limited to some specific situations, while for the rest it is also possible to go through the elements of the scenario. There is a vague message of hope and an invitation to follow one's dreams scattered among the pages of the atlas, however completely translated into Italian. Compared to the quality of the drawing and the music staged, it must be said that the writing is a bit simple, set on a not exactly elaborate poetics. It's not a big problem and in any case the positive message it gives is always appreciableshore from the journey, but this aspect seems a bit out of tune with the artistic level achieved by the figurative language. In this regard, it must be said that a game like this really represents an effective form of written and illustrated narration that can be explored in the first person, which could also be applied to more developed texts.", "date": "2020-11-02", "grade": "7.8"}