{"name": "Torchlight 3", "ref": "https://multiplayer.it/recensioni/torchlight-3-recensione.html", "text": "We arrived full of expectations for the Torchlight 3 review. You don't see a lot of proper hack 'n' slash around and in the more recent past the Torchlight series has always been able to compete well with Diablo, offering a more colored and with cartoon tones compared to the direct competition, a feature that has made the production unique and easily recognizable on the market. In addition to that, Runic Games has always created titles full of content, with an exhilarating progression and branches of talents capable of enormously diversifying the style of play of each class. We certainly never got to the levels of Path of Exile or Wolcen, who made it one of the cornerstones, but it certainly cannot be said that that sector was disappointing. After two chapters in great dust, the announcement of Torchlight Frontier had made us raise the first eyebrow, given the decision to transform the world of Novastraia into a completely online free to play ecosystem. Although such a project did not bode well, the minds behind the title boded well, given that the development had been entrusted to that Max Schaefer father of Diablo and Torchlight. Beautiful dreams do not last long and the rude awakening however saw Frontier vanish like a soap bubble with an abrupt and sudden change of course that directed Echtra Games towards a more classic experience: thus Torchlight III was born. After a long period of Early Access, the time has therefore come to see if the expectations have been met. The roots of a failed project It is not easy to start with such a clear idea in mind and then find yourself a year after its launch deciding that that gimmick was not sustainable or particularly successful, effectively having to give up and start designing a video game again from the basics. The biggest problem, in this case, is that to salvage what can be salvaged, you often find yourself dealing with a monstrous Frankenstein, the son of a serger with pieces that fit together little and badly. Torchlight III, bluntly, is just that and you notice it quickly after a few game sessions. The title presents a story with a fantasy 1.0 taste with an ancient evil awakened years after the previous chapter and a handful of adventurers determined to annihilate it. A choice that can also work for a hack 'n' slash, except that the narrative is becoming increasingly deep and tasty even in this kind of game. What made us turn up our noses the most, however, was all the visual impact, with an anonymous game world and flat enemies, in a continuous repetition of all the same models and color variations that we hoped were by now the legacy of an era distant. Instead, to produce more content, Echtra forgot that variety is equally important and so we find goblins, spiders and insects to accompany us for the entire duration of the game, in three acts that lengthen uselessly in a debilitating monotony. There is occasionally a flicker, at the appearance of some new creature, but morale collapses again brutally when one realizes that yet another boss is just an enlarged version of the aforementioned spider or goblin, perhaps with a unique attack pattern if we are just lucky. A construction of this kind cannot then in any way satisfy the player avid for massacres who basically finds himself playing against the same opponents for all the 15 hours necessary to complete the story. The feeling is that the game is still very far from being finished and that Schaefer had to settle for recycling content to throw this third chapter quickly on the market. In fact, there is a huge discrepancy between the creatures, trivial and anonymous, and the four available classes, which instead offer not bad unique peculiarities. Ranger and Mago are declined in a fairly classic way but the Forgiato and the Mastrorotaia have entered our hearts rightfully. The first is a robot, or rather a boiler with legs, inside which a powerful cannon is hidden, capable of exploiting the heat generated by its internal furnace to generate devastating effects, while the Mastrorail is an interesting twist on the summoners given that the his very personal pet will be a small train armed with machine guns and other essential gadgets If in early access the construction of the builds was really limited, with the launch of the game a third branch was added to give a little more depth but the general vision still remains very flat and well behind other stocks in the market. In short, if you are looking for something that will make you puzzle over the creation of your characters with numeras and statistics you better look elsewhere. Aftermath from free to play There are many other things that don't work as well as you'd expect from such a major title and the first is how the animations respond when using skills. In fact, the gameplay requires that each skill completely finishes its animation before being able to be chained with another and this often leads the game to completely lose fluidity, as well as to become very unfunny in excited moments where instead you would just like to throw crazy shots of sword or chain spells. We find ourselves thus enmeshed in a slow and cumbersome system that does not marry the genre of belonging to get to fights very far from the desired epicness. The level design is also terrible, with a poor procedural construction and which, unfortunately, tends to repeat itself excessively making us repeatedly visit rooms that are too similar to each other always leaving an annoying sense of dejavu, with the last choice of making us face the bosses always in the same room of reduced dimensions thus snatching any artistic ambitions from those clashes that should instead be the most canonical of the entire production. Echtra then decided to block the player's growth by linking the progress of the levels to the completion of the quests, almost as if it were a rank to be overcome before being able to proceed, instead of relying only on the user's level. You will thus find yourself entangled in a vertical growth with no outlets to find your way, following a really boring straight line path. Even the housing is not convincing at all, with a markedly free to play feature where you build your fort by collecting raw materials for the world showing the other players the progress achieved, a mechanic that we found really superfluous and of very low interest, so much so that after having built the altars to earn bonuses to elemental resistances we have completely given up ~home~ to continue the adventure undisturbed. Free to play mechanics also in the growth of fame, a sort of integrated season pass useful only to bestow some extra rewards but which in fact does not guarantee any incentive to hunt for elite monsters or the best equipment. Furthermore, our experience has been plagued by more or less serious bugs, translation errors or missing text portions, by sudden disconnections from game servers (thus making us often lose the progress of the level) and by achievements on consoles that just didn't want to know to show yourself in Italian.", "date": "2020-10-13", "grade": "5.5"}