{"name": "Lets Sing Queen", "ref": "https://multiplayer.it/recensioni/lets-sing-queen-recensione.html", "text": "The Let's Sing series has been a companion, since time immemorial, to many family karaoke evenings. Today with the review of Let's Sing Queen on Nintendo Switch we discover a thematic aspect: this time it is an official chapter and at the same time a spin-off, dedicated (as obviously you can already guess from the name) to one of the greatest rock band of all time. After a few hours, spent in the company of family members who lent themselves to singing with artistically fluctuating results, we can tell you all that the production has to offer... and that is, a discreet and appreciable amount of content, but only for those who know exactly what is looking for. The contents Let's Sing Queen is now available on various consoles: the writer of this article has dealt with its version for Nintendo Switch, which from the point of view of content is naturally identical to all the others. It is therefore a package that includes 30 songs by Queen: all strictly thematic songs and which therefore, unlike Let's Sing 2019 and later, does not offer varied and all more or less recent songs. It is, this is almost obvious, a package that will be searched for, chosen and purchased by Queen lovers, or in any case by those who intend to organize one or more evenings with friends dedicated to songs such as We Are The Champions, Innuendo, Bohemian Rhapsody and company. It makes no sense to expect anything else or expect future updates of any kind, even if we wouldn't be surprised by some paid additions in the coming months. The title is available in two different versions, and these must be kept in mind: the first consists of only the software for 39.99 euros, the second includes a USB microphone inside to be connected to the Nintendo Switch, and costs 49.99 euros instead. For just ten euros more we would advise you to opt for the latter, even if you already have a first microphone available: singing alone, after all, the title gets boring almost immediately. However, know that on all Let's Sing Queen consoles it is compatible with the free Let's Sing Mic app, to be used exactly as a wireless microphone. The game modes The main game mode of Let's Sing Queen is really intuitive, and moreover it is the same as always in the series: the player holds the microphone (or the compatible app) in his hands and sings the songs on the screen with the help of the English text that scrolls at the bottom of the video. Obviously he must follow the melody well, get the intonation right and keep the rhythm so that the colored dot remains within the segments that run at various speeds, and which will determine the score obtained at the end of the performance. A formula that is always the same and that continues to work, just as ~simple~ karaoke still works in 2020. This basic offer is the same as in the Classic mode, where you can sing your favorite Queen hits alone (in ~solo~) or with your friends (the game supports up to eight players at the same time). But there are some options to vary the cards a little: for example in Feat Mode it is possible to sing in duet with your partner to find out your degree of affinity, through a percentage that also represents the overall score. If you are alone - a very nice detail - your partner becomes Freddie Mercury, obviously not the resurrected star but an NPC controlled by artificial intelligence. In Mixtape Mode five songs are played in a row without interruption, randomly chosen by Let's Sing Queen or by the player within a sort of personalized playlist; Juke Box is instead an archive with the thirty Queen songs included in the production, accompanied by original videos. You don't really play here: you simply start playback to listen to your favorite classic. Multiplayer and some flaws Could multiplayer have been missing, in a production clearly designed for evenings with friends? Answer: no. The Let's Party Mode therefore allows you to create two teams (up to eight participants in total) and challenge each other, song after song: obviously the one who accumulates the most points at the end of all the performances wins. There is even an online mode that seems extremely fast in matchmaking, but we couldn't figure out if it works in real time or asynchronously: it's the World Contest, complete with a ranking to climb. There are some defects, which are the same ones we noticed a couple of years ago also in Let's Sing 2019, and this says a lot about the conservative drift of the production. Creating your own avatar should provide sometype of stimulus to creativity and progression, because by leveling up new possibilities are unlocked: in reality the alter egos are almost all anonymous and very similar, however with a questionable style and a care that is more reminiscent of that of the last generation. But the real problems begin where Let's Sing Queen would like to wink at modernity, that is, with the use of the Let's Sing Queen app. We encountered significant obstacles even just to start it, and from two different Android smartphones (a OnePlus 6T and a recent Galaxy): sometimes the app crashes completely, preventing you from entering the synchronization code shown on the Nintendo Switch, others sometimes it loses the connection and everything has a very, very noticeable input lag. Considering that the Wi-Fi network was a 200 Mega Fiber, this proved to be really frustrating.", "date": "2020-10-05", "grade": "7.0"}