{"name": "Among Us", "ref": "https://multiplayer.it/recensioni/among-us-la-recensione.html", "text": "At this point, a review of Among Us becomes almost a must, if only to understand what happened and why this title has become a sort of unstoppable global phenomenon. Perpetually stable in recent weeks at the top of Steam's most played rankings, having reached the beauty of 2.7 million daily active users (unofficial data), the game has however had its real explosion on mobile, where the numbers reached are truly shocking: on 3 September it had exceeded 10 million downloads, five days later 50 million and on 21 September it crossed the milestone of 100 million downloads, continuing its run. What's even stranger is that Among Us did not have this explosion in its debut, having been released way back in 2018, so its success is given by an incredible amalgam of fortuitous situations and the enormous push given by streamers, becoming in a certain sense the paradigm of power that these new opinion leaders have on the perception of video games and their actual success. It has never been an unknown game, mind you: in 2019 it had already reached its first million downloads which, for a title created under an indie regime by only three developers, already represents a great success, but it is clear how the social sounding board worked perfectly to launch it into hyperspace. In addition to the attraction of streams made by rather popular personalities, Among Us has some features on its side that favor its diffusion to an almost viral level: it has an extremely low cost on Steam and is free on Android and iOS (with micro-transactions linked to the purchase of aesthetic accessories and short non-invasive advertisements), requires a small download and minimal hardware configurations to work, is multiplayer, lends itself to quick games and moreover, thanks to its funny characterization and the social implications that can derive from it, it is practically done on purpose to build memes on it. But is there substance behind all this visibility and fashionable diffusion? Indeed yes, above all because the concept is based on a trend that has its roots in parlor games popular since the 80s, such as Lupus in Tabula, Mafia or in a certain sense also the RPG Paranoia, focused on deduction and the interactions between players in an interactive ~mystery~ context. So if on the one hand it cannot be said that Among Us has invented something new, on the other we are sure that the gameplay has very solid foundations. Asymmetrical gameplay The premise is very simple and is based on deploying two factions with opposing objectives: a larger group of players plays astronauts intent on carrying out a series of technical operations for the maintenance of a sort of space ship, but at the same time an individual or a small handful of players are imposters, secretly tasked with sabotaging these operations and eliminating the others. A maximum of 10 players take part in each game and, while most of these are in charge of completing various activities around the ship, performing real mini-games to fix electrical circuits, set the route, collect samples for the medical unit and so on, the traitor (or traitors) must make sure to implement their evil plan, going to sabotage critical elements of the structure (the reactors or the oxygen reserve for example) and at the at the same time eliminating the opponents, obviously trying not to be seen and not to arouse suspicion. The problem is that, of course, none of the crew knows who the imposters are, creating an atmosphere of suspicion and tension throughout each match, clearly tempered by the humorous characterization of the game. The gameplay is structured asymmetrically, as befits a multiplayer in which the forces in the field are distributed in a different way: despite the simplicity of the actions to be performed, there is the need to develop a strategy, especially on the part of the traitors: knowing at your fingertips the dislocation of the various areas of the ship (or space base) is essential, as is the fact of acting quickly but above all suspicion, perhaps taking advantage of hiding places and trying to stay out of sight, or performing seemingly harmless tasks in the vicinity of too many players. Conversely, the role of the astronauts is simpler and less exciting, but it is not without its difficulties: here the mini-games related to the various tasks to be completed on the ship come into play, with the need to carry them out as quickly as possible and therefore with a minimum of manual skill. This is to bring to termfinish the objectives before succumbing to the faction of impostors, both because during the mini-games you do not have a precise vision of what is happening in the surroundings and we are therefore easy targets. Technically, Among Us is an extremely simple and in many ways crude game, with its flash game aesthetic designed in a stylized way, yet even this manages to give it a remarkable character. Several problems can emerge in terms of stability and netcode also due to the amount of online users, with disconnections, lag and server overload, although recently the situation seems to have stabilized a bit. On mobile platforms, the control system with virtual pad on the touch screen is not the most accurate, and leads to some involuntary errors, but fortunately this is not a fundamental aspect of the gaming experience. On the other hand, the controls on PC are good, with the use of the standard mouse and keyboard configuration (or mouse only). Traitor hunt It is to all intents and purposes the direct translation of a board game into a digital environment: the real core of the action is found in the interactions between the players, which here emerges in a disruptive and also particularly hilarious way during the moments of direct confrontation in which a vote must be taken to expel a suspect. When a body is discovered or there is a precise suspicion, an emergency meeting can be called: in this phase there is a real chat in which players can present their suspicions and possibly the evidence collected, trying to converge on a prime suspect. We therefore proceed to a vote on who is the traitor and the one who gets the highest number of votes is expelled into space, only that often and willingly the evaluation is wrong as it is based on fallacious clues or real deceptions, and this is the Handsome. The debates are probably the funniest moments in the entire Among Us experience, also because a large part of the strategic phase of the game is concentrated here, beyond the traitor's ability to act covertly. Using very few words and in a handful of seconds we witness a wave of often unsubstantiated suspicions (and Cyan, or the blue character, is usually at the center of prejudices here too, self-feeding the universe of memes), weak attempts defense or ingenious bluffs and all of which usually ends with a tragically wrong spatial execution. What matters in the game is therefore the ability to deceive, to hide one's actions but also to divert suspicions and concentrate them on others, often innocent. Precisely for this reason, the game is based above all on the behavior of the competitors: the quality of each game essentially depends on the fairness and willingness of the participants to team up. This does not mean avoiding joking about it, because even crass humor is the basis of Among Us, but given the huge turnout of online players it is easy to find yourself in the midst of too chaotic games, with little sensible decisions made during the debates . For these reasons, it is decidedly preferable to play it locally with friends, rather than with strangers, who can ~cool down~ the climate or behave in an inappropriate way.", "date": "2020-10-01", "grade": "8.0"}