{"name": "Kirby Fighters 2", "ref": "https://multiplayer.it/recensioni/kirby-fighters-2-recensione.html", "text": "Announced in advance by the umpteenth leak, the latest in a series that is definitely questioning the pleasure of discovery at the time of the World Wide Web, the review of Kirby Fighters 2 tells us about a title that arrives on the Nintendo virtual store to give and newcomers to fighting games a taste of what they could expect if they bought Super Smash Bros. Natural evolution of an extra mode of Kirby: Triple Deluxe, then re-proposed stand-alone as Kirby Fighters, this little 19.99 software wants to be probably a brawler with rose water for those looking for a small title with little pretensions with which to spend a few carefree hours. But did it make sense to propose it as a real standalone game? In our opinion not. Kirby fights It makes perfect sense that Kirby Fighters 2 follows the Super Smash Bros. model if we consider that the developer HAL Laboratory, historical father of Kirby, has also signed the famous brawler Nintendo: the fights take place in arenas characterized by suspended platforms where they face each other up to to four wrestlers simultaneously. Kirby Fighters 2 is in fact a full-fledged brawler, in which the player controls the character chosen from a roster that includes numerous variants of Kirby, as well as his most iconic adversaries or companions, from Waddle Dee to Meta Knight, passing through Gooey, King Dedede and many more. The control system is simple and intuitive: with one button you attack, with another you jump, and yet another serves to engulf - and then spit - your opponents. A last key allows you to parry, but only for a short period of time, so as to avoid players castled in the typical turtle strategy. Not that much is needed, given that the artificial intelligence is anything but aggressive, especially on the lower difficulty levels. Each character has a sufficiently different moveset, largely inspired by the forms that Kirby takes in the games of the series when he engulfs his enemies. Most of the roster is in fact made up of Kirby and his variants: Masked Wrestler, Swordsman, Yoy, Grenade and so on. The special moves are performed by holding down the attack key or by combining it with the jump or a specific direction: it is really very intuitive and in a few minutes you become familiar with each character, although the general differences are not that marked. However, the initial choice is quite limited and it will take a few hours to unlock the more than twenty fighters, since you have to complete the various game modes and accumulate fighter points by winning the fights. The latter mark the progression of the so-called Fighter Level: wrestlers are unlocked at each new level up, wigs that change their appearance, stages in which to fight, amulets that help in battles and many other collectibles. In this respect, in short, Kirby Fighters 2 is a fairly rich title. The problem is the variety of gameplay, which boils down to fighting against the artificial intelligence in single player modes or against other players, locally or online. In turn, the various modes allow you to choose whether to fight in teams of two players against two, or individually in a real battle royal: the rules are simple, the last one standing wins or the one with the most vital energy at the end of the game. time. As we said, the artificial intelligence is relatively problematic, but the gameplay, although simplistic, guarantees a fair amount of depth and more experienced players can give a hard time, especially if you play online and experience an annoying lag as happened to we. The game modes Unfortunately, the various game modes proposed in the beautiful animated menus hide a dull repetitiveness. In addition to Battles, which obviously allows you to play free games up to portability or on the same TV, you can play Online and locally, or face the Story mode entitled Fatal Rivals. Unfortunately it is a decoy, because the ~story~ in question does not exist: in pursuit of King Dedede and Meta Knight, Kirby and his teammate - chosen by the player - must climb a tower and face multiple fights on each floor, which usually culminate in a boss fight inspired by the adventures of the pink wad like, for example, the inevitable Wispy Woods at the end of the first chapter. The ~story~, if we can call it that, is practically an excuse to fight, accumulate Fighter Points and unlock collectibles. The last mode that is unlocked almost immediately by simply playing is called One player and, as thename, does not include any multiplayer component: it is in fact a kind of survival mode in which you have to face several matches in sequence without ever losing and in the shortest possible time. In short, variety is not the strong point of Kirby Fighters 2: it is a pastime that runs out within a few hours and it is a pity that HAL Laboratory has been more careful in taking care of its appearance than its contents. While not a graphically sophisticated title, Kirby Fighters 2 is colorful, beautifully animated and full of details and quotes that recall the Nintendo franchise, but not only, even in the music. Unfortunately, however, there is very little iron in the fire, and it would have been better to offer Kirby Fighters 2 as a minigame in a compilation than as a stand-alone title: in this form, in short, we really don't feel like recommending it at the proposed price, at unless you want to introduce younger friends or relatives to fighting games.", "date": "2020-09-29", "grade": "5.5"}