{"name": "Mafia: Definitive Edition", "ref": "https://multiplayer.it/recensioni/mafia-definitive-edition-recensione.html", "text": "The review of Mafia: Definitive Edition is one of those pieces to which you inevitably end up giving a particular value, especially if you are part of the so-called ~old guard~ of gamers who experienced Thomas's adventure for the first time eighteen years ago ~Tommy~ Angelo as something revolutionary, in its way. Arriving curiously after the remake of the second episode, available since last May, the game falls within the scope of an extraordinarily convenient collection, Mafia Trilogy, which for a price equal to just 60 euros allows you to retrace the entire saga produced by 2K Games in a completely redesigned version. However, we were talking about the special meaning of this first chapter, which at the time was able to offer a substantially more mature and convincing narrative than other similar productions, as well as offering a cutting-edge technical sector; all despite a map that is far from the concept of open world, which from mission to mission bends to the needs of a linear progression. Well, the Definitive Edition avoids touching this aspect in particular, therefore it does not give us a Lost Heaven redesigned in its own functions but solely in the aesthetics and practicality of wider and more populated streets. The concrete differences are perceived in other elements, from the narrative sector to the combat system, which embraces the third person shooter mechanics in a more convinced and consistent way with the series. History The story that is told in Mafia: Definitive Edition has not changed from the original of 2002, but the developers of Hangar 13 have managed to enhance its characters in an unprecedented way by adding dialogues, nuances and narrative implications. Thomas ~Tommy~ Angelo is a Lost Heaven taxi driver who one day gets involved in a daring chase and helps, reluctantly, two men of the Salieri family to escape their pursuers. Days later, recognized by members of the Morello clan, the man is beaten and chased but receives the help of Sam and Paulie, the mobsters he had bailed out, who introduce him to their boss to bring him into the family. Initially employed as a simple chauffeur, Tommy quickly learns how things work, becomes fascinated by the money and the luxury that is guaranteed to him, and gradually becomes a point of reference for any kind of assignment. However, the plot of the game opens in 1938, at the end of the man's criminal career, forced to ask for police protection because something finally went decidedly wrong. The events that marked the best years of the Salieri family are therefore retraced by Tommy in the story he offers to detective Norman, full of terrible admissions of guilt made with the sole purpose of saving his wife and daughter. As mentioned, the cutscenes of Mafia: Definitive Edition have been completely redone and boast cinematic direction, punctual and precise in strict compliance with the times, which in the local version can also count on the support of an excellent dubbing in Italian. Of course, the voices of the protagonists have changed but Valerio Amoruso with his interpretation of Tommy does not make you regret Claudio Moneta, and in general the entire cast has been able to give their best. Gameplay In addition to the narrative sector, the gameplay is the element that has received the most attention in this remake. If in fact the original Mafia used a third person view but ended up adopting a first person shooter gunplay, for the Definitive Edition it was thought well to harmonize these mechanics by taking Mafia III as a reference and thus redesigning the entire experience, from interface to the cover system. The final result is undoubtedly pleasant and quite modern, giving life to some of the most demanding sequences of a campaign that unfolds through over twenty increasingly complex and multifaceted missions. The arsenal available to the protagonist is fairly large between pistols, rifles, machine guns and special weapons, but a melee combat system based on simple attack and counterattack mechanisms has also been introduced, with some spectacular finishers. The lack of refinement of certain moments, between more or less obvious glitches (which we imagine however will be fixed with the first updates) and various ~joints~, leaves a bitter taste in the mouth and reminds us that what we are playing is the remake of a title that has almost twenty years on its shoulders. The artificial intelligence of the enemies is part of the same speech: some behaviors are convincing, see when they change position behind cover to shoot at us from a different point; altri are quite inexplicable, like when they go straight ahead regardless of the bullets. All this also applies while driving, at least with the default settings: the police cars will only give us torment if we choose to set the original difficulty, and at the same Thus the behavior of our vehicle will become more nervous if we choose the simulation option instead of the arcade approach. It's nice to have this freedom of choice, despite the fact that, as mentioned, the scenario is merely functional to the action and does not enjoy a life of its own. Structure The shortcomings of Mafia: Definitive Edition therefore reside in its structure, which refers to the original, limiting itself to embellishing certain aspects of the experience without adding content or thickness. So yes, it is possible to break into the doors of a car or steal it from the owners when they are stopped at the traffic light, but these are actions for their own sake, which in practice lead nowhere: the Lost Heaven map is freely explorable but offers very little beyond what happens in the individual missions, and so the Free Ride mode also leaves its time as it finds. Likewise, the game's campaign length is roughly identical to the original, ten to twelve hours a depending on how much you entertain yourself or the inevitable game overs during the most complicated assignments, when you have to face a really large number of opponents, your vital energy is taken from us with disarming ease and ammunition never seems to be enough. Playstation 4 trophies There are forty-four Trophies in all that can be obtained in Mafia: Definitive Edition. Most of them are unlocked simply by completing campaign missions, but there are several achievements linked to particular actions: paying a fine to the police, resisting arrest, breaking into the doors of a certain number of cars, stealing a certain amount of vehicles, find all collectibles, and so on. Technical realization We played the title on PS4 Pro, and unfortunately the difference compared to the tested Mafia: Definitive Edition on PC is really evident. Beyond the frame rate, which on consoles is limited to 30 fps but at least does not suffer from drops and is well timed, the distance in terms of effects is very clear especially during the daytime scenes, when the city takes on an inevitable flat and overexposed. We also notice a very evident pop-up at the edge of the road when driving along country roads. In the evening, fortunately, everything improves substantially and the atmosphere also benefits greatly, while we drive by car with the radio on ( and the same two stations available) towards the next objective, scrutinizing the numerous puddles on the street that highlight the great protagonist of the graphics engine used for the remake of Hangar 13: the screen space reflection. This is generally a very heavy effect, but it is used in Mafia: Definitive Edition with extraordinary aplomb. And so, instead of using trivial cubemaps to give the illusion of reflections, the game actually mirrors the scenery in puddles of water and on glossy floors, in some cases providing a taste of what we will be able to admire on PS5 and Xbox Series X with ray tracing. We have already talked about the excellent dubbing in Italian, but it is the sound sector in its entirety that really stands out, thanks to an extraordinary completely re-recorded orchestral soundtrack, to which several songs related to the atmosphere of the 30s have been added .", "date": "2020-09-24", "grade": "8.0"}