{"name": "Sky Force Reloaded", "ref": "https://multiplayer.it/recensioni/sky-force-reloaded.html", "text": "Mobile phone recharge Also developed by Infinite Dreams, Sky Force Reloaded does not deliberately distort the winning formula of its predecessor, thus reconfiguring itself once again as a decidedly classic shooter. Once again, there is not the slightest semblance of a storyline: you launch the game and immediately start filling enemy planes, tanks and emplacements with lead. First of all, however, you have to choose the difficulty level among the three available, an aspect which not only involves a different aggressiveness of the opponents but which also defines the percentage of destruction necessary to overcome the various levels: in Sky Force, in fact, it is enough to arrive unscathed at the end of the stage, but it is also mandatory to take out a set amount of enemies in order to continue. The second step concerns the selection of your spacecraft, divided between three options that fully reflect the stylistic features of the genre: there is the slow but resistant one, the fast but fragile one and finally the balanced one. However, it must be said that, given the non-obsessive pace of play, the agility of the vehicle definitely takes second place to the level of the shields. Once this is done, you can finally start shooting. One two three star Sky Force Reloaded is divided into eight stages of progressive difficulty, with objectively somewhat trivial and repetitive settings but literally full of enemies. Each half-exploded opponent leaves stars on the screen that must be collected to increase the score, as well as some occasional bonuses that increase the characteristics of your ship. The power-ups are divided between shield refills, secondary weapons (automatic missiles and a devastating laser managed by a special key) and upgrades for the main shot, which can be single, double or tripartite and with different degrees of power: in this meaning Sky Force Reloaded is evidently limited and would have benefited from a few more offensive tools to ensure greater variety in the action. Finally, a last collectible is made up of some humans scattered on the playing field, whose rescue leads to a substantial increase in the score: unfortunately, however, these are so small as to be difficult to identify during the excited fights, and we often end up making them out without even being aware of their presence. Beyond everything, however, Sky Force Reloaded remains a fun and frenetic shooter, challenging without being frustrating and satisfying for the volume of destruction that can be accumulated on the display of your mobile phone. Thanks also to an excellent 2D graphic creation, with bright colors, excellent explosions and many elements on the screen without ever mentioning a slowdown. Also appreciable are the three-dimensional structures that occasionally peep out over the scenario and which provide a convincing sensation of depth. It should be noted that the visual impact of Sky Force Reloaded varies slightly depending on the mobile used, featuring more special effects and polygons on newer hardware (eg the new Nokia N Series mobiles). The sound is also decidedly good, with sufficiently powerful effects and a continuous, convincing and never annoying musical accompaniment. One two three star Game tested on Nokia 6630. Comment Sky Force Reloaded is a rather conventional sequel, in the sense that it absolutely does not go beyond the lines drawn by the prequel: the gaming experience is therefore substantially identical, as is the graphic quality, enriched only by a few more polygonal constructions. Despite a certain lack of originality, however, Sky Force Reloaded remains an excellent shooter, certainly among the best available on mobile phones: and this, at least for now, is enough to make it advisable for all fans of the genre. Pros Excellent graphics Fun and exciting Well calibrated difficulty level Cons A few more bonuses would not have hurt Basically identical to the prequel Scrolling shooters are definitely among the most exploited genres in the field of entertainment on mobile phones, both for their simple play structure and for the constant appeal they stimulate in the average user. Despite the vastness of the offer, however, so far there have been few really successful products: among these, the Sky Force one certainly stood out, released some time ago, and which can now boast a sequel that we will now analyze.", "date": "2006-11-08", "grade": null}