{"name": "Terra Nil", "ref": "https://multiplayer.it/recensioni/terra-nil-recensione.html", "text": "In an era in which environmental issues are the order of the day, from drought to pollution, through landslides, water bombs and so on and so forth, it was only a matter of time before someone returned to explore these themes also in videogames. Terra Nil, the latest effort from indie development team Free Lives, the Cape Town-based studio behind Broforce and Genital Jousting, does just that, putting us in charge of a futuristic scientific expedition that aims that of restoring the terrestrial ecosystem not so much to allow man to return to the planet, as happens in Wall-E for example, but to hide his passage under the carpet and return his living spaces to nature. The game, published by the multifaceted Devolver Digital, the American publisher famous for Hotline Miami, Enter the Gungeon, Katana ZERO, but also for its crazy conferences during E3 (or what's left of it), will arrive on PC and mobile, thanks at Netflix on March 28, 2023. In the Terra Nil review we will tell you if we managed to save the Earth from its greatest threat: man. Terra Nil, more puzzle than strategic? At the beginning of each Terra Nil scenario you will have to clean up the Earth devastated by pollution As we said, the purpose of Terra Nil is to restore the ecological balance in four parts of the planet heavily ruined by pollution and the presence of man. The recovery of the environment must always go through three distinct phases that require you to reach certain prerequisites to unlock the next moment and the new options that are made available with it. We will always start with the level reclamation, a phase in which Terra Nil offers only the tools to generate energy and the structures necessary to clean up the soil and polluted waters. Once a significant portion of the map is cleared, buildings and machinery are unlocked with which to create new biomes that will restore biodiversity to the planet. Once the conditions necessary to sustain life have been achieved, it is time to look for the perfect habitats to reintroduce the 6 native species of that region. After that, all that remains is to decamp, recycling all the machinery used up to that moment and abandoning the area forever. After the reclamation, in Terra Nil it is necessary to create the biomes necessary to sustain life Unlike similar experiences in which the player is asked to manage a complex ecosystem with balances that are almost impossible to balance, so that each map can last almost indefinitely, in Terra Nil the objectives are clear and, once achieved, there is no plus a lot to do. Also because there is no going back: except for some parameters, such as humidity or temperature, the ecosystem is not dynamic and only responds to the player's requests. For this reason, the work of Free Lives reminded us more of a puzzle game than a classic strategic / managerial one, given that the limited resources, the close correlation between the buildings and the obligation to use certain structures push the player to understand how ~ solve~ the scenario, rather than managing it through constructions. On the contrary, the city builder part is the weakest one, since it sometimes forces you to look for inelegant solutions to get around the limitations imposed on the table, such as when you need to create channels just to recycle structures positioned outside the range of action of the aquatic drone , despite the fact that in other levels the one that moves on the monorail or even the flying variant has been used. The recycling phase is the final one of Terra Nil In this way, often, the most complex part of a level turns out to be the first, the one where you have to manage well the few resources available to build the first electric generators and the structures with which to reclaim the polluted land. Indeed, once the first areas of the map have been restored, the greenhouses can be used to earn new ~nature points~ to spend on the more advanced features, which also allow you to reach secondary environmental goals which not only earn you many points, but which sometimes they activate events capable of modifying the gameplay such as rain, an event that automatically reclaims the entire level and with which to obtain practically infinite resources. Each biome, in fact, is characterized by secondary requests that often need to be addressed with specific tools. In Terra Nil, the more advanced stages of the game do not correspond to those in which all the structures and options encountered up to that point can be accessed, but simply to those where it is more complexor reclaim the environment with the few resources made available. The developers, in fact, have created the levels as small environmental puzzles that must be solved with what you have, finding a way to fit the few available tools together; for this reason the limits imposed are greater than for similar productions. Each building in Terra Nil has a very specific role in the game Some structures, for example, can only be created on top of others, as well as some extra features can only be activated in very special cases. If something goes wrong, you will have to look for an alternative way to redo things since, except in the final ~recycling~ phase, it will not be possible to destroy your own structures. A somewhat limiting aspect, which often forces us to devastate the environment, with new channels or dredging the bottom of the seas, to find a way to save the planet. A bit of a contradiction. A refreshing experience The dawn is one of the most poetic moments of Terra Nil The aspect in which Terra Nil is certainly the center is the artistic one. In fact, due to the small levels, limited interactions between the various systems and legible, but not complex graphics, the game is able to run easily on PCs without a dedicated graphics card, such as the ThinkPad T14 Gen 1 used for review, and mobile devices. This, however, should not underestimate the artistic impact of a work full of details to discover and small/big moments that are able to amaze, such as the first time you will be able to make it snow, or when the northern lights will return to shine. Hovering the mouse over an area will hear the sounds produced there, a ploy designed to ensure that the audio is enriched along with the return of life. These are delicate but powerful moments, capable of making it clear that we have been able to reactivate those processes that allow nature to heal itself autonomously. At that point it will be enough to eliminate every human sign and the Earth will be able to say it is safe again.", "date": "2023-03-27", "grade": "7.5"}