{"name": "moon: la recensione per Nintendo Switch", "ref": "https://multiplayer.it/recensioni/moon-recensione-nintendo-switch.html", "text": "The protagonist of our review of moon would theoretically be called Moon: Remix RPG, which said so it looks like a Square-Enix title but no, it's a Love-de-Lic title. In reality it is a conceptual world so distant from the classic dictates of the JRPG that even just comparing it to today's Square would be a sacrilege, but it is funny that whoever created it is just an ex-Squaresoft employee. Kenichi Nishi founded the studio in 1995, then other very peculiar characters arrived who had had a hand in the development of Chrono Trigger and Super Mario RPG; a team of 9 professionals who for two years worked on an atypical JRPG - completely destructured in its heritage but absolutely coherent in its essence - which in 1997 did not challenge anyone, despite the fact that it was the year of a certain Final Fantasy VII. It was only released in Japan, it became a niche and then a cult title, it was told by few and played by even fewer, but appreciated by all those who had the desire to go beyond a narrative and gameplay that to say eclectic is an understatement. We could define it as a little Mother in terms of style and destiny, a work capable of winking in a delicate and perhaps unique, certainly profound way. Quotes and anti-heroes Incredible to say, after 23 years the title has finally been localized for a new, sparkling release on Switch: a work capable of demonstrating how far Moon was ahead in terms of writing, setting and atypical role-playing structure. Moon: Remix RPG is a huge parody of the JRPG genre but seasoned with sweetness and infinite citation stimuli that make you smile and think, without weighing, about what this genre of dreams has represented in everyone's imagination up to now. The title initially puts us in the role of a boy who entertains himself with an imaginary console and an RPG in which a knight, the hero, must defeat a dragon. A quick prologue: the hero is unbeatable and the whole system is perfectly reminiscent of a classic Dragon Quest from the 16-bit era. We return to reality, the boy goes to sleep, but in his sleep he is plunged right into the world he had just saved, mercilessly killing enemies and monsters in his heroic quest. This is the face of the JRPG genre that Love-de-Lic ironically wants to bring to life: is it right to make your way through fights and accumulation of experience by defeating often innocent enemies? Or is it perhaps more correct to make one's way with love, the cornerstone of Moon's world? This is how it starts, with a non-protagonist made up of only clothes, in what is a constant walk in a surreal world, temporally outlined by a counter that represents the love of our alter-ego, restored only by going to sleep. Otherwise? Dry game over. Love for everybody The work of Nishi and friends is the quintessence of irony, but always accompanied by excellent writing and a playful system for a few, very few close friends who can understand the flow of the game. The software explains almost nothing and it will be up to us to understand where to go, how the time element works, what changes over time, how to save and, basically, how to advance in history. It is no coincidence that the creation of Love-de-Lic focuses entirely on love, a key element of the title, a true playful fulcrum, which represents both experience and resistance, weapon and objective, concept and substance of the parody of a genre, but also of life itself. Because in Moon, while the typical hero goes around killing monsters, our goal is to recover the souls of those monsters and bring them back home, giving love around the world, leveling up (of love) and learning the routines of NPCs to help, understand and cheer them up. The essence of Moon lies in breathing, calming down, taking the necessary time and studying the routines, dialogues, movements of the characters, going back to sleep and starting over, immersed in a dreamlike, surreal place, whose evolutions are to be discovered step by step step into what is a quest that mostly sleeps under wraps. Retro taste The Love-de-Lic opera hasn't changed: the 4/3 format remains, the ability to customize your musical accompaniment, dialogues in the form of disconnected syllables and a naturally not too versatile menu. It is also from these small details that Moon demonstrates its resistance to the traditional model: there is no search for style, for interfaces, it does not explain the playful foundations, it is told through gestures and very small interlude scenes, there is no real and downright bad because the good guys and the bad guys are often reversed, in a funny but not awkward way. Even after 23 years, Moon remains an elegant and balanced work, as long as you appreciate the small entrance wall and make your own a search for routine that will then be taken up by many titles: in some ways, Mohe is not a forerunner, a pioneer of ideas who from a distant niche humbly suggests ideas and advice to the market, remaining ironic and light on the surface but sinking, hour after hour, more and more his grip on the player. How many times have you spent hours exterminating hundreds if not thousands of enemies? Have you ever wondered the meaning or why they were there? Albeit with shrewd delicacy, Nishi breaks away from his ~trivial~ legacy made up of common and well-established gameplay locations to accompany the player in an uncharted territory that is difficult to understand initially, in which to save the enemies killed by the so-called hero clearly inspired by Enix and solve the problems of surreal characters with style and personality. A product certainly not perfect, but unique.", "date": "2020-09-04", "grade": "8.0"}