{"name": "Mighty DOOM", "ref": "https://multiplayer.it/recensioni/mighty-doom-recensione.html", "text": "Large Intellectual Property Effectively Translated to Mobile: How Many Times Has This Really Happened? Gaming on iOS and Android is undoubtedly a hotbed of ideas and experimentation, but at the same time it is the victim of trends that cyclically end up monopolizing spaces and genres, as well as of course a consolidated and inevitable recourse to free-to models -play sometimes permissive and sensible, sometimes not. Mighty DOOM, the curious spin-off of the great classic by id Software, in the end is also a victim of fashions since it is part of the trend that has been going for some time the largest on the App Store and Google Play, that of the single stick shooter: basically top-down shooters that develop vertically, a single virtual stick for the movement of the character and an automatic fire system towards the closest enemy . Available for a few days and already at the top of the free app charts, has the Mini Slayer adventure achieved its goal? We reveal it to you in the Mighty DOOM review. Gameplay: run & gun from above Mighty DOOM, our Mini Slayer grappling with an enemy We often talk about the run & gun approach (run and shoot) when referring to DOOM, given the extreme dynamism of the gameplay that has always characterized the series, with particular reference to the last two chapters. Well, in order to somehow translate that type of experience so frenetic and visceral on mobile, the developers of Alpha Dog Games have opted for dynamics that become almost those of a bullet hell in the second half of the campaign, thus forcing us never to stay stand still while we continue to attack. This is the biggest difference (the mischievous will say the only one) with the recent Tomb Raider Reloaded, which exactly like Mighty DOOM marks the return on iOS and Android of an iconic video game character to catapult him inside of arenas gradually more insidious and full of enemies to face. Here, while in Lara Croft's cartoonish adventure the automatic fire is activated when we stop, giving the experience a precise strategic depth as time and space must be managed well, the Mini Slayer continues to shoot even while moving and this allows you to make the levels even more crowded and chaotic. The other elements that regulate the gameplay are all inspired by DOOM, the real one: the arsenal can be modified at will on the basis of the weapons unlocked up to that moment including rifles, machine guns, shotguns and so on, while in the secondary slot you will find placed a special tool of great power, for example a rocket launcher, which requires a few seconds to reload and must be used when we deem it appropriate. However, by carrying out the kills, a third weapon also becomes available, which can be a ray or a chainsaw, and which for a few moments allows you to inflict considerable damage even on the biggest and toughest opponents. The stunning of enemies, which obviously come from the series id Software and offer a great variety of patterns and situations, also allows Mighty DOOM to perform very painful eliminations that are activated simply by touching the victims and also serve to restore our vital energy, which must be sufficient to get to the bottom of the forty levels that make up the chapters of the campaign, with fanciful boss fights interspersing this progression every ten rooms. Structure: between upgrades and microtransactions Mighty DOOM, the equipment screen with the various unlocked items To mark the levels of Mighy DOOM we find solutions practically identical to those we described in the review of Tomb Raider Reloaded, with upgrades to be chosen from time to time, as we grind experience points, and which can equip the protagonist with amplified power, increase its maximum health, add double, lateral or explosive fire, and so on in the context of a roguelike-style progression, which develops in the single game and which also contributes to characters who offer us bonuses along the way. Complete the chapters and obtaining points translates into obtaining resources and credits useful for feeding the free-to-play component of Mighty DOOM, which takes the form of a ticket system (which, however, has never really limited us), as well as of chests to open to receive weapons and components with which to improve or customize the Mini Slayer. All elements with which we will have to deal in particular in the second half of the campaign, when the challenges become different and harsher, the damage suffered appears more and more significant each time and the challenge becomes really interesting, but irreparably subject to grinding. Mighty DOOM, glthe scenarios gradually acquire new elements such as walls and portals We can obviously talk about paywalls: microtransactions arrive after a long time, but they do arrive; and at that point, as always in free-to-play, you are faced with the choice of investing a little money to purchase packages that can accelerate progression or replay the already completed chapters, try your hand at special events which also abound and change cyclically, or still wait for the various timed bonuses to obtain the resources necessary for the upgrades that will allow us to survive. Well, in the initial stages we had the feeling that Mighty DOOM was even too simple, and that getting to the end of the nine levels that make up the campaign could prove to be a feat of a few attempts, but then precisely this increase in difficulty occurs and the situation changes, as was predictable. Let's be clear, it is possible to experience all that the game has to offer even without putting a hand on your wallet: you just need to be patient. And maybe resort to microtransactions for the right reason, that is to reward the excellent and not easy work done by Alpha Dog Games with such an important intellectual property. Technical realization: cartoon DOOM Mighty DOOM, one of the game's gory finishers It was not easy to imagine a cartoon-style reduction of the id Software series, given the inevitable presence of an abundant amount of blood and violence, but even on this front the developers managed to find the right compromise. The Mini Slayer, basically a DOOM collectible that comes to life, moves in a convincing way and at the end of the boss fights performs executions that try to represent in a funny and entertaining way the dismemberments that fans of the saga are well used to. final result is not always brilliant and perhaps some animations would have deserved an extra effort, but in principle we are faced with a surprising adaptation, of undoubted quality, with a great abundance of opponents (precisely those of DOOM) and arenas that somehow they refer to the scenarios of the original game, even with all the limitations of the top view. Mighty DOOM, the first boss fight The graphic adjustments allow you to reward quality or performance, so even on older terminals you should be able to run the game smoothly. Similarly, from the options screen it is possible to change the position of the buttons for activating the extra weapons, placing them on the left or right side of the display depending on whether you are using your left or right thumb to operate the virtual analog stick that occupies the lower area of the touch screen. Finally the music: an element of great importance in DOOM, and which here too is enhanced by the presence of a rather engaging metal soundtrack, capable of adding rhythm and cue to the action sequences that follow one another on the screen , also enhanced by good effects and a narrator with three testicles announcing the most relevant events.", "date": "2023-03-26", "grade": "8.0"}