{"name": "Kingdom of Heroes: Tactics War", "ref": "https://multiplayer.it/recensioni/kingdom-of-heroes-tactics-war-la-recensione.html", "text": "If you're looking for something original, leave this Kingdom of Heroes: Tactics War review alone, because Neowiz's mobile RPG with gacha elements looks standard and generic just like its own title, although this doesn't necessarily have a negative connotation . Given the belonging to a specific genre and strongly regulated by a granite structure, the lack of innovative ideas would not even be totally condemned, the problem is that we have now seen so many similar games that we cannot really understand how another of these, which brings absolutely nothing new to the table of the mobile market, may manage to attract that much attention. Unless, obviously, you are a fan of this type of game, then Kingdom of Heroes: Tactics War can be a title of some interest, if only for its quality level in terms of technical realization and general packaging . The story would like to take elements from the Breton cycle, throwing into the track none other than a young King Arthur and the Knights of the Round Table, but everything is reinterpreted in an original story that sees the balance of the world broken due to the breaking of a crystal that has brought about the entry of evil forces into the world of Avalon. In short, we are on the standard levels of narration in this genre of games, with a simple and linear story told through dialogues characterized by a certain general banality, without doing great justice to the important sources of inspiration. However, the single player campaign is only a part of the various activities in which Kingdom of Heroes: Tactics War unfolds, proposing the classic home page characterized by numerous icons that refer to various game possibilities, including progressive story quests, missions based on timed initiatives, character and base management, and the PvP components. All precisely in the place we expect knowing this genre of games, demonstrating how Neowiz with this title has simply proposed another alternative among the many available. There is also to consider that the game has been available on the market for more than a year now and has only recently arrived in complete form, but it is clear how it was built from the beginning to fit perfectly into the established canon. King Arthur in search of knights As befits an RPG with gacha dynamics, everything is set on the search for new characters and from this point of view a good characterization of the fighters also emerges, moreover designed with a convincing character design and also equipped with animations in the dialogue phases. Throughout the story we find ourselves finding and unlocking new companions to add to the party, as rewards for completed missions or obviously through the classic summoning mechanics which is implemented with the expense of various in-game currencies. We note a great care in the design of the characters but also the typical hypersexualization tendency that emerges often and willingly in this kind of games: alongside fighters in powerful armor we find a large number of graceful damsels more or less undressed and decidedly provocative, moving all towards that ~collection of waifu~ which is another extremely standardized element in this genre of games. Perhaps the only feature that stands out as original in Kingdom of Heroes: Tactics War is the combat system, which in fact manages to give some particular imprint to the whole gaming experience, and it's no small matter. There is a certain insistence on the strategic elements, given by the fact that the fighters move on a grid made up of hexagons as in a sort of chessboard: this too is not a new solution but rather well implemented in this case, also because many skills character specials are highly dependent on battlefield location. This determines not only the attention to the disposition of the party components according to the fighting style (the ranged arranged further away and the melee attackers on the front line) but also the need to move in order to get the most out of the special shots ( for example by lining up enemies to hit them with linear attacks, or using gatherings for zone spells). It is just a strategic smattering given to a system that is not too deep, which moreover can be easily mortified with the use of auto-battle and the speeding up of the clashes, but in the most demanding battles a certain tactical depth emerges which makes them stimulating. Even the management of the characters, another great pillar in this type of game, is based on strengthlies on the fee imposed but has some peculiar characteristics that also make it quite convincing. In particular, the rune system allows you to change the characteristics of the fighters in a substantial and rather free way, choosing which ones to apply in the set of six stones to be assigned to each character. Each rune determines skills and precise statistics that can be combined at will, resulting in a large number of solutions between increasing base statistics or passive and active bonuses. Runes can also be leveled up through systems similar to those used to increase the power of characters, i.e. by spending in-game currency or duplicates. In general, there is a certain push towards micro-transactions to be highly competitive, given the very low rate for the rarest summons and the great difference between the most difficult characters to obtain compared to the common ones.", "date": "2020-08-27", "grade": "6.7"}