{"name": "The Alto Collection: la recensione", "ref": "https://multiplayer.it/recensioni/the-alto-collection-recensione.html", "text": "The Alto Collection review allows us to address the interesting topic of the differences between two fascinating and peculiar platforms such as PC and mobile, and how it can be complicated to bring games from one side to the other while preserving their prerogatives. In fact, it may happen that the strengths of a portable production turn into limits where it is translated into a fixed context, and vice versa. At the debut among the free games of the Epic Games Store, downloadable at no cost until August 20, The Alto Collection includes in a single solution the two games of the series developed by Team Alto, namely Alto's Adventure and Alto's Odyssey: real sensory experiences, which on iOS and Android use an extremely simple and immediate touch control system to allow us to control the jumps of a character engaged in a frantic descent from the mountain. Gameplay If you are familiar with the endless runner genre, you already know what to expect from The Alto Collection gameplay. Our goal in both titles in the collection, net of the different setting (snowy on one side, sandy on the other), is in fact to resist as long as possible and always push ourselves beyond our previous records with each attempt , starting the descent all over again with each fall but finding ourselves faced with always different situations, generated randomly while taking care to avoid the typical distortions of procedural systems. However, this is not a practice for its own sake: a multifaceted list of achievements regulates our progression, setting us missions to complete during each game and thus allowing us to level up and unlock new characters, each with different skills and characteristics: faster jumps, higher speed or acceleration, the ability to perform double jumps and so on. These are elements capable of substantially changing our approach to the game, based almost exclusively on timing. The interaction takes place in fact by pressing a single button, that of the jump: by pressing it near a ledge (but not at the end: a mechanism that can annoy at first, giving rise to undeserved game overs) we will be able to gain altitude and overcome so chasms or other obstacles. By tapping the button quickly we will also be able to overcome rocks and other small pitfalls, while by keeping it pressed in the air we will be able to rotate to perform a single type of acrobatic maneuver, the backflip, making sure to land straight and thus gaining an extra cue that allows, among other things, to destroy at least one barrier along the way. From mobile to PC Observing the simple gameplay mechanics of The Alto Collection in a detached way is the most wrong thing you can do. Both games in the series have been created to act as real sensory experiences, as demonstrated by the presence of a virtually infinite Zen mode with no game over. On mobile, this feature is predominant over all the rest, involving us in this wonderful race through obstacles as the scenery changes dynamically, showing the landscape transitioning from day to night, from clear to rainy, while a highly inspired piece of music and excellent sound effects literally envelop us. This type of setting has obviously not been lost on PC, but the new, inevitably less intimate dimension ends up highlighting the limits of the game rather than its undoubted artistic vocation, the result of collaboration with the English illustrator Harry Nesbitt. In short, the end result is a visually stylish and inspired product, which showcases a series of suggestive settings and a great atmosphere but fails to exploit these excellent assumptions as they deserve due to a gameplay that is too basic and essential, which quickly becomes repetitive. Technical realization The conversion of Alto's Adventure and Alto's Odyssey for PC was made in line with the prerogatives of the two titles, therefore in a minimalist way. From the start screen it is possible to select one or the other episode, but the options practically end here: you can do very little besides adjusting the volume of the music and effects, and the graphic settings are completely automatic, therefore without the possibility to change resolution or quality. The lightness guaranteed by the low poly graphics of the two games however allows you not to worry about such things and enjoy the descent without thoughts, appreciating the many touches of class placed along the way regardless of the random shuffling of the obstacles at each game: elevaluable minds, which give a clear idea of the attention paid to the design of both experiences.", "date": "2020-08-19", "grade": "7.5"}