{"name": "Microsoft Flight Simulator", "ref": "https://multiplayer.it/recensioni/microsoft-flight-simulator-recensione.html", "text": "Just three weeks ago, the Redmond giant had allowed us to get our hands on the new incarnation of its famous civil flight simulator for the first time, this time created in collaboration with the guys from Asobo Studio, the development team to which we owe , among others, A Plague Tale: Innocence. Already on that occasion, thanks to an extremely advanced, stable and complete Alpha code, we had practically launched into a series of considerations on the game within the trial which, we imagined, would have haunted us even during the final judgment. And practically confirming ourselves, we are now ready to go into detail about our evaluation of the game through this review of Microsoft Flight Simulator which can be considered a natural extension of the hands-on reported a few lines above. Just as you are reading these lines, the game is available on PC in a physical edition through some specialized retailers and on the 2 digital platforms Steam and Microsoft Store in 3 different versions: a standard, a deluxe and a premium. Starting from 60, each version costs 30 more than the previous one and differs only in the number of hand-drawn airports and aircraft included in the package and, therefore, usable by the end user. Compared to the previously tested preview code, we therefore did not notice any particular differences or novelties, with the exception of a crucial element that had been confirmed to us at the time by the publisher: Microsoft Flight Simulator is in fact entirely translated into Italian in the texts while communications with the controllers of flight, exactly as in reality, remain in English. The game is also included in the PC Game Pass and clearly in the Ultimate version of the same, but in its standard edition. As for the Xbox One conversion, at the moment there is no precise information on its release, but we doubt that it will arrive before next year. And now let yourself be carried away by the lines of this review where we will try to explain to you why we feel so confident in declaring that Microsoft Flight Simulator represents in all respects the definitive flight simulator, but in earning this position it leaves out a whole series of contents that we would have hoped for to see and play. The contents But before going into the details it is necessary to make a summary of what's inside Microsoft Flight Simulator, partially tracing what has already been written previously. The standard version of the game offers 20 aircraft (about a dozen propeller aircraft, 3 turboprops, a couple of jet jets and 2 airliners, the Boeing 747 and the Airbus A320 Neo) and 30 airports, to switch to 25 aircraft and 35 airports in the deluxe edition and finally 30 airplanes and 40 runways in the special Premium package. If it is true that at the moment there are no other ways to get your hands on the planes, outside of those included in the basic package - but we are sure that within a few weeks, thanks to the support for third-party developers already completed and an extremely prolific ecosystem, paid mods and new additions will start arriving - as for airports, the number above refers exclusively to those hand-drawn by the developer since the game, by default, includes all the existing runways in the world . We are talking about about 37,000 airports including commercial and private airports, airfields and even military runways not covered by secrecy. Apart from those created manually by Asobo Studio, all the others are reconstructed through satellite photos and algorithms developed by the software house and managed through the computing power of Azure. Clearly there is an important difference in quality, precision and realism between the two reconstruction methods, and the same can also be said for cities, but there is no doubt that having a flight simulator which, by default, contains all the runways of the globe completely usable and visitable, has its effect. What has been said is true, practically without alterations, also for cities: Microsoft Flight Simulator includes all known urban and rural gatherings, reconstructed through the usual combination of satellite surveys and algorithms applied by Azure to pass from two-dimensional photos to a 3D modeling created completely by 'artificial intelligence. In addition, about 400 cities have been included in the title using photogrammetry data which allows a 100% faithful reconstruction of the urban environment including verticality and precision geometry of each single building. Also in this case the differences are abysmal andflying over Paris and New York, clearly in low flight but also at high altitudes, has a completely different effect compared to passing over Palermo or Naples which are instead made with the necessary automatisms. Let it be clear that there are a whole series of imperfections that we have noticed during our wanderings and that seem to afflict above all the coastal cities and, clearly, the more remote or less frequented areas by satellite tracking: in fact, in various cases, low resolution areas can be seen in which the phenomenon of the ~crushing~ of buildings and bumps is very visible, just as we have noticed various points of contact between extremely imprecise and ~mixed~ watercourses, roads and urbanization or, again, hills and mountains that take on unrealistic pyramid. However, these are microscopic defects in the face of a simply frightening amount of content. In fact, Microsoft Flight Simulator, in its 2 petabytes (2000 terabytes) of data available in the cloud, contains everything that the Earth offers in reality: 23 deserts, 4 billion hectares of forests, 1 million mountains, 356,000 km of coastline, 117 millions of lakes, tens of thousands of rivers, 30 million km of roads. Even the simulation of artificial lights and their color temperature is realistic to the point of bringing credible light pollution to the screen and which goes perfectly with weather management and with the ability to fly visually at night, using lampposts and buildings but also that orange halo that is perceived in the distance in the presence of a large urban gathering. The simulation Also on the simulation front, the new work by Asobo Studio and Microsoft amazes with mastery and great competence. Thanks to an engine borrowed from the previous works of the French development team but completely adapted to new needs to the point of being practically rewritten from scratch, Microsoft Flight Simulator succeeds in the extremely difficult feat of being extremely realistic but, at the same time, completely accessible. Basically, in fact, we find ourselves in the presence of a pure, uncompromising simulator, which wisely inherits the key elements of the series, placing itself exactly in the middle of the border between a professional simulation, created to train and teach aspiring pilots, and a playful one, built for the sole purpose of entertaining the players. As we will write a little further on, this Microsoft Flight Simulator is more unbalanced towards the first definition, that of a simulator without playful frills especially as regards the contents relating to the player's progression, but in bringing its realism to the screen, it always does so with a great attention to the neophyte and the inexperienced. In fact, if the game amazes for its ability to perfectly recreate all the forces involved during flight, also reproducing the activities and solicitations of the aircraft with peaks of excellence relating to aircraft cockpits with most of the buttons and levers working and usable, it further manages to amaze for the presence of a whole series of assistances and massive support for every form of control and command so as to be immediately usable even by those who, perhaps, have never seen a flight simulator in action. Mouse and keyboard, Xbox One controller, hardware peripherals specifically designed to simulate joysticks, throttles and pedals, everything is immediately usable and fully configurable in Microsoft Flight Simulator by accessing a detailed control panel crammed with hundreds of commands that can be assigned to any controllers. Clearly our advice is to have at least a stick and throttle (or a HOTAS) to enjoy the realism simulated by the game to the fullest, but those who want to take a first look at the flight offer can easily do so with the combined Xbox One joypad perhaps to the Game Pass subscription, so as not to have to take on an initial expense that is certainly substantial between the game and peripherals. In addition, the title implements a very capillary assistance system which is based on three presets (full, intermediate and total simulation assistance) which can then be broken down into a whole series of manual options so as to intercept both the player who wants to limit himself to tacking and nose up the aircraft without worrying about all the rest of the aircraft management, both for the more experienced user who perhaps wants to relegate to artificial intelligence only some more advanced aspects such as communications with the control tower. Among other things, the possibility of ~handing over~ the entire control of the vehicle to the computer is very useful, perhaps in more complex situations, such as during a wait.beam in adverse weather conditions, so as to see how it behaves and understand what are the correct procedures to then apply in subsequent manual attempts. Returning for a moment to the simulation question, it is essential to underline once again how much Microsoft Flight Simulator really is the new benchmark of the genre. And it's not just a question of credibly simulated physical forces, but of a whole series of trappings which, on the will of the developer, need and deserve equal attention to ensure that what is shown on the screen is realistic and attractive. The entire day-night cycle is present and also takes into account the sunrise and sunset values according to the months and the parallel of flight and also on the weather front new peaks of excellence are reached. All types of clouds are simulated, as well as winds, rain and snow and all these elements can be completely configured according to the player's needs and wishes, for example by altering the altitudes of the cloud layers, the concentration of aerosols, atmospheric pressure, but also by acting on the accumulation of snowflakes or on the frequency and power of gusts of wind. Whatever you can think of is simulated and configurable in the game. As if this weren't enough, Microsoft Flight Simulator is constantly synchronized with some weather managers, with central servers dedicated to measuring time and with databases that keep track of flights in the air: the result is that setting the game to full data synchronization , we will be able to see and play in a world practically identical to the one we live in with the real weather, the time synchronized with the place we are flying over and surrounded by real planes, those that are flying in all areas of the world at that moment known alongside those of other players who have chosen to play connected online. Career and progression And after this long series of praise and exaggerated praise, the time has come to start talking about the few, but substantial, defects of Microsoft Flight Simulator. To do this, we have to go back to the subject of content, only this time we will have to focus on the ~most playable~ part of the package. In fact, the progression experience of the title includes some tutorials, a handful of special activities and free flight. There is no career whatsoever, much less patents or qualifications relating to individual aircraft. Let's say, more generally, that if you are not interested in setting and flying your favorite flight routes as the sole purpose of the game, the new work by Asobo and Microsoft will hardly be able to entertain you for a long time. As for the tutorial, these are 8 short lessons that will teach you the rudiments of flying and are therefore aimed at those who have never really picked up a simulator. If this is not your experience with a Flight Simulator, you are unlikely to discover anything new by completing this training. The special activities are divided into 2: special landings and naturalistic excursions. Let's start with the first ones: as the name suggests, it is simply a question of carrying out a whole series of landings divided into 3 categories: famous, epic and in adverse flight conditions. Each category includes 8 different landings that must be made with a specific aircraft and with the pre-set approach route. We will only have to enjoy the view and try to understand, without any kind of instruction or guide, how to approach that airport and, at the same time, how to manage the plane that is given to us. At the end of the touchdown we will receive a score that will place us in a world ranking and will be determined by three variables: how precise we were in touching the ground where indicated, how central we were on the track and how strongly we had the first impact. The naturalistic excursions, on the other hand, are three very long journeys, between 7 and 9 hours, in three truly fascinating territories: Patagonia, Nevada and the Balkans. The peculiarity of these excursions is that they are divided into stages of 20-40 minutes each including a take-off, a transfer and a landing, and can be carried out at different times, not necessarily all in a row. The game memorizes where we have arrived and allows us to start again from the last uncompleted stage. And that was all: no missions, total absence of a career (the game limits itself to keeping track of flight hours and a whole series of very in-depth statistics, together with about thirty achievements which represent the most classic of objectives), progression practically reduced to the bone and, above all, chronic lack of indications and guides that help to understand", "date": "2020-08-18", "grade": "9.0"}