{"name": "Fast & Furious Crossroads", "ref": "https://multiplayer.it/recensioni/fast-furious-crossroads-recensione.html", "text": "The review of Fast & Furious Crossroads should have taken place under different circumstances, with the tie-in developed by Slightly Mad Studios supported by the media release of the new chapter in the series, Fast & Furious 9. However, the film was postponed to 2021 for the reasons that we all know and the game found itself having to bear the weight of its many shortcomings on its own. In fact, it has been since the presentation of the title, which took place during the Game Awards 2019 with the participation of Vin Diesel and Michelle Rodriguez, that we had enormous doubts about the success of this operation. Sure, the team entrusted with the project has talent to spare and has demonstrated it in recent years with the Project CARS series, but apparently only a small part of the study has been assigned to the creation of Crossroads. Judging by the end result, not the most capable. History Let's see the glass half full: if you are a fan of the film saga, the story behind Fast & Furious Crossroads probably won't disappoint you. In fact, in the prologue we see Dom and Letty engaged in the pursuit of a dangerous criminal on behalf of Interpol, and once caught the man reveals that he is part of a criminal organization called Tadakhul. At this point two new protagonists are introduced, Vienna and Cam, owners of a garage in Barcelona and anything but new to the world of clandestine racing: a race that ended badly is the reason why they left Miami to try to start a new life in Spain. However, things immediately take a dangerous turn: the boy from Vienna has become involved in some illegal activities and the Tadakhuls demand a large sum of money from him. There is no point in trying the speed racing card to recover the money from the debt, and so the three take the short-sighted decision to try to rob the organization itself to get the money they need. The outcome of the clumsy attempt is dramatic, but Vienna and Cam can count on the help of Dom and Letty (as well as Roman) to take revenge on the Tadakhul and their boss, whose aims will prove to be far more ambitious than managing the Spanish underworld . Strictly behind the wheel of very fast racing cars equipped with electronic gadgets of various kinds, our task during the Fast & Furious Crossroads campaign will therefore be to explore different locations scattered around the world, discover the plans of the criminal organization and foil them, neutralizing the threat posed by the boss played by Peter Stormare. Which leads us to talk about the cast of actors who appear in the game between motion capture and English dialogue. In addition to the various Vin Diesel, Michelle Rodriguez and Tyrese Gibson, we see the introduction of Sonequa Martin-Green and Asia Kate Dillon, respectively in the role of Vienna and Cam: two characters discreetly rendered on the screen, but rather stereotyped. Which, in fact, shouldn't be a problem for Fast & Furious lovers. Ultimately, the plot has its why, when viewed from the point of view of the source material, and in the final part there are some sequences of great impact, involving for example the largest excavator ever seen or a real missile that we will have the task of chasing. However, one of the problems of the game lies in the duration of the campaign, which does not go beyond four hours despite the questionable choice to offer it at full price. Gameplay Staying on the subject of problems, another major limitation of Fast & Furious Crossroads lies in the gameplay, which on paper boasts some interesting ideas but in practice proves to be approximate, confusing and conceptually dated. The feeling is that the developers have tried and mixed together the classic Driver and any episode of Burnout, without however being able to package a convincing product with its own personality. It starts from a stuttering arcade driving model, which does not allow changing the view from the close-up camera at the rear of the vehicle nor does it clarify the weight attributed to the brakes in the economy of drifts, essential for closing corners at high speed without printing against a building. The scenarios are full of destructible elements, it is true, but as usual some of them do not move a millimeter when we hit them: barriers that produce abrupt and frustrating stops in the middle of a chase. The possibility of switching from one character to another during the thirty-two missions is also implemented in a superficial and defeatist way, despite the interesting gimmick of equipping the various Dom, Letty, Roman, Vienna and Cam with different equipment forcounter the Tadakhul men: spikes protruding from the wheels, electromagnetic pulses, harpoons and even homing missiles. The standard combat mechanics are extremely derivative, with the controller's shoulder buttons allowing us to swipe left or right and a bullet time that starts when we eliminate a hostile vehicle or perform a stunt in the middle of the action. Everything appears very botched, also due to a series of glitches and an artificial intelligence that is to say the least lacking: you will not rarely see your companions crashing like chickens in the middle of a mission. The Fast & Furious Crossroads campaign is therefore a mixture of sketchy and poorly implemented concepts, an old school tie-in (in the negative sense of the term) evidently created with the sole purpose of intercepting the numerous fans of the film saga, but alas unable to offer a valuable experience; not least because of the excessive simplicity of the missions, which slip away without leaving anything. However, some important questions remain unanswered: is it possible to make a Fast & Furious game by barely putting two races in it, which are also rendered in insipid and confusing? Probably keeping this characteristic aspect of the brand alive between one mission and another would have helped at least to increase the duration of the game, which as it is is really poor in content to be taken into consideration. The multiplayer mode In addition to the single player campaign, Fast & Furious Crossroads also includes a competitive multiplayer mode for nine players called Online Operations. This is an interesting option, which pits three teams of three against each other in a series of operations, in fact, providing them with different objectives in order to achieve victory. By playing you can unlock new vehicles within different categories, customizations and collectibles of various kinds. The problem is that during our tests we never managed to find eight other users available for a challenge: the servers are empty. Technical realization If the Fast & Furious Crossroads gameplay doesn't shine with solidity and refinement, what about the technical implementation of the game? This aspect was also noticed from the first announcement, and unfortunately over the months the developers have not managed to improve the graphics, which appear particularly dated: it seems to be faced with a game from one or even two generations ago. The open map setting of the scenarios translates into a further penalty in terms of detail and visual richness, the streets are practically deserted and collisions with other vehicles often give rise to very implausible reactions. The New Orleans evening setting is the only one that offers a minimally sensible design, but otherwise there are examples of great confusion even in this aspect of the production. The polygonal models of the characters also highlight the technical paucity of the project, which at least on PC can count on 60 fps, although there is no advanced adjustments and we have to be satisfied with general presets. To think that on PS4 and Xbox One this graphics does not go so far beyond 30 frames per second is frankly inexplicable.", "date": "2020-08-17", "grade": "4.0"}