{"name": "Hyper Scape", "ref": "https://multiplayer.it/recensioni/hyper-scape-recensione.html", "text": "After only a month of beta Hyper Scape, the new first-person battle royale by Ubisoft, finally arrives on PC, Playstation 4 and Xbox one, even if it does not enable cross play during these first running-in phases. Despite a market now overflowing with this kind of game, the French house seems to focus on its new intellectual property, strong in some absolutely new mechanics and technological inventions. We've been playing extensively during the pre-launch phase and have spent the last few hours streaming and shooting on the servers to bring you our review of Hyper Scape today. In case you played the beta anyway, you won't find big changes waiting for you also by virtue of a practically total rollback of the latest weapon patches, which had not found general applause from the many beta testers. The extra modes also disappear in this case, leaving us in our hands a Hyper Scape in its purest essence, thanks to the single mode and three-player teams. So will it be worth trying this new shooter? And above all, will he be able to carve out the time necessary to be enjoyed properly in your days already full of Season Passes and daily missions to complete? We need 50 hour days! The amount of beautiful titles to play is increasing exponentially day by day and the battle royale fashion is so reminiscent of the MOBAs of a few years ago. Although the general pool of users has increased over the years, it is also undeniable that the desire to transform all competitive online games into continuously updated platforms leads users to make choices that often go beyond the overall quality of the games, with Hyper Scape probably he will pay the price of having come out in a window of time that just doesn't want to accept new contenders in the ring. It is the price to pay, in short, for wanting to follow trends rather than impose them, for a project which, regardless of good qualities and innovative ideas, will have a very hard life. In fact, just like all online games, Hyper Scape also presents itself to its community with a Season Pass in a premium and free version, with as many as one hundred levels full of rewards, to be obtained by participating in matches and completing daily and weekly missions. As average players we are now entangled in various titles that offer this approach and the idea of renewing a pass that cannot be completed is now becoming the decisive weight for us to choose which title to dedicate our free time to. Hyper Scape, not offering anything new from this point of view, however finds itself having to snatch users from productions on which players have already spent on average dozens of hours, if not really hard cash, a reason that will most likely push them to don't move. However, Ubisoft must have also made two calculations and aware of this situation it has well thought of betting everything on Twitch, with total integration between the game and the streaming platform par excellence thanks to which streamers and players can interact constantly. By looking at your favorite streamers, you can thus choose which events to start during the match, variables that considerably change the gameplay. For example, some will lower gravity while others will provide supply crates and medkits, all options that you can easily use to help, or hinder, those you're watching play. Compared to the beta, an event has been added that makes melee weapons deadly, ruining the gaming experience a bit and almost nullifying shooting skills given how easy it is to get close range during matches. In Hyper Scape you can in fact collect hacks randomly scattered around the map with which to teleport and make yourself invisible for example, but also heal in an area or obtain offensive skills. These hacks take the place of the usual skills since the characters here have no particularities and are distinguished only by their aesthetic appearance, lines of dialogue and customizable skins. It is interesting in all this to know that Crowncast, the application linked to Twitch precisely, will also reward you with experience points valid for the pass, allowing you to collect two levels a day without even having to open the game; a clever way, if nothing else, to not leave yourself too far behind in case your time to play runs low and give spectators a nice boost at the same time. Personally we really appreciate this gimmick which mitigates the problems expressed at the beginning of the article. The idea of inserting a crown to capture and keep towards the end of the match is also excellentuntil time runs out in pure King of the Hill style, a feature capable of changing the classic battle royale theme based exclusively on killing all the other players. Speed and frenzy Hyper Scape is a fast and frantic game that makes verticality and rapid movements two of its strengths. In many respects and without straying too far from the French house, we found several points in common with Shootmania Storm, from which it takes the gravitational ramps thanks to which you can be catapulted into the air to rain lead on your enemies. Despite playing at a very high pace, however, the time to kill is quite high in the initial stages of the game with unpredictable peaks that lower it to the oneshot in case someone with fully upgraded weapons shoots you. In fact, forget about having to go around the urban map divided into districts, looking for the epic or legendary weapon of the moment to bully your opponents: here all the hacks and guns available all have the same rarity and are scattered in the various buildings substantially without specific criterion. However, surviving longer, as in any self-respecting battle royale, has its advantages, since it will allow you to rummage through every nook and cranny in search of the same type of weapon you prefer, thus being able to fuse them together. The fusion basically works as an extra attachment to your rifle, granting increased magazines, maximizing damage, and improving stability. They are pre-established enhancements depending on the level of fusion, which move away from the free customization seen in other games and harness you in upstream decisions, perhaps easier to balance but certainly unable to leave the same freedom. There is good news on balance, then. The two game modes diversify the meta a lot, making different hacks and different weapons useful while in single the desire to carry around the Harpy and the sniper rifle usually overrides any other need. Having said that, being able to govern a weapon well is not an immediate task and we are sure that the vast majority are useful in certain circumstances. The shotgun paired with aggressive hacks can cause sparks while the gatling gun is essential for giving your team cover in narrow city streets. The city setting and random closure to non-circular sectors will also give you very different strategic approaches to the classic shrinking bubble even if the modeling of the houses and the city environment risks becoming redundant after long play sessions, a factor that can be easily mitigated by changing part of the ecosystem of this futuristic virtual world.", "date": "2020-08-13", "grade": "8.0"}