{"name": "Hellrider 3", "ref": "https://multiplayer.it/recensioni/hellrider-3-la-recensione.html", "text": "Developed by Andrey Chernyshov alone hidden behind the name of Anji Games, this Hellrider 3 whose review you are reading is obviously the third episode of a series which in the first two chapters adopted two-dimensional graphics with a top view and which instead in this case takes the plunge towards 3D, also taking advantage of the opportunity to make numerous changes to the game structure. What we are therefore now facing is an arcade racer with a marked propensity for action, which alternates endless runner phases with more classic sections based on particular competitions or challenges. Let's find out if it's a winning mix or a confusing minestrone... Running without a why It is useless to try to frame the plot of Hellrider 3, given that it is fundamentally non-existent and the few elements that make it up are thrown away a bit at random just to say they did. The user takes on the role of a centaur engaged in motorbike races and chases who must defend himself against the attacks of a gang of skeletons who occasionally peep out to annoy him. Nothing is convincingly explained, characters come and go, and even the English-language lyrics don't always make much sense. Not bad, except that the gameplay elements also undergo the same treatment, being thrown in the player's face without being well pigeonholed in an orderly general picture. The fact that the game itself is very simple and intuitive makes this aspect only a minor defect, but it is difficult not to turn up one's nose in the face of such a confusing context. In any case, Hellrider 3 starts from a gas station from which the protagonist receives missions and can spend the coins earned to get new bikes, weapons, skins or various bonuses. Let's say right away that the microtransaction model is absolutely honest and that you can play for free without fear of running into particular bottlenecks, with the title also supported by advertisements that can be removed through a modest in-app purchase. Having made this premise, since it is a free to play game, we can say that Hellrider 3 convinces more for the diversification of the experience than for the real virtues of its gameplay. From this point of view, in fact, the game does not explore new territories, going to fish for ideas a little here and a little there and putting them together in a mix that all in all works. The control system is very simple, and only requires tapping on the sides of the screen to steer the bike (acceleration is automatic) and occasionally pressing on both sides to wheelie and thus overcome certain obstacles: the enemies instead they can defeat them simply by investing them or by collecting bonus boxes - very similar to those of Mario Kart, to be clear - which provide ammunition for the gun, bombs or turbos thanks to which to take out the opponents. Everything is fairly automated and doesn't require any particular skill, but we'd be lying if we said that playing Hellrider 3 isn't enjoyable. The title then tries as much as possible to mix the cards, alternating sections in endless style with others entirely focused on fights with others that simulate real races. Even if not all the components are always exciting (racing against other motorcyclists in particular leave a little the time they find), Hellrider 3 runs smoothly like oil, also assisted by a technical sector that is pretty enough. The graphics boast a simple but very effective low poly style, with bright colors and a good taste for detail, and even the sound does its part while limiting itself to the homework.", "date": "2020-08-10", "grade": "7.5"}