{"name": "Fall Guys: Ultimate Knockout", "ref": "https://multiplayer.it/recensioni/fall-guys-ultimate-knockout-recensione.html", "text": "Our review of Fall Guys: Ultimate Knockout arrives a couple of days after the launch of the title on the market, on PlayStation 4 (among other things, as a gift to all PS Plus users) and Windows PC: it required calm (a lot calm), patience, and even a few minutes of hysteria. The fact is that the production by Mediatonic (the first focused on online multiplayer) and published by Devolver Digital, is very particular. It inherits the philosophy of some equally particular television programs, above all Takeshi's Castle, and tries to translate it into a video game. It has almost always succeeded, it must be said. Let's try to understand in a much more analytical way, however, how successful this title is, and when it needs to be improved. Equip yourself with gummy candies while reading. Fall Guys: Ultimate Knockout: what it is It is very simple to explain what Fall Guys: Ultimate Knockout is: an online title (completely online) in which 60 ready-for-anything players complete a series of challenges; only one of them will be crowned victorious. These challenges consist of racing along paths littered with obstacles, survival races in the most disparate conditions, and finally small team games. Of the initial 60 players, round after round, some begin to be eliminated. In the end, only one remains, who is declared the winner and will be remembered for posterity. Fall Guys: Ultimate Knockout is classified as a battle royale-style MMO party game. A somewhat long definition, and perhaps it could not be otherwise: its playful offer is as simple as it is complex to establish its nature. It's true that it's a party game: after all, the proposed rounds are just mini-games, and a real single-player adventure doesn't exist. It's also true that it can be defined as an MMO: you create your own character, customize it, and then go into the arena (but no HUB to share with other players, for now). And finally it is undeniable that it is a battle royale: only one player survives until the end, the others are eliminated. It is also true that victory in Fall Guys: Ultimate Knockout is extremely situational. The proposed challenges are random, and not all of them can be won simply by relying on one's skills. The entire production is pandemonium, a riot of colors, a shapeless mass made up of players jumping on other players. Everything is colourful, very amusing to look at: impossible that it won't make you smile more than once. But it's also all very repetitive, and certainly not at all satisfying for those who really want to hone their skills in the individual challenges, which cannot even be tackled offline at will, in a sort of ~training~ mode. Gameplay and game modes We got to introduce the gameplay of Fall Guys: Ultimate Knockout. Each online match consists of a series of rounds, of matches marked by the most varied tasks, by the most absurd situations: there is a path full of turbines, whose blades whirling around and throwing the characters in every direction; there is a climb invaded by gigantic fruit, which catapults those present back to the beginning; there are very slippery paths suspended over nothing, and every fall is fatal. Starting to play in Fall Guys: Ultimate Knockout is very simple: the initial menu is extremely functional. It may seem sparse and poor: it's actually clean and does exactly its job, without frills. But it is obviously the game levels that form the heart of the production: here the soul of Takeshi's Castle, Wipeout and Ninja Warrior is evident everywhere. The three main game modes, the macro-categories, are those of the Race, Survival and team challenges: then each of them takes the form of about five possibilities. For example, all the racing-themed game modes have a path to complete, strewn with various dangers; only a certain number of players, the first to arrive, pass the match. Dizzy Heights sees players jumping from rotating platform to rotating platform: only the latter try to throw them badly into the void, luckily there is a respawn. Door Dash, however intuitive and although it does not require any specific skill other than luck, is very funny: within a few meters there are doors that are all the same, but only some open. And so it's easy to see gummies (i.e. players) crashing false openings. When a door finally gives way, the whole stream of 60 participants diverts in that direction, and it is a blaze of colors and jumps and jostles. Total confusion reigns. Confusion that sometimes amuses, sometimes makes everything a little frustrating, it must be said. Slime Climb is an uphill path littered with slippery jelly and various obstacles; it is usually one of the last proposed in the game, because it allows you to quickly eliminate many participants. In our opinion, the survival challenges are the least successful: not because they are not fun, but because they are less interesting than the other game modes. And they're really situational: what's the point in a game where any other player can throw us off balance and send us into the void, even if we've been paying damn attention up to that point? Instead we found the team challenges a lot of fun. For example, in Fall Ball you have to score goals in the enemy's net, inside a huge soccer field occupied by equally gigantic balls. All players are tiny, and they have to work together to move those huge balls. Here too: fun guaranteed, but are we sure that skill is really needed, and not simply pure luck on one's side? Playstation 4 trophies Fall Guys: Ultimate Knockout will represent one of the most complex, difficult and frustrating Platinum Trophies to obtain in the years to come. If only for one gold trophy, ~Infallible~, which requires you to win five games in a row. Winning five games in a row is impossible. Simply impossible. We challenge you to prove otherwise: if you succeed, we will dedicate an entire article to it. Technical and graphic sector If from a purely playful point of view Fall Guys: Ultimate Knockout fully convinces (as long as you are not looking for a title really based on specific skills), from the technical and graphic one it discovers the side. Fluidity is not a problem at all, in fact it has never jammed; there have only been some connection problems (even in the last few hours) due to the game servers overwhelmed by the enthusiasm of more than a million participants. But the levels, albeit colored, are bare, poor in details, only partially destructible; and visually speaking, although it always satisfies the general glance, it certainly cannot be said that Fall Guys: Ultimate Knockout has who knows what graphics or level of detail. It is simply the art direction that is suitable for the production. Even the audio tracks are always the same, even quite repetitive: after a while it comes to mind that perhaps all those verses from the gummy jellies aren't that important after all; that the music that accompanies the entry into the game is not so necessary; that the background of the current round might disappear after all. Instead, let's break a spear in favor of personalization. Fall Guys: Ultimate Knockout features a sort of free Seasonal Battle Pass, which can be completed without purchasing anything, simply by playing and leveling up. And some of the proposed skins, like the pigeon and the hot dog, aren't bad at all.", "date": "2020-08-06", "grade": "8.0"}