{"name": "Horizon Zero Dawn", "ref": "https://multiplayer.it/recensioni/horizon-zero-dawn-recensione-pc.html", "text": "We thought there would never be a review of Horizon Zero Dawn for PC, yet here we are writing it, after trying the Steam version of the famous PS4 exclusive by Guerrilla Games for a few days, available with the Complete Edition which also includes the expansion The Frozen Wilds.Is this the beginning of a new era for Sony first party productions? Probably yes, if we consider the importance of such a step, even more relevant than the debut of Death Stranding and the adventures of Quantic Dream on the Windows platform, precisely because it comes from a studio owned by the Japanese company. Of course, there are those who have speculated that this operation is nothing more than a sort of ~bait~ to show a completely new audience how valid PlayStation exclusives are and try to lure them into that world, while the launch of PS5 is always closer and Horizon Forbidden West has already been officially announced. Something like ~did you like this first episode? Well, the second one you'll only be able to play on our new console.~ Whatever the truth behind Horizon Zero Dawn coming to PC, it doesn't detract from the genuine emotion of being able to dress ( again, in our case) as Aloy and immerse yourself in the wonderful post-apocalyptic scenario that forms the backdrop to her story, with the possibility, however, of enjoying a higher visual quality and frame rate than what was seen on PlayStation 4. Are you ready for a new hunting trip? History Hundreds of years have passed since a mysterious catastrophe that wiped out the world as we know it and the human race has started anew, gathering in tribes often in conflict with each other and worshiping disturbing deities while in the woods, the snowy expanses and the desert lands that characterize the new landscapes move in herds of fearsome Machines: robotic beasts that over time have developed an increasingly violent nature, in many cases representing a serious threat to people's survival. Aloy is a child of her time, outcast from the Nora tribe since birth and raised by the expert hunter Rost to become an unbeatable warrior, pass the exam to obtain the title of Bold and discover the truth about her past and the mysterious electronic device which she found in some ruins at a young age, the Focus: a device that allows the girl to analyze the environment and its possible pitfalls, as well as interact with ancient machinery, symbols of a forgotten era. Aloy's path of revenge ends abruptly just when luck finally seemed to turn on her side: a group of masked soldiers attacks the young Audacious of the Nora tribe, killing most of them, but the protagonist manages to get several boys to find shelter, despite having to pay a high price. Received the title of Seeker by the priestesses, she leaves to discover the instigators of the massacre. Her journey, however, will have a much deeper meaning: finally in contact with the outside world, grappling with increasingly large and dangerous machines but also with warriors brave men who will help her in the mission, Aloy will understand that the attack was not ordered because of a simple rivalry between factions, and that at stake is the truth about what happened to the previous world but also the future of the current world . Gameplay The gameplay of Horizon Zero Dawn is based on action RPG mechanics that emphasize the exploration of the scenarios, the interaction with the NPCs for the possible assignment of secondary tasks and, of course, the fights with the Machines. Aloy has a fairly rich arsenal, based mainly on bows, and can enhance it by purchasing new and more effective tools from the traders of the various tribes, or by using the modifications collected from the mechanical beasts killed. There is a hunting bow capable of shooting even incendiary arrows, a precision bow with different types of ammunition, a war bow focused on elemental attacks, a trap launcher that fixes electric or explosive cables to the ground, a rope launcher that is used to immobilize enemies and even a slingshot with which to launch wide-ranging projectiles range, useful for creating diversions or openings during a particularly frenetic and demanding battle. Quickly switching from one tool to another is certainly exciting, all the more so given that the degree of challenge is well balanced and sufficiently demanding even at the intermediate level of the four available. There are also stealth mechanics that increase the options available to us and possibly allow us to eliminate the prey yesslowly, moving in the tall grass so as not to be seen and attracting enemies with a whistle or by throwing a stone nearby. The artificial intelligence created by Guerrilla Games is adequate when facing the Machines, which being in fact beasts they pay no particular attention to strategy and charge headlong; regardless of the class they belong to, and there are many of them: from simple Lookouts to Scavengers, from Secodonts to enormous Thundereaters, passing through winged or rideable beasts. Of course, when the enemies are hunters belonging to enemy tribes, things get less brilliant and the lack of more sophisticated behavioral routines stands out. The fact of not being able to count on real firearms, apart from when you pick them up from an eliminated opponent, significantly increases the depth of the clashes, which are based on shooting accuracy and timing, as well as on our ability to avoid the furious attacks of the Machines. The ability to concentrate and activate a short bullet time therefore becomes essential, as well as the use of Focus, which can highlight the weak points of the enemies and allow us to hit them to ~dismantle~ the various parts more effectively from the perspective of the looting. In this regard, by collecting the mechanisms but also the branches, healing plants and other resources it is possible to use a simple crafting system to manufacture the various ammunition, while by accessing the options screen it is possible to create other objects and modifications, for example more capacious bags or the useful kits for fast movement, which can only be done between two bonfires (save points) that we have already unlocked. This ~consumption~ setting favors traditional exploration of the map rather than the abuse of fast travel, and it certainly has its own reason: the panoramas that we will see during the Horizon Zero Dawn campaign are splendid and extremely varied, enriched also from a dynamic weather and a day / night cycle that create new and fascinating color combinations, such as when you move during the sunset, for example. Less brilliant are the cities and settlements, which end up similar and have a rather generic appearance. The emphasis that the game places on the sense of discovery is similar to what we find in titles such as Assassin's Creed Odyssey or The Witcher 3: Wild Hunt, and it can be satisfied by proceeding on foot or perhaps after having carried out the Override of a ride-on Machine, by climbing on its back to proceed more quickly among the many plains and mountains that characterize the setting. It is convenient to be able to summon the tamed beast with a whistle, but when riding the controls often require our intervention to keep the cruising speed high, which is a bit annoying. In this regard, in the context of the gameplay, there are also some less effective solutions as regards the platform phases, which are forgotten in the central part of the campaign and then recalled towards the end and do not benefit particularly from the presence of the jump, which on the contrary makes the sequences in which our character automatically moves from one platform to another more confusing and does not fail to give rise to situations in which one gets stuck between some rocks: we sincerely hope that in Horizon Forbidden West this maneuver will be eliminated in favor of a more precise approach. Then there are the dialogues, which represent a very interesting way to find out everything there is to know about the setting of the game and its background, the organization of the tribes and their historical rivalries, but as mentioned also to activate the secondary quests and thus add a pinch of variety to the experience. In some cases we will be able to make choices based on intelligence, resentment or compassion, which change the outcome of a verbal exchange but do not produce different endings, beyond slight differences in the final part of the campaign. Features of the PC version As expected, the PC version of Horizon Zero Dawn boasts a number of features that make the already sumptuous visual sector of the game even richer, more detailed and more interesting. In addition to support for the controller, whether it's the one for Xbox One or the DualShock 4 (we tested them both and they behave perfectly), the Guerrilla Games title, converted in this case by the Virtuos guys, includes advanced options which make it scalable on different configurations, although there are some small uncertainties in the rendering (and some crashes) which we imagine will be fixed starting from the day one patch. In the official notes, the authors said they had improved the rendering of the environments and of the objects as wellthe lighting system and the interaction with the foliage. These are changes that are easy to perceive by making a direct comparison with the PlayStation 4 version, which are adequately signaled among the adjustments and which actually make the experience even more beautiful to behold. In addition to being able to change the resolution up to 2160p and activate v-sync (necessary, otherwise the tearing is clearly visible), the PC version of Horizon Zero Dawn allows you to adjust the field of view and act on the frame rate in two different ways, namely by unlocking full frames per second either locking down to a value of 120 fps, or using an adaptive setting with a fixed target that is maintained by dynamically changing resolution depending on the load on the GPU. It goes without saying that this is the best, most comfortable solution , to be able to play with all the settings to the max and without getting too many problems. Sure, wanting to go and change the items one by one to find the best compromise, there is still a great choice: from the quality of the textures to that of the polygonal models, from anisotropic filtering to shadows, from reflections to clouds, from antialiasing to motion blur, naturally passing through ambient occlusion. Without experimenting too much, setting everything to the maximum, with a GTX 1080 Ti the game runs at true 4K and a stable 30 fps, locked by v-sync. To get the 60 frames per second, which obviously change the experience substantially, you have to go down to 1440p or resort to the aforementioned adaptive system, which however at this moment still doesn't work very well and often allows itself some stutter below the target: let's hope fix it with a quick update, which perhaps also adds DLSS 2.0 as in Death Stranding for even greater scalability. There is little to say about the actual quality of the graphics that has not already been said: the Guerrilla Games title can count on of a very interesting lore, the scenarios are really evocative and the characters very well characterized, including the numerous Machines that we will find along the way. The narrative sector does not always live up to expectations and there are situations rendered in a somewhat superficial way, but the soundtrack is excellent and so is the Italian dubbing, which is obviously the same one we heard on the PlayStation 4.", "date": "2020-08-05", "grade": "8.8"}