{"name": "Canis Canem Edit", "ref": "https://multiplayer.it/recensioni/canis-canem-edit.html", "text": "Bully eat bully It can't be easy watching your mother take off with her seventh husband on a year-long honeymoon and be thrown into the toughest boarding school in the whole country. But this is the fate of the ~lively~ fifteen-year-old Jimmy Hopkins, and it is also the starting point of Canis Canem Edit, a school action/adventure that takes some elements from the latest Rockstar productions and combines them into a decidedly one-of-a-kind title. Even before the gameplay (however excellent), the greatest strengths of the Rockstar production reside in the storyline and in the setting, both finely outlined: Jimmy is therefore forced to emerge in the difficult environment of the Bullworth Academy, populated by bizarre teachers and students of every genre, from the most hopeless nerds to sportsmen all brawn and no brains. All framed within the confines of a plot that is as light and ironic as it is exciting, which unfolds using real-time cutscenes that are excellent for the quality of the dialogues and dubbing (strictly in English). From a playful point of view, Canis Canem Edit is configured as a free roaming action/adventure with GTA-style missions, characterized by ample space for the user's discretion in facing the hard school life. The greatest strengths of the Rockstar production reside in the storyline and in the setting Bully eat bully A first aspect in this sense concerns the relationship with the lessons, which the player can decide to follow or skip in order to pursue other objectives. Every day, the bell rings at 9 and 13, marking the beginning of the morning and afternoon sessions: if you choose to do something else, you have to be careful of the patrols of prefects who will try in every way to block Jimmy and send him forcibly in the classroom. However, avoiding the teachings altogether can be decidedly counterproductive, considering how by overcoming the minigames of the various lessons it is possible to learn new skills or enhance those already acquired: therefore, by doing gymnastics you learn new fighting moves or increase your precision with weapons ; following the mechanics course you become capable of building bicycles to be used at will; again, working in the chemistry laboratory, the faculty of creating objects (stinky vials, firecrackers, itchy powder) with the apparatus present in one's room becomes available, and so on. One of the most successful and convincing aspects of the Rockstar product lies precisely in its intelligent exploitation of mini-games, scattered throughout the adventure not only in the form of lessons, but also as parts of missions or sub-quests. It's hard to get bored in Canis Canem Edit, also thanks to an almost perfect pace of play: as soon as the boundaries of the Bullworth Academy begin to get too narrow, the gates are opened that lead to the surrounding city, decidedly extensive (especially if one considers that the means of locomotion are mainly limited to skateboards and bicycles) and very rich in shops, secrets, submissions and minigames. The stick and the carrot Beyond all the highly appreciated diversions that the game offers, Canis Canem Edit still remains the adventure of a fifteen-year-old bully, and all the actions that can be performed by the user are developed on these bases. In addition to engaging in various missions (including pranks, brawls and competitions of all kinds), our Jimmy can interact in a variety of ways with his fellow students. These, in fact, in addition to being all 100% characterized (every single character has his own name, his voice and his way of doing), can welcome the stimuli launched by the protagonist in different ways: a nerd will run away from faced with a threat, while a gymnast will respond in kind with a push, looking for a physical confrontation. Even with the girls of the institute there are some very specific social dynamics: Jimmy can woo any student in order to get a kiss (which gives a temporary energy bonus), but only those who consider him at their level will deign him the grace. And this is just the tip of the iceberg of a highly developed AI system, which makes life within the world of Canis Canem Edit an experience that is really hard to resist. But an action/adventure cannot be defined as such without a little healthy violence, and here the Rockstar title offers a combat system inherited from The Warriors that works wonders. Life within the world of Canis Canem Edit is an experience that is really hard to resist The stick and the carrot In addition to throwing punches and performing combos, Jimmy can perform holds and counters of various kinds, always ahelped in case of need by an ~arsenal~ that counts slingshots, marbles, baseball bats, soccer balls, frisbees, bricks and so on. The interactivity with the setting is also combined with some particular moves, which can see Jimmy lock the opponent in a locker or push him into a garbage can; not only that, when the energy of the enemy on duty is close to zero, it is possible to humiliate him with a special blow and then see him run away like a little girl. With all this meat in the fire, Canis Canem Edit flows away like a beauty, although at times there is a feeling of deja-vu regarding the objectives of the various missions: approximately, it takes between 15 and 20 hours to complete the main adventure, a figure that rises exponentially if you try your hand at exploring the myriad of extras offered by the Rockstar product. And in the face of so much videogame goodness, I'm almost sorry that Canis Canem Edit is not a next-gen product. Not that the cosmetics of the title are disappointing, on the contrary: by PS2 standards it is an excellent game, with a large scenario, numerous characters on screen and excellent animations. However, the slightly low frame rate and the certainly not exciting quality of the textures and some polygonal models significantly resize the visual impact of a product released between the old and the new generation. That said, Canis Canem Edit remains a remarkable demonstration of the potential of the hardware, also benefiting from an absolutely spot-on character design. Finally, really nothing to complain about the sound sector: the aforementioned stellar dubbing is accompanied by convincing effects and a soundtrack composed of vaguely 70s melodies that blend perfectly with the tenor of the game. Comment Ironic, varied, original, profound, engaging: they are all adjectives that well represent Canis Canem Edit, yet another Rockstar title capable of combining ~uncomfortable~ topics with an absolutely top-level game structure. Jimmy Hopkins' epic in the world of bullying is a concentration of withering dialogues, goliardic missions and juvenile brawls, all immersed in a sea of minigames, sub-quests, unlockable secrets and hilarious side elements. Canis Canem Edit's offer is extremely rich and well packaged, even if forced to pay the price of a gameplay that is sometimes a little too cyclical and repetitive and of good cosmetics by PS2 standards, but little impact for a public already projected on the next-gen. Elements that only slightly diminish the value of Canis Canem Edit, even more precious in an era in which originality is often set aside. Pros Solid and rich game structure Great attention to detail Fascinating storyline and setting Cons A bit repetitive in some phases Not impressive graphics Accompanied in its release by a trail of absolutely ridiculous controversies, Canis Canem Edit (better known by its original name, Bully) is the new flagship of Rockstar, a software house now by definition dedicated to the exploration of every possible form of videogame violence. After the ironic one of GTA, the dark one of Manhunt and the referential one of The Warriors, the developers have focused this time on the adolescent one: let us therefore welcome Jimmy Hopkins, aspiring bully of the very strict Bullworth Academy ", "date": "2006-11-03", "grade": null}