{"name": "One-Punch Man: Road to Hero 2.0", "ref": "https://multiplayer.it/recensioni/one-punch-man-road-to-hero-20-recensione.html", "text": "The review of One-Punch Man: Road to Hero 2.0 clarifies once again how the gacha genre often borders on pure and simple commercial operation, in this case limiting itself to bringing the many characters of the series created by ONE, but without any idea to support it. the experience to a mostly passive show, where you simply have to decide on the formation of the team before starting a battle that will be managed completely by artificial intelligence. Gameplay One-Punch Man: Road to Hero 2.0 made its debut on the App Store and Google Play Store, in the traditional freemium format, after a long beta that the authors used mostly to fill the game with content. In fact, we are faced with a roster made up of over fifty characters and a story mode that faithfully reproduces the events of the One-Punch Man anime, recounting the deeds of the powerful Saitama within small cutscenes. As per the script , the protagonist is not playable due to his excessive strength (a trick also used in One-Punch Man: A Hero Nobody Knows), so our task will be to put together a team of supporting characters and face groups of enemies from one stage to another and in the meantime trying to use all the collected items and rewards to upgrade them to the maximum. In fact, the automatisms of the One-Punch Man: Road to Hero 2.0 combat system do not allow you to win using particular strategies or techniques, apart from the initial arrangement of the units on the grid: an important element on the basis of the traditional ~colors~ that determine points of strengths and weaknesses of individual warriors, but at the same time an extremely limited form of interaction. In short, what we will be asked to do will possibly activate the specials of the individual characters once they are ready, but we will soon understand that in terms of effectiveness, entrusting this operation to the CPU will only increase our chances of victory, sanctioning the complete futility of any intervention. At the same time, the side modes only reiterate the same formula, confirming a big repetitive problem for the game. Technical realization In short, the One-Punch Man: Road to Hero 2.0 system turns out to be simplistic and quite limited, and cannot even count on a high-level technical realization. Beyond some artwork and short cutscenes starring Saitama, in fact, the graphics of the Oasis Games title use a pleasant pixel art style but only up to a certain point. The sound sector is much better, which with the various sampled voices faithfully reproduces the atmospheres of the anime. Finally, the dutiful discourse on microtransactions, which in this case becomes quite clear from the first hours of the game. In fact, if the gacha genre is in itself intimately linked to more or less pushed monetization mechanics, here it finds no other possible interpretation given the often mentioned automatisms of the gameplay. It therefore happens that already in the second scenario you find yourself dealing with opponents that are a little too strong, and the crystals needed for upgrades tend to run out quickly: guess how you get more?", "date": "2020-07-17", "grade": "4.0"}