{"name": "Sword Art Online: Alicization Lycoris", "ref": "https://multiplayer.it/recensioni/sword-art-online-alicization-lycoris-recensione.html", "text": "We had told you a few months before the lockdown about our first approach with Sword Art Online: Alicization Lycoris. The premises glimpsed during that event had left us with a bitter aftertaste due to the countless ups and downs. After a few months, the situation has unfortunately not changed, the title of Aquria is to all intents and purposes an extremely classic and ~trivial~ JRPG in its basic concepts that fans of the franchise and of the original work will like, but which are unlikely to could attract new users. Let's go into more detail in the review of Sword Art Online: Alicization Lycoris. Between narrative and gameplay As we had already anticipated in the preview, at the narrative level Alicization Lycoris is divided into two large parts: the first which slavishly follows the narrative arc of Alicization (the first 24 episodes) and the second which offers unpublished content. Therefore, lovers of the events of Kirito (whose role we will play) in the Underworld, his close relationship with Eugeo and the dynamics with Alice will all be present and therefore, as we said previously, connoisseurs of the work to which he refers will find themselves immersed in a context that will make them feel at home without paying too much attention to what is proposed as a JRPG. The second part, which instead offers unpublished content (actually not too inspired and original) and which should enhance the characteristics of a Japanese-style role-playing game, spectacularly fails its intent by emphasizing, if possible, all the defects of the title. As long as the original work supports the technical side, giving players the opportunity to ~interact~ with the story that fascinates them, the title remains on a sufficient level despite the defects. When these foundations give way to an unpublished narrative, in our view there is no foothold to hold on to to overcome these problems. And the JRPG structure of Alicization Lycoris is a great unknown. The structure is classic in a disarming way, the moves available are different, not only the normal and powerful attacks, jumping and dodging but also the special abilities linked to the pressure of one of the back buttons and one of the front buttons. Kirito seemed to us quite complete in the use of long and short-range attacks, what puzzled us a bit is the excessive woodiness of the character and all in all not even unpleasant to use. Just as the characterization of the other characters is ultimately coherent and well blended, offering different possibilities. Therefore, with a view to a conservative vision of what Sword Art Online is, there is not much to say: Alicization Lycoris is a title in continuity with the vision of the series. But is this enough? In a period in which one can and must, especially in these products, look for a flash full of vivacity why not try to be more daring to reach even those who would find it interesting to look into the series. However, the biggest technical problem of the game remains the camera. Already in the preview phase we told you how both in open field fights and in boss fights, the camera was an extra obstacle for the players and unfortunately the question is not only remained but was also amplified by various situations where we found ourselves having more of a headache dependent on the camera and input lag. Yes, because if in the preview we thought that this problem was simply linked to the tested build and the tested boss fight, to our unpleasant surprise the age-old problem concerning the commands occurred continuously throughout our experience. Bandai has confirmed that the situation will be fixed in the near future with a patch, but that's it for now. Intrinsic dualism What we would like to focus on is the experience offered by Alicization Lycoris. Unfortunately, the alienating feeling of being in front of a hybrid and confusing work in the basic ideas is found constantly throughout the gaming experience. The feeling that pervades the player is that of living a game that is perpetually divided in half, unable to choose their own path and constantly looking for the global sop as if pursuing the philosophy of ~one shot at the rim and one at the barrel~. from this point of view the division of the plot between faithful and unpublished must be read, the possibility of choosing between first and third person and the technical structure of a JRPG studded with graphic frills and intuitions from MMORPGs (especially in the menus) or the division between cel-shading of the characters and the search for a false realism in everything else. The same dualism is experienced in the practice of carrying out the action: if on the one hand following the main plot leads us to experience momentities characterized by the events of Alicization and therefore more or less enjoyable, on the other hand there is a leveling system linked to secondary assignments that is truly without originality and characterized by a repetitiveness almost bordering on that of GaaS. Where the title clearly stands out is in the characterization of the characters, the events and the context which for an enthusiast could be ~normal administration~ but which instead is clearly a value to be emphasized when, even if deriving from unpublished material, many interludes and many moments of the first part of the title are still effective. And this is precisely the key point of the experience of Sword Art Online: Alicization Lycoris is worth playing, especially by enthusiasts, for the first fraction for what is offered in those terms. On the other hand however, starting from the action style of a combat system based on combos (you can slow down time but given the input lag problem we will have exploited this possibility less than ten times) and on a few special techniques, ending an unprecedented narrative choice that perishes under the weight of the reference work.", "date": "2020-07-16", "grade": "6.8"}