{"name": "Moto GP", "ref": "https://multiplayer.it/recensioni/moto-gp-9.html", "text": "Rossi is there Moto Gp for the Sony laptop is a title that carries on the tradition of the Namco franchise, without changing the features that made it so successful. For those who have never dealt with the Namco series, it must be said that the game mechanics are based on a choice of simplicity and accessibility that make it classifiable in the ~arcade~ category. A product therefore that goes well with the ~philosophy~ of a portable console, inclined to offer preferably immediate and not too demanding experiences. Unfortunately, although this transposition from Ps2 to PSP can be considered successful even more than other conversions of the genre, the merits are mostly to be given to the type of game rather than to the actual effort of the Japanese programmers. Yes, because if the gist of the title, or the races, always turn out to be fun, satisfying and enjoyable, where there would be more than something to discuss is in the outline, or in the game modes available and in the amount of content. Or rather of their absence, since the Namco production is a title that limits itself to the ~essential minimum~ by doing the homework without further effort. The cornerstone is the Season mode, which invites you to take on the role of one of the centaurs of the championship - or a driver created from scratch - to face the official races one after the other with the aim of winning the championship. The Arcade Mode instead allows you to tackle a single race at will, while the Reward Mode takes note of particular objectives (80 in all) to be achieved during the game to unlock extras. Evidently exhausted by the effort of having created this handful of modes, or due to the limitations of UMD support (sure, right), the project managers have chosen to use only 8 of the world's circuits in this PSP version of the game, for the precisely the European ones. Not a small limitation that seriously questions the appeal of the game. The multiplayer is also unfortunately limited to the simple ad-hoc section of up to 8 participants, once again debasing the capabilities of the Sony laptop; the possibility of taking on online competitions would certainly have given a very strong stimulus to the product, making it much more interesting than it is. But evidently Namco did not want to invest too much in this project, with all due respect to those who have been waiting for years for a real evolution of the series. Brum Brum From a technical point of view, Moto Gp is an overall good game. Even with a marked aliasing, the glance is always appreciable, with a reproduction of the liveries of the bikes faithful to the real counterparts, present both with the editions for the 2005 and 2006 season. The same goes for the tracks, which are exalted from the remarkable visual depth and from a frame rate that really rarely offers the side to some small uncertainty. As for the control system, the PSP stick also in this case shows a lower quality and precision than that of the Dual Shock 2, and the absence of a second stick or analog keys prevents you from being able to dose gas and brake as on Ps2; nevertheless, once you get the hang of it, it's quite easy to be able to paint perfect trajectories and overtake at the limit. As per tradition for the Namco series, there are arcade and simulation modes, where the second as easily understood requires greater attention to driving; however, the simplicity of the physical model borrowed almost unchanged from the first episode makes the choice of the arcade preferable. Very disappointing is the artificial intelligence of the opponents, which in this genre of games still fails to take the step forward towards the realism and unpredictability that largely represents the charm of the sport in question. In fact, the other pilots persist in following the ideal trajectory as inside a track, making the player's behavior seem like that of a white fly or a crazy variable, especially during replays. The electronic tekno musical accompaniment is bad, to be deactivated immediately. Comment Moto Gp for PSP is yet another example of a conversion from Ps2 that has no particular sense of existing. In fact, compared to the Moto Gp 4 from which it comes, the version for the Sony laptop has undergone a series of cuts and reductions that are at times simply irritating, which go far beyond any technical limits and are on the contrary simply attributable to a listless and little confident production. A pity, because due to its simplistic and immediate nature, the gaming experience makes even more sense on the handheld than on the home console, despite the poverty of the mechanics borrowed with only minimalvariations from the first episode. Pros Fits the spirit of the portable console Good graphics Quite fun Cons Heavy cuts compared to the Ps2 version Game mechanics aged badly Mediocre artificial intelligence The 2005-2006 Moto GP season ended recently in a way that few would have imagined at the start of the championship. The winner this time was not in fact Valentino Rossi, despite the protagonist of an incredible comeback capable of redeeming the many unfortunate episodes that happened to him with his talent, but the likeable Kentucky Kid Nicky Hayden. So while waiting for a new season that -hopefully- will be born under a more favorable star for Italian fans, two-wheel lovers can pass the time with the latest incarnation of Namco's famous Moto Gp series, dedicated to PSP .", "date": "2006-11-02", "grade": null}