{"name": "Paper Mario: The Origami King", "ref": "https://multiplayer.it/recensioni/paper-mario-the-origami-king-recensione.html", "text": "Whether you agree or not, this review of Paper Mario: The Origami King can only start from an assumption: the traditional mechanics of Japanese RPGs were born, and subsequently developed, because they were considered the most suitable for telling a story (mainly fantastic, and often involving a group of heroes). Paper Mario is a saga that began twenty years ago (literally, in 2000) on Nintendo 64, and initially he fully embraced these mechanics, while making fun of them. For some years the setting has changed: if the 2007 game for Wii can be considered a valuable spin-off, the 2012 one for 3DS, the highly criticized Sticker Star, should be considered the first step towards a new direction. Which the fans didn't like but which, evidently, represented a necessity for Intelligent Systems: the goal has always been to tell (and bring to life) a story set in the world of Super Mario, and probably, from a certain moment on , J-RPG mechanics (such as level-up, or ~complex~ turn-based combat) were considered inadequate and/or anachronistic. Nintendo had difficulty finding a new way after this drastic choice, which dissatisfied most of the fans of the saga, but we can say that, with The Origami King, it has come up with a good formula: very little is left of J-RPG by now, but the balance achieved between action, exploration and combat is excellent. Perhaps it won't be enough to satisfy fans of the first titles, but that's certainly not the fault of this game, which is a very pleasant pop-up book, mainly for children, in the form of a video game. History and writing The adventure of Paper Mario: The Origami King begins when, who would have ever imagined it, Mario and Luigi are invited to Princess Peach's Castle, to which they head with a rather well-known vehicle, the green kart of their wacky brother (and with a murderer); the excuse for the visit is the newborn origami festival. Were it not known to you, the world of Paper Mario is completely made of paper: an origami ~there~ is certainly not comparable to an origami in our world, neither in terms of complexity nor, obviously, on a symbolic level. In a universe of flat characters, bending and reshaping means revealing and complicating, giving more facets. The fact is that, having arrived at the Castle, the two brothers realize that something is wrong: first of all, the village of the Toads is deserted, and moreover there does not seem to be any festival. Mario continues until he meets Peach, who has changed personality, and has a different appearance than usual. Shortly after it turns out that it has been folded and plagiarized by the mighty King Olly, the first and most dangerous of origami: he has not only captured the Princess but ... well, basically almost everyone else, including Bowser. He also made the Castle his own, moved it and packaged it with five huge colored ribbons, then dispersed in as many areas of the world. Mario's goal is to follow and untie each of these ribbons, in a Mushroom Kingdom where the enemies are no longer Bowser and his henchmen, who on the contrary often become collaborators, but origami. Along the way he is helped by a rebel: Olivia, the king's sister, also origami, capable of giving Mario special powers. These can only be activated from certain platforms and, although often starting from the stretching of Mario's arms, they lead to diversified effects. In addition to the events, the story is told by the many dialogues present in the game, and we can only say we are admired by the quality of the writing: extremely light and brilliant, nice and pleasant for children, satisfying and full of puns for adults. For example some bosses of the game, which are stationery items (colors, rubber bands, etc...), speak a polished language and offend Mario, posing the clash as a question between high culture vs low/pop culture. Therefore, irony is made not only on in-game situations, but also on sophisticated topics of ~our~ world, such as jokes about Professor Toad, an archeology expert, talkative and totally devoid (or almost) of practical skills. In this area Paper Mario has always been exceptional, and The Origami King is perhaps among the best in the series: the quality of the writing is not only above average for a video game, but is often comparable to a good children's book. Exploration and Kingdoms The most important difference between Paper Mario: The Origami King and the previous Color Splash (for Wii U) probably lies in the exploration. Let's be clear right away: we're not talking about a game comparable to Breath of the Wild. However it is still an adventure, and in the precedent, perhaps with the intention of not excessively burdening the flow of action, the extreme segmentation of events greatly limited the perception of being inside a ~world~. This sensation, on the contrary, has returned to the fore in The Origami King: the exploration of the Kingdoms is often linear, but never happens in a wooden way, and reserves pleasant surprises (unexpected events also in terms of mechanics). The Kingdoms are divided into zones, but they can all be visited in sequence, there is no detachment, an ~external~ or schematic map on which to move from one zone to another. The fulcrum, from which almost all the other regions can be reached, is Borgo Fungo: the largest city in the game, where you can buy weapons, visit a museum, reach the port... and various other activities. What do you basically do when you explore? Trivially you try to advance, whether it's looking for an object, defeating an enemy, or solving a puzzle; at the same time, there are secondary objectives, such as Toads to rescue (often transformed into origami), hidden blocks to find, Weird Rips to repair. The latter are holes in the game world, to be filled with confetti, often essential to advance: in turn, confetti accumulates mainly by beating enemies, and represent the greatest incentive to trigger a fight, even more than coins. In essence, although often ~light~, exploration requires attention, and evokes the feeling of being in a cohesive world; the latter perception is undoubtedly encouraged by the imaginative settings, and by their realization. The five Kingdoms of the game are in turn divided into various areas, each containing different hidden elements (shown in the menu), each with a strong graphic and visual characterization: the first Kingdom, for example, combines a forest, a city, a sewer, as well as a rocky area inhabited by koopas. Another Kingdom, later, is a continuous homage (even parody, at one point) to The Legend of Zelda: The Wind Waker. We won't describe anything else so as not to spoil the surprise, but each area follows - broadly speaking - the polymorphic structure of the first Kingdom. In regards to the inhabitants, The Origami King sits somewhere between the old and the new Paper Marios: Olivia is a pleasant assistant, and there are sidekicks and some really well fleshed out characters. The variety is not comparable to that of Il Portale Millenario (GameCube, 2004), but we believe that the overall quality is absolutely satisfactory. There's even a cathartic moment involving one of the protagonists, which we greatly appreciated: perhaps it's too different from the average register of the game, but we liked it, and we didn't expect it. Also in this area the high quality of the dialogues is fundamental, which gives personality even to the less inspired characters. Fights and level-ups As we said earlier, the main reason for facing the fights, as well as continuing (in case an enemy blocks the passage), is to obtain confetti, which in turn is necessary to repair the various Weird Tears that damage the Mushroom Kingdom. Since there is no more level-up, in Paper Mario: The Origami King Mario's progression is relegated to the collection of particular hearts that increase the Life Points, as well as the discovery of increasingly powerful objects, weapons and accessories. However, there is no evolution of the character linked to the player's choices or strategies: the objects you will find are almost always an improvement of an element already owned previously, so it will be enough to replace the old tool with the new one. The fights are basically a puzzle game: when you hit an enemy during the exploration phase, you are transported inside a circular arena, made up of four rows and twelve columns. Mario is inside it, in the center, and within a time limit, as well as within a certain number of moves, he must rotate the board in order to place his enemies in a row (or in squares of four boxes): in doing so he will get a bonus to attacks, which will often allow him to win the fight without conceding the attack to the enemy. In short, they are short fights, and linked more to the resolution of the initial puzzle than to real battle strategies: the same helpers participate in the fight in a random way, in fact providing an impromptu bonus attack to Mario. We found this structuring pleasant, but certainly not brilliant or profound, so much so that the developers have dosed the battles well: they are not too present, and in the rare moments in which one is forced to undertake them often, without running an effective risk and without the need to confetti, they quickly become annoying. Also for this reason, encountering enemies that have become too easy, a simple hammer blow is enough to eliminate them (without reaching the arena).king, basically). Far more ingenious, but equally if not more puzzling, are the clashes with the - numerous, approximately two per kingdom - bosses: in this case the enemy presides over the center of the arena, with Mario rotating the squares in such a way as to reach the platform right. By defeating the various Cartomagni, enemies based on a natural element (earth, water, etc...), Olivia acquires their powers, which she can use both in these clashes and in exploring the game world: their activation is always linked to the presence of the relative platform. Boss battles, to conclude the topic, are based on the discovery of the ideal strategy: how and when should they be attacked? With what move? This is the puzzle that Mario has to solve, because in fact it is very difficult, and absolutely discouraged, to beat these enemies without finding the best strategy. We don't want to say that it's always impossible (in some cases it is, however), but it's definitely not recommended and senseless. Longevity, sound and graphics Overall we found Paper Mario: The Origami King to be a nice organic adventure, with pleasant and light mechanics, beautiful environments, great care for every element of the game, all accompanied by a simple but ingenious plot, and extremely brilliant writing. The quality remains high and constant for the duration of the adventure, in our case just over thirty hours of play (but we haven't found every hidden element). Paper Mario is a title where the player can get stuck: if you don't understand how to solve a particular puzzle, or how to defeat a particular enemy, you are (usually) not allowed to enter another area, and continue the adventure elsewhere. Precisely for this reason, also considering the mainly infantile target, it is possible to ask for help from Olivia's suggestions. In any case, we reiterate, the main quality of this game is its organicity: less variety in the settings, less fantasy in the events would have been enough to make it much more boring. Instead it is made with extreme care. The soundtrack itself, and we also include the sound design in the speech, is very pleasant: perhaps the best part of Paper Mario: The Origami King. In addition to the memorable music (that of the canyon is truly splendid, but we could make a long list), we noticed a truly admirable quality: in this regard we want to mention the ~staircase~ bridge, in which each tile emits a note, or the loudspeakers of the wood which, if hit, silence the music (as if we were in a campsite, and the piece was not only an accompaniment, but actually transmitted by the speakers). As far as the visual aspect is concerned, there is no doubt that it is pleasant and functional. Paper Mario started out as a ~normal~ world inhabited by paper characters; this is no longer the case, because technological progress has made it possible to expand the concept, and now it is all made up of sheets, paper and cardboard. As we said, the game is always pleasant to see; however, it is not always clear that the world is made of paper. In fact, sometimes it just doesn't feel like it; and it's a shame, because when everything is studied in detail, as in certain architectures, the result is fantastic. At one point there is a fake tree (it's part of a theatrical set), it's flat, and the composition of the cartoon can be glimpsed from the side; on the contrary, the ~real~ trees, those that populate the woods, often don't look like paper. It's definitely not a point against Paper Mario, but its moments of excellence show us the untapped visual potential.", "date": "2020-07-15", "grade": "8.8"}