{"name": "Deadly Premonition 2: A Blessing in Disguise", "ref": "https://multiplayer.it/recensioni/deadly-premonition-2-a-blessing-in-disguise-recensione.html", "text": "Just two months ago we were talking about how much the original Deadly Premonition required a huge leap of faith on the part of the player, who had to go beyond a bad graphic and technical sector to discover the seed of a breathtaking narrative. So well designed to earn the game the fame of Twin Peaks video game. Before writing the review of Deadly Premonition 2: A Blessing in Disguise, our expectations were to find a story at least on par with the previous one but accompanied by a playful and generally qualitative structure that was far superior: because if the first time what made Deadly Premonition so special was also its disastrous staging, for that strange mechanism that a thing is bad enough to go around and become beautiful (or unique), repeating the same mistake would have meant resting on one's past laurels with the conviction to escape it again. Unfortunately that's exactly how it happens. Deadly Premonition 2: A Blessing in Disguise is a game that reflects SWERY's inability to balance possibility and ambition, presenting us with an experience that drags along in the glories of the original by treading the hand, ergo worsening, on those aspects that for ten years ago they had made it so appreciable. History, between Le Carr and Boston The story of Deadly Premonition 2 is divided between past and present, where the latter reconstructs the events that took place in Le Carr in 2005 through the words of one of the very few witnesses. FBI agent Aaliyah Davis is investigating a case that will force her to delve into the investigations that took place in this remote Louisiana town, discovering that something beyond the wildest imagination is hidden behind a seemingly inconclusive series of events. The game therefore, from chapter to chapter, bounces between two timelines in part making us experience firsthand the case of Le Carr, in the role of Francis York Morgan, and in part summarizing it through the skeptical eye of Aaliyah who struggles to believe in what she is told. Being a thriller, discussing the plot in detail would ruin the experience but even without giving precise examples we can say that we are faced with a watered down narrative, devoid of bite with rare exceptions in the present phases, built on the assumptions of the original Deadly Premonition in an attempt to give roots to a perfect story as it was written. The surreal cannot and must not be explained, because when one tries to rationalize it (as Aaliyah does) one collides with the inevitable distrust of events that can't really have happened. In this, the original game excelled because it did not pretend to explain everything but asked us to abandon ourselves to the suspension of disbelief and accept what was shown as, if not true, at least possible. This is where Deadly Premonition 2 fails, believing not only that it can link its narrative to that of 2010 - and therefore creating an unnecessary precedent - but even to re-propose the theme of the town as remote as it is bizarre without being cloying. Indeed, insisting on the strangeness of the inhabitants to the point of transforming them into irritating specks far from the charm, for example, of Sigourney. The more one goes on with the plot, the more one realizes that Le Carr is only an (not) artfully constructed pretext to lengthen the broth and try to give a logic to the narration of the present: the bond that unites them, however, is so labile and based on such an absurd series of assumptions that they leave them screeching one step after another. An incredibly predictable plot contributes to this, where the twists are not such because they have already been widely anticipated and above all carried out on the basis of the most absolute chance. Throughout all of Le Carr's events we will in fact be guided by an oracle, who will make his comfortable appearance at every dead end to offer us riddles of disarming banality (even if only because York solves them for us) indicating where to go to continue the plot. While understanding, as is often reiterated and perhaps not surprisingly, that a normal approach is not part of the detective's methods, in the original game there really was a sense of investigation and the plot went on according to a series of concrete events. The presence of the elusive oracle seems to be a ploy to justify the lack of a fabula, suggesting that the author did indeed have some foundations in mind - precisely those in which the narration recovers a bit - but did not know how to put them together and used the surreal like parsley. Finally, the characterization of the characters. Once again, Deadly Premonition 2 demonstrates how SWERY has taken the good del primo and twisted it with the certainty of triggering the same reaction from the public. It doesn't quite work like that. The beauty of a title like Deadly Premonition was also based on this, on its uniqueness: taking the same model without the intention of improving it, on the contrary, exacerbating its aspects, rather leads one to think that the original was an illumination impossible to repeat and to which the author attaches himself with excessive insistence. York himself, whose charm and charisma lay in his unpredictability, reaches points where he is annoying. With the exception of a few others, none of the small inhabitants with whom we will have contact manages to be remembered for a reason other than the nervousness caused. Or even just for a vague narrative thickness. This is mainly due to outdated play mechanics, crazy to be re-proposed in 2020 as they had already proven to be in 2010. Inexplicable gameplay If we can salvage anything from the narration of Deadly Premonition 2, tooth and nail, we don't even know where to begin to discuss gameplay that is unthinkable in every respect: in other words, take the playful structure of the original Deadly Premonition, make it worse in some wait and you will have clear what to expect from this second chapter. Change everything to not change at all. It is not enough to vary the town, such as geographical position and atmosphere, to create something different if we are at the same level in terms of content and indeed even a step behind. Le Carr is a sunnier Greenvale, with few characters to talk to or from which to obtain missions, which pushes little exploration and regulated by the same ~time slots~ rhythm that we experienced in the first chapter. This still remains the most interesting aspect and that would be enough to understand the paucity of the contents. Deadly Premonition 2 has few side missions, unlimited tasks that are very simple and necessary for obtaining resources, mini-games that get boring after a few attempts and in general nothing that really makes you want to go deeper than necessary. Not only that, the annoying habit of being assigned remains missions that can be solved by trial and error, which are not even so intuitive: from a 2020 game it is expected that, if a character needs a specific object, especially if it is in common use, he will be able to tell you where to find it. Instead, the already few missions available often result in a goal whose destination is unknown and there is no clue to at least understand the direction to take. Again, a ploy designed to lengthen the soup of a game which, if it had had a less random structure in its development, would have resolved much more quickly. Furthermore, some limitations often apply only to us and not to the NPCs (access to certain places according to time slots): it was tragicomic to find yourself in front of a diner just before opening time, therefore inaccessible, and seeing a character smoothly open a door that for us was - and was in any case immediately afterwards - closed. These are trifles that nevertheless demonstrate a carelessness in development, even listlessness. In some cases, it is even the narrative choices that clash with the gameplay, contributing to nervous accumulation: for example, there is a character who suffers from multiple personality disorder and therefore plays four different roles, all in the same place. A secondary mission, but necessary since it was going to influence our ability to maintain a suitable level of hygiene, required to speak (unnecessarily, as you may have already guessed) with three of these four personalities who, however, are available completely at random during the course of the day. We had to stand outside the building and come in at every hour to check if it was the one indicated. Deadly Premonition 2 tries to add variety to its structure by introducing character upgrades: necklaces, dolls and amulets, in full voodoo style, to offer on a special altar to strengthen York according to our preferences both in physical terms (health, stamina, resistance to altered states) and in terms of the pistol, the only weapon at our disposal. It is an alligator gun that shoots highly lethal rubber bullets, useful indiscriminately against wild animals or creatures from the other world: so far nothing strange, considering that in the dark dimension the weapon will take a different shape so as to justify its effectiveness in that context. The main problem is that these upgrades, whose construction and subsequent improvements require continuous research for material, have almost no weight on the game economy since the difficulty of the combeats is non-existent. To test the mechanics, we equipped at least one necklace and one doll, enhancing stamina, life, range and firepower, improving them only once: the result was eliminating the creatures in a maximum of three hits, suffering laughable damage and therefore canceling the whole system of potential character growth. We only needed two objects to go on until the end of the game without ever dying and almost never needing to heal. Talking about creatures naturally leads us to the ~horror~ moments of the game, which are a disaster across the board: not only is there a single, very anonymous setting that forms the backdrop to the stages in the other dimension, unlike in the original game which followed the Silent Hill effect and proposed the corrupted version of some places in Greenvale, but it is a series of corridors with occasional points where to advance it is necessary to kill all the enemies in the area. Enemies who, as we have already pointed out, are too weak, forgettable in design and in no way scary. The fights, if we can call them that, are bad - again, take the structure of the original game and paste it here, with the difference that at least the creatures in Deadly Premonition were creepy. The gunplay is unsalvageable, of the boss fights you will remember the design of the monster in question for a few seconds (with an identical pattern for all) and the continuous presence of bugs that force you to restart the game leads to a single question. Why? We can't explain how it was possible to worsen the result achieved with the first chapter, yet it is: forget the horror, the surreal, everything you could have saved in 2010. You certainly won't find it here. Technical problems cascading To crown an overall situation that is anything but rosy, the technical sector of Deadly Premonition 2 arrives at a straight leg: here too we could list you point by point the obstacles we encountered and which a first corrective patch did not improve, but for a general overview we will first mention the frame rate. If it manages to reach 20 fps it is a state of grace, considering the continuous drops that lead to real moments of freeze of the game, an aspect that is especially noticeable when skateboarding. Excessive loading times are added and considering that they are activated every time we enter or exit a building, or moving to the next level as we wander through the dark dimension, it becomes preferable to interact with the different structures only if strictly necessary. Then there are bugs of various kinds that undermine the entire experience and sometimes afflict the same plot missions, forcing a reset of the game; it is also not uncommon to run into audio problems that fixate on a certain sound and continue to repeat it out of context within the same area - for example the noise of the scissors used by one of the creatures. In the worst cases, we've even managed to catch a glimpse of model polygons in gameplay cinematics - the only sections where the mixed cel-shaded graphics do their job well enough. For the rest, especially by connecting Switch to the TV, the ginning in particular of the characters becomes very evident. In short, a disaster from every point of view.", "date": "2020-07-08", "grade": "4.0"}