{"name": "Beyond a Steel Sky", "ref": "https://multiplayer.it/recensioni/beyond-a-steel-sky-recensione.html", "text": "After an excellent start, the qualitative boost given by the Apple Arcade program to games for iOS and Mac seemed to have lost a bit, but this single game is enough to clearly raise the level of the catalog, as we see in the Beyond a Steel Sky review. The surprise appearance of the game, among the announcements of projects in development at the time of the presentation of Apple Arcade, has unleashed rather mixed emotions in many fans of the graphic adventure genre: seeing Robert Foster back in action in a renewed Union City is was obviously moving, but handling a precious material like Beneath a Steel Sky for the construction of a completely new and 3D chapter, structured as a third-person adventure was still very risky. For those who loved the original and the wonderful bitmap developed by Dave Gibbons, designer of Watchmen and Green Lantern, able to build a very original image of the future cyberpunk, the first trailer with this completely new style had also raised many doubts. We can safely say that the fears were largely unfounded: Charles Cecil and Dave Gibbons are still in great shape 26 years after the release of the first chapter and it is a real pleasure to note how the atmosphere, the puzzle design and even that particular ironic spirit that constantly surfaced in the original, even in the face of very serious issues, have remained practically unchanged. Indeed, the latter aspect almost seems to have been enhanced in Beyond a Steel Sky, which features a plethora of colorful characters capable of creating lively and funny dialogues. The quality of the writing is a remarkable aspect of this new chapter, even in the face of a story that perhaps doesn't have particularly memorable elements: the exchanges between the protagonist and the NPC are often inspired and brilliant, laying bare the problems of a futuristic utopia that evidently hides baffling contradictions beneath its glittering surface. The animated comic-style opening sequence perfectly recalls the atmosphere of Beneath a Steel Sky and almost seems like a repeat of the original introduction, except that Robert Foster is much more mature now and his arrival in Union City is a return that evokes many memories. The story starts with the daring kidnapping of a boy from the Glade, which pushes the protagonist to get back on the road towards that futuristic civilization that he had abandoned right at the end of his old adventure: Union City has been completely transformed by those events and Joey, the Robert's ex-robot companion, he is revered as the founder and tutelary deity of the new social utopia. However, the investigation into the kidnapping soon reveals some dark sides of the seemingly ideal civilization built on the old cyberpunk city-state, and Joey's sudden disappearance only deepens the mystery. A classic adventure in modern form Don't be deceived by the new third-person setting: Beyond a Steel Sky is a graphic adventure in all respects, a worthy heir to the long tradition of Revolution Software which founded its history on this unique genre. By evolving the interface developed for Broken Sword 5: The Curse of the Serpent, the one used in this title brings it closer to a sort of classic third-person adventure in which we can explore the settings by directly moving the protagonist in three-dimensional space, interacting with characters and objects through a more classic point-and-click system for solving puzzles. The game was tested on the iPad, therefore using the touch screen which is usually not the best medium for this type of gameplay, yet the changes made to the control system manage to make it perfectly usable even with this solution, beyond some inconvenience intrinsic linked above all to the direct movement of the character. The dynamic interface is not based very much on the classic combination of inventory items and scenery elements, but rather on a variety of situations that usually also involve other characters or robots, but the most characterizing element of all the puzzle design is certainly the presence of hacking, which opens up many new possibilities for interaction. At the beginning of the story, Robert comes into possession of a scanner which, suitably modified, allows him to enter the electronic systems present in the surrounding area with various consequences. It is to all intents and purposes a game within the game, able to vary the gameplay in a convincing way with an original introduction: by activating the scanner and getting close to various electronic instruments, we can visualize diagrams ofstream representing the actions of robots and computers in the area. By simply dragging operations from one part to another we can modify the sequences of operations, even combining parts of different diagrams and therefore exchanging actions between devices. Explained in words it may seem more complex than it appears in the game, but in fact it is a very intuitive system that opens up original solutions for solving puzzles and particularly stimulates lateral thinking. This remarkable openness also translates into greater potential complexity, given the amount of possible solutions, but the freedom to experiment with different combinations of actions through hacking is still very stimulating. It must be said that the balancing of the puzzles is sometimes unbalanced, with some that are too cumbersome compared to others built in a more logical way, but this is still part of the game, in this genre. A new look The appeal of the 2D bitmapped graphics of the 90s original is impossible to replicate and it was obvious that this chapter would go a completely different route. The particular 3D chosen by Revolution relies on Unreal Engine 4, presenting a highly scalable graphic system on the screens, which does not look too bad on less performing devices (always remaining within iOS), also thanks to a touch of cel -shading that emerges more marked as the graphic characteristics decrease, making the image more cartoonish and stylized but not too rough. Gibbons' trait is much less visible with a graphic scaffolding of this kind, obviously, but there is still a remarkable artistic direction behind the construction of the settings and in the characterization of the characters. In particular, the technology with an almost Art Deco style and the glimpses of Union City give back the image of a utopian megalopolis that is convincing and also quite original, in several respects. From a technical point of view, however, there are some drawbacks that could be corrected at a later time, such as frequent crashes on older iPads and strange interpenetrations and contacts between the camera and the characters or between the characters themselves, with NPC passers-by who tend to to often get stuck with each other or with the protagonist. The musical accompaniment and the dubbing are of a good standard, entirely in English but supported by a good textual translation into Italian, which perfectly reproduces the typical comic lettering that characterizes the texts on the screen. Finally, a note on the relationship with the original: it is not necessary to have played Beneath a Steel Sky to appreciate this new chapter, whose story develops quite independently, but the various references to the progenitor's characters and events are obviously more appreciated by knowing the old classic, of which this is to all intents and purposes a direct sequel and also a tribute.", "date": "2020-07-02", "grade": "8.5"}