{"name": "Rakuen Deluxe Edition", "ref": "https://multiplayer.it/recensioni/rakuen-deluxe-edition-recensione.html", "text": "What would happen if the doors of a hospital could open to a fantasy world, populated by bizarre beings and with its own rules? It was 2017 when the developer Laura Shigihara had tried to answer this question with her Rakuen, an RPG belonging to the isekai genre that put us in the role of a child who does not accept the grayness of her hospitalization. Thus we set off to discover a fantastic and colorful universe, with a soundtrack that is still memorable today - Shigihara is a brilliant composer and singer - which has remained impressed in the memory of several members of our editorial staff and loved by the Steam public. Rakuen returns with a Deluxe Edition starting next March 23, and it does so on Nintendo Switch, a console that perhaps more than any other has managed in recent years to become a welcoming home even for low-budget independent productions. Six years after its release, we can say without hesitation that this Rakuen is worth living (or reliving) which, with its retro aesthetics and well-kept soundtrack, keeps its appeal unchanged. Flanked by the spin-off Mr. Saitou (also available as a ~standalone~ product on Steam from March 23) and the animated series Farmer in the Sky, Rakuen is an unmissable appointment for those who love old-fashioned RPGs with simple and an intense narrative. We tell you about the adventure of the child and his mother in Rakuen's review. To the realm of fantasy Rakuen strongly contrasts the gray spaces of the hospital with the bright colors of the fantasy world where the child and his mother are catapulted A child rests under the covers of his hospital bed. After meeting a mysterious boy named Yami, the protagonist begins to walk the ward and get to know the other patients. There's gruff Tony, an elderly coffee aficionado, and then Cora, with her pink mohawk; there's Winston, who never abandons the bedside of his comatose wife, Kisaburo, obsessed with his excavation operations that drive the medical staff crazy, and little Sue. We get to know the characters through the dialogues and impressions they have of each other; they will be essential to shed light on their personal stories, all intense and well written. We don't want to reveal too much of the plot - which is revealed slowly, delicately and with a very high average level of writing - also because Rakuen is a video game that thrives on surprises and twists, small and large. Suffice it to say that the child and his mother discover that it is possible to access a fantastic world through some doors inside the hospital: it is Rakuen, a universe narrated by a book handed down in the mother's family for generations. The most successful aspect of Laura Shigihara's work is certainly the juxtaposition between the greyness of the hospital - rendered also on a musical level, and not just an aesthetic one - and the vibrant joy of the Morizora Forest and the other environments that the protagonists will explore during the course. of the adventure. The use of cute mushrooms, blade worms, blossoms and teddy bears allows Shigihara to tackle difficult and often painful issues while keeping Rakuen accessible to even a very young audience; despite the children's fantasy tone, the plot also has intensely moving moments, especially in the very successful finale, which comes after about ten hours of play. In our opinion, it is a pity that the relationship between the child and the mother is not developed during the course of the story, to receive a sudden acceleration towards the end, also considering that the two protagonists are almost always together, with consequences also on the profile of the gameplay. A simple and immediate RPG The mother is almost always at the side of Rakuen's protagonist child, ready to provide advice and support Rakuen does not pretend to place players in front of complex puzzles, requiring the most spirit of observation and listening skills of the various characters, who will reveal their desires to the protagonists, and whose problems we will often have to solve to continue. By pressing the Y key you can talk to the mother at any time, who gives advice for solving the puzzles: a pity that usually the dialogue will remain very generic, without specific indications to move forward. For the most part, the mother remains a silent and inactive presence, following the child, but not interacting with him. Rakuen is developed with RPG Maker XP and the elements of the scenario do not always have such a distinctive air as to invite to interaction: often, however, it is understood that even the most banal of hospital bedside tables can hide essential objects for the continuationthe adventure. There is a very simple inventory, accessed via the menu, which contains key items and various collectibles that can be used to decorate the hospital. The hospital/fantasy world dualism works and convinces also from the gameplay point of view: it is often necessary to alternate the crossing of the two worlds to carry objects back and forth, talk to the various characters who populate these very different environments and thus carry on the adventure. Rakuen thrives above all on narrative excellence, and in this sense it can be said that the plot and dialogues become the player's primary reward, who even after an apparently trivial fetch quest gains access to intense and profoundly human stories, which we have experienced again with great pleasure in this Rakuen Deluxe Edition. New content and an excellent soundtrack Rakuen is filled with absolutely insane and over the top characters This new edition of Rakuen is accompanied by some decidedly interesting additional content. First of all there is Mr. Saitou, a spin-off also available on Steam, focused on the Saitou blade worms already seen in Rakuen; then we have a nice animated series, Farmer in the Sky, which testifies to Laura Shigihara's desire to create a sort of ~expanded universe~ of Rakuen, straddling various media. As for Rakuen in and of itself, we appreciated the improvements made on the stability front of the game, which presented some technical angularity when it was released six years ago. The soundtrack of the game remains exceptional, which stands out for a skilful use of the keyboards and for a delicate and at the same time incisive use of varied sounds, capable of perfectly accompanying the various moments of the game, and above all - as those who have already played will remember the original edition of Rakuen - decisive in pushing the feelings of the player in the direction intended by the developer. On several occasions we found ourselves moved to tears not only by the stories of the child and his supporting actors, but also thanks to the excellent music, indelibly engraved in our memories. The construction of an effective contrast between the fantasy world of Rakuen and the hospital also passes through the sounds that distinguish these places, and Shigihara, in this sense, has proved to be a true teacher. Unfortunately, an Italian translation of Rakuen and its additional contents remains absent.", "date": "2023-03-22", "grade": "8.0"}