{"name": "StoneAge World", "ref": "https://multiplayer.it/recensioni/stoneage-world-la-recensione.html", "text": "Netmarble is one of those big Korean companies whose approach to the world of mobile video games isn't exactly the most creative and artistic, but at least it's able to make games that are pleasing both to the eye and in terms of gameplay, as also demonstrated by this StoneAge World review. Online games come mainly from the label, often based on some highly appealing license and focused on forms of internal monetization, considering that for the most part they are free-to-play games. All very unedifying premises, but if nothing else we note a genuine desire to find sometimes unusual hybrid solutions, as well as a remarkable refinement as regards the level of technical realization in terms of graphics and style. In some cases these characteristics of Netmarble lead to truly remarkable results, as we saw in Lineage 2: Revolution as regards the direct transposition of MMORPGs in the mobile environment and above all as we appreciated in The Seven Deadly Sins: Grand Cross, which in fact represents an excellent evolution and refinement of the mobile RPG with gacha elements. StoneAge World does not reach these levels, but shares with the aforementioned excellent examples a considerable attention to the user experience in the specific smartphone context, proposing a title that is decidedly comfortable to play on the move and also characterized by a certain charisma. The game transports us to an absolutely invented and cartoonish prehistory, where the first humans coexist with dinosaurs of various shapes, all represented with a very comic and ~Kawaii~ style, even if there are obviously more aggressive and threatening creatures. The story sees the world of Tectonika threatened by a new civilization of highly technological machines intent on conquering the peaceful land of humans, who must therefore organize themselves to fight the invaders. The main tool of the fight are dinosaurs, who can be captured and trained to become perfect soldiers, without ever forgetting the most tender and affectionate aspect of such a relationship, which is very reminiscent of taking care of pets. It is not difficult to see what the most obvious inspiration of StoneAge World is: it is clearly an adaptation of the classic Pokmon concept in an MMORPG-style context, with dinosaurs covering the role of the typical creatures to collect. There are, at the moment, about 250 different species to find, capture and train for combat, all different and rather well characterized: considering the typical variety of the dinosaur world and the usual charisma that these animals continue to innately arouse, the choice to build a ~trainer~ using this subject is in itself a very smart idea, also quite well done. On the other hand, the StoneAge series is well established with almost 20 years of history, although few around here have ever known about it considering that it practically never left South Korea. Between Pokmon and MMORPGs The mechanics of capturing and training animals is certainly the most interesting element of the game, the one that characterizes practically the whole experience, considering that the RPG component is decidedly flat and generic. The explorable world is large and pleasant, but the story is extremely simple and uninteresting while the quests are almost all set on the simple collection or delivery of objects and some specific combat. The biggest challenges come from the multi-level dungeons and boss fights, which represent the most engaging moments from a purely RPG point of view, but the real charm of the game seems to lie elsewhere. The narrative and the structure of the quests, in essence, are not really a cornerstone of StoneAge World, it relies on other elements to fascinate users. The driving force of everything therefore comes from the usual collecting spirit that unites Pokmon and similar titles and which pushes us to collect as many creatures as possible trying to get even the rarest ones. Catching takes up the classic style of this type of game: it involves discovering the animals (perhaps attracting them with bait) and fighting them until the opportunity to capture them arises, using more or less effective ropes. As the rarity and power of the creatures increase, capturing becomes consequently more difficult, which leads to the use of more effective and expensive capture systems and obviously can trigger the race for micro-transactions, since it is precisely dinosaur management that focuses especially the race for constant growth. Each creature has a set of variable attributes that they grow withtraining, raising their level and increasing their ability in battles, developing even rather complex skilltrees and above all a remarkable variety of different possibilities in terms of evolution and development of combat skills. The combat system is turn-based and has vaguely tactical characteristics in choosing the group of creatures to use with their specific skills, but beyond this it is not particularly complex, prompting to activate soon the auto-play and the time compression to archive the practice-clash faster, which pushes the whole game towards the classic automation which tends to make the whole experience a bit sterile, shifting the attention to the typical dynamics of grinding and, unfortunately, also a some pay to win.", "date": "2020-06-27", "grade": "6.9"}