{"name": "Rainbow Six Siege: Operation Steel Wave", "ref": "https://multiplayer.it/recensioni/rainbow-six-siege-operation-steel-wave-recensione.html", "text": "Despite the logistical difficulties of recent months, even if in ~smart working~, Ubisoft has managed to release almost punctually - if we don't consider the extra week on the test servers - the new update of its leading title. As they had already amply illustrated to us during the presentation of the double road map of this and next year of Siege, the new season also puts an end (at least momentarily) to a tradition that has continued since 2016: Ace and Melusi - this is the code name of the two new characters - they are the last Operators to be released as a pair. To focus on other aspects of the game and all the improvements that the community has been asking for, the development team decided to slow down the development of attackers and defenders. Starting with the next DLC, Team Rainbow will be enriched by only one member at a time. In order to make this ~transition~ less bitter, it was necessary to launch into the fray two operators capable of leaving their mark at any level (from competitive to more casual). There is obviously no shortage of revisions and news that form the backdrop for this update. Let's see all the additions in the Rainbow Six Siege: Operation Steel Wave review. Ace & Melusi: the influencer and the ranger If there's one thing that has always worked in the introduction of new operators of Rainbow Six Siege it is certainly their impressive characterization. The complete team now has well over 50 characters and each manages to be completely different from the others both from a purely aesthetic point of view - a matter not to be underestimated, especially when each operator has unique skills and must be able to be recognized instantly - and from the biographical one, an aspect that has received a lot of attention from developers in recent years. Humanizing the new recruits of the Rainbow team allows fans to get closer to the lore of the game and this makes both the reveals and the seasonal events more pleasant and interesting. Since the introduction of Kali and Wamai, two seasons ago, Nighthaven has made its appearance and has left numerous pending speeches: although it is not yet clear whether it is infiltration or something more complex, even in Operation Steel Wave one of the two new operators belongs to this private and militarized group. We're talking about Hvard ~Ace~ Haugland, the Norwegian striker who manages to carve out his own space in the hard breacher category, along with Thermite, Hibana and Maverick. It is an extremely determined and particularly self-confident paramedic, who grew up in a small village and determined to emerge in every situation, to the point of appearing unscrupulous even on social networks. His character and role in the team are perfectly in line with the concept of ~fire and flames~, but the same cannot be said exactly of his special gadget: the SELMA is a water-based break-in device specifically designed to limit the area explosion and avoid accidental damage during rescue operations. How does this translate into gameplay? The attacker can rely on 3 yellow barrels, complete with the Nighthaven logo on the body, which once launched on destructible surfaces or reinforcements, hook up and start a sequence of water pressure detonations in three phases. Water cartridges are released from the container, the explosion of which can also pierce the metal. While the first is triggered, the keg descends to the lower level to place the second and, finally, the same mechanism is repeated a third time (if the space available allows it). This allows for the creation of both narrow lines of fire and chasms large enough to be crossed on foot. SELMA is also useful for opening reinforced and non-reinforced hatches, only in the first case the use of two of the three Ace devices is required. Not to be underestimated, of course, the possibility of use also in the destruction of certain gadgets of the defenders: the Norwegian's device manages to anchor itself to the mobile shields, to then explode, but it can also eliminate everything that is within range when it detonates on destructible surfaces. Needless to say, there are counters. Some are typical for the category of hard breachers (the electricity of Bandit and Kaid's unique abilities or the frequency jammer of Mute) others are more related to the group of throwable devices (the gadgets of Jger and Wamai). These peculiarities do not make Ace just a simple ~substitute~, but a valid alternative with pros and cons, such as to also have an impact on the style of play and the type of tactic to be used. In the paraphernalia of the new assailant comthey seem to be our old acquaintances: the M1014 shotgun (also present in the endowment of FBI SWAT members) does not find much use if the alternative is Fuze's AK-12, among other things with the possibility of accessorising NATO sights (and not the Russian ones). The only secondary is the P9 of the French, while for the support gadgets you can choose between Breaching Charges and Smoke Grenades. If Ace's unique ability seemed particularly inspired and interesting to us, Melusi's ~bewitched~ us... in every sense! Specialist Thandiwe ~Melusi~ Ndlovu comes from South Africa and is part of the Inkaba Task Force. The purpose of her group of women only is to fight poaching effectively, to preserve the beautiful landscapes and protected species of the area. It is an exuberant operator, strongly linked to her origins and traditions but, at the same time, open to the use of particularly advanced technological devices, such as her Banshees. Yes, you read that correctly! The name is precisely that of the famous female spirits of Irish mythology, perpetually in tears and particularly aggressive. In fact, the new Rainbow team defender carries 3 large bulletproof prisms in his inventory, which he can hook to any type of flat surface (both vertical and horizontal). These gadgets generate constant walls of sound between 18 and 19 Hz, capable of destabilizing and significantly slowing down opponents within the range (which at the moment even extends to 6 meters, but for which it has already been announced an upcoming nerf that will reduce it to 4 meters). If there are obstacles or partitions between the attacker and the device, the propagation of the sonic wall stops. Furthermore, the ~cry~ emitted by the Banshees can also be heard in the rooms adjacent to the action point, in order to alert anyone within range. This is a particularly convenient unique skill since it does not require any manual control (after the placement of the devices) and which, therefore, allows Melusi to take full advantage of his roamer qualities, including the 3 speed points (and 1 armor ). It's surprising to think that the last defender so fast was introduced 2 years ago with the Italian Alibi! Sonic Defense, however, requires a certain level of attention since, although the bullets don't even scratch it, explosives and, even, melee rounds can get rid of it in moments. Thandiwe must be ready to step in at any moment to gain the massive advantage over attackers affected by her gadget's effect. Finally, Thatcher's EMPs and Twitch's Shock Drones can temporarily disable the Banshees. In the new operator's equipment, we find Lesion's T-5 SMG and Frost's Super 90, both excellent alternatives for the role played by Melusi. Also in this case there is a single secondary weapon: it is the RG15, already in the equipment of the Polish sisters. On the secondary gadgets there was initially a bit of indecision, as it was presented to us with the Impact Grenades and the Mobile Shield but, at the time of the launch of the new season, the latter was replaced by the C4. The reason behind this last-minute change is to be found in the great annoyance that the presence of an additional gadget to be destroyed with explosives could have created for attackers. This place smells like home As Operation Steel Wave approaches, every Siege 'veteran' has taken one last look at the map that has been the bulwark of this strategic shooter. From the E3 2014 reveal (albeit CGI), through the early beta builds, to the game's launch in December 2015, Home has been THE map in Rainbow Six Siege. The passage of time and the introduction of new mechanics and operators has led the game's meta to change over and over again, to the point of making certain settings and structures obsolete. Over the last few years, Ubisoft has proposed various reworkings - some more, some less successful - of specific maps and with the new DLC the time has also come for Casa. But was there really a need? Answering this question is not at all simple. The original map was anything but competitive: unthinkable to make it available in pools other than casual ones... impossible to have it in ranked. From here to say, however, that the map was ~annoying~ in free - now they are called quick games, but we are fond of the term ~free~ - or that it was ~uncomfortable~ for training in the training camp ... there are some wants! Everything would have been more linear, therefore, if the reworked model proposed by the development teamhad been created with a view to use in different scenarios, such as those of ranked or even competitive (a return to the top league, after years and years, would have been epic). If, however, despite the particularly captivating restructuring, the map remains confined to the playlists in which it already appeared, it becomes natural to ask once again: was it really needed? The building is certainly larger, much more in line with the requirements of the current Rainbow Six Siege, thanks to painstaking and successful work, but unfortunately still too far from being a valid option in the ranked. At this point it seems really strange to think that the development team has invested so much energy in a rework that it does not seem to have changed the status quo ante in any way. We therefore hope that Ubisoft's future plans include some project capable of restoring new dignity to a reworked but currently not very useful map. The buff and gadget you expect Ubisoft never skimps on introducing those tricks aimed at balancing the game and improving certain aspects. It is therefore not surprising that several months after his release, Amaru finally received some ~love~. The Operation Ember Rise striker, since her arrival, has never been able to perform really well. The Hook Garra, although conceptually interesting, was exaggeratedly cumbersome. In the new update, the fluidity of the animations and the speed of the whole process have been smoothed, in order to make the operator much more unpredictable and silent. The barricades of the windows now shatter into a thousand pieces only upon impact with Amaru's body - before the buff it was his modified grappling hook that destroyed them as soon as it was hooked - thus allowing more sudden and, certainly, scenic entrances. There is also an important improvement in the interaction with the non-reinforced trap doors: it is no longer necessary to destroy them before being able to use the operator's gadget, it is possible to break in simply by exploiting the power of the attacker's unique ability. If we had any inkling about the buff coming to the Peruvian, in the case of the new secondary gadget supplied to defenders there was absolute certainty. Already during the last Six Invitational, with enormous pride on the part of the developers, the teaser that presented the Proximity Alarm had sparked a riot of enthusiastic applause. We finally had the opportunity to try it first on the test servers and then in the final version of Operation Steel Wave and we were fascinated by it. It is a very small, but particularly bright device that peeks out in the equipment of 8 operators - Castle, Caveira, Goyo, Rook, Wamai, Tachanka, Mira and Oryx - plus the Grunt. Each of these defenders can deploy two really quickly, as these gadgets stick to any surface. Operation is very simple: as soon as an attacker passes within its range, the alarm is activated and emits a sound that anyone can hear. The trick is to place it in hidden corners that are difficult to reach by gunshots or explosions. State of the servers It is necessary to devote a small parenthesis to this topic. Although - as also underlined at the beginning - the difficulties of the last few months in any working environment have been evident (due to the limits imposed by this particular emergency situation), starting the season on the right foot, after a truly disastrous closure of that earlier, it would have been a must. Unfortunately, however, especially in the first few days and - according to the latest official press releases - particularly here in Europe, the servers did not handle the large number of users to manage. It took days and days before we had concrete answers from the development team and, only now, it seems that the situation is slowly recovering. If the saying ~well begun is half done~ applies, we just have to hope that this season can take a totally different turn and that we will be able, in time, to make a sharp U-turn to take the the right direction.", "date": "2020-06-27", "grade": "7.8"}