{"name": "Dungeons 3 Complete Edition", "ref": "https://multiplayer.it/recensioni/dungeons-3-recensione.html", "text": "We imagine that it will be strange for someone to read a review of Dungeons 3 today, since we are talking about a game released in 2017. The reason is very simple: we managed to get our hands on the full version with all the DLCs and, since we liked it very much, we decided to make it known to the world. We're joking, but not too much, given that the latest DLC released by Realmforge, the development studio, actually dates back to a few weeks ago. The Dungeons series was born as a spiritual heir to that Dungeon Keeper, of which it has kept the formula almost intact for the first two chapters. With the third, however, the developers wanted to try to take a leap forward, emancipating themselves from the original model. The dungeon building and defense part remained, but it was hybridized with strong real-time strategy elements. So now you don't just manage the dark and musty dungeons in all their aspects, but you also have to conquer what is above them, facing face to face those who want to prevent us from making our evil empire prosper. Contents Speaking of content, the complete Dungeons 3 package is really impressive. Consider that it currently offers the main campaign, included in the base game, plus six extra campaigns, one for each DLC, plus three large sandbox maps, added with the final DLC. To all this of any deity that comes to mind, the skirmish mode and the online must be added, for a number of hours of play that goes over fifty, without of course considering the high replayability of the campaigns and the individual maps, which can be tackled at different levels of difficulty. Of course, the content alone is not enough to justify the excitement. For a bad game to last a hundred hours is a defect, not a merit. Luckily that's not the case with Dungeons 3. Dungeon gameplay The main campaign of Dungeons 3 tells of Thalya, a dark elf converted to good by her stepfather, who in the first mission we will rediscover the taste for free massacres and total destruction. The game begins with the approach of our shadow avatar to what will become our first heroine. Once conquered his soul we can start building our first dungeon. As in past episodes we will have to dig tunnels, create rooms, look for hidden resources in the subsoil, face the unfriendly creatures that inevitably populate it, create troops and satisfy them with housing and food, make our domain evolve in size and technology, so as to have ever stronger troops, and manage our minions in such a way that they are always active. From time to time human heroes will enter the dungeon with the intention of destroying its central core, thus putting an end to our power. To stop them we will be able to count on the hired units and the traps with which we will fill the passage points (gates, spikes, boulders and so on). As we progress through the missions we will also develop the power to cast spells against attackers. For example, we will be able to place mana bombs, or summon a shower of meteorites, or we will still be able to freeze them. Everything is permitted. RTS gameplay So far we have talked about Dungeons 3 which mimics Dungeon Keeper (very well, to be honest), but as we mentioned there is also Dungeons 3 which looks at real-time strategy games, in particular at the Warcraft 3 model, of which it also follows the graphic style. When we have accumulated enough troops and we feel confident in our strength, we will be able to select some of them and send them to the outside world, where they will have to work towards the achievement of some pre-established objectives, indicated by icons or in the description of the current missions. Generally we will have to conquer power points, which we will need to collect the evil energy that is needed to advance the dungeon, or we will have to destroy strategic buildings or, again, kill key characters. This section, which works in continuity with the management one, is played exactly as you would expect from any RTS: select the troops and send them around by clicking on the destination points, exterminating the humans and all the other creatures you meet on the street. The best part of Dungeons 3 is that it works perfectly and once you get used to the unit selection system, which is not very clear, and to the narrator's lines, sometimes nice, others a little less, you find yourself playing without stop for hours and hours, grinding one map after another. We honestly never hoped that the hybrid formula chosen for the gameplay would work so well, but evidently the guys at Realmforge Studios have talent to spare. Comprate it without delay.", "date": "2020-06-26", "grade": "8.8"}