{"name": "Endurance - Space Action", "ref": "https://multiplayer.it/recensioni/endurance-space-action-recensione.html", "text": "In engaging with the review of Endurance - Space Action, the desire of the author of the game to represent on the screen atmospheres close to those of the classic Alien Breed, as well as of course the Alien film saga, is clearly perceived. The setting is in fact that of a space station suddenly hit by a virus that transforms its occupants into ferocious assassins. After choosing our character among those available, all with different characteristics in terms of speed, resistance and resilience, we will therefore find ourselves exploring long corridors and rooms almost always full of enemies, which in the early stages of the game we will be forced to fight with our bare hands: a decidedly risky approach, given that for each blow inflicted we will suffer as many, seeing our vital energy drop very quickly. Freemium model Prequel to a previous project by Ivan Panasenko that boasts its own niche of enthusiasts, Ailment, Endurance - Space Action puts us to the test before handing us a firearm, a factor that revolutionizes the experience by finally introducing the shooter mechanics that characterize the game. The problem is precisely that long interval of time before taking up a rifle, which could be fatal for your desire to continue the adventure. Beyond a highly approximate melee combat system, in fact, the exaggerated difficulty of the experience ( thankfully adjustable downwards from the options) seems to wink at the huge amount of advertising present in the title. Any relevant action is accompanied by a short trailer, while to recover some energy in the absence of credits, the promotional film lasts 30 seconds. The absurd thing is that by spending the 2.29 euros needed to remove the ads, you end up being penalized, given that from that moment it is no longer possible to resort to free treatment for the character. Gameplay Endurance - Space Action is an RPG with a three-quarter top view, in which as mentioned we will have to explore the corridors of a space station in the middle of a dangerous infection that is driving all its occupants crazy. By acting on an invisible virtual analog stick, located on the left side of the screen, we will be able to move quickly within the setting and interact with terminals, crates or lockers respectively to open doors and look for resources. The latter can be medical kits, credits or weapons, but as mentioned for the latter it will be necessary to wait several interminable minutes. If in fact with a weapon in hand, however consumable, the game takes on the connotations of a fairly pleasant shooter, albeit too simplistic in the mechanics due to the automatic aim, fighting with bare hands immediately turns out to be a really annoying experience , in which a lot of life energy is lost because it is really difficult to land a blow without enemies damaging us. The presence of abundant empty compartments also undermines the exploratory factor, given that more often than not we struggle to sift through each room without getting anything in return. Technical realization Net of the doubts about the freemium model adopted for Endurance - Space Action, which as mentioned seems to focus on the high difficulty of the game to push us to carry out microtransactions, there is no doubt that this space adventure can count on a fascinating narrative base, on beautiful atmospheres and pixel art graphics that are almost always convincing. The characters have in fact a good design and decent animations, with an abundance of gore perhaps even exaggerated compared to the actual action on the screen. The problem lies in the inevitable repetitiveness of the scenarios, which reproduce the same assets again and again in the traditional representation of a space station, as well as in the bizarre solution adopted for aiming the weapons, which ~rotate~ in the hands of the characters to justify the automatic aim, creating an effect that is not exactly beautiful to see. Furthermore, the sound sector seemed to us a little too essential compared to the narrative intentions.", "date": "2020-06-25", "grade": "6.0"}