{"name": "Assetto corsa Competizione", "ref": "https://multiplayer.it/recensioni/assetto-corsa-competizione-recensione-console.html", "text": "The panorama of simulation racing games has always been a sort of masonry. A closed club of hardcore gamers and motor fanatics, demanding people and perfectionists in the world of track racing. Kunos simulations, an all-Italian pride, has been able to bring its title to consoles almost 1:1, a big and big game that will make happy all those who have not been able to play it on PC. In the review of Assetto Corsa Competizione for consoles we will explain the reasons why we believe that he did a great job. As emerged from a recent interview, the Italian development studio had to be supported for more than a few months by the guys from d3t Ltd to optimize the game developed in Unreal Engine 4, not exactly the best for racing games. This period necessary to perfect this porting has been amply repaid by the final result. More ~console friendly~ menu and much fresher and simpler user experience, while maintaining the myriad of settings and settings typical of simulators. For the uninitiated, the vehicles used in the race are Gran Turismo cars specially modified to comply with the parameters dictated by the GT3 federation. They range from Ferrari to Lamborghini via Aston Martin, Porsche and other prestigious brands. Among other things, Italian riders have been on the crest of the wave for a few years, for example the good Mirko Bortolotti, winner of the 2017 Sprint and Endurance championship, who is also the face that will accompany us in the career mode. When it comes to Sprint and Endurance, a distinction must be made between two different championships in which the same teams and the same riders participate. The Sprint championship is based on the classic formula of points for the best of 2 races per circuit. This means that everyone carries out 2 races on the same track and the best placement between the races is the one taken into consideration for the final classification. The endurance one, on the other hand, deals with long-lasting races, which can go from 4 to 24 hours, during which the riders take turns to be able to bring home the result. In Assetto Corsa Competizione you can compete in both championships and try to become the new world champions of the GT3 championship. Game mode Now let's talk about the quantity of supply in the title. A clean and simple menu puts us in front of 5 main blocks from which we can choose the mode we intend to tackle. They range from single player to multiplayer, up to Career through special events and the inevitable championships. In single player mode we will have the possibility to choose the type of event to be able to face, such as the fast lap or the endurance, with the possibility of being able to choose the duration. The amount of customization of the experience is perceptible and profound even from the simple choice of game mode. You can opt for different weather conditions, therefore sunny or rainy, not to mention the more welcome option which gives you the possibility to choose the departure time and then let us compete with the dynamic timetable, so that if we virtually start playing at 5 in the afternoon slowly during the race the sunset and the evening will arrive, ending the race at night with all the light effects of the case, which is truly remarkable and of strong impact, net of a slightly ~jerky~ sun. In Career mode however, as mentioned before, we will have the opportunity to participate in the GT3 championship starting from the basics with a sort of tutorial of tests in different conditions, with which the game will decide the recommended difficulty and will associate certain cars instead of others, depending on depending on the results obtained. All seasoned with detailed explanations on what to do by the champion Mirko Bortolotti, who will accompany us for the entire duration of the career. In the championship we will already be able to choose between all the teams and drivers, divided by skill levels ranging from bronze to platinum , to be able to face all the races of the GT3 championships. The special events were not yet available at the time of the test but we think they could refer to some customized online championship or endurance races with predefined circuits and cars, or even some one-make races. This mode is yet to be discovered. Finally, the multiplayer is just what you expect. Once you have chosen the track, the car and the driver, you are thrown into the qualifying fray to then set the best time possible and start in the most favorable position in the immediately following race. All really simple and intuitive, without frills or menus to sift through. Playstation trophies4 There are a total of 41 trophies for Assetto Corsa Competizione, of which 22 bronze, 15 silver, 3 gold and the coveted platinum. They are all quite simple to obtain and related to achievements that you will get by simply running and completing the various modes. There are just a couple of more difficult ones like reaching the platinum category (very long) or getting the 99 constancy rating in a race. Not indifferent realism From the gameplay point of view we are faced with a little gem that will surely make all fans happy. Before each race we can go through the setup of our vehicle, finding ourselves faced with a flood of settings and settings to customize the driving experience. You can go and change the individual tyres, the aerodynamics, including the front and rear ground clearance, balancing, convergence, the control units as well as the amount of fuel and so on and so forth. Even a small tweak to any of the settings is noticeable during the competition. The developers come to our aid, giving us the possibility of being able to choose between 3 predefined settings. Not to mention the substantial difference in driving and settings between the dry and wet circuits. Once you get off the track you are faced with a remarkable glance. The guys from Kunos Simulazioni have done an excellent porting job reaching 30 fps steadily and giving a very good general cleaning to the image, even in the most agitated situations. The only small drawback in terms of graphics is the interior of the passenger compartment which is not at the level of the rest of the production, as regards materials used and lighting effects. The steering wheels, on the other hand, in all their variants, are faithfully reproduced with the myriad of buttons and lights available. The feeling of the force feedback is firm and consistent, with the possibility of also customizing the settings of the controller or the steering wheel to adapt them to ours. From the point of view of the variation of driving sensations we are instead facing a masterpiece. We are of the opinion that a smaller number of cars has given the developers the opportunity to focus on micro-differences and thus be able to offer different dynamics to the perception of driving depending on the vehicle chosen. Getting behind the wheel of a Lamborghini gt3 Evo or a Ferrari 488 GT3 Easy Race is such a different experience that it seems to be dealing with two different games, the driving feedback is so personalized. Another applause detail are the variable weather conditions. We can take our hats off to the care with which the team has reproduced the weather and lighting changes dynamically, making for total immersion. Thanks also to a truly interesting glance, it is possible to appreciate all those small details that make up a real race such as the braking points that remain visible on the track, the public behind the fences or the imperfections of the road surface given by the outside track. The driving dynamics are strongly influenced by another interesting detail, which perhaps most of all goes to smooth out the realistic experience that Assetto Corsa Competizione offers us. We're talking about car damage. Colliding with those in front of you, taking a corner that's too tight and ending up on a hump, going off the track or hitting a curb, all have an impact on the car. In our tests we have come to have falling parts of the hull and uncontrollable steering due to the amount of damage received, finding ourselves forced to stop in the pits to restore them. Realism that is also emphasized by the voice of our team manager who informs us, in fact almost always with the same phrases, the presence or absence of nearby vehicles. In this regard, we can also include the presence of a radar in the central part of the screen which also indicates the position of rival cars in our vicinity. The audio sector is another of the strengths of the production. Any rumble can be traced back to this or that car. The sound of the wheels on gravel or sand, the creaking of the wheels during braking, the sound of the rain but also and above all the rock soundtrack contribute to the total immersion effect, especially with a medium-high range headset. During the races at the top right of our screen we will have objectives that we can achieve that will give us medals. This will allow us to unlock various things, including particular modifications or blocked tracks. In addition to getting these medals, the indicators will help us keep an eye on the progress of our race. The most important is what the feedback offers usk of each curve giving us a sort of evaluation from red to green, passing through yellow and orange. For example, if during a lap we see that we have tackled a curve too aggressively, we can thus prepare ourselves to change speed or trajectory to have a higher evaluation and thus improve the total lap time. In addition to these indicators, we also have the condition of the tires and brakes, speed and gears, a track locator, race positioning and race time on the screen. Also note the obviously use of the official graphics of the championship that will accompany us for the entire duration of the game. Ultimately Assetto Corsa Competizione is the complete game for anyone who is passionate about the GT3 championship or in any case any player whose heart is on 4 wheels. Of course we are always talking about an official licensed product, which has the limitations of the case, but certainly has very few rivals (if any) in its genre that can keep up with it. The only question mark we have left is that phantom Special Events mode that is totally empty at the moment, and which we reserve the right to try as soon as it is available, so that we can have a complete picture of the game offer. The audio, the graphic sector and the great care with which the cars and the driving experience are differentiated make the title a simulation as close to reality as possible.", "date": "2020-06-23", "grade": "8.5"}