{"name": "Burnout Paradise Remastered", "ref": "https://multiplayer.it/recensioni/burnout-paradise-remastered-recensione-nintendo-switch.html", "text": "Burnout is one of those IPs that in the end everyone is missing a bit. The old Criterion series was among the great forerunners of open-world arcade racing games, from which the Forza Horizon by Playground Games, now undisputed masterpieces, also sprang. Anyone who has a few years behind them, however, remembers the arrival of Burnout Paradise more than ten years ago, able to break everything and bring a breath of fresh air to a genre that hardly found its way anymore. A huge city at the time, hundreds of different activities, an insane amount of vehicles and almost infinite replayability represented the key ingredients of an adventure that left its mark. Two years ago EA re-proposed the remastered on current generation consoles and only now comes the port for Nintendo Switch. We tried it, tested it, put it under the pressure and we are ready to tell you what we think in this review of Burnout Paradise Remastered. Paradise City The name chosen for the city that forms the backdrop to the last chapter of Burnout is so phoned that it generated a satisfied smile when the game was first started. Impossible to forget the notes of Paradise City by Guns 'n' Roses, with the unmistakable voice of Axl Rose, fused with the unbearable voice of the DJ who narrates our adventure. Unlike what now happens in a title like the aforementioned Forza Horizon, Burnout Paradise reduced the intro to the bone, avoiding getting lost in trivial elements and immediately throwing us into the fray at the wheel of a half-destroyed racing car, but still capable of whizzing on the hot asphalt of the city. Practically non-existent narration, minimalist menus (even too much) and mediocre customization even today leave room for a game with a very high adrenaline and fun rate. Winning the races and events available in the city allows you to acquire licenses of increasingly higher levels, thus unlocking new events and new cars, basing all the sense of progression on these basic elements. Unfortunately that same progression is miserably lost due to a sufficiently crazy choice, linked to the presence of the myriad of vehicles added with the DLC (we are talking about packages of special cars, toy cars, some extraordinary cinematic cameos and even two-wheeled vehicles) which however, unlike the cars in the base game, in this remastered they are unlocked immediately, making growth essentially non-existent. It could be said that this is an element that counts just enough in a direct title like Burnout Paradise, but to us, even after two years, it still doesn't convince. The immediacy of the game system is so functional that it is still capable today to give pure fun, marred only and exclusively by the lack of elements that we now consider standard, such as fast travel and a strong personalization of the vehicles. Constantly moving along kilometers and kilometers of already seen and revised roads, net of a map that is certainly not huge as it happens today, can only generate a few moments of frustration, which however are immediately absorbed by events at breakneck speed. It is on this that Burnout Paradise still amazed us today. Criterion's ability to convey a sense of speed and adrenaline has always had few equals in the industry. Running around the streets of Paradise City, loading the turbo and unloading it by pressing a simple button, as well as ram and activate the bullet time camera of the accidents, have always been elements that distinguish an immortal series and which, since the time of Burnout 3: Takedown, they made the difference between an average title and a really cool one. We could stupidly say that it is also about those ingredients for which we really cannot explain the death of the brand, capable of reaching a peak with the present Paradise, which however was never followed by a new chapter, leaving everyone with a slight sense of incompleteness. We would like the name to be dusted off, perhaps finding the keystone to make the right competition for Microsoft's cadet series, certainly aware of the titanic undertaking that this would require. On the other hand, Burnout Paradise was a pioneer, and for this reason it deserves at least a little trust from us. The Switch port Let's not hide the fear we had in having to launch this game on Nintendo Switch. It is true that we are talking about a title that is over ten years old and that we had recently praised a reissue like that of Bioshock. At the same time, however, the need for attention and the general sense of speed of Burnout, had us scared with regards to the holding of the frame rate.Fortunatamente we have to change our mind, having found in our hands a porting really done with all the trappings, despite an introductory price which, for the umpteenth time, appears totally off the market. We are talking about a title that can be taken home for very little change on PC, but which even bought on an official store requires just twenty euros, compared to the fifty required for the Switch version. It's really hard to justify such a cost which, as too often happens by now, ends up ruining the general evaluation of a work that could easily be compared to that of the other console versions. Obviously, for a matter of resolution and hardware specifications, it is preferable to play the title on the small integrated screen of the Nintendo flagship, so as to disguise some textures that are still not quite ~remastered~, but these are trifles that do not affect the sense of speed and fun , thanks above all to the 60fps. The only real new implementation remains the possibility of navigating the map with the touch of the fingers, not too comfortable or fundamental, but at least it testifies that it has not only been taken and transferred to Nintendo Switch. Everything in the norm for as far as the sound and almost no technical flaws are concerned, they are certainly an excellent business card, and it is possible to recommend it to the great fans of the genre and to those who still don't have enough of Burnout. Perhaps, also given the price above, all the others would do well to wait for a hypothetical replacement.", "date": "2020-06-20", "grade": "7.5"}