{"name": "Disintegration", "ref": "https://multiplayer.it/recensioni/disintegration-recensione.html", "text": "After a very long approach in which presentations behind closed doors, videoconferences, public and private betas have followed one another, the time has finally come to start writing the review of Disintegration, the first work of V1 Interactive, the Seattle studio founded by the legendary Halo creator and Master Chief, Marcus Lehto. If you've been following us for some time, the plot and features shouldn't hold any big surprises in store for you: the title is set in a dystopian future, in which man, following epidemics, wars and economic crises, has been forced to explant his brain inside resistant robotic bodies, waiting for a better future. What was supposed to be a simple transition phase turns into a real civil war between those who want to regain possession of the ancient appearance and those who believe that technological progress should not turn its gaze to the past. In Disintegration the player plays Romer Shoal, gravicycle pilot and spearhead of the Resistance, a group of outlaws who defend what remains of mankind from the ethnic cleansing implemented by the forces of Rayonne, whose leader sits the evil Black Shuck . Unedited structure The ~levitating motorcycle~ is the real key to understanding the V1 Interactive game: unlike what happens in traditional shooters, in Disintegration you can't rely only on your own firepower, but you have to take advantage of the privileged driving position to control the ground troops, in an unprecedented hybrid between FPS and RTS. The fear of an overly complicated control system is dispelled after a few minutes, because the controls, reduced to the bare minimum, are all easily reachable by fingers. We are not referring only to the mouse/keyboard combination that will be used by the master race; to make the classic litmus test we relied on the Xbox 360 joypad and the results were more than satisfactory. The mix designed by Lehto and his team works well, especially in single player. The player plays an active role in battle, engaging enemies with one of the two main weapons equipping the gravicycle; however mobility, artillery and resistance are completely inadequate to think of exterminating the opposing hordes without the help of land units. The latter are mainly governed by a good artificial intelligence: you just need to indicate the point to reach or the enemy on which to concentrate fire and the CPU will take care of everything else, without annoying pathfinding problems. Depending on the mission, two, three or four can be controlled; each has a specific ability which, once selected, slows down time to allow you to precisely choose the area in which to use it. The greatest effectiveness is achieved by combining them: for example, first launching a field that slows the enemies inside it and then unloading a mortar barrage into it. Explained in this way, the gameplay of Disintegration might appear cumbersome, instead it reveals itself to be immediate and fluid, thanks to a streamlined and intuitive user interface. The result is exciting battles, challenging and not too frenetic, but equally free from dead moments. Rhythm is the essential key to getting the better of the enemies, whose degree of challenge becomes demanding starting from the third of the four difficulty levels; using the gravicycle's limited propulsive thrust at the right moment, coordinating fire on enemies and orchestrating special attacks are the techniques to master to get the better of the computer. We can conclude by promoting the freshness of the Disintegration combat system, in which we have read a free inspiration to that of a MOBA or a Brutal Legend, with the belief that it will also inspire future productions; so let's see within which content offer it fits. Single player The greatest hopes were placed on the single-player campaign, both for the curriculum and for the promises that the lead designer had anticipated in the conference call that replaced the preview behind closed doors scheduled for March and canceled due to the health emergency. The narrative canvas, albeit with fragile premises, manages to entertain for the entire duration of the campaign (about a dozen hours), thanks above all to the excellent characterization of the characters. The initial skepticism about the charismatic potential of a group of robots (intrinsically unable to communicate through facial expressions) quickly gave way to the sympathy that Romer Shoal and his extravagant crew of renegades were able to convey both in the cut-scene (who has been entrusted with the burden of acting as a glue between the various levels) and during the missions themselves, where there is no shortage of irreverent jokes and double meanings which however never descend into vulgarity. A real trademark capable of overshadowing a certain repetitiveness of the game system that offers very little in addition to the combat phases which have already been discussed. Linear maps predict the journey from point A to point B; in the middle a considerable amount of ~red eyes~ (characteristic of the Rayonne armies) whose ranks are replenished by frequent aerial reinforcements. Along the way there are chests containing experience points and upgrade chips; there may be areas where respawn is continuous until a structure is destroyed or a certain amount of time passes; there are also some end-of-level bosses, but, in principle, there is not much else to do. The secondary missions provided by the companions to interact with in the shelter between one level and another mainly concern the fighting style (kill a certain number of enemies with the given weapon, avoid dying, complete the assignment in the set time) and therefore they do not add variety to the single player campaign offering which has a low replayability rate. Technique The level design manages to mask the repetitiveness of the action well: the maps are large enough (each mission takes about forty minutes to complete) and develop on the horizontal plane, limiting the vertical freedom of movement of the gravicycle. There are numerous well-masked invisible walls, although the path to the end of the map is linear in most cases. On a visual level, the universe of Disintegration closely resembles that of Marcus Lehto's previous works at Bungie, and we are not referring only to the physiognomy of the robots that look like the brothers of Destiny's exo race, but also to the settings, such as the city in ruins where nature is reclaiming its spaces or the destroyed highway that leads to a heliport. There is no shortage of less urban scenarios, for example the scrap yard in the desert or the green prairies of the North American valleys; there are also more closed locations such as the interior of an industrial complex or the base of a dam. In general, the realization is satisfactory (even if we would have expected more futuristic stylistic features, in line with the incredible technology that gave life to the protagonists), but pays the price to a thrifty technical sector in terms of details, despite the use of Unreal 4 engine. There are no characterizing elements capable of making certain maps memorable which therefore tend to look alike and the interaction with the environment is too limited. The physics engine deserves a pleasant mention, given that in the single player most of the buildings can be partially demolished with effects that are as scenic as ends in themselves: rarely, given the skimpy rate of fire, will we focus on the structures, nor is it possible order ground units to occupy or destroy them. The Rayonne forces are well characterized even if it is not always possible to appreciate the detail, considering the driving position. The title, apart from some small easily fixable bugs, was stable during our sessions: the maximum frame rate is also set on PC at 60 frames per second, a limit that our reference system managed to reach, at the maximum level of the detail, up to 3440x1440 resolution (Ultra-wide screen). Speaking of audio, neither the soundtrack nor the effects of explosions and weapons seemed out of the ordinary, but the dubbing (in English only) proved to be up to the important task entrusted to it by the screenwriters, with actors they are perfectly placed in the part so as to make the robotic bodies of Romer and his companions ~alive~. Multiplayer The idea behind the multiplayer is interesting, as there are nine 'crews', each equipped with specific gravicycles and soldiers, some of which are introduced in the single player campaign. We will therefore find the tank team slow but with a great ability to absorb damage, as well as that of sentinels, fast but fragile. In between a commendable number of combinations that can satisfy most fighting styles. There are currently three modes: Zone Control (self-explanatory); Collection, where to score points you have to collect the case containing the brain from the carcasses of killed enemies; Recovery, which is a kind of capture the flag. The challengers always face each other in two groups of five; based on the objectives obtained during a match, de are obtainedthe points with which to aesthetically customize bikes and clothing, while at the moment there are no rankings (but there should be seasonal events). If the premises seem interesting, in the transition from theory to practice the combat system of Disintegration is watered down for a couple of reasons in particular. The first, and fundamental, is that the focus of the battle is completely shifted to the gravicycles: while in the single player the Rayonne motorcycles rarely appear and most of the firepower is concentrated on the myriad of land units, in the online competitive the main target is represented by the adversary in flesh and blood. The frenzy of the clashes ends up mistreating the ground troops who are obviously ~weakened~ by the slowdown of time present in the single player from the start. In summary, the critical position we had taken after testing the technical beta at the end of January has not changed, despite some tangible marginal improvements related to the interface.", "date": "2020-06-10", "grade": "7.0"}