{"name": "Project Warlock", "ref": "https://multiplayer.it/recensioni/project-warlock-recensione.html", "text": "To enjoy, discuss or even develop a video game whose genre dates back to a past generation, is it necessary to have experienced that period firsthand? The answer to this question will give you the review of Project Warlock, a first-person shooter that pays homage to the shooters of the 90s: what makes it special is the fact that it was created at the time (four years ago) by Jakub Cislo, an eighteen year old raised on bread and classic games by his father. As told by himself during an interview, his peers had no idea of those titles to which he, on the other hand, had been educated: if they played something modern, Jakub thought of the past, of those shooters like Doom, Heretic , Hexen, Blood and many others. Thus was born the idea of making a game intended to pay homage to these old school FPS, combining the aesthetics and level design of the classic id Software with some small improvements of contemporary games. Alone, Jakub started a fundraiser on Kickstarter calling his project Exitium 3D: the campaign was successful and, despite the numerous criticisms collected, he did not give up and continued to improve the prototype by changing the name to Cataclysm 3D. In 2017 the game moved to Steam Greenlight and the moderate success achieved allowed Jakub to set up a small team, Buckshot Software, which further improved the project by transforming it definitively into Project Warlock and thus attracting the attention of the publisher Gaming Company . His PC debut was generally well received, proving to be truly the love letter that a boy far from that gaming period wanted to write, inspired by his father's ~teachings~. Today, two years later, we are ready to welcome him on consoles too - PlayStation 4, in this specific case - to spend a few hours in an authentic hellish massacre. Demons to slaughter Regarding the plot, Project Warlock sticks to the words of John Carmack according to which - speaking of Doom - ~the story in a video game is like the story in a porn movie. You expect to find it but it's not that important~. Now, we know very well that it is not a maxim to be applied to every video game, but in this case it is not only spot on but also coherent: we do not expect narrative sophisms from this title, we just need to know who we are (a warlock), what we must do (slaughter demons) and what is the most brutal and effective way to do it (there is no shortage of arsenal). Punto e a capo.Il massacre of our grunted protagonist lasts for five episodes, each consisting of different levels in turn divided into several segments. Unlike many FPS, saving takes place automatically every time we complete a segment of the game and each episode ends with a boss fight, during which we will have to use all our skills to ensure that the giant demon on duty ends up at look at the flowers from the root side. To spice up the action is the fact that dying starts all over again and if you want to be casual in the situation, it shouldn't worry you too much because your lives are unlimited. If, on the other hand, you want to switch to normal difficulty, get ready to resurrect a certain number of times and, in the event of even more difficult challenges, to lose all the progress accumulated up to that moment. Project Warlock can be played by anyone but above all it is an open provocation to the most experienced players of old school FPS, ready to put you to the test to see what you're made of. That's not all: each episode also boasts a different setting, from the initial medieval castle passing through Egypt and finally reaching a chat with the king of the underworld himself - a variety that is among its strengths, because there's always something new around the corner and the shadow of repetitiveness is far away. FPS and a pinch of RPG Defining Project Warlock a Doom-like is not an end in itself: the pixelated graphics, the range of weapons with which to make the whole demonic parterre go through a bad quarter of an hour, the frenetic gameplay and the plethora of sneakily hidden secrets will make your senses, yet Project Warlock still manages to create its own identity. A crucial role in this minimal but heartfelt diversification is the choice to insert light RPG elements through the level increase and the consequent progression of the character. These are very simple steps but with their weight on the gameplay economy: to level up you simply need to kill demons and collect treasures along the way but the different skill points to be distributed require access to the Workshop. You can go there at any moment from the game menu, or be patient and wait after completing a certain number of levels. Once there you can evaluate how to grow your warlock in terms of stats, skills, weapon upgrades and spell acquisition (for which it is however necessary to find the relative books scattered throughout the game): in its already specified simplicity, we have a Captivating progression system to customize your playstyle. Do you think firearms are a ~pussies~ thing, compared to good old hand-to-hand combat? No worries, focus on melee and damage resistance is what you need. Each approach has its own small solution and, as far as weapons are concerned, greed is also put a stop to it: in fact, you can only choose one of the two available upgrades, the other will be blocked as soon as you decide. Furthermore, weapons and spells share upgrade points so you are once again called upon to make a choice on which direction to take, unaware of what awaits you in the next level. Impressive level design The level design of Project Warlock is clearly of the early 90s mold but it is completely flat, without increases of any kind: a premise that could make you think badly, if Buckshot Software hadn't made this limitation the best tool to give life to some incredible mazes - the reason why, as mentioned before, the game does not fall into repetitiveness. If we take the models that inspired the team, such as Wolfenstein 3D, there is a certain redundancy that Project Warlock does not present thanks to a strong variety in the settings and in the construction of the individual segments. While remaining on a single level, the solutions adopted are designed to guide you towards the goal (and thus compensate for the lack of a complete map that can be consulted to better understand where to go): for example, take a key or activate a button could open a new path, or call enemies where the dismembered bodies of your victims were previously, thus offering you an indication on where to continue. It must however be said that the extension of the levels is not such as to risk getting lost, at the more than feeling a little confused in case you want to be a completionist and look for every single hidden secret. In this maze of corridors and enemies that sprout like mushrooms, the fight is driven by an underlying frenzy which, however, is hindered by the weapon wheel: changing weapons, especially in the most agitated phases, can be annoying and in a hurry it is not uncommon to make a wrong selection and having to settle in order not to waste any more precious time. Beyond this, the variety of enemies (whose appearance is not only neat but also refers to a vague cartoonish style) and their equally different behavior makes each fight engaging. To crown it all there is a worthy soundtrack, which once again draws inspiration from the works of id Software proposing a range of themes ranging from metal, to melodic rock to an almost spiritual atmosphere: the perfect accompaniment for our massacres demonic.", "date": "2020-06-09", "grade": "8.0"}