{"name": "XCOM 2 Collection per Nintendo Switch", "ref": "https://multiplayer.it/recensioni/xcom-2-collection-per-nintendo-switch-recensione.html", "text": "It's time to close the loop of 2K ports on Switch. Difficult to write the review of XCOM 2 Collection for the semi-portable Nintendo without mentioning once again the incredible work of Firaxis with XCOM 2 before and War of the Chosen after. Pioneers and forerunners of an approach to the genre practically coined by them and brought into vogue, come back to it after stripping the equally great Made in Italy work of Soliani&Co. with Mario+Rabbids: Kingdom Battle - inspired by them - is even more satisfying because it demonstrates what this franchise still represents today. Difficult, brutal, iconic, merciless but profound, fun, reflective: the XCOM 2 formula arrives on Switch condensing its legacy into a double offer, in which it is not surprising how the initial screen places the base game in second choice and the version first revised, corrected and expanded. Rebel Pioneers A short time ago we read about how thrilled Virtuos was in being able to convert any game, therefore extremely convinced of its means of porting to Switch. An exceptional signal, demonstrating how portability has won its challenge on console technology, considered by many - often without expertise and rumors about it - too weak to handle great titles. In our hands we hold another exponent to add to the list of technical miracles: XCOM 2 was and is a technical boulder of sensational heaviness. For the sake of conscientiousness we put the PC version back on a 1080Ti and dammit how much it weighs. Thinking some time ago of seeing this Collection on Switch seemed like a joke, but the installed hardware weighs (and attracts) much more than the Firaxis graphics engine, a sign that it was time to enrich the library with a new, powerful strategic pearl. The plot of XCOM 2 remains current, strong in a rebellious charm against the alien occupation that has taken it easy on those who appreciate the foundations of sci-fi fiction but not only: the very Fire Emblem characteristic of permadeath adds that quid of anxiety in the non wanting to see your soldiers die in battle, perhaps the very ones you are most fond of. We have therefore set the table with a good story, a great depth of development of classes, weapons and situations, a flexible but merciless game system, a crazy amount of content, an engaging and well-studied flow of gameplay: for those who have never played XCOM 2 or expansion it would be enough to read up to here to run and buy this port, and the truth is that the sum of the parts overwhelms the technical problems of this conversion, which, although with precise choices at the base, remains a technical miracle and already alone for this he deserves a long round of applause. Convert XCOM 2? Bringing Firaxis episodes to Switch is not a challenge for everyone: Virtuos, as anticipated, follows in the wake of Panic Button and Saber Interactive and tries to take a seemingly impossible title to bring to Switch, succeeding very well. But then what is missing? Nothing really, but the experience as a whole is evident as it suffers in the foundations, but without creaking, everything is perfectly playable. We have a graphics sector decidedly scaled towards the minimum settings of the PC, a generally low texture resolution, few details on the screen, a general sense of tearing in many situations, not only the most agitated ones, tremendously dancer framerate. Of course, it is undeniable that playing the Collection on PC is, with sensible hardware, a smoother and softer experience, but Switch you can carry it around, PC cannot. It is evident how the most galvanizing element of the port is the portability of the console, given that in docked all the technical elements mentioned above strike less frequently but more harshly, precisely because the lowest common denominator becomes static, a point of parity in which Switch lose to competitors. If you have the kindness to embark on this journey, XCOM 2 and even more War of the Chosen will reward you with a title of a complex depth and care to be found elsewhere, now perfectly playable around. Another aspect where we would have appreciated a system - evidently not considered sufficiently capable of being worth the cost of its implementation - is the complete control via touch screen. Too bad, really: being able to detach the joycons and enjoy the strategy only via touch would have been the perfect panacea, but you also have to be satisfied every now and then.", "date": "2020-06-08", "grade": "8.0"}