{"name": "Borderlands Legendary Collection", "ref": "https://multiplayer.it/recensioni/borderlands-legendary-collection-recensione-nintendo-switch.html", "text": "The review of Borderlands Legendary Collection on Nintendo Switch completes a hat-trick that has literally invested the hybrid console of the Kyoto House with all its might in the last week. Together with the Bioshock saga and the more recent The Outer Worlds, in fact, Gearbox Software's first-person shooter has finally arrived for the first time ever on Nintendo Switch. With a package that, in fact, it would be possible to define only as ~Legendary~, naturally taking its cue from one of the most coveted rarities for the game weapons of the three titles included. How does Borderlands Legendary Collection perform on Nintendo Switch? How many and what content does it include? We will answer, among others, also these questions. The contents We often complain about the alleged exaggerated prices of porting to Nintendo Switch: titles that are most often ~old~ for several years, which come back to the fore with the original launch price. But it would hardly be possible to complain about the price of Borderlands Legendary Collection, keeping an eye on its contents. Of course, it is offered at 49.99 euros: but inside the package you will find Borderlands: Game of the Year Edition, Borderlands 2 and Borderlands: The Pre-Sequel, with all the relevant DLCs (except for Borderlands 2: Lilith and the battle for Sanctuary). Pretty much everything the franchise has to offer to date, apart from Borderlands 3 (arrived on PlayStation 4, Xbox One and PC last September 2019). Anyone who at the time had the opportunity to play one or more of these titles on other consoles or on PC knows well what the new buyer is facing on Nintendo Switch. Each one is in fact a world in itself, capable of offering at least thirty hours of play (and we are not considering online). The overall longevity of Borderlands Legendary Collection can therefore be around 100 hours, which in any case could increase if the player wants to explore everything that can be explored, eliminate everything that can be eliminated, collect all the collectibles. An all-encompassing experience, although obviously the weight of the years is affected in different ways. The first Borderlands dates back to 2009, while Borderlands 2 was released in 2012 and finally The Pre-Sequel in 2014: on balance, it is the debut chapter of the saga that appears today as the most woody and dated. Nothing excessive or that precludes the fun factor, but it is still worth remembering that this is a game from 11 years ago. We add that for the occasion neither Gearbox Software nor 2K Games have thought of surprises or unpublished contents of any kind: Borderlands Legendary Collection is therefore a pure porting, a recovery operation aimed mainly at those who have not had the full potential of the series, and who now probably wants to make it portable. The conversion to Nintendo Switch Borderlands Legendary Collection represents a new example of excellent porting, as we have already had the opportunity to underline in the review of Bioshock: the Collection in recent days. The conversion was carried out by Turn Me Up Games, a team that was thus able to underline its ability again. Obviously some sacrifices were necessary, but nothing particularly evident or transcendental; and in any case the Nintendo Switch hardware made it possible to exploit motion control as a partial balance. Now you can enjoy this additional feature in your favorite FPS: just activate it in the main game menu, at any time (even during the game). Returning to the graphic-technical sector, Borderlands Legendary Collection reaches 30 fps (almost always granite) both in portable mode and in TV mode (docked), with some resolution changes: 720p in the first case, 1080 in the second. It must also be said that the graphics and the artistic direction of the series, both immediately recognizable, in a certain way ~help~ the general glance, regardless of the mode in which you decide to play on Nintendo Switch. From time to time, some small details appeared out of place, especially during the Borderlands 2 sessions: imperfect game textures or that were slow to load in new environments, and enemies that sometimes ended up getting stuck in the walls. Nothing drastic or too frequent: after all, at least the second type of problem in the past also happened to us on other platforms. The purchase of Borderlands Legendary Collection could thus prove to be interesting for a large number of players. Those who once bought the titles of the series (or part of them) elsewhere, now have the opportunity to recover the entire franchise before dedicating themselves to Borderlands 3 (or after completing it, if you want), among other things on a console where it is possible to play it with two relevant innovations: first of all portability, and then the motion sensors. Fortunately, the developers have decided not to eliminate some essential aspects from the game versions, such as online and voice chat: the latter doesn't even need a dedicated app, you just need to connect a headset that has a microphone.", "date": "2020-06-07", "grade": "8.0"}