{"name": "Pro Cycling Manager 2020: la recensione", "ref": "https://multiplayer.it/recensioni/pro-cycling-manager-2020-recensione.html", "text": "The Pro Cycling Manager 2020 review arrives, like several others of its kind, in a very particular situation. All the more reason for a sports title, considering that cycling has also seen its activities stop suddenly to counter the Covid-19 pandemic. Most of the competitions that should have been held in this period have been postponed to the next few months, while some minor events of the 2020 UCI World Tour have even been cancelled. Famous races such as the Giro d'Italia, the Vuelta of Spain and the Tour de France will see the start (with due caution) between the end of summer and the beginning of autumn, effectively leaving cycling lovers speechless dry for a long time. The arrival of Pro Cycling Manager 2020 can therefore be seen both by fans of the discipline to which it is dedicated and by those of the managerial series developed by Cyanide Studio as a breath of normality, thanks to which to live on the own PC the season on two wheels in a virtual way as it should have been in reality. Before going to find out together what Pro Cycling Manager 2020 has in store for us this year, we remind you that the latter is traditionally accompanied by the Tour De France 2020, a slightly ~smoother~ version dedicated to PlayStation 4 and Xbox One in I arrive on the market today. But now enough idleness, let's start pedaling! The modalities: a career for all tastes If one of the most recent editions of Pro Cycling Manager appears in your videogame library, this one from 2020 will not reserve you any particular surprises in terms of alternatives offered to the player. The Armada mode similar to FIFA's Ultimate Team has been archived for years, the developers have continued on the double track on which the Career and Pro Cyclist modes travel. The two types of game allow the player to try his hand at a managerial career with an entire team or dedicated to a single cyclist, starting from a perfect stranger created ad hoc to take him to the Olympus of this sport. In our opinion, the Pro Cyclist mode represents the best entry point into Pro Cycling Manager 2020 for those unfamiliar with the dynamics of cycling: starting as the bottom of the hierarchy in a modest team, managing our alter ego will allow us to familiarize ourselves with the various figures that make up the world of racing on two wheels, also coming into contact with escape strategies and race management. By focusing on the individual's career, it is thus possible to face a slightly smoother learning curve, while still having fun defining the characteristics of one's cyclist through the points growth system already seen a year ago. If you are passionate about cycling or in any case you don't mind going through a slightly more difficult initial phase, you can instead start with the Career mode. However, the latter provides a series of tutorials with which to familiarize yourself with the basics with what are the two main components of the game: management via the menu and 3D racing. As for the first, the novelties of this 2020 edition concern a new design of the main dashboard, through which it is now possible to keep an eye on the most important aspects of the team more effectively, expanding some sections in just a few steps. As a good manager, Pro Cycling Manager 2020 offers the possibility of automating some aspects of one's work, including from this year also the planning of the races: month by month we have an assistant available who compiles the program for the following period, thus allowing us to gloss over an aspect that would otherwise require a lot of time and attention in managing the efforts of team members. Beyond some adjustments, the real novelty in the gameplay concerns the introduction of the morale of the cyclists, who now also react to events from a psychological point of view. For example, obtaining a good result can further fuel the state of form, while exclusion from the favorite race could slow down the cyclist's growth over the course of the season. To manage morale we would have liked to have been able to interact with the athletes as happens for example in Football Manager, in order to try to buffer negative situations through dialogue. To complete the picture of the available modes, we find the Single Race and the on track, with the latter divided into seven disciplines, and multiplayer, thanks to which you can create online tournaments for a total of sixteen players. Gameplay and graphics After the part where you unravel between sponsors, technical equipment and cyclists to please, it's time to get on the saddle and run.Also from this point of view Pro Cycling Manager 2020 looks similar to its predecessors, suffering like them from a certain heaviness in the loading phase that precedes the start of a race shown through the 3D engine. The alternative is to simulate the event to only view the final result, but in this way, especially in Pro Cyclist mode, you end up losing much of the fun. When we are in control of our career rider our goals will be provided to us throughout the ride. By following what is asked of us, it is possible to accumulate points to then spend in the growth tree, as well as satisfying the rest of the team and therefore being frowned upon. In Career mode, on the other hand, we have to take into account all our cyclists involved in the race, through the interface that allows us to give them attack commands, position maintenance, and so on. Among the innovations announced for the 3D engine, we actually noticed a greater propensity for gaps among cyclists, especially in the final uphill finish stages. In terms of graphics, Pro Cycling Manager 2020 looks very similar to that of its predecessors, with all due respect to those who expected a small or large renewal this year as well. We therefore find ourselves expressing the same judgment as a year ago, appreciating the view offered above all when using the more distant cameras, to instead go to detect the presence of improvable animations and other defects when tightening on cyclists. The public remains mostly motionless to watch the athletes go by and it's almost a good thing, because when it decides to ~move~ it does it in an awkward and decidedly not very credible way for a 2020 game. We understand very well that the graphic aspect is not one of the priorities for a managerial title, but after years an update also from this point of view is starting to become indispensable. Before concluding, let's take a look at the licenses present in Pro Cycling Manager 2020. The work done by Cyanide Studio to bring as many real names within the game it has undoubtedly borne fruit in recent years, especially for the most important teams where by now the shortcomings can be counted on the fingers of the hands. According to the latest details, some names and graphics should be integrated with a post-launch patch, but should you be dissatisfied with the standard offer, rest assured that fans will take care of filling the gaps via Steam Workshop.", "date": "2020-06-04", "grade": "6.0"}