{"name": "Skelattack", "ref": "https://multiplayer.it/recensioni/skelattack-la-recensione-su-playstation-4.html", "text": "The review of Skelattack for PlayStation 4 reminds us that, once in a while, the skeletons stop being the enemy of the protagonist to draw the public's attention to them. In reality, traces of the production of the Ukuza team had been lost, but the announcement dates back to at least 2016: initially it was supposed to arrive on PC in January 2018, then it was decided to postpone it by a few months aimed at preparing the console versions; eventually fell into oblivion. But waiting for him remained both the fans, who kept an eye on him ever since he showed his first steps in the various demos on PC, and a major publisher: Konami. And it is Konami who at the time of writing publishes it almost everywhere, on consoles and PCs. We have tried the PlayStation 4 version and are finally ready to share our very personal dungeon experience with you. Plot (no spoilers) PlayTonic Games' excellent Yooka-Laylee recently reminded the videogame world that there's only one thing more fun than one unlikely character: two unlikely characters. Here then is that the protagonists of Skelattack, in a quotation operation that is impossible to ignore, are a very nice skeleton and an equally sarcastic and prankster bat. Sure, maybe you were expecting the classic fully armed hero, or unarmed but still ready to collect weapons and magic around to annihilate the monsters of the dungeon: what a shame. The plot of Skelattack instead wants to tell an unpublished story, the parody of any self-respecting roguelike and dungeon crawler: because, apart from the dungeon itself and the game mechanics, the narrative context and the characters change drastically. This time the player plays the role of the skeleton and his funny companion; the enemies, on the other hand, are the invading human beings, who have raged against the dungeon for their shady plans and various exploratory ambitions. Skully then will first have to understand what they are looking for, secondly find a way to stop them before they endanger the world of skeletons. In addition to the originality of the narrative sector, in Skelattack it is also important to give the right attention to the personality of the protagonist, who, although he is a skeleton, shows in all respects anxieties, fears and ambitions typical of human beings. In another life, in fact, Skully was a warrior: but like all the undead he lost his memories once he arrived in the dungeon. His adventure begins on Remembrance Day: on the one hand he will have to stop the invaders, on the other recover his past. Gameplay: Part platformer, part roguelite At first glance Skelattack may seem like a carefree 2D platformer with cartoonish graphics, very captivating. But the sign positioned just before the first playing area, the sewers, should immediately raise some doubts: ~you died 0 times~, recites in the initial moments of the game; and immediately afterwards he adds, with an amused note from the developers: ~either you're incredibly good, or you've been playing for a short time~. The translation is ours, it should in fact be noted that Skelattack is completely in English in the texts on the screen, even in the menus. It is enough to master the basics of the language to understand what is happening in the plot, but at least an average mastery is necessary to fully enjoy the jokes and funny interludes. That platform is certainly one of the souls of Skelattack's gameplay: you jump from one more or less yielding platform to another, trying to reach treasures, avoiding enemies, sometimes risking falling and hitting objects that cause the protagonist's instant death . Instant death, in fact: the production published by Konami does not live on platform alone, which deep down still remains a roguelite, that is, one of those fairly bad titles in which you die many times before figuring out how the heck to complete a certain area, a level or a boss fight. Therefore, by virtue of this second roguelite soul, you will remain in the sewers for a long time, partly looking for the way out and partly because you are stuck near a particularly difficult passage. Skelattack doesn't always appear well balanced or gives its best from the point of view of level design: indeed, really easy and intuitive sequences often alternate, and others in which you die excessively. Frustrating passages thrown at random, it seems, in a less punitive context until then; in other situations, however, the player finds himself grappling with gusts of air that break a rhythm up to that extremely excited point. This mix sometimes shows obvious false notes: it should have been calibrated differentlybody. The lack of balance between one area and another, between one mechanic and another, between one situation and another, will immediately become apparent. Playstation 4 trophies As it was easy to guess, Skelattack also has a Platinum Trophy, but its goals are linked to the sadistic soul of the production. So get ready to exterminate enemy after enemy, to die very few times, to beat the bosses according to very specific conditions... and to add some truly precious trophies to your collection. Progression and difficulty Roguelites are usually considered difficult games, though not like their roguelike ancestors. Skelattack has a hard time finding its true nature: most of the time it seems undecided, unable to choose between the action platform suitable for everyone (at most a little stimulating), and the real roguelite. However, the progression is decidedly linear, and in truth it doesn't even rest on procedurally generated levels: you explore a certain game area, collect all the useful objects, solve some puzzles (a key useful for unlocking a door is the most frequent), finally you face the boss on duty. However, the collection of the game currency, the blue crystals, is worthy of the most infamous roguelites: every time you end up eliminated (and you finish it often) Skully leaves a good part of his inventory on the ground. If he dies again before retrieving it, it is lost forever. Here too the balance is not the best: the player sets aside a good amount of crystals, overcomes various difficulties, and just before meeting a shop where to spend them, he finds a very difficult passage, losing them all. Who wants to start the area all over again, to unlock upgrades that aren't even that useful after all? In fact, in Skelattack it is possible to find a checkpoint (blue lanterns) every two by three: they do not allow you to save the crystals, but they are enough to complete the adventure and advance. On this game structure, which required in-depth considerations, rest a very good combat system (Skully attacks and jumps, later he learns more refined moves, but in any case not essential), a system of spells and rose water magic, finally the usual power-ups and power-ups available from the blacksmith. We appreciated the presence of optional side missions, unlockable at certain points in the various game areas, all linked to equally secondary but still likeable characters. Finally, the artistic direction and the sound accompaniment of Skelattack do not shine, but they certainly represent some of the most successful aspects of the production: the style is pleasant, and the angular lines of environments and characters are well suited to the exploration of dungeons. Unfortunately, not even the character design shines, nor the illustrations of the enemies and most of the supporting characters show who knows what inventiveness or attention to detail, in the same way as the various levels of the rest.", "date": "2020-06-02", "grade": "6.8"}