{"name": "51 Worldwide Games", "ref": "https://multiplayer.it/recensioni/51-worldwide-games-recensione.html", "text": "Group digital casual game? Digestive pastime alone? Family holiday game? In this 51 Worldwide Games review we will try to clarify what you can expect from the extravagant playful collection for Nintendo Switch; for now we can anticipate that it is a mix without huge peaks but also without particular defects, all at a budget price. We kind of expected it: 51 Worldwide Games is developed by NDCube, a Japanese software house full of ex-Hudson Soft born from a joint venture between Nintendo and an advertising multinational (also present in Italy), known for some Mario Party episodes and some minor Animal Crossing content. After about 14 years, therefore, comes the sequel to an almost similar collection for DS, at the time of 42 classics, which evolves a rather immediate formula and takes it into the third decade, redesigning offline and online multiplayer, adding more titles with an arcade flavor and reorganizing the he interface.51 Worldwide Games is a collection of games related to an analog mentality of physicality tied to habits of years gone by. In an era where digital technology is fashionable and where the concreteness of the physically superfluous is pushed to be abandoned, Nintendo proposes a compromise: on the one hand, the offer of historical board games, with very few rules, children of popular traditions that they permeate and cross generations with playful approaches that are not profound but touchable in the real world, on the other hand the digitization of the same for the Switch touch screen. It will always be better to play Checkers and Chess with real pieces, just as a group game of Poker or Table Football cannot simply be replicated by a machine, but here the element of portability and convenience of a software that collects 51 served games wins immediately, enjoyable in single, via JoyCon or touch screen where possible. The software also provides a tutorial and trivia as you progress through each game's challenges. Compilation from the day before yesterday If it is true that life is not a circle but a spiral, we could easily foresee moments of pure pleasure in playing digital versions of games from our childhood and reliving old sensations, so it was. There are natural personal developments and master data to write down but in the end it is true that many of those proposed are eternal games. We could say that 51 Worldwide Games has many souls and each one responds in a different way based on the approach applied: there is all that ~woody~ playful part that guarantees an immediate dry approach, the card section that goes all around the thousand facets and back to the starting point, the arcade area with sports offers of various kinds between tables and golf courses, even a musical moment with a piano keyboard. If you have an open mind and the desire to test its true entertainment potential hit and run, the offer of 51 Worldwide Games is wide and for multiple palates, capable of evolving from a simple moment of solitary entertainment to a cornucopia of fast and immediate titles to learn and then to propose to friends or family. The NDCube title certainly provides moments of leisure in single, perhaps alternating some unknown classics of distant cultures. Although some titles can be misleading, you will have experienced many games in the course of your life and it is fun to challenge the CPU on more difficulties, especially for the challenges which, although not sensational, add bite. Chess, checkers, 4 in a row represent the old stainless guard of our tradition while mancala, dominoes, mah jong, backgammon, blackjack and all that vein have personally had less space in the life of the writer and are therefore curiosities to be discovered or rediscovered. Convenient for a quick game, to get hands on and learn, and then go to those titles more similar to the videogame arcade palate and move your hands. Golf and billiards are well packaged, not very deep in singles but reactive and satisfying enough to push to improve. With bowling we've gone back to the times of the Wii, since it thrives on touch controls and pushes a little more on the casual front, but lets itself be played, just like darts. The row of table football-style bar titles, tennis, curling, boxing, baseball and hockey have their own non-trivial gradient of involvement and every now and then you return willingly, even if more to understand some playful gimmick to improve your skills. The radio-controlled cars, the challenge between tanks, target shooting, fishing, some other less incisive software and obviously solitaire complete the work. Single player is an approach that pays off in the short term and perhaps in the medium, but we could say that it is more of a terrainawareness to be built to then invite someone to play multiplayer, an area where 51 Worldwide Games can aspire to show its true personality. Against one or against many? After all, 51 Worldwide Games kind of embodies the reality of board games: sometimes playable alone, it is in company that they acquire a playful sense capable of giving memorable emotions. In this small world, it is the control system that guides the choice: if you want to play with the touch screen, free from various pads, you can count on a precise and logical selection of titles, the same applies if you want to challenge each other by holding the joycons. It is the title itself that cleans up from time to time the list of titles not designed for the experience you are looking for, thus creating an automatic skimming which however accentuates the real element of challenge that otherwise limited software can provide and thus creating depth - especially for the arcade range - otherwise unattainable in single. In multiplayer golf, like billiards or any table football style game, shines in a completely new light that overshadows the shortness of breath of its playful progression offer, giving fun in simple and immediate company on balance. And if you have multiple Switches, you can enjoy some titles with a single copy of the game (making the others download the free Guest Edition) or connect multiple Switches in mosaic mode, perhaps to build tracks with toy cars or streams (with waterfalls or oceans) with fishing. Returning therefore to the previous point: 51 Worldwide Games is a compilation with various levels of reading, always rewarding in the short term and sometimes in the medium in single, decidedly more captivating in multiplayer where the software becomes a means to challenge the opponent not to one, but maybe a dozen games in a short time. Portability, simplicity and speed are the watchwords of a collection that opens online with apparent ease: we tested the online mode in a controlled environment and it seemed to work perfectly, you simply need to select the three potential titles and the matchmaking will try to look for at least one with a free player, by training in the meantime.", "date": "2020-06-01", "grade": "8.0"}