{"name": "Xenoblade Chronicles: Definitive Edition", "ref": "https://multiplayer.it/recensioni/xenoblade-chronicles-definitive-edition-recensione.html", "text": "While writing this review of Xenoblade Chronicles: Definitive Edition we realized how many things have changed in our lives, and in our favorite hobby, since we played the first release on the Nintendo Wii. Today we are different people than we were in the summer of 2011, and the market has also changed, for better or for worse. Japanese role-playing games, after going through a long identity crisis, have reemerged forcefully and have shown that multiple philosophies can coexist: that of tradition and that of experimentation, and everything in between. And if the genre has courageously embarked on a new path, leaving that niche in which it had been forced for years, it was also and above all thanks to Xenoblade Chronicles, the title that finally consecrated director Tetsuya Takahashi after a career spent in settle. And therefore, after so many years and a second, much less well-known release on New Nintendo 3DS, Xenoblade Chronicles arrives on Nintendo Switch with great pomp to conclude this semester that we have spent in the name of nostalgia, almost as if it wanted to close a circle. It does so with a Definitive Edition that is difficult to frame, a production halfway between a remake and a remaster that immediately reminded us why we loved the original title, but also that it is important to contextualize every experience. On the notes of the amazing main theme composed by Yoko Shimomura, which we listened to for the first time when life was more beautiful, freer, and everything seemed possible, we chose Extra History and immediately dived into the unpublished chapter A common future, anxious to discover all its secrets. A common future... or not? In the next few lines we will try to minimize the anticipations, the terrible spoilers that could ruin the ending of Xenoblade Chronicles, in case you have never played it. You will understand, however, that it would be difficult to analyze what would then be a kind of epilogue, without delving into the subject in respect of those who, on the other hand, have already completed a JRPG released almost ten years ago and who perhaps would like to buy the Definitive Edition just for a common future, playable immediately by choosing Extra Story from the title screen. In short, we have to compromise and we will limit ourselves to saying that A common future takes place a year after the ending of Xenoblade Chronicles and focuses above all on Melia, an extremely important character who ended up a bit in the background in the last lines of the script original. A common future brings back some supporting characters and introduces a couple of playable characters who, together with Shulk and Melia, make up the main party. Nene and Kino are the adorable children of Riki the Nopon: determined to become heroes like their father, they both act as comic relief in the economy of the narrative, while showing off a surprisingly interesting characterization, and in terms of gameplay they make up for the absence of Reyn and Sharla, employing their own techniques in combat. In this sense, A common future, which takes place entirely on the shoulder of Bionis, a new map that Monolith Soft had designed many years ago but was unable to implement completely due to time constraints, clearly assumes the connotations of a late and never published: it shares the same, identical structure with the original game and, from the point of view of the plot, it limits itself to closing some storylines, winking at the existence of a multiverse in which Takahashi could set new adventures. Having said that, we will be very clear, especially towards those who have known this franchise on Switch with Xenoblade Chronicles: do not expect special extras, strange crossovers or direct references to the other works of the Japanese software house. In that sense, we admit we were a bit disappointed, as the fanboy in us was really hoping for a twist that would connect all those dots we glimpsed in the Xenoblade Chronicles 2 ending or even send us back to the late Xenoblade Chronicles X for Wii U. Despite the disappointment, A common future remains an excellent gloss that does justice to the world of Shulk and company with a dry and satisfying ending that we reached in about ten hours of play after completing each side mission. A more than discreet duration for what is only an appendix, albeit decidedly shorter than that of Torna ~ The Golden Country which Monolith Soft rightly branded as a real expansion. Various improvements A common future seems to all intents and purposes an extension of Xenoblade Chronicles in terms of structureto and how to play, and as such he also feels the full weight of his ten years when we start talking about side missions, real fetch quests in which you have to kill a certain number of enemies or collect the objects that appear around for the map. It is the aspect that has probably aged the worst of the whole package, even compared to what was played in Xenoblade Chronicles 2, where fetch quests abounded but were often accompanied by well-finished cinematics and slightly less specious motivations. We have already talked about the combat system in our test two weeks ago - to which we refer you if you want to know more about the differences between the Extra Story and the original title, including the new Prospector mechanics which replaces the Group assault - but it is important to underline how fighting today arouses mixed feelings. The combat system in Xenoblade Chronicles: Definitive Edition in 2020 certainly appears to us less elaborate than that of Xenoblade Chronicles 2, almost experimental in comparison, with the techniques to be chosen one at a time without assigning them to shortcuts or the like. However, it remains immediate and intuitive, although it evolves little over the course of the game, especially if we consider that in the sequel new mechanics were unlocked even after fifty hours played, as well as enjoyable and engaging thanks to the clear distinction between the various characters, the possibility of altering their roles by acting on the Skill lines - albeit absent in A common future - and the peculiar abilities of the Monad sword that transform the power of Shulk's foresight into a real gameplay element. Monolith Soft has intervened on the interface, has streamlined and redesigned it to reduce its invasiveness on the screen, the first in a long series of improvements that have updated a ten-year-old title to today's standards. The developer didn't limit himself to reviewing the interface in combat, but every single menu, screen or function. The chaotic inventory and limited original equipment screen are now much easier to navigate, and Monolith Soft has even found the space to add the ability to choose the appearance of each individual accessory worn - a very welcome addition, if you consider the quantity and variety of items in the game, which find an obvious and functional place just below the equipment slots, in the same screen. We could also do the same for the Collection screen, the Empathic Dialogues and above all the Understanding Diagram, now much clearer and more precise, which allows you to know all the details of the most important NPCs with a quick glance. In this sense, evidently aware of the criticisms aimed at the repetitiveness of the aforementioned fetch quests, but above all at the lack of clarity of the original maps, Takahashi's guys have well thought of putting their hand to this aspect of the game too, retouching some numbers downwards and redesigning part the maps, now easier to consult and equipped with new options, such as the possibility of putting personalized pins or displaying the map overlay while exploring. Thanks to a whole series of shortcuts, which open the most important menus from the game screen in an instant, the experience appeared to us to be significantly improved in terms of immediacy and accessibility, which is no small thing. None of these implementations change what Xenoblade Chronicles has been all these years: a huge, challenging and content-rich JRPG. Winking at less scrupulous players, and above all at those who approached the franchise with Xenoblade Chronicles 2, the Japanese developer has well thought of implementing a large number of new options that allow moderate customization of the game interface, but also and especially the level of difficulty. We are talking about what the Definitive Edition calls Casual Mode and Pro Mode: the first simply lowers the difficulty level of the game, reducing the statistics of the enemies to allow those who only want to enjoy the story to wipe them out without too many worries. In reality, this setting does not automate the fights as one might think, since they continue to require a minimum of familiarity and skill, but it certainly makes battles with certain bosses or special enemies much easier. Pro Mode, on the other hand, drastically changes another aspect of the game, namely the assignment of experience points earned by completing side missions: instead of being added immediately to those possessed by individual characters in the group, the points end up in a sort of common tank.It's up to the player to decide when to assign the saved experience points, artificially acting on the levels of individual characters and, ultimately, on the difficulty curve in general. Pro Mode is simply the same mechanism used in Xenoblade Chronicles 2: it serves to customize the influx of experience points in a game that is overflowing with them, between enemies to defeat, missions to complete, areas to discover and more. The two Modes in question are not mutually exclusive, so the player can activate them individually or simultaneously at any time, establishing his own growth rhythms and the generic balancing of the level of difficulty. An excellent thought, no doubt about it. Against the clock Surprise surprise, A common future is not the only new content implemented in this Definitive Edition. Although the original title has remained fundamentally unchanged, Monolith Soft has well thought of adding a little extra called Against the clock which caught us a bit off guard when we reached the Gamba del Bionis and found ourselves facing a kind of gap interdimensional that just wasn't there on the Wii and Nintendo 3DS. These gates, which you will find scattered throughout the game world, all lead to the same place: a kind of temple in which a mysterious Nopon - indeed, a Saggiopon - will challenge you to face a series of time trials that will increase as you continue in the storyline. The challenges in question are divided into two categories: Free and Limited. You can face the first with the characters you prefer, respecting the level they have already reached, the equipment they wear and the techniques you have set. Limited challenges, on the other hand, impose a precise composition of the group and force you to use a specific character. Once the challenge has been selected, the player is catapulted into a specific arena where he must face one or more waves of enemies, putting to use what he has learned up to that point. By overcoming these challenges in time with the best evaluations, you get good quality equipment that makes up some new and not a little eccentric costumes for the individual characters: in short, if you want to dress Sharla as a pirate, you have to go through here. Not only that: by repeatedly playing the various challenges, you also accumulate Nopon Crystals, a currency that can be exchanged with Saggiopon for other accessories, gems to be embedded in equipment or manuals that allow you to sublimate the techniques of the various characters to maximum power. In short, an extra content that is not particularly brilliant, but certainly appreciable, which further prolongs an already particularly long-lasting experience in itself. Change of look So let's come to the most delicate question: the new look of Xenoblade Chronicles. We are aware that there are some fans who did not appreciate the new cartoony style, but no one should be surprised that Monolith Soft chose this character design. Considering the decisive change of Xenoblade Chronicles 2, and the fact that Shulk and Fiora had already appeared in a DLC of that game with a much more cartoonish look, it is logical to assume that this was the look that Takahashi and his people wanted to show off from the beginning . The good news is that Xenoblade Chronicles: Definitive Edition abandons the exaggerations and eccentricities of Xenoblade Chronicles 2 in favor of a leaner and more proportionate design. After all, this is not a remake and it is not even a remastered, but what we could consider something in between. Despite having changed the graphics engine, Monolith Soft has not completely redesigned the game, but has increased the resolution of most of the textures and the number of polygons in the 3D models, effectively improving the visual impact of a game that already ten years ago it looked majestic to us. Today the glance is significantly better, thanks also to the renewed color palette and the brand new dynamic lighting, but some traces of the past still remain, especially if we focus on some minor textures that can end up in the foreground by chance such as a bad slap. Nothing worth pointing out, in all honesty, when every other shot returns a variety of detail that completely overshadows the original Wii edition. Only the renewed cinematics are worth the price of this ticket: the characters now show off a variety of expressions that embellish the most important scenes, involving the player even more than in the past. There may seem to be some steep price to pay, especially when you step foot back into the Eryth Sea or the magnificent Makna Forest and admire the sublime landscapes, but the", "date": "2020-05-27", "grade": "9.6"}