{"name": "Total Tank Simulator", "ref": "https://multiplayer.it/recensioni/total-tank-simulator-recensione.html", "text": "Total Tank Simulator is a strategy derived from a battle simulator to Totally Accurate Battle Simulator. If we want, defining it already includes all its limits and could put an end to the review, but it's better to dwell a bit and, above all, go in order. Set during the Second World War, the title of Noobz From Poland tries to inject classic game mechanics into a genre that traditionally thrives on its sandbox nature. Strategy At the beginning, the player must choose one of six nations, linked to campaigns inspired by historical moments of the world conflict. The objective is always the same: to win battles by spending the available resources to buy units to deploy, whether they require them to attack head-on, to defend a certain position or to kill a VIP unit. This is undoubtedly the most important part of the game, as well as the decisive one for victory. The positioning of the troops is crucial to obtain any result and must take into account several factors: composition of the opposing army, the terrain on which you will fight, the buildings present and artificial stupidity. In the first missions it is usually quite easy to create the best army to win, but as the campaigns progress the battlefields become more complex and the opposing armies more structured, so more attention is required from the player who has to try to predict where the clashes will happen and which units will be the first to meet. For example, if the terrain slows the advance of heavy tanks, it makes sense to position the artillery so that it can bombard them before they arrive, while, as another example, deploying light tanks against heavy ones is suicidal. It must be said that often by observing the initial deployments it is not clear how the troops, enemy or friend, will move due to a deficient artificial intelligence, therefore it frequently happens that you are forced to replay the missions several times after being defeated. This is why it is very important to watch what happens on the battlefield, so that you don't have to try a third or fourth time. Between one mission and another it is then possible to spend the accumulated points to unlock new troops and to hire officers, the latter capable of giving large bonuses to units on the battlefield. The progression in this sense is quite linear and we tend to unlock everything a bit. Unfortunately, and here come the first big battle simulator limitations, when the battle has begun it is not possible to give orders to the units. So, in case you notice a deployment problem, or the artificial intelligence fallacy creates some risky situation (such as blocked units, tanks that don't fire from range, artillery aiming at a single target, soldiers taking absurd and so on), it is not possible to intervene to fix things. In reality there is always the possibility of taking direct control of the individual units, but even here there are problems. In first person As we said, one of the key features of Total Tank Simulator is the ability to take direct control of units in real time, of any type. So we can experience the battle from the point of view of a simple soldier, or enter a mighty tank, or even fly through the skies on a bomber and so on. At first doing it is really tasty, but you soon realize that the resulting problems far outweigh the benefits. Meanwhile, it is almost impossible to be decisive. So you take a unit, move forward, fire a few shots, maybe kill some enemies, and then inevitably get knocked out by some sudden hit. Individual flanking actions or surprise attacks do not pay, because the CPU always knows where we are. In most cases our contribution to the fight is practically nil and, indeed, it can become counterproductive in the event that we get killed too soon, that is, without having done substantial damage to the opponent on duty. Participating in the action also creates another problem: you lose sight of the battle as a whole and, consequently, it is more difficult to develop a new strategy in case of defeat. The substance is that after the novelty effect, we end up resorting to this option less and less, transforming Total Tank Simulator into a pure strategic one. Too bad, because undoubtedly he has moments, such as when buildings are destroyed as if they were made of papier-mch during a firefight, but they are precisely moments. The truth is that the title of Noobz from Poland is at its best when it comes to itrge the battle simulator nature, that is when you can admire hundreds of colorful low poly units that collide on the battlefield, perhaps in short game sessions. The graphic style in this sense helps because it considerably lightens the action, depriving it of any pretense of seriousness or realism. Unfortunately Total Tank Simulator didn't want to be this, but the battle simulator structure is obviously too heavy a weight to bear for all the other mechanics.", "date": "2020-05-25", "grade": "5.5"}