{"name": "Peppa Pig: Avventure Intorno al Mondo", "ref": "https://multiplayer.it/recensioni/peppa-pig-avventure-intorno-al-mondo-recensione.html", "text": "There's no getting around it: as you can easily guess Peppa Pig: Adventures Around the World is a game designed and packaged around a very specific audience, with very particular needs. So, in case you are a gamer with minimal experience, unless you are a trophy / achievement hunter, Petoons Studio's new adventure has very little to tell you. Peppa Pig: Adventures Around the World is designed for all little fans of the cute little pig Peppa and her friends, possibly in pre-school age. In fact, they will greatly appreciate the new adventure of Peppa Pig and her family around the globe, the Italian dubbing and the extremely simplified gameplay. If you are reading this review of Peppa Pig: Adventures Around the World, therefore, it is because you are wondering if Bandai Namco's new production is able to meet the needs of your children, cousins, brothers or nephews. A trip around the world Political correctness is always at the heart of Peppa Pig: Adventures Around the World Unlike My Friend Peppa Pig, the first game created with this formula always published under the Bandai Namco label, Adventures Around the World is centered on the discovery of some of the main cities and nations of the planet seen, as per tradition, through the eyes of cute little pig and her family. Although at the beginning of the game you are asked to recreate your own family, with a dutiful freedom of choice necessary to be as inclusive and delicate as possible (separate parents, extended families, rainbow), the heart of the game, i.e. travel around the world , will be done in the company of the Pig family. With them we will visit some of the places already known to all little fans of the TV series such as Italy, Australia or France, all described in the simple and didactic way typical of Peppa, to ensure that the little ones can begin to familiarize yourself with other nations and the differences between one country and another. Each trip will feature unique activities, all obviously very simple, but tasty to watch as they fish from the various catchphrases of the cartoon such as jumping in mud puddles, eating ice cream or cooking. There will be slightly more curious activities, such as treasure hunting or flying, which are tied to the single nation. Obviously the game over is not contemplated and each action can be completed by pressing a single key (at most two for ~pro~ actions such as activating the bike bell or playing an instrument). In this way even the little ones can familiarize themselves with the controls, taking all the necessary time and not getting frustrated. It cannot be said that stereotypes are lacking in Peppa Pig: Adventures Around the World The fact that every single thing is dubbed in Italian with voices very similar to those of the TV series helps the little ones to be autonomous, as they are told everything that happens on the screen and what they can and cannot do. The downside is that all those with a minimum of video game experience, unless they are still big Peppa fans, will take very little time to explore all the contents of the game, even due to a practically absent challenge. What's wrong with Peppa Pig: Adventures Around the World In Peppa Pig: Adventures Around the World you will have to create your own family In such a simple game, made up of static screens with few predefined interactions, moreover structurally very similar to the first game, the fact that there are many graphic imperfections between one area and another and the loads are many and rather slow (especially on the older generation console) are quite incomprehensible things. The little ones won't notice the graphical glitches or the occasional English sentences, but they risk puffing a bit during the frequent waiting times. For the rest, it is easy to achieve the goal with Peppa Pig: Adventures Around the World: the design of the TV series is quite simple to replicate, the tunes are catchy and the atmosphere is always very jovial and cheerful, in full Peppa Pig style.", "date": "2023-03-19", "grade": "7.5"}