{"name": "Maneater", "ref": "https://multiplayer.it/recensioni/maneater-recensione.html", "text": "We love the plurality of the market and it is perhaps one of the most exciting aspects of the gaming medium. If on the one hand we have titles capable of giving birth to interesting discussions such as the Viking-based ones of Assassin's Creed Valhalla or of making us approach adult themes such as The Last of Us 2, it is wonderful to get distracted for a second and find yourself in the hands of productions instead of from the depth narrative or morality they turn away from us as much as possible. With the only desire to entertain and have fun, a different product from the usual falls on the market, the Sharknado of video games, a centrifuge of ignorance and no-sense capable of even making us laugh. Should you seriously consider it? Read on for the Maneater review to find out. #Maneater Maneater is the fictitious reality show prepared by Tripwire Interactive to try to make sense of the delicate narrative thread of this production. The story is therefore told to us as in a TV program where Pete the Scaly is the absolute protagonist, a sadistic shark hunter ready to make yet another fin soup. This time, however, things don't go exactly right and, after having harpooned and gutted a female shark, she extracts the baby from the uterus, only to have her hand severed cleanly and thus kick off a bitter rivalry, second only to the one seen in Steven Spielberg's Jaws. However, the cards on the table change face, this time putting us in the role of the evil slaughterer of the oceans, with the developers determined to ride the bogeyman of the great killing machine, portraying our big fish as a ruthless being ready to bring massacres on an imaginary coast of the United States United. Thrown into the water like a waste, we will give our first fins trying to maneuver in a swamp, where turtles and pikes will be a small appetizer for our evolution. You move awkwardly in rather cramped environments, almost going against the trend of the freedom that one might expect from a game about sharks. This feeling of being forced into an environment that is too small and closed will be carried with us for almost the entire duration of the game. In fact, of the dozen areas available, only two will be set in the depths of the ocean, a risky choice which, as we will see later, will have a devastating effect on the feeling of repetitiveness of the game. Yellow water, algae and poor visibility accompany the first hour of the game as you try to escape the alligators and gobble small prey to build muscle mass. Every single kill counts in the evolution and for each of them we will gain experience, useful for climbing the 30 levels and reaching the status of megalodon. However, a specimen very far from the dimensions of those seen in Jason Statham's films and closer to a great white shark, also in terms of movements; in short, here we would have really wanted to exaggerate without sparing expense. The body structure during the entire growth phase will instead be based on the lines of the Leuca shark, with a truly high-level technical realization. The polygonal model is in fact well-kept and full of details and the swimming animations are fluid and pleasant even just to look at. Unfortunately, as soon as you get carried away with the control system and want to start doing something more complex than the classic swim, the game breaks down inexorably, with animations that lose fluidity and badly fit together, transforming the sinuous flexibility of the shark in a series of frantic shots. The camera certainly does not help and while a marker will indicate which prey we are able to reach with our bite it will not be unusual to completely lose sight of the target as we move rapidly below or above it. In short, the three-dimensionality of the ocean is not managed very well and if we can turn a blind eye when we have a small fry to control, the situation will change drastically when our megalodon will occupy most of the screen, making us jaw blindly most of the time , often without even letting us know if our target has already been torn apart or not. To make matters worse, dodge and jump actions are too fast for the camera to follow us properly. GDR-style growth The preys essentially give two types of nutrients: minerals and oil, which must be spent in the caves, special safe checkpoints where to be reborn in case of death, to make the shark evolve. We will thus be able to equip passive skills that increase and speed up digestion, amplify our sonar forfind collectibles and prey faster or increase stats like swimming and water resistance. Yes, because Maneater does not miss anything when it comes to trash and it will not be unusual to take entire walks on the pier in search of some handsome fisherman to devour. Killing humans will allow you to collect DNA strands, a resource that otherwise it will only be possible to recover by killing other ocean predators and which will serve to activate extra customizations. In fact, there are also three special sets disguised as evolutions that we can literally wear and which will greatly change the appearance of our shark. For example, we will be able to make bone growths appear so as to increase resistance or start emitting lightning by scorching everything that gets too close. To accompany us in this evolution a linear plot and many secondary missions which, however, have the bad habit of recurring in an exhausting way always in the same way. The repetitiveness becomes oppressive and all we will find ourselves doing is going around the world chewing on fish, things and people without interruption, a choice that inevitably leads the player to get bored even after the first, short game session . In short, Maneater suffers from chronic repetitiveness, an anchor that drags the production to the bottom and erases the good that was glimpsed under the surface. Everything is bet on combat, which could also be there, but then one forgets to perfect and give more depth to the phases of fighting fish and boats. Let's say it clearly: Here's The Dolphin: Defender of the Future behaved much better already 20 years ago and it would have been enough to copy some winning ideas. Difficulty balancing is also non-existent and after the first few hours the whole game will translate into swimming and eating, making no distinction as to what we're tearing apart with our three rows of sharp teeth. Finally, there are truly epic moments or clashes with bosses capable of making us really get adrenaline up, for a product that in its entirety has not really been able to entertain us properly.", "date": "2020-05-22", "grade": "6.5"}