{"name": "The Elder Scrolls: Blades", "ref": "https://multiplayer.it/recensioni/the-elder-scrolls-blades-recensione.html", "text": "The review of The Elder Scrolls: Blades allowed us to try our hand once again with the Bethesda-branded dungeon crawler, which made its debut exactly two years ago in early access on mobile devices and which has finally also landed on Nintendo Switch, when it is now gone traces were practically lost. The announcement that the game would arrive on the Japanese hybrid console dates back to last June, but since then the news regarding the project has become rarefied and we imagine that all this also depended on the developers' attempts to implement certain technical solutions which, unfortunately, ultimately found no place in this conversion. The reference is obviously to the motion detection controls, officially advertised until recently by the publisher but absent in this version. A lack that goes hand in hand with a modest technical sector, yet unable to find the square to implement the 60 frames per second and indeed afflicted by frequent episodes of stuttering, probably incompatible even with the idea of motion control. Structure Set in the famous fantasy universe created by Bethesda, The Elder Scrolls: Blades tells the story of a warrior (to be created using a special editor) who returns to his city after years of absence, only to find it reduced to rubble. Apparently the terrible Blood Queen and her army are responsible for so much devastation, but the last word is not said: by completing the missions and also facing the evil empress we will be able to obtain the money and resources necessary for the reconstruction. Exploring the city, selecting its lots and ordering the creation of houses, shops, forges and so on therefore represents a substantial and fascinating part of the experience, also because with the growth of our stronghold we will notice the appearance of new NPCs with which to interact to the unlocking of new and progressively more demanding assignments. A feature that we really appreciated and that appears really well implemented is cross-save: having linked the Nintendo account to the Bethesda account, we found ourselves facing the character we had created when we tried The Elder Scrolls: Blades on the iPhone, with all the progress made up to that point and a relative abundance of gems and money that allowed us to proceed with a certain speed in completing the reconstruction. Similarly, it is possible to carry on the game indifferently on different platforms, in a very comfortable way: at home you can perhaps enjoy the experience in front of the TV, while when you are out and about you will be able to take out your smartphone and complete some tasks on the fly or maybe try your hand at the two extra modes, Abyss and Arena. The basic campaign of The Elder Scrolls: Blades involves activating increasingly difficult quests by interacting with specific NPCs that are in your city, drawing new quests from the bulletin board or participating in special events, but this is not the only option of game available. In fact, it is possible to enter the Abyss, an infinite dungeon that alternates between different scenarios and in which it is possible to fight as long as one remains alive, with an increasingly higher degree of difficulty and therefore progressively stronger opponents, unlocking new prizes and rewards; or face the Arena, a competitive online multiplayer in which to challenge other users in duels to the death: the matchmaking works fairly well and does not require a Nintendo Switch Online subscription, a pity that the fulcrum of this mode lies in a combat system shallow and multifaceted. Gameplay The gameplay of The Elder Scrolls: Blades for Switch is completely identical to the mobile version, which we have re-installed these days for a direct comparison and which, in truth, runs better than the Nintendo platform: it is more responsive when, for example, you collect a case and does not suffer from the moments of uncertainty that are found in this new edition, even perhaps in the middle of a fight. In reality, there have been those who have encountered real blocks that are solved only by entering the pause screen, using a potion and then returning to the in-game action, but from this point of view we were lucky enough not to experience them in person. Having set off on a mission, the exploration of the scenarios immediately reveals itself to be rather linear and without surprises: we are talking about pre-established paths which after a few hours tend to repeat themselves in a very evident way, only changing the position of enemies and objects. You navigate by moving the left analog stick while the right one adjusts the view, with a degree of inbare-bones environmental teration and a large amount of invisible walls to delimit the boundaries of the map. Then when you come across an enemy, a one-on-one duel starts in which we can draw the sword and possibly resort to the special attacks or spells unlocked up to that moment through the level-up. As mentioned, at this juncture the control system does not use the Joy-Con motion detection to execute the attacks, although the traditional warning to use the laces to avoid flying the controllers appears when the application is started: further indication of a feature eliminated in progress. The commands, including the layout, therefore take up what has already been seen on iOS and Android, assigning the attacks from the right and left to the back buttons, to be loaded until the right moment and released for a critical damage, while by acting on the left stick it is possible to parry with the shield or with any two-handed weapon that we have equipped. In this sense, we note a further sore point: if you are among those who tend to invert the vertical view, during the fights this setting is not maintained and so to hit up or down you will have to refer to the actual directions of the right stick. Then there is the question of the free-to-play dynamics, which in The Elder Scrolls: Blades manifest themselves constantly, trying to convince us to carry out microtransactions for the purchase of gems and coins to be used to get back on track more quickly our city, get better equipment and useful materials to fish with the traditional unpacking of the chests, as well as buy healing potions that become essential when the degree of difficulty of the missions is high and our opponents' attacks inflict huge damage even when we block them. Technical realization As mentioned above, The Elder Scrolls: Blades is a technically modest title, characterized by dated graphics that unfortunately, for some reason, the developers were unable to run at 60 frames per second, neither on Nintendo Switch nor on devices iOS and Android. The animations of the characters are essential and the scenarios can be counted practically on the fingers of one hand, without however offering suggestive panoramas or complex designs, rather limiting themselves to very linear paths and almost completely devoid of interactive elements. simply unable to go beyond 30 fps is frankly inexplicable, after all resorting to dynamic solutions for the resolution it is really difficult to imagine that the hardware of the hybrid console could not handle these polygonal models and these textures in a more casual way. All the more reason, therefore, the lack of motion detection controls burns, which could certainly have made the experience more lively and interesting, somehow hiding the simplicity and limits of the combat system. In short, we must be satisfied on an aesthetic level , while as far as the soundtrack is concerned, the situation is substantially better, with good music and effects to accompany our expeditions.", "date": "2020-05-18", "grade": "6.0"}