{"name": "King of the Castle", "ref": "https://multiplayer.it/recensioni/king-of-the-castle-recensione.html", "text": "We have heard many stories of Kings and Queens, with their glorious realms or remembered for their failures, but we still lacked a Monarch who entrusts his destiny to the votes of ruthless Nobles. King of the Castle is this and much more, a game designed to spend an evening in the company of friends ready to see us capitulate trying to throw the kingdom into chaos. The new multiplayer title by Tributary Games has officially landed on Steam and, after trying it in demo version during the Steam Next Fest, we are ready to tell you in our review of our noble deeds and our painful defeats as Monarch. Hurry my Nobles King of the Castle offers two game modes: via browser or through interaction on the Twitch chat King of the Castle offers a rather simple structure, with only two playable roles: the Monarch, or the host who plays the game, and the Nobles, the other players participating in the game who do not need to buy the game to join. The one proposed is an exclusively multiplayer game that needs at least 4 players, although, more than ever in this title, the more the merrier. Following our tests, we feel like stating that the amount of Nobles needed to make everything more interesting is at least around 8/9 people, a sufficient number to have the right variety and balance in a game. In order to have the Nobles participate in the game, you will have to choose which type of game to set up, between participation via the browser or with commands directly through the Twitch chat, thanks to the integration that the game offers. At first it is reasonable to think that King of the Castle winks at streamers since they will also have to show what happens live, but it is not entirely true. If you want to play privately with friends, you can take advantage of any application where you can share the screen and connect players to the lobby by providing the password to access. Unfortunately there is no mode where you can play against the PC, which is a real shame. Although making spectators or friends interact is undoubtedly more fun than playing alone, having the possibility of playing a game in complete freedom with choices managed by artificial intelligence would only have enriched Tributary Games' proposal. Bow before your Queen The King of the Castle game map consists of 3 kingdoms that can be selected at the start of the game The Tributary Games title put us in the shoes of a Monarch, in command of three selectable territories at the start of the game from a choice of five options. The reference to Game of Thrones is quite clear and it is pleasant to find the glacial kingdoms of the North and the sunny beaches of the South, together with the imaginative territories of the Coast, the mysterious peaks of the East and the lands of the Barons. Once we have chosen how our kingdom is made up, the next phase concerns the Nobles, those who will have the task of putting a spoke in our wheels to the point of usurping the throne or killing us in battle. Whether via Twitch or browser, the game randomly sorts the participants into the three factions chosen shortly before, without the possibility of changing sides during the game, but nothing prevents you from betraying or conspiring against your own lands. The last phase of preparation involves choosing the Monarch's ambition and defining the objective with which the Nobles will try to make us fail. As for the Queen or the King, you can choose whether to focus on military strength, trade, wealth and other options that determine the values with which we will lead our kingdom. On the other hand, the Nobles will be assigned, again randomly, a card divided into three phases with a goal to be achieved in order to overthrow the Monarch; the task for the players varies from undermining our Authority, Stability or aiming to empty the royal coffers. Golden Age or disintegration? Our fate, in King of the Castle, rests in the hands of the Nobles, who will vote based on the events in each season The game has a maximum duration of 4 seasons, marked by 3 events each, but if the Nobles know how to play their cards well and reach the objective assigned to them by the game, they will be able to usurp the Monarch from the throne well before this deadline. The events are divided into fixed episodes such as the coronation, the choice of a husband or wife, and random ones, with funny and absurd stories that will upset the tranquility of the kingdom. In each event the Nobles, who are part of the Royal Council, will be called to decide by vote how to behave in the different situations that King of the Castle will propose: for example, one of the threeterritories will be able to come across a monster that sows panic and all players will have to choose whether to kill it, send a delegation of inquisitors or let it tear the poor villagers to shreds. The choice that receives the most votes is the one that will be taken, causing bonuses or malus to the statistics of the Monarch and the other territories. The Monarch, for his part, does not remain helpless, letting the Nobles do as they wish, but he will have events in which he will choose without going to the vote or exploiting his position by imposing a veto on one of the alternatives debated during the voting. Each of the Noble regions has a table, constantly on screen, with values related to trade, agriculture, military, faith and provocation, to keep an eye on whenever making a decision. The decisions, above all those of the Monarch, influence these values at every vote and the one on which we must pay more attention is the last among those just listed above. This level corresponds to the tranquility of the territories, which all start from zero at the beginning of the game, but if His Majesty's decisions annoy the Nobles, once a certain level is exceeded, the latter will be able to start a rebellion. This will lead them to the gates of the Capital thirsting for revenge and ready to do anything to see us capitulate; in our games, unfortunately we have seen the end of our realm many times, some of them in valiant battles and others becoming food for giants. The Monarch has the chance to arrive at the end of the game still firmly on the throne only with a good strategy, but we must recognize that making the participants play freely manages to make the events triggered by King of the Castle more fun. In the long run, however, some of the bizarre events that happen in the kingdom tend to repeat themselves, an indication that the offer of stories is for the moment rather limited, but this does not deprive them of their originality. The future of the kingdom of King of the Castle The stories that fuel King of the Castle's narrative are really entertaining The King of the Castle offer is very small, but its simplicity makes it a very fun game to play in company. Being a small work, even in the price, we don't feel like pointing too much on the variety of events, which we trust, however, will become more numerous in the future, perhaps with the addition of new scenarios with DLC or updates. A bit like what happened with Reigns. The small size, however, does not exempt it from small defects, such as any type of customization of the timing for the vote which are fixed at 30 seconds, a balanced value to keep the pace of the game up. but which often does not leave time for all players to participate. Tributary Games has also embellished the game with the ability to customize the look of the Monarch with different options between hairstyles and royal clothes. Finally, however, we must necessarily mention that the game is exclusively in English and this, together with the need to have a small group of friends ready to play, could distance many from the gaming experience.", "date": "2023-03-18", "grade": "7.5"}