{"name": "John Wick Hex", "ref": "https://multiplayer.it/recensioni/john-wick-hex-recensione-ps4.html", "text": "When you think of John Wick you only visualize gunfire, fists flying through the air tangled in spinning kicks and Ju Jitsu grips, you see blood splattered on the walls and broken noses, shattered shop windows and explosions. In short, you would expect everything except a staid rhythm, with moves to be calculated to the tenth of a second and the indispensable use of gray matter. Even having to tie something like this to John Wick causes a short circuit of the synapses such as to remain stunned for a few moments as if it were an oxymoron too complex to digest. For someone, however, this mental contact ignited and the final result, as we will see in this review, is not entirely to be thrown away, on the contrary. John Wick Hex's review treats the PS4 version, having tested the waters on PC, in an edition that is essentially identical to its original counterpart. From film to consoles When approaching a licensed title like this one is always extremely cautious. In the past, the video game transpositions of the most famous films have torn and destroyed the hearts of millions of fans, with mediocre productions whose will was only to scrape together some easy change by leveraging the unconditional love of the fans. Yet there was definitely some white fly, like the Transformers video game series published by Activision or X-Men Origins Wolverine or even the more recent Spider-Man. John Wick is quietly placed among the most appreciable titles in this category, proposing a prequel to the film in which the most iconic characters of the first film appear, complete with original dubbing. Our Babayaga will therefore be busy saving Winston and Charon by treading the soft carpets of the Continental and other urban locations. As we said initially, however, John Wick Hex is not a pure action at all, but a strategy game with a basic mechanic that can't help but remember the active battle system of Final Fantasy. We will start the levels armed only with our gun and in a few moments we will find ourselves having to calculate our every single step, to try to get to the end of the linear corridors that await us without being overwhelmed by enemies. Each action will cost precious time and even just crouching to reduce the chances of being hit or reloading ammo will become crucial choices in the most complex situations. So imagine finding yourself alone against a handful of enemies, having to identify the main threats while you are in stop motion, having to quickly choose whether to shoot or silently land the target that turns its back on you or whether to run towards the exit before it a new wave of enemies arrives because this is the essence of what awaits you. However, planning the levels in advance is not possible, given that improvisation will be the cornerstone of the entire production. In fact, as you advance through the levels, new opponents will appear unexpectedly from the many accesses and, even if the AI is not the best, the few blows that will be necessary to knock you out will always require you to act in the most effective way and with the least expenditure of time. The interface is everything If we had to choose the most appreciable thing about the production, we couldn't fail to mention the interface, always clear in its presentation and capable of perfectly communicating everything that happens around us. The actions of the enemies can thus be read well in advance and the move that will save our lives can be calmly evaluated by taking into consideration the various percentages to score the hits. Is an opponent ready to throw a punch? Perhaps we could anticipate him with a block and counterattack, or maybe step back and shoot him twice in the chest or still slip up behind him and take him down without anyone else noticing. Unfortunately, the range of choices does not expand with the progression of the game, leaving us with the feeling of a title always ready to explode, on the verge of being able to give us something more but then held back by budget limits and, probably, ideas too. It is the flattening of the gameplay that is witnessed after the first half hour that keeps the product anchored and prevents it from making the leap in quality it deserved given that in terms of originality this John Wick Hex certainly doesn't send them to say. Even the technical component does not make one cry for a miracle: the graphic style is decidedly spot on and the characters well characterized, despite the complete immobility during the comic-style interludes, where John's movements stand out, perfectly following the way of moving and shoot of our Boogeyman on the big screen. It is a pity then that these strengths are notn really manage to mix with each other during the various movements, resulting in a robotic action that has little to do with the fluidity of the fights that film lovers would legitimately expect.", "date": "2020-05-10", "grade": "7.0"}