{"name": "Indivisible", "ref": "https://multiplayer.it/recensioni/indivisible-recensione-nintendo-switch.html", "text": "Our review of Indivisible on Nintendo Switch begins with a very funny detail, which unfortunately did not make 505 Games, publisher of the title, laugh in the same way. As you well know by now, Indivisible appeared in digital format on the Nintendo eShop on April 28, 2020, unexpected by everyone. Even from the developers. In fact, it was decided to postpone the launch for a couple of weeks, so as to also integrate the dayone patch: things went differently, because something in the procedure didn't work; better for the players, who have been waiting for it for a long time (a little less for the backers, who hadn't received the promised codes yet). It may therefore be that you are already playing in the company of Ajna on Nintendo Switch. And how could we not be happy about it, given that we are facing a great porting? Indivisible on Nintendo Switch: content and conversion The contents of Indivisible on Nintendo Switch are currently the same as seen last fall, when the title of Lab Zero Games (the guys from that fantastic Skullgirls, among other things) landed on PC, PlayStation 4 and Xbox One. The offer therefore remains the one in single player, an adventure with a duration of around 20 hours of play for those who proceed at a fast pace; and which however become at least 30 for the completionists, who will want to find every single secret, every red stone of the upgrades and all the secondary characters to add to the party. Attention, however: as mentioned, the developers have put in the pipeline the dayone patch, the first real update of Indivisible. Who knows, maybe at the time of writing it is already available for download: if not, however, there are very few days left, because it should be practically ready. This update is very important for the Nintendo console: it will allow you to choose between the game options between the free framerate (and therefore fluctuating based on the various situations and phases of the game) and the one anchored to 30FPS, it introduces optimizations to CPU and GPU performance ; fixes some graphical and lighting details, which occasionally made character sprites appear in a bizarre way pare (~apparently~, because we've never happened to luckily); and finally, last but not least, it introduces 1080p resolution in docked mode, leaving the portable one in 720p. At this point you might even think: ~ah, but if the first update brings all these things, then for the moment Indivisible on Nintendo Switch will be ugly and unplayable!~. This is not the case, so much so that in the intention of the developers all this had to be added to the game ready for official release, which required minimal refinements. In fact, the conversion on Nintendo Switch is one of the best that has come to hand in the last hand, and let's also say it clearly: how much mediocrity have we had to review on Nintendo Switch? How many good or at least sufficient titles elsewhere arrived practically unplayable after a disastrous port? Indivisible not only saves itself, but shines with its own light on the Nintendo portable console, and is enriched by the possibility of being enjoyed in portable mode. The hit and run is great for him, thanks to its clever mix of many different game modes, and the interspersed clashes. Gameplay and storytelling Given that Indivisible returns to Nintendo Switch perfectly usable and with the same content as always, it is now appropriate to remember why you should the title of Lab Zero Games (especially on the hybrid console, if you have the opportunity). On every other aspect of the production shines an atypical, fresh and original gameplay, which draws liberally from several different genres: the old-fashioned platformer, the turn-based strategy, the action RPG and the metroidvania, all held together by a single direction artistic particularly remarkable and spot on, also in reference to the issues addressed. Indivisible does not present a prohibitive level of difficulty, and most of the time in reality not too demanding, but the mixture of genres and the continuous transition from one to another very often allows the player to avoid noticing. The variety of places, situations and clashes certainly helps him, and proves to be particularly accessible for those who do not master any particular genre at a deep level; on the other hand, precisely those who are experts will instead notice the flaws, and this too must unfortunately be noted. To learn more about the combat system, character upgrades and progression in general, we recommend that you also take a look at the basic review of Indivisible, since this article focuses on the conversion for Nintendo Switch. Pleasant mnever really brilliant, however, is the plot of the game: the narrative is interesting enough to keep the attention of the players, but not too creative. The main theme is that of the super-villain emperor who wants to conquer the world, and the protagonist immediately sees the village where she has grown up since childhood destroyed: hence the journey of growth (also psychological) towards the final battle. Along the way he will meet many friends, in an adventure that even graphically and from the point of view of animations winks several times (both, yes) to the world of anime.", "date": "2020-05-10", "grade": "8.2"}