{"name": "Legends of Runeterra", "ref": "https://multiplayer.it/recensioni/legends-of-runeterra-recensione.html", "text": "The Legends of Runeterra review is an arrival point but also a starting point for the Riot title, an ambitious project whose path has actually just begun. It would seem useless to try to undermine the success of Hearthstone just for the sake of stealing a small part of its audience. Blizzard, despite the problems and missteps on the title, not least the double nerf in a short turn of the screw for the Demon Hunter, maintains the primacy. The credit goes to an extremely solid fan base but also to a simple and immediate game system that strikes the heart of the target audience. Magic, with a far superior history behind it, constant updates and a much deeper game system, in fact, did not worry the American giant who actually even shrugged off Artifact and Gwent at the same time, which instead used the originality as a trump card. Looking at what the market has told us in recent years, there really doesn't seem to be room for a new contender: Riot however does not agree, and after taking the MOBA scepter with League of Legends and being ready to steal professional players from panorama of Overwatch with its Valorant, it decided to bring home the en plein with Legends of Runeterra, which officially came out of the closed beta phase a few days ago. Time for change? Home is where the heart is We fell in love with Legends of Runeterra from the very first moments after opening the game client. We were greeted by divinely animated artwork, vivid colors and an intuitive interface that immediately made us feel at home. The air you breathe is closer to that of Artifact than that of Hearthstone, with a really high-level quality of the menus and interaction animations. It is a feeling of lightness that drags on throughout the game, overcoming the very long and sometimes even a bit tedious initial tutorial, up to the games where the lack of interaction with the game boards is filled by the presence of the little Guardians who they keep us company with adorable movements and verses. The initial Poro is our favorite mascot (given its free) but the game makes more than a dozen available to you to choose from, provided of course you are willing to pay a few euros to get them. Let us immediately remove all doubts then, by talking to you about a completely free to play game model that aims to make you mainly buy card backs, emotes and other graphic embellishments such as planks instead of pushing you to throw money after money in search of the much desired legendary missing. In the months we've been playing we've never felt the need to invest real money since the time spent in the game is more than enough currency to make you loved by Riot, intent as it is on having more players on the servers for now than instead they enjoy cash cows to raise cash. Through a nice experience system it is thus possible to obtain common, rare, epic and Champions cards gradually and for free, even being able to choose which Region to prefer. The Regions refer to those seen in League of Legends: therefore there is Demacia with its warriors with enormous statistics and ideal for close combat, Freljord where Anivia and Ashe lead the frost troops ready to freeze their opponents, Noxus where brutality is king, Ionia, the Shadow Islands and Piltover and Zaun where instead combos and tricks are the order of the day. The newcomer Bilgewater closes the circle where Nautilus, Fizz, Twisted Fate, Miss Fortune and Graves have their home. The introduction of this new region has already brought a decisive change in the meta with the addition of new keywords to the game. Before going into detail and talking to you about the game mechanics, however, let's close the monetization speech by turning up our noses as regards prices. Even if it is true that they are only aesthetic embellishments, finding ourselves having to spend 5 euros for a Guardian or a back and ten for a simple playing field seem like an exaggeration to us but as long as they allow us to play so freely, we can still postpone the problem. Ready to believe in the heart of the cards? The real difference that distinguishes Legends of Runeterra from Hearthsone is the almost total lack of randomness in the cards. Spells that distribute random blows are very few and even fewer that allow you to cast spells capable of winning a game by themselves. In short, the feeling of having control of the game is always preponderant with respect to luck, limited as in any good self-respecting card game to the mere randomness of the draw. A little accelerationion in this sense has taken over with Bilgewater and some of its mechanics of the possibility of drawing cards from the opponent's deck or burning one's own to accelerate some dynamics but still nothing remotely comparable to the old and dear Hearthstone Yogg-Saron. The construction of the deck is original and follows its own rules, with the possibility of creating a deck of forty cards by choosing up to two regions and mixing the components as desired. However, the fulcrum of the decks will be the heroes taken from League of Legends and integrated simply as more powerful cards capable of evolving, through extremely accurate and never invasive animation, after having satisfied certain circumstances. Ezreal will ask you to target enemy cards eight times or Darius, for example, to bring the enemy nexus to 10 life remaining. Don't worry though, no towers to knock down, lanes to defend or minions to control (get Artifact right?) the game will be all about the player's skill, with the ability to attack and protect with all the creatures on our side. Creatures and spells are cast through classic summoning costs with a fundamental peculiarity and capable of making turns always unpredictable, speeding up or slowing down the pace in an unexpected way. If you finish the turn without using all the mana available, you can store up to three units to cast spells the next turn. The mechanic works extremely well and is essential to ensure more options and variety in the games. Another peculiarity of Runeterra, this time inherited in part from Magic is priority management. This passes from player to player every time a creature is played or a slow spell is cast, always giving way to respond on the field to every piece played by the opponent. Then there are two other types of spells that can instead be played at any time of the match, even during the combat phase, differentiated into Burst and Fast spells. We will be able to respond to the latter with spells also having the Fast keyword while those defined as Burst will leave priority to the player who cast them. The mechanism seems complex to describe and it is not even too immediate at first but we assure you that after assimilating it, the gameplay is successful and overwhelming. Are there any extra modes? Once you build your starter decks and learn the basics you'll want to jump into the fray and do something more. Legends of Runeterra comes to your rescue with ranked matches, divided by rank in an identical way to League of Legends, starting from Iron IV up to Master (for now we are stuck at Platinum waiting to understand how the meta with Bilgewater) and above all with the expeditions that allow you, for a fairly negligible cost, to build a deck from scratch and try to win as many games as possible by obtaining prizes based on the victories. Each week the reward chests will give you Tokens to participate with for free and it will also be possible to spend 2000 crystals to open the doors of the arena. Crystals are generated automatically every time you get the fourth copy of a specific card. In fact, there is no possibility of destroying cards in your possession but only, possibly, of buying tokens to create the missing ones with costs ranging from 3 euros for a hero up to 10 cents for the municipalities. Packages with random content cannot be purchased, the obtainment of which is instead relegated to the progression of the player's level. In the future, we also expect more modes for those players who want a lighter experience from a card game.", "date": "2020-05-01", "grade": "8.5"}