{"name": "Streets of Rage 4", "ref": "https://multiplayer.it/recensioni/streets-of-rage-4-recensione.html", "text": "The Streets of Rage 4 review takes us back to the rage-filled streets of the SEGA classic, fighting bare knuckles against gangs of ruthless criminals. It's been quite a while since the last time, but Axel Stone and Blaze Fielding haven't aged that much and this time they have to face the most difficult battle ever, against the two terrible sons of Mister X and the evil empire that they have created. At their side two new allies, the young rocker Cherry Hunter (daughter of Adam) and the warrior with mechanical arms Floyd Iraia (student of Doctor Zan), to compose a roster of four elements which, however, we will see enriched by the match in the game thanks to the occurrence of specific events and the accumulation of life points, which allows you to unlock vintage versions of classic characters (with their moves, including specials) but also modern reinterpretations of which, however, we prefer not to talk about to avoid spoiling the surprise . Technical realization: a different style The first thing that catches the eye of Streets of Rage 4 is obviously the graphic style of Ben Fiquet, which we have already been able to appreciate in Wonder Boy: The Dragon's Trap but which clearly distances itself a lot from the most representative character design for the original series, the one signed by Ayano Koshiro for the second chapter (we talked about it in an in-depth analysis dedicated to the history of Streets of Rage). The bewilderment, however, lasts the time of a fistfight: Fiquet is a talented artist and, net of animations of variable quality, we greatly appreciated the elderly reinterpretation of Axel Stone, as well as that of other characters from the past and the new entry Cherry Hunter, who in fact moves and acts very similar to his uncle Skate. Inevitable stereotypes aside, we also liked the new Blaze Fielding, while we found the design of Floyd Iraia less successful, the last character added to the basic roster and perhaps for this reason a little less cared for in terms of movements; which also translates into a guiltily more limited repertoire, where instead there was great potential to give life to a devastating, technical and multifaceted fighter like the good old days Max. At the end of each of the twelve stages that make up the campaign, which lasts about three hours on the normal difficulty level, you can watch a comic-style cutscene that further emphasizes Fiquet's illustrator skills, with some extraordinarily dynamic drawings side by side with others that instead shine much less, seeming almost sketchy. However, the mix works and transports us from time to time to a different setting, again with great attention to the iconic Streets of Rage scenarios. The background artist, Julian Nguyen You, gave continuity to the project starting naturally from an urban location and then taking us to the police station, to fight among the containers of a ship in the port of the city, on the roofs of a moving train, in the sewer tunnels , in the middle of Chinatown, inside seedy clubs and on the roofs of buildings, and then again in a modern art museum. In short, there is no lack of variety, the references to the classic episodes are numerous and the stylistic path that original to this curious sequel, albeit with some reservations, it seemed convincing. An excellent job of diversification has been done on the enemy front, even if obviously in the first stages you come across multiple clones and you have to wait to proceed between the missions for all the available opponents to be revealed. Also and above all in this case the developers have fished out all the original villains, adapting their design to the new style, re-proposing their repertoire, adding various new entries and introducing a whole series of variations on the theme. A very similar argument can be made with regard to bosses and mini-bosses, with many returns from the past but also completely new figures, some more successful than others. In short, you can breathe a nice atmosphere, emphasized by audio effects perfectly suited to the context and from a soundtrack signed by Olivier Deriviere (Vampyr, A Plague Tale: Innocence, Dying Light 2), who has collaborated with Yuzo Koshiro, Motohiro Kawashima and other artists to package sounds capable of bringing to mind the classic episodes but at the same time proposing new themes and new interpretations. Gameplay: Does it hit well? Having ascertained the goodness of the technical sector, the question that everyone is asking themselves, especially the nostalgics of the franchise, is whether Streets of Rage 4 fights well. The answer is a convinced yes, and it could not have been otherwise: impact performance is a key element for the series and aweak new chapter from this point of view would have made very little sense. they are the ones you probably already know but who have aged damn well, judging by the fun and satisfaction you get from punching enemies, even and especially in cooperative mode. We have played and replayed the campaign mainly exploiting this feature locally, for a maximum of four participants (whereas online co-op is limited to two, strangely), but the gameplay is perfectly enjoyable even in solitary mode, although this way it is more complicated to have reason for the bosses who take advantage of the distance to escape blows, and that in pairs instead you can intercept more quickly. The repertoire of moves available to Axel Stone and his friends resumes that of the classic episodes of Streets of Rage, with a combo to which are added flying kicks, an alternative attack (two times forward and punch), a blow to the back (A and B together, the right trigger or the punch by pulling the stick backwards), a rich set of holds with four variants, a spectacular Ultimate and a total of three specials (while stationary, moving and jumping) that consume vital energy when used, energy which, however, can be recovered if we score a few punches immediately afterwards. Then there are the inevitable objects that can be collected and used, again with many returns and some new entries: from knives to bars, from clubs to swords, passing through spears, tasers, batons, bricks, grenades and ampoules full of chemical liquids corrosive or flammable. When selecting the characters, you can choose whether or not to activate ~friendly fire~, but in the fury of battle it is better to have one less thought and avoid accidents. Finally, the contents: if it is true that the Streets of Rage 4 campaign it is completed within three hours at the normal difficulty level (there are five of them, including the legendary ~mania~), it is also true that the experience makes replayability its strong point, urging us to complete the twelve stages multiple times to unlock all characters. After that it is possible to go back to every single completed level, enter an Arcade mode in which to try to beat the game with a single attempt and without the possibility of continuing (which, by the way, in co-op is only guaranteed when both characters are been defeated, rightly sending us back to the beginning of the stage), try the Boss Rush mode, with a Versus that frankly leaves the time it finds (scrolling fighting games are not made for this, and it shows) and the aforementioned online multiplayer cooperative. Finally, there is a gallery in which to admire the various artworks unlocked up to that point and the cards relating to each character, complete with old-fashioned statistics, with the stars indicating the values of power, technique, speed, jump and resistance . The PC version, the subject of this review, runs on the test configuration at real 4K and a stable 60 frames per second, with all settings maxed out. The available options allow you to scale the resolution in order to optimize performance on less powerful systems, as well as to act on individual aspects of the graphics: frame skip, general preset, shadows, soft shadows, ambient occlusion, reflections, environment and background details, particles and details in the foreground, with even filters applicable to everything to give the experience a different atmosphere. Also nice is the possibility, from the menus, to change the icon relating to small and large meals that can be found in the scenarios for recovery of health, selecting the favorite food among apples, pizza, rotisserie chicken, roast, ramen and so on.", "date": "2020-04-29", "grade": "8.5"}