{"name": "Have a Nice Death", "ref": "https://multiplayer.it/recensioni/have-a-nice-death-recensione.html", "text": "It's been a year since we last had the opportunity to tell you about Have a Nice Death, the rogue-lite from Magic Design Studios, and now it's time to go back to putting on the cloak and sickle to put the rebellious employees back in their place of Death Inc. The release date of the PC version 1.0 of Have a Nice Death is set for March 22, 2023, the day on which the game will also be released on Nintendo Switch. Obviously all those who have purchased early access on Steam will be able to download the update for free and above all will be able to keep their saves to continue the adventure. But let's not waste any more time and see everything there is to know in our review of Have a Nice Death! Those who die see each other again Death will have his work cut out to get his company right in Have a Nice Death As we had already told you in our trial, the incipit of the plot is very simple: Death has long since set up an entire company dedicated to the collection of souls, but this has distanced it from action in the field, bringing it to the indolence. While the practices accumulate on the desk, the subordinates have obtained too much power, also due to an obscure, unspecified figure whose nature it will finally be possible to discover. Version 1.0 also serves to close the narrative component of Have a Nice Death, which still remains a background element with respect to the heart of the game, as happens in many roguelites. However, this did not prevent the authors from adding many small innovations compared to a year ago, especially in the form of secondary dialogues with the faithful employees of Death Inc. The various characters who move around Death are all pleasant and droll, with their oddly earthly preoccupations with beings living in the afterlife. Between dumb interns, maniacal secretaries, shoeless trade unionists (one of our favourites) and more, Death Inc. is alive and kicking. The environmental narrative is also pleasant: Morte's underworld is a real company and is divided into departments, each with its own theme: pollution, food poisoning, physical illness, drug addiction and more. Each area is very different, even if mostly dominated by gray: as already mentioned in the test, it risks getting a bit boring after several hours, but it also depends on your tastes. Overall, the care for the areas is remarkable, with many details and a unique style, especially as regards the enemies. Have a Nice Death battles and upgrades The scythe is our main weapon in Have a Nice Death Since early access to version 1.0 of Have a Nice Death the combat system has not been revolutionized. First of all, Death has a scythe, which can take various forms: at the beginning of each game we can choose one of three. Variants are tied to speed and power, with dedicated attack moves. For our taste we prefer the faster ones, also because the game rewards those who know how to reposition themselves between attacks, so the slower blades are at a disadvantage. The Grim Reaper can attack on the ground and in the air, with charged shots (not very useful) and vertical moves, both uphill and falling. If in the first regions the clashes are simple, with few enemies and few attacks that can really endanger us, in the more advanced stages the screen becomes a chaos of ranged attacks, explosive mines, enemies who launch and teleport around and, in general, they are more resistant to our attacks, thus preventing us from taking full advantage of the stunning effects of the scythe, which can block enemies for a few moments. Have a Nice Death asks us to find a balance between attack and defense, especially against bosses: if you like to attack repeatedly with little regard for dodging and positioning, you won't go very far. The bosses, in particular, are very elaborate, with many attacks, movements, moves and almost ~bullet hell~ sections. It is one of the best elements of the game. Bosses tend to die spectacularly in Have a Nice Death Luckily, it's not all about manual skill: power-ups also determine the chances of success. First of all, there are weapons and spells: in each game we will be able to collect attack tools that can be used after a reload. Most are powerful and allow you to attack in an alternative way, whether it is from a distance or with wide-ranging strikes. These weapons, as well as the Scythe, can be upgraded in specific locations. Stats are increased and extra bonuses are obtained, such as additional attacks or penalties such as poisoning or burning. Learning about the evolution of each strument and relative effectiveness in every situation you become true masters of Have a Nice Death. In general, it is possible to truly perceive the improvement of our skills in the use of the tools and combos available over several hours of play: it is certainly satisfying. Each weapon has a very powerful special move tied to a Fury bar in Have a Nice Death However, the most interesting upgrades are the Curses, which we criticized in our test last year because they were not very interesting. Well, having arrived at the final version, we can say that we are satisfied. In addition to the simplest upgrades such as ~more attack~ or ~more life / mana~, interesting powers are added that activate malus on enemies, create explosive butterflies or seriously enhance our defense. Now it is possible to create combinations of effects, also based on our weapons. The system is also interesting because, having accumulated a certain number of Curses, we will have to accept a penalty, such as more dangerous attacks on enemies, more powerful bosses or loss of the map. The final sensation is of having a good level of control over how our character can be enhanced, always within the limits of the randomness of a roguelite. Advancement The bosses in Have a Nice Death are all very stylistically beautiful The power-ups mentioned up to this point are only those valid for the single game. However, Death can gain more tools between explorations. Just like Early Access, you'll earn Gold Bars for playing, based on your performance. These can be spent to permanently unlock new weapons and snacks, i.e. heals and upgrades. The ingot cost of each item can also drop if we complete an associated challenge, such as defeating enemies, bosses or taking damage. It's a way to spice up the character evolution system and we appreciate it now as much as we did a year ago. As you progress, enemies become much more dangerous in Have a Nice Death Another element is a ~level up~ system, always based on the results of our games. As you level up, you unlock various fixed power-ups, such as the ability to start immediately with a cure or new Curses. Both advancement systems are useful for giving even the less skilled player the feeling of having achieved something even in the event of defeat and, slowly, become stronger and have an advantage in subsequent attempts. Furthermore, there is immediately a lower difficulty level which allows you to have some advantages, such as three heals from the beginning of the game and more resistance to damage. Exploration The elevator will be our primary means of transportation in Have a Nice Death Another important feature of Have a Nice Death is the freedom to explore. Each game sees us explore a series of Departments, which are themselves divided into floors. When moving from one plan to the next, you have to choose which one will be next among the available options. The differences are related to the rewards we will get: in other words we can choose how to evolve our game. You can prioritize increasing your life or accumulating Curses, getting soul coins (to upgrade weapons or shop in the Shop), but also seek healing, get more Ingots and more. Once again, Have a Nice Death focuses on the sense of freedom: it is an element that we appreciate as it gives the feeling of having control within a random system anyway. However, the individual levels are quite similar to each other: a succession of rooms and passages with some enemies and occasional closed arenas with enemies in waves. Even in this definitive version there are not many and they will soon start to repeat themselves. The freedom in the exploration phase continues with the choice of the next Department to explore, which brings with it unique enemies, both common and mini-bosses and bosses. In addition, each Department affects Curses (which are divided by color), enhancing this or that other type.", "date": "2023-03-16", "grade": "8.5"}