{"name": "PONG Quest", "ref": "https://multiplayer.it/recensioni/pong-quest-recensione.html", "text": "The PONG Quest review, available on PC and on all Switch consoles included, takes us back to an oscilloscope that in 1958 was used to show the world the wonders of a science used not to destroy but to amuse. And that's exactly how the father of all video games was born from one of the minds behind the atomic bomb, the direct progenitor of that Pong that would have had a place of honor in the library of the first console in history. From here, over forty years later, Pong Quest was born, an attempt to give new youth to a great classic by inoculating it with RPG mechanics, progression and full multiplayer support. A great classic revisited in an RPG key What is probably the most essential gameplay ever has one edge and that is to work in any context. It is no coincidence that Pong has returned in the form of a mini-game or puzzle in tons of games, including fantasy indies such as Children of Morta, to become today the centerpiece of a similar dungeon crawler whose battles are resolved by intercepting and repelling a ball with readiness. Instead, the puzzle formula changes, with Memory-style games and platforms to rotate to push the ball towards a finish line, while the challenges that exploit the mechanics of PONG return to the piece to mention a series of classics, from the similar Arkanoid to get to a particular version of Snake. All seasoned with special balls, coins and experience points that allow us to enhance our rectangular avatar. The classic white bar of the Atari version of the title becomes a character, a member of a race of rectangles, who is commissioned by the king to carry out a daring mission. Thus begins a journey of fantasy stereotypes and assorted enemies scattered across different dungeons to be unlocked progressively, level after level. Unfortunately, although enriched by RPG mechanics that include levels and hit points, the Checkered Ink title ends up looking like a game from 40 years ago precisely where it tries to renew itself. The dialogues don't exist, the story is too weak to even be considered an excuse and the exploration takes us directly back to the first Atari consoles. It is therefore immediately clear that the fulcrum of Pong Quest, despite the name, are the clashes with enemies and our ability to calculate the rebounds in the ball to reject it beyond an opponent or towards a target. And this is where the special balls come into play, obtainable both by exploring and by hitting those that appear on the field, which can generate various effects by altering the behavior of the sphere, creating barriers, guaranteeing bonuses and mimicking the type of modifier used by the opponent. It is in fact a symmetrical possibility that artificial intelligence exploits as often as possible, forcing even the best of players to deal with the life bar which brings us back, alas, to the exploratory dimension. The fights are fast and at first it is not difficult to win in one or two moves. But the fights are countless and it is practically impossible to get out of them without suffering some damage. Even if we avoid conceding goals, which subtract five vital points from an initial maximum of forty, we lose one to two life points for each ball rejected, which makes games that are too long dangerous. The last remaining point cannot be taken away from us by a rebuff, but getting out of a fight reduced to a flicker, with life that can only be recovered at the end of the level or by finding a sacrificial statue, represents a big problem. It therefore becomes essential to take advantage of the possibility of dodging enemies, while taking into consideration choosing the increase in life among the options that are proposed to us when we get to a new level. However, it would be unwise to underestimate the other selectable bonuses which include the possibility of making the opponent less intelligent or slowing down. On the other hand, it is our reflexes, and not those of the computer, that are cornered when the ball picks up speed and the number of variables on the field increases. Interface, graphics and customization At the root, PONG Quest remains a simple game but changes pace thanks to curve balls, vortexes, barriers and various bonuses that can put us in front of complicated situations to overcome, thanks to the increase in the life points of enemies and bosses. It therefore becomes necessary to recognize the nature of the opponent's blows and learn to counter them as the action gets faster and faster. But the difficulty is not always a matter of challenge. Sometimes the biggest obstacle is the randomness of the effects, applied with not too much elegance to a gameplay that remains the same to the bonedated over sixty years ago, and the interface which, unnecessarily cumbersome, asks us to scroll through a menu and activate a ball, at least on PC, becoming a cumbersome distraction during exchanges that can become lightning fast. Furthermore, the limits of artificial intelligence applied to such a formula are now evident while the challenges lose their edge in a short time, rapidly pushing us towards the online sector. Unfortunately, the lack of contenders prevented us from measuring ourselves against the competitive rankings, but thanks to the support for local multiplayer we were able to set foot in a dimension which, also available in a two-on-two version, enhances a gameplay that is not too refined but still without a doubt richer than that of the original. In any case, the margin to assert one's skill is not lacking, just as there is a rather rich customization of our rectangular avatar. Hair, clothes, colors and accessories manage to make even a trivial rectangle recognizable, compensating for simplicity with a discreet wealth of options. But the customization, while varied, fails to save an aesthetic picture that borders on disaster. Things go wrong already on the field, where in any case there is something to look at between powers and effects, but they become disheartening, repaying us just with very low hardware requirements, in the middle of dungeons made up of squared and dramatically poor rooms, where getting noticed is just the lack of coherence between soundtrack, fantasy characters, cops and rappers. A completely renounceable side dish that we would have gladly exchanged for a little more attention to the gameplay, a more articulated character evolution or even just a slightly more accurate graphic design. In short, anything capable of justifying the decision to inconvenience a name of this caliber.", "date": "2020-04-21", "grade": "5.0"}