{"name": "ONI: Road to be the Mightiest Oni", "ref": "https://multiplayer.it/recensioni/oni-road-to-be-the-mightiest-oni-recensione.html", "text": "The story of Momotar (the ~peach boy~) is among the most famous legends in Japanese folklore. Born from a gigantic peach after the prayers of an elderly couple eager to have a child, Momotar had soon grown into a strong and combative young man, and together with a curious group of allies - a pheasant, a dog and a monkey - he had traveled to Onigashima, the island of Oni, to defeat the orcs and steal their precious loot. ONI: Road to be the Mightiest Oni aims to tell the other side of the story: the protagonist, Kuuta, is the only surviving Oni to the massacre of Momotar, and in search of revenge he goes to the island of Kisejima, full of evidence that will give him the strength necessary to defeat the orc exterminator. The video game produced by KENEI DESIGN with the collaboration of SHUEISHA GAMES, published by Clouded Leopard Entertainment, starts from good basic ideas - also in terms of gameplay - but presents numerous flaws on several levels, and the overall result is compromised by a repetitiveness that leaves no room for flashes and surprises. We talk about it in depth in our review of ONI: Road to be the Mightiest Oni. An uphill road The island on which ONI: Road to be the Mightiest Oni is set, Kisejima, is not very extensive and is divided by invisible walls that block exploration The short - and decidedly uninspired - initial video of ONI: Road to be the Mightiest Oni presents some scenes of the battle between the orcs and Momotar, which ends with the victory of the latter and the extermination of the Oni. After this fierce fight, the orc Kuuta manages to escape and go to Kisejima, an island between the world of the living and the afterlife where the souls of the dead are examined: those overflowing with earthly passions will reincarnate on earth as Oni. Not only that: Kisejima is also a place for training and self-improvement. The presence of the souls of the dead makes their absorption possible, provided they are defeated in battle: this is precisely Kuuta's goal, who will use the spirits of the orcs defeated by Momotar to turn their strength against the murderous hero. Scattered around the small island are notes that tell the backstory of Kisejima and the Oni, delving into the simple but interesting game plot. In the distance stands the silhouette of Onigashima with its characteristic horns, identical to how we saw it in the unforgettable kami. There are also some supporting characters, first of all Kazemaru, spirit of the wind (~kaze~ really means ~wind~ in Japanese, and you've probably already seen this word in the compound ~kamikaze~ or ~divine wind~) who will also act as Kuuta's ally during his many battles. There is also the merchant Zenisuke, who uses mushrooms - present in abundance at the foot of the trees on the island - as a currency for trade: from him we can buy food to restore Kuuta's health and useful equipment to increase its parameters. Then we have Kanna, a mysterious girl who lives in Kisejima. Too bad that each character is introduced in a poor way, and the developers take for granted the bonds that are created between the protagonist and the supporting actors: Kazemaru follows Kuuta in his adventure for no apparent reason, while in the very first interlude scene which sees the protagonists Kuuta and Kanna specify that a ~particular bond~ was immediately created between the two. Which doesn't work and doesn't convince, given that on the screen we simply see encounters between characters who are unrelated to each other and who will only be partially ~amalgamated~ by the story that will follow. Orc blows The combat system of ONI: Road the be the Mightiest Oni is marred by woody animations and marked repetitiveness Heart of ONI: Road to be the Mightiest Oni are certainly the tests that Kuuta must face in order to become strong enough to challenge the cruel Momotar. It is necessary to pass all the battles of each part of the island (three in all) to unlock access to the next part; this system turns out to be poorly implemented, with a division of the territory based on trivial invisible walls that limit exploration. The fights begin by meeting the spirits of the Oni: the basic forms of the enemies are identical to Kuuta, with an exclusively chromatic change, but fortunately there are more original designs, especially in the boss fights, based on monsters drawn from the rich Japanese folklore (among else, the name ~Komainu~ should mean something to fans of Final Fantasy X). Kuuta fights with a club, and once he has killed the enemies he must destroy and absorb their soul, before this returns to the opponent's body and infuses him new life. Holding prmute the attack button until the tip of the club lights up and perform a rotating attack, useful for taming the most agitated situations; when the special bar is full, the Oni can perform a special attack with various effects, depending on the one selected. Collaboration with Kazemaru is essential, controllable by pressing a special key (which does not prevent you from continuing to move and attack with Kuuta): the spirit of the wind has the power to absorb the souls of enemies, but in doing so it consumes vigor, another indicator to keep an eye on during the fights. We found situations with many enemies on the screen not always legible, not to mention the woodiness of Kuuta's animations, very nice to see - as well as the rest of the cast, characterized by a recognizable and distinctly Japanese design - but not as pleasant to control in fights over the course of the approximately twelve hours it takes to complete the adventure. Furthermore, in the most chaotic contexts it is difficult to maintain control of both characters, especially when the direction adopts a top-down view (which is quite frequent when hordes of angry demonic spirits are sent against us). The procedure to continue in the adventure is always the same: collect spirits, earn hearts and face the challenges scattered on the island of Kisejima To face the trials it is necessary to earn hearts, which are earned by collecting the souls scattered throughout the island. There are fifty-six in all and they can be traced with the help of Kazemaru, on whose head a flame will light up when you are in the vicinity of one of these spirits, hidden in the surrounding environment. Once you've caught the sprite, you may be chased by Kuron (~dark skin~ in Japanese), a round, big-toothed monster that you must escape at all costs. Overall, the process proves extremely repetitive and without flickers, and we found the collection of spirits perhaps one of the most boring moments of the entire production. A forgettable island The design of Kuuta and the other supporting characters is certainly pleasant, but clashes with the monotony of the island settings Unfortunately, ONI: Road to be the Mightiest Oni doesn't stand out artistically either. If - as we said - the characters were designed with great care, the same cannot be said of Kisejima, a small and uninspired island in terms of color and settings. On PlayStation 5 we have noticed quite a few technical problems, first of all an important pop in of the textures of the surfaces and of the shadows; there is no shortage of flying chests and other assorted bugs. One gets the impression that ONI: Road to be the Mightiest Oni has remained at the prototype stage: the island of Kosejima is bare and poor, devoid as it is of those tricks capable of elegantly hiding any production limits. incomplete Italian translation. Many texts have not been translated: it is strange to pick mushrooms and read ~Got Mushrooms~ on the screen and then the description of the mushrooms in question in Italian. The same goes for the texts at the end of each battle, where we read ~Mission Completed~ together with the completion times and other parameters of our performance, however remained in English. Things aren't going better musically: we found the ballad that is heard in the first part of the island completely out of place, with a blatantly Western sound and a male voice singing in English. All this does not go well with the setting chosen by KENEI DESIGN - not to mention that the song stops and starts again every time a battle is undertaken or there is an interaction with elements of the scenario, ending up being annoyingly repetitive.", "date": "2023-03-15", "grade": "4.0"}