{"name": "Planet Zoo: South America Pack", "ref": "https://multiplayer.it/recensioni/planet-zoo-south-america-pack-recensione.html", "text": "Planet Zoo: South America Pack is the classic quantitative expansion, as we will see in the course of the review. That is, it is one of those that add content without affecting the game mechanics in the slightest. As the title suggests, by installing it we will be able to decorate our zoo in the South America-themed sandbox mode, thus adding touches of the Amazon forest and pre-Columbian civilizations that never hurt. Also noteworthy is the possibility of building the zoo in Andes-style mountainous areas, which offer a few more environmental difficulties than the average of the other biomes, but which at the same time are truly suggestive, especially when the activity is well underway. After all, who doesn't want a zoo that looks like it came out of an Indiana Jones? If from the point of view of the decorations there is very little to say, given that we are talking about a certain number of extra objects that have a purely aesthetic function, the new animals deserve a separate discussion, which are the real fulcrum of the expansion . There are five of them, all with their own needs: the jaguar, the llama, the giant anteater, the capuchin capuchin and the red-eyed tree frog. Like all the other animals in Planet Zoo, even the new ones can only live happily in enclosures that recreate their natural habitat as accurately as possible and that take into account their character. So the player, after placing them, must study them to make their life as pleasant as possible, so as not to depress or starve them. In terms of quality, the animals in Planet Zoo: South America Pack are of the same level as those in the base game. In terms of quality, we do not refer only to their graphic representation, therefore models and animations, but also to the simulation of their behavior, perfectly in line with reality. For example, to make the jaguar happy, it will be necessary to build an enclosure with very thick vegetation and possibly a stream, while the llama will need a lot of grass. Something else? As we said, Planet Zoo: South America Pack is a quantitative expansion, whose features stop at the list of objects and animals added. For a title like that of Frontier it is inevitable that this is the case, since we are something in between the video game and the tool. After all, the policy of Braben's studio has always been crystal clear when it comes to park management: create a base game that is as solid as possible, and then fill it with additional paid content. Judging a similar expansion is therefore really difficult, because it falls into those cases in which it is not only the content itself that counts, but the potential buyer's dedication to the game, that is, it is not one of those packages that can convince anyone to buy Planet Zoo or to go back to it if you have left it. Like all products of the genre, it is dedicated to those who are looking for more variety in the development of their zoo, without affecting the basic gameplay in any way. If we want this is its strength, but also its limit, because it greatly limits its scope.", "date": "2020-04-07", "grade": "7.0"}