{"name": "Pode", "ref": "https://multiplayer.it/recensioni/pode-recensione.html", "text": "The gaming world, especially in recent years, has taught us that greatness can also be found in small things. A high budget does not necessarily mean quality. Sometimes, the more passionately and simply things are done, the more they speak to the player; to make him feel different emotions than usual. This is certainly what the small Norwegian software house Henchman & Goon has tried to do with Pode, a lively and relaxing cooperative puzzle game, even if it has not completely succeeded in its intent. Let's see together perplexities and strengths in Pode's review. We will get out of this together Pode is not one of those games in which the narrative component engages in flights of fancy or particularly elaborate arguments, quite the contrary. The title is entirely silent and ~speaks~ only for sounds and images. However, there is still a very faint narrative line that justifies the sounding out of the actions to be performed during the game. Essentially, a star falls on an unknown earth. Here she meets a rock, which will try in every way to help her find her way home. This common thread lays the foundations for a gameplay deeply influenced by the cooperative component. In fact, you can play the entire campaign in split-screen local co-op. The characters are not ~fixed~. Indeed, it is possible to exchange one's alter-ego with the other player at any time simply by pressing a button (in the case of the PC version, using the Xbox pad, the key is Y). This makes it much easier to interact within the game with your fellow adventurer, as with just pressing a button you can help him overcome a certain obstacle, or you can show him your strategy. The campaign can also be played solo, but the gameplay suffers a lot. So our advice is to try your hand at this adventure with anyone you have within reach: your sister, your partner, your father, your grandmother. The game is so simple (in terms of commands to be memorized) that it can be played by anyone, from the youngest to the over-90s. The real difficulty lies in the puzzles, as the puzzle nature is the strong second half that characterizes Pode. Puzzles in company Pode proves to be a fairly intricate puzzle from the very first moments. It's definitely not impossible and sometimes the puzzles repeat themselves, that's for sure. But some sections (especially those at the end of the level) are quite complex even with two active minds (maybe not the smartest, but still able to find the solution). It must be said, however, that the game is not always very clear about what players must do to continue their journey. To solve certain puzzles, very often, we have stumbled upon the solution by mistake, or (to our deep shame) we have used small tricks due to a not exactly brilliant level design care. Greater attention to these trifles, as well as an eye also for a clearer exposition of the puzzles, certainly would not have hurt, on the contrary, probably would have improved some sequences that push players to the limit of frustration. The title is made up of eight levels plus a central hub, from which to access the various areas already explored again to obtain the collectibles that may have escaped during the previous passage. It took us between four and five hours to finish the campaign. If you like completing a title 100%, you could probably get six, maximum seven hours of gameplay. Of course, the longevity is not exciting, also calculating the fact that there are no additional modes that allow you to return to the game once it is finished or particular sequences that push you to replay the title. However, having the opportunity to play with those closest to us and have fun together for a few hours could make Pode an excellent pastime during the grayest days. Light and color in the depths of the earth The artistic style is undoubtedly one of the points in favor of Pode. The design of the protagonists is very particular. Two antipodes, if you will. A round star, light and bright, and a square rock, dark and heavy. Both, thanks to their peculiar links with nature, allow you to ~paint~ the game world with contrasting but harmonious colors and shapes at the same time. The color palette manages to bring liveliness to the dark caves that the two unlikely friends find themselves exploring. Also assisted by some truly suggestive views, the artistic sector certainly returns an excellent glance. What is certain is that, on a purely graphic level, perhaps the title on PC could have been pushed a bitor more, so as to harmonize more even with the two videos created with the game engine that open and close the story. Furthermore, in several cases we have encountered some problems with the depth, which make it difficult to move precisely through the game world and, at times, force the player to repeat particularly intricate sections for an error that could have been avoided with more careful positioning of the game room. Another small note should be made to the frame rate. In fact, at maximum graphic detail, the game wobbled a bit on our configuration (Microsoft Surface Book 2 15 ~connected for convenience to a Samsung 27~ Full-HD monitor), with several drops even in not necessarily stressful moments. It must be said, however, that we have tried a version of the title that is not yet definitive, so it is likely that they will solve these small perplexities as early as the day of launch. Furthermore, with a more powerful configuration, the problems may not arise at all. Finally, the sound, perhaps the flagship of Pode. In addition to quite suggestive ambient noises, among which we have not found particular criticalities, applause must be given to the magnificent soundtrack, which accompanies us for the entire duration of this small and relaxing adventure. It is clear that behind it there is a great composer just from the main theme that ~envelops~ the main menu. In fact, it is signed by none other than Austin Wintory, acclaimed author of musical commentaries such as those of Journey, The Banner Saga and Assassin's Creed Syndicate. Surely its sounds help to give body and shape to this little title lost in a sea full of giants.", "date": "2020-04-04", "grade": "6.8"}