{"name": "Bayonetta Origins: Cereza and the Lost Demon", "ref": "https://multiplayer.it/recensioni/bayonetta-origins-cereza-and-the-lost-demon-recensione.html", "text": "After a dark period, marked by some sensational missteps and less than brilliant communication, the arrival of Bayonetta 3 represented an essential light at the end of the tunnel for PlatinumGames fans. True, even that phenomenal action has had a troubled development, but at least it has confirmed how the highly appreciated Japanese team led by Hideki Kamiya and Atsushi Inaba is still full of remarkable talents, as well as capable of churning out quality video games. A single test, however , is not sufficient to guarantee the health of the house, especially for anyone who has listened to the apocalyptic rumors that spoke of bad growth plans and serious internal production problems, only marginally resolved by some providential monetary ~injections~. The fact is that, in parallel with the rumors of doom, there were also much more positive comments in which the waters calmed down by describing a simple period of organizational transformation and the formation of new recruits, as well as a discreet list of experimental products in the making, ready to change their face to a software house now known almost exclusively for action games. To these uncertainties and speculations, Platinum has simply decided to respond with a new game, always linked to the Bayonetta universe. Only this time we are not faced with a title all barrel and adrenaline, but a fairytale-looking adventure, which seems to want to narrate the origins of the most unstoppable witch in video games with a delicacy now considered by many to be far from the Sky Building offices of Osaka. Yes, because this curious spinoff called Bayonetta Origins: Cereza and the Lost Demon boasts a painstaking care for the artistic direction almost capable of recalling the good old days of Clover Studio (the regretted team from whose fall PlatinumGames was born) and, even if its unusual look has led many to consider it a secondary production, it is absolutely not the case to underestimate it. Today we will tell you why Bayonetta Origins: Cereza and the Lost Demon is anything but a skippable game, in our review. The story of Bayonetta Origins between demons, witches and... fairies? During the first bars of Bayonetta Origins: Cereza and the Lost Demon, you will have to face the training of Morgana. We assure you that it is easier than you think The plot of the third Bayonetta was half a disappointment, partly due to the forced inclusion of a third ~faction~ in the universe created by Platinum and some important elements of the narrative relegated to secondary texts, when not completely abandoned to themselves themselves. This did not have great effects on the general quality of that title, and indeed the fact that the writing was completely at the service of the game has in some ways allowed the developers to indulge themselves with the campaign beyond all limits. However, with Bayonetta Origins the situation is very different. This is a kind of prequel after all, with a more staid rhythm and pervaded by the clear desire to drag the players into its world; the story is therefore a much more central element in the production, and it is not difficult to realize it right from the start, which puts you in the role of a still naive and fearful Cereza, who decides to become a powerful witch in order to save her mother from captivity to which the other witches of Umbra forced her. Weak and isolated from almost all of her peers due to the taboo broken by her parents, the girl is taken in by Morgana, an exiled witch who teaches her the basics of magic. As obvious as it is, Cereza's quest for power leads her into trouble in record time, so much so that she is dragged into the depths of a dark forest in the company of a demon summoned, for some strange reason, in her favorite rag doll. In a place where nothing is as it seems and fairies rule everything, this odd couple's only hope is a white wolf and the voice of a mysterious boy. The forest where Cereza gets lost in is ~fairy~ in the truest sense of the word. Fairies will be your main opponents throughout the campaign They are simple stories, treated with an atypical finesse considering that among the main writers there is still Kamiya (much appreciated as a director, but certainly not a luminary when it comes to texts), and mainly created to cover some ~gaps~ of Bayonetta 3, with a particular focus on fairies and their nature. Not everything boasts the same level of intelligence, true, due to some slightly too trivial choices and the inevitable tendency of the Japanese team to go overboard on the finale, but if nothing else, a multiverse that is now essential to carry on the brand in the future. Very pleasant personeven the presence of a main narrator, who gives the whole an even more magical and surreal tone during the peculiar interlude scenes, with the latter represented as if they were pages of an illustrated book. In short, we are faced with a title whose narrative it is much more suitable for young players than those to which Kamiya and his companions have accustomed us, yet the greater care placed in this aspect makes it one of the most pleasant in the series in general. Gameplay: hair brothers Cheshire has many forms available in Bayonetta Origins: Cereza and the Lost Demon. They have very different powers even in battle, but all have in common at least one finishing move of some kind on paralyzed enemies The complete change of direction of the game clearly involves the gameplay, even if the transformation is less colossal than one might have anticipated. At the base, in fact, Bayonetta Origins is still predominantly an action, although its structure is completely different from that of the games that preceded it. The idea behind it is very close to that of Brothers: A Tale of Two Sons, the first work of Josef Fares, and exactly as in that adventure, here too two characters are controlled separately, given that each one's movements are linked to a of the two analog sticks of the pad, while the camera is fixed with a top view. The analogies stop here, however, given that the work of PlatinumGames is mechanically much more complex: Cereza and Cheshire - this is the name of his demonic companion - in fact, they have separate and completely unique abilities, which are cleverly managed through the back triggers, and must be used in combination both in the middle of the fights and during exploration, as they are rich in synergies or directly related to the many environmental obstacles scattered around the maps . Cheshire's elemental powers will also be indispensable during exploration But let's start with the combat, because, although the game is full of puzzles, platform phases and pure exploration, the battles occupy a large part of the campaign, as well as revolve around a respectable system. For example, the intuitiveness of the experience is to be applauded: in an action game with two characters that can be controlled simultaneously, the gameplay could be confusing and difficult, yet in Bayonetta Origins the progression of skills and the aggressiveness of enemies are calculated to perfection , so as to allow any player to better master each maneuver. It starts from very simple combinations of shots with few variations, where the only factor to manage is the positioning of the protagonists to avoid damage; going forward, however, things get considerably complicated, and the number of opponents reaches such a variety as to require specific introductory ~presentations~, similar to those seen in the action from which it all started. However, the differences are not only aesthetic; requiring no reaction speed to handle, combat here is mostly built around specific weaknesses to various powers, usable by Cheshire by transforming into four different elemental forms that unlock as you progress through the campaign. In practice, the clashes are almost small puzzles, where at the beginning it is enough to lead your hands at random and avoid attacks to avoid problems, but gradually it becomes mandatory to sharpen your wits, and understand exactly what to use and when to overcome enemy defenses. Cheshire is always a very powerful ally, but to maximize its effectiveness it is necessary to make the best use of its skills based on enemy weaknesses The nice thing is that the Platinum imprint is noticeable even in a system of this type. Each form, to understand, has combinations of shots with specific range and movements that can be freely canceled into each other, while there is a double skill tree in the game through which both Cheshire and Cereza are enhanced, and more maneuvers can be obtained advances such as dodging and special combo attacks when an enemy is paralyzed by the witch's brambles. Ok, such subtleties don't add much to the basic experience (far from difficult), but even here there is obviously a higher difficulty to face once the whole thing is completed, and it's always nice to see this kind of care in the mechanics even when they can be partially ignored. Different speech instead for the bosses: they are few, but in several stages, and they are undoubtedly both the most creative and the most demanding battles of the game. It is certainly not a surprise, considering Platinum's mastery in creating memorable clashes, yet it was not obvious to hit the target in a game so different in terms of rhythm and approach from their class projectsici.A wanting to make a single criticism of the aspects just described, perhaps the progression is even too slow and, while ensuring that every novelty is absorbed without too many problems, it leads the first clashes to be basic when compared to what was faced in the campaign forwarded. However, this is not a particularly serious problem, and it is perfectly logical that the developers have opted for gradual growth. Structure: the land of eternal youth In Tir Na Ng you will have to deal with some of the most elaborate platforming phases of the game. Nothing too complicated, but it is still the case to move with a certain coordination in Bayonetta Origins As already stated, Bayonetta Origins: Cereza and the Lost Demon is not a pure action, but a more thoughtful title, where exploration and puzzle solving often have the same importance as Cheshire's claws. The game is also a very pleasant display of talent, as it boasts a very well thought out complex map, which is extremely pleasant to navigate and retrace once you have the necessary skills to open previously blocked passages. The progress of the game recalls that of the Metroidvania: the direction to follow in the fairy forest is always clearly indicated by the footprints of the white wolf, but it is possible to leave them alone and take the many crossroads available, or after a certain point even re-explore some areas already covered to reveal all its secrets thanks to the new powers of your demon cat. Doing so usually yields useful items - or materials to craft them, as Cereza can mix potions in a cauldron at save points - along with the resources needed to obtain combat skills in development branches. The game maps are more varied and rich than you might think. Furthermore, once you have obtained the necessary powers, you can re-explore them to obtain all their secrets The gathering of these materials is even a little too ~laid back~ at times, but if nothing else fits well with the enchanting atmosphere of the game, and the map design is brilliant enough to always give great satisfaction when you overcome an obstacle previously impossible to pass. In particular, platform sessions that require coordinated movements of both characters to advance, and some very pleasant puzzles that lead to using Cheshire to protect Cereza from certain dangers or simply allow her to achieve objectives using various combinations of powers stand out. Most of these situations also take place in an alternative dimension called Tir Na Ng, to be overcome in order to dispel the illusions of the fairies and to be able to freely continue the pursuit of the wolf who guides the steps of the protagonist. The use of similar levels is very smart, because it has allowed the developers to insert maps in the campaign that are very distant from the aesthetics and typical conformation of the forest, and at the same time it is perfectly inserted in a series where the ~trials in portals~ are a constant presence. The elemental forms of Cheshire in Bayonetta Origins: Cereza and the Lost Demon are enough to offer a good variety However, as examined, perhaps the only elements of the title that have disappointed us reside, starting with Cereza's abilities, undoubtedly much more limited than the powers of the companion. Where in fact in battle the simple management of the brambles is a perfect counterpoint to the many forms of Cheshire, the same cannot be said in the middle of the exploration, where the girl can only interact with certain elements through an elementary rhythm game which in the long run it gets pretty repetitive. Some variation on the theme is introduced later, but the presence of double or prolonged notes to follow adds little or nothing to these ~activations~, confirming them as the weakest aspect of the entire gameplay. These operations are fast enough to never really get bored, but we are sure more interesting solutions to Cereza's magic could have been found. The other flaw lies instead in the balance between puzzles and fights, which in the last third of the adventure begins to gravitate too much towards the latter, mainly due to the numerous Tir Na Ng that can be completed by overcoming simple arenas. They are satisfying battles that require concentration, but given the excellent results achieved we would have liked to see Platinum's designers grappling with more complex maps and puzzles. Art and technique, among warriors, painters and musicians Platinum's latest opus is a feast for the eyes, but the soundtrack is no different Even with the small stumbles described above, one can only praise the work done by the team on the B systems", "date": "2023-03-14", "grade": "8.5"}