{"name": "Bleeding Edge", "ref": "https://multiplayer.it/recensioni/bleeding-edge-recensione.html", "text": "About a month ago we told you about our more than positive impressions on Bleeding Edge. The Ninja Theory side project, whose development was already in an advanced stage at the time of the acquisition of Microsoft, promised to give many hours of group fun, with the only question mark relating to the contents and success in the competitive market. The Bleeding Edge review unfortunately has to lower the shot, precisely because the beta of a month ago had already given us almost all of the content. The scarce amount of modes, maps and heroes does not hide an underlying fun that is undeniable, but these are elements that risk sinking a project ahead of time that instead deserves more breadth. The Hero Brawler from Ninja Theory As we have explained on several occasions, Bleeding Edge is a far cry from other titles that it is accompanied by. It is undeniable that a first look at some heroes of the roster and the setting of the mechanics can refer to the most recent success of Blizzard: Overwatch. However, it is sufficient to delve into the game just enough to start a game and understand how strongly nature is related to your development studio. Ninja Theory can now boast more than a decade of experience in the field of action games. Since the days of the too much mistreated Heavenly Sword exclusively for PlayStation 3, passing through DMC and arriving at the masterpiece Hellblade, the studio now part of Microsoft's internal team has always put action at the center of its projects. Bleeding Edge therefore represents a variation on the theme of the basic setting, passing from single-player adventure to competitive multiplayer, but does not distort too much what are the foundations of the team. Hence the so-called Hero Brawler is born, a particular hybrid between what are the basis of the Hero Shooter and an action with close combat. Choosing one of the eleven available characters, divided into three classes, means putting yourself in command of some of the most characterized protagonists of a multiplayer game, an element that is strongly similar to games like Overwatch and the older Dirty Bomb. The gameplay differentiation also represents one of the great strengths of the title, capable of fielding that dose of variety that allows you not to get tired of the games quickly. Whether you choose a character devoted to damage, a tank or a support, in each of the three cases you will be able to experiment with profoundly different approaches. This variety is further expanded thanks to the so-called mods, a series of individual upgrades that can be unlocked by leveling up with the single hero or by spending one of the two available in-game currencies. The mods represent real active and passive modifiers that allow you to shape the build of your alter ego to your liking, including the possibility of creating different loadouts to be interchanged during the games when the situation requires it. This detail clearly increases freedom and team strategy, two elements that complement the further possibility of modifying one's choices during the race. It is useless to complain currently about the impossibility of banning characters at the beginning of the game or of being able to find yourself without a specific class in your team, all features that are usually introduced with ranked matches. Once you enter the game, in a group or in matchmaking, the game chooses automatically the map and the mode to choose between the classic zone control activity and the recovery and storage of materials. In the first case it's about conquering some specific points on the maps - which in some cases are also mobile - and keep them for as long as possible. The maintenance of the areas allows you to constantly accumulate points, which are then also integrated by the killings carried out. The delivery method is instead divided into two specific phases: the first is the one that requires the accumulation of energy cells, arranged on the map and protected by casings that must be destroyed. Once the collection phase has ended, we are called to deliver the energy in areas similar to those of the previous modality. Obviously when you deliver you are vulnerable to enemy blows, which in the case of killing us, will be able to recover the energy cells still in our possession in order to reverse the situation in seconds. Nothing else? Unfortunately, all these series of deeply positive gameplay elements find themselves having to deal with longevity, which if on the one hand requires experience and many hours to delve into the heroes, on the other it collides with an unsatisfactory roster from the point of view of amount. Eleven pcharacters are very few and the future addition of a twelfth member certainly does not represent that drive to believe in strong long-term support. The same problem is found with regard to the number of modes, as well as the maps that become five in the final version instead of the four present in the beta. Very little stuff for a game that is already called to survive in a world that engulfs all multiplayer experiments of this type and that certainly cannot rely only on the existence of the Microsoft Game Pass to last over the years. any type of general classification, as well as real competitive matches and even more the now inevitable seasons. Although this element was predictable, given and considered the need to wait for a real in-game meta to be created, the total absence of statements from the team on the future of the incoming content (too generic and smoky) certainly does not bode well. That said, it is undeniable that taking part in the Bleeding Edge battles proves to be fun and stimulating. It has hardly happened to us to have so much fun with support characters like ZeroCool, or to feel so addicted to an action combat system, based on combos and skills, which represents the real flagship of the production. Just the group clashes can be considered the real trump card of a production that has tried to best balance such different types of characters. We do not struggle to believe that over the years the characteristics of the protagonists have changed radically, arriving at a variety of possibilities and approaches that perhaps has no equal in the landscape. Each of the heroes has its own basic attack available, a series of class skills and a special technique which, speaking of customization, is also available in two variants so as to better match your style of play or your opponents. The need for team play is also very important. Never as in this case advancing alone leads to certain death, limiting individual actions and betting everything on communication and team strategy. This means that Bleeding Edge becomes very difficult to play solo unless you find opponents in the same situation as you. Nothing to say as regards the technical aspect. At least on PC, where our test took place, the games flow smoothly and without a hitch, also relying on an interesting glance which is certainly helped by a particular artistic style but one of the most successful in recent years.", "date": "2020-03-30", "grade": "7.0"}