{"name": "One Piece Pirate Warriors 4", "ref": "https://multiplayer.it/recensioni/one-piece-pirate-warriors-4-recensione.html", "text": "One Piece is one of those works that needs no introduction: everyone now recognizes the iconic straw hat and the toothy smile of Monkey D. Luffy, a young pirate captain leading the most ramshackle crew that has ever sailed the seas in the fictional universe of Eiichir Oda. After a stunted action adventure in 2019, Koei Tecmo takes care of it once again to let us taste all their piratical power: five years after the previous chapter, we therefore return to talking about musou and to do it in what is now, for a genre in itself extremely repetitive, it turns out to be the best formula. Light, disengaged and fun, supported by a proven narrative system that helps to continue along missions that are inevitably very similar to each other. Yet, even more so if you are a fan of the work, there is a persistent addiction that will lead you to put an end to the main adventure with a certain satisfaction as we will explain in the review of One Piece Pirate Warriors 4. Story: There is a boy captain The narrative arc of One Piece Pirate Warriors 4 begins in medias res, and then leaps back in time to relive the origins of the Straw Hat and his crew and finally continue where the previous chapter left off. Starting from the kingdom of Alabasta, we will continue the journey in search of the elusive One Piece experiencing the most salient moments of an adventure that seems destined to never end: between flashback sequences and summaries that form the glue both within the narrative arcs themselves both in between, the game builds a simple story to enjoy even for those who have never dealt with the series before. The characters are well introduced and explored, just enough to familiarize yourself with them even without knowing the details: it being understood that this is a narrative closely linked to the previous Pirate Warriors and that we are talking about a twenty-year-old narrative universe, it is still simple get closer to Luffy and his world of great battles, pirates of all shapes, sizes and appearances, and little touches of nonsense that will make fans feel right at home. In the twenty hours of play necessary to complete the so-called Narrative Diary, One Piece Pirate Warriors 4 deals with telling the most recent events to end with an unpublished narrative arc thanks to which it reaches the peak of epicness not only in terms of history but also of gameplay. All presented with excellent cel shading and Japanese dubbing that will delight any purist. Pirates and musou: the gameplay After the quick tutorial phase, you find yourself thrown into the middle of a chaos that only a genre like musou can bring to the screen: thousands of enemies to be killed mercilessly, what we could define as cannon fodder for us to experiment with the numerous and very personal techniques that characterize each fighter. It should immediately be made clear that the gameplay of One Piece Pirate Warriors 4 is almost identical to the previous chapter: opposing waves that will pour into every corner of the map, divided into areas to conquer (sometimes out of obligation, others for the simple pleasure of doing it ) as we advance meter by meter to the goal, which in many cases corresponds to a boss in the form of one of the many lore characters depending on the narrative arc you are going through at that moment. Between medium and violent blows, four skills with which to throw even more havoc on the battlefield, occasional side missions but above all the loyalty of the developers towards the very rich roster, the repetitiveness of the game structure almost disappears in the face of the possibility of experimenting in every possible way until you find the character and style that suits you best - although sometimes for plot reasons you are forced to use a specific one. Of course, in the end we are always talking about musou and One Piece Pirate Warriors 4 does not do much to lighten a genre that by its nature is not very varied, but we must recognize the attempt to modernize a formula from which it is not so easy to get away. Starting with the introduction of the ~Titans~, significantly larger than average characters who, once in the game, managed by us or by artificial intelligence, make you feel the full weight of a colossus born to tear apart anyone who tries to block his way. street. We are facing a mammoth force and there is no doubt that being able to control a personified devastation like Kaido brings a lot of satisfaction to the fans, but these giants are the tail light of a boundless roster of characters, perfectly brought back to the screen thanks to the meticulous care of the ddetails regarding the moveset and even characterized by the strengths and weaknesses of the individual: Sanji, for example, as a good womanizer he is, finds himself in difficulty if he is deployed on the field to fight against any damsel. Finally, the possibility of choosing between four distinct classes adds that small strategic component that is useful especially during the early stages of the game, when the characters are not yet developed. The development is not mentioned at random. Indeed, One Piece Pirate Warriors 4 presents a basic but effective progression system, highly devoted to grinding, which will allow you to increase the statistics of the characters and teach them new skills (to be selected in preparation for a battle) both through a system of choral maps , therefore aimed at everyone, both through a series of targeted and different upgrades for each one. Of course, these are not free upgrades, nor does the game rely on common experience points: a combination of money and coins will determine which ones you will be allowed to unlock. Coins are obtained at the end of each mission and are graded from bronze to platinum. Some of these are permanent and can be reused as desired, while others are on consumption - hence the mention of grinding. You will earn enough to cover at least one map throughout the story but if you want to face more complex challenges you will have to allow yourself time to better develop the characters. Especially since the main adventure is just the beginning. Treasure diary In addition to the Narrative Diary and the Free Diary, which allows you to replay the completed missions with a character of your choice among those unlocked, One Piece Pirate Warriors 4 offers the Treasure Diary, designed to take the musou to the extreme as much as possible and offer players something to sweat the proverbial seven shirts for: it is a mode made up of different missions, with increasing difficulty, devoid of narrative coherence and aimed exclusively at sweeping the field from anyone who stands in front of you - even if it were your copy. Yes, because One Piece Pirate Warriors 4 sets no limits in this case and you could find yourself in a bizarre fight Luffy vs Luffy, or any other character on the roster that comes to mind. The peculiarity of this mode is that it is not just a question of taking the field and beating up anything that breathes, because there is an underlying objective: the Treasure Diary is in fact divided into three ~chapters~ which can only be unlocked by responding to precise directives . Of course, the difficulty is bound to go up as you try to scale this peak. The multiplayer mode One Piece Pirate Warriors 4 also features a multiplayer mode that allows you to take part in missions in progress by other players, or host them in turn, collaborating to arrive intact at the goal. In terms of gampleay, nothing changes, there are no interactions between the participants and the goal is to complete the mission with the support of slightly more reactive artificial intelligence allies. Also in this case the narrative coherence leaves the time it finds but clearly playing in company has the sole purpose of having fun together, pace of logical sense. It does not enrich the experience but it is a pleasant alternative to continuing alone for all twenty hours of the main campaign. Technical aspects Finally, from a technical point of view, One Piece Pirate Warriors 4 proves to be solid in its 30 fps, which never wavers even in the most agitated situations where our character is swallowed up by the sea of enemies facing us. As always, the management of the camera remains problematic, which often makes the action more confusing than it already is. The settings take a step forward compared to the previous chapter, showing themselves to be more accurate and full of destructible elements, however they still have an anonymous aftertaste on which we need to work a little more.", "date": "2020-03-27", "grade": "8.2"}