{"name": "Iron Danger", "ref": "https://multiplayer.it/recensioni/iron-danger-recensione.html", "text": "Iron Danger really intrigued us, as you will read in the review, thanks to its underlying originality and willingness to take risks at all costs by focusing on its most peculiar mechanics. The resemblance to other RPGs such as Divinity: Original Sin 2 or Pillars of Eternity is only apparent, because Action Squad Studios, the developer, has chosen to take a completely different path, certainly more difficult, but at the same time fascinating, so much so that we hope to see the game system perfected in a sequel with a wider scope. History The story of Iron Danger follows the story of Kipuna, a girl whose village is attacked at the beginning of the game by the men of Northland, a tyrannical, violent and brutal nation. The situation immediately appears desperate and escape by sea seems to be the only alternative to death, given that Kipuna does not have great fighting skills and in any case cannot face an entire army alone. On the way to the port, however, an old brick floor collapses under her feet and the young woman ends up impaled on a sharp fragment of rock. That would seem to be the end of her, except a spirit manifestation called Aurolith rewinds time to the moment before the floor collapsed and saves her. Kipuna then returns to life with the rock fragment still in her chest, which apparently gave her the power to manipulate time. It is here that Iron Danger begins to unveil itself to the player by introducing the trance, basically a tactical pause that allows the player to program his actions, be they attacks, parries, dodges, movements, throwing objects and more, and to rewind the time in case of errors or even death. Having survived, Kipuna runs into the blacksmith Topi, one of her traveling companions throughout the adventure. From now on he will be the one to fight, still using Kipuna's powers. Together they will reach the port and take a ship with which they will go to talk to the wise Antheor in the capital, who will explain to him what happened to Kipuna and how only she can save everyone from the looming threat, because she is the only one able to touch the crystals that form the l 'Aurolith, needed to form a protective barrier. Once the introductory part is over, Iron Danger shows its role-playing nature more, as well as all the efforts made by the developers to offer something original, starting from the combat system. Manipulating time At first the idea of trance can make Iron Danger seem extremely easy. After all, the power to rewind time makes us practically immortal, doesn't it? Nothing could be more wrong, because temporal manipulation is indeed a big advantage, but the enemy forces are often overwhelming in number and size of the opponents and just as often a couple of blows are enough to knock one of our characters to the ground. Furthermore, the system is much more complex than it seems: our every action consumes the so-called heartbeats and can end up benefiting the opponents if misused. For example, a powerful attack can consume several heartbeats and require a certain recovery time during which the character remains substantially exposed. Furthermore, there are many usable skills, all different, and they must be well timed, if you don't want to miss your opponent, both in attack and in defense, giving him the opportunity to counterattack. The substance is that you often die and many fights are as tense as violin strings, because in addition to winning you must also try to minimize the damage, if you don't want to get to the next fight in great pain. It must be said that the satisfaction of mastering the combat system of Iron Danger is really high and at times it seems to be more in front of a strategic game than an RPG, also considering that to win it is often required to exploit elements of the scenario (traps, explosive barrels and so on) and act as least rashly as possible. Role playing game? To complicate the situation there is also the particular character growth system, which basically does not exist. Kipuna can assign points to his skills at the end of each chapter of the game, but he has no real characteristics to improve or experience points to accumulate to level up. Even the loot is minimalist, in the sense that there are healing items, grenades, portable traps and little else around, but no weapons or armor. From a certain point of view this may seem like a limitation, but in reality the game would hardly have worked if the characters could have become too powerful. Manipulating time is passionate because the player isalways aware of the weakness of his units, which leads him to avoid hasty actions and to better evaluate what is around him. It is true that in the advanced stages of the game skills are developed that greatly facilitate the fights, such as the mental control of the enemies, but in general the gameplay holds up precisely because it does not exceed in making the player omnipotent by giving him easy escape routes. Up to here Iron Danger would be an excellent game, if it weren't for some flaws that hold it back a bit. The most evident is the narrative side, not exactly exceptional. The game world is well characterized, technically it is excellent for its production level, but the story told does not have much bite and, above all, is closed in a hurry. Another sore point are the adventure elements, i.e. the numerous puzzles with which the gameplay is sprinkled. The problem isn't so much that they're badly made, but that time manipulation makes them superfluous, almost a waste of time, if you'll pardon the pun. For example, what's the point of traps if it is possible to rewind time? They actually become a continuous trial and error that gets tired after a while. There are some more intriguing puzzles, but they are overshadowed a bit by the underlying simplicity created by the entire system, which works as well on the battlefield as it is lame when applied to other areas.", "date": "2020-03-24", "grade": "8.0"}