{"name": "Bullet League", "ref": "https://multiplayer.it/recensioni/bullet-league-la-recensione.html", "text": "The abuse of the battle royale genre in recent times has made it indigestible to many, but in this Bullet League review we will try to explain why the Funday Factory title, while belonging in all respects to the category, has what it takes to be the proverbial white fly. Using the weapons of simplicity and immediacy and managing not to tread too much on the microtransactions front, Bullet League can be decidedly pleasant even for those who have deleted the term battle royale from their vocabulary. Let's find out why. Small but combative Bullet League starts off on the right foot, immediately putting the user in a position to play, without getting too lost in chatter: when you first start the application, there is just enough time to take a quick look at the tutorial screen and you are immediately in the middle of one's first battle, albeit in the company of rather malleable bots. The basic dynamics are typical of battle royale: you start together with 31 other fighters without equipment, and you have to run around the map collecting weapons, resources and ammunition with the aim of being the last to survive as a circle gradually tightens increasingly reducing the usable scenario surface. First of all, Bullet League differs from the vast majority of its colleagues by choosing to use a two-dimensional game plan, for gameplay reminiscent of old-school shooters but without disdaining more than a few intelligent nods to modernity. The simple and intuitive control system features a stick on the left for movement and two virtual keys on the right for jump and fire, while the inventory at the bottom of the screen allows you to change weapons, reload or use healing items with a quick tap. It all works well enough to allow fast, adrenaline-pumping battles, without the risk of blaming any failures on software deficiencies. The developers then put their own into it, enriching the gunplay with a series of very well-implemented details, starting with the eight different weapons available (pistols, machine guns and rifles up to the bazookas) which allow you to use different tactics depending on the tool shouldered. Another interesting strategic nuance is the possibility of exploiting the recoil of weapons to slow down the descent after a jump, a technique that can make the difference on the battlefield. The same maps then offer an intelligent design, which includes areas in which to hide, secret areas and platforms galore, an aspect that goes hand in hand with a further peculiarity of the title, or the instantaneous creation of blocks: by spending the crystals that are obtained by picking certain rocks, cubes can be created to be used to have support in mid-air, or to erect protective barriers or to set traps for opponents. In short, behind its apparent simplicity Bullet League hides an appreciable stratification that can make it attractive to both the more casual and more seasoned players, even if the repetitiveness of the action is a congenital defect of the genre that peeps out here considering also the only three modes available (all against all, in teams and match between friends). The progression model designed by Funday Factory is instead quite honest and does not push too much on microtransactions, obviously present and which give an undoubted advantage to those who want to use them over the others: however, there does not seem to be a palpable disparity during real battles, also because matchmaking tries to avoid throwing lambs in matches populated by sharks. In any case, the coins that are obtained by playing are used to upgrade the weapons whose projects have been obtained by opening the inevitable prize boxes, which in turn are given sparingly but can be purchased with crystals which are in fact the currency premium obtainable mainly in exchange for real money. Nothing new under the sun, therefore, but Bullet League must be acknowledged for not being vampire-like in this delicate situation, except for one fortunately completely optional element which leaves us quite dumbfounded: in fact, it is possible to subscribe to VIP subscriptions lasting a week or a month which guarantee substantial bonuses but at frankly armed robbery prices. A bad fall in style that doesn't ruin too much the picture of a really successful overall battle royale.", "date": "2020-03-19", "grade": "8.0"}