{"name": "Call of Duty: Warzone", "ref": "https://multiplayer.it/recensioni/call-of-duty-warzone-recensione.html", "text": "Parachute onto an area of the map, obsessively search for interesting equipment, escape to the safe zone, try to be the last group left alive. This formula, hackneyed in the last few years, is the one that most addicts to that slice of gamers who can't do without the Battle Royale mode. Just like when Fortnite was released (in the now very distant 2017!), the title of Infinity Ward has managed to cause a stir and amazement, since before its release, loudly requested by all fans of the decades-old franchise. And in fact it doesn't upset anything at all, on the contrary, it leaves everything exactly as it has already been done for other titles of the genre. But it does it with style, personality and a little cunning, giving away a free-to-play that perhaps, due to the quality and quantity of content, could easily not have had that ~free~ in the definition. The size of the map, superior with difference to any other competing title, the cleanliness of the image, the feeling of the weapons, the gulag, the means of locomotion by land and air and the Plunder mode are just some of the strengths that we are going to analyze in the Call of Duty: Warzone review. But let's go in order. Battle Royale mode The queen mode - Battle Royale - of Call of Duty: Warzone immediately makes it clear what we are dealing with, giving vent to all the typical visual power of the series with a personalized introductory movie. We can play it both alone and with two other adventure colleagues, and obviously the return in terms of fun and immersion is exponentially greater in a group. Once on the plane, you can view the map and indicate to one of your companions a point on it where you can start your raids, with the others who can either confirm the position, or reject it and recommend another. Note the graphic gem of the writings of the various districts visible even during the flight, which make everything really easier to store once you have played more than a few games. Once on land the watchwords are: ~search~ and ~hurry up~. In fact, there isn't much time to wander around the map in search of the best possible loot, so frenzy is the mood that pervades the first few minutes of the game. The ~search~ refers to searching the various equipment crates scattered throughout the buildings in the play area. These are identifiable by a hiss that gets louder as you get closer, and are also divided by color, blue for the rare ones, gold for the legendary ones. Inside them you can find money, weapons, armor, accessories and many other useful things. All while always trying not to get caught by the deadly gas that will inexorably force you to move continuously. Once you have something decent, you move on to the other watchword: ~survival~. Always keeping the map and the safe zone under control, you will have to try in every way to return within the white circle of life, for the longest possible time. You will also be helped by the inevitable supply stations, where you can buy series of kills, UAVs, equipment boxes and armor. Continuing to survive between a shootout, a sniper and jumps from buildings, if you are the last one alive you will have the victory. Said like this, it almost seems like the usual clone, but there are some really interesting peculiarities that manage to raise the Call of Duty: Warzone bar a lot. The first is the fact that you can use ~base~ Call of Duty Modern Warfare equipment. Every now and then, with an attached warning on the screen that is impossible not to view, crates will be released on the pitch with all the equipment you have saved in the Call of Duty: Modern Warfare armory. This makes the Battle Royale mode to all intents and purposes a pretty big appendix of the entire multiplayer sector of the main game. This is also supported by the fact that all the experience accumulated and the kills with the various weapons will give you the possibility to unlock bonuses and levels just like in all other modes. Small note: these equipment boxes are exactly the same ones that can be purchased at refueling stations. The second is the feeling with the map. There are spots in the play area that are very recognizable to first-hour players of the main title. There are places like the Superstore, Karst River Quarry, the international airport, and other points that are more or less faithful reconstructions of the maps used in the other game modes, which makes everything really more immediate. The real flaw lies in what happensgives up after death. Even if in fact it is one more opportunity to be able to come back to life and help one's companions, the 1 vs 1 challenges in the Gulag are not exactly the best. After dying you will be taken to the Soviet prison (which can also be visited during the game, which is highly recommended because it is full of crates) where, after waiting your turn fighting with the other dead players, without damage of course, you will be sent to the shower area already seen in other modes, with only one weapon available and 2 throwing equipment, one lethal and one non-lethal. After the countdown you will have to be able to kill your opponent in a very short amount of time: if you succeed you will be freed from the Gulag and you will be able to be reborn next to your fellow survivors. The possibility of being able to come back to life once per game in this way is certainly appreciable, but when the facts are counted, it is all too frustrating, almost to the point of not wanting to have this second chance and relying only on the other way of being able to resurrect, and i.e. the God of money. Our companions still alive, if they wish, will be able to call us back to earthly life by spending $4,500 at the refueling stations. Everything has a price, however, beyond the economic one. Every ~important~ action you perform will make you more visible to the enemy; for example by buying the aforementioned equipment crates, you will have to throw a red smoke bomb to land the crate at that point, which is obviously attractive to any bad guy, eager to get their hands on your equipment and your dirty money. means of locomotion, land and air, give their dose of help in being able to complete the challenge and stay alive. These are marked on the map with icons and range from fast quads, just for 2 people, to trucks, to helicopters. However, once you get hold of the vehicle, you will have the misfortune of being marked on the map with the vehicle you have chosen marked in red, so use the vehicles carefully or they can become a double-edged sword. Another peculiar mechanic is that of contracts . For the game map during your raids, you will notice icons with magnifying glasses, those are the contracts, mini-missions that will provide you with extra money, ammunition and weapons. they are normally limited time, so they add that extra adrenaline to the context which never hurts. In addition, some of them require you to kill a certain target, which is useful for identifying the position of one or more enemies without the aid of the UAV (impromptu trick on the fly ed.). The heaviest Swag The other mode within the mode, and the one that in our opinion is truly the novelty brought by Call of Duty: Warzone, is precisely the elusive Swag. You will always have the possibility to create a team of 3 players, you will always have the possibility and the need to wander around the map and look for weapons, upgrades, armor and so on and so forth, but there are no various circles and safe zones hand to hand smaller hand. In addition, if you die you will not find yourself in the annoying Gulag, but you will reappear after a small amount of time, exactly like in the other multiplayer modes of the dad Modern Warfare. In fact, at first we didn't give ~a penny~ to this mode but then, pad in hand and fairly skilled companions by our side, we began to understand that it is instead the real flagship of the production. Without the constant anxiety of necessarily having to escape from something, you play much more serenely, even if in any case there is also a time limit (30 minutes) and a purpose, that is to be the scrooge on duty at the end weather. How can I make money? Always with the same mechanics of the Battle Royale mode, looting chests, completing contracts and killing other players, with the difference that in this mode you will be rewarded with much more money. As you play, below you will have the opportunity to keep an eye on your position in the ranking of the various teams in the match. In fact, the bar does not give a real indication of all the teams and their Loot, but only of yours and that of the first team in the standings, with periodic updating of your general position. However, it is not enough to accumulate money to win, or rather, the best thing to do in order to win is to keep it safe, given that by dying a large part of it is lost. How to do? there are 2 ways: the first is through the Recovery Balls, usable on the road but with a limited capacity. The second is through the helipads, unlockable only after obtaining a certain amount, which they haveinstead unlimited capacity, but which will expose you much more to enemy fire, since they can be traced on the map and in addition the helicopter really takes forever to restart. The last phase of the matches will take place more or less always trying to kill the team that is in first position, highlighted by an icon on the game map. The technical sector The graphics in Call of duty: Warzone are simply stunning. As we said at the beginning of the review, even just the introductory movie makes us visually realize what to expect. Once in the air the view is phenomenal, Verdansk is large and diverse with its port and mountains in the background. On the ground, one can only confirm the goodness of what is seen from above, except for some sporadic textures that are not exactly in very high definition and very slight loading problems certainly due to these days of very high traffic. But it is precisely the net-code, net of these little problems, that makes the experience even more interesting. During our tests we very rarely had to deal with lag or loss of connection to the server, and it is no small matter for a title based on the robustness of the network. The games then always started within a few seconds of launching the command, to confirm the goodness of the server, the massive presence of players and connection. Among other things, the title immediately gathered a very large community. Finally, the sound sector does justice to the rest and above all to the series in general. It is known that in the various Call of Duty there has always been a great deal of attention to the veracity of the environmental sound effects and weapons, and even here we can only applaud Infinity Ward. In headphones it is decidedly immersive with shots in the distance, moving vehicles, breaking glass and clearly distinguishable footsteps of enemies. So is this the best exponent of the sub-genre? Well it mostly depends on what awaits us in the coming months. Even if Infinity Ward has already declared that there will be dedicated events and collaborations, we will have to evaluate how the community will survive the time and how the title will age. But surely, now, it is definitely the best and most complete Battle Royale experience you can find and try.", "date": "2020-03-18", "grade": "8.5"}