{"name": "Fifa2007", "ref": "https://multiplayer.it/recensioni/fifa2007.html", "text": "A very old hen is starting to make a moderate broth Let's face it: this Fifa has been in the breach for years, probably longer than some of you who are reading. Born in 1994 on Megadrive, after the first years of undisputed reign, EA football found a formidable rival in the PES/WE series, initially only from a qualitative point of view and then also from a sales point of view. Since then, the goal of Electronic Arts (which has always been superior in terms of licenses and other secondary but still welcome trappings) has been to take back its place on the throne, and to do so, it is useless to make fun of , at least for the moment it has followed the old Chinese adage ~if you don't liesci do something better than lolo, copy them palo palo~. But we will talk about this after having thoroughly analyzed which game modes are made available to us. The ubiquitous ~friendly~ allows you to play a quick match between friends and without obligation; as usual there is then the possibility of training in the ~Practice~ mode or participating in existing tournaments (world cup ;) and so on) or creating personalized ones by acting on a large number of variables. Manager Mode is back, a welcome change from last year A very old hen is starting to make a moderate broth [C] Who is it? Spartacus Balambam? Corriere dello Sport also asks for it As usual, there's plenty of room for you. plenty of introductory scenes [/C] The Challenge mode instead requires the player to complete a large number of ~scenarios~, ranging from recovering three goals in a game that has already started to the ~simple~ victory of one of the championships. There's something to get excited about. For online there are two possibilities: a simple quick match or the ~Interactive Championships~, where each player can represent his own team in multiplayer clashes that faithfully follow the real calendars of the various national championships. Last but not least, the Coach mode is back, a welcome novelty from last year that allows the player to create an alter-ego to take over the reins of the team and worry about various aspects: looking for new talent, deciding on formations, organize training sessions, find sponsors and whatever else is required for the management of a team, always keeping an eye on the monetary balance (presidents have easy dismissal even in video games). As in the first incarnation, this mode is quite simplified and shallow, but we certainly cannot expect a Championship Manager within a title like this. A gordo does not make spring As already mentioned above, the dejavu felt by playing Fifa 06 due to the strong resemblance to the Konami football series has amplified. To (strongly) improve the playability of its product, Electronic Arts has chosen to get as close as possible to the mechanics of PES rather than developing an original game system; this, at least for this time, has undoubtedly paid off. The movements on the pitch and the textures of the game have been refined and it often happens to be able to score goals that are as beautiful as they are realistic in their dynamics. The high and low through balls have been made a little less ~foolproof~, and the computer-controlled players on your team follow the action quite well and almost always find themselves in the right place at the right time. The defensive smudges have not been entirely correct, but we can say that currently there is no football title capable of solidly simulating the right mechanics of the defensive game. Last season's flaw where CPU-controlled players didn't seem capable of making foul calls has been rectified, and now you finally have the opportunity to take some free kicks during a match. after years and years on the verge of mediocrity, Fifa is really starting to entertain A gordo does not make spring As in many other football titles, the game in midfield is a bit penalized, and often the actions take place only in the vicinity of the penalty areas, giving users plausible maneuvers only from the three quarters of the field forward. Furthermore, in narrow spaces, there is a certain embarrassment: from this point of view, the EA title still has a lot to improve. The passes, low shot or cross that they are, need some further tweaking, since too often they are not directed where the user would like or in any case towards players completely unrelated to the action (defect also found in PES, albeit to a lesser extent). Even the shots are not flawless and suffer too much from the ~high over the bar~ syndrome. On the other hand, crosses and game changes areimproved, and the ~remote controlled~ effect is noticeably attenuated. Unfortunately, we cannot yet speak of a good physical simulation of the ball: despite appreciable improvements, it is still heavily below the standards of the competition, which in the meantime is certainly not standing by (small preview: it seems that PES 6 will be the best ever seen so far ). The game has a speed regulator, which can be set to three different values: those who want to increase the ~arcade~ effect can play at high speed, while medium or even slow speeds are recommended for those looking for realism. Finally, leaving out the details for a moment, what is really pleasing to note is that after years and years on the verge of mediocrity, Fifa is really starting to entertain. Materazzi's corner Football works wonders: thanks to a bald fake and without the slightest dignity, Marco Materazzi has rightfully entered the list of my favorite players. As you already know, our favorite number 23 never appears in the last chapters of the Fifa series, and a player with a fake name is put in his place (although a report aired on Striscia la Notizia on Thursday 19 October, when I had already finished writing this article for a while, does not specify the thing at all, suggesting for who knows what reason that this is the first time that this has happened, Editor's note). We have all noticed that our Matrix is not very well received by the world football federation, but I assure you that its absence is just a murky issue related to image rights. In any case, I thought it was right to dedicate a corner of his own to him, both for his undoubted sporting merits and for a sort of small compensation after the blatant injustice he suffered at the end of the world championship. So go with the Materazzi Gallery! Materazzi's corner Materazzi's corner Materazzi's corner Graphics and sound Also in the case of the graphics sector we can say that things have improved compared to the past. The stadiums and turfs look good, but after all they have always been the strong point of the series. On the other hand, the side was discovered a little by other elements, such as the design of the players, which looked like a sort of animated mannequins, and precisely the animations applied to them. In this 07 version we can see, apart from some bugs (such as the lateral foul hit with a knee), a general improvement in the quality of the movements, which, although far from perfect, are now more natural. The main problem is not represented by the animations themselves, but by the connection between them, which is often wrong and makes the movements seem a bit woody and jerky. [C] Kielce v Darlington. Matches of this prestige can only be played in FIFA What a beautiful entrance from the back! But where are you running? And stay down, nor is... [/C] many players have magically become resembling their real-life counterparts Graphics and sound On PC the graphics engine is light, and in all versions the phenomenon of low fluidity that was present last season is considerably reduced. Fairly improved situation also regarding the similarity of the players with their real counterparts: while in Fifa 06 most of the players were practically unrecognizable, now many of them have magically become similar (with various illustrious exceptions of the case, such as Toni (totally different) and other athletes. As far as the sound is concerned, we can also summarize to the extreme: usual good commentary and usual very rich soundtrack gyoung, now a trademark of Electronic Arts, accompanied by new chants of fans (one of which, well, really famous). Cross-platform As usual (at least for these ~old gen~ versions) the consoles are technically a step behind the PC version, which can boast higher resolutions and filters such as anisotropic and antialiasing and blah blah blah. Among the only consoles, the palm belongs as always to Xbox, followed this time by PS2 (Gamecube has a strange ~fogged~ effect on the graphics). For online, the best solution is Xbox, which does not suffer from lag and does not require you to register on EA Nation; the worst is Gamecube, which just doesn't have it online. Ultimately if you want Fifa 07 take any version but not the Gamecube one. Final comment Last year, reviewing Fifa 06, I spoke of a ~glimmer of light~ that returned to being seen after years of almost total darkness. Well this opening has fairly widened, to the point of allowing us to see each other much more clearly. Fifa 07 still takes many elements from Pro Evolution Soccer, but this time the ~inspiration~ work has succeeded better than ever, and is enrichedor by a series of ~surrounding~ features that are undoubtedly pleasing, online mode in primis. What we'd like to see in the future is a truly alternative and solid, stand-alone soccer game, and Electronic Arts certainly has the wherewithal to do that. For the moment, in any case, let's enjoy the best Fifa ever created.Pro The best FIFA ever Very interesting online Fun and full of Counter modes Physics and animations still not optimal Too ~inspired~ by PES... Groundhog day We are back to groundhog day, the one in which, according to a famous film from a few years ago, the same facts are repeated over and over again until a particular condition is met. In the videogame world this event occurs again at the release of each new Fifa, what happens with punctuality is the heralding by EA of an epochal improvement compared to the previous version, and the particular condition to be met to finally get out of the vicious circle could not be other than the fact that this improvement, once and for all, is actually implemented. Last year, thanks to the addition of some ex-KCET members - programmers of the quintessential rival Winning Eleven - something started to move in the development team, but the efforts were not yet sufficient to approach the popular Shingo series Seabass Takatsuka. However, we can assure you without fear of contradiction that we have worked hard over the last twelve months, and the result proves it. As? Don't believe it? Well, read on.", "date": "2006-10-23", "grade": null}