{"name": "War Tortoise 2", "ref": "https://multiplayer.it/recensioni/war-tortoise-2-recensione.html", "text": "The War Tortoise 2 review catapults us into a world that is decidedly different from the one we know, in which human beings have become extinct to give way to an unexpected evolutionary step in which animals dominate the planet. However, let's not talk about beasts but something else: anthropomorphic rodents, hamsters and turtles who have formed an alliance and together fight a back-breaking war against hordes of giant insects and other fearsome creatures. The formula of the shooter developed by Foursaken Media does not differ much from the beginnings, in the sense that our task, riding a huge war turtle, will always be to move the viewfinder of the weapon and target all the enemies that try to get closer in a series of increasingly dense and numerous waves, enriched by the presence of huge bosses. There are two substantial innovations: the first lies in a very interesting territorial approach, with various objectives placed on a map and the obligation to join them while we continue to fight undaunted, trying once we arrive to consolidate the position or leave immediately for a new area; the second is represented by a decidedly improved technical sector, which makes the visual impact of the experience much more captivating. Gameplay and structure Just like in the first episode, in War Tortoise 2 we will be dealing with very simple and immediate touch controls, which can be managed with a single finger on the screen to move the crosshair and give way to the system to activate the automatic fire. The turtle we are on moves by itself once the coordinates have been set, so all we have to do is defend it from the advance of a huge amount of enemies, divided into various different types: from spiders to fireflies, from toads to trolls. In the middle of the action we will be able to call up a menu and spend the money earned with the various eliminations to unlock upgrades that give a nod to MOBAs and which allow not only to increase the effectiveness of our shots, the resistance of the ~vehicle~ or modify the main weapon, but also send ground troops into the field with equipment that can also be improved, capable of asserting themselves and thinning out the enemy ranks. In case of difficulty, you can camp for a few minutes and recover energy or use the currency valuable, which the game bestows in a relatively generous way, to obtain a quick injection of health and continue one's advance undaunted. At game over we will also be able to count on limited ~continues~ or give life to a new generation starting from the base but keeping many of the upgrades obtained up to that moment. The limits of the experience are exactly those that also characterized the original War Tortoise; therefore, in addition to the inevitable (but not stringent) freemium mechanisms, we are mainly talking about a sense of repetitiveness that can arise quite quickly, especially if you play the game continuously and not extemporaneously. Unfortunately, the music does not improve the situation, given that even 'they tend to repeat themselves: a greater variety of the soundtrack would certainly have helped. However, it is appropriate to reiterate the excellent work done from a technical point of view: there is really a big difference between the graphics of this sequel and that of the first chapter.", "date": "2020-03-17", "grade": "8.3"}