{"name": "Rainbows", "ref": "https://multiplayer.it/recensioni/rainbows-toilets-unicorns-recensione.html", "text": "There is something very, very wrong with the Rainbows, toilets & unicorns review you are about to read. But we don't believe it's the writer's fault (not entirely, at least), but rather the intrinsic madness of the entire title. It's a strange feeling: that of those who have played this bizarre Shoot 'Em Up on Nintendo Switch and lived to tell the tale. He just doesn't know what to tell, between unicorns defecating rainbows, flying priests shooting laser beams and a boss that looks like a Ninja (the Fortnite streamer, that Ninja). We will try to tell you about it, because there are two cases: either you will have found the game of your life, which will take you hours and hours without even realizing it; or you will finish this piece disgusted, print it and set it on fire as a mere attempt to exorcise it all. Rainbows, toilets & unicorns, let's specify it immediately, is now available on Nintendo Switch, and will also arrive on PlayStation 4 on March 16, 2020. We have tried the Nintendo Switch version. Plot: a rainbow ice cream to fly in the sky Rainbows, toilets & unicorns even has a plot, a detail that is not at all obvious in a production of this type. It is a narrative based on nonsense, a refined and detailed nonsense, but by no means discreet. The protagonist (whose name is withheld, perhaps it's better this way) decides to tackle environmental heating by enjoying a nice rainbow-flavored ice cream. The story doesn't end well, because the prized dessert immediately causes problems in his intestines, forcing him to evacuate to the nearest available public toilet. Here begins his journey in the company of rainbow unicorns. The writer has never taken drugs: what you have just read and will continue to read is the result of the unhealthy and yet fascinating imagination of the Fantastico Studio developers, an Italian team made up of five people who we hope never to meet (just kidding, if you want an interview, talk to the secretary). Now, all this narrative pretext serves to justify the presence of a flying protagonist who will fire on everything and everyone with his flying unicorns, moving vertically (strictly vertically) aboard a flying toilet. There are five game worlds in all, one stranger and crazier than the other, on a journey that seems to refer to a surrealist dream rather than the inner path. Gameplay Rainbows, toilets & unicorns, from a gameplay point of view, is a Shoot 'Em Up of the Bullet Hell type: sectoral swear words that want to help you immediately understand what you will be facing in case of a purchase. In other words, a vertical screen, after the background, the protagonist and the enemies ~scroll~ upwards, with increasing speed and intensity. On the left the image of the hallucinated protagonist remains fixed, on the right some indicators remind the player how many crystals he has collected, how many enemies he has defeated, and other parameters worthy of attention (they are few, but all fundamental. The player fires upwards, moving the character left and right, enemies come at him from above and shoot back. They are resistant and many, the main hero is only one and (if you don't have a shield) he will die as soon as he collides with a bullet or a hostile life form. From this point of view Rainbows, toilets & unicorns is really an old school title in its setting, punishing and nasty: there are no saves, there are no checkpoints; if you get hit and die while playing a level, you have to start all over again. This leads the player to perfect their skills, and to gain a greater sense of fulfillment with each completed world. Your Rainbow Unicorn's attack power grows as you destroy enemies, and collect their purple crystals; other power-ups of various types are randomly dropped by the opponents themselves, but often collecting them is risky. Each world has three bosses to defeat: most of the time they have repetitive and unconvincing attack patterns, but this does not mean that the challenge offered is not difficult anyway. Also because collisions and graphic details are not as perfect as the situation would require. Artistic direction Rainbows, toilets & unicorns, if you haven't understood it so far, is a crazy production that seeks a compromise between sympathy and at least acceptable gameplay. Once you accept the idea behind the artistic direction (that is nonsense), everything else comes by itself and is understandable. No wonder, therefore, if the Pope is among the bosses of the first world, and if Tyler Ninja Blevins and Nusret Sa arrive in the secondlt Bae (the one from the salt memes, you know?) throwing laser beams. But the search for sarcasm at all costs, after a while, inevitably tires; and not all players, among other things, will be able to enjoy the last worlds, where there is no shortage of references to Marvel and Disney among other things. The technical and graphic sector on Nintendo Switch is acceptable. The least cared for aspects of the entire production, paradoxically, seem to be the models and design of the enemies present, as well as those of the objects they throw or the projectiles they shoot. But in a production of this type, also taking into account the budget invested and the results obtained in any case, it can be postponed.", "date": "2020-03-14", "grade": "6.2"}