{"name": "Beautiful Desolation", "ref": "https://multiplayer.it/recensioni/beautiful-desolation-recensione.html", "text": "Beautiful Desolation, like this review, begins inside a car where we find a couple intent on talking about family problems. We are in Cape Town, South Africa, in 1976, but we will see very little of that era. In fact, a huge object falls from the sky and, despite being at a certain distance, produces a shock wave that overturns the car. Ten years later Mark Leslie, the only survivor of the accident, can not find peace for what happened. The Penrose, this is the name of the immense artifact of unknown origin that changed the lives of his nation and of the whole world, does not convince him. For the government it was a kind of divine gift that allowed mankind to progress, making it discover the most advanced technologies of fusion between men and machines. Leslie, however, believes that there is something else behind it: since the Penrose arrived on earth, an endless war has broken out between the devotees of the gigantic technological messiah and the resistance of those who do not want to bow to what has become a real dictatorship , with humans looking more and more like automatons. The only one who can help him is his brother Don, a former war veteran, who with his tourist plane will take him on the Penrose in search of the truth. After a short search the two will be transported to another dimension. This is where the incipit ends and the adventure comes alive. Game mechanics At the beginning we are curious to understand what the Penrose is, but after a few hours spent in the alien dimension many other questions arise, all born from the incredible narrative side from which the gameplay is characterized. Beautiful Desolation is a very classic point and click adventure in which you examine objects, collect useful ones, combine them in your inventory as needed and use them with other objects in the scenario or with non-player characters. In terms of structure, it is very reminiscent of Stasis, the previous title of The Brotherhood, but also more remote classics such as Sanitarium. The scenarios are viewed from above, with the options menu at the bottom of the screen, which allows you to call up the inventory and the various logs filled with conversations and documents. The places that can be visited are all designed with great taste and some are truly spectacular to look at, despite the technological essentiality that characterizes the entire title. During the multiple-choice dialogues, the reference to the first Fallouts also becomes very strong, with the interlocutor visible in a window in the center of the screen, surrounded by the interface. Naturally, RPG elements are completely missing here, although the various selectable phrases allow Mark to be interpreted in a certain sense in different ways. To shore up everything we think of some mini-games, one of which stages the rare fights in which history invites us to participate, which in any case represent a marginal aspect of the whole experience, also because fortunately they are optional. We are faced with a pure adventure and we must live it as such. Point and click adventure Beautiful Desolation is a game of observation and deduction rather than exploration and progression. To move forward, the player is required to be able to grasp the suggestions contained in the numerous dialogues and in the scenarios themselves, motivating him with an excellent narrative construction, which becomes more and more interesting as one delves into the secrets of the title. We're talking about forty hours of gameplay (overall by replaying and trying all the possibilities, otherwise you'll finish with about 12-13 hours) full of themes and problems that video games usually deal with superficially or not at all. However, the focus of the player's action is the resolution of the puzzles, which often requires a considerable effort. Many gamers don't like to reason or spend time studying the clues that are provided to them in a contextual and non-direct way to understand what to do. By now, when one gets stuck for a few minutes looking for the next move, one immediately speaks of bad design, without considering that that stop could be intentional, i.e. that in the void created by the lack of a guide in play there is the most playfully interesting part of the whole experience, the one that in any well-made graphic adventure you carry with you even when you've pressed the Quit key, because you keep mulling over it trying to put the pieces together, even when the solution seems impossible. Beautiful Desolation is full of moments in which you have to confront the game to prove that you have understood, that is, that you have not read some important dialogue inattentively or have not left out some clues. This is why we are not surprisedthat it is necessary to go back and forth several times between the various places visited, to verify that everything has been found and that all the dialogues have been exhausted. It's basically a point and click adventure and that's how it works and how it should work. The goal of the genre should be to stimulate the player's reasoning by making him experience a wonderful adventure, not to take him by the hand and guide him step by step. After all, for many, including the press, ~good~ modern design is that which considers the player an imbecile, unable to take a step on his own without going into a crisis, and often it is the player himself who is happy to be considered as such , in order not to get stuck seeing himself debased in the ego. Problems Obviously Beautiful Desolation has its problems and some are even macroscopic. As mentioned, we are not among those who despise backtracking in graphic adventures a priori, but having added objects that can only be found if you pass over them sometimes makes exploration a bit obsessive. The game is structured in scenarios that are unlocked by performing certain actions and which become accessible from the map. Some of these are very large and the awareness that there could be hidden elements naturally leads to going through them inch by inch so as not to miss anything and to redo everything when you are stuck without knowing what to do to find out if you have missed something. It is true that in most cases the solution that escapes us is in some dialogue of which we have not grasped all the nuances or in some document that we have found and have not examined carefully, but it is inevitable that sometimes we let ourselves go what we would call the desperation of the adventurer in the throes of a nervous breakdown. Another problem, all Italian, is that there are no subtitles in our language. Beautiful Desolation requires excellent knowledge of English to play, given the amount of texts it contains and the language used, which is not always very accessible. Unfortunately, going to ask the developers to add the Italian translation is not a solution, given the low sales made by the game at launch.", "date": "2020-03-13", "grade": "8.5"}