{"name": "Project Zero: Mask of the Lunar Eclipse", "ref": "https://multiplayer.it/recensioni/project-zero-mask-of-the-lunar-eclipse-recensione.html", "text": "Fatal Frame: what a fantastic name for a survival horror in which cursed spirits are faced using a vintage camera which, as in the more traditional ghost stories, is capable not only of imprinting the appearance of ectoplasms on film, but also this case also to absorb their energy, dealing damage to them with each dash until they are dispersed. Absurd that it was changed to ~Project Zero~ in Europe due - it is said - to a trivial translation error. There is no doubt that the sources of inspiration of Makoto Shibata, who created this series in 2001 on PlayStation 2, are terribly fascinating: haunted houses, even islands invaded by dark presences as in the fourth chapter of 2008 or cursed mountains, the ones we saw in the more recent Maiden of Black Water. Fatal Frame draws greedily and shrewdly on the legends of Japanese folklore and today, just like a restless spirit, it longs to return. Project Zero: Mask of the Lunar Eclipse, Ruka remembered leaving the gas on A path that passes from the re-proposition of the best episodes released so far to rekindle enthusiasm, a re-proposition that in the case of Fatal Frame 4 was a must given its great popularity. However, how much does nostalgia weigh and how much concreteness in the making of this remaster? Has the nightmare remained the same or has it lost its ability to instill fear after all this time? Dark room and flashlight pointed at the face from below, we tell you how it went in the review of Project Zero: Mask of the Lunar Eclipse. History: a nightmare from the past Project Zero: Mask of the Lunar Eclipse will see us explore abandoned buildings in the dark, because doing it during the day would have been too smart The story of Mask of the Lunar Eclipse revolves around five girls who share a traumatic experience: when they were still little girls, they were kidnapped by a man and taken to a cave on Rogetsu Island to take part in a mysterious ritual. On that occasion a policeman rescued them, but a few years later the drama resurfaces and two of them are found dead, apparently by suicide. The survivors of the group, Madoka Tsukimori and Misaki Aso, feel the need to clarify what happened and therefore decide to go back to the island, which after the spread of an inexplicable epidemic ended up deserted and in ruins. However, the spirits who inhabit this place awaited their return and, despite the support of the legendary Camera Obscura, manage to trap them in a limbo between life and death. So it's up to the last one left, Ruka Minazuki, to take a ferry to Rogetsu, strictly at night, and return to the abandoned hotel where it all began and where her friends got stuck. At the same time, however, the policeman who had saved the girls also finds himself on the island, equipped with a flashlight with the same powers as the Camera Obscura. It is therefore a choral and multifaceted plot that is told by the game, which among the numerous references to the Japanese ghost stories he inserts a story with disturbing features, which is gradually revealed through the documents and testimonies left by the people who have come into contact with the dark evil that inhabits the houses of Rogetsu and have not survived to tell about it. Project Zero: Mask of the Lunar Eclipse, the presences that suddenly appear can be immortalized with the Camera Obscura to earn points The direction of the game, signed by the aforementioned Makoto Shibata, brings into play all the typical gimmicks of this kind of production, making ghosts appear behind the protagonists, in the reflection of a mirror or in the slow gait from a door that opens creaking. As we wrote in the tried and tested Project Zero: Mask of the Lunar Eclipse, the sequences are less impactful than in the more recent Maiden of Black Water, but the atmosphere is not lacking. This is a fundamental aspect for a traditional survival horror like this, that the remaster relaunches effectively, building terrifying situations and a great sense of tension thanks to a sound design that still works wonderfully today. Too bad, however, that no progress has been made on the localization front in our language, given that the game's dialogues are in Japanese and the subtitles in English. The gameplay of Project Zero: Mask of the Lunar Eclipse Project Zero: Mask of the Lunar Eclipse has a very traditional structure, made up of closed doors and keys to find If the story, the characters (albeit stereotyped and improbably dressed), the direction and the atmosphere held up very wellweight of the years, in terms of gameplay, the experience offered by Mask of the Lunar Eclipse is unfortunately quite dated and woody, with a movement system that makes the tanks look like agile dancers in comparison, and that hasn't been changed compared to the original if not in the introduction of an optional alternative layout. Exploring the abandoned buildings that form the background of the campaign therefore proves to be a slow and cumbersome practice, something that needs to be patiently used to but which plays a concrete role during the clashes with ghosts , which take place by activating a first-person view and often take place within narrow spaces, full of obstacles that we will not fail to bump into in a desperate attempt to build some distance and therefore have time to activate the Camera Obscura. Project Zero: Mask of the Lunar Eclipse, combat with spirits via Camera Obscura Here, if on Wii this mechanism could count on the novelty of motion detection controls, which added a minimum of freshness to a system that already seemed old-fashioned at the time, on PC, PlayStation and Xbox this feature is obviously not present and must get by with the analog sticks as in a sort of very slow shooter in which each reload takes several seconds. The Nintendo Switch version, which we didn't have the pleasure of trying, instead includes an option to activate the gyroscope and thus offer gameplay closer to the original vision. Structurally there is little to say, in the sense that progression is more traditional there is in the context of a survival horror, with closed doors that must be opened after having found a key, this event which in most cases gives rise to a close encounter and therefore to a fight that we will be able to complete by also exploiting any camera upgrades, as well as rolls with increased energy. Beware of saves, because there are no checkpoints. Technical realization: horror texture Project Zero: Mask of the Lunar Eclipse uses an improved lighting system over the original, but the graphics remain very dated There has often been talk of the difference between remake and remaster and how in the second case the developers limit themselves to adapting the resolution and frame rate to current standards, possibly also acting on the effects, but leaving the original technical system of the game intact in terms of of geometries, animations and, very often, textures. The latter are in fact adequate for the atmospheres of Mask of the Lunar Eclipse, given that they are literally frightening, pixelated like few others, and on PC it is not possible to improve them in any way also due to the very few adjustments present. We took it for granted that everything runs at 4K and 60 fps with the best presets on the test configuration, but it doesn't improve the picture of really dated graphics. Let me be clear: expecting more from this re-edition would not have been right, precisely because it is a simple remaster packaged to rekindle the spotlight on the Fatal Frame series in view of a possible new chapter, but then trying to sell it for  49.99 does not seem to us the best strategy in the world; also because on Steam 10 euros more is enough to buy the remake of Resident Evil 4, and we are talking about two titles with a slightly different production value.", "date": "2023-03-13", "grade": "6.5"}