{"name": "LEGO Legacy: Heroes Unboxed", "ref": "https://multiplayer.it/recensioni/lego-legacy-heroes-unboxed-la-recensione.html", "text": "In this review of LEGO Legacy: Heroes Unboxed we talk about the debut of the Danish brand in the field of turn-based strategy: so far, in fact, the videogame excursions of the famous bricks had touched on various themes, but never the one related to this specific genre. Being a mobile product and being developed by Gameloft, it is reasonable not to expect a hardcore title with the depth of an XCOM, also because the LEGO name assumes an almost universal accessibility rate. However, the lightness of LEGO Legacy: Heroes Unboxed should not mislead, given that the contents are still there even if forced to some inevitable compromise due to the free to play nature of the application: without further ado, let's therefore find out if fans of bricks can count on a product worthy of the brand it carries. strategic collecting Ready to go and LEGO Legacy: Heroes Unboxed immediately engages the fifth, making it immediately clear that they are not so much interested in offering a coherent story and scenario, but rather in feeding the fans what they want, i.e. bricks in industrial quantities. Under the pretext of rebuilding a disastrous Piptown, the title puts in the user's hands a handful of minifigures taken from the most disparate universes with the task of defeating opponents in turn-based battles and thus obtaining essential resources to erect structures, buy new units and improve existing ones. This generates that vicious circle that is typical of free to play products, with the purely playful phases that almost become a filler between one menu and another dedicated to collecting prizes and upgrades. Gameloft, it must be said, seems to have gotten too carried away in this aspect: the game is literally overflowing with items to collect and subsequently spend on some specific benefit, which are slammed in the user's face without too many compliments, at the point that it is easy to get confused. You therefore end up clicking on keys that modify parameters whose impact in the game is not really understood, also because the level of challenge is not such as to make these variations perceptible. Fortunately, LEGO Legacy: Heroes Unboxed does not prove to be a money-eating trap like many (too many) similar titles: in-app purchases are present and clearly visible, but they are not sneaky and not too emphasized, leaving the possibility for those who do not want to spend nothing you can do by coming to terms with a bit of the usual grinding. In terms of gameplay, LEGO Legacy: Heroes Unboxed proves to be an undoubtedly disengaged strategist, but not without logic: each of the over 50 minifigures that can be deployed in combat has two distinct abilities that can be used on the battlefield, with all the differences of the case in terms of cooldown, range, amount of damage inflicted, status effects and so on. In short, the Gameloft developers have respected the basic rules of the genre, bending them in the service of a playful structure that you want to keep simple and accessible in any case and which for this reason never offers a truly demanding level of challenge. Those who are familiar with strategy will therefore even risk getting bored, while all the others will find in LEGO Legacy: Heroes Unboxed a docile and pleasant progression, also characterized by a considerable amount of content. In addition to the basic campaign, there are periodic events, thematic challenges and even an asynchronous multiplayer mode: important numbers, which however hide procedures that are always the same and which therefore tend to quickly become repetitive. All without a single moment passing without a reward of some kind, for a product that evidently cares more about showing off the brand rather than executing the videogame genre to which it belongs: it is no coincidence that the most coveted are LEGO sets inspired by models actually released on the market over the years, complete with an image of the original packaging and curiosities relating to their distribution. We close with a mention of the technical component of LEGO Legacy: Heroes Unboxed, which alternates the highs of an undoubtedly accurate and functional graphics and a sound that is up to the situation with the lows of really too long uploads and a frightening amount of data to download when starting the application.", "date": "2020-03-05", "grade": "7.0"}