{"name": "Devil May Cry 3: Special Edition la recensione per Nintendo Switch", "ref": "https://multiplayer.it/recensioni/devil-may-cry-3-special-edition-recensione-nintendo-switch.html", "text": "Devil May Cry 3: Special Edition is a sort of holy grail for action lovers: a monstrously refined and inspired game, capable of restoring glory and lifeblood to its saga after the disaster of the second chapter, and perhaps demonstrating more than any another title the enormous genius of Hideaki Itsuno (to date one of the most prolific and brilliant directors of Capcom). The review of Devil May Cry 3: Special Edition for Nintendo Switch would therefore have been a must even in the case of a direct port, if only for the enormous value of the base title. Capcom, however, has seen fit to offer a triptych of interesting gifts to the Switch users, capable of differentiating this version of the game from all the others. We have clearly tested it thoroughly, to try to understand if, after all these years, these exclusive features dedicated to Nintendo's hybrid console are worth the (however limited) purchase price. The answer? Well, it won't be Devil May Cry 5, but the innovations introduced certainly make this re-edition of Devil May Cry 3 a much more valid replacement for the last chapter than we would have imagined, while waiting for a possible port (if this arrives ...). Three devils, three features Let's get things straight right away: the original Devil May Cry 3 was the series' peak for years, and if it wasn't for number five it still would be. The Special Edition is, in itself, an improvement on the original with playable Vergil and respectable extra content, capable of further enhancing an already exceptional experience. Itsuno on the other hand had managed to take the foundations laid by Kamiya with the first chapter, and to perfect them by hybridizing them with mechanics close to those of fighting games, bringing the technicality of the combat system to levels never seen before in an action hack 'n' slash. With the fourth Devil May Cry, however, this system had been further improved - until it reached a zenith for some fans still unsurpassed - a pity that there was no campaign capable of supporting so much goodness. The Switch version takes all of this and brings it back paro paro, with a bit of madness designed to flavor an already very spicy soup beyond the legal limit. The features that make up the extra spice are three: Weapon Switch, Style Switch, and Bloody Palace in cooperative, and we are preparing to describe them all in detail. The first is the simple ability to change weapons during battles seen in all Dante's adventures, but with an important change: in the Switch version of the Special Edition you can equip all firearms and melee weapons simultaneously, and replace them in series creating absolutely crazy combos, which in terms of variety sometimes even surpass those of the fifth episode when all the tools of the game are available. To get this option, just select the Free Style mode when starting a new game, and doing so also unlocks the second feature, which does the same thing but with the styles available to the protagonist. This means that in the middle of battles you will be able to use both the numerous additional skills of each single style and the various weapons (originally designed to offer specific advantages in certain situations) at will... a crazy thing, that in the hands of a player expert gives life to stratospheric choreography in combat. To so much beauty then we must add the local cooperative, which is self-explanatory, but is still a pleasure-loving surplus and particularly suitable for the console it belongs to. Playing as a couple with Dante and Vergil is fun, the Bloody Palace remains a very solid experience, and this way of dealing with it should also be implemented in the same way in the fifth episode, where we continue to hope in vain that the option will be added with a possible update. Wonderfully broken Obviously these additions break the system as you progress through the game, as they offer the player almost unstoppable tools to bring death to the infernal hordes. The ~broken~ of the combat system, however, is less dry and brutal than one might believe, and indeed it is almost incredible to see how everything holds up well even when the protagonist becomes a tornado of weapons, very stylish moves and almost impossible stunts to slow down. On the other hand the game is more than punishing already on normal difficulty (the European version is known to have hard and normal difficulties reversed), and even with the ability to switch styles with a key press the monsters hit pretty hard during the first missions not to make their completion free. In addition, once the system has been mastered properly, the fulcrum of Devil May Cry has always become almost more the creation of spectacular combos than survival, therefore theextra mechanics modernize and expand the system rather than ruining its granite foundations. In short, the imbalances are there (and we would like to see), but they magically manage to make everything even more amusing, and to bring the combat system of the third episode closer to the bombastic follies of the fourth and fifth. Even from the point of view of the technical sector there is little to complain about, even if perhaps we would have liked some heavy modifications. We are also always talking about an old game belonging to the PS2 era, so seeing it practically brought back one by one without improvements of any kind did not impress us. If nothing else, however, the fluidity of the action is flawless and unchanged, and the Switch screen helps to fit a graphics belonging to a couple of generations ago without any particular problems. Furthermore, even with quite a few fewer polygons, the spectacularity of the clashes is such as to almost immediately overshadow the visual impact.", "date": "2020-02-20", "grade": "8.4"}