{"name": "Street Fighter V: Champion Edition", "ref": "https://multiplayer.it/recensioni/street-fighter-v-champion-edition-recensione.html", "text": "The Street Fighter V: Champion Edition review finally provides a definitive vision of the Capcom-branded fighting game, completing a path that the Osaka-based house has undertaken since 2016 and which today, exactly four years later, ends in the best of ways: with an edition capable of offering a roster made up of no less than forty characters, thirty-four scenarios and over two hundred different costumes. those who already own the base game: the upgrade package is sold for 24.99 euros, while the complete bundle costs only a few coins more, 29.99 euros: a choice that rewards new users by penalizing those who have followed and supported the game so far, maybe even buying some extra characters and content. It also seems that the data is mostly downloaded even in the physical version of the game. The basic experience If you've played any edition of SFV before, you'll know exactly what to expect from Street Fighter V: Champion Edition, as the core experience remains exactly the same; obviously net of the updates that the developers have released over time, both as regards the balancing of the gameplay and, above all, the single player content. The main menu, which is not very beautiful indeed, is divided into two parts: the items arranged left allow access to Arcade mode, Story Mode, local Versus, Challenges, Training and various settings, while those on the right revolve around the multiplayer component with access to the Capcom Fighters Network, the lounges, the ranked and friendly matches, as well as of course the shop. The latter is basically useless in the Champion Edition, given that it is precisely a complete edition of almost everything. The Arcade mode represents the fulcrum of the single player sector: a sort of journey through the history of the franchise, with a sequence of fights and a selection of characters that vary according to the path chosen, becoming progressively more substantial and demanding. It starts from Street Fighter I, with its iconic and bizarre fighters, and continues with the historic Street Fighter II, the fighting game that changed everything, to then face the youthful battles of Street Fighter Alpha. The less known and understood Street Fighter III is therefore opposed by Street Fighter IV and Street Fighter V, the latter complete with all the fighters released so far. In all cases, the crossroads are interesting and the endings are very beautiful, which pay homage to the original concluding sequences as a welcome fanservice. Where you want to explore the story, the motivations and the possible epilogues of the various protagonists there is instead the short but intense Story Mode, in which the clashes are interspersed with static cutscenes that give the idea of simple drafts, not particularly accurate , but provide some extra insight into the lore created by Capcom. In this case there are just four duels, therefore completing the mode 100% and with the entire roster will only take you a couple of hours. The feeling that he hasn't gone too far on single player content is also confirmed in the Champion Edition, which in this sense does not introduce new modes and limits itself to proposing paths also dedicated to all the new characters, obviously including Gill and Seth. As far as competitive multiplayer is concerned, the question does not revolve around the numbers but rather the attention to detail, a very solid matchmaking (which will undoubtedly enjoy a relaunch thanks to the release of this new edition) and a classification system which still holds its own today, rewarding or penalizing users according to performance and very rarely incurring problems related to excessive latency. Apart from the inexplicable closure of the servers in conjunction with the unlocking of the game on Steam, perhaps due to an unexpected peak, our experience with online matches turned out to be perfectly in line with what we expected from such a mature and refined product. The new contents The list of contents included in Street Fighter V: Champion Edition is particularly long and full-bodied, but obviously it has a different relevance depending on what your experience with the game has been so far, the edition you already own and the packages you you may have purchased. As mentioned, the roster is now complete and counts the beauty of forty characters, coming from the original version and from the four seasons that have followed. It is therefore easy for most of the fighters to be therecompletely unpublished, although in many cases they are welcome returns rather than real new entries: we are talking about figures such as Guile, Balrog, Alex, Akuma, Abigail, Codi and Sakura, in a mix that draws not only from the history of Street Fighter but also from the various episodes of Final Fight, as per tradition. Then there are the characters made specifically for Street Fighter V, such as the starting quartet made up of F.A.N.G., Laura, Necalli and Rashid, as well as the subsequent debuts of Menat, G, Falke and Kage. Finally, the two fighters accompanying the launch of the Champion Edition, namely Gill and Seth. These are not new figures, as you may have understood: the first is a sort of divinity endowed with the power to manipulate fire and ice, appearing for the first time in Street Fighter III; the second is instead the female (and definitive) form of the very powerful final boss of Street Fighter IV. Something of a bizarre cross between Greek deities and Jesus of Nazareth, Gill is strongly characterized by a half-red, half-blue skin, once again underlining his peculiar powers, and by a large blond mane that remains unnaturally suspended in mid-air. Depending on the part of the body involved, his blows can have an incendiary effect or release ice, and the same applies to the special moves: a furious charge against the enemy or the emission of an orb of 'energy that goes upwards defusing any air attacks. His super is spectacular and underlines the divine nature of the character: if the enemy is ~hooked~, Gill takes the form of an angel and emits devastating waves. Seth boasts a design in many ways similar to the original version of the character, a sort of synthetic creature created specifically for combat, which instead of the abdomen has a rotating sphere charged with spiritual energy. His moves involve a moment of loading and prefer the short distances, with a flurry of punches, a roundhouse kick that knocks the opponent away, and a sort of full-body uppercut during a rotation. The special is the one we already knew: Seth creates a sort of whirlwind that sucks in the enemy and shoots him away, inflicting enormous damage. The two new characters therefore boast interesting features, a precise balance that points to specific approaches in combat (in this case very different) and an undoubtedly fascinating design, perfectly in line with the style used by Capcom so far. However, their introduction must be interpreted from the point of view of the complete package; it is therefore worth repeating that the convenience and goodness of the upgrade depend on what you have seen and experienced so far of the various contents of Street Fighter V. In this sense, the addition of a disproportionate number of costumes, over two hundred in total, represents a welcome (sometimes itchy) but far from essential extra, while the presence of a second V-Skill will certainly have a more significant impact, especially in the competitive arena, and it will be interesting to see how the most capable progamers will exploit the new feature. Finally, a few words on the technical implementation, which is also well representative of the path taken so far by the game with the various updates. On the test configuration, Street Fighter V: Champion Edition runs without any problem at 4K and 60 frames per second setting everything to the maximum, without thinking about it too much: thanks to a solid and tested graphics engine like the Unreal Engine 4, but also of the good optimization work carried out by the developers. Net of a style that is in many ways caricatured, the characters are confirmed to be well characterized, with few exceptions, and the scenarios boast truly wonderful glimpses, moreover with a pinch of interaction (see the final shots well settled on the edge of the stage) which never hurts.", "date": "2020-02-14", "grade": "9.0"}