{"name": "Darksiders: Genesis", "ref": "https://multiplayer.it/recensioni/darksiders-genesis-recensione-ps4.html", "text": "A little over two months have passed since the release of Darksiders: Genesis on PC and Airship Syndicate, as promised, has also brought its latest effort to consoles. It is the first Darksiders to be developed by the creators of the series after the bankruptcy of the publisher THQ and the temporary handover to Gunfire Games, which was responsible for developing the controversial Darksiders III: for this reason, the former Vigil Games have returned to their roots of the franchise that launched them with a tight-budget production that nevertheless satisfied the fans and laid the foundations, hopefully, to continue with a story that had been on hold for far too long. In our review of the PlayStation 4 version we explain why again. Let's start over Darksiders Genesis is a prequel that takes place long before what was narrated in the very first Darksiders released ten years ago, and which tells the misadventures of War and Conflict: forced to ally with the demon Samael, the two horsemen of the Apocalypse will have to exterminate armies of monsters following the trail of Lucifer to stop him before he creates other disasters. Airship Syndacate tells the story through well-written and well-dubbed dialogues in Italian, occasionally with the help of illustrations in which the hand of the executive director and former cartoonist Joe Madureira, best known for Battle Chasers - the video game was developed by him team - and for some important collaborations with Marvel Comics. Unfortunately the campaign, which is completed in about fifteen hours, is almost a pretext that leads the two protagonists from one mission to another, and with its hasty ending this Darksiders Genesis adds almost nothing to the overall picture of the series. The game serves more than anything to effectively introduce Conflitto, a light-hearted, ironic and decidedly more fun character than his gloomy brothers, who often entertained us with hilarious jokes and outbursts of anger and that we can't wait to play again. Don't be fooled by the isometric view: Darksiders Genesis is a miniature Darksiders, a title more similar to the first episode of the series than to Darksiders II with its RPG elements, almost completely absent here. The obviously limited budget betrays the care taken in the creation of scenarios, animations and polygonal models. Darksiders Genesis is one of those cases in which the artistic direction triumphs over the graphic complexity, and all thanks to the variety of settings and atmospheres that the team has managed to create by carefully choosing the colors, the details and also the excellent musical accompaniment by Gareth Coker. Not being a particularly complex title from a graphic point of view, Darksiders Genesis faithfully maintains all the merits - and defects - found in the PC version also on PlayStation 4. The main disadvantage of the isometric view is in fact felt in the platform sequences where the angle prevents you from calibrate the jumps with precision, nothing that can not be overcome after a few tries. After each mission you return to the Void, a kind of partially explorable hub where it is possible to buy the upgrades sold by Vulgrim and Dis. In each of the sixteen chapters we will have to achieve a specific main objective, completing some mandatory secondary tasks: the level design is brilliant and leads to the discovery of the new tools necessary to solve the environmental puzzles in an organic and natural way. These puzzles become increasingly complex and force us to use gadgets to switch characters on the fly unless, of course, you're playing in cooperative mode with a friend. Gadgets also unlock new ways in missions that have already been completed, encouraging you to replay them to collect all the pending collectibles, collectibles that are many and which are used to buy combos, special attacks, power-ups, improvements and other bonuses. Playstation 4 trophies Darksiders Genesis has 31 trophies, divided into 14 bronze, 10 silver, 6 gold and the inevitable platinum trophy. Unlocking them all is not a titanic undertaking: you will have to complete the campaign, find every collectible, overcome every challenge in the Arena and so on. War and Strife fight almost completely differently. Both can attack in melee with at least a basic combo, but Guerra can chain attacks longer thanks to the upgrades of his sword Devouracaos that reach different levels of power. In addition, War can also incorporate Wrath skills into his combos that consume the notches under the health meter, parry and counterattack and use secondary tools to damage enemies near and far: his preydisposition to close combat makes it very resistant, but also slow and vulnerable when enemies can attack from afar. Strife is much more agile and fast, and can dash in any direction to dodge enemies. This makes him less resistant to close quarters, also because his maximum health is lower than War's. Conflict plays almost like a twin stick shooter thanks to its two guns and different types of ammo. His ace up his sleeve is the so-called winning streak, a meter that fills up by hitting enemies and which, once loaded, temporarily boosts the projectiles. Knowing when to switch characters is, of course, a big part of the game. The two knights also have access to various common abilities, for example the possibility of eliminating weakened enemies with a coup de grace, that of taking the field with an attack that affects all targets on the screen and of transforming into demonic supreme forms. The combat system is then customizable thanks to the modifiers of a curious upgrade system. Defeated enemies sometimes drop their cores which we can then place the category in a special grid. Collecting the same core multiple times increases its level and improves its associated bonuses. Not all slots in the grid can feed a fully upgraded core, and cores must be adjacent to feed each other. Continuing the adventure you get many cores, but the problem is to upgrade them by accumulating the required amount: the game comes to meet us with the Arena which serves precisely to avoid the ~farm~ in the completed chapters. It's not the most elegant of solutions, but it's an incentive to explore the combat system since the advanced stages are quite demanding.", "date": "2020-02-13", "grade": "8.0"}