{"name": "G.I. Joe: War On Cobra", "ref": "https://multiplayer.it/recensioni/gi-joe-war-on-cobra-la-recensione.html", "text": "There is an unwritten rule that most licensed mobile games now fall into the trap of free-to-play with micro-transactions and this review by G.I. Joe: War On Cobra just confirms that. It will now be more than fifty years since the G.I. Joe fight the Cobras to defend freedom against the dark plans of the criminal organization, but the 80s militarism of Hasbro toys is still perfectly in line with the taste and style of many American entertainment productions. Over time, the brand has expanded and has been the subject of various interpretations, as also demonstrated by this mobile platform game, in which the chosen brave soldiers are represented in a decidedly cartoonish and caricatured way. On the other hand, it is not easy to take such an over the top representation of the war seriously, but there is something on which G.I. Joe: War On Cobra is no joke: trying to get money out of players. That behind the rhetoric of the Joes there may be a clear imperialist intent to spread the consumerist vision of the American economy around the world is something that one can easily suspect - at least for those who craved toys in the 80s but had post-68-year-old parents - but this mobile game doesn't exactly tell you that, with its constant requests to buy this or that special promotional pack. It's a pity, because it's a rather well done game, with attention to the characterization of the graphics and with a real-time strategy-style combat system that always makes a good impression, despite the extreme simplicity in which it is presented. Obviously it is possible to avoid the traps and play without having to pay constant taxes, but the experience resembles a sort of obstacle course, with acrobatic maneuvers to avoid pressing one window or another, with absolutely out of logic prices printed on it . Thinking back to Saturday morning cartoons, nostalgia on the one hand increases the appeal of this game but on the other it makes you even more angry at the way in which the Joes seem to have become a greedy factory for clicks and paid resources in this new interpretation. The war continues As an apt metaphor for the madness of war, G.I. Joe and the Cobras have continued to clash fiercely for decades without it being understood exactly what the reason for the dispute is and the story of this game does little to clarify the situation, simply posing a pretext to allow the two factions to bomb each other. A very interesting element of War in Cobra is the possibility of being part of one or the other side, also being able to follow two different campaigns alternately to see the development of the game on the two opposite fronts, without therefore becoming stuck on a single perspective . Following one campaign or another, the meaning does not change: it is a question of building your own strategic base and putting together an assault team, with which to complete various missions or set out to conquer the bases of other players. The latter will try to do the same, so it is a good habit to invest resources and money in building defensive systems capable of keeping your base protected from attacks. Units to be deployed in the field and structures for the base are acquired through the expenditure of money, with a complex internal economic system that uses different currencies for the acquisition of new elements, the obtaining of additional resources or the possibility of skipping the numerous waits forced. In short, the micro-management system is based on this constant need to collect resources with the structures of one's base and use them in battle and although the purchase of elements through micro-transactions is not mandatory, it is clear how the whole mechanism pushes that direction, if only to avoid the frequent and repeated stops that emerge during the grinding phase, another element present in abundance in G.I. Joe: War On Cobra. On the battlefield, the gameplay is the classic real-time strategy one, but the action takes place here too almost automatically: the units move and attack independently, essentially trying to destroy everything what they meet. The player is required to make the initial selection on which units to place on the field and their initial position, with the possibility of also indicating priorities to follow and specific objectives to hit before others, but in general it is a considerable simplification of the classic RTS mechanics, structured in such a way as to result in short missions that can be completed even without the player's direct intervention. The accentit is therefore all focused on building the team and on its strengthening through the conquest of ever stronger (and rare) units and vehicles. Here we are not dealing with a real gacha dynamic, but the prize fund system largely focuses on the collection of characters and vehicles that take up the mechanics of the variable drop rate based on the investments made, therefore there are similar elements, also focusing on the appeal of collecting that also characterized Hasbro toys. The assortment of the team is essential for winning battles, given that the level and type of units deployed are the characteristics that mainly decide the outcome of the battle, with the strategy reduced to a minimum: this too makes us focus on the collection of increasingly powerful characters and vehicles, also pushing towards grinding.", "date": "2020-02-07", "grade": "5.8"}