{"name": "Coffee Talk", "ref": "https://multiplayer.it/recensioni/coffee-talk-recensione.html", "text": "As we will see in the course of the review, Coffee Talk is a visual novel focused on the stories of a city suspended between the real and the fantastic. We find ourselves in an alternative Seattle where humans, elves, orcs, dwarves and succubi coexist, all with their problems and their unresolved issues. The player takes on the role of the owner of a nightclub where these figures go to sip drinks and tell their stories. What can be done to help them? Nothing more than preparing what they ask of us and listening to them. During the evenings, anything can happen and people's chats end up overlapping each other, in a sum of stories that generate interesting discussions and end up creating relationships out of nowhere, trying to make us reflect lightly and pleasantly on some contemporary themes, such as racism, classism, life, death, fate and anything else you can think of. The writing of Coffee Talk is apparently light, but manages to get to the bottom when needed, creating a good rhythm that alternates between small conversations and more important ones. The levity of what we read is also underlined by the graphic style, which takes full advantage of the Japanese pixel art visual novels of the 90s, while not failing to underline its modernity with zoom effects and other more modern additions. References Coffee Talk was not born out of nowhere, but from a precise trend in the indie scene that tries to tell intimate and minimal stories in the simplest and most direct way possible, avoiding dealing with the stylistic features of mediums and eschewing any form of violence, at least complacent . It is no coincidence that titles of the genre are mostly visual novels and related variants and that the level of writing is essential to determine their quality. To give some other examples of games belonging to the same vein, just think of the recent Neo Cab, one of the few that has managed to get the attention of the general public, and in some way also Kentucky Route Zero, although the vision there is broader breath. If we want to give a noble father to this trend, the first that comes to mind is Jim Jarmusch of Coffee and Cigarettes, but it's better not to stray too far. Game mechanics You will therefore understand why in terms of game mechanics Coffee Talk is so poor. As already mentioned, the player basically has only one task: to prepare drinks, trying to satisfy the customers as much as possible both in terms of taste and aesthetics. For example, a satisfying cappuccino is not only the result of a good dosage of milk and coffee, but also of the ability to make a beautiful drawing with the foam (don't worry, you don't need to be an illustrator, since the customers are quite tolerant of judgments even towards scribbles). The idea that the game conveys is never that of really wanting to challenge the player, but only of wanting to accompany him by breaking the rhythm of the stories from time to time. You have to put a minimum of attention into what you do, but that is never the core of the experience. If desired, there is a special mode in which you only have to prepare drinks and make drawings, but it is not exceptional and gets tired after a few minutes. Whether you love Coffee Talk or not depends on how much you let yourself be carried away by its characters, starting with the writer Freya, who opens the game, passing through the succubus Lua, the policeman Jorji and so on for all the others. Their lives and their relationship with the place where they live are the pivot around which the entire experience revolves, so much so that the only other user interface elements available to us are all linked to giving us additional information about them. For example, on the Tomodachill social network we can read their profiles and learn additional information about their lives, while in TEW Stories, the application of the newspaper Freya works for, the Evening Whispers, we can read city news and the girl's writings. Shuffled, on the other hand, is a musical application that allows you to change the background song of the bar, while Brewpad is basically a recipe book of the drinks that we can create, which is updated as we progress in the adventure. For the rest there are no puzzles and there are no obstacles of any kind to overcome. As we said, you like Coffee Talk or not depending on how much you can identify with the stories told by the various characters who take turns at the bar counter. If we like, this is its greatest flaw: the stories told deal with current and general issues, but they do so in an all too obvious way, often resolving within a rhetoric that partially deprives them of their humanity: they are all histie characters without particular ambiguity, who represent exactly what they are expected to represent. The result is that we arrive at the end of Coffee Talk without jolts and without the story having the slightest attempt to become problematic, like a discreet cappuccino that you forget as soon as you leave the bar.", "date": "2020-02-06", "grade": "6.5"}