{"name": "World Robot Boxing 2", "ref": "https://multiplayer.it/recensioni/world-robot-boxing-2-recensione.html", "text": "The review of World Robot Boxing 2 takes us back to the futuristic world of Real Steel, although the Reliance Games series has now abandoned the official license of the film. The spectacular encounters between robots, however, still represent the core of the experience, which presents itself as a fighting game on the one hand very strategic, based on timing and precision due to the great static nature of the characters; on the other, it is strongly characterized by a progression that is typical of many freemium-type mobile games, between paywalls and rather intrusive microtransactions. There is a single player campaign organized in leagues and tournaments with an increasingly higher degree of difficulty and with a certain degree of replayability, given the presence of some crossroads, but there is also real-time online multiplayer to challenge other users and special events that are renewed cyclically. At the beginning of the career we are given a low-level robot, which however we will be able to upgrade using the traditional loot obtained at the end of each victoriously concluded match. After that, the advancement mechanics are the well-tested ones that are often found in iOS and Android productions: prize boxes to obtain new and more powerful characters, an indicator of the energy of the action that regulates the amount of matches that we can play in a row and a health management that implies the obligation to resist with the same bar for an entire tournament, unless a consumable is used to heal oneself. Gameplay and technical realization The brief initial tutorial of World Robot Boxing 2 quickly introduces us to the commands, which use a virtual analog stick on the left side of the screen, unfortunately not repositionable, and only two buttons on the right side, to which a third is added when we can execute a automatic combination of shots. Bluetooth controller is not supported. By mixing directions and keys you get different attacks and you have to learn to calculate spaces and times well so that they can hit, while the parry is activated by pulling the stick downwards but only if you do it well in advance. The result, as mentioned above, is an experience with a certain degree of strategy, but at the same time not particularly deep or capable of returning an excellent impact rendering, although this aspect has been improved compared to previous episodes. In terms of numbers, there is little to complain about: the game's roster is made up of a total of sixty-six robots divided into six classes, with twelve arenas in which to duel and quite a few unlockable moves. ' of personality: although the fighters are well differentiated and boast excellent animations, especially as regards the finishers, the quality of their designs is fluctuating and the same can be said of the settings, which are very generic. Furthermore, the audio sector has limits: the commentary during the matches is nice, but the music and effects do not leave their mark. World Robot Boxing 2's problems, however, certainly don't lie with the graphics. The fixed touch controls on tablets can be inconvenient, but it is above all the freemium model adopted by the developers that is binding, with continuous attempts to monetize between passes, hard currency and energy points in order to continue playing after a certain number of matches. This inevitably means that at a certain point in the campaign you have to grind, replaying already completed tournaments in order to obtain the materials necessary to upgrade the robots and finally aim for victory in advanced matches, in which reflexes and precision alone do not they can make a difference.", "date": "2020-02-06", "grade": "7.0"}