{"name": "Patapon 2 Remastered", "ref": "https://multiplayer.it/recensioni/patapon-2-remastered-recensione.html", "text": "Our review of Patapon 2 Remastered for PlayStation 4 starts from a sufficiently clear and (hopefully) shareable starting assumption: Pyramid and Japan Studio in the past have accustomed players to effective, fun, and in most cases fresh and original experiences . It is for this reason, moreover, that some of you readers may remember Patapon, that game (but not in a reductive sense, but rather affectionate) based on little black monsters who sang to the rhythm of music, on their PSP or on PlayStation Vita. Here: some time ago Sony decided to remaster the first chapter on PlayStation 4 and PlayStation 4 Pro, so it was only a matter of time before we also had Patapon 2 in our hands (but digitally). This is not a brilliant conversion , but someone could still evaluate the purchase: then let's see its strengths and weaknesses. The plot: pata pata pata pon! Pata pata pata pon, yes. It's not the fruit of mental madness, but the philosophy of the entire game: the Patapon are invented little beings who fight, talk, move, live to the rhythm of music. The purpose of their existence, and on this the plot is immediately clear, is to reach Fineterra: a feat that seems impossible, because half the world seems to have it against them. Patapon 2 Remastered restarts from the conclusion of the first Patapon: the little-eyed monsters take that blessed boat they built, set out to sea and... a gigantic kraken knocks them down and scatters them. Luckily we are here, that is you, that is the player of Patapon 2 Remastered in short, who impersonates none other than the god of the Patapons, and guides them to the rhythm of music to adventure and battle. A narrative, that of Patapon 2 Remastered, fairly long-lived and sufficiently varied: in any case more solid and interesting than the first chapter, even if inevitably the freshness and originality of that first appointment with the Patapons went down the drain. But for today's player - who rediscovers these beautiful and precious pearls - the problem does not arise. Because maybe he will directly notice Patapon 2, that is the summa (so far) of what the series has to offer. Playstation 4 trophies Patapon 2 Remastered arrives on PlayStation 4 with its nice list of trophies, including the Gold and the Platinum Trophy: obtaining the latter, as far as we have seen, should not represent a superhuman effort. In fact, you have to complete the entire adventure, collect all the collectibles and explore all the possibilities related to the customization of individual creatures. Remastered: contents, merits, defects Patapon 2 Remastered arrives on PlayStation 4, in fact, with a Remastered, and promising the buyer Full HD, and on PlayStation 4 Pro support for 4K. In most of the situations proposed, the promise is kept, but when it fails, disaster strikes. And they are a disaster, for example, the introductory movie (which is so important in starting the adventure) and all the interlude sequences. There's no point in making excuses: Sony has taken the game's cutscenes on PSP and released them on PlayStation 4 as they came. And they came badly, in fact: a riot of unwatchable pixels. Too bad, because they are not only important videos to understand the story, but also funny and with the right sound accompaniment. Speaking of the merits, however, the input lag is very good, practically absent except in very rare circumstances: you could say that we went looking for problems where it was not right to suspect them, and instead doing so was more than legitimate. If you have played the remastered of the first Patapon you will have understood very well what we are alluding to: at times the title was unplayable. But Japan Studio seems to have learned its lesson, at least from this point of view; even technically speaking, Patapon 2 Remastered presents no problems whatsoever. Here: moving on to the contents, the remastered skimps at least on the game modes. Patapon 2 on PSP and PlayStation Vita indeed had a couple of multiplayer modes that were simply taken away in this port; on a fixed console they probably wouldn't have worked. However, it is also true that the introductory price is not even too low, and a good rule of thumb would like that where one side is removed, the other is added. Is this perhaps superficiality on the part of the developers: did it cost so much to add a digital soundtrack, a theme for PlayStation 4, unpublished collectibles or any other nonsense that at least from afar tries to justify a cut of some original contents? Gameplay: Let's play with the Patapons Having clarified the strengths and weaknesses of the Patapon 2 remastered and summarily recalled the plot around which the title revolves, they are necessary toSome ~directions for use~ about the gameplay. Patapon 2 is still so original today, so unique, that it could initially displace. It is undoubtedly a strategic game (an RTS, to be fiscal), but also a rhythm game. Everything that is done, is done in time with the music: otherwise the Patapons begin to complain, and or do not act as effectively as they could. Through the main controls of the DualShock 4, the player controls his troop. Three times Square and then Circle: the Patapons move to the right. Circle twice, Square, then Circle again: this is the attack command, the little monsters will knock down anything in their path. There are other commands, of course: for example the one to defend against enemies. And there are also miracles that we, god of the Patapon, can use to overturn a conflict that is not going to end well. At all times, the Patapon must be assisted by the player, and they will prove obedient and dutiful... as long as the basic musical norms of every rhythm game are respected: precision, attention to the rhythm, quick reflexes. The difficulty level is generous enough (there is also an easy mode, just in case) but continuing the adventure offers an increasingly interesting level of challenge; This is good. It is also positive that in some aspects Patapon 2 Remastered insists even more on the strategy and customization of the troops: the Patapon become stronger, level up, evolve, specialize if necessary. There are different species, even unique Heroes that you can position to lead your troop (and they also come back to life during battle). They have special powers, they often prove to be essential for taking down the gigantic bosses that await the unfortunate little beings in the various levels. Add to all this a main hub from which you can access all the various secondary contents and information that enrich the game context, and you will have Patapon 2 in your hands. Not bad: perhaps a little out of time.", "date": "2020-02-02", "grade": "7.0"}