{"name": "Warcraft 3: Reforged", "ref": "https://multiplayer.it/recensioni/warcraft-3-reforged-recensione.html", "text": "This review of Warcraft 3: Reforged is as bitter as the knowledge that you can keep polishing a car as long as you like, but if the engine is dead it won't go anywhere. Warcraft 3 (2002) was a very important title in the history of video games, one of those that really left their mark. If today we have League of Legends and DoTA 2, we owe it to Warcraft 3. If we want, the auto battlers also come from there, although the relationship is more distant. Furthermore, the first version of World of Warcraft took advantage of a large part of the background conceived specifically for Warcraft 3, certainly expanding it, but without distorting it. Those were the years in which the name Blizzard Entertainment meant something and warmed the hearts of gamers: each of its titles was awaited as the messiah, because each launch was simply perfect. After all, it was the studio of Diablo, of the first two Warcraft and of Starcraft, that is, one of the few that never missed a beat. His games were revered by ever-widening communities and, despite their lack of originality (Diablo aside), they always ended up setting the pace for the industry, partly because of their very high sales and partly because there was little else that could boast the same level of finishing. Gameplay Let's spend a few words on the gameplay for those prave souls who don't know what we're talking about. Warcraft 3: Reforged is a classic real-time strategy game with a strong narrative component, an evolution of the formula canonized by Westwood Studios with Dune 2 and magnified by the same software house with Command & Conquer and by Blizzard itself with Warcraft 1 and, above all, 2 . The typical mission of Warcraft 3: Reforged requires you to collect resources to build structures that give access to troops and upgrades, in order to start from the conquest of the main objective, usually an enemy base or some particularly tough boss. In reality there are also secondary objectives to be achieved, such as the collection of certain objects or the discovery of certain places, made possible by the presence of the heroes. In addition to the standard ones, let's call them that, there are also missions of pure exploration, in which you use the troops that are on the field to continue, or others in which you simply have to resist the attacks of the enemy waves for a certain period of time (you have do you have horde mode?). It must be said that the best part of Warcraft 3: Reforged is that what was Warcraft 3 still works perfectly today: the campaigns are balanced and have missions designed in an excellent way, some of which also offer stimulating challenges. In this sense, it is difficult to find negative aspects to a title that has always been cited, with full merit, as one of the greatest exponents of the RTS genre. The problem is that everything that is good about Warcraft 3: Reforged, and that's a lot, comes from Warcraft 3. The novelties leave something to be desired, to put it mildly. Graphic makeover Warcraft 3: Reforged looks like the remastered edition of a famous game curated by a software house that hasn't been given the right resources to give credit to the original. We don't think this is the case, since we're talking about Blizzard, but there are a whole series of aspects of the game that are astounding. Let's start from the most publicized novelty: the complete renewal of the graphics. Of course, Reforged's 3D models are certainly better than the original ones, the general look of the game is much more modern and some effects, such as the atmospheric ones or the fluid simulation, are undoubtedly superior. However, there are problems, first of all the choice to oversaturate the color palette, giving an artificial flavor to some scenarios, especially those that theoretically should be darker like the dungeons. Plus some items are really... nasty. For example those trees that seem to come out of a super deformed version of the Fantabosco who chose them? But let's not delay any longer and carry on. The presence of male and female versions of some heroes and some creatures, such as zombies, demon hunters and death knights, slightly increases the visual variety and allows for greater customization of the fights, but the general feeling is still that of an unfinished business : if in 2002 the graphics of Warcraft 3 were at the top of the RTS genre, in 2020 that of Warcraft 3: Reforged is just passable. Is the goal of opening up to customization to sell useless skins for years to come by capitalizing on fans' love for the original? Who knows what makes us suspect... Thrall dressed as Santa Claus for some pleasant seasonal event coming up. Also, imgAn intense blasphemy for Blizzard, the game has noticeable framerate drops in the most crowded situations. Note that the 2002 version ran immaculately on the average configurations of its era, even at maximum detail. But what the hell happened? We lack the air to speak ill of Warcraft 3, also because it's not over yet: very little is left of the promised four hours of new sequences filmed in computer graphics (a couple of scenes). Sure, the original footage was all rendered at 1080p (they were 240p) and now looks a lot nicer, but that's not what was advertised. As it was not announced that the interface would remain virtually unchanged. There was talk of a total makeover, but Blizzard retraced his steps and kept practically everything as it was (or almost). New content, at least? There is no trace of it. So in total we have the campaigns of Warcraft 3, those of the Frozen Throne expansion and... that's it. New players can be satisfied, since we are talking about dozens of hours of gameplay, but for those who have finished them over and over again? If you play them one more time to see the new 3D models? And can we talk about multiplayer? Couldn't we add some maps? The question therefore arises: why should a Warcraft 3 player buy Reforged? Other missing features Another big flaw of Warcraft 3: Reforged is the lack of some, too many ancillary features that many took for granted, such as profiles, clan management, automated tournaments and customized campaigns. Actually there's more, like the absence of ladders or some issues related to Battle.net, like the absence of animated 3D portraits. In some cases these are trifles, but in others they are features that players now took for granted and that they have been using for years in the classic version of the game, so knowing them to be absent can only hurt. Surely they will be added with future updates... why? Can't Blizzard really afford to take a game from almost twenty years ago and re-propose it with all its features, without having to break it up into a myriad of patches? It is no small matter, if you think about it, also because as already mentioned we are not talking about a secondary title, but one of those that made the history of video games and which would have deserved more respect instead of becoming the object of a rapacious and, on balance, senseless operation.", "date": "2020-01-31", "grade": "6.0"}