{"name": "Oddworld: Stranger's Wrath HD", "ref": "https://multiplayer.it/recensioni/oddworld-strangers-wrath-hd-recensione.html", "text": "The review of Oddworld: Stranger's Wrath HD in many ways represents a journey into the past, which, however pleasant, immediately reveals its inevitable inconveniences. In fact, we are talking about a game that mixes action and shooter in an unusual way, originally published in 2005, on the first Xbox, and re-proposed with a remaster on PlayStation 3 in 2011. It is precisely this latest edition that the guys from Oddworld Inhabitants have brought to Nintendo Switch, leaving the technical sector intact (by now largely dated), introducing few innovations related to the input system (aiming via gyroscope, which can be activated from the options) and offering the package at a slightly too high price, all things considered. history and structure The story behind Oddworld: Stranger's Wrath HD undoubtedly represents one of the strengths of the production, thanks in particular to a couple of surprising twists. The protagonist of the adventure is a sort of anthropomorphic tiger who earns a living working as a bounty hunter, against the backdrop of a perfect western-style setting, with the scenarios connected to each other by a series of passages that start from a central hub: an old-fashioned town inhabited by the Clackers, chicken-like characters, where eventually collect the rewards earned. To welcome us, in addition to a short tutorial, we find an interface that unfortunately feels the full weight of its years and hasn't been modified for the occasion. Similarly, the subtitles in Italian for the dialogues in English still suffer from some shortcomings when it comes to secondary conversations, and there is therefore the risk of losing details that are also relevant for the purposes of the campaign or optional quests. Having said that, the structure of the missions is actually very simple: you go to the bounty shop, select a bounty and set off with the aim of capturing the criminal on duty, dead or alive, proceeding on two or four legs to depending on the rush. Gameplay and fights The transition from first person to third person view is just one of the peculiarities of Oddworld: Stranger's Wrath HD. In fact, our character can throw powerful punches and knock out his opponents and then capture them in Ghostbusters style, with a device that ~sucks~ them in, but above all his crossbow plays a central role in the context of the fights. Instead of using darts, in fact, the Stranger collects around animals and giant insects of various types, each of which can be fired at the targets to have different effects. The quantity and quality of the ~ammunition~ characterizes in an important way a gameplay with a high strategic rate, which includes stealth elements and the obligation, from a certain point on, to proceed with the eliminations one at a time, attracting the criminals with deception before knocking them out. Throwing yourself into the fray with guns blazing will in fact inevitably lead to game over: the damage caused by enemy fire is huge and to recover vital energy we will have to withdraw for a moment, emptying a secondary indicator to restore health but only where there is no one to chase us. Unfortunately the inclusion of gyro aiming ends up as a remedy for other problems than an extra of real value. In fact, the right analog stick has an excessive dead zone and an over the top sensitivity, difficult to adjust, which puts you in great difficulty where you find yourself having to aim quickly. Technical realization The Oddworld: Stranger's Wrath HD campaign can be completed within twelve hours going quite quickly, but ready to give more lasting entertainment where all the secondary tasks are attempted. at the same time, however, the limits of the game that we already knew today weigh like boulders: the platform phases are uncertain, the camera goes crazy every now and then and you come across frustrating dead spots when you run out of ammunition. Artistically some sequences still have their charm, but the conversion work for Nintendo Switch appears really essential, with the only switch to 1080p resolution when playing in docked mode. That said, the frame rate suffers inexplicable hits in many situations (and to say that already at the time of PS3 the graphics ran at 60 fps) and the quality of the textures leaves much to be desired, dirtying the visual sector of a title that certainly had something to say in its time and deserved a better limelight.", "date": "2020-01-23", "grade": "6.5"}