{"name": "Extraordinary Ones", "ref": "https://multiplayer.it/recensioni/extraordinary-ones-la-recensione.html", "text": "If your desire is to take a MOBA with rather classic mechanics everywhere, then the Extraordinary Ones review could illustrate what is right for you, although the NetEase game carries with it some rather peculiar characteristics. It is certainly not the first game of this genre to land on mobile platforms, on the contrary the MOBA has found various more or less valid expressions in recent years, including more particular digressions such as the famous Brawl Stars and more rigorously classic interpretations of the canon such as VainGlory and Arena of Valor. In fact, in principle the characteristic features of this type of game in mobile format are precisely these: either a completely original interpretation, which distorts the gameplay elements and the setting, or an extremely traditionalist one, and it is perhaps on this standardized opposition that Extraordinary Ones can play its best cards, presenting itself as something quite different from what has been seen so far. Faced with a very classic game structure, what distinguishes this NetEase title is in fact its setting, built in an anime style by putting together a lot of suggestions from various more or less recent series. The most obvious source of inspiration seems to be My Hero Academia, both in terms of the graphic style adopted and the character design, and for the bizarre setting that characterizes everything. Esper City, the city where the story takes place, is a strange place where humans, monsters of various kinds and supernatural beings coexist, and it is also here that the prestigious Grand Academy is located, where students learn the art of tactical combat. There isn't a great epic basis behind it all, more than fights to the death for survival or the control of kingdoms, it is above all about winning battles to gain prestige and pass the academy exams, but all this allows you to use a decidedly over the top style, between the humorous and the absurd. There are already more than 60 heroes to use in total, as the game has been running for some time in Asia already, some of which can be selected immediately and many others are instead to be purchased with the in-game currency that can be conquered in game or purchasable with real money. The excellent anime-style character design builds very particular and distinct and characterized characters, an element of fundamental importance in such a game, which also gives a nod to the classic collecting that emerges in these large roster titles. Each hero can be customized through different cosmetic items and colorways, opening the way for a huge amount of different combinations. Classic MOBA with new style The game mechanics, on the other hand, are decidedly traditionalist: Extraordinary Ones is a MOBA that stages fights between two teams made up of five heroes each, within classic three-lane type maps, in which we must try to destroy the opposing guardians while enemies try to do the same. The dynamics are therefore the known one: while a swarm of minions advances towards the opposing base, the heroes aim to knock down the turrets (or ~guardians~, in this case), acquiring control points on the map and clearing the way up to the opposing base . In all of this, of course, there is no shortage of clashes between the heroes themselves, who often find themselves fighting in the points of greatest traffic on the map, engaging in spectacular duels with special skills. All this is so classic to run into the problem of the pace and the average duration of the games: as in a full-fledged MOBA (which this game is to all intents and purposes), the risk is that the games last for a considerable amount of minutes and the question can clash with the typical use of mobile gaming, which usually requires more fragmented and rhythmic times. The combat system is centered on the use of the heroes' specific abilities, which are divided into the classic MOBA roles: tank, fighter, ranger, caster, support and more, with special strikes reflecting the different fighting styles. These evolve as the character progresses and are activated at the simple touch of the corresponding keys, triggering the usual consequence of the cooldown which imposes more or less long waits depending on the power of the move performed, applying an additional layer of tactics to the clashes. There is a good differentiation between the many characters even if you probably don't reach the different fighting styles and above all the teamwork of a League of Legends, but making the necessary proportions there is still fun here too. Clash can resulteasily confusing also due to the control system that takes place entirely through the touch screen: while not presenting major problems, there is often a certain input lag probably also due to the netcode, in addition to the classic annoyance that the control with the virtual stick can give due to the lack absolute physical feedback. Micro-transactions are an integral part of such a title, considering its free-to-play essence and the large amount of items to acquire as you progress through the game, including new fighters and a host of customization items and hero upgrades. It must be said, however, that, at least in the first phase, Extraordinary Ones seems to have adopted a rather balanced approach, allowing a considerable degree of progression even without necessarily accessing purchases with real money. It's something that takes longer to evaluate, but at least it allows you to enjoy the game for a good amount of hours before seriously facing the possibility of making additional expenses.", "date": "2020-01-22", "grade": "7.4"}