{"name": "Tokyo Mirage Sessions #FE Encore", "ref": "https://multiplayer.it/recensioni/tokyo-mirage-sessions-fe-encore-recensione.html", "text": "Like a talented singer playing in the dark corner of a pub, Tokyo Mirage Sessions for Wii U was an excellent game that had the misfortune to ~perform~ on a wretched console. Thanks to a clumsy communication campaign and the low user base of the Nintendo platform, in 2016 Atlus' colorful adventure proved to be a half-batch in terms of sales, but on the wider Nintendo Switch stage it could finally have a second chance to shine . In a similar way to other portings such as Bayonetta 2 and Hyrule Warriors, Tokyo Mirage Sessions #FE Encore whose review you read brings the original experience in its ~definitive~ version to Switch, collecting (almost) all the released DLCs and introducing some small novelty. But is the show worth the ticket price? Lots of Personality Originally conceived as a crossover between Fire Emblem and Shin Megami Tensei, but clearly transformed into something very different during development, Tokyo Mirage Sessions is the closest there can be to a chapter in the Persona series on Nintendo Switch. Set among the districts of a modern Tokyo where some kids want to become movie or music stars, the game incorporates many of the ingredients seen in the ~older brother~, from the exploration of thematic dungeons to the ~social~ component linked to side missions, from the mechanics and combos of the turn-based battle system to how relationships between party members have an effect in battle and affect character growth. Even the protagonists are joined in the clashes by arcane beings called Mirage, who give them special powers and attacks a bit like in the other more popular Atlus series. However, Tokyo Mirage Sessions is a much more linear game, which abandons the school calendar management typical of the Persona series in favor of a division into chapters, with each chapter having a dungeon to face and a boss to defeat. Therefore, all the strategic component that in Persona is linked to the meticulous organization of school days and activities is lost, but the result is a more immediate, fast and light experience. Compared to any Persona episode, Tokyo Mirage Sessions lasts less - about forty hours if you focus on the story - but it has a much faster pace: after just an hour of play, you will have faced the first dungeon, taken familiar with the combat system and defeated the very first boss. For the entire duration of the adventure, it is the player who decides whether to focus on the main story or take a break to devote himself to secondary missions, strengthen the party and deepen relationships with the supporting characters. It's a shame that this brisk pace and light progression of the experience isn't accompanied by an engaging story and original characters. What makes Tokyo Mirage Sessions absolutely unique from any other Atlus RPG is its theme. Over the years we have seen idols, rock stars and actors appear in the Persona series in the form of secondary or playable characters (an example is Rise Kujikawa in Persona 4), but never as in Tokyo Mirage Sessions has the Setagaya developer embraced Japanese pop culture to create events, settings, characters and enemy designs. News and changes Everything revolves around Fortuna Entertainment, a talent scout agency that publicly promotes and represents idols but whose real goal is to hire people who have the potential to fight the Mirage, the evil forces that have been attacking the inhabitants of Tokyo for some years. A not too elaborate story, but which gave the screenwriter Yoh Haduki (Devil Survivor) the opportunity to indulge himself with a cast entirely made up of singers, musicians, pop actors with a fixation on Hollywood, extras in tokusatsu programs and winking ex-models . In this circus, Itsuki, the player-controlled character, has almost accidentally stumbled upon it, but is immediately confronted with the absurdity of the main missions: from casting for an investigative TV series to rehearsing for a big concert, from overcoming anxiety to meet fans in person to working up the courage to pose for a photo session. We find ourselves in lively and demented situations, but unfortunately the cast is so flat and stereotyped that it is hard to feel completely involved in the story. There is no trace of plot twists or turns capable of shaking up an all too predictable plot, and the only thickness of the protagonists is what is found in the generous forms of the female characters. The main missions mostly follow Tsub's rise in the star systemasa and Itsuki, and for this reason dedicating time to the side quests becomes essential not only to unlock new skills and strengthen your party, but above all to get to know the rest of the supporting actors better and to witness some of the most successful gags in the game. Among the unpublished contents introduced with this Encore version of Tokyo Mirage Sessions #FE, some side quests related to secondary characters stand out, as well as a new dungeon called Area of Aspiration. New levels of the dungeon are unlocked as you progress through the story, while exploring it in every corner you can find and collect new costumes inspired by Persona 5, Fire Emblem: Three Houses, Etrian Odyssey Nexus and Shin Megami Tensei: Strange Journey. To complete it all, there are four new songs (each of which has its own animated sequence) and the possibility of having Tiki, Maiko and Barry participate in battle as support characters to prolong the combos. So those who have already played the original Tokyo Mirage shouldn't make the mistake of expecting new playable characters or an addition of massive content as was the case for Persona 3 FES, Persona 4 Golden and Persona 5 Royale: this Encore edition of the game is limited mostly to include the DLC of the Wii U version in a single package, and to introduce some improvements to the gameplay. Among these, in addition to a mini-map that can be activated and deactivated, the new ~Quick Session~ key stands out, which allows you to speed up the long animations of the Session attacks and which, combined with much faster loading than in the original game, breaks down waiting times (making the game shorter and more compact). Some of the new costumes introduced in the Encore version Marginal smudges Now free of delays and interruptions, the turn-based combat system is immediate, explosive and fun, although it still suffers from the balance problems of the original. On paper, the clashes take place in a way not too different from many other Japanese RPGs, with elemental weaknesses and resistances, spells and objects, status changes, special and chained attacks; yet it is enough that one of the three characters on the field is knocked out. to significantly decrease the chances of winning. Especially against certain bosses, it's easy to find yourself stuck in a loop where the weakest team member is continually killed and resurrected, without having time to replace them with a more suitable character. Also due to the frequent spikes in difficulty, it thus becomes necessary to resort to grinding sessions to enhance one's team, which fortunately is made less tedious by the inclusion of a dungeon aimed precisely at training (on Wii U it was sold in the form of DLC). Slip into an RPG full of character, which even if it draws heavily on mechanics and ideas from the Persona series manages to find its identity in the genre. Find the differences Since its release on Wii U, Tokyo Mirage Sessions #FE has caused a lot of discussion due to a series of censorships applied to the game in the United States and Europe. The watered-down western edition mostly altered some skimpy outfits and removed a series of animated skits that took place in a thermal bath. These are trivial stuff that does not affect the general experience, but there is a particular case in which these modifications distort the background of a character and completely transform the meaning of a dungeon that originally focused on gradil theme (don't google if you have someone next to you). As already known before the release of the game, the Nintendo Switch edition of Tokyo Mirage Sessions #FE is based on the western version that appeared on Wii U, and therefore inherits all the changes and cuts made during the localization phase.", "date": "2020-01-15", "grade": "8.0"}