{"name": "Goodbye Deponia e Deponia Doomsday", "ref": "https://multiplayer.it/recensioni/goodbye-deponia-e-deponia-doomsday-recensione-nintendo-switch.html", "text": "The Deponia series has now a high-sounding name within the gaming market. It is true that these are point-and-click adventures in full 90s Lucasarts style, but despite this, the Germans of Daedelic have been able to set up a tetralogy capable of stirring up many minds. This review does nothing but analyze the porting for Nintendo Switch and the legacy of the last two chapters released in chronological order: Goodbye Deponia and Deponia Doomsday. If the first represented in all respects the end of the original trilogy as it was conceived, the second shuffled the cards in play, changed the events and upset all our certainties, for an episode as crazy as it was successful. A few years after the closure of the series, and aware of a studio now grappling with certainly more impressive projects thanks to the Lord of the Rings license, let's take stock of this umpteenth re-edition. Goodbye Deponia The third chapter of the initial trilogy had to somehow close a crazy but complex story, capable of staging a hundred different characters and hours and hours of absurd dialogues. For those who have no idea what Deponia is, this is certainly not the place to find out, but know in short that it is the story of Rufus and his friends in search of the solution to reach Elysium. The Earth is in fact now a pile of garbage and the big landowners have taken refuge in an idyllic place built in the sky and which, initially, was only meant to serve as a temporary shelter. , Deponia has come ever closer to a winning formula, made up of brilliant and ironic dialogues (although not suitable for all palates) and capable of interspersing a more adult story than one might expect with funny and out-of-anywhere situations. idea of logical approach. The third and until then last chapter was able to leave a great void in the players, enraptured by the events that struck the heart in the final phase of the adventure, also making them think more than they should. Despite this, the ten hours needed to complete the game made progress sluggish in the central phase, perhaps failing to give the same sensations experienced with the growth of team awareness during work on the second iteration. On the other hand, the ability to have given a worthy ending, albeit not unanimously appreciated, cannot be denied, a detail that is not at all obvious in a market that often sees endings among the worst moments of videogame experiences. On Nintendo Switch the title looks good and is a pleasure to play. Of course we're talking about a port in all respects, so forget about special rethinking of the interface or the ability to use the touch screen. Otherwise, it's hard not to show a big smile when Deponia's saturated colors and handmade drawings come out of the Nintendo hybrid screen. Portability, especially for an adventure of this kind, represents the interesting and essential element of an experience that has otherwise already been seen and revised. From a technical point of view Goodbye Deponia does what it has to without stunning but also refusing to compromise . Certainly more beautiful in its portable version, it only loses a few hits when seen on a TV, but it is still a question of resolution and not of problems related to frame rates and the like. We would like to recommend it to all those who have already bought the first two chapters in recent months, at least to close and make sense of the entire trilogy. Deponia Doomsday What happens when you have an interesting intellectual property in your hand, sought after by the public, impossible to repeat and that has not completely convinced your fans with the ending released some time ago? It clearly depends on which development studio you are: you could decide to release the ending via DLC only because it is strongly requested by the public, or you could be Daedelic and realize the fact that the series in question is called Deponia.The fourth and final installment of the series (at least for now) is the one that most of all recalls and exclaims the basic madness on which the whole work is fueled. Reshuffle the cards and try to justify some events and change others, also introducing new characters who, however, fail to hit the mark as happened with the originals. The strength of the protagonist Rufus is always there and, indeed, Deponia Doomsday is perhaps the chapter of the definitive maturation of the German studio and of their own unforgettable character. Despite this it is impossible not to perceive a minimum of tired production, both in situations and in puzzles, which however seek logic more than usual. The gameplay also tries to innovate the right way, inserting very light quick time events and the need in some situations to repeatedly press some keys. Unfortunately, these additions only confirm what was said a few lines above, embodying in their essence all the problems of a system that appears asleep rather than run-in. space with great skill to get everyone to agree, however making the return to the crazy world of Deponia more than pleasant for the scarce ten hours necessary to complete the last iteration. From a technical point of view, what has already been said for the previous title is reconfirmed, without leaving room for particular critical issues and giving its best performances in a portable version.", "date": "2020-01-14", "grade": "8.2"}