{"name": "AO Tennis 2", "ref": "https://multiplayer.it/recensioni/ao-tennis-2-recensione.html", "text": "When we talk about the videogame reproduction of tennis, we touch on a rather delicate topic. Let's put it this way: despite a discrete niche of enthusiasts, unlike the ~cousins~ dedicated to sports such as soccer, American football, basketball, hockey and baseball, those dedicated to tennis haven't seen the light of success for a few years. We had prominent exponents such as the Virtua Tennis series (still in the main chapters in 2011) or Top Spin, but also some not too excellent releases such as Tennis World Tour and AO Tennis. Just the officially licensed Australian Open franchise, after the failure of the first chapter, is preparing to return to the shelves thanks to a renewed sap also given by Big Ant Studios which has taken over the reins of the project. So let's see in our review of AO Tennis 2 if, after years of darkness, the world of videogame tennis is ready to re-emerge in the sunlight. Right and reverse The greatest value of AO Tennis 2 is to entertain. We want to specify it right away: the gameplay of AO Tennis 2 is a hybrid between arcade and simulation that is extremely fun to play. The title published by BigBen Interactive offers a series of animations that are very close to the movements and plays that can be performed on a tennis court and they give the player the sensation of having to put a lot of effort both in the precision of the movements and in the approach to the match. The search for the ball, the timing of the approach to the shot, the return in the middle to prepare for the next reply, are tricks that must be sought in-game by the player. This is accompanied by a classic stroke control system (the four main keys X (A), O (B), square (X) and triangle (Y) are assigned flat, top spin, slice and underhand strokes) which it is integrated with a stroke power/accuracy system (the same goes for the serve) which will act on the pressure time and the release time of the key used to hit the ball. Three back buttons (L2/LT , R1/RB and R2/RT) are then assigned the inside out, the run to the net and the shot modifier key to make it a forced play (i.e. the use of a more shot powerful than normal usually used to try to close a long rally or to force the opponent to open his defense). The whole of this gameplay is rather harmonious, seasoned above all by a greater care of the facial and body animations aimed at reducing the puppet effect, proposing instead bodies more similar to reality. The work done with Rafa Nadal, the title's main male testimonial, was probably based on these aspects and it must be recognized that the leap compared to the previous release is substantial. Even the artificial intelligence is really tough and reactive (in some cases even too much) pushing players from the lowest levels of difficulty not to underestimate the challenge proposed by the title. Unfortunately, however, the title is not free from defects: first of all the artistic side, which by approaching a good level of animations clashes in quality not only for some of the textures of the players but above all for what is the outline. Mind you, it's not a poor graphic level, but certainly for the times that are running there is better. The official players inserted will be 25 with Nadal, Wawrinka, Monfis, Barty and Stosur commanding the train of the famous, followed by a fair number of not so well known (the various Andersons, Isner, Garcia, Puig will excuse us). Heavy absences therefore starting from Federer and Djokovic for example which can however be filled with the useful and rich editor, if you are good at DIY, or by downloading the creations of the community (as happens in the WWE 2K series). Another problem is with the number of errors committed by players both at the net and on the net, but let's explain ourselves better: we have seen how shots and consequently the serve are managed both in terms of power and accuracy with a bar linked to time of pressing the corresponding key, therefore to hit the perfect shot (i.e. the green) there is a timing to be respected in releasing the key and this time window varies not only according to the difficulty chosen but also according to the more or less high skills of the player used. Therefore, if with Nadal, Monfis and the like, for better or worse the error window can be managed accurately, with a player created from 0 playing Grand Slam mode for example, the number of errors with shots off the pitch and/or services sent at the net it will force you to review many of your tennis safeties, to put it mildly. In the footsteps of Nadal As for the game modes and possibilitiesoffered by AO Tennis 2, in addition to the aforementioned player and stadium editor, players will be able to try their hand at the Play Now mode, in the Australian Open mode which will make you play the famous Australian tournament, then Tutorial to learn the basics and train, the online to compete against other players from all over the world, Competition and Scenario which will allow you to create the tournament of your dreams, while the second will allow you to create a game with the possibility of inserting special victory conditions (having a pre-established number of games of advantage, never miss a tie break, etc.). Finally the academy and career modes. The Academy mode will contain all the editors (players, stadiums, logo scenarios and competitions) but also the rankings of the most popular creations of the community as well as the menus used for downloading these creations. Finally, the Career, the true heart of the playful experience of the title that will put you in the shoes of either a player of your choice or one you have created to face the climb to success. The Career mode will be modeled on the basis of your ability: an up-and-coming youngster will have to work his way up in minor tournaments before landing in competitions such as the Australian Open or the fictitious Champions de Paris (Roland Garros) and Royal Championship London (Wimbledon), while a star will already be ready for those tournaments. Also interesting are the choices of providing some 2K-style narrative support (although not with the same depth and possibilities) and of inserting player reputation based not only on performance but also on pitch behavior (through the pressure of two keys L2/LT and R2/RT it will be possible to contest a referee's decision by calling the review of the Hawkeye or react well or badly to the points gained and lost.We are obviously talking about good or bad features seen in other forms elsewhere, but this does not mean that they do not do their duty in AO Tennis 2 too.", "date": "2020-01-09", "grade": "7.0"}