{"name": "Untitled Goose Game", "ref": "https://multiplayer.it/recensioni/untitled-goose-game-recensione.html", "text": "After having been brawny warriors, Italian plumbers, blue hedgehogs, soldiers, heroes and many other things, for the first time we find ourselves wearing the feathers of a mischievous goose grappling with a rather evil plan: let's see how it feels in such situation in the Untitled Goose Game review. This strange House House game started out as a sort of joke between friends, but we have already seen in other cases that this initial situation can lead to excellent results, precisely because creativity driven by a comical vision can be reflected in something positive, especially when it comes to games and therefore products that ultimately have to entertain. Goat Simulator is an example of this process finished quite well, even if Untitled Goose Game has an artistic direction on its side that there is very little to joke about and which together with the remarkable coherence with which the gameplay is built helps to give a characterization very strong to the product. However, what emerges strongly in the experience with this House House title is the fact that the developers have actually managed to build a real game on their bizarre idea, which has a logical and coherent sense and development, which it is difficult to achieve when based on an abstruse concept or directly a funny joke. There are obviously limits in Untitled Goose Game but these are inherent in the condition of having to deal with a goose intent on sowing chaos with the few means at its disposal, and it could not have been otherwise. In the small space of action that the authors allowed themselves by deciding to stage such a situation, the video game that they managed to pull off is admirable: there is not only the enthusiasm of being a mischievous goose, but also stealth mechanics that in some cases make more sense - and are definitely more fun - than those seen in serious video games of this type. Sure, the fame that this game has earned in a few weeks, immediately emerged as the subject of memes, bounced between the tweets of various celebrities, and quickly became a sort of pop star, is deserved up to a certain point, and risks doing so. to be almost obnoxious, but leaving out the cultural phenomenon and simply immersing oneself in its world, its out of the ordinary character is distinctly noticeable. The gameplay between paws and beak It is not known how this is possible, but the goose has a notebook in which he has annotated, ordered and in beautiful handwriting as a true mastermind of the crime would do, the objectives to be completed in order to move on to the next stages of the game. These are always rather unpleasant and annoying actions, obviously for all those who are not the protagonist goose, who instead is having a great time. Untitled Goose Game is a sort of sandbox with stealth and adventure elements, in which we have to carry out various crimes ranging from stealing objects to causing various accidents, all without excessively negative consequences, generally disturbing the public peace of a quiet village in the English hinterland . There are objectives to follow but the whole game world, which gradually opens up by reaching these goals, is in fact a sort of large playground for the terrible goose, so before attempting any logical approach to solving puzzles, it is better to simply try to use the beak, the wings and to squawk on all the characters and elements of the scenario. It is not always easy to understand the chain of causes and effects with precision and the sequences of actions to be carried out to achieve the desired results are often a little absurd, which forces us to interact haphazardly with everything around us, to understand the possible consequences of various actions. But really, isn't that precisely what an overactive goose would do? This is precisely the point: immediately immerse yourself in our role as defiant birds, putting your beak on anything and surprisingly squawking become natural actions and our curiosity is transfigured into an animal instinct, in wanting to steal objects and disturb the peaceful existence of the villagers to the simple pleasure of doing it. The lightness of the tones means that nothing ever leads to extreme consequences, which obviously dilutes the typical tension of the stealth game by ridiculing it in a sort of parody, but its mechanics are still perfectly functional, albeit watered down. The result is a sort of simulation of goose, which forces us to deal with the physical limitations of the animal in question grappling with seemingly impossible actions, trying to trigger chains of cause and effect starting from thefts and creative interactions with various objects. Whatemerge is a hilarious sequence of gags in front of which it is impossible not to smile. An animated picture Its aesthetic appearance largely contributes to building the strong identity of Untitled Goose Game, thanks to a particular graphic characterization and a soundtrack perfectly studied to underline the action on the screen. The quiet English countryside comes to life in a surprisingly clear way in the few polygons used to represent scenarios and characters, with its simple shapes, large surfaces and full colors to return bucolic squares in which to plunge chaos, however always maintaining a certain formal order specifically British. It is impressive to note the care with which the various side characters have been created, whose figures, although stylized, manage to stage a theater of simple but extremely realistic actions and relationships, making us fully immerse ourselves in the atmosphere of a small village with its and its established relationships. The goose breaks into all this, the agent of chaos who aims to break the balance by hitting the country's standardized routines, reviving the flow of the day with an unusual vivacity. The animations of the protagonist are then a separate matter: it is essentially a real goose, although this too is highly stylized in the fullness of its simple forms, but the realism of the movements applied to stealth game situations prints a smile on the player's face constant, in realizing how much a goose engaged in the most absurd adventures can make you laugh, simply remaining as faithful a representation as possible of the animal in question. There is nothing characteristic about the protagonist, nothing that distinguishes her from any other bird of the same species, yet she appears endowed with an incredible charisma. The game essentially aims to stage a series of linked gags that recall the classic humor of silent cinema sketches, perfectly supported by a soundtrack that emerges to underline the actions on the screen, proposing fragments on the piano taken from pieces by Claude Debussy . Even the audio accompaniment is perfectly designed to support House House's remarkably consistent vision of the original game idea.", "date": "2019-12-20", "grade": "8.0"}