{"name": "Borderlands 3: Moxxis Heist of the Handsome Jackpot", "ref": "https://multiplayer.it/recensioni/borderlands-3-moxxis-heist-of-the-handsome-jackpot-recensione.html", "text": "Borderlands 3's arrival on the market was more turbulent than expected. Although it was one of the most anticipated titles of recent years, the game was forgotten almost too soon, even going so far as to ignore it as regards the very fresh The Game Awards 2019. Despite this, Gearbox's work on Borderlands 3 and its packages of expansion, it has practically never stopped and in these hours the first paid content arrives on the market which aims to expand the narrative arc of the title. We then played Moxxi's Heist of the Handsome Jackpot and it's now time to tell you what we think in this review. Jack is dead, long live Jack It is useless to hide that among the few things that have not made their way into the hearts of Borderlands 3 players there is evidently the new couple of villains. The Calypso twins offer a discreet background and a setting of modern influencers that certainly convinced the writer, but this does not exclude a basic flatness and inconsistency, especially compared to the inimitable Jack Il Bello, who indirectly returns as the protagonist in this first DLC . The narrative premise is quite simple and is all compressed into the title of the package. Lost in the galaxy is a gigantic space station that represents Handsome Jack's galactic casino. Following his death seven years earlier, the situation in the casino got out of balance. The forces of the Hyperion have taken over, the guests have gone insane and in the meantime Moxxi asks us to put together a team and pull off the heist of life: steal the entire casino and turn it into her own personal playground. With this excuse we set off on a journey which, as always, varies greatly in longevity based on the amount of side missions you will carry out and the difficulty set. It took us a handful of hours (say between four and five) to finish the campaign, some side quests and some inventory management. Considering that we have played chaos one, it can be said that in this case we are faced with a standard package, without infamy and without praise from a content point of view. During the short journey, new crew members are met, always above the lines and in classic Borderlands style, which sometimes even surprised us with a couple of twists. This is because from a writing point of view, Borderlands 3 remains interesting and sought after, much more than its predecessors. Unfortunately, the narrative arc in itself does not shout the big news, even going to recover the idea of enlisting the team as already happened during the main campaign. For this reason, although particularly successful and fun, it is still a story designed specifically for Jack's orphans, as if to somewhat deny the work done to try to go further in the Borderlands universe. As for the secondary tasks, these only confirm what was already said in the review a few months ago. The care in writing has risen dramatically and even if we haven't found the crazy genius of some side quests included in the base game, they are still fun and written well enough. The gameplay that doesn't need to change We close the judgment on this DLC by talking specifically about the gameplay, the additions and the particularities of this package. It goes without saying that those who have not appreciated the third chapter of Borderlands will certainly not find enlightenment thanks to Moxxi's Heist of the Handsome Jackpot, but on the contrary anyone who is still fond of Gearbox's work will fortunately feel at home. The frenzy of the latest iteration, the ability to slide into battle, gear management and all the details you've come to love will be there waiting for you again, with the addition of a series of truly devastating new weapons ( and we are not referring only to a rocket launcher that looks like a railgun), new equipment, some new skins to apply and a whole gigantic new area. As was to be expected, the possibility of traveling to different planets introduced with Borderlands 3 has allowed Gearbox a hitherto unexplored creative freedom. The Handsome Jackpot is in fact a gigantic orbiting space station, near a black hole, on which you will find a large number of areas, all sufficiently large and also with a variety of colors and level design that we would not have expected. It is clear that it would be stupid to expect something as impactful as the planet Nekrotafeyo, but some narrative gimmicks have allowed Gearbox to insert something that we would not have expectedand that still made us smile more. We want to make you understand how we are not even remotely close to the jubilation experienced with the past DLCs (Tiny Tina above all). These are moments and characters that are difficult to replicate. This does not mean that Gearbox's ability to put fun gameplay on the plate, combined with a crazy and over the top story, represents the business card of a looter shooter that has set school and which, although it has not been able to renew himself, is still the best on the market today.", "date": "2019-12-19", "grade": "8.0"}