{"name": "Battle Prime", "ref": "https://multiplayer.it/recensioni/battle-prime-recensione.html", "text": "The review of Battle Prime, BlitzTeam's competitive shooter launched globally a few days ago in freemium format, represents an important testimony of how a small independent team can give life, within a year, to a product not only driven by a powerful proprietary engine, but able to compete at the highest level on iOS and Android. Matured over a long period in soft launch, the game allows you to participate in exciting six-on-six matches within different maps and modes, controlling characters that can be unlocked as experience is gained and that each have different equipment and a peculiar ability. There are currently seven classes available: Shock, the starting soldier armed with an assault rifle and light machine gun; Vityaz, an armored unit that fights with a heavy machine gun and shotgun; Vision, a skilled sniper with a sniper rifle. Then there are two other characters obtainable with supplies, one with assignments and finally one linked exclusively to the premium subscription. This element characterizes the peculiar Battle Prime monetization system. You can play for free without any problems or limitations, but by signing up you get more items, progression is faster and you can try your hand at exclusive achievements to get extra rewards. In short, we are talking about a Battle Pass in all respects, which can be paid on a weekly basis (5.49 euros), monthly (15.99 euros) or half-yearly (63.99 euros). It's a lot? Is it little? It all depends on your desire to deepen the gaming experience, naturally starting from a free use. Gameplay and structure As mentioned at the beginning, Battle Prime is a third person shooter and it is therefore natural to compare it with PUBG Mobile rather than with Call of Duty: Mobile, even if in the end we are talking about an experience that is closer to the atmospheres of the Activision shooter for via exclusively competitive team modes: you can try your hand at traditional deathmatches, with modified versions of the same (in the confirmed kill style) and with territorial stipulations in which you have to control points on the map or place bombs while the other team defends the position. Similarly, the scenarios should currently present six different environments, very different from each other (ranging from the typical Middle Eastern map to the forest, from the industrial platform to the bunker, passing through the villages) and, above all, damn valid in terms of design and realization. The graphics are undoubtedly one of the strengths of Battle Prime: the game boasts substantially better animations than those of the aforementioned PUBG Mobile, textures and shadows that are also more sophisticated, although the general interaction is lower and similarly the gameplay verticality appears very limited. It is even possible to choose whether to opt for the 30 frames per second with more details or for the 60 fps with some sacrifices, however difficult to notice. That said, the touch control system is almost perfect: you can activate the autofire (essential element in a mobile shooter, in our opinion, as it allows you not to leave the virtual stick to activate fire separately, making the action much more dynamic), adjust the sensitivity of the various movements and switch to precision aiming by acting on a icon placed on the right side of the screen, which at that point acts as a right stick. Everything works very well and it only takes a few seconds to familiarize yourself with the controls. Which brings us to matchmaking and, in general, the enjoyment of the online experience. The long period in soft launch has undoubtedly contributed to filling the Battle Prime servers, but there is no doubt that in some games it is possible to find bots to quickly fill the rooms and start matches in a matter of seconds. Unfortunately it is easy to realize this, when for example there are opponents who proceed with their heads down literally acting as a target, not even so mobile, and allowing us to skyrocket our kill streak. As the cycle of games continues, however, the problem is limited and we finally find ourselves dealing with human players, on average not very strong but at least awake and combative.", "date": "2019-12-18", "grade": "8.5"}