{"name": "Super Mecha Champions", "ref": "https://multiplayer.it/recensioni/super-mecha-champions-recensione.html", "text": "The Super Mecha Champions review sees us once again engaged with a battle royale, which however stylistically distances itself from the various PUBG and Fortnite by adopting a very effective and well-crafted anime aesthetic, which stands out right from the excellent cinematic introduction: among the best ever seen in the mobile field. There is no story accompanying this new battle for a hundred players, we simply find ourselves participating in a real battle that takes place within a large urban scenario, on which we must rigorously parachute, with the possibility after a few minutes to recall your robot, exactly as happens in Titanfall. The mech must be selected from those available for free (others must be unlocked with patience and in-game currency or through microtransactions), belonging to a shortlist made up of eleven different models, each with unique characteristics. The Firefox, for example, is equipped with a powerful Gatling gun and a missile launcher, while the Arthur fights exclusively using swords, therefore at close range. The funny Caramel, with his teddy bear head, moves awkwardly but is devastating thanks to his explosive projectiles, while the Skylark is quick and elusive, equipped with a special that cleaves the air with energy blasts. When and if our mech is destroyed, we will be able to continue fighting on foot, referring to well-established mechanics for the genre, even if we already start with a light machine gun supplied. Modes and gameplay The first mode available in Super Mecha Champions is precisely the battle royale, with one hundred players challenging each other within a generously sized scenario, which gradually shrinks due to the activation of barriers which after a few seconds can be lethal for those who it will not move to the designated area. The matchmaking is surprisingly fast, but one gets the distinct feeling of often finding oneself facing simple bots, at least judging by the ease with which it is possible to win the various clashes that eventually lead to victory, playing alone or in pairs. Once you reach level 5, a second mode is also unlocked, which is a team deathmatch in which two teams of five players must face each other in an attempt to get the most eliminations within a time limit. It seems that users currently prefer this option, and in fact the matches immediately prove to be fairly challenging and exciting, with the use of mechs which, however, appears a bit unbalanced and ends up oversimplifying the dynamics of the clash. Whatever your preference, Super Mecha Champions will support you adequately, thanks to a touch control system that with some adjustments (you need to increase the sensitivity quite a bit) becomes very precise and immediate. It is clear, being able to use a controller Bluetooth would have made the experience even more intriguing, but you can't really complain about the controls nor the production value of the game, which is really high. With a little more consistency in terms of collisions and an automatic fire system we really would have been faced with a point of reference. Having said that, graphics and sound are excellent: the anime style is represented in a convincing way, net of the inevitable stereotypes regarding the characters, but it is the mechs that play the role of absolute protagonists: their design is generally guessed, with many small touches of class on the animation front, very accurate. The map has good views and a minimum level of interaction, but it is a recurring element for battle royale, while the music effectively accompanies the action.", "date": "2019-12-13", "grade": "8.0"}