{"name": "Star Ocean: First Departure R", "ref": "https://multiplayer.it/recensioni/star-ocean-first-departure-r-recensione.html", "text": "Almost everywhere in the world of entertainment it is a period in which, with some rare exceptions, screenwriters and authors seem to lack ideas. And even when there are, they often don't seem to attract the attention of possible lenders, almost as if an unprecedented project, albeit with potential on paper, weren't enough to gain the trust of the producers. So many companies, fearful, decide to play it safe, and to invest in the remake or adaptation of old successful productions for today's audience. If at the cinema we see continuous remakes more or less successful and more or less faithful to original, even in the world of video games, remakes or remasters of successful games from the 80s/90s abound. Star Ocean: First Departure R in this sense belongs to the latter category, being one of those titles that are re-proposed in high definition with some unpublished content. Based on the PSP remake of the first Star Ocean made in 1996 on Super Nintendo, the title is in fact to be considered a sort of ~plus~ version of the Sony laptop edition, ported to Nintendo Switch and PlayStation 4, a version which We review more in this article. Curiosity Star Ocean is a mostly sci-fi J-RPG saga. Its authors, as can be seen from the themes dealt with in the various chapters that compose it, are largely passionate about space travel and science fiction (Star Trek seems to be one of their most loved TV series and one that has influenced them the most). . Although with this first episode the fantasy elements were more present than the science fiction ones due to the need of the developers to attract as many players as possible and satisfy an audience of enthusiasts more oriented towards titles focused on traditional elements of the genre, such as for example the classics warriors, heroes, spells, etc. Space-time travellers Developed by the historic tri-Ace team, the Star Ocean series has always stood out from most rival productions (except perhaps in some respects from Tales of Phantasia, given that the three founders of the group, Joe Asanuma, Yoshiharu Gotanda and Masaki Norimoto, were part of that Wolf Team creator of the first chapter of the Bandai Namco series) for its typically sci-fi settings, a battle-system more focused on action than on the classic turn-based canons of the period and a skill development system usually rather deep. And it was this first episode that traced the stylistic features of future episodes. Star Ocean: First Departure R tells the story of young Roddick, a member of the Defense Force who lives in the quiet town of Kratus with his friends Millie and Dorne. One day a mysterious epidemic that turns people to stone breaks out in a village near his, and from that moment on, thanks to the meeting with Ronyx J. Kenny and Ilia Silvestri, things for him and his companions will change forever. A very interesting story that must be followed carefully through above all the many dialogues that take place during the adventure between the various characters and which, as per tradition for the genre, take place mainly through written screens, with a portrait depicting who is ~ speaking~ at that time. Unfortunately for those who prefer to play with localized productions in our language, it should be noted that the texts have remained completely in English. In any case, in addition to the main conversations there are also the optional ones called ~Private Actions~, which allow you to enjoy completely optional sequences which in some cases help to deepen the knowledge of the various elements of the cast and in others they can influence the future of some events, altering them in part. Otherwise, Star Ocean: First Departure R is your typical Japanese-style RPG of the 16Bit era, with delightful pixelated graphics, a fairly large world to explore (complete with an option to move fast), with dungeons, forests , cities, shops and inns, hundreds of items, weapons, techniques and spells to recover and improve through an excellent crafting system, and the classic random encounters (although sometimes, in certain areas, it is possible to see the enemies on the screen) that bring then to battle with many opponents. Changes from PSP The combat system, inspired by that of Star Ocean: The Second Story, is oriented towards action and allows you to manage a character in real time, but at any moment you can stop to change it or use items, spells, etc. talking. You can also decide to give simple orders to party members, to have them run automatically, such as limiting themselvesin his turn to parry the blows or take care of treating the wounded comrades; or let the CPU do its own thing entirely. But in this case we must take into account an artificial intelligence that sometimes leaves something to be desired, causing the characters to behave in a not very rational way, perhaps thinking of defending themselves rather than casting a resolving spell to eliminate a dying enemy. This aspect, combined with the frenzy of some battles, occasionally leads to slightly confusing clashes, where it is not easy to organize moves and countermoves. However, the difficulty level of the battles has been revised, and is now better balanced than the PlayStation Portable edition with a significantly higher and ~increasing~ challenge rate. From a technical point of view, as mentioned before, Star Ocean: First Departure R maintains the original graphics of the remake unchanged, which mixes two-dimensional elements with 3D areas and pre-rendered backgrounds, however raising the resolution to adapt it to high definition, ~softening it ~ and enriching it with non-static elements. Apart from a better definition of the characters, animated with more movements, the only real change consists in the remaking of the portraits of the characters, those visible in conversations or in the status screens, as written at the beginning, with new drawings entrusted to Katsumi Enami, manager of the illustrations of Star Ocean 4. In this sense, the option that allows gamers who do not appreciate them to replace them at any time with those of the PlayStation Portable remake is interesting. The same can be done with dubbing, given that the three available, i.e. the English and Japanese one of the remake for the Sony laptop, plus a third made for the occasion, can be alternated without problems during the game. The soundtrack is of excellent workmanship, characterized by truly memorable and never annoying melodies. Finally, the video interludes are also good, with the latter enriching the contents of the plot by allowing you to learn more about situations and heroes as you progress through the game, but which have two flaws, namely that the characters in the movies do not correspond very much , visually, to those of the new portraits, and that the images have not been reworked well for the HD format.", "date": "2019-12-12", "grade": "7.0"}