{"name": "Blair Witch", "ref": "https://multiplayer.it/recensioni/blair-witch-recensione-playstation-4.html", "text": "Christmas 2019: season of packages, laughter, family affection, bright decorations and... witches and haunted forests. Let's quickly upset all the beautiful context of these days from which we started with our review of Blair Witch for PlayStation 4, a conversion of the title of the same name released last summer already on Xbox One and PC. Yes, it's that video game dedicated to the film that we hope you've already seen at least a couple of times in your life: The Blair Witch Project (sequels and remakes forget them, thanks). And yes, this review will focus on the PS4 conversion as well as clearly reiterating some of the concepts we already told you about in the review of the PC title at the time. Ready to throw yourselves back into horror? Physical release and conversion on PlayStation 4 Last summer, more than one player was left empty-handed: they expected to be able to play Blair Witch on PlayStation 4 right from the launch, and instead the announcement of the conversion for Sony consoles came only later (the publication wasn't even a given since from the beginning). The good news is that you can finally buy it digitally on the PlayStation Store, or launch yourself directly on the packaged version: in fact, these days Blair Witch will also arrive on store shelves in a physical version, for Xbox One, PlayStation 4 and PC. It's always nice to see that a title receives a good response from players, such as to allow developers and publishers to invest in the retail version as well. Let's move on to the conversion of Blair Witch on PlayStation 4, which brings with it some minor but not negligible news. To begin with, Bloober Team had promised some revisions to the technical sector, to better adapt it to the potential of the Sony console (and here we clearly think that they were referring to the PlayStation 4 Pro). In fact we tried the game on the latter and we were pleasantly surprised: the writer had already had the opportunity to complete the adventure on PC at the time, and on the currently most powerful Sony console on the market he was able to appreciate a remarkable graphic detail , the complete absence of slowdowns, a stable frame rate and generally good fluidity from the beginning to the end credits. The conversion has therefore succeeded properly, even going to improve small aspects such as some textures and some polygonal models to be refined: nothing too striking, but still an intervention that will be appreciated by those who notice these changes. In addition to the technical refinements and the validity of the conversion itself of Blair Witch on PlayStation 4, it is good to note how the game brings with it additional content: the Good Boy Pack, clearly dedicated to the big dog Bullet, true co-protagonist of the adventure of Ellis in the dark woods of the Burkittsville district. It is a very secondary package, which modifies some animations of your trusted friend, will allow you to interact with him in new ways and in general will expand the possibilities of interaction between Bullet and Ellis. It's worth mentioning that all of this material is a great incentive for newcomers, but if you've played Blair Witch elsewhere it's not worth moving to PlayStation 4 to enjoy it; also because, among other things, the Good Boy Pack should also arrive on PC and Xbox One almost simultaneously, it is not yet clear whether via a free update or as paid content. Playstation 4 trophies Blair Witch arrives on PlayStation 4 with a nice list dedicated to trophies, including the Platinum Trophy: to get it, just complete the main adventure by collecting all the collectibles and playing his particular version of Snake with Ellis's PDA. In addition, you will also have to complete the adventure without eliminating monsters along the way, thus adopting a stealth approach. Plot and Gameplay: Horror at Black Hills Mountain Blair Witch is set in the forest of Black Hills, Maryland, in the exact same locations in the film. Bloober Team started from a specific film production, which then had a lot of influence in the following twenty years, even in the genre of fake documentary even before real horror. In any case, the developers have chosen to tell an unpublished story, perfectly enjoyable for all newcomers, without skimping on details, details and plot references expressly designed for lovers of the starting material. Ellis, a detective with various problems both related to alcohol and to his romantic relationship now winding down, goes to the forest to help in the search for a missing child. He has the trusty Bulle with himt, a four-legged friend who also represents a very valid psychological support for his psyche at prices. Soon the situation begins to take an ominous turn. Armed with his trusty video camera and a walkie tolkie, Ellis realizes that something is wrong in the forest of the Black Hills: the night seems to last forever, strange objects pop up everywhere, there is no trace of the police who had arrived on the placed before him, it is impossible to make contact with the outside world, and so on; up to the most serious hallucinations, the sensation of a lurking presence and real sightings... supernatural. The gameplay is typical of psychological survival horror with a clear exploratory direction: the player impersonates Ellis (first person view), explores the forest with a constant sense of anxiety, finds objects, puts them back together, solves simple environmental puzzles, enjoys a enjoyable narration and occasionally fight/try to escape from present enemies. The game mechanics are particularly enriched by the presence of Bullet: the dog, if the player asks him, can bring us objects otherwise impossible to find, identify enemies and dangers, help us ~psychologically survive~ the drama we are experiencing. It is then up to the player to choose whether to reward him with snacks, whether to cuddle him, or scold him: this affects their relationship and the validity of the four-legged friends in continuing the adventure.", "date": "2019-12-09", "grade": "8.0"}