{"name": "SD Gundam G Generation Cross Rays", "ref": "https://multiplayer.it/recensioni/sd-gundam-g-generation-cross-rays-recensione.html", "text": "The SD Gundam G Generation Cross Rays review is in many ways an event to celebrate, given that Bandai Namco has finally decided to bring the latest exponent of the famous strategic series to Europe, albeit only in the Steam version. We are actually talking about a franchise with a particularly vast and multifaceted history, based on super deformed style aesthetics, which has its roots in the early 90s with the initial episodes of Super Robot Wars, available first on Game Boy, then on NES and SNES, finally arriving on PlayStation at the dawn of 2000. Those who know the brand will certainly be aware of the division between super robots and real robots. In the first category there are the various Mazingers and the assembleable ones such as Daltanious, Godsigma, Godmars and Combattler V: huge machines, characterized by an unrealistic setting, which focus on pure power at the expense of speed. In the second, however, there are the many exponents of the Gundam saga and the like: plausible mechs, far from indestructible but capable of moving quickly and therefore easily avoiding the blows of enemies in battle. All series featured in the game Considering the wealth and extraordinary Japanese popularity of the Sunrise franchise, it was only a matter of time before real robots began to become the protagonists of parallel productions, of which SD Gundam G Generation Cross Rays is but the latest exponent. The game includes thirteen different campaigns, some very short (consisting of two or three missions), others decidedly longer, which retrace the events of Mobile Suit Gundam Wing in order with the relative expansions Dual Story G-Unit and Endless Waltz, Mobile Suit Gundam SEED with various Astray, X Astray, Destiny and C.E. 73 Stargazer, finally Mobile Suit Gundam 00 with 00F and The Movie, and finally Mobile Suit Gundam Iron-Blooded Orphans and Iron-Blooded Orphans Gekko. Apart from Gundam Wing, which we also saw in Italy just over fifteen years ago, and Iron-Blooded Orphans, available in a subtitled version on Netflix, the compilation therefore appears lacking where the goal was to attract the attention of fans old and new, unless we are talking about purists who have recovered the various productions in the subbed version. In fact, the great classics are missing (Mobile Suit Gundam, Zeta Gundam, Gundam ZZ, F91) as well as the latest and most famous interpretations of the franchise (Mobile Suit Gundam Unicorn, also available on Netflix with subtitles). It is obviously not the fault of Bandai Namco, which limited itself to proposing in the West what is the last chronological production of the brand, but the problem of interest remains and indeed becomes particularly pressing in the face of a price of 49.99 euros on Steam. Gameplay and setting The formula of SD Gungam G Generation Cross Rays, which is the same as the original Super Robot Wars, assumes that the player already knows the events that are narrated, presented on the screen through a series of visual novel-style dialogues which their very nature cannot involve much or effectively recreate certain atmospheres. It is therefore a game of references and memories, without which you will invariably find yourself skipping the textual parts to quickly get to grips with the real action, which unfortunately too has evolved very little in these almost thirty years of history. The gameplay is always the same: within very generic and dull scenarios, which serve only as a backdrop to the battles, we will have to arrange our units (possibly choosing between different possibilities, for example deploying the bases or not) on the ~board~ and face a variable number of enemies within a turn-based system of a traditional type to say the least. Exploiting the energy available to each mobile suit we will be able to launch attacks of different types, using for example lightsabers or powerful cannons, and create different chains based on the position of our robots, which will be able to support each other to double the damage and possibly share the consequences of the inevitable counterattack. The game gives you the chance to watch a large number of spectacular animations that show the outcome of every single maneuver, cutscenes that ultimately make you understand why the package weighs the beauty of 40 GB. Even here, however, the nostalgia factor comes into play: if you don't know the various mobile suits, you will hardly decide to watch these scenes more than a few times, opting from a certain point on to skip the animations and carry on the game more quickly . After all, the advanced missions can take a very long time to complete: you find yourself with new dop objectivesor having eliminated the first wave of enemies, for example eliminating certain targets within a certain number of turns, reaching an area of the map and managing the clash within two different and alternative scenarios. Fortunately, a save system allows you to memorize progress in order to eventually interrupt the game and resume it later. There is no doubt that obtaining the final victory in a particularly complex battle, in which perhaps one must carefully plan one's actions and resort to some expedients to catch one's breath (bringing some units back into the base, for example, to gradually restore their energy), or relying on the upgrades unlocked for characters and robots over time, produces a feeling of satisfaction that fans of turn-based strategy certainly know well. The problem, in this case, lies in the lack of substantial novelties, which inevitably ends up flattening the experience and exposing its great structural simplicity: a factor that will not fail to make its weight felt where you play without being driven by a passion for characters and robots present.", "date": "2019-12-08", "grade": "7.0"}