{"name": "The Settlers: New Allies", "ref": "https://multiplayer.it/recensioni/the-settlers-new-allies-recensione.html", "text": "The review of The Settlers: New Allies begins with the bitterness of those who really believed in this return. The series created by Ubisoft Blue Byte has always had a unique and reassuring charisma, and one of those simple but not so much gameplay. Characteristics that leave their mark and which since 1993 have transformed millions of users into fans of the genre: when you've finished one The Settlers, you inevitably want more and you find yourself looking for similar games. It also happened to the writer, who ended up hypnotized at the age of thirteen in front of the Amiga 500 and the trotting characters of the first The Settlers, intent on living their lives so small and meticulous, inhabitants of an equally mellifluous village conceived and assembled by the player. A different strategy The Settlers New Allies: the variety of buildings leaves something to be desired, but look at the beauty! This The Settlers: New Allies comes after a silence that lasted since 2010 and tries to be a sort of restart, what is commonly called a reboot. In this new form, the series is halfway between Anno and Age of Empires: from the first it takes up the concept of production chains (to make bread you need wheat which is then processed in the mill and then sent to the baker ), from the second he tries instead to steal the dynamic but not wild strategic formula. In all honesty, the mix wouldn't even be bad, it would fill a variable that is still little explored, but these two souls are so reduced to the bone that there is very little left to play and, frankly, to analyze. Campaign and skirmish The Settlers New Allies: Placing defensive structures is child's play The game consists of a ten-hour long companion and skirmish mode with which to face the AI and other human players. The first is characterized by a promising start, but flattens out after a handful of missions on the usual superficial mechanics. As often happens when there isn't much effort, the campaign of The Settlers: New Allies does nothing but propose the same skirmishes you would have in PVP, only linked together by sequences narrated without too much care or style. The dynamic of each game is equally obvious: set up your village, collect resources, expand territories and fight to erase the enemy from the map. However, none of these passages is really interesting or particularly problematic. The warehouse is the center of the village, where every resource will have to converge offering the inhabitants well-designed and well-protected roads; for each resource there are limited sources, which will be depleted over time, and others that are infinite. After a few games, you will learn to set up a self-sufficient village in no time, provided you have all the main resources available nearby. If not, it will first be necessary to explore the map to find some of your interest, then expand your territories by sending one or more handymen to shore up each new box, and finally building mines or woodcutters if necessary. The settlers have no need, you don't have to worry about giving them food, but if you do they will reward you by working and fighting with more conviction. Creating a village is a linear and very little strategic operation, if not for some rudimentary defense system that will require only a minimum of logic to be built in the right place. Click and forget The Settlers New Allies: The best tactic is click on the enemy and forget A good village will support a good army, and building one will require coal and metal, as well as well-polished barracks. Producing soldiers is the slowest and most difficult thing you can order in the game: you need a lot of resources and, unlike what happened in previous The Settlers, each requested army will generate a single fighter. The game offers different units depending on the faction you choose, but they are variations more in name than in substance: don't expect big differences between the three sides because you won't find any. There are melee and ranged units, but during battle it won't make much of a difference as these unfold in an all too chaotic way, making it difficult to figure out how to change their course. However, there are some special units that will have a greater tactical weight, which give more pleasure to be moved on the battlefield, such as the shaman for example. Big graph The Settlers New Allies: practically a crib! Do you want to know what about The Settlers: New Allies does not disappoint? The graphics. This game is really beautiful to look at, almost on a par with Anno 1800 which, however, is unrivaled in its attention to detail.cut. Exploring the maps is perhaps the thing we liked most about this wacky game because every time the show is guaranteed: fortresses on rugged peaks shrouded in fog, villages that extend over gentle and winding hills, the meticulousness of each building and elevation . An incredible work that also continues on the store that you will find inside the game, where very high quality graphic variants of each building are already being sold for real money. For the younger ones? The Settlers New Allies: Battle units don't offer much strategic variety, except those with special roles We therefore have a very simple system, and graphics to love: isn't this new The Settlers actually a game designed for the youngest, for the new thirteen year olds who have never seen an RTS up close exactly like me in 1993? If so, strange that they never said so. However, this is the only point of view that gives this new BlueByte game a reason to exist, however it cannot justify the lack of options, the lack of verve of the campaign, a combat system that is so difficult to read.", "date": "2023-03-03", "grade": "6.0"}