{"name": "Assassin's Creed: The Rebel Collection", "ref": "https://multiplayer.it/recensioni/assassins-creed-the-rebel-collection-recensione.html", "text": "The review of Assassin's Creed: The Rebel Collection catapults us into the atmospheres of two of the most particular episodes of the Ubisoft series: on the one hand Black Flag, the pirate Edward Kenway's adventure in the Caribbean seas, which made many gamers fall in love thanks to the splendor of its scenarios, the massive presence of naval battles and a new charismatic protagonist; on the other Rogue, the latest chapter released on previous generation platforms, which explores the theme of betrayal and acts as a link between the aforementioned Black Flag and Assassin's Creed Unity in the context of the so-called Initiate Saga. Exactly like for Assassin's Creed III Remastered, we are talking about a collection that arrives on Nintendo Switch loaded with content: the package includes not only the two main episodes, but also the Freedom Cry and Aveline expansions, with as many mini-campaigns that will see us take on the role of Adewale and Aveline de Grandpr, the protagonist of Assassin's Creed: Liberation. It goes without saying that the potential duration of the entire experience is around forty hours but only if you go straight on, without dedicating too much time to the numerous side quests. Assassin's Creed: Black Flag A real breaking episode, as well as the absolute fulcrum of Assassin's Creed: The Rebel Collection, Black Flag tells the story of Edward Kenway, father of Haytham and therefore grandfather of Connor, but above all a pirate of the Caribbean who one day finds himself facing an opponent seemingly unbeatable, an Assassin. Not just anyone, as we will discover during the campaign, but Duncan Walpole, a traitor who has decided to put himself at the service of the highest bidder, in this case the Order of the Templars. After assuming the identity of Walpole and reaching Havana in aboard a trader's ship, Edward discovers the Templars' plans and decides to oppose them, giving life to a clash that will lead him to face an entire army of enemies, by sea and by land, making friends with new allies and exploring locations such as Nassau and Kingston, as well as the vast expanse of water between the various islands. In terms of gameplay, Assassin's Creed: Black Flag substantially develops the mechanics related to naval battles introduced in Assassin's Creed III, but avoids forest scenarios in favor of a return to cities and the charm of their architecture, opening up to traditional racing on roofs and steeple climbing sections, essential for synchronizing the map and discovering new places and points of interest. The narrative sector suffers from some quite sensational holes, simplifications which however do not undermine the involvement and interest in a different protagonist than usual, an anti-hero with a controversial past and in search of redemption. However, the great abundance of missions is not always synonymous with quality, and in fact it often happens that you have to grapple with boring stalking that contrasts with the frenzy and fun of boarding. The combat system boasts a decent set of maneuvers and the possibility of buying new and more powerful weapons, including firearms, but the degree of challenge is reduced to a minimum due to opponents who diligently wait their turn to strike and eliminations in sequence that allow you to literally kill dozens and dozens of people effortlessly. The two expansions of Black Flag, Cry of Freedom and Aveline, offer two further mini-campaigns in which, respectively in the role of Adewale and Aveline de Grandpr, we will have to complete missions that have to do with the liberation of slaves and highlight some peculiarities of the two characters, especially in terms of skills and equipment. Edward's former partner Kenway can in fact use a whip to force enemies to the ground and finish them off, while Aveline's agility and skill with firearms is known. However, the adventure of the Assassin from New Orleans is distinguished by its brevity: it can be completed in just 45 minutes. Assassin's Creed Rogue Less brilliant on a technical and artistic level, as the last episode of the series developed for previous generation platforms, Assassin's Creed Rogue has on its side the undoubted charm of a protagonist who is different from the usual, Shay Patrick Cormac: an Assassin who decides to leave the Brotherhood following a catastrophic event that his superiors could and should have prevented, instead causing the death of many people. The removal brings Shay into the ranks of the Templars, marking an extreme of his feelings during the campaign and even leading him to hunt down his ex cocompanions. Unfortunately, this transition is not made with the right timing, and even in this case we are witnessing a hasty direction: a trademark for many episodes of the series, unfortunately. On the gameplay front we are faced with a cross between Assassin's Creed III and Black Flag, with a predominance of the navigation phases aboard the Morrigan which alternate with the exploration of interesting scenarios such as eighteenth-century New York. are some differences compared to Edward Kenway's adventure, for example the possibility of being boarded during naval battles and of automatically conquering materials upon victory, as well as the elimination of shadowing missions in favor of a series of attacks on fortresses, but the combat system is also in this case spoiled by a very low degree of challenge, which trivializes any duel. The Nintendo Switch version Having been designed for previous generation platforms, although in the case of Black Flag the project was cross-gen, the games included in Assassin's Creed: The Rebel Collection adapt without major problems to the Nintendo Switch hardware and manage to offer an impact remarkable visual, especially in the case of Edward Kenway's adventure. In fact, the great care taken by the developers in the creation of the clothes and scenarios still stands out today, six years after the original publication, and there is no doubt that some of the settings offer suggestive, in some cases even wonderful, panoramas. Both in docked and handheld mode, the frame rate holds its ground and manages to maintain the 30 frames per second without too many problems, guaranteeing a consistent experience without particular uncertainties, even if present as expected. In Black Flag the jerkiness of the radar while moving is surprising, while in portability the feeling that the games convey is pure amazement in seeing so much abundance moving in a convincing way, giving up the quality of the assets only in certain cases and even adding the controls to motion detection, optional, to manage the aim. We are therefore faced with an excellent conversion, albeit clearly based on the PlayStation 3 and Xbox 360 versions. The only flaw: the obligation to download the package with the Italian voices aside, which prevented us from being able to listen to them again during the tests seen that the download from the eShop had not yet been enabled. The various extras of the collection can also be downloaded separately, of undoubted value for fans of the series.", "date": "2019-12-06", "grade": "8.0"}