{"name": "Mosaic", "ref": "https://multiplayer.it/recensioni/mosaic-recensione-pc.html", "text": "We had already analyzed it in the mobile version, but given the arrival in a probably more congenial environment, let's take a new look at the Krillbite creature with this review of Mosaic on PC. The basic elements are substantially the same seen on the iPad, so we refer you to the previous review for all the information on the game in question, but since some of the most critical elements of the analyzed version on iOS concerned the control system and some inconsistencies of the interface, we took a second in-depth look at the PC version to note any evolutions on these fronts. Indeed, it is clear that Mosaic is decidedly more at ease in this capacity, with the use of the mouse that solves most of the problems encountered in the movement and contextual interaction with the scenarios within the mobile version, therefore on on this front we are facing a good evolution that restores the idea of a much more solid game, but obviously all the other elements remain the same, with the strengths and defects found in this small but ambitious narrative adventure. By staging the monotonous life of an ordinary employee of a gray and powerful corporation, crushed by work rhythms, induced expenses and needs, absence of social relationships and futile smartphone pastimes, Mosaic leads us to reflect on modern society and its distortions, on the inhuman paradoxes of the capitalist economy and on the superficiality of consumerist desires and entertainments. However, the game also stages a path of redemption: in the strange epiphanies that the protagonist undergoes day after day, which make him deviate from the imposed path and rediscover life and nature in various apparently dormant forms, we also witness a form of revolution, which begins silently and clandestinely but imposes itself ever more clearly with the progressive rediscovery and awareness of his own humanity by the modest employee. There is a beautiful message of hope in the expressionist greyness of Mosaic, which is discovered slowly - perhaps even too slowly - through the handful of days represented in the course of the adventure. It is something that strikes us and leads us to reflect because it speaks a little to all of us, even if it does so through a form that is not fully convincing or even completely new, but we must still acknowledge Krillbite for having at least tried to probe deep topics through a video game and this is certainly a noble intent. Video game expressionism The form in which Mosaic sends its message is that of narrative adventure, even if there is very little video game in what emerges from the screen. The orderly sequence of actions repeated several times serves to underline the distressing monotony of the protagonist's working days, the stylized graphics seek an expressionist effect in highlighting the dullness of modern life, making the bursts of light and color stand out clearly from the strange visions that appear more and more frequently, in correspondence with the progressive rediscovery of dreams and emotions by the anonymous character. From an artistic point of view, even with limited means and solutions that are actually not very original in several cases, the work done by the developers is impeccable. However, one has the constant impression that everything is subjugated to form: the concept to which the game tends is obviously rich in substance, but one arrives at it through an imposed path, a sequence of fascinating visions that leave no room for any profound interpretation by the player, who is practically never called into question except for small unimportant choices. There are various contextual interactions in the path to take, but they simply serve to carry forward the story which seems to proceed according to its own track, leaving us almost totally passive in the face of the evolution of events, this is perhaps the most critical element of Mosaic, aggravated by a decidedly slow pace despite the brevity of the game (about three hours). The only part that actually requires a sensible and active interaction is the one referring to the work that the employee carries out at the mysterious company, which represents a successful synthesis between a metaphor of the obsession with capitalist productivity and a basic but gifted puzzle game of the slightest sense. They are short bursts of gameplay in which we have to route points across a hex grid from initial production areas to an arrival area (the 'milestone', referring to company jargon), optimizing resources and subjugating anomalies. As we had also reported in the other review, an elementparticularly successful is the reproduction of the use of the smartphone as a constant presence in the life of the protagonist between spam, ideologically directed news and a clicker game that could very well be a real app, which can make us further reflect on the levels of automation and senselessness achieved even in some areas of video games.", "date": "2019-12-05", "grade": "6.8"}