{"name": "Still There", "ref": "https://multiplayer.it/recensioni/still-there-recensione.html", "text": "Still There is the brainchild of GhostShark Games, a young Italian company founded in 2011 by Davide Barbieri, Domenico Barbieri and Armando Teora. After making the online shooter Blockstorm - available in the Steam catalog since 2015 - the Roman team undertook a clear change of genre. The result was a space adventure based on the solution of puzzles and dialogues presented in text form. In this review we are therefore going to describe the characteristics and peculiarities of a work that pays homage to the great classics of LucasArts and at the same time gives a nod to Papers, Please by Lucas Pope. Our test was carried out on PC, however the title is already available for purchase on the Nintendo Switch eShop as well. Space Routine In the midst of a bizarre dream, the protagonist opens his eyes as the dull sound of his digital alarm clock brings him back to reality. Another day like many others is expected at the Bento space lighthouse, where the methodical Karl Hamba carries out his daily but precious work of analysis and control of interstellar space. The only other living being that populates the structure (if one may say so) is an iguana lying in a shiny glass case. The good Karl's social interactions are reduced to the sporadic communications via radio and the dialogues entertained with Gorky, the bizarre artificial intelligence that assists him during his work. The machine has been programmed to provide operational support but also to stimulate the only guest of the base by subjecting him to chess challenges or indulging in comments that spare no digs and a good dose of functional sarcasm to keep the atmosphere going. The interaction is based on point and click mechanics: moving the mouse cursor interacts with the numerous objects available on the screen, sometimes combining them through the use of a small inventory. In other cases it is necessary to intervene on the equipment that Karl is in charge of managing in his daily shift. The sectors of the structure include the kitchen, bedroom and bathroom, as well as a rich helm station with which to become familiar in order to continue the story. By holding down the right mouse button and performing a quick lateral scroll, you can move the view to the right or to the left to quickly browse through all the available sectors. Karl's day is filled with objectives that need to be activated at the main lighthouse terminal. Each of them must be accomplished by attempting to deduce the essential operations required by the equipment. The only suggestions come from a technical manual which illustrates the operating criteria of the devices with which the player must interact. Not everything is explained in detail, consequently the player must arm himself with patience and is stimulated to reason by relying on logic. Karl's rigid routine is disrupted when the Bento's radio station picks up a distress call from a ship in distress. The concrete opportunity to save human lives ignites the protagonist's heart, stimulating him to make himself useful within the limits granted to him by his role as a space lookout. Taking into account the content premises, Still There immediately proves to be an adventure with very reasoned rhythms . A story that basically appeals to a very small subset of gamers in what is already a niche audience. In certain phases of the story it is still possible to activate some small facilitations in solving the puzzles, even if in this way the right to unlock the objectives related to that specific activity is lost. During the game, a series of basic operations can be put into practice, such as, for example, recycling one's own urine to obtain drinking water with which to cook dishes, or even taking care of one's animal by supplying it with food and maintaining an adequate temperature of the cage in which stay. Added to this are a range of calibrations, triangulation of signals via the satellite connection, radio communications and anything else made possible by the technology available in the station. By activating the periscope you can observe the constellations and send the data requested by the headquarters, but it will also happen that you have to do your best to solve many small operational problems that occur during normal monitoring activity. If on the one hand the puzzles proved to be well thought out, resource management was vice versa a bit too cumbersome. Suffice it to consider that when you need to grab an object to be introduced into your inventory it is indisconceivable to click on it once, then press a suitable button to complete the operation. The same happens when materials have to be used or combined with each other, with rather unsatisfactory results. A system of selecting and dragging objects could certainly have made their management more fluid and enjoyable, without generating frustration. The same goes for the consultation of the Manual, essential for understanding the correct functioning of the instruments available on the Bento. Also in this case there is a lack of a specific interface which in some way facilitates the consultation of the volume and the contextual display of the work area available. The dialogues are pleasant to follow, although multiple responses are not functional to channel the narrative in one direction rather than another. In homage to the graphic adventures of LucasArts, there are also light-hearted conversations and some small gags, such as when on the radio you come across the equivalent of Radio Maria, the station that ~is detected even by the intercoms~. This is alternated with more intimate and reflective moments, which refer to Karl's personal events and his lost affections.", "date": "2019-11-22", "grade": "7.0"}