{"name": "Jurassic World Aftermath Collection: la versione PS VR2 arriva tra gli artigli di un velociraptor!", "ref": "https://multiplayer.it/recensioni/jurassic-world-aftermath-collection-psvr2.html", "text": "How would you react when you come face to face with a velociraptor? You will have the answer to this fantastic question by playing Jurassic World Aftermath Collection, a stealth adventure originally released two and a half years ago and recently adapted to the new PlayStation 5 viewer. Animatronics Jurassic World Aftermath: the cel-shaded graphics are very nice and colorful, the animations are the problem... The graphics are still in cel shading, it hasn't been overhauled stylistically, but this flat shading technique shines brighter than ever through the PSVR2 lenses and the very high resolution proposed New and more detailed textures are noticeable and, just like in all games for the latest Sony headset, the colors are nothing short of outstanding. To help these improvements are very simple graphics, sufficient in the portable virtual reality of Meta Quest 2 of 2020 but almost out of place here on the latest generation consoles. The settings can be very nice, the new lighting system gives a unique depth, the size of the dinosaurs at first is unsettling but their movements are dangerously similar to those of an animatronic in a 90s amusement park. Jurassic World Aftermath is mostly made up of environmental puzzles and stealth sequences. The former are very simple and their solution is often tied to some kind of interaction with a nearby object. It's in stealth that this game really shines despite its glaring limitations. The action closely resembles that marvel of Alien Isolation, but in a simplified and less punishing version. You have to hide under desks, crawl into pipes, snap at the right moment, while herds of hungry dinosaurs are on our trail. Their AI is not scripted, therefore it does not move according to pre-established lines, and damn if it shows: every action we take corresponds to a more or less logical reaction from the predator on duty, and we must admit that on more than a couple of occasions things got particularly intense. It is a pity that these phases become less and less fun, above all due to a very low level of interactivity with the game environment which does not allow creative solutions, nor is it capable of offering substantial surprises. Noises Jurassic World Aftermath: Stealth is fun, but it alone doesn't hold up through the entire game An already successful audio in the original version makes everything more credible, and which here has been rewritten to have a much more marked three-dimensional effect than previously. You will hear jars flying, disturbing rustling behind you, sudden thuds in the distance, hissing right above the table under which you will be hidden; you will try to be silent, even not to breathe, so that that out of control reptile does not kill you in one bite. However, it happens that sometimes the system that decrees whether we will be hidden or not fails, leading to not so clear game overs. In this new version, Jurassic World Aftermath supports all the vibration systems proposed by PSVR2 even if, we have to admit, we almost didn't perceive their presence. Too little Jurassic World Aftermath: the new lighting system distorts the atmosphere and makes it much more tangible and exciting than before Jurassic World Aftermath Collection for PlayStation VR2 is so called because it also includes the DLC ~Part 2~ released in 2021. The two contents together make the game quite long for a VR adventure, you can touch eight hours, but don't expect to find big news along the way that will lead you to the grand finale. Aftermath will remain completely the same game that you will have seen in the first two hours of gameplay, undoubtedly decent but really too limited in every aspect to deserve a light-hearted purchase. But the biggest obstacle to this game is the modest purpose it proposes, which is also somewhat the problem of Call of the Mountain: instead of climbing here, you're on your knees, and after a while you wonder if it's really worth it. Furthermore, you can also do everything sitting down, but in this way of Jurassic World Aftermath there is very little left. Hide! Jurassic World Aftermath: Mr. Hammond, after careful consideration, I have decided not to endorse your park It is right that many VR games from the recent past are also re-proposed on PlayStation VR2, in fact there are beautiful games both by Meta - Asgard Wrath would be wonderful on this viewer - and by Sony itself (from Tumble Vr to Blood & Truth we want everything back) but rest assured products have had their day and today, perhaps, it would be better to leave them where they are. The concept behind this Jurassic World Aftermath is sound, execution noIt's not bad at all, but it's right to start demanding more from virtual reality, starting with forgetting what deserves to be forgotten and restoring what deserves to be preserved. Unfortunately for him, Jurassic World Aftermath belongs in the former category.", "date": "2023-03-02", "grade": "6.5"}