{"name": "Bee Simulator", "ref": "https://multiplayer.it/recensioni/bee-simulator-recensione.html", "text": "This game has only one big problem, and that's in the title. Why the hell call it Bee Simulator, if there's nothing like a simulator at all? Perhaps they were trying to carve out a corner next to those silly simulators that sometimes become popular on Twitch, like Goat or Stone Simulator, or perhaps they were more simply afraid of being exposed, as if developing games for children is something to be ashamed of. Because basically the truth is this: Bee Simulator, whose review you read, is a game for very young people, and there's nothing wrong with it. After all, this title does not have particularly structured mechanics, there is no AI of the beehive that somehow helps us to perceive this idea of a simulator, nor even playful mechanics that go beyond a pleasant fluttering around with the FOV at 10, so you get the idea of being tiny little in a giant giant territory. In Bee Simulator, on the contrary, we find a sweet, docile, colorful world, with loving characters who push the experience along mostly narrative paths. Small but important The game has a storyline revolving around a hero bee who, despite his small size, can radically change the future of the earth. Bees are important, we know it well, and their disappearance would irreparably unbalance the ecosystem, and it is precisely this simple but important concept that provides Bee Simulator with the right incipit. You start off by performing rather basic tasks, such as collecting pollen from flowers, but even in these simple mechanics there is no real or apparent depth: just dart near a group of inflorescences and we'll be done. Further on, things slowly become more complex, with different types of pollen to be revealed with the appropriate special view, and the duty to store what is collected in the hive which here naturally represents a sort of base of operations. As in reality, different types of bees will play different types of roles, and to assign us from time to time will be none other than the queen bee herself... in person? The game is structured in several freely explorable areas, small open worlds linked to different tasks and the omnipresent collection of pollen, a key element that will also give us the opportunity to take advantage of a sort of turbo to dart faster. At this point, why not also include fights, perhaps against an evil wasp? In cases like this the camera will position itself three quarters of the two fighters while an indicator will appear at the bottom of the screen: the aim is usually to press button combinations at the right time, almost like a music game. It is useless at this point to underline the ease of each clash, such as that which practically envelops every possible action of what at a certain point will look more like a GTA at the tip of a sting than anything else. Queen bee Of course there is no violence here, not even against humans who will just wave their hands in disapproval if we try to get too close. But there is a good message, a cast that does everything to welcome you with wide open paws, and a graphic and sound design that makes it soft and warm, much more refined than its budget would allow. Furthermore, it is fully dubbed in Italian, and this is a wonderful thing: there are so many games dedicated to those who, for reasons of age, still don't know English enough not to be translated, and which for the same reason we cannot really recommend. Bee Simulator, on the other hand, can also count on a more than good dubbing, which was perhaps made possible by its poor longevity and consequently by the reduced number of speeches. As for the duration, those who already have a fair amount of confidence with a controller in hand will have no difficulty completing this ~simulator~ in a maximum of three or a little more hours, while the more experienced could easily break down the threshold of two hours. Then it must be said that graphically it is not doing so badly, perhaps it is slightly too gloomy but the Unreal Engine 4 now almost always guarantees sufficient results, even in the hands of minor software houses and with few if not very few means available . The element that stands out the most is the flight system which in its simplicity gives the idea of being an insect quite well; in the narrowest spaces there is the risk of banging too many times on the walls but you soon get used to it. When and if the case arises, the advice is to rest on the ground giving motion to our bee to put its wings back and stop on its little legs. There's also a split screen mode for two players, but if you don't have a big screen, things get unexpectedly complicated.", "date": "2019-11-19", "grade": "6.4"}