{"name": "Legend of Mana Remastered", "ref": "https://multiplayer.it/recensioni/legend-of-mana-remastered-recensione.html", "text": "There was a time when it was necessary to open each article on the games of the Mana series with a digression on the franchise, perhaps explaining the differences between the titles and the Japanese versions, given that it was little known in our area and only players who had experienced 1990s knew the important legacy of Seiken Densetsu. Thanks to a Square Enix that has never made an effort to promote the series in Europe as well, until it started churning out one remake after another, as happened with Trials of Mana last year. Now it's up to Legend of Mana, released on PlayStation between 1999 and 2000 only in Japanese and US territories. This reissue, therefore, could be your chance to recover a controversial gem, and in our review of Legend of Mana Remastered we will explain why. A story that is a puzzle Legend of Mana Remastered takes place in the world of Fa'Diel, a land tormented by centuries of war where different species have tried to get their hands on the remains of the Mana Tree, turned into magical artifacts after it mysteriously burned down. Now that relative tranquility has returned to Fa'Diel, the player takes on the role of a silent and anonymous protagonist, with the specific objective of restoring the sacred tree. Legend of Mana has no real story. In fact, it has many. The Square Enix title is a kind of collection of fairy tales in which the common thread is subordinated to all the other stories, micro-stories that characterize the world and its inhabitants, crossing each other indirectly. This is both a plus and a minus at the same time. It is an advantage for how the narrative is structured, which lends itself wonderfully to replayability, as we will see shortly, but it is also a defect because the progression has a far from linear character which gives the story a nonsense tone. Legend of Mana Remastered, a screenshot from the game. A game of Legend of Mana essentially follows three major and distinct storylines, but the player only needs to complete key steps in at least one of them to unlock the final mission that leads to the end credits, perhaps without even starting the other subplots or side quests scattered across the game world. In this sense, Legend of Mana is a title that can be completed in a few hours, but it can take many, many more to discover each subplot, character or scenario. It's worth it, partly because the title directed by Koichi Ishii is surprisingly rich in content, partly because Fa'Diel's imagery is truly amazing. The variety of races, environments and enemies is incredible, and some designs are among the craziest and most original that have been seen in a Square Enix product. The peculiar hand-drawn and colored watercolor scenarios legitimized a style that at the time was only seen in SaGa Frontier 2, before disappearing for years and being rarely resurrected in titles like Bravely Default II. Legend of Mana Remastered, a screenshot from the game. The remastered version restores dignity and pride to these small works of art thanks to the new resolution and video format, while preserving the pixel art that distinguishes the characters and enemies, very normal 2D sprites that move in the scenarios. Unfortunately on a large panel - like the one on which we tested the game in the PlayStation 4 version - the sprites appear grainy, but always show off excellent animations at 60 frames per second and more defined effects when casting spells or special attacks. It is not the only novelty on the technical front. Yoko Shimomura rearranged the original soundtrack that she signed at the time, and you can choose between the new and old tracks at any time from the options menu. Square Enix has also made some improvements to the quality of life in general, implementing the automatic and quick save, an album of illustrations and a new clearer and cleaner interface. Land Creation Legend of Mana Remastered, a screenshot from the game. Both the narrative and the gameplay of Legend of Mana are based almost entirely on the innovative Land Creation system which, today as then, represents by itself the main replayability mechanism. The artifacts that we will find in the world, often by completing the main or secondary missions, are actually real ~pieces~ of Fa'Diel, a map represented in an isometric view and divided into boxes. By placing the various artifacts in the different boxes, the player essentially creates the world of Fa'Diel according to their vision. Each artifact is then characterized by a series of parameters that represent the elemental spirits, so that each new area influencesto the surrounding ones, increasing or reducing the elemental powers and thus intervening on the gameplay: not only are the spells more or less powerful based on these parameters, but some enemies or missions appear only by satisfying certain requirements. Legend of Mana Remastered, a screenshot from the game. That's why every game is different from the others. The availability of side missions depends on the Land Creation system and the order in which the player performs certain actions, as well as the choices he makes in some subplots: siding with one character rather than another, for example, changes not only the that story, but also the attitude of some characters towards us, who could disappear or entrust us with new missions in a subtle interlocking game. In fact, getting all the combinations right without a handy guide is a very difficult undertaking, and this is probably the weakest point of the Land Creation system: much seems to have been entrusted completely to chance, the requirements to be met to unlock certain contents are not clear and in general there is a feeling of groping in the dark both in terms of gameplay and in terms of narrative. Players who want to discover every piece of Legend of Mana content will have a blast, but those who are content with a single playthrough will likely be disappointed. Old school gameplay Legend of Mana Remastered, a screenshot from the game. Legend of Mana's combat system, unfortunately, is the weakest component of the package. Those who have played the old titles in the series, for example those included in the Collection of Mana for Nintendo Switch, will immediately feel at home, but even in this case you have to deal with unnecessarily more complicated dynamics that row against the intuitiveness that characterized the series. Legend of Mana is basically an action RPG with the player directly controlling his alter ego - while any teammate is entrusted to the care of an acceptable artificial intelligence or a second human player - and moves from screen to screen , facing on the spot the enemies who block his way. A new option in the menu of this Remastered allows you to disable the clashes, so you don't necessarily have to fight every time you encounter an enemy: it almost seems that Square Enix knows the weaknesses of its re-proposition. Legend of Mana Remastered, a screenshot from the game. Once the enemies have been engaged, the combat interface appears and the player can use the attack button to launch normal blows that load a special indicator placed under the health: once filled, it is possible to use one of the special attacks set on the keys backbones. There are different attacks to learn for each weapon - at the beginning you choose one to start with, then you can find, buy or craft others - simply by using them repeatedly, but their usefulness is relative: the loading animation is so long that enemies in most cases manage to move without the hit being successful. The visual ~detachment~ between the 2D sprites and the hand-drawn scenarios, in fact, makes it difficult to evaluate distances and alignments, so Legend of Mana in many fights becomes a button masher without too much elegance. In addition to the basic attack, the character also learns a series of special actions, such as jumping, dodging or parrying, which can be set on the controller's face buttons. Then there is the magic, associated with the musical instruments that we can manufacture and infuse with the elemental spirits of Fa'Diel. Legend of Mana Remastered, a screenshot from the game. It's a light and fun combat system, but it lacks the depth or polish to make it less repetitive than it reveals after a few hours, especially when facing the gigantic bosses that fill up a good chunk of the screen and deal tons of damage if not you are quite prepared in terms of equipment and set skills. Square Enix balances the shortcomings of the combat system with a large variety of content that allows you to customize it in different ways. As the player rebuilds Fa'Diel, he also unlocks amenities such as the ranch where you can hatch monster eggs and choose an automated battle partner, the laboratory where you can build your own golem, or the blacksmith where you can build and upgrade weapons and protections. Once again, you have to devote yourself to more than one game to discover the special techniques of each weapon and perhaps find all the combinations of spells, but each system is characterized by dynamics that are too cryptic and costly in terms of time and virtual money.the. Legend of Mana Remastered, a screenshot from the game. Legend of Mana, in terms of gameplay, is not a game that has aged very well. Sacrifice immediacy on the altar of eccentricity, mixing the most varied game dynamics without a precise logic. The Land Creation system remains one of the most original that Square Enix or any other developer has devised to encourage the replayability of a title that makes its imagination and the artistic sector a real key to understanding. Playing Legend of Mana is a bit like being catapulted into Alice's Wonderland: its abstruse characters, the picturesque fantasy representation and the drama of some subplots are the engine of a rambling action RPG rich in variety and content.", "date": "2021-06-22", "grade": "7.5"}