{"name": "Speed Demons", "ref": "https://multiplayer.it/recensioni/speed-demons-recensione.html", "text": "As further confirmation of how Apple Arcade represents a happy island even for very small independent developers, in this review of Speed Demons we are talking about a title created by a single person, the American Luke Schneider who operates under the pseudonym of Radiangames. After having successfully extricated himself between puzzles, action and shooters, the programmer launches himself with this latest work into the world of arcade racing games, moreover doing it in good style: Speed Demons is in fact a product as simple as it is fun, capable of standing out compared to the strong competition on the App Store thanks also to the total absence of microtransactions and boring free to play dynamics. If the premises intrigue you, read on to understand if it is a game that deserves to be downloaded on your Apple device. In the middle of traffic The premises of Speed Demons are really immediate, so much so that there's not even a need for a tutorial explaining the dynamics of the gameplay: at the controls of a black car that accelerates automatically, the player must swipe his finger across the touchscreen to sneak through the intense traffic of the various settings, with the aim of reaching the goal of the individual stages. The game is not in fact structured like an endless runner (fortunately) but is broken up into six chapters to which a prologue, an epilogue and two appendices must be added: each of these sections is in turn composed of several parts that contain the events real ones to face behind the wheel of cars that are unlocked and upgraded as you collect the coins obtained in relation to your performance. A matryoshka structure that hides an enormous amount of content and that defends itself well even in the context of variety: the stages belong to categories that go beyond the classic competition against opponents controlled by artificial intelligence and who can see the user engaged in checkpoint racing, challenges focused on the accumulation of overtaking, destructive events in which to try to smash as many cars as possible and so on. Modifiers also intervene to shuffle the cards which give a different flavor even to events of the same type, for a title that certainly does an excellent job of exploiting every slightest nuance of its gameplay. At the center of everything, however, always remains the need to maneuver in the middle of traffic, given that impacts with other vehicles do not cause damage to the car but cause a loss of speed and consequently precious seconds for obtaining the coveted three-star maximum final rating. The driving model is nothing short of arcade, with cars glued to the asphalt capable of sudden swerves without any consequences: all with the contribution of a control system that is precise enough, even if at times it gives the impression of being a bit ' slippery, making using a physical joypad preferable. Despite the absence of even vaguely simulative ambitions, the physics of cars (and of accidents) has its own coherence, and the differences between the various models when driving are immediately perceptible. In short, Speed Demons is a well-oiled mechanism that works in every component, yet lacks that spark capable of making it one of those titles to download at all costs. Whether it's for a level of challenge that is never really tenacious, for a certain lack of spectacularity or for a game scheme that inevitably tends to become repetitive in the long run (also because the scenarios all look alike and are in fact highways), the opera of Radiangames amuses and involves the right, but without ever really taking off. Even in purely technical terms, Speed Demons does a good job but errs a bit in terms of personality: the graphics are fluid, minute and show off excellent light effects, but the choice of an almost monochromatic palette further flattens an aesthetic that already by itself it does not make one cry for a miracle. Then the choice of using a microscopic font for the writing on the menus, which appear almost illegible especially on the iPhone, is questionable. The sound adapts to the situation, with effects not received and a soundtrack composed of electronic songs suitable for the purpose but which are a bit too similar to each other.", "date": "2019-11-16", "grade": "8.0"}