{"name": "Fitness Boxing: Fist of the North Star", "ref": "https://multiplayer.it/recensioni/fitness-boxing-fist-of-the-north-star-recensione.html", "text": "~You are already dead~: the iconic phrase uttered by Ken the Warrior before the violent departure of his enemies has become material for an endless series of parodies and memes. What if we could experience firsthand the thrill of exterminating endless hordes of club-wielding brutes in the desert expanses of the dystopian future imagined by Buronson and designed by Tetsuo Hara? Imagineer has the answer, and with this new chapter of the Fitness Boxing series, he puts us in the shoes of an apprentice of Kenshiro himself, the latter in the role of instructor of us budding boxers. The premises are excellent - undoubtedly Ken the Warrior is a great choice for a boxing-based fitness game - but, in practice, the review of Fitness Boxing: Fist of the North Star tells us that the game fails to free itself from numerous historical defects of the series, first among such as the absence of effective control of the player's movements. It remains an experience capable of making you sweat, of course, but the title suffers from competition from other more effective fitness video games. The man with the seven scars Performing Kenshiro's most iconic moves in Fitness Boxing Fist of the North Star is a far from trivial feat Fitness Boxing: Fist of the North Star is naturally designed for fans of Ken the Warrior, and in this sense having Kenshiro as an instructor is certainly pleasant: the tutorial teaches us the rudiments of the noble art, starting from the guard position , from the footwork (very difficult to maintain with timing and consistency, we anticipate it) and from the fundamental shots, jab and direct. Depending on the foot held forward in the guard position, with the right and left arm we will perform the jab, i.e. the blow delivered with the forward arm, and the direct, carried out instead with the backward limb. We continue with uppercuts, hooks and dodges , in the best tradition of Fitness Boxing. What changes here are the instructors, the backdrops and the presence of the Battles, a mode that allows us to challenge gangs of thugs and then bosses taken from Kenshiro's story: ranging from Shin to Raoh, and all of them offer the most stimulating and demanding, even from a physical point of view, present within the game. By accumulating power in the course of boss battles, Kenshiro's most iconic moves can be used, and we assure you that performing Hokuto's Hundred Hits move is not a simple affair. In short, in Fitness Boxing: Fist of the North Star you sweat, and you sweat a lot; compared to the previous chapters of the series, the presence of the characters of Ken the Warrior is certainly a plus for fans: it is a pity that the plot is presented with clips from the original manga, screened against rather monotonous backdrops, but decidedly behind in terms of technical, like all production as a whole. Timing and precisionsort of The shots must be performed in time, paying attention to the indications that scroll on the screen As per tradition for Fitness Boxing, you have to follow the instructions on the screen and perform the required shots with the right timing. A discreet metal soundtrack that undoubtedly inspires ultra-violence against the poor thugs we will face in battles helps to keep the enthusiasm high, and which helps to cover the very flat dubbing of the instructors and the various characters (including Toki) who they will encourage us on our journey to become boxing masters. On a positive note: the whole game has been translated - both in text and in speech - into Italian, with an overall good overall quality. Too bad for the interface, left behind in the days of the Wii: it would really need a good rejuvenation, together with the entire graphics sector as a whole. As we mentioned at the beginning, perhaps the most consistent problem of the Fitness Boxing series remains unsolved: the lack of good monitoring of the player's movements. To throw punches, you need to squeeze the two Joy-Cons, one in the right hand and one in the left hand, and a fair acceleration in the movement is needed to ensure that it is considered valid by the system. Furthermore, jabs, directs, uppercuts and hooks are often confused, with a ~free all~ effect that does not help to achieve a correct training approach. In this sense, there is a lack of more specific peripherals, as occurs for example in Ring Fit Adventure, in which the ring and the thigh band managed to make the experience more precise and less chaotic. On the other hand, the presence of ~action support~, an option that allows you to exclude actions with which you are having difficulty, is a good idea. The advice that the instructors give in the main menu for mig is also validimprove the technique, even if in the long run they will tend to repeat themselves. Instructors and game modes Having Kenshiro as a boxing instructor will greatly excite fans of the adventures of the sixty-fourth successor of the Hokuto School Speaking of the instructors, you start with the iconic Kenshiro, but by accumulating Fitness Points by performing training or fighting you can unlock new ones (including Mamiya and the same bosses you face in Battles mode) through the shop. Instructors' clothing can be customized with various outfits, but these are cosmetic aspects that have no actual impact on gameplay. New songs can also be unlocked in the shop. In addition to the Battle mode already mentioned, you can set a daily routine, light, normal or high intensity, depending on how much we want to get involved. It is also possible to set up a daily alert at a specific time, in which Nintendo Switch (even if in rest mode) will signal us that it is time to train with Kenshiro and associates. Entering height, weight, training goals and age data allows you to make an estimate of the calories burned, which are displayed on the screen after each session, as well as obtaining a preparation of the routine, which depending on our wishes can focus only on some muscle groups or on the whole body. As also recommended by the instructors, it is advisable to stretch both before and after the actual training, also because - as we said above - the absence of accurate control over the movements increases the risk of injury, and having ~hot~ muscles ~ is a good idea before embarking on the difficult path of the noble art.", "date": "2023-03-01", "grade": "6.5"}