{"name": "Mosaic", "ref": "https://multiplayer.it/recensioni/mosaic-la-recensione.html", "text": "If you are among those who consider video games as an expressive medium with great potential, capable of conveying content, emotions and reflections through a new communication and storytelling system, then you might be very interested in this review of Mosaic. Announced way back in 2016, this is the new production of Krillbite Studio, authors of the particular horror Among the Sleep, which already showed a certain predilection of the team for the adoption of particular points of view and perspectives on common topics, moreover with an almost expressionist use of graphics able to bring about wonder (or horror) from apparently innocuous and everyday elements. This characteristic is easily found in Mosaic, which is configured as a metaphor of modern life, set on immovable tracks by an inhuman and end in itself capitalist system, which transfigures society into a gray and emotionless world. The game stages the days of an anonymous employee (in the true sense of the word: we do not know his name or previous history and he has no particular characteristics) who spends his days mainly working for a gigantic corporation, crushed by work demands and ever increasing expenses, unable to weave any relationship with other human beings. However, there is a glimmer of hope in the gray little man protagonist of this story, which glimmers in some moments in which the ability to wonder, to get excited and feel empathy still seems to emerge. It is no coincidence that, in a world rigidly set up according to the needs of bureaucracy and capitalist production, in which relationships are mediated by smartphone apps, these moments of humanity end up looking like fits of madness. Thus we find ourselves talking to goldfish, gradually discovering the secrets of the company we work for like in a conspiracy nightmare, becoming tiny and being crushed under the shoes of some white collar who is too busy not to be late for work, in a succession of disparate events that are staged day after day, as we enter the city on the way from home to work. But these daily follies are nothing more than signs of the progressive rediscovery of his humanity by the protagonist, who under the guidance of a goldfish and with the support of music and colors finds himself the protagonist of a heroic personal epic, which it will lead him to find himself by revealing the senselessness of the mechanism that cages him. Daily life, more or less The meaning of Mosaic is therefore the critique of the distortions of modern society, staged in such a way as to enable us to reflect on our existence and on what could be done to improve our condition and that of society in general. A message of great depth and an intent of enormous scope for a video game and credit must be given to Krillbite for the ability to use this medium for a particularly high purpose, that is to invite reflection. Some questions could be raised about the originality of the whole, from the subject matter to the ways of representing the inhumanity of modern society, which take up styles and elements that are now almost standardized in productions of this type, but the visions and situations in which to find in Mosaic are whimsical, fascinating and inspired. The main topic cannot be considered trivial and the desire to make us reflect on this, even if in ways that are not unprecedented, is always to be evaluated positively but there is the impression that the story follows a plot that has already been seen in part and that the pace is too diluted, despite the fact that the game lasts a handful of hours (about three, if you take things slowly). About ten years ago, the strange prototype of ~Every day the same dream~ by Molleindustria managed to illustrate almost the same topic in a perhaps more direct and incisive way in short moments of the game, just to give an example. However, there is also a gameplay to take into consideration, because Mosaic is effectively a third-person adventure with some puzzle grafts. It is on this point, in fact, that some flaws emerge: control via touch screen on iOS devices is simply unnerving but the movement of the protagonist is rather cumbersome and awkward even when using the controller. In any case, Mosaic should not be considered as a standard adventure but rather a real interactive story: real puzzles are not proposed but possible contextual interactions, in fact bringing everything back into the dynamics of the ~walking simulator~, since there are no challenge elements eitherobstacles to the flow of the narrative (which mostly occurs in graphic form). The only real game moment is made up of the puzzle game that represents the protagonist's computer work, in which we have to bring together ~resources~ towards a ~milestone~: in essence it is a question of building paths on hexagonal grids to slide points from some production bases to an arrival area. Despite its simplicity, this solution succeeds well in building a videogame metaphor of the capitalist production mechanism, in the form of a puzzle that is also quite engaging. Where Mosaic excels is in some details, which prove to be fundamental for the involvement and construction of a credible world that is tremendously close to us. The use of the smartphone, for example: every morning it wakes us up and spams us, among presumed friends who invite us to use some app and news appropriately selected from a sort of communication system. Throughout history we can download apps that are parodies so well done that they seem real, including a clicker game that can easily pass for one of the hundreds of similar mobile productions, capable of demonstrating the absurdity of certain pastimes and how they are widely used, simply by staging them as they are in reality.", "date": "2019-11-07", "grade": "7.2"}