{"name": "Harvest Moon: Light of Hope Special Edition", "ref": "https://multiplayer.it/recensioni/harvest-moon-light-of-hope-special-edition-recensione-nintendo-switch.html", "text": "You are here on a quiet Sunday in October 2019 reading our review of Harvest Moon: Light of Hope Special Edition for Nintendo Switch. This means that titles focused on the simulation of rural life, or in any case quiet productions like Stardew Valley and Animal Crossing, you must like them a lot. How can you blame yourself, after all. However, it is possible that before coming to our review you have already seen some videos, trailers, even gameplay of Harvest Moon: Light of Hope (which is not as recent a production as it might seem). And maybe something has already disturbed you, made you turn up your nose or convinced very little: for example the general glance. Your nose has not deceived you, but we will explain why and how Harvest Moon: Light of Hope Special Edition is probably one of the least valid chapters of the last decade. The contents Let's start from the contents of Harvest Moon: Light of Hope Special Edition: after all, the ~Special Edition~ there in the title was not randomly put by the publisher. Now, the basic version of the game dates back exactly two years ago, when precisely in November 2017 it was released on PC, going practically unnoticed. On closer inspection: it also suffered the same fate at the time of the second round on consoles, when on May 29, 2018 it landed on PlayStation 4 and Nintendo Switch. Not happy, Natsume decided that the time had also come for the publication on Android and iOS mobile devices, on September 26, 2018 last year. And here we come to about a year ago; just over 365 days later, in fact, Harvest Moon: Light of Hope Special Edition returns exclusively to Nintendo Switch. It is not clear according to which market logic in particular: perhaps in an attempt to return to selling a few copies before Christmas 2019, given that everything on the Nintendo hybrid console seems more beautiful and valid than it actually is. Harvest Moon: Light of Hope Special Edition, however, contains (free of charge) all the DLC released in the last year for the basic version of the title, the same ones that you could want to buy separately also on PC, PlayStation 4 or mobile devices . So let's talk about the New Loves package, with 18 new side missions to complete (short quests) and with the characters of Shirlock and Michelle, who can be married within the game. The decorations and tools upgrade pack contains two additional bonuses for the hoe and the watering can, seven fences, a statue of the goddess of the harvest and one for Doc. The Special subplots package instead offers two new additional quests dedicated to Melanie and Doc, with some outfits and furniture items to unlock. And finally A divine wedding, perhaps the most original DLC of all since it introduces the characters of the goddess of the harvest and Gorgan, king of the afterlife: it will even be possible to marry them. All these packages purchased separately would require an expense of around 18 euros, but Harvest Moon: Light of Hope Special Edition is offered as a base for 39.99 euros in total, thus marking a considerable saving. At least for those who want to play it exclusively on Nintendo Switch, since the contents are obviously not transferable elsewhere. The storyline and gameplay Harvest Moon: Light of Hope Special Edition has a plot in line with that of the usual chapters of the franchise, at least in the initial moments, but decidedly less inspired: a mere skeleton capable of holding up the various relationships between the protagonist and supporting actors, and justifying the existence of his own personal farm. In a very original way (it's not true, note the sarcasm), after choosing between a male protagonist or one belonging to the fairer sex, the player finds himself in a port town on an unknown island. He has lost his memory, so he doesn't remember who he is or have any idea where he is, but a kind girl picks him up and takes care of him until he feels better. Just so as not to miss anything, the plot immediately afterwards sees the girl donate an uninhabited and run-down farm to the protagonist, where he can move without haste. The city and the island, we soon learn, are practically uninhabited: some time ago a gigantic storm caused irreparable damage and the ancient inhabitants are gone. From here on, the progression system is that of the canonical Harvest Moons, without particular original stimuli: you take care of the farm by putting it back on track, you start cultivating, hoeing, irrigating, sowing, harvesting, rearing, removing stones and weeds, chop wood, gather resources, build and so on. All according to the rhythms of the player of course, but always keeping an eye outthe happiness indicator, after which the possibilities of the day are exhausted: at that point you go to sleep and start again the next morning. The gameplay does not shine in a particular way either, because on balance the development team limited itself to inserting some good ideas from the various chapters of the saga without treating them in a particular way: the depth of the mechanics, their synergy and their potential are approaching only partially and in very rare moments to those of the chapters for Nintendo DS and 3DS. Beyond the secondary missions and the plot, which in any case provide some incentive to return to Harvest Moon: Light of Hope Special Edition every day, the player spends the rest of the time grappling with really excessive and fine grinding and himself : accumulate materials on materials (often not too distinguishable on the screen in terms of colors and external characteristics) to complete simple constructions and upgrades. Such a title would already have made little sense without the presence of any Stardew Valley on the market. Graphic and technical sector If from the point of view of content it is possible to define Harvest Moon: Light of Hope Special Edition as a ~full-bodied but dull~ title, things do not improve even a little by taking into consideration the graphic and technical sector; in fact they get worse. It's impossible to think of a similar glance on Nintendo Switch: it's as if the developers had taken some models and renderings from the Nintendo Wii versions of the game, updated them to HD and then forced them onto the Nintendo Switch. The gap between the 3D characters and a fundamentally 2D game world is more than evident, and often even particularly annoying. This very little graphic care is reflected, among other things, also in the gameplay: try a little to select a clod of land well from all the others, and concentrate on that one. You will need at least three attempts before succeeding. The care for the objects on the screen is also bad, for the definition of the few environmental elements and the characters present, many of which simply appear grainy, even in portable mode. We could go on, for example, underlining the eternal and very frequent loading times, even between one menu screen and another, but we won't do it out of respect for the past of the series. Instead, we want to point out a positive aspect of the production, clearly a legacy of its arrival on mobile devices: touch screen support in portable mode, both for moving the character and for navigating through the various menus. It's not always very accurate but at least it's there, and it makes the portable experience more immersive.", "date": "2019-10-27", "grade": "5.0"}