{"name": "Farming Simulator 19 Platinum Edition", "ref": "https://multiplayer.it/recensioni/farming-simulator-19-platinum-edition-recensione.html", "text": "Exactly one year after the launch of Farming Simulator 19, Giants Software returns with Farming Simulator 19 Platinum Edition, a revised and corrected edition of the base game, with the addition of more than thirty-five vehicles from the manufacturer CLAAS. By revised and corrected we mean that it integrates all the patches published over the months since its launch, patches with which many bugs have been fixed and performance has been enormously improved, even on not exactly recent systems. However, it must be said that they were also released for the base game, so it is difficult to consider them real additional content. For the rest... nothing. It's all here. The game has remained exactly the same as it was last year. Little new content Before continuing, we invite you to read our review of Farming Simulator 19, which remains valid today (maybe raise the vote by a few decimal places, since the patches have fixed some of the reported problems). But let's get back to us: as we said, the only significant novelty of the new version of Farming Simulator 19 are the vehicles of the manufacturer CLAAS, very famous among fans of the agricultural world. In short, if you are interested in using work vehicles such as the Arion 660-610, the Axion 870-800, the Axion 960-920, the Xerion 5000-4000, the Tucano 580, the Jaguar 960 Tt, the Cargos 760, the Rollant 455, the Disco 1100 C or the Disco 3600 Fc, you will be happy to know that they have all been reproduced with painstaking care and animated in each of their mechanical parts. Making them 'rush' through the fields offers almost a physical pleasure, as well as being able to exploit all the correct means to have an excellent harvest. Since the love for agricultural vehicles is one of the main reasons for buying a similar title, it is safe to bet that someone will be happier to shell out the price of the expansion ( 19.99) or the base game including expansion (34 99), to be able to drive these green beasts (the prices refer to the PC version, on consoles they are slightly higher ed). After all, it's impossible not to point out that this is a really limited expansion in terms of content, because it doesn't add anything else to the game: no new crops, no new scenarios, no graphical improvements... nothing at all. CLAAS vehicles are nice, but they function much like the others in the game, so the gameplay is also unaffected. The conclusion is that either you are looking for just this, that is a large DLC dedicated to a single brand, or it is difficult to find a reason to recommend Farming Simulator 19 Platinum Edition over the less expensive basic edition, completeness aside.", "date": "2019-10-25", "grade": "5.0"}