{"name": "The Guild 2 - Recensione", "ref": "https://multiplayer.it/recensioni/the-guild-2-recensione.html", "text": "The birth of a new family There are several areas of Europe in which we can choose to settle and begin our adventure. We have the German areas of Augsburg and Heidelberg, oppressed by banditry, the mountains surrounding the Lyon area or the Sherwood forest, to range from, for a total of seven different locations and scenarios. In fact, one of the peculiarities of the game is that we will not find ourselves in a single city context, but from the very beginning of the game we will be inserted into a regional whole that includes already developed urban centers and countryside, with their structures already in place and some areas still not exploited. In addition to the ~endless~ game mode, we find here the ~dynasty~ mode, and it is precisely around this that the core of the game revolves. There is no time threshold within which to conclude our mission, in this case, so in fact we can also consider it as ~infinite~. Unless our dynasty ends, with the absence of heirs able to carry on our empire. Then there are other game modes, which we will deal with later, although unfortunately the lack of a campaign ~story mode~ really makes itself felt. But let's start from the beginning. How is a dynasty founded? Choosing the progenitor, it seems clear to me. Gender, name and appearance allow us a variety of customization which, while not as extensive as that of a pure RPG, is sufficient to allow us to feel the character a little more ~ours~. Only one small inconsistency, perhaps desired by the politically correct: opting for a male or female character makes no difference, from a gameplay point of view. Even if a career woman in the late Middle Ages really makes you turn up your nose (or satisfaction?). What really makes the difference, however, is the choice of the professional class to which we decide to belong, among the four available. We can be craftsmen, scholars, patrons or, quite unusually, thieves. The fundamental difference between the various classes lies in the tree of productive buildings that we will be able to choose and that will carry on our empire. Of course, depending on the chosen class, our professions will change, and so if we have the craft art in our hearts we will be able to become carpenters, or tailors, depending on the efforts we put into certain structures or businesses in raw materials rather than others. Scholars will instead aim, preferably, at careers as alchemists or will try the ecclesiastical one, while thieves... well, they will become professional criminals, founding their dynasty in blood and illegality. The choice of professional branch also influences the placement of a series of points, or talents that will influence our character's abilities. Clearly, if we want to be merchants, it will be better for us to spend points on charismatic skills, in order to develop our ability to bargain, and so on. Medieval Sims And it is at this point that the game really begins. Our character has been created, the scenario in which we have decided to insert it is ready and the time has come to lay the foundations of our dynasty. The interface can be managed entirely with a click, making the use of the game in all its functions rather immediate. The perspective of the camera is extremely free and allows us to range in practically every kind of view we prefer, depending on what we are doing, thanks also to a truly rather extensive zoom level. Our character is moved with a point and click system that would have been cumbersome if it hadn't been possible to select it even through its icon on the side of the screen. In fact, in the chaos of metropolitan life it may sometimes not be easy to recognize him immediately. And indeed there are problems when we have to look for other specific characters to interact with who, not being part of our family branch, cannot be selected via icon. In that case it is necessarily necessary to waste time in their search, once one has learned the places they frequent most and the route of movement they make between one location and another. Or we will have to go and retrieve it in the sub-screens of the friends/enemies/parties we have available. And in fact, having dealt with the section where we have to build our trade, the most important part of the game is precisely the one concerning relationships. How else would it otherwise be possible to found a dynasty? We must marry, and have heirs. To do this, Guild 2 uses a particular ~favor~ system, which will come in handy for both sentimental and political relationshipsand commercial. In fact, in addition to starting a family, we must never forget to take care of our business, and to do so we will need all sorts of facilities that are offered to us. By concessions, of course, we also mean bribes and sympathy. Fundamental also to earn us an official assignment, buy us a title, and so on. In the case of a suitor, we must admit that courtship is far from easy. We need to get it into our heads that providing ourselves with gifts to give is fundamental, but the choice of them also plays its role. But the biggest difficulty, which honestly we also found rather stressful, derives from the fact that the ~favor~ bar rises with a certain difficulty, and if we make a mistake among the available interactions with the chosen character (we can flatter him, seduce him, chat and try hugs and kisses, among other things) it drops drastically and the reaction of our good party will be, to say the least, unfriendly. But this would be the minimum, were it not for the fact that our suitors show a high degree of self-centeredness. Try to ignore them for longer than the blink of an eye and you will immediately find them complaining of lack of attention. And the favor will drop. In short, if you've played The Sims and got annoyed with friends calling to tell you they were tired of your indifference, your hair will stand on end here. Fortunately, once the courtship has been brought to fruition with a desired marriage (the most convenient possible, of course), the courted pedant will become part of our family, and we will be able to exploit him for the improvement of our empire, as well as to procreate the lineage that will guarantee us inheritance and therefore dynastic achievement. An economic empire And now we can get back to our business. Which perhaps we have neglected a little, in favor of the sentimental ones, even if they will also come in handy from an economic point of view. Leaving aside the relationship part of the game for a moment, let's now focus on the one that bears the characteristics of a management system. Our home, as well as commercial structures, can in fact be upgraded, by inserting new features that improve their performance or degree. Unfortunately, however, we also have to deal with wear and tear, and here we could find ourselves facing repair costs. We also have employees to hire, to go back and forth to the market or deal with raw materials. In short, it takes a lot of money. It will therefore be better to be very careful in the management of our resources, and to implement them with public offices will be appropriate, even if they themselves will cost us money, both to purchase the qualifications necessary for their achievement, and for any bribes that will guarantee us the favor of the council, in such a way as not to see us steal tasks and related salaries from other competitors. You will therefore understand that we are faced with a really rather complex game to manage, considering the different aspects that characterize it. Its hybridity, which blends RPG elements with strategic, management and life simulation elements, requires a really considerable amount of time to get used to it and be able to manage the game effectively. The artificial intelligence is really high and the interface is quite user-friendly, facilitating a task that would otherwise be very difficult. Final comment The Guild 2 promises to be certainly one of the most interesting titles of the season, of enormous completeness and very interesting facets. While missing the campaigns, the game is certainly long-lived. Unfortunately, however, the learning curve is quite high and without some patience and application you risk coming out with considerable frustration. Pros Very complex and complete The fusion of several genres allows great freedom of play Very long-lived, thanks to the variety of professions and game modes Great historical fidelity Cons Can be frustrating, especially for casual players Very high learning curve Sometimes confusing, difficult to immediately understand what to do A journey into the late Middle Ages The late Middle Ages is a historical period that brings to mind visions of rural poverty, bloody conflicts, noble governments and religious oligarchies, but also great commercial and artisanal ferment and a very strong thirst for exploration, which would have changed the world to give us the society that we today we know. The Guild 2 takes us to a gaming experience that revolves around all these elements, cornerstones of the beginning of a revolution that would later lead to the modern era. What is the role we will have in this slice of history? But natural.Faithful to the imperatives of the society of the time (and thinking about it not only of the medieval one) we will have to be successful, gain power, found a dynasty.", "date": "2006-10-11", "grade": null}