{"name": "Bleak Sword", "ref": "https://multiplayer.it/recensioni/bleak-sword-recensione.html", "text": "The Bleak Sword review clearly clarifies the peculiarities of an offer, that of Apple Arcade, which brings together very different productions on a single platform, combining games also developed for PCs and consoles with a certain amount of mobile games traditional. Bleak Sword falls into the latter category: we are talking about a very particular action RPG, designed for use on smartphones rather than tablets, strictly in portrait mode, in which we control a warrior grappling with a series of increasingly complex challenges. The graphic style of the title created by more8bit and produced by Devolver Digital is minimal, retro: it transforms characters and settings into small monochromatic dioramas, but with an emphasis on red and a polygonal nature that gives life and thickness to the huge pixels that make up the protagonist and his numerous enemies. The Bleak Sword campaign takes place within nine different settings, each divided into ten stages with increasing degrees of difficulty. However, this is not a hardcore experience as the first few minutes might suggest: at game over we are given the opportunity to repeat the last level and, in case of victory, recover the experience points and the objects we had unlocked. Therefore, you do not run into permanent death, the progression remains firm in its place and in the end it takes a couple of hours to complete everything. Gameplay and opponents Of course, among the peculiarities of Bleak Sword there is also and above all the combat system, based on original and interesting touch controls. There are two layouts available, with just an inch or two: the first solution unfortunately turns out to be limited, but the second manages to give satisfaction even though it often turns out to be less precise than one might have expected. It works like this: by moving your finger on the right side of the screen it is possible to move the character making him rotate, while touching the left side acts on the weapon, which can then be directed with the movement. In fact, explaining it is not very simple, but the short tutorial introduces us very well to these mechanisms and it doesn't take long to immerse ourselves in the philosophy and atmosphere of the game. In addition to the controls, another fundamental element of Bleak Sword is represented by the enemies, which they are really numerous and all have a different movement pattern, which must be memorized in order to be able to avoid their attacks and respond to the offensive. They range from skeletons to beasts, from undead knights with sword and shield to tentacles protruding from the water, passing through nine bosses who will give you a hard time. To face them we will also be able to count on an upgrade system that works on two fronts: on the one hand, the growth of the character obtained through level up, with the possibility of improving health, defense or attack; on the other the obtaining of objects which, once equipped, always provide a bonus in relation to health, defense or attack, or present themselves as consumables to be used when needed. The setting of the levels also changes, which in some cases see us riding a horse and in others grappling with lethal traps or fires both for us and for our opponents. The action is accompanied by a sound able to contribute to the fascinating atmospheres of the battles, very spot on, and from a minimal and retro graphic as mentioned, which brings into play stylistic solutions that are not absolutely original but certainly fresh, eager to experiment and able to say something.", "date": "2019-10-10", "grade": "8.0"}