{"name": "John Wick Hex", "ref": "https://multiplayer.it/recensioni/john-wick-hex-recensione.html", "text": "When a few months ago the tie-in dedicated to John Wick, or John Wick Hex, was officially announced, we immediately wondered what type of production was behind the development of this title that is the subject of our review. Published by Lionsgate itself, a film production company, the game is however developed on the strong will of Mike Bithell, known for being to all intents and purposes one of the fathers of the indie revolution. In fact, we owe that little pearl of Thomas Was Alone to him and his boundless love for the franchise in question led him to propose the idea for a game that retraced the exploits of the hitman, but all set in a moment before his retirement and therefore also to the fundamental figure who is the wife. After a quiet launch and a discount campaign on the Epic Store which placed it at a price similar to that of any beer, the John Wick game has attracted our attention a lot, also and above all for the genre it belongs to: the strategic . A John Wick story The game's campaign, divided into seven different settings and a substantially similar number of hours, puts us in the shoes of an even more silent, indeed mute, John Wick. Dutiful and intending to close an account of the past, the protagonist moves between the different areas that form the backdrop to the story, going from inside a warehouse to a snowy expanse, from Chinatown to a bank. Forget about an important story with strong motivations, as indeed the series has never accustomed us to, but it is interesting to see how even from this point of view the fidelity to the character and his world is almost obsessive. A John Wick who doesn't utter a word is contrasted by the characters of Winston and Charon, voiced by the same original actors of the series. This type of attention is also found in the structure of the story, with simple and short comic scenes that introduce the individual chapters and which are told precisely through the words of the antagonist Hex and his two hostages mentioned above. John is determined to save them and close the accounts with an unconventional assassin, tired of the strict rules that form the background to the universe they belong to. The gameplay: a ~timed~ strategy game Obviously no good tie-in is such if the gameplay is not interesting and fun. Although we often tend to subscribe to some design oversights in this genre, we are keen to judge what is an exponent of a particular but sought-after niche. In fact, strategists are experiencing a second golden age. Not so much for their excessive commercial success, but for a series of interesting and innovative titles. John Wick Hex starts from the basics, from the idea of a world limited to small maps characterized by an excellent level design, which use the different locations to play with geometries and obstacles of different workmanship and use. The view is classic on the fly bird, but you can approach it up to something close to an isometric, also highlighting a not indifferent aesthetic care. It is not possible to move freely on the maps, with a grid that manages our movements through a specific number of steps that we are allowed to take at each ~turn~. Already here, however, it is important to explain the most particular and original concept of the game. We talked about strategic without specifying whether in turns or in real time, and there is no doubt that the sensation and the result on the screen is a hybrid, but if you look closely, John Wick Hex takes place in real time, on a hypothetical timeline that is always visible in high on the screen and which visually reproduces all the movements of the protagonist and of the opponents in a given time. Every action we perform, from the single step to the knocking down of an enemy, passing through the throwing of a weapon, the shot or crouching behind a shelter, ~cost~ a specific amount of time ranging from tenths of seconds to go up to the very long two seconds needed to heal. These actions are obviously also carried out by the opponents and we soon realize how all the management of the gameplay is linked to this detail. Learning to read the speed of your movements and that of your opponents on the timeline is essential to mastering its mechanics. At the same time, even premeditation, understanding when to spend that tenth of a second to concentrate and recover energy for melee attacks or simply anticipating an opponent's blow by taking cover behind a column, are all elements that will make the difference between life and the death. The combinations aren't necessarily many, but the fidelity to the universe, the variety of settingsthe different approaches based on the number and type of opponents you are facing, make John Wick Hex a successful and fun title. There are those small details that make you turn up your nose, such as the total lack of progression in the gameplay. Everything that can be done in the first rooms useful for the tutorial then turns out to be all the mechanics that you will use for the rest of the experience and this is a detail that unfortunately tends to make itself felt over time. The only variables of the game will be the weapons and the types of opponents. In fact, we go from the simple unarmed henchman to the agents ready to hit us with a 9mm; to then move on to real armored thugs and slow but lethal shotgun-wielding opponents. Each of the weapons they drop will be usable at will, until the magazine runs out. No John Wick mission is complete without planning movements. For this reason, before starting a new chapter, divided into a certain amount of rooms, it is possible to spend the iconic Continental coins to acquire advantages or deposit weapons and bandages on the map. Therefore, by paying a good tailor it will be possible to have a suit adapted that will give us the possibility of having more concentration to spend or more life points, as well as improving our ability to hit from a distance or moving targets. Each of these upgrades will only last for the chapter in question and will cost a considerable amount of coins, leading you from time to time to choose carefully what to improve, making sure you leave some coins to deposit items around. However, it will not be possible to place objects everywhere, just as there will be rooms with low risk and cost and those that will require more coins. Once the mission has started, you will then have to go in search of the objects, which will have been hidden somewhere by the infiltrator we paid for the deposit. Even this system, however interesting, thrives on those sensations given by all the game. In fact, John Wick Hex seems like a title full of love for the reference work, but also extremely sketchy in the making. None of the mechanics manages to be so profound as to generate addiction, leading the player to not even want to try again with the aim of achieving a better score (present at the end of each location and based on different parameters). Approximation problem that can also and above all be read in the design of the bosses. At first glance these particular opponents are very strong but, in addition to being all similar, you soon realize that you can ~break~ them in an instant simply by getting close enough to knock them down, forever limiting their ability to counterattack. A real pity, perhaps dictated by a budget and a not excellent development time, but which would have required and deserved better treatment. Technique John Wick Hex is technically pleasing. Characterized by stylized drawings and poor in visual details, it does not spare itself in the animations and in the care of the reproduction of the protagonists and their movements. Those who know the character thoroughly will recognize many of the typical movements in this transposition. It is in this respect that the game gives its best, proving to be made by those who really loved the world created in the cinema. Obviously, even in this respect there are some problems, with interpenetrations and ragdolls of corpses that are sometimes almost hilarious, but nothing that can really affect the experience. This is at least until you run into those strange situations during which the game decides to magically crash , without giving any other solution than to open the menu and return to the main screen, losing the progress made in the specific room. Fortunately, this problem has arisen a very small number of times, but it is always good to point it out.", "date": "2019-10-08", "grade": "7.0"}