{"name": "Warsaw", "ref": "https://multiplayer.it/recensioni/warsaw-recensione.html", "text": "Warsaw doesn't do much to be what it claims to be, as we'll see throughout the review. The idea of the Polish developers of Pixelated Milk is fascinating: to tell the Warsaw uprising of 1944 through a video game, staging not only the military side, but also the organizational and human side. We are talking about a traumatic event in Polish history, one that left its mark on the entire nation due to its tragic conclusion. The story behind the action is therefore really simple to summarize: as a group of rioters, you have to be able to drive the German army out of the city. Management stage Warsaw is essentially a strategic game with role-playing elements divided into two macro sections: the managerial one, which plays in the rebel base of operations, and the tactical one, which sees us engaged on the battlefield. Let's go in order. The management phase closely resembles the shelter of This War of Mine, with a nice splash of XCOM: the rebel base is located inside a secret building, where various characters organize the different aspects of the revolt. We therefore have: the recruiter, who takes care of finding new rebels to add to the cause, some of them very young; the hospital nurse, useful for treating wounded soldiers; the inventory clerk, read the one who takes care of the inventory, who manages the black market and who repairs broken equipment; the archivist, who offers us a whole series of documents to read relating to the historical scenario; the priest, who records all the dead on the battlefield (in Warsaw the death of soldiers is permanent) and last but not least, the strategist, who allows us to select the next mission from a stylized map of Warsaw divided into districts , where the resources that are provided to us and the morale of the inhabitants of the area are also shown. The latter is a very important factor to take into consideration, because the higher the morale, the higher the support, while when it drops too much there is the risk of not receiving anything and seeing the relative neighborhood inexorably ending up in the hands of the Germans. It should also be noted that it is not possible to tackle all the missions offered from time to time, but you have to choose, which inevitably causes discontent. The system is very reminiscent of that of the aforementioned XCOM by Firaxis, given that the focus is all on not deteriorating relations with the various territories by trying to balance direct interventions: no one wants to feel abandoned in war. In any case, having chosen the mission and the soldiers who have to face it, all that remains is to take to the battlefield. Tactical phase The tactical phase of Warsaw is quite simple to explain: it takes place on a bird's eye view of the city map where we have to move through the streets in search of events, whether narrative or combat. Basically we guide the icon of our team by following arrows that indicate a potential target, be it a corpse to bury, an outpost to attack or an enemy team to ambush. Exploration has one big limit, probably placed in order not to let the player wander too much in what still remains a conflict scenario: the action points. We explain: each mission must be carried out no later than the exhaustion of the assigned action points, which are consumed by moving. In this way we certainly avoid wasting time and give more importance to what we have been ordered to do. As mentioned, there are various types of events. The narrative ones are very simple and usually require making very clear-cut choices: do I or not enter a building where I could be ambushed? Do I help or not a citizen with the risk of being surrounded by Nazis? And so on. The consequences obviously depend on the event itself and can be a fight, the discovery of loot (ammunition, weapons, medical kits and so on), the acquisition of a new companion and more. Other events are even simpler, such as the supply events, which basically serve to provide us with resources to continue fighting. Finally there are the actual fights, which begin when we are escorted or when we attack Nazi squads. Combat system The combat system is the most controversial part of Warsaw, as well as the most present in the gameplay. It is very reminiscent of some Japanese RPGs, albeit with more tactical nuances. We therefore have our group deployed on the battlefield facing enemy soldiers. Each member of what we can consider a real party has specific skills, chand they range from the way to use a certain weapon, to the specialization with certain equipment. There are also passive skills that give bonuses to ours and other active skills that give malus to opponents. The battle takes place in turns. Allies and enemies have a number of actions available equal to the number of soldiers deployed. The peculiarity of the Warsaw system lies in the possibility of having a single character perform several actions in the same turn, provided that he has an adequate number of stamina points available (three in total, with one that is recovered after each turn). Another interesting feature is the deployment of units on the battlefield, which takes place on a 2x8 grid. This is an element to be taken into strong consideration, because some techniques can be performed or not based on our positioning and that of the enemies. The impression of being in a kind of battle between disguised fantasy parties is really strong and honestly we would have preferred something perhaps less articulated, but more in line with the scenario. Also the fights are very slow and are often choked by the system itself. Facing a group of Nazis is interesting in the first few games, but then it becomes a bit of a bottleneck, as it takes many minutes to win (or lose) and the dynamics remain very similar from start to finish, with some absurdities little justifiable as bazooka shots that cause less damage than pistol shots or grenades that have very low effectiveness. In general, however, the biggest flaw is that it lacks the necessary drama, which the whole game lacks. Soldiers die without us caring much about their fate. Warsaw is collapsing, but there's nothing that really tells us how much. Choosing cartoon-style graphics doesn't improve the situation. There are some events that are striking, this is true, as is striking to line up kids against the Nazis, but in general the staging, to steal a theatrical expression, is really dull and detached, and the texts in the codex are not enough to give it the strength it needs. In short, the artistic direction is very little and the drama of war only begins to emerge a little in the final part of the campaign, when the dead have accumulated and the situation appears increasingly desperate. Also noteworthy is a certain repetitiveness of the gameplay, with the missions that all end up looking a bit alike and which, regardless of the objectives, are limited to being a treasure hunt / events before the action points expire. Too bad, because the scenario is interesting and some gameplay dynamics would also make you want to play again, if it weren't for all the problems listed that risk holding back even the most willing.", "date": "2019-10-02", "grade": "5.5"}