{"name": "Final Fantasy 15: War for Eos", "ref": "https://multiplayer.it/recensioni/final-fantasy-15-war-for-eos-recensione.html", "text": "While the world is waiting for the arrival of Final Fantasy 16, Square Enix has no intention of letting go of the previous chapter, which finds itself the protagonist of another mobile operation with rather dubious coherence, but with a probable positive commercial impact. There is very little romance in this review of Final Fantasy 15: War for Eos, because the production set up by the publisher is somewhat prosaic, in an evident attempt to still monetize the last remnants of the fifteenth chapter before the start of the new phase for the RPG series. To do this, Square Enix still relied on Machine Zone, despite the fact that the first attempt in this sense probably didn't go well in terms of quality, as demonstrated by the review of Final Fantasy XV: A New Empire. Evidently, from the point of view of revenue the plan worked well, considering that this new title is a direct sequel to that particular city builder management game, with some mobile RPG-style grafts. Practically the same team and the same project, although some evolutions are visible in this War for Eos compared to the first, incomplete attempt to unite a genre that is popular on mobile platforms with the universe created by Square Enix for Final Fantasy 15. In this case, the developers have also included RPG elements - strictly ~automated~ as the current trend dictates - and a sprinkling of gacha. The result is a mixture of somewhat forced trends, however we note at least the desire to build a story and delve into the world of reference, with characters outlined better and more in line with those seen in the main game. Considering that it is a mobile pastime that complements the classic Final Fantasy experience, these characteristics alone can push you to at least experiment with the game. Kingdom building and management Final Fantasy XV: War for Eos, some images from the various sections of the game After the devastating attack of the empire of Niflheim, the kingdom of Insomnia must be totally rebuilt, and this is where Noctis and his fellow adventurers come into play, together with an enterprising Lunafreya. The story of Final Fantasy XV: War for Eos is not quite comparable to those normally told in the main series, but still manages to give rhythm to the gaming experience by punctuating the phases with events and twists that can justify - as far as possible, despite of the fundamental forcings - new fights and the need to expand the kingdom, build and repair structures. The narration mainly takes place through constant dialogues between the characters, mostly represented with static screens: the texts, in Italian, are quite basic but can also give rise to interesting exchanges, for fans of the series. The gameplay focuses above all on the construction and management of the city and its structures and fortifications, in order to expand Insomnia's area of influence by recovering territories and making the kingdom prosper. This phase, in turn made up of different facets, is articulated like the classic management city builder for mobile platforms, with the need to ~tap~ on various points of the screen to collect resources and place new structures to build and upgrade. Each action is obviously accompanied by its inevitable progress bar, which triggers the usual mechanism of avoidable expectations possibly resorting to microtransactions, which emerge in practically every aspect of the game. This whole part of the game is basically the same as seen in Final Fantasy XV: A New Empire, but Machine Zone has decided to add some other new trends in the mobile market, with the addition of RPG mechanics and, while it was at it, some gacha cues too. Fights and characters Final Fantasy XV: War for Eos, more images from the various components of the gameplay The new part, compared to what we had seen in A New Empire, is represented by an increase in RPG-style characteristics, which are expressed in various phases of combat and in the classic management of the characters with progression of statistics and equipment. Also in this case, it seems that the MZ team has limited itself to taking the standard features of the genre in the mobile field and transferring them within the game: the missions take place in an almost totally automated way, with the possibility of activating by hand special abilities as the characters fight autonomously until the level is completed. Everything is part of the mechanism of constant progression that characterizes party management, which also includes the gacha system apowered by in-game currency that allows you to obtain new characters and more powerful equipment. From a technical point of view, Final Fantasy XV: War for Eos fully resumes the previous game in terms of management, with the classic city builder style from a mobile platform, while in the combat phases we switch to a third-person representation with a good construction of the 3D models of the characters. In principle, it continues to look like a rather anonymous mobile title on which the characters of Final Fantasy 15 have been stuck, but at least in this case there are some dialogues that can be interesting, as well as some unexpected insights into the relationships between the protagonists , especially regarding a more central Lunafreya than usual.", "date": "2023-02-23", "grade": "5.0"}