{"name": "Dragon Quest XI S: Echi di un'Era perduta - Edizione definitiva", "ref": "https://multiplayer.it/recensioni/dragon-quest-xi-s-echi-di-unera-perduta-edizione-definitiva-recensione.html", "text": "It's strange to find ourselves writing this review of Dragon Quest XI S, one year after its western release on PlayStation 4, two years after its Japanese launch alongside the Nintendo 3DS edition. Square Enix had promised a Switch version from the beginning but this one has struggled to materialize all this time, leading us to believe that, perhaps, we would never see it, that perhaps it could not be done. And instead, here we are, a few weeks after the release of a demo that dispelled any legitimate doubts about a difficult conversion but which could not express the true potential of this alleged definitive edition that Square Enix flaunts in the title. We replayed Dragon Quest XI with great pleasure - it couldn't be otherwise: it's one of the best Japanese RPGs of this generation, and beyond - and we discovered many small improvements, evident like the renewed orchestral soundtrack, less obvious like the possibility significantly speed up battles. And we played Dragon Quest XI in 2D, discovering the strengths and weaknesses of this much-hyped mode. But let's go in order and start over from the beginning... The Odyssey of the Lucente Dragon Quest has never been particularly famous for the stories it tells, but Yuji Horii this time has decided to adapt to more modern standards without betraying the fairytale and parodic spirit that has always distinguished the series. Thanks to the more dynamic shots in the cinematics, the excellent Italian adaptation of the dialogues and the implementation of dubbing, available in both English and Japanese, Dragon Quest XI maintains a rhythm that the series, up to now, had always dreamed of. . In the prologue, a woman saves her swaddling child by paying dearly for her courage, but the infant, found and adopted a bit like Moses, grows up and becomes our nameless protagonist. Upon reaching the age of majority, the young man discovers that he is the reincarnation of the Lucente, a legendary hero who manifests himself every time the Dark Lord threatens to invade the world. The problem is that many consider the Lucente a bringer of doom, so our hero will have to rely on a colorful band of adventurers. The script blends the new characters into the group organically, giving the player time to practice their fighting styles and repertoire of magic. One could criticize Akira Toriyama's not exactly very inspired character design, but its sobriety makes the protagonists much more captivating, also because Dragon Quest XI does not forget their existence, but rather explores their background, explaining their motivations and involving the player on a long journey full of surprises. It is no coincidence that the Definitive Edition for Switch puts its hand on the cast with a series of unpublished side missions, focused on individual members of the gang, which are unlocked in the second part of the game: in these additional missions, the player takes control of the various characters and some exceptional supporting actors who temporarily join them as they experience adventures never told before. The quintessential JRPG At this point, Dragon Quest should be a series sufficiently recognizable by anyone even in our country, where it has become particularly famous thanks to Dragon Quest VIII: in this sense, Square Enix has continued along that safe path, without risking strange experiments. The player controls the protagonist and explores the maps into which the world of Erdrea is divided: Dragon Quest XI is not an open world title, even if the vastness of the scenarios would suggest otherwise, and the zones are separated by rather short loads. Fortunately, you move quickly: the protagonist learns the Teleportation spell within a few hours, and you can also hold down a key to run automatically, even if the most savvy players will prefer to resort to mounts that can be called by ringing the appropriate bells or the unreleased Equine Whistle, new to Switch. Some enemies, once defeated, become mounts of their own and grant the player additional abilities such as the ability to fly over water and jump higher, thus reaching previously inaccessible platforms. While it's possible to tame mounts that weren't present in the PlayStation 4 version, there's still a lack of more elaborate exploration, perhaps a few more environmental puzzles, but Dragon Quest XI is actually a fairly easy title, at least until you get to it. he runs into some bosses or some really tough enemies. In those cases, the game encourages intelligent use of incanthems and techniques in the arsenal of the various characters. The player has a certain amount of control over their growth: each of them is linked to a sort of chessboard that allows you to consume the Skill Points earned at level ups to progress in different directions that represent the various skills: each new box unlocked allows you to access the surrounding ones in a kind of chain that requires a little planning. However, it is possible to reset the points spent at any time, even if you give up a small amount of money. This too is an advantage that distances Dragon Quest XI from the more frustrating aspects of its predecessors. In this regard, it is worth remembering that it is possible to tick a series of items, at the start of a new game, which allow you to customize the experience, for example by removing the possibility of fleeing from clashes or buying new items from merchants . The Definitive Edition for Switch adds a few tasty new options to the list that will allow players to artificially complicate their lives. In Dragon Quest XI, in fact, there is no real Game Over, given that the defeat of the party sends us directly back to the last save with the wallet halved. Despite this, Square Enix has implemented a novelty that significantly lightens everything, namely the camp. It is a safe area, located on each map, where players can completely regenerate life and magic points for free, but also converse with the group to discover new details about the story and save the game at the statue that takes the place of the traditional churches. At the camp it is also possible to use the celestial forge, a crafting system very similar to the one already implemented in Dragon Quest VIII and Dragon Quest IX. Once you have learned an alchemical formula - often hidden in libraries around the world - it is possible to manufacture the corresponding object through a nice mini-game: by completing the process with a minimum of attention, it is possible to get your hands on extremely effective weapons and protections without having to buy in shops. In the Switch version it is possible to access the celestial forge at any time, simply using it from the inventory: it is a visually inelegant solution, but very useful, since it allows us to manufacture an object after having found a material without having to go to the camp anymore Neighbor. The search for the rarest materials and hidden formulas pushes the player to explore every corner of the world which is anything but frustrating or boring as enemies pop up on the screen and get around with ease. It is also possible to attack them preemptively to start the fight with a small advantage: at that point, the game loads the party members into the canonical row that opposes the enemies. The possibility of choosing an alternative control system, which allows you to orient the camera at will and to move the characters on the battlefield, has no practical effect on the clash: it probably only serves to allow players greater freedom in the arrangement of the characters if they decide to share a photo. The combat system is simple and intuitive, particularly suitable for newcomers to the genre. You don't need great tactical minds and the enemies are so funny and well-animated that every battle is delightful. Perky powers are probably the most ~complex~ dynamic: when characters take a certain amount of damage, they temporarily become stronger and unlock a series of cinematic special attacks that they can execute together with their companions. The perky state lasts for several turns and doesn't necessarily expire at the end of a fight, so players can manipulate this power-up to take on bosses and solve more challenging side-quests. Some inhabitants of Erdrea, in fact, will entrust us with small tasks to be completed at any time to obtain objects, weapons or formulas in exchange. Dragon Quest XI is an extremely long-lived title. The main ~campaign~ alone, so to speak, lasts about fifty hours, to which we must add a substantial post game which, in reality, is not really optional, but a kind of second part of the story that leads to a grand finale still more satisfying. It is an intelligent and different solution that takes advantage of an ingenious narrative trick: if you love completing JRPGs 100%, Dragon Quest XI may be able to amaze you without ever getting bored. The Switch version Erdera is a mosaic of different cultures. Each city is inspired by some country of our world and one of them, Gondolia, in which the inhabitants speak a dialect that mixes English and Italian with hilarious results, is even reminiscent of Venice. As we have already said, however, the Switch version of Dragon Quest XI implements a dual audio option that will certainly make the purists of Japanese character design happy. It is one of the great novelties of this edition for the Nintendo console, even for the Japanese: in case you didn't know, the PlayStation 4 version had not been dubbed at home and Square Enix had taken much longer to localize it precisely to offer the Western public a English language dub. By proposing Dragon Quest XI on Switch, the Japanese software house has decided to go big, dubbing the game also in Japanese for the fans who had been burned in the Rising Sun. Speaking of burns, we can't help but grin thinking about the one that took Koichi Sugiyama, the historic and infamous composer of the series who has long held the Dragon Quest soundtracks hostage to sell CDs and concerts. Unlike the PlayStation 4 version, in which the music was simple midi, the Definitive Edition for Switch includes the soundtrack in a symphonic version and it is possible to switch from one to the other by selecting the appropriate option in the settings menu. Anyone who has played the PlayStation 4 version will immediately notice the leap in quality: although not all the music has been rearranged in an orchestral version, most finally do justice to the controversial musician's compositions. If in the PlayStation 4 version the sound sector was actually the weakest element of the package, now the parties have reversed. We have found that Dragon Quest XI is a feast for the ears, it remains to verify that the figure faces on the screen. We want to reiterate: this Switch Definitive Edition of Echoes of a Lost Age is half a miracle. And let's say half because unfortunately something was lost in the conversion process, but fortunately these are trifles that only players who have gutted the previous version will notice: those who can enjoy the title for the first time will not even notice it. It is clear that Square Enix had to sacrifice something, mostly in terms of definition and lighting: some shadows have disappeared, as well as more sophisticated flashes or reflections, thus lightening the load of a title that still returns a fluid and colorful world at thirty nearly constant frames. If the cartoon style makes up for these shortcomings, the lower definition is more evident which translates into a slightly dirtier image, especially in portable mode. It's nothing you can't face head on, mind you: Dragon Quest XI S remains a gem even in its dynamic resolution, an incredible JRPG to hold in the palm of your hand. The 2D mode We want to conclude our review of Dragon Quest XI S by dedicating a separate paragraph to the phantom 2D mode. Inspired by that of the Nintendo 3DS version, the 2D mode on Switch is not quite what we expected, let's put it that way. Originally conceived as a mirrored experience on the lower screen of the old Nintendo handheld, the 2D mode on Switch instead takes on two distinct identities. Chatting with the priests in the churches or interacting with the statues in the camps, we will be able to choose to switch to 2D mode, only that the transition is not as instantaneous as we thought: once the game is saved, we will be forced to start over one of the chapters of the story we have already completed. While maintaining the levels achieved or the objects collected in the meantime, we will still have to start over from that predefined point that we may have already passed and if we decide to return to 3D mode the same catch will occur. This strange solution practically forces the player to replay each chapter in 3D and in 2D. The procedure is cumbersome, not very intuitive and slowed down by the need to repeatedly save the game, which also generates a lot of confusion in the file screen. It's a shame, because the 2D mode reproduces the world of Erdrea in a delightful pixel art, the cities and the various characters, colorful sprites that count two cross animations but which transmit an adorable retro charm. In this mode, the fights become random as in the old Dragon Quests and the party becomes invisible: we will only see the inanimate sprites of the enemies and the modest effects of our spells. The poverty of the combat interface complicates life a lot: it is difficult to understand who is afflicted by some negative condition to be removed or who is perky. It is clear that this modal", "date": "2019-09-26", "grade": "9.2"}