{"name": "The Surge 2", "ref": "https://multiplayer.it/recensioni/the-surge-2-recensione.html", "text": "The review of The Surge 2 stands as proof of maturity for the Deck13 franchise: after the interesting debut two years ago, the German team aims to consolidate the brand with a rather ambitious new chapter, which leaves behind the old protagonist and the original setting to present us with a completely new scenario, Jericho City. A city made up of various districts, all manned by more or less armored mercenaries who have been ordered to keep the streets clear and to eliminate anyone exploring the area. But for what reason? It's hard to say: the character we control, created through a simple editor at the beginning of the game, miraculously survived a plane crash but there's something about that crash that still doesn't add up. Finding himself inside a prison under attack, he manages to free himself and sets out to find out what really happened. Succeeding in the enterprise will not be easy, however: the burning walls of the institute are teeming with criminals more than willing to kill us, opponents to be exploited to practice with a combat system that integrates and enriches that of the first episode. Initially armed only with two electric defibrillators, we will have to make our way up to the first MedBay and there, finally, equip ourselves with an enhanced exoskeleton. The connection to the machine, however, resets the situation of the enemies in the area and therefore confronts us with the same threats we had already faced, capable of killing us with only two or three well-aimed shots. A well-tested formula for this sub-genre of action RPGs, which however does not find support in the narrative, again uninspired and devoid of noteworthy cues. Gameplay If the level of the prison appears in some ways similar to some of the glimpses of the first The Surge, once you leave those walls you are confronted with an entire city, Jericho City in fact, equipped with areas interconnected via gravitational elevators, doors and gates to be opened as soon as you reach the other side of the obstacle. At that point a convenient shortcut to the nearest MedBay is created, and it is obviously not a case: the high degree of difficulty, which hits hard right from the start, necessarily lends itself to grinding practices that involve killing some opponents and returning to the base to save the position and store the metal scraps obtained, over and over again, until you can upgrade the character and spend a couple of points on improving one of its main characteristics : battery health, endurance and efficiency. The first two values have a very clear value, representing respectively the hit points and the stamina available for attacks and movements, while the battery regulates the use of cells that recharge when we inflict damage and which allow us to use injectables during the action, the first of which restores a portion of health and therefore arises as a fundamental element in the clashes. It is possible to parry, but often it is not convenient: it is better to memorize the numerous movement patterns of each soldier and understand when to make a lateral dash to avoid his lunge, then respond with the best combo in relation to equipment, resistance and nature same as the enemy. In short, it takes patience, especially at first and against some bosses: our shots inflict negligible damage, but exaggerating means exposing yourself dangerously to a counterattack and it takes very little to incur game over. What happens in that case? We will have two and a half minutes to return to the place of our death and recover the lost materials, on pain of their definitive disappearance. I have a mission for you The Surge 2 includes a fair number of side missions, which can be accessed by interacting with various NPCs present within the map. Most often these are simple fetch and delivery tasks, the completion of which allows you to obtain new blueprints and/or more powerful weapons. Optional quests remain active in the background until their conditions are met - a mechanism that integrates well with normal gameplay. Combat system, weapons and crafting One of the peculiarities of The Surge 2 lies in the possibility of grabbing a specific part of our opponent's body, whether it is a human being or a robot, and continuing to hit it until it becomes possible to perform a spectacular finisher: the protagonist cuts clean the enemy's head or stabs him and literally breaks him in two, to then collect on the ground not only the usual scraps but also possibly projects that will allow him to cobuild new equipment. Accessible via the usual MedBay, there are about ten sets and they present progressively different values in terms of defense but also of speed and impact on stamina: a fast and light build allows you to land more blows, provided of course that the selected weapon is the correct one; while a heavy and armored setup will see us catch our breath after just a couple of lunges. Don't worry: you will have plenty of time to think about which is the best choice for your personal approach between one game over and another. The interesting thing is that each component (helmet, chest and supports for arms and legs) can be upgraded and the crossing between different objects produces alternative movesets, significantly increasing the variety of this specific aspect of the gameplay: undoubtedly an improvement over to the first chapter, which from this point of view posed some annoying limits. Also present in this sequel are the implants, i.e. perks that improve certain elements of the character and which can be managed more freely as we make new upgrades . Finally, as regards the weapons, after the initial phases with the defibrillators, much more interesting instruments are accessed, which include large electrified rackets that alternate slow or fast blows depending on the combo, spears with devastating effects and equipped with a great , fast and lethal claws, appendages equipped with buzzsaws and more: not all objects appear very inspired, but the variety is all there. Enemies and drones Although not particularly inspired in terms of design, the enemies present in The Surge 2 are numerous and equipped with varied attack patterns, with at least two or three choreographies for a single opponent. In short, to defeat them you need to get to know them, try to separate them if possible in order to give life to one-on-one duels instead of ending up in an inconvenient numerical inferiority. In fact, it happens to come across heavily armored agents, or ninjas, who also have rifles: while we fight one, the other can target us from a distance. Considering the aforementioned incidence of every single blow suffered on our health, it is clear that this eventuality turns into something very dangerous, causing tension to reach a thousand especially when we have bags full of loot and the only thing we would like to achieve quickly a medical post to be able to upgrade. There is a certain progression in the way enemies present themselves, by number and type: it is an aspect of the experience that the developers have studied well and which naturally culminates with the boss fights. Equipped with the inevitable calendar, we found ourselves having to repeat some of them even a dozen times, however discovering that the chronological location does not necessarily correspond to the degree of challenge: the sprawling robot that can be seen in the main artwork of The Surge made us sweat much more than a couple of subsequent bosses, usually those with a simple human form. In such situations, the use of drones can in fact be of great help, which have very limited ammunition but can also shoot electric darts capable of momentarily stunning the target and allowing us to sink a few shots before returning to a safe distance. The combination of all these strategies draws a picture that we have found solid, net of some situations that would have needed further refinement. Playstation 4 trophies The 48 Trophies of The Surge 2 are obtained by proceeding linearly within the campaign and by defeating the various bosses, but there are achievements related to side quests and particular situations, as well as obtaining weapons, upgrades and equipment. Scenarios and technical implementation The transition to a more airy setting, which should have represented a substantial step forward compared to the first chapter, unfortunately did not meet our expectations. Thanks to a mediocre technical realization, which suffers due to an inexplicable downgrade compared to the original The Surge in all respects, we find ourselves visiting very generic places, with objects placed in bulk and an intolerable quantity of obstacles to delimit the areas that can be visited. It is not an open world that we will be able to explore in the game, but the traditional set of interconnected levels: watertight compartments to be crossed without particular enthusiasm or suggestive glimpses, in a mix of assets and solutions that appear very dated. There is undoubtedly an underlying variety, in the sense that many areas appear well characterized and recognizable, but in the end it is a simple numerical question: the mapit turns a lot and its dimensions are limited. From the options screen it is possible to select two different modes, quality and performance: the first offers a much better glance in terms of antialiasing and seems to have more sophisticated effects on surfaces, but the price to pay is too high: the sensation of fluidity is poor and reactivity is lost in fights. We must therefore fall back on the 60 frames per second of the second option, which however bring with them a further decay of the graphics, very visible jaggedness on the objects and an annoying slowness in the streaming of the textures. The sound sector includes dialogues in English (subtitled in Italian) which did not impress us with depth or interpretation, but a good job has been done on the audio design front.", "date": "2019-09-24", "grade": "7.5"}