{"name": "Contra: Rogue Corps", "ref": "https://multiplayer.it/recensioni/contra-rogue-corps-recensione.html", "text": "As we are going to explain in our review, Contra: Rogue Corps distorts what are the typical characteristics of the saga. Konami's franchise, born on the NES in the late 1980s, offered a horizontally scrolling run'n gun structure in which the player had to fight his way through fierce armies of enemies in the role of an unlikely super soldier. Chronologically placed after the events of Contra III: The Alien Wars, Rogue Corps has once again been entrusted to the care of the historical director and producer of the series, Nobuya Nakazato. Nonetheless, this new iteration operates a clear trend reversal with respect to the typical canons of the brand. In other words Konami wanted to try to relaunch one of its historical intellectual properties, reworking its interactive approach in a rather transversal way. Clearly the shooter component continues to be at the center of the offer, but the classic scrolling structure has been replaced by a playful approach that draws liberally from the twin stick shooters. Story mode and selectable characters Contra: Rogue Corps is set in 2638, two years after the conclusion of the Alien Wars. However, the bloody conflict between humans and aliens seems far from over: right in the place where the decisive battle raged, a new area called the Damned City has arisen, and it is precisely in these territories that they are called to intervene. the resolute Rogue Corps. It is therefore up to the player to clean up the areas infested by the alien threat, choosing one of the four protagonists that can be used in the game. Each of them has distinctive characteristics; starting with Kaiser, an Alien Wars soldier who in spite of himself had to undergo a multitude of interventions and cybernetic grafts to return to the battlefield to the sound of machine guns and guided missiles. Then there is Ms. Harakiri, who in addition to being the fastest of the formation can use a lethal laser rifle and a bizarre chainsaw useful for slicing enemies at short range. Gentleman uses the same laser and a practical flamethrower, while BV (Beast Feroce) is a massive panda that combines the traditional rifle with the use of a particular auger. The fifth element of the formation is Aero Captain, who in addition to acting as a narrator in the short introductory film, offers his support during the missions. The selection of each fighter can be made after having accessed the Base Camp, a small central hub that gives access to all the activities made available by the game. At first you can only play the first two assignments of the Campaign, while the next ones will be unlocked with the completion of the individual operations. After accessing Grade 2, Exploratory Missions are activated, where essentially the only objective involves collecting objects and surviving very dense hordes of enemies in order to make their way towards the exit while obtaining additional loot with the which to improve the equipment. Gameplay Unlike the tradition of the series, Contra: Rogue Corps offers a structure clearly borrowed from the formula of other titles such as Alienation and Housmarque's Dead Nation. With one lever the movements of the protagonist are managed, while with the other the direction of the blows can be imparted by rotating the weapon 360 degrees. The high quantity of enemies present in each portion of the map makes it necessary to move continuously on the field, sometimes relying on the spin jump and above all on the dodge, essential for regrouping and momentarily distancing yourself from the enemy, but also for making your way through the crowd stunning as many as possible without taking massive damage. The traditional attacks must be dosed taking into account the overheating of the weapons, however, if necessary, it is also possible to draw on some special actions which can prove to be fundamental for removing chestnuts from the fire. Pressing one of the back buttons activates an enhanced barrage of shots for a short time that varies depending on the protagonist you are playing. When the situation starts to get particularly hot, you can instead rely on the smart bomb, which by starting a predefined and customized animation allows you to score a considerable amount of damage in the entire surrounding area. The control system of Contra: Rogue Corps therefore draws direct inspiration from the aforementioned titles, while failing to give the same feeling in terms of quality once you take the pad in your hands. The combat system is overall sufficiently responsive to input given,while we found an excessive woodiness of the sporadic platform phases in which you have to rely on the rotating jump. Instead, we found the choice to implement the free aiming mode, inspired by the original episodes of the saga, very little apt, which in our opinion does not adapt at all to the new structure chosen for this chapter. Other critical issues concern the shot management system: the panoramic view often changes perspective in relation to the portion of the level in which you are located, with the result of often taking the character out of context with respect to the actual position of the enemies to be killed. A feature that evidently limits one's approach in the field, sometimes forcing one to maintain the position by going a bit by heart, or vice versa to fall back in the direction of the enemies to have a more favorable view, with the risk of compromising the effectiveness of one's incursion. Not too convincing even the bosses to face at the end of each level, undermined by an anonymous design and above all characterized by trivial and easily framed attack patterns on the first attempt. Powerups, multiplayer and graphics If on an interactive level Contra: Rogue Corps undeniably lends itself to obvious and sometimes gross defects, a point in favor of Konami's title is undoubtedly linked to the presence of selectable upgrades both for weapons and for the abilities available to each character . By accessing the Armory, it is possible to obtain new tools of the trade or to enhance those already at one's disposal, making use of a vast plethora of materials forfeited from the loot collected in battle. This is accompanied by the Operating Room, in which the fighters can rely on the care of not too recommendable surgeons, in order to obtain enhancements for four different areas of the body. Even in these situations, the materials to be used derive from the loot or alternatively from the purchase of additional resources on the black market, using the credits accumulated thanks to the completion of the assignments. design and variety of internships. The maps are devoid of interesting ideas and graphically an unacceptable technical backwardness is revealed when compared to the standards imposed by the current market. The audio sector is also weak: the highly over the top atmosphere of the game would undoubtedly have deserved a more suitable sound accompaniment to guarantee the rhythm and enjoyment of the action. If nothing else, the game structure is supported by the presence of a multiplayer mode that embraces both the cooperative side and the PvP. Taking part in the frenetic action in the company of one or more friends can have its why, even if we struggle to understand the sense of having limited participation in group PvE matches to Exploration missions only and not to the story in its entirety. During our test we didn't have the opportunity to test the online side, since the servers will only open when the game debuts on the market. We also point out that in these situations you can take part in the so-called Carnage League, which offers clashes of up to a maximum of eight participants (4 against 4). In this mode, the two opposing formations are charged with shooting the alien balls until they roll into the opposing goal and the team that scores the most points wins. Alternatively, you have access to Fury mode, where the formation that manages to defeat the greatest number of opposing demons prevails. In both cases, the ranked matches will then affect the global level associated with your user profile.", "date": "2019-09-23", "grade": "6.0"}