{"name": "Blasphemous", "ref": "https://multiplayer.it/recensioni/blasphemous-recensione.html", "text": "~Who in their right mind could deny that the 20th century was entirely mine?~ With these words a splendid Al Pacino interprets Satan in the ~Devil's Advocate~, a film which among other things sees Keanu Revees as the protagonist who has just recently become a darling of the videogame world. And if it is true that denying this statement is at least risky, it is also true that the review of Blasphemous, the second work of the Spanish The Game Kitchen, in hindsight turns out to be something profoundly different from a gratuitous and out of place attack on the most important religion in the world in terms of numbers. To be honest, when we approached Blasphemous, which has been talked about for years thanks to a kickstarter campaign that went very well, we hoped to be faced with this very title, at least on a narrative level. History is made of miracles Let's start by saying that Blasphemous is an atypical metroidvania. For those like myself who devour the genre, it will even be difficult to find some of the main stylistic features in terms of progression. This does not exclude that the level design structure, the discovery of secret areas and the growth of the character make it a title that can be included in this genre. On the other hand, a setting will act as the glue for the whole adventure and a background of the world so well cared for and detailed, as to leave you amazed. The desire of the Spanish boys to stuff every single setting, enemy, object and collectible with references to a religion as much followed as it is controversial, represents the business card of a textbook study, which has little to do with blasphemy, but which aims more to the suggestion and criticism of religious extremism. This way of narrating is so instilled in the undergrowth of the universe to which it belongs, as to be probably the best derivative of a souls-like. We realize that this term is now the most abused of the last decade, but it's difficult to play Blasphemous and not notice a series of profound similarities. As mentioned, this applies above all to the narrative sphere and it is there that the work gathers the greatest acclaim. The story it tells starts from the desire to put on the plate the tragedy and the radical considerations of a religion very far from the same precepts it imposes. It is no coincidence that our research, as part of the brotherhood of silent lamentations, is to bring order to a world devastated by famine, and invaded by creatures resulting from the ~First Miracle~, performed by the Supreme Pontiff. The certainty on the part of some high levels of the clergy, that suffering and affliction were the only way to penance, have indeed generated the real ruin of the world, with no way out. The way in which the people now victims of a time that is wearing them down, but who still hope in those same precepts that reduced them to hunger and disease, are told, is so reminiscent of the period of the Spanish Inquisition, as to be able to put together history and fantasy. All this is enhanced by an obsessive aesthetic care, which leaves nothing to chance and which designs extraordinary settings with the help of a clean and understandable pixel art. This is a significant detail for an artistic method almost abused in recent years but which finds a further pivotal point in the many places of Blasphemous. The same goes for the sprites and animations of the protagonist and supporting characters, as well as enemies and bosses, which reach peaks of inspiration that are difficult to find in projects of the same production scope. Everything in Blasphemous is narratively and visually captivating, capable of captivating and pushing towards the next discovery. And if you're obsessive enough to read and analyze every story and description included in the game, moreover beautifully adapted in Italian, you can only be surprised by the project. Gameplay: some painful keys As mentioned Blasphemous is an atypical metroidvania. Divided into macro zones, all connected on a map that can be freely analysed, it will be able to easily take you about fifteen hours for a first pass, without even being too careful to check and analyze everything thoroughly. It is a title that has more content than you might think, but which unfortunately does not differentiate them enough, ending up facing a lack of progression in the gameplay which is the worst that can happen to a title belonging to this genre. The cryptic desire to keep the plot and its implications smoky has repercussions on a gameplay trend that is also too fragmented, made up of very few upgrades, none of which are essential for the continuationof the trip. A series of RPG elements are not enough to solve this problem. Having a single sword, the Mea Culpa, does not automatically translate into a problem as the only means of death, but rather a series of implementations that change little or nothing the experience as a whole. It is possible to equip the so-called grains of Rosario, which are nothing more than simple perks that modify the most varied abilities of your alter ego, from the possibility of seeing the health bar of each individual enemy, up to having greater resistance to elemental damage available. To these are added the relics, real artifacts that represent as much as possible the concept of skills dear to the metroidvania. Too bad that these are too few and too little incisive. We then move on to the skills and hearts of Mea Culpa: the first are divided into levels and are managed like a classic talent tree to be unlocked as you progress, provided you have found the altars necessary to level up the sword. The latter are instead specific objects to be set on the hilt of the weapon (one at a time) and which modify the use of the same. Prayers close the circle: comparable to magic and for this reason able to consume fervor, an indicator underlying health that can be increased permanently by finding specific hidden places on the map. What makes this trend frustrating is a disarming slowness in backtracking, which thrives on a few areas that are easily reachable with quick trips and above all never sees the speeding up of the protagonist's progress, with the consequent impossibility of making wandering around the city easy and painless. map. Same problem that occurs with regard to platforming, often inaccurate or too punitive, leading to death more than any other enemy. Obviously, the use of pads such as joycons does not help in this, but there remains a strange and unjustified lack of care, considering the painstaking care placed in the hitboxes. The parry, the slide and the slashing are in fact masterful and return a feedback that is difficult to find in other titles of the genre. Fortunately, death is not as punitive as that of any souls-like. Although the game is based on the recovery of a resource, tears, attributable to the souls of the From Software series, at the same time the departure does not lead to the loss of these, as much as the decrease in the quantity that can be accumulated, as well as the total fervour, at least until the ~fault~ left on the battlefield is recovered. We close this discussion by talking about the bosses, an abundant dozen, which in our opinion are emblematic for understanding Blasphemous as a whole. Some of them prove to be balanced, interesting and masterfully crafted from an aesthetic point of view. Instead, all the others are divided between a total lack of challenge, and a frustration generated by problems in the timing of the attack and response to commands, which often lead to not being able to get up in time and thus being forced to take several shots in sequence without no logical reason. The Switch version We also had the opportunity to test the PC version, albeit briefly, thus giving us an idea of how well-optimized this port was on the Nintendo flagship. Despite a series of not exactly exciting titles in the past period, Blasphemous lives a diametrically opposite fate, with an adequate technical level and which only presents the classic patina phenomenon and some micro slowdowns in the dock version. Nothing to say instead for use in portable mode, always bearing in mind the ergonomic limitations of a pad not really designed for a game of this type.", "date": "2019-09-17", "grade": "7.2"}