{"name": "Final Fantasy XIV: Shadowbringers", "ref": "https://multiplayer.it/recensioni/final-fantasy-xiv-shadowbringers-recensione.html", "text": "Someone is probably wondering why it took us so long to publish the review of Final Fantasy XIV: Shadowbringers, the third expansion of the MMORPG Square Enix which has been out for a couple of months now. Make yourself comfortable, because it's an interesting story. We have carefully followed the evolution of Final Fantasy XIV but, alas, we stopped at the first update of the excellent Heavensward expansion, two or three years ago. Time is running out, there are so many more games to follow and everything in between, you know. Later, when the second expansion, Stormblood, came out, Square Enix didn't send us any code to cover the event, and so we gave up going back to Eorzea again. So, when we instead received the Shadowbringers code to download and play the new expansion at launch, we found ourselves having to complete the Heavensward campaign - also known as the Main Scenario Quest - which we had left pending, then that of Stormblood and finally the transition missions between the second and third expansions. We are talking about over two hundred missions including cinematics, long dialogues, movements, dungeons and fights. Those who play Final Fantasy XIV know that the campaign works a little differently than in MMOs like World of Warcraft: you can't venture into new areas and unlock the features of an expansion without getting there by following the storyline. Fortunately, Square Enix has provided us with a couple of codes - usually paid services for ordinary players - to ~skip~ the expansion campaigns and immediately start Shadowbringers with a level 70 Job. Only we didn't use those codes. Why should we ruin the best part of Final Fantasy XIV, and that is the story? So we took it easy, tackled the remaining campaigns and for good measure also completed all the optional raids that Square Enix has released over time. We liked Final Fantasy XIV so much, an MMORPG that certainly had its ups and downs, but which fascinated us like a true traditional Final Fantasy. And it is with this in mind that we finally started Shadowbringers. The story upside down Our ride to the new expansion was like a roller coaster ride. Tiring climbs, exciting descents, moments of calm, twists and turns and a few curses. Natsuko Ishikawa's script bends to the rhythms of an MMORPG, a genre that by its very nature must necessarily squeeze the players in its grip and dilute the contents over time, since that time is paid for with a monthly subscription. Ishikawa, however, took advantage of this expansion to fill in detail one of the most detailed online worlds in which we have had the pleasure of living a virtual life. Shadowbringers, in this sense, represents the climax of a chess game that lasted years in which Yoshida and his characters characterized supporting actors and antagonists, told myths and legends, sowed clues and cited the mythology of the Final Fantasy franchise as much as I could. So when we faced Zenos yae Galvus in a duel, it seemed that the end had come for the Garlemald empire, when instead a completely different battle was about to begin. Indeed, Shadowbringers does not take place in the world we have come to know, but in another ~reflection~ of Hydaelyn, a parallel dimension commonly called the First. It is from this realm that the Warriors of Darkness that we faced between Heavensward and Stormblood came from: in fact, we discover that a century before our arrival, the five warriors defeated the forces of evil with the help of the Ascians, but in doing so they caused an imbalance in the natural order of things, so that the world is now immersed in perpetual day and night never falls again. With the help of the Scions who arrived in the First before us, we will discover that we have to take on the reverse role of Warriors of Darkness: our task will be to track down and defeat the monstrous Sin-Eaters that dominate the Norvrandt region, so as to restore the day/night cycle and put an end to the dominion of light before it even invades our dimension of origin. This is, of course, a rather unusual perspective, although only the definitions are ambiguous. The word to the characters What distinguishes Final Fantasy XIV from practically every other MMORPG still on the market is the incredible attention paid to the secondary characters. Our alter ego is predestined, the hero or heroine that everyone looks up to with admiration, a stereotyped and uninteresting figure: the real protagonists, in fact, are all our supporting actors, and our adventures are a reflection of those what vThey come together with us. Over the course of four campaigns, Final Fantasy XIV establishes an indissoluble bond that in Shadowbringers finally explodes in its fullness: the new Main Scenario Quest is a story of redemption and discovery, but it's not just ours. Ardbert, the character who appears in all the introductory cinematics and who represents the player, finally assumes a real identity, representing the Warrior of Light who has failed and who can now only observe the Warrior of Darkness as he saves his world . It is a brilliant metanarrative that involves and moves. The talented Ishikawa, however, does not limit herself to deepening our travel companions - especially Alisaie and Alphinaud, with an eye to the tormented Thancred - but also our rivals. Brief cinematics inform us of what is happening in the source world as we fight for the First and give an eerie preview of the threats we will face in the future. And we can only watch helplessly, followed by Emet-Selch, the sarcastic patriarch of the Ascians that Ishikawa characterized so well as to transform him into one of our favorite villains in the whole saga. Part Kefka, part Ardyn, Emet-Selch is no mere megalomaniac, but a tragic figure who constantly questions our beliefs about the distinction between good and evil, light and dark. Shadowbringers is something more than a simple expansion: net of some slightly slower passages, especially in the central phase of the campaign, the story of Ishikawa and Yoshida not only reconfirms the quality of Final Fantasy XIV in terms of narrative, but places easily the MMORPG Square among the best chapters in the thirty-year franchise. From one dungeon to another We were pleasantly impressed by the Trust System which allows players to tackle normal (also called Duty) dungeons together with a team of AI-controlled sidekicks. This ploy prevents damage dealers from suffering exhausting waiting times - even if we, playing Samurai, almost never waited ten minutes in dungeons anymore - and allows you to immediately face each new challenge in the company of the various Scions. The story initially imposes our companions on us and, as in a real JRPG, it is not afraid to change the team during the Main Scenario Quest, adapting it to the developments of the script. In dungeons our artificial companions perform better than human players: Square Enix's scripts are practically infallible, although it takes a little longer to complete the tasks since NPCs inflict significantly less damage than real players. We hope that Yoshida decides to implement the system also in dungeons prior to the expansion. We liked the new dungeons, sensibly proposed in the story, following long chains of quests. Square Enix has actually nailed the ideal formula for the type of MMORPG they're supporting, where even the dungeons tell a story and the enemies are pure cannon fodder. The structure of these instanced maps is fundamentally linear, but everything is spectacularized to the maximum power and there are dungeons that leave you speechless thanks to a coherent and refined artistic direction. Similarly, we were surprised by the intuitiveness of the various bosses, all focused mainly on the mechanism of the telegraph; a moment before the boss launches a certain attack, a certain visual suggestion appears on the screen and the player, interpreting it, must react accordingly. While this is a well-established mechanic, Yoshida's game designers managed to design elaborate encounters that keep players on their toes, forcing them to constantly move around the battlefield. Once we'd completed the campaign and tackled each dungeon, we also tested max-level encounters in the expansion's first eight-player raid, Eden, and Extreme versions of the two Trial bosses we've faced throughout the story, Titania and Innocence. If the latter are the usual enhanced versions of the same bosses - same mechanics, only more demanding - Eden is instead a raid made up of four distinct encounters that follow the fights with the Primals in the first installment of A Realm Reborn, only in a bizarre variant: Leviathan has two heads, Titan transforms into a jeep (!) and so on. Intuitive and full of mechanics, these encounters perhaps sin in length, given that the bosses are real sponges, and in the repetitiveness of an endgame for which Final Fantasy XIV still does not shine: it is essentially reduced to repeating the Duty and theTrial to accumulate currencies and key items to exchange for new weapons, armor or accessories. Gain experience in the First In the leveling phase we focused on a single Job due to time constraints and so we raised a Samurai up to level 80, occasionally playing the two new Jobs that Square Enix introduced with Shadowbringers: the Dancer and the Gunbreaker. The first is a rather particular ranged damage dealer who plays in synergy with group mates but who didn't convince us very much, perhaps because we have always associated the idea of the Dancer with a support role and this pseudo-caster only seemed to us a way to squeeze yet another damage dealer into a roster that is already overflowing with melee and ranged damage-oriented classes. The Gunbreaker is instead a very interesting tank, especially because you learn to play it in a very short time and you have the feeling of controlling the battlefield without resorting to distinctly defensive skills: a force of nature, this Job is clearly inspired by Final Fantasy VIII and to the protagonist Squall Leonhart who, in fact, wielded a Gunblade. As we have said, the growth of our character during the expansion is articulated in the usual way and the player can alternate the missions of the Main Scenario Quest and the optional assignments to the evergreen Duty Roulette or other activities that give experience points. In this way, it is possible to keep some optional assignments which we can then complete with another Job, in case we decide to raise it: in that case, we would discover that Square Enix has made various changes to the mechanics of the various Jobs, albeit not always very successful. There is also a certain rigidity in the combat system which depends above all on the still too high global cooldown and perhaps a more relaxed vision of the rhythm in the fighting. Be that as it may, exploring the First was a pleasure. Yoshida and his team have certainly capitalized on the criticisms received in recent years and have managed to outline a much more organic progression that leads us to explore each map in an orderly manner, without forcing us to go on long and tedious trips around the world to close completed missions or find the Aether Currents that unlock flight in the new maps: it is usually the Main Scenario Quest that takes you near the various Currents, not to mention that some are obtained by completing certain very fast optional tasks. Most of the optional missions help us to get to know this bizarre world and its inhabitants better, but more often they are fetch quests of little importance, at a narrative level, which however engage the player with unnecessarily long-winded dialogues. A better world That Shadowbringers is an ambitious expansion is clear as soon as you set foot in the Crystarium, the new headquarters of the players in the world of the First, an agglomeration above which stands the Crystal Tower. However, the Crystarium is not even the endgame hub of this expansion: it is the sumptuous city of Eulmore, once freed at the end of the campaign, that centralizes the players with its sellers of maximum level equipment. Virtually every map reserves majestic surprises beyond the initial glance. The misty hills of Il Mheg hide a bucolic panorama that seems to come out of a fairy tale of European origin, and in fact Titania and her fairies reign over this region, while the forests of Rak'tika envelop in their coils a dangerous undergrowth and a lake that it holds, in its depths, the remains of a mysterious past. These maps are bound to change as the story progresses, sometimes irreversibly. Although the engine is still the same, with its pros and cons, Shadowbringers appeared visually improved. Perhaps it is due to the meticulous attention to detail that distinguishes each panorama, each polygonal model and each kinematics, given that the engine is always the same and the most attentive eyes cannot help but notice a certain age by now, although the direction and programmer tricks try to hide it whenever possible. Yoshida has tried to impose a totalizing flavor on his latest expansion, calling on none other than Tetsuya Nomura to collaborate, who found the time to get his hands on the character design linked to Eden, and the creators of NieR: Automata, Yoko Taro and Yosuke Saito , who are working on the next twenty-four player raid. However, if there is something that has accompanied us for all these hours - ever since we put our hands on Heavensward, actually - it is the extraordinary soundtrack by Masayoshi Soken. There's nothing to be done: the Japanese composer manages to channel an energy", "date": "2019-09-15", "grade": "9.0"}