{"name": "Torchlight 2", "ref": "https://multiplayer.it/recensioni/torchlight-2-recensione-console.html", "text": "When Torchlight hit the market in 2009 we still had the memory of Diablo II as the great ARPG phenomenon. The title developed by Runic Games then received a direct sequel which, after seven years, finally arrives on consoles. Our review of Torchlight 2 starts right here, or rather from the awareness of the past. We played it again, testing the joys and pains of a conversion that bases the command mapping work on the good things already done with other exponents of the genre. Waiting to be able to get your hands on the next episode of the series, Frontiers, what better way than to go back to spending hundreds of hours alone or in company. A useless story The narrative pretext of Torchlight 2 is absolutely forgettable. It must be said that the whole sector relating to the plot and its staging does not in the least represent the target user of the game in question. For the record, know that Torchlight 2 restarts more or less where the first one ended, with the mission of the new protagonist who will prove to be that of hunting down and defeating a previous hero now corrupted by the Ember: a mineral capable of giving great Magic powers. Nothing transcendental, but on the other hand, a great narrative depth is not expected from a title like this. Over the course of the four acts necessary to close the campaign, we will be able to get to know and complete missions for a myriad of NPCs that fill the game world, all while we delve into the maze of outdoor maps and dungeons with a classic but successful. The fact that narratively the game does not rise in the hyperspace of authorship does not however exclude an in-depth study of the game's lore which is not indifferent. Listening, reading and observing are three important elements for any self-respecting RPG and Torchlight 2 is no different. Still fresh gameplay Like all good exponents of the hack 'n' slash genre, starting a new game also means choosing one of the four available classes. Whether you lean more towards the warrior or the magician, the choice made at the beginning is less convincing than you want to believe. When you've finished creating your own character, even aesthetically, it's time to take to the battlefield and Torchlight 2 takes you just a few seconds before throwing yourself into the fray. The first tasks to be carried out, as often happens, are simple in nature and easy to complete, useful for becoming familiar with the basics of the gameplay and taking you to the first real city available. From here on, the typical progression unfolds which is divided between killing hundreds of enemies, exploring the maps generated by the game and collecting the loot. While performing these actions, the classic experience is recovered which leads to leveling up and, precisely the management of growth, gives the game a particularity different from most of its illustrious colleagues. There are three skill trees and each of these allows you to acquire active and passive skills. Spending five points on the same skill involves an increase in rank and quality of the skill itself, up to a maximum of fifteen upgrades each. It is not necessary to choose a specific path but you will be free to decide which of the unlocked skills to spend your points on, thus allowing you to create combinations in extremely varied builds. This freedom in shaping one's character was also somehow revised in the subsequent Path of Exile (for many the best ARPG on the market, as well as free to play) albeit declined in a different way, through a growth similar to that of the Final Fantasy spherography X. Returning to Torchlight 2 and the activities present in the game, it is impossible to encapsulate in one piece the myriad of contents that the game of the now defunct Runic Games presents. In addition to the campaign, the dimensional gaps that can be found while exploring the maps, the increase in difficulty up to the impassable limit of permadeath and the opportunity to take each character up to level 100, the excellent multiplayer component also joins of Torchlight 2, through which six friends can work together, without compromising their loot. In fact, the game remodels the difficulty and the response of the enemies based on the number of users connected simultaneously, avoiding however dividing the rewards, pushing even more on cooperation. The console port We have had the opportunity to test the game on PayStation 4 Pro, an element that could somehow modify the technical performance on other platforms, but we are still talking about a title which, already at its original releasenal, was not very demanding from the point of view of performance. In fact, if the artistic aspect can attract or not, it is impossible to deny the qualities, as well as the variety of models for enemies and for the trillions of cosmetic and equipment elements, the fact remains that Torchlight 2 runs very well in this new guise on console. The framerate is granite, an important element to give fluidity to a game that requires it by its very definition. The question of command mapping is different, obviously the same for each new platform and which has seen the team commit to rethinking the interface already present on pc. Where before there was a classic bottom bar, which showed life and magic points accompanied by all active skills, now these elements have been moved to the lower left corner of the screen and relocated within a circular ring. Each quick use slot (obviously customizable in the inventory) is associated with a pad button, either front or back. This choice is optimal, although it requires a few tens of minutes to be fully digested by those accustomed to this kind of PC game. Indeed, it is difficult to think of being able to do better from this point of view, despite the fact that sometimes it happens that you do not have the right answer from your alter ego when you decide to attack standing still on the spot or vice versa.", "date": "2019-09-06", "grade": "8.5"}