{"name": "Hunt: Showdown", "ref": "https://multiplayer.it/recensioni/hunt-shodown-recensione.html", "text": "After several months in Early Access on Steam, Crytek's new game is finally out. The Crysis software house has experienced a critical period after the interruption of the partnership with Electronic Arts, being forced to close several production studios in order to remain standing. Efforts to return to grinding profits could no longer focus on the classic first person shooter in single player, a genre that no longer enjoys the popularity of the past, and were aimed at a wider catchment area, that of the so-called battle royale , reinterpreted according to the style and tastes of the Yerli brothers. Hunt: Showdown, whose review you read, is therefore an exclusively multiplayer title characterized by interesting dynamics, given that it mixes cooperative and competitive modes with survival horror atmospheres: a real PvPvE paradise for Twitch streamers. The rules of the game The classic game is called Bounty Hunter and involves up to twelve players in teams of one, two or three people. It starts at the edges of the map; thanks to an ethereal view (activated which loses perception of the real world, potentially remaining at the mercy of the opponents) it is possible to highlight three fires on the map, each of which contains a clue to the position of the final monster. These areas are guarded by zombies and other lethal monstrosities; once freed and obtained the information, we move on to the next point, until the boss is located. After reaching it, it must be shot down, its remains recovered through a ritual and brought back to an extraction point to collect the bounty. Explained in this way it seems quite simple, but it must be specified that the undead emerge from the most unthinkable corners, the ritual lasts a lifetime and above all there are other people who can't wait to let the poor unfortunate do the dirty work and then chill it and collect the loot. The first part of the games is characterized by rather frenetic rhythms, even if the presence of some very ~unsympathetic~ undead and the constant shortage of ammunition persuades one to avoid shootings at all costs. The tension begins to rise with the duels against the bosses, where a good understanding is required in order not to lose too much life. At that point, even if the location is not yet known to other players, it will become instantly recognizable due to the sound of gunfire. Attracted like bees to honey, human opponents are just waiting for the team to have eliminated the target and it will not be uncommon, upon exiting the barn that is the scene of the main battle, to find a bullet from an enemy sniper stuck in the forehead. Hunted and hunter In this phase, the hunter becomes the prey and every step must be taken in order to reach the escape route unharmed. Who carries the funeral has a small advantage: he can visualize the position of the other hunters for a few seconds, but the road to the extraction point is long and full of dangers. It is difficult to describe the sensations one feels when one becomes prey: every noise can be a source of danger and one is constantly torn between the desire to run away and that of keeping a low profile so as not to be identified. When a team member is mortally wounded, he is not eliminated from the game, nor can he be pardoned, but remains on standby (even several minutes), until his partner recovers him (if he makes it and if he remains alive). Each time you are ~resurrected~ you permanently decrease one of three health bars, which means you can only be saved twice. Bounty Hunt matches can last up to an hour and a team can retire without necessarily having to be eliminated. There is a second mode called Bounty Hunter which is a sort of free-for-all (there is no team play and you cannot use an existing hunter, but everyone starts with basic characters), in which you reach four check- point to redeem and purify oneself. An articulated set of rules The game begins by choosing a hunter from a randomly generated list. In your ~roster~ you can recruit up to five, each characterized by health level, equipment and passive skills. The ~lower~ ones are free, while the higher tier ones can be purchased with Hunt Dollars, one of the two currencies used in the game. There are several ways to obtain them: of course the simplest is to win games, but they are also earned by completing certain tasks (for example by revealing clues, killing certain types of monsters, etc.). The hunter is not a permanent character: on the one hand it is possible to boostSome skills can be acquired through the accumulation of experience obtained by participating in missions, but once killed it will be lost forever. In this way, one could be led to abandon the game before the end to save the skin of the beloved avatar, rather than risk losing the strenuous efforts permanently. However, there is another statistic which is permanent: it is the Bloodline, i.e. the overall experience of the player and is fed by the level of the hunter. As it increases, new skills, equipment and weapons become available, purchasable with hunt dollars. It goes without saying that even equipment is lost on death, so the fear of kicking the bucket is further amplified by this choice. However, we must not believe that the higher level hunters are excessively favored: not only can the improvements be minimal, but once the maximum cap is reached (or even before) the title pushes the player to sacrifice the avatar to provide extra experience to the bloodline. The arsenal There are four categories of weapons: one or two handed, melee or firearms, naturally consistent with the historical period under consideration, for which we will find iconic rifles such as the Lebel Model 1886, the Mosin-Nagant M1891, the LeMat Mark II revolvers. Rates of fire and capacity of the magazines are light years away from those to which titles of more contemporary inspiration have accustomed us, and this is reflected in a much more reasoned shooting, where missing a single shot can mean remaining at the mercy of the opponents for the endless seconds required to reload the weapon. For this reason it is advisable to be sure to hit the opponent before pulling the trigger, perhaps sneaking up without being discovered. For this reason we often rely on the white weapon whose use, although limited by the energy bar, has several points in favor, first of all that of not making noise. Under a hunter's coat, essential consumables cannot be missing, such as bombs, sticks of dynamite, Molotov cocktails, medipacks and syringes to restore vitality. Zombies are pretty easy to take down: one or two headshots are enough to get rid of them, apart from some cases where you'll prefer to stay away to avoid complications. Their task, in addition to that of frightening, often hiding in places that are difficult to see, is to deplete the ammunition and alert those nearby due to the noise of firearms. At present we find only three bosses: the arachnid, the butcher and the assassin, each with specific attack patterns and vulnerabilities. Although it is not immediate to shoot them down alone, the challenge rate they offer is leveled downwards, since they attack the player sporadically, giving him time to heal and prepare for the counterattack. Superb construction The technical realization has been one of the hallmarks of Crytek since its debut with Far Cry, and Hunt Showdown is not only no exception, but it looks like one of the most beautiful online titles ever. Having abandoned the tropical islands and the futuristic settings of the Crysis, the software house has decided to take us to the marshy plains of Louisiana at the end of the 19th century, with scenarios taken from the great cinematic classics (12 Years a Slave, The Hateful Eight) and made in fantastic way, starting from the bodies of water to move on to the conformations of the villages, all immediately recognizable despite being united by the typical setting of the southern United States. Matches can be played during the day, at night or in foggy conditions, with approaches that change radically thanks to the convincing implementation of environmental effects. Different elements of the scenario not only make the settings more tense, but are also very important hiding places, such as tents or sugar cane plantations. On the contrary, the broken glass on the floor of a saloon, the bells hanging on the door of a church, the hum of a generator that feeds the street lamps of the village, are sources of noise that should be avoided in order not to be discovered by opponents. The merit goes to the amazing binaural audio, thanks to which it is possible to clearly perceive the direction from which human opponents come, even though it is not possible, due to the obvious limitations of the human ear, to identify their precise position. The way in which voice chat has been implemented is also very interesting: the partner can only hear us if we are close enough to him and, at the same time, communications are audible to all nearby players. A praise to the main theme, so beautiful that you can see itor you will find a worm in the brain after a few listens. Technical Problems Unfortunately there are those technical bugs that afflict this kind of game in the first weeks after launch. We speak in particular of the latency times and above all of the instability of the servers which can lead to interruptions of the game with consequent return to the desktop. In a classic multiplayer title, these problems could be overlooked; in Hunt Showdown it is decidedly more difficult because the crash involves the death of the hunter with the consequent loss of all the progress that had been painstakingly obtained up to that moment. The menu interface is cumbersome and full of useless ramifications. We undoubtedly need a streamlining job that allows you to navigate more easily between the various ~tabs~ and to prepare just as quickly for a new game. Then there is the presence of microtransactions which fortunately only impact on the aesthetic component. Unlocking new costumes involves spending Blood Bounds which can (also) be obtained by paying with real money. One last note on system requirements: CryEngine 5 is a real war machine, but you need a state-of-the-art system to drive it. Video cards like the GeForce 1050Ti or the Radeon RX 580 are the minimum for an average detail quality in FullHD, but to be able to push the 2K to the maximum level and a decent frame rate you will have to rely on at least a 1080.", "date": "2019-09-05", "grade": "8.0"}