{"name": "WRC 8", "ref": "https://multiplayer.it/recensioni/wrc-8-recensione.html", "text": "WRC 8 arrives on the market almost two years after the launch of the previous chapter. After the not particularly brilliant performance of V-Rally 4, Kylotonn has therefore returned to offer an evolved version of the rallying experience based on the FIA World Rally Championship licenses. The elapsed time has given the French team the opportunity to prepare some improvements in an attempt to make the gaming experience a little more articulated and enjoyable. Starting from the renewed Career mode, passing through the interventions on the gameplay, WRC 8 promises to evolve the typical approach of the franchise, bringing it as close as possible to the very fierce DiRT Rally 2.0. A more complete, well-finished game, but also focused on the simulation component, as evidenced by the collaboration started by the developers with the best eSport players in the category. To find out if all that glitters is really gold, all you have to do is continue reading our review. A reimagined Career Mode During the creation of WRC 8, Kylotonn set herself a fairly clear goal: to refine the formula packaged in the previous episode, trying to optimize as far as possible all the items that had room for improvement. The main novelty is precisely linked to the presence of a Career mode that is significantly more structured than the one that had been developed in the 2017 chapter. After selecting the name and nationality of your virtual alter ego, the game allows you to choose whether starting from the bottom, trying their hand at the Junior WRC championship at the wheel of a front-wheel drive Ford Fiesta R2, or whether to raise the bar immediately by offering themselves to one of the teams in the WRC 2 division. This time, in addition to completing the competitions, it was introduced a complex progression system that links the results obtained on the field to the degree of satisfaction of the team with which the contract was signed. Not only that, given that there is a real internal management system for the human and economic resources of one's team. By accessing the dedicated area, you can manage the training of your collaborators, assessing their skills and salary. Each specialist is associated with skill cards that must be inserted into special slots divided into items such as Mechanic, Engineer, Agent or Meteorologist. The level of fatigue accumulated by each of these individuals also makes it necessary to measure their strength and have valid substitutes available; with the increase of the forfeited money and the evolution of the pilot's reputation, it will also be possible to find new talents. By accessing the Workshop, you can organize your calendar, taking care to set your agenda with certain daily deadlines to be completed between one official race and another. In these spaces, for example, it is possible to choose to rest, or vice versa to spend oneself in side activities such as training. Then there are the Constructors' Tests, useful for improving the reputation of the driver within his own team, the Historic Races aboard legendary cars, or even the events in extreme conditions, where it is necessary to drive a heavily loaded car as far as possible. damaged, moreover in adverse weather conditions. The Research and Development department takes care of adding further meat to the fire, where you can access a vast skill tree with which to activate upgrades. From skills useful for making the structure and competence of your collaborators more solid to the increase in items such as morale, physical fitness, rewards and relationship with the manufacturers, passing through improvements such as tire grip in variable conditions and the improvement of some specific components of the car, there really is something for all tastes. Although the WRC 8 Career mode represents a decisive step forward, the alternatives made available to the player have proved to be very standard. In addition to the usual single season and the section dedicated to tests/training, in fact, you have access to a multiplayer section which limits itself to proposing the classic split-screen - for heaven's sake, always welcome to inflame the challenges in the living room - juxtaposed to an online section where the only options are to take part in a generic quick match or create a custom lobby. Playstation 4 trophies There are a total of 44 WRC 8 Trophies, divided into 28 bronze, 12 silver and 3 gold plus Platinum. Some expect to finish on the podium of each stage in Career mode, others to complete specific objectives including a minimum of kilometers traveled and the conquest of special events. Simulation gameplay, new physics and dynamic weather The eldestHowever, the content consistency of WRC 8 can also be seen in the variety of tracks. Making a quick comparison, we have in fact gone from the sixty courses of the predecessor to the current 102, distributed in 14 different countries. Alongside the current models, the historic cars make a comeback: WRC 7 had been able to improve the driving structure and the physics of the vehicles, but this year Kylotonn has managed to field further substance in an attempt to smooth out deficiencies in terms of of driving feeling and credibility in the behavior of the car on the rough dirt roads and the tortuous asphalts that mark the stages of the World Rally Championship. The approach is devoted to simulation, although there is room for deciding how to juggle the settings. For example, those who wish can decide to activate certain aids, but if necessary it is also possible to limit the actual incidence of damage suffered by the car and increase the capacity of the artificial intelligence, resulting in more competitive race times. We found the sensations returned during the driving phases to be appreciable, in particular as regards the distribution of the weight that is perceived in the sudden changes of direction and in the presence of bumps and jumps. Nonetheless, pad in hand, we often perceived an almost excessive steering response in relation to the stresses exerted by the competition terrain. The other main change brought by WRC 8 concerns the dynamic weather. An increasingly sought-after feature in today's driving games and certainly a plus in terms of variety in the play experience. The presence of variable conditions can affect the performance of the individual stages; it follows, for example, that it is possible to leave in dry ground conditions and then having to deal with downpours of variable intensity. Although the real-time modification of the environmental context represents a step forward for the series, the differences between one situation and another still seemed to us not very palpable, both on a concrete level and on a purely aesthetic level, thanks to an approximate rendering of the splashes caused by the passage of your vehicle on wet ground. The consistency of the surfaces remains in line with its predecessor, giving a driving feeling that changes in relation to the composition of the route. The major shortcomings of WRC 8 are revealed precisely from a graphic point of view, definitely a step backwards compared to contemporary standards. Kylotonn has worked hard to refine the aesthetic reproduction of the cars, with overall satisfactory results, while one cannot help but point out objective limitations as regards the tracks. While taking the original counterparts as a reference, the paths lend themselves to obvious shortcomings in visual depth and general impact, with a fluidity anchored to 30 frames per second and a physical model of damage that still needs to be perfected.", "date": "2019-09-03", "grade": "7.8"}