{"name": "Yu-Gi-Oh! Legacy of the Duelist: Link Evolution!", "ref": "https://multiplayer.it/recensioni/yu-gi-oh-legacy-of-the-duelist-link-evolution-recensione.html", "text": "It is unlikely that in the last twenty-three years someone has not heard of Yu-Gi-Oh!: only the first series of the franchise based on the work of Kazuki Takahashi has literally invaded the western world, at the end of the 90s, with manga, anime and hundreds of trading cards. The review of Yu-Gi-Oh! Legacy of the Duelist: Link Evolution on Nintendo Switch is the final point (for now) of this adventure, already projected towards new horizons: a complete summa. Over the years the success of the franchise has in fact consolidated into one of the most famous trading card games in the world together with Magic, with annual tournaments and the sixth anime series, Yu-Gi-Oh! VRAINS, currently in progress. So many different products and media have been brought together by Konami into one product, Yu-Gi-Oh! Legacy of the Duelist: Link Evolution. Which, while far from excellent, is a must buy for fans of the series who disdain the mobile counterpart known as Yu-Gi-Oh! Duel Links. Plot: or rather, all plots The plot of Yu-Gi-Oh! Legacy of the Duelist: Link Evolution resolves into the sum by addition of all the storylines of the various single series of Yu-Gi-Oh! The main game menu, extremely sober (not to say sparse), illustrates to the player with its various items everything he will have available in the package, offered for a good 39.99 euros. The first item is the one you are looking for, as well as the fundamental one to unlock all the knowledge contained in the title: Single Player. From here starts a new submenu, divided into the various anime and manga series of Yu-Gi-Oh!, namely Yu-Gi-Oh!, Yu-Gi-Oh! GX, Yu-Gi-Oh! 5D's, Yu-Gi-Oh! ZEXAL, Yu-Gi-Oh! ARC-V and finally Yu-Gi-Oh! VRAINS. Note that the latter is an exclusive addition to Yu-Gi-Oh! Legacy of the Duelist: Link Evolution, because the counterpart published years ago on PlayStation 4 stopped at ARC-V with pendulum monsters: the real novelty of the package, therefore, is represented by the introduction of monster mechanics. Each of the series of Yu-Gi-Oh! It can be entirely relived through the main companion, in all its moments, whether they are main or not. From time to time, the player takes control of the hero on duty against the enemies, in the various narrative arcs of the individual series: on balance, many (too many) dialogues are read on the screen, in a sort of definitive encyclopedia of Yu-Gi- Oh!, then the antagonists face off in a duel. The artificial intelligence never offers prohibitive clashes, and for novices detailed tutorials will provide all the necessary information on the collectible card game. Those who already know Yu-Gi-Oh!, on the other hand, will simply have to update themselves on the new rules introduced with the monsters XYZ, Synchro, Pendulum and Link... which, if you think about it, have made the card game drastically different from what it was initially . Once the various episodes of the main story have been completed, new card packs, playable characters, deck lists (to create the protagonists' decks) and points to spend in the shop will be unlocked. Finally, it will be possible to replay every single episode by impersonating the enemy, in a sort of reverse plot. This you will have to do if you want 100% in the title, which will require several hours of play. Gameplay and content Yu-Gi-Oh! Legacy of the Duelist: Link Evolution is a window into the entire franchise, with all story arcs and over 9,000 cards available to the player. From the gameplay point of view, however, it is important to remember that there is basically only one offer: duels upon duels, with new rules depending on the specific narrative arc chosen. The whole screen is occupied by the battlefield and we continue with the typical procedures of Yu-Gi-Oh!, whose general rules we obviously cannot recall here, and you should already know them: the aim of the game is to bring to zero the opponent's 8000 Life Points, summoning more and more powerful monsters, using spells and traps to stem enemy assaults. The initial deck of cards is provided by the game, but then it is possible to customize it in every detail, also and above all by purchasing packs to obtain new and more powerful cards. Fortunately, there is no real money to invest, just the game currency obtained after each fight in the main campaign, the same one that unlocks certain particular cards. Another very interesting game mode that varies a bit an overall linear and at times monotonous offer is the Battle Pack. Here the player has to deal with particular opponents, but cannot use his favorite deck: he has to deal with the temporary one provided by the game. Instead, the in-game store allows you to enrich your collection of Yu-Gi-Oh! virtual cards: procedBy completing the main campaign (if you haven't figured it out, it's practically mandatory to complete it at least once) you will unlock various packs inspired by the main characters of each anime series and narrative arc. Since the single pack has at least 500 cards at a time, you will have to spend quite a lot of coins to finish the collection, if it is human to do so. Multiplayer and some limits The main campaign, the Battle Pack and the record-breaking contents still do not exhaust the offer of Yu-Gi-Oh! Legacy of the Duelist: Link Evolution: in fact, the multiplayer sector is missing, online and offline. Locally you can challenge other friends who own a copy of the game (it is not possible to play in two on the same console), while with an online subscription you will have access to both casual battles and ranked matches, with a lot (precisely) of global ranking to know the strongest players and examine the decks of the moment. If you've been following the trading card game Yu-Gi-Oh! in recent years, you will know very well that to have any hope you will need Pendulums and monsters. Anyway, Yu-Gi-Oh! Legacy of the Duelist: Link Evolution has many limitations, and quite obvious. Its structure is extremely sparse and functional, but the whole thing is decidedly uninspired: it's impossible not to make a comparison with its main antagonist on Android and iOS mobile platforms, namely the excellent Yu-Gi-Oh! Duel Links, updated weekly, full of events and even able to impose its rules on the official trading card game (the rules of Duel Links, in fact). Beyond that, Yu-Gi-Oh! Legacy of the Duelist: Link Evolution is still a simple conversion from PlayStation 4 to Nintendo Switch, with the addition of a little unreleased material (mainly the latest series and monsters) offered at the high price of forty euros. Minimal effort on the graphic and artistic front: the animations of the monsters are present only for the canonical ones, which perhaps are practically never used: Exodia, the Blue-Eyes White Dragon, Elemental Hero Neos, the Black Magician, Utopia, and so on. Even the adaptation to the touch screen leaves its time: for example, a simple mechanic of dragging cards on the battlefield has not been integrated, you have to tap on each of them and then tap again in the context menu to decide what to do with it. Was it a lot to ask for a more intuitive and functional adaptation on a portable console?", "date": "2019-09-01", "grade": "7.0"}