{"name": "ProtoCorgi", "ref": "https://multiplayer.it/recensioni/protocorgi-recensione.html", "text": "Has the side-scrolling shooter genre given it its all? Although it is a particularly inflated trend at the time of 8 and 16-bit systems, we imagine there are still things that can be done with this type of formula, and evidently we are not the only ones since it has just been released on PC and Nintendo Switch a title like ProtoCorgi. Developed by Kemono Games, the game focuses in particular on the sweetness of its protagonist, Bullet, precisely a corgi but different from the usual, given that he is cybernetically enhanced by his brilliant mistress so that he can guard not only her home but also to the entire planet, threatened by a horde of alien parasites which soon takes control of the Earth troops and launches a devastating attack, dragging away even the young scientist. There's no time to waste: having activated his thrusters and awakened the fighting spirit that dwells within him (literally, even if the thing is not explained very well), Bullet sets off in pursuit of the extraterrestrials, determined to eliminate them and save the its creator. A mission that turns out to be as captivating as its assumptions? We reveal it to you in the ProtoCorgi review. Structure: between levels and difficulties ProtoCorgi, the ~glacial~ levels have various extra pitfalls Let's go back to the original question: do horizontal scrolling shooters still have something to say? To find out, the guys from Kemono Games started experimenting with different solutions, adopting a vaguely roguelite-style approach in order to solve one of the most common problems of this kind of title, namely the often limited duration. Completing the ProtoCorgi campaign does not it takes a long time, just over forty minutes (and, given the price, that's perfectly fine), but it is decidedly unlikely that you will get to unlock one of the two endings available on the first attempt. This is because you will be faced with unusually tough enemies and seemingly ineffective weapons, as well as a small number of lives and continues. For this you will have to ring attempts after attempts, score points and eliminations, push yourself as far as possible within the levels and thus unlock permanent upgrades that will make subsequent attempts easier. The problem is that the process will necessarily see you repeating the same scenarios and the same boss fights over and over again as long as you manage to surpass your previous record. It is therefore a short blanket, the one embroidered for the occasion by the development team Chilean, which for the rest has fielded rather traditional elements as regards the weapons available to Bullet (various missiles, lasers, rays that open in various directions, smart bombs, etc.), which are placed inside of four slots, but which you will have to learn to recognize to avoid ending up fighting with tools that don't lend themselves to your personal style. Gameplay: Experimentation in bullet hell sauce ProtoCorgi, a sequence that gives the idea of how messed up some moments in the game are ProtoCorgi is therefore distinguished by a not indifferent degree of challenge, even at the intermediate level of difficulty, and which inevitably takes the form of a series of game overs that are also quite frustrating due to the ways in which they occur, mainly due to a of collision detection a bit particular, which in truth we did not appreciate. It seems in fact that the body of the protagonist is largely intangible and only his ~nucleus~, so to speak, fear the impact with enemy bullets and any stray objects in space, according to the ruthless rule that a single hit corresponds to the loss of a life. If this setting proves to be sensible to lighten the bullet hell dynamics in which the screen is literally filled with bullets and obstacles, in combination with a back button that allows you to slow down and therefore move more precisely, it does not lend itself equally well to other interactions . ProtoCorgi, movement in confined spaces while being shot at is recognized as an Olympic discipline in the profanity category The partial intangibility of Bullet also applies when trying to collect objects and power-ups, which means that you have to completely cover the sprites with that of our character for the desired collision to occur, and when there is an urgency to recover certain things (for example the power-ups lost immediately after dying) happen that the large movements required turn into an unpleasant trap that generates further loss of life. This aspect is also exacerbated by the management of the attack, which starts with a second of delay due to attendancetwo different fire modes (one in which you repeatedly press a button to ~bark~, making the letters ~BAU!~ appear and throw them at enemies, and one in which the button must be held down), and by the positioning of enemies , which already from the second or third level of the campaign we will often see placed behind us during alternate scrolling phases, with the frustrating impossibility of hitting them and the urgency to avoid their bullets while we face the pitfalls that come in front. The integrated editor ProtoCorgi's experience does not end with its campaign, but includes an editor that allows you to create levels from scratch, using the assets of the game itself, and then try them and possibly share them with other users, and in the same way download the creations of the community. Unfortunately, the ProtoCorgi Maker interface seemed really complicated and cumbersome to us, which soon dampened our enthusiasm, so expect a little patience if you want to try your hand at this specific tool. Graphics: dog pixel art ProtoCorgi boasts pixel art graphics full of stylized and effective solutions On closer inspection, it is precisely the pixel art graphics that are the most characterizing element of ProtoCorgi. The intention of the authors to aim at a certain type of user is clear by putting a nice corgi as the protagonist of a horizontal scrolling shooter, and there is no doubt that a good job has been done from this point of view, although the design of enemies in general often appears generic and uninspired, as well as the scenarios. The chiptune soundtrack gives the whole experience a strong push, especially with the first songs, to then lose its edge and take refuge in less inspired melodic solutions, while the sung piece that accompanies the introductory sequence is certainly remarkable. Too bad that the technical scaffolding occasionally wobbles on Nintendo Switch, showing the side to obvious stutters and drops that should absolutely have no place in a similar product.", "date": "2023-07-01", "grade": "7.0"}