{"name": "Pokmon Masters: la recensione", "ref": "https://multiplayer.it/recensioni/pokemon-masters-recensione.html", "text": "This Pokmon Masters review has taken longer than expected. Not so much because the new spin-off created by The Pokmon Company in collaboration with the Japanese mobile entertainment giant DeNa had who knows what depth of mechanics to analyze. He had the potential, of course, but the promises made on the eve are not always kept. What prompted us to take more time to delve into the game was the desire to understand how far we could go in making what turned out to be a surprisingly pleasant product boring, frustrating and repetitive. And also, of course, seeing the final version in action, and not just analyzing the lame Singapore beta, which was provided to us with a press account for early access. This, therefore, is what we will talk about in this review, and if you are as much a fan of Pokmon as the writer, I hope you will carefully consider whether and how much time to spend on this free-to-play gacha available on Android and iOS devices. Welcome to Pasio: The Plot The welcome upon the player's arrival on the artificial island of Pasio is cheerful and fun. After having created their avatar with a rather basic editor, in fact, the young coaches are received by two old acquaintances, both video game enthusiasts and anime fans. We are obviously talking about the two most famous gym leaders of Kanto, as well as great friends of Ash: Brock and Misty. An excellent gimmick to introduce the plot and immediately put everyone at ease, while explaining the basis of an atypical combat system based on the so-called Units. That's right, because the fights on Pasio are not a matter between the trainer and his Pokmon, but between a series of combinations made up of a Trainer and his favorite pokmon, which form an inseparable pair: the Units in fact. Instead of capturing little monsters around the region, the goal is therefore to recruit famous trainers from all over the world and thus compete in the so-called World Pokmon Masters, in short, the Pokmon league of the island. There are two ways to do this: access Unit Search in the in-game shop or play Story mode by collecting the 5 medals needed to enter the tournament. We will talk about the monetization system in detail later, so for now it will be the single campaign that will be the subject of attention. Like any self-respecting Pokmon story, this one alternates between fights against other trainers, challenges to the 5 gym leaders who keep the coveted medals and, obviously, the clash against the gang of bad guys on duty. This time represented by the mysterious Team Break, a group of masked trainers who go around trying to steal the Pokmon of the strongest trainers on the square. Although an Oscar-worthy screenplay was certainly not expected, it must be said that for the first 10 chapters things are going quite well. Indeed, despite the fragmentation of the episodes, the adventure is so engaging to keep attached to your smartphone between one fight and another to reach the final stages of the tournament and finally learn more about the background of some particular characters, such as the creator of the island of Pasio, the mysterious Kelian. In this phase the fights are sufficiently balanced and the time spent training one's Units is the minimum necessary to bring those trainers up to speed who can be useful against a certain type of opponent. Once you reach the fifth medal, however, something in this delicate balance breaks and even the immediate and fun, albeit simplified, combat system set up by the developers begins to lend itself to all its limits. ATB for Pokmon? The gameplay beyond Final Fantasy Transferring the depth of Pokmon mechanics into a mobile game is not easy at all: frenetic games are strong on smartphones, to be managed with a couple of taps while on the bus or waiting for your turn at the doctor. For this Pokmon GO has struggled, and still struggles a lot, to understand what to give up, and what to keep, of the original games. The problem recurred, to a lesser extent, also in this case. Breaking away forcefully from the main series thanks to the gimmick of the Units, however, Pokmon Masters seemed to be able to find its way following in the footsteps of another brand that represents one of the cornerstones of the Japanese role-playing game: Final Fantasy. Partially recovering the idea of the Active Time Battle, or ATB, introduced in the seventh chapter (whose remake, by the way, seems to be a bomb, at least according to our last testor Final Fantasy 7), the classic Pokmon battle system immediately becomes more lively and dynamic. In short, no waiting between one shift and another, with the rhythm of the attacks that is marked by an energy bar whose recharge speed depends on that of the pokmon of the three Units on the field. Each of them is equipped with a basic attack and a special one, so to speak, to be unlocked using the appropriate objects obtained during the campaign missions and during the training missions in the strict sense, available practically immediately. Likewise, each trainer who forms a Unit has two special actions, which do not use the attack bar, but have useful support effects, such as healing, stat boosting and the bar refilling. In addition, they help to charge a super powerful special move, a sort of Z-move of Pokmon Sun and Moon, here called Unimossa and allowed by the perfect synchronicity between Pokmon and their coaches. You have the ability to access passive skills, but their function is limited by their disproportionate cost in terms of resources at a very late stage in the competition. The three-on-three battles, without the possibility of replacing the Pokmon on the field, all revolve around these few mechanics, and a handful of other elements taken from the basic series: status alterations, stat boosts and, of course, pokmon types. This simplification, although pleasant in the early hours, soon proves inadequate for long-term use. The reduction of the aforementioned types to a simple expedient to give each Unit a single weakness to an element, for example, greatly reduces the strategic depth of team building, preventing you from exploiting the resistances that underlie type compatibility , or to aim for double weaknesses to overturn situations on paper, unequal for the mere numerical values of the statistics. Even the clear division between attacking Units (the so-called sweepers, if chewed by competitive), techniques and helpers ends up being an obstacle to the construction of original teams. Rina's ability to recharge her attack gauge, to take a trivial example, makes it really difficult to think of benching her and her Snivy, effectively blocking a support slot for practically all the harder challenges. A question, this of the balance between the Units, which emerges strongly when facing the actual World Pokmon Masters. As already anticipated, when you reach the Pasio league, something in the balance of the game breaks: the difficulty of the challenges requires the massive use of specific training to level up, the narrative component is set aside and everything begins to revolve around to a series of battles against famous trainers to recruit for the next challenge. There is no real structure for the tournament and thinking about continuing just to finally, perhaps, have the opportunity to learn more about Kelian and the origins of Pasio becomes cloying. Even the evolution of Pokmon becomes a trivial matter of numbers, given that the one-on-one battles to be faced are a simple pretext to push the player to unlock advanced skills and reach the level cap before moving on to button mashing where the player skill counts for little or nothing. And this is demonstrated by clashes such as the one necessary to make Servine evolve into Serperior, where it is almost impossible to defeat Brock's Onyx without unlocking the Giga Absorption move. Not even the presence of some cooperative missions helps much, where the gameplay becomes decidedly richer thanks to the collaboration with two other real players and their teams of three Units. These even allow the replacement of pokmon with running attack as in tag team fighting games, combined attacks and unique special moves, but in essence they end up being quite confusing. On the plus side, at the very least, they only unlock after Chapter 11, which should ensure that everyone gets some experience. Even if in practice this is not always the case and the moves are more often the result of chance than of a real coordination skill. Loot-box heaven: graphics and microtransactions There is little to say about the graphics and the technical sector in general of a title like Pokmon Masters: after the launch of the final version, apparently successfully, the glitches and unexplained crashes of the app that kept us company in beta, the game is now absolutely pleasant to see and hear. The character models aren't particularly elaborate in polygons and animations, but they do justice to thetheir 2D counterparts and in some cases are visible for the first time in three dimensions. Even the audio accompanies with pleasant music and a dubbing of the main dialogues available both in Japanese and in good English. Of course, the use of standard expressions is not missing to accompany the phases between one fight and another, but it is a visual novel element to which we are now accustomed. In addition, the texts are all localized in an Italian which we thought was absolutely fair, but having been forced to use English for most of the experience it is impossible to express a complete judgment. The monetization system is apparently very forgiving. The missions can in fact be tackled freely, without annoying time limitations or the obligation, to continue or train your team, to use rare objects (perhaps to be paid with hard cash). By virtue of the gameplay problems highlighted above, however, we cannot help but be suspicious of the surge in difficulty and the strong acceleration towards the collecting component that characterizes the progression after chapter 10. You know that episode of South Park where are the mechanics of making free-to-play games explained? Good, because here we could be dealing with an example taken from that same manual. The impression is that, after having ensnared the player with what would appear to be a virtuous combination of narrative, gameplay and collecting, Masters wants to trap him in a vortex of frustration, repetitiveness and boredom, where the only satisfying reward is obtaining new personages. Or of duplicates useful for enhancing the sync moves of those already in your possession. Unimoves which, incidentally, are almost always decisive in clashes.", "date": "2019-08-30", "grade": "7.0"}