{"name": "Remnant: From the Ashes", "ref": "https://multiplayer.it/recensioni/remnant-from-the-ashes-recensione.html", "text": "Remnant: From the Ashes has already been available for a few days on PlayStation 4, Xbox One and PC and if you're here it's probably because you want to read our review of Remnant: From the Ashes for PlayStation 4. If you've opened the article by mistake, instead, stay a little longer: you could discover one of the most beautiful games you've played in the last year, but which runs the risk of being overlooked. On the net, the non-specialist public defined it, a bit casually, as a Dark Souls with pistols, or Bloodborne with a few rifles too many. The comparison is almost perfect. Remnant: From the Ashes is difficult, demanding, at times very punishing: like a Soulslike. The progression is satisfying, and soon the player's game becomes really unique, different from that of all the others present. You can even play online, to fight evil together with two other friends. Oh, it's also dubbed in Italian, text and dialogue? Have we intrigued you? So stay, stay a little longer among the Roots. Plot: An ancient evil The story of Remnant: From the Ashes is not the mainstay of the entire progression. Sometimes it slows down, sometimes it fades, then suddenly it picks up and reawakens interest by introducing characters with exceptional charisma, such as Mother Root or Mud Tooth. Yes, but who are these people? Remnant: From the Ashes is set in a post-apocalyptic Earth, ravaged by an ancient evil from another dimension. The atmosphere of the best Lovecraft is palpable, both in the environments and in the appearance of the many enemies present, as well as in some co-stars. The player sets out on his journey, as he is the only one who can put things right. But in reality Remnant: From the Ashes is very hesitant in the details, and relies on collectibles and the occasional dialogues between NPCs to convey the understanding of a sometimes dark narrative. What the player immediately understands is that the world is corrupt, invaded by the Roots, and that the latter must be stopped. At all costs. The early stages of the game serve as a tutorial, but don't expect any leniency from them either. The developers (the Gunfire Games, those of the last Darksiders, by the way) have stated that the difficulty scales according to the skill of the player. It's not true, don't believe him. Remnant: From the Ashes is bad, ruthless, like the world in which it is set. One misstep and you're dead. One warning ignored and you're dead. One wasted bullet and you'll die because you didn't have it at the right time. Ammo park and chock full of enemies; monsters with a health bar three times your length, and that deal quadruple your damage; few upgrades hidden somewhere, and the ability to upgrade with difficulty, but without ever putting on the handbrake to curb the descent into madness a bit. Getting to the end credits will be as difficult as it was in Bloodborne years ago. And no, the presence of friends won't help you, because enemies get stronger when in groups. Playstation 4 trophies Remnant: From the Ashes has a Platinum Trophy, yes, along with many other very precious achievements. However, the difficulty of the title says a lot about how much you will have to sweat to unlock them all: we only announce that, in addition to beating up all the bosses, you will have to tear one of them apart without even suffering a single damage. The list contains many plot spoilers, so we advise you not to read it during the first run. Gameplay: A vicious third-person shooter Remnant: From the Ashes is a third-person shooter with survival mechanics, with lots of action accompanied however by an exploration of the environments that must be as reasoned as possible. This is not one of those games where you can take up a shotgun and exterminate monster after monster regardless of the consequences. If a monster hits you (and they will), at best even the weakest of them will take a third of your health. Of course, you can dodge: dodging is essential. But the stamina bar is certainly not more generous: a light jog, two somersaults and you will already be out of breath. It is therefore understood how in the gameplay Remnant: From the Ashes one proceeds calmly, very calmly, and with difficulty. You explore small environments trying to figure out how many enemies there are, you engage in battle with the closest ones, leaving the dangerous ones for last. You die, a lot. Too. But once back to life for better or worse it is possible to anticipate some events. Not all: the mini-bosses of the areas are generally placed at random. That cursed Root armored with the impossible to dodge gatling doesn't necessarily come back. Maybe the summoner will come, weak but full of followers ready to do the dirty work. No game of Remnant: From the Ashes is the same as the other. It's another promise from Gunfire Games, and this time you can believe it. At the beginning you will be able to choose between three different game classes: the Hunter, specialized in long-range combat, with shotgun, repeating pistol and sword. The Ex Acolyte, specialized in medium range combat with shotgun and repeater pistol (we chose him, and we never regretted it). And finally the Wrangler, clearly meant for close combat. Whichever choice you make, you will have a main and a secondary weapon, as well as an ax for close combat (but best avoided, close combat, at least with so many enemies on the screen). Almost all game elements are upgradeable. By collecting iron and waste, which is the main resource of the game, you will make armor, headgear, boots and all accessories more resistant; some amulets (mostly collectibles) provide additional bonuses to certain parameters. New weapons (but not too many) are bought at the shop, and are in turn upgraded. And then there are the fundamental mods. These are bonuses to be activated once the weapon carrying the specific mod is ready. You attach a mod to a weapon, use it in battle, charge the mod gauge, and then unleash the bonus. It can be a small circle of energy that allows you to recover health, fire bonuses to projectiles, and more. Some special mods are obtained by defeating the gigantic bosses. Technique and multiplayer sector The artistic direction and the technical sector of Remnant: From the Ashes are truly remarkable. Not excellent: the environments are materially bare and at times monotonous, barely saved by the game atmosphere; the worlds, although procedurally generated and rich in areas, just four in total. But the end result is that of a game made by people who know how to play games well, even with little money available. The Gunfire Games once again show themselves master craftsmen, moreover very inspired. You notice it in the fights against the gigantic bosses. The first, the Mazzuolatore, will torment your soul for nights and nights. We spent a full hour taking him down, and three times we were within a whisker of defeating him. The sense of final fulfillment is in line with that of the best Souls. We tested Remnant: From the Ashes on a PlayStation 4 Pro, and we didn't notice any slowdowns whatsoever. The frame rate is stable, the graphic detail not excellent for being at the end of the current generation, but more than acceptable. What matters, never as in this case, is the gameplay. And the atmosphere, let's say it again. Let's remember, before saying goodbye, the multiplayer sector: Remnant: From the Ashes is perfectly usable offline in single, for those looking for a truly demanding challenge. But if you want you can host online or join a game of random players, up to a maximum of three present at the same time. The fun increases exponentially... and so does the difficulty.", "date": "2019-08-28", "grade": "8.2"}