{"name": "Stellaris: Console Edition  Utopia", "ref": "https://multiplayer.it/recensioni/stellaris-console-edition-utopia-recensione.html", "text": "Paradox Interactive has long since become the standard-bearer of a philosophy that in the variegated universe of video games puts the complexity and depth of the gameplay before the frenetic and immediate action, even preferring to limit the portion of the public it is aimed at in order to keep those who are the cornerstones that have consecrated its success. We had yet another confirmation of this with Stellaris, which at the beginning of the year also obtained acclaim on consoles, thanks to a beautiful conversion that was able to confirm the very spirit of the Scandinavian development team's productions. And it is precisely to make the offer to console users even more complete in these terms that the latter has recently released Utopia, an adaptation of the homonymous expansion for the PC edition of the game, which adds many new contents and goes to revolutionize various aspects, improving the advanced stages of the game and giving new goals to achieve for the most demanding. The art of diplomacy Utopia obviously confirms the elaborate structure and layered game mechanics of the base game, which therefore require a good handful of hours before being mastered to the fullest and giving satisfaction: for details, we refer you to the review. But at the same time it improves and refines various elements, as mentioned in the introduction. First of all the government system, which becomes more complex and multifaceted to the point of assuming an even more central role in the game's economy. In fact, now the internal management of the empire is much more interesting and central to the gameplay than it was in the base game. If before there were selectable types of government, now we start from four general systems, namely democracy, oligarchy, dictatorship and hereditary empire, to which civics can be associated (two basic, three if a certain social technology is developed) which allow you to shape a government closer to what the player's vision is. All this then affects the process of growth and development of society which, depending on the policy adopted by the state, can in turn give life to factions capable of influencing the life and functions of the government. In fact, these social groups united by a common cause each pursue a goal and have their own political agenda which can be in contrast with the user's style of play, leading the latter to make decisions with decisive consequences for the conduct of a game . For example, if the gamer is at the head of a highly militaristic nation in a social context that shares his ideals, then no problem. But if vice versa the population (or a part of it) manifests more pacifist ideas, then the reactions to the warmongering ideologies of the government could lead to the birth of an anti-militarist faction to counter it, and so on. Genetics and robots Utopia introduces other significant innovations to the game, especially in the evolutionary field. In this sense, the expansion introduces a new resource, called Units, which through the use of special points allows you to unlock new functions within skill trees called Traditions: through specific paths, characteristics called Advantages of the Ascension, perhaps useful to make genetic modifications to the population (Biological Mastery), to use Transcendence to release the psionic potential of one's own species or even to transform it into robots through Synthetic Evolution. You can influence primitive civilizations to adopt your ethics through the use of observation stations, multiply the fertility of women or build huge structures useful to bring great benefits to your race, such as ring worlds. And again, still on the subject of creations, building Dyson Spheres around a sun to suck all the energy out of it and turn it off, thus eliminating all living species from an entire system, or Habitats, orbiting stations capable of hosting a more numerous population, until they play the role of small planets in a small and limited system. The possibilities offered by Units are really many and, opening up towards the second half of the game, they make the most criticized phases of Stellaris more interesting in the past. It's just a pity that to unlock all the skills it is sometimes necessary to perform specific actions in antithesis with some aspects of the policy adopted by the player's government: however, nothing that compromises the goodness of the DLC. However, Utopia still definitely improves the gaming experience of Stellaris: Console Edition, as mentioned in the introduction, making the gmore layered and deeper playability. For the rest, the conversion process operated by Paradox Development Studio proved to be positive also as regards the graphics and sound sector, as well as for the controls, which obviously maintain the well-optimized basic ones of the original conversion.", "date": "2019-08-27", "grade": "8.5"}