{"name": "Control", "ref": "https://multiplayer.it/recensioni/control-recensione.html", "text": "Control review: the new Remedy Entertainment game for PC, PlayStation 4 and Xbox One takes you by the hand and leads you on a disturbing, at times dreamlike, journey that develops through the corridors of a large building in central New York as well as in the psyche of the protagonist, Jesse Faden. We let ourselves be guided through this mysterious and fascinating world, so full of unknowns yet so clearly the result of the experience that the development team has gained with its two latest projects, Alan Wake and Quantum Break. From the first Control brings back some suggestions, the presence of characters that are nothing short of bizarre and the inevitable side dish of tapes and videocassettes which offer those who wish to deepen the topics dealt with and a series of behind-the-scenes backgrounds. It takes and develops the gunplay of the second, once again providing us with a set of special powers to be used in combination with a decidedly out of the ordinary weapon, created by the Federal Bureau of Control using the so-called Objects of Power and equipped with five possible configurations. The journey begins on the street Jesse crosses before entering the FBC headquarters, seemingly unaware of what has happened inside the building. It seems that the top figures of the agency must necessarily possess supernatural abilities, and the Finnish caretaker Ahti is no exception: he suggests the right path to Jesse to understand the type of threat the agency is dealing with, and it is at that point that the girl is faced with a gruesome scene. Weapons and powers The entire Control campaign takes place within the headquarters of the Federal Bureau of Control, an agency created to study and control paranormal phenomena, starting with the one that involved the protagonist several years earlier. From time to time special objects appear in the world that create doors to a different dimension, and this is more or less what happened to the so-called Oldest House, the building that houses the offices of the FBC, which apparently has always owned of particular characteristics. The Hiss has breached our plane of reality by exploiting the openings present inside the building, transforming all the employees (or at least those not protected by a specific device) into agents at its service or by putting them in a sort of stasis, suspended between the two dimensions. The Director is gone and Jesse takes on his role, setting himself the goal of cleaning up everything but also and above all of finding answers to his personal questions, which we don't want to dwell on, however, leaving you free to discover them during the game. The gameplay of Control has a very specific progression: once in possession of the Service Weapon, as mentioned above, we will find ourselves facing the manifestations of the Hiss in traditional firefights with a dynamic connotation, without stalking to stick to. The first configuration is a simple semi-automatic pistol, and in all cases the bullets are infinite but the magazine is not: after a sequence of shots you have to wait a few moments for the ammunition to be restored. However, there are many mods that we can unlock, recovering them randomly from crates and enemies and which improve the various aspects of the weapon: firepower, magazine capacity in various conditions, stability, aim magnification and so on. The more powerful ones are then specific to certain configurations of the weapon. The same system also applies to the protagonist: we will therefore find mods that improve her physical characteristics and enhance her skills that we will be able to acquire by coming into contact with specific Objects of Power. We are talking about six maneuvers in all, if we want to call them that: a melee attack that we already possess and which leverages telekinesis to amplify the power of the punch, the ability to attract any object or debris like magnets to hurl it against a target, one quick shot useful for avoiding enemy fire, a shield created on the spot using bricks and various scraps, the possibility of possessing a dying hostile soldier to make him fight alongside us and finally the ability to levitate, albeit for short periods of time . Gameplay At first, the gameplay of Control communicates a feeling of slipperiness, perhaps also due to a set of well-finished animations but not at the levels of the most famous productions. The same feeling characterizes some moments and some mechanics, especially during the fights, perhaps to underline the lack of a truly painstaking finishing work. In any case, weapon in hand Jesse knows how to assert himself and the gunplay gives great satisfaction, avoidandor excessive simplifications and revealing an important strategic substrate right from the start. In fact, the fact that the service weapon needs time to reload forces us to plan attacks well, concentrating fire on a single target at a time, better if with a few headshots, and then move quickly or find shelter behind a wall or desk. There is a great interaction with the environment and this reacts to the violence of the clashes in a spectacular way, with sheets flying, pieces of concrete detaching from the walls and so on in a dance that becomes more chaotic as the enemies the approaches at our disposal to counter them are multiplying and in the same way increasing. Speaking of strategy, it is possible to equip only two configurations of the Service Weapon at a time, alternating them by pressing the square button on the controller and choosing, as mentioned, among five variants: a semi-automatic pistol, a shotgun, a light machine gun, a precision shot and an explosive one. The telekinetic powers, on the other hand, are all equipped at the same time, have an indicator that prevents their abuse and adds further variety to the action, creating lethal combinations to be applied above all to the most difficult opponents; for example those armored or capable of regenerating their energy are first hit with the throw of an object and then finished by shooting them. The interweaving of all these capabilities, which are unlocked as we progress through the story, builds a sufficiently large and varied repertoire, which becomes a pleasure to use against the forces of the Hiss without ever attacking head-on: enemy fire makes evil and Jesse does not recharge his health automatically, but he needs to collect the small fragments of energy left on the ground by his victims, on pain of game over. What happens in that case? It starts again from the last control point conquered, which gives the experience that ~territorial~ connotation in concert with the metroidvania-style approach to the new areas of the map, which can only be visited after obtaining certain items or clearance levels. It happens that the checkpoint may be a little far from where we died, but fortunately in the case of particularly complex sequences, the kills scored are memorized, forcing us only to go back a little way. Structure and enemies We didn't talk about metroidvania at random, because the Control structure uses that type of formula in a clear and abundantly declared way, urging us to explore the FBC headquarters and figure out how to reach certain areas, as well as handing us progressively higher grade cards to access to new locations. The control points we have just mentioned are often conquered by ~exorcising~ the influence of the Hiss and giving life to a very spectacular sequence, in which reality is restored to its natural form and we therefore witness walls and objects they reconfigure, a bit like some scenes in Inception or Doctor Strange. By activating them, it is possible to get all the health back, access the mods and upgrades for telekinetic skills, possibly change clothes (but only after completing the story) and, above all, use the rapid movement towards any other checkpoint. The campaign is made up of about ten main missions which are however accompanied by numerous secondary quests, tasks assigned to us by some prominent characters (such as the aforementioned Ahti the janitor, but also agency officers) that we can complete before or after concluding the central storyline, so maybe to leave something for the endgame. Proceeding straight ahead and allowing yourself very few distractions, you get to the end credits within fifteen hours, but as mentioned at that point there is still a lot to do. As for the enemies, however, the developers have made some interesting but somewhat controversial choices. The opponents that we will face in the main missions are always and in any case soldiers of the agency corrupted by the evil influence, and are divided into various types that include armored units, snipers, flying men with or without wheelchairs who throw everything at us, fast-moving energy spheres, explosive creatures, minibosses armed with grenade launchers or telekinetic barriers, and finally ~birds of prey~ capable of teleportation. Instead, to come across the traditional concept of boss you have to sift through the secondary quests, finding, for example, special objects that require a fight in an alternative dimension to be neutralized: an excellent modor to encourage us to return to the game, however taking something away from the main path. Playstation 4 trophies Control includes a total of 46 trophies plus Platinum. Some of the achievements are obtained simply by progressing through the story, for example by acquiring all the configurations for the Service Weapon and all the telekinetic powers, but ample space is also given to completing side missions, eliminating bosses , improving skills and of course collecting collectibles. Technical implementation and management The speech on the artistic direction goes hand in hand with the design of the scenarios and quests, because in this respect Control manages to do truly remarkable things. The guys from Remedy Entertainment have played with colors and shadows to create a great atmosphere and a degree of tension that constantly accompanies the exploratory phases, given that some areas remain under the influence of the Hiss and can therefore surprise us with the appearance of enemies out of nowhere giving life to new, furious clashes that adjust according to our level of experience and therefore always offer a consistent challenge. It's really, really a shame that we didn't want to invest in an Italian dubbing, considering that all the other main European languages are present in spoken form and the dialogues are not that numerous. The screen texts do what they can, annoyingly overlapping during the most chaotic sequences, but there are some minor blunders in the adaptation (see the C7 or P7 issue, which was the code name of the project when it was revealed by Sam Lake) . The interpretation in English by Courtney Hope and the other actors seemed solid and convincing to us, in any case, and is placed in the frame of a very well done and inspired audio sector, with a sometimes exhilarating soundtrack and a great reserved attention to effects. Finally, let's talk about the graphics of Control, which thanks to its geometries and a series of visually original solutions manages to give a surprising charm to the various areas of the Oldest House, especially those corrupted by the Sibilo and therefore ~reconfigured~ in a chaotic way. We go from aseptic and bright rooms to dark and disturbing corridors, always waiting for the red lights to appear, announcing the arrival of enemies; but there is no lack of different areas, between dungeons and tunnels, to increase the rate of variety of what is seen on the screen. Too bad for the absence of HDR support which would certainly have enhanced the excellent lighting management. After that, the fact that almost everything can be destroyed and blown up certainly adds spice to a technical realization which, precisely because of this generosity, gives rise, in the most chaotic and crowded situations, to slowdowns that are quite visible on the PlayStation 4. Are these issues that will be fixed in any update? It seems probable to us, and it must be said that at present they do not in any way affect the enjoyment of the experience. Control's graphics engine undoubtedly uses some reconstruction technique, clearly visible from the artifacts that can be seen on Jesse's hair in close-ups or during rapid motion blur-based camera movements, but the final result is excellent and also the characters appear very well done, although in some situations the distance is quite clearly perceived, in terms of pure and simple budget, between this production and the great exclusive Sony or Microsoft.", "date": "2019-08-26", "grade": "8.7"}