{"name": "Ion Fury", "ref": "https://multiplayer.it/recensioni/ion-fury-recensione.html", "text": "To fully understand Operation Ion Fury one must take a long leap into the past. Duke Nukem 3D sold 3.5 million copies. Today they may not seem like many, but in 1996, due to the production size of the individual games at the time, they were the sign of an immense success, also considering that the game was initially released only on PC, not exactly the friendliest of platforms due to piracy . However, the echo of Duke 3D was such that 3D Realms ended up joining Id Software in the Olympus of the pioneering software houses of the first person shooter genre. Since then, things have changed a lot: id Software was acquired by Bethesda and lost all its founders, while 3D Realms was sunk by its success and only returned to the scene in the last few years, getting back to doing what it was doing then: develop or produce, as in the case of Ion Fury, first-person shooters aimed at genre purists and nostalgics of that era. Classic FPS Ion Fury restarts from Duke Nukem 3D with a devotion that borders on fanaticism, to the point of exploiting the same graphics engine, the Build, which despite the years is still widely used by modders and maps, and to have a female Duke as protagonist, the charismatic and foul-mouthed Shelly ~Bombshell~ Harrison, who in her war against the transhumanist genius Dr. Jadus Heskel and his cybernetic forces created by enslaving the citizens of Washington D.C., spares no salacious jokes as she kills hundreds of enemies by running like lightning and shooting like a walking battleship. And it is precisely the speed of the action that is the strong point of Ion Fury ... because we simply are not used to it anymore. Over the years FPS have been deliberately slowed down to adapt to all types of audiences and control systems. Voidpoint, the development team, instead wanted to go back to basics, accelerating everything where possible. Entering a new area with weapons drawn and having to simultaneously attack and dodge the blows of the enemies, who rain down on us in copious amounts, is an experience that is now considered almost retrogaming as it is obsolete in the genre. Weapons are few compared to the latest in the industry, but they are all well made and different from each other and useful from the beginning to the end of the game, including the starting pistol which has a secondary attack that allows you to hit more targets with a single burst. Otherwise, the arsenal includes a machine gun with flammable bullets, a shotgun that converts into a grenade launcher, a heavy machine gun and more. Despite all these differentiators there is never any imbalance and you never lose control of what you are doing, so much so that we can state without fear of contradiction that some of the shootings of Ion Fury are among the best played recently, also favored by the continuous changes of pace made possible by the high number of enemies and by the more open map design compared to that of more commercial shooters. Level design The level design of Ion Fury follows that of its reference models in a creative and competent way. The maps are huge and allow different approaches, depending on how you want to play: you can overcome them by limiting yourself to killing enemies and collecting the resources that are around, or you can explore them from top to bottom in search of interactive elements and secrets . The latter are really many and are well hidden, so much so that looking for them is part of the fun offered by the game. in many cases they are limited to being secret areas full of ammunition and weapons, but often they also contain tasty quotes that will surely please those who already played in the 90s. In addition to the secrets, the need to explore is created by the game system itself: the resources available are limited and some extra ammunition is always handy, the enemies are really bad and make it necessary to constantly look for medikits or other healing items, like the ones you find inside some vending machines or kicking nerds. In short, many will recognize all those elements that made it interesting to spend hours looking around in Doom, Shadow Warrior, Duke Nukem 3D, Unreal, Quake and other similar FPS. The variety of maps is also great. In her adventure Shelly crosses the neighborhoods of a science fiction Washington made up of crumbling streets, neon-lit squares, seedy clubs, shopping malls, subway tunnels, a moving train and so on and so forth. All areas are populated by Heskel's robotic creatures and brought to life by explosions, collapsed areas and significant details that rendo unusually alive, although the technical side is obviously not the strong point of Ion Fury. Final considerations Ion Fury's problems are all related to some limits imposed by its very structure. In particular we think of the artificial intelligence of the enemies, not exactly brilliant, which is however masked by the fact that they have been placed manually by the developers in the maps. For the rest, discussing Voidpoint's work from a technical point of view does not make much sense, given that the developers have voluntarily chosen to use an obsolete technology which, obviously, cannot be compared with the current ones. Let's say that if you are interested in the game you know what you are getting into: certainly not something that will squeeze your video card. Ion Fury for the rest is a pure distillation of the 90s, starting from the protagonist and passing through everything else. If you are a lover of the genre, keep it in strong consideration.", "date": "2019-08-25", "grade": "8.8"}