{"name": "Oninaki", "ref": "https://multiplayer.it/recensioni/oninaki-recensione.html", "text": "Tokyo RPG Factory, the team set up by Square Enix to mainly develop old-school Japanese RPGs after the success of Bravely Default, continues to falter. After the decent I am Setsuna and Lost Sphear, we really hoped that Oninaki was the breakthrough moment. The premises were all there, also because finally the small staff of programmers seemed to have freed themselves from the need to cling to the nostalgia factor to take a different path, not necessarily innovative but still with greater personality. Unfortunately it didn't go as expected and Oninaki, whose review you read, although full of interesting ideas and goodwill, continues to highlight the main weaknesses of the Japanese developer, especially on the technical front. An underdeveloped story The incipit of Oninaki that we had the opportunity to play in the demo a few weeks ago gave us hope about the driving force of a game that belongs to a genre in which the story should be a factor of primary importance. Unfortunately, after a few hours, we realized that the Tokyo RPG Factory guys were unable to support the complexity of a very interesting idea but perhaps beyond their reach. In the world of Oninaki, the living have learned to mourn in the interests of the deceased: if the latter do not pass away and remain bound to the past by regret or remorse, they risk turning into lost souls without ever being able to reincarnate again. That's why the Watchers exist, the Observers who have the power to communicate with spirits and to travel freely from the world of mortals to its otherworldly counterpart, a sort of parallel dimension where the spirits of the recently deceased roam. Kagachi is an aloof Watcher who takes on the toughest cases thanks to his ability to bond with Daemons, wandering spirits brought in for combat. Oninaki recalls the Japanese myth of the Shinigami, the gods of death who help souls pass away, but chooses a brutal approach that defines a society terrified not so much of death itself, but of what it means for those who remain alive. Tokyo RPG Factory tries to explore these dynamics inspired by reality, between suicide sects and jackals who take advantage of fear to do their own interests, but within a very few hours it abandons any claim to social reflection to continue with a story that manages to be linear and disorganic at the same time when Kagachi, accompanied by a ghost child, finds himself hunting the Night Devil, a mysterious spirit who intends to plunge the world into chaos. The problem is that the canvas develops inconsistently, relying on summary characterizations and simply terrible dialogues. We don't know if the fault is mainly to be attributed to the English-language localization, but the rhythm of the dialogues and their snooty, if not more often childish, streak goes very badly with the drama of the story. The characters, who all speak somewhat the same way, seem to come out of a bad anime for teenagers, and the game sketches their bonds in a superficial way, diminishing the impact of some twists. Most of these dialogues aren't even fully dubbed, with the characters merely saying a few words in Japanese to contextualize the conversation, and the minimalistic but very good soundtrack does what it can to sustain the most important moments, embellishing especially the short cinematics in which Oninaki sports a decidedly more dynamic direction than the previous titles from the same developer. From life to death and back As for the appearance of Oninaki, it is important to start by saying that Tokyo RPG Factory is a developer with a tight budget, so you have to approach the game with a more cautious and considered mentality, without expecting who knows what technological marvels. In this sense, Oninaki is a title that does not disappoint, both in portable mode and on TV, thanks to a much more refined style than that used in I am Setsuna and Lost Sphear. The character design is delicate, almost ethereal, and the artists on the team have made excellent use of colors to distinguish the world of the living, warm and lit, from that of the dead, dark and disturbing. The palette is, in fact, what mainly distinguishes the two worlds. We can move from one to another at any time by pressing a simple key, but in fact it doesn't change the geometry of the maps or the nature of the enemies, practically the same both in one plane and in the other. Like many other ideas from Oninaki, this dynamic too could have given a lot ofmore. In fact, changing dimension has no strategic value and rarely affects gameplay. There are very few cases in which a puzzle must be solved using this power of transition: at most, we will find portals, in the world of the dead, which will transport us to another point on the map that is inaccessible from the world of the living. Some portions of the map, in the afterlife, will remain obscured - and lethal - until we have defeated a miniboss in the dimension of the living. The exploration of the maps, in practice, forces us to move from one floor to another if necessary, suggesting a possible backtracking to find chests or wandering spirits in the afterlife. Although it is not a real criticality, nor does it negatively affect an overall linear progression, we must admit that Tokyo RPG Factory could have expressed the undoubted potential of this mechanic in a much more interesting way. We would have liked to solve riddles and puzzles by moving from one dimension to another, perhaps using this power to dodge too strong enemies or discover new paths. Exploration, on the other hand, proves predictable and repetitive, although the maps in the final stages of the game tend to be significantly more elaborate. The disposition of the enemies, on the other hand, really leaves a lot to be desired. They appear in swarms in predefined points of the maps, are rarely aggressive and have one or two attacks per type. The variety is decent, also because most of the enemies are recycled from map to map with minor changes to appearance or colors. In this sense, considering the specularity of the maps and enemies, but also the simplicity of the polygonal engine, we are unable to explain the exhausting length of the uploads on Switch. Even the transition from one dimension to another, which should be almost instantaneous, sometimes freezes the screen briefly, and going Game Over to the bosses becomes an exercise in frustration not so much for the difficulty itself of some of them, which are quite tough even at the intermediate difficulty level of the three available, as for the need to wait several seconds before trying them again. The Daemon is in the details An action RPG may have an essential story, but if the combat system is fun, the cabin practically stands on its own. Unfortunately that's not the case with Oninaki, at least not entirely. While I am Setsuna and Lost Sphear were mainly inspired by great classics such as Chrono Trigger and Final Fantasy VI, Oninaki is above all reminiscent of Secret of Mana. As Kagachi we have to explore the maps and defeat hordes of enemies in real time, periodically facing some large bosses. Kagachi, by itself, can't do much: one key allows us to attack by ringing small combos, another to heal us with the healing potions that we find around and that we can carry in a limited number, although destined to increase over time. Any other combat capabilities, including the type of weapon equipped, depend on the Daemon we are using. Daemons are wandering spirits that Kagachi can manifest a bit like the protagonists of JoJo's Bizarre Adventure do with their Stands and to all intents and purposes represent Oninaki's ~party~. Kagachi can equip up to four different Daemons that will be associated with the left stick. Each Daemon confers, in addition to a specific weapon, subject to precise attack rules, also a peculiar ability which can be dodging, jumping, the ability to generate protective shields and so on. We can change the weapons of the individual Daemons: the enemies drop them generously but the quality depends on the level reached and most of the weapons are substantially identical, except for the random number of slots in which it is possible to set the Shadestones, stones that give various types of bonuses to attacks. Once the alchemist has been unlocked in the city, you acquire the ability to consume discarded weapons to upgrade one in particular: it's a very simple system that encourages you to fight enemies only to accumulate the resources necessary to upgrade the weapons you prefer. In this sense, raising individual Daemons is much more problematic. Each Daemon, in fact, has a tree of skills to be unlocked by consuming the specific stones that enemies randomly drop. Although some of them are generic and usable by any Daemon, while fighting using a certain Daemon we will only find the stones associated with that particular spirit. In short, the game encourages you to rotate Daemons to enhance them individually, but this approach proves to be particularly difficult due to the simple fact that some Daemons are... bit is, very bad, to put it mildly. The problem lies above all in the combat system, woody and not very reactive, but also in the design of the various Daemons and their attacks. The idea would be that some Daemons are better suited to fighting certain enemies than others: perhaps they inflict more damage or their specific skills, such as dodging or shields, guarantee a certain advantage against projectiles or particular attacks. In reality, however, newly unlocked Daemons only have one special attack - a maximum of four can be set per Daemon - while any other skill or bonus must first be unlocked by consuming the stones you get using that specific Daemon. In other words, there is an interesting combat system in Oninaki, which however only reveals itself after having invested a lot of time in each Daemon, perhaps grinding weaker enemies. A developed Daemon grants special bonuses every time it is summoned, allows special attacks to be canceled in normal hits and vice versa, further enhances the player when it reaches a certain percentage of affinity, an indicator in the lower left corner that increases as you fight and which determines the damage which Kagachi can receive and inflict once a certain threshold is exceeded. By identifying the most fun Daemons to play, Oninaki also manages to give some satisfaction, but you can only get there with time and patience, where a game of this type should conquer the player from the very first moments. It is clear that a combat system should not reveal all its cards right away, otherwise it would risk boring the player ahead of time, but Oninaki takes this idea to the extreme by granting the player an all too essential number of tools to make his way through the game, skills of dubious clarity in which to invest the points earned totally at random and extremely limited movement capabilities that you end up completely ignoring. Let's take for example Dia, the Daemon that allows us to jump and strike from above: well, this maneuver is so rigid and imprecise that using it is useless, if not harmful. Furthermore, most of the animations are so slow that they completely uncover Kagachi and make him vulnerable to enemies, so you end up trying the new Daemons and perhaps returning to the consolidated and already developed ones, in defiance of any strategy. Too bad, because a little more foresight would have been enough to make the whole system much more exciting.", "date": "2019-08-24", "grade": "6.5"}