{"name": "Hearthstone - Salvatori di Uldum", "ref": "https://multiplayer.it/recensioni/hearthstone-salvatori-di-uldum-recensione-espansione.html", "text": "When Rise of Shadows came out last April, we wondered if with the first expansion of Hearthstone's Year of the Dragon, the Blizzard-branded card game could recover from a stagnation that continued for most of 2018. After a natural settling in early on, the meta responded to Genn Greymane's early retirement and Baku the Mooneater quite positively, featuring a good variety of decks up until the time Saviors of Uldum, whose review you are reading, was revealed to players . Even if there was no shortage of classes that remained further behind the others in terms of available archetypes (see druid), in comparison to the last year, Hearthstone 2019 therefore started off on the right foot. Some problems of the game related to its chronological age continue to exist, of course, but Rise of Shadows seems to have opened a cycle of better inspiration, in which fortunately players can choose between different types of deck. Once the April rotation and the first expansion of the year have been archived, we just have to go and find out in this review if with Saviors of Uldum Blizzard's Team 5 will be able to keep the approval rating high. 135 new cards: Return of the Explorers As with the previous expansion, also for Saviors of Uldum the basic idea was to bring back some characters from the past. If with Rise of Shadows it was the turn of the Legion of E.V.I.L. to be reviewed, with this new package the League of Explorers is returning. Known in 2015, the adventuring party then included Brann Bronzebeard, Reno Jackson, Elise Starseeker, and Ser Pinnus, now returned in different guises. As for Dr. Boom and associates, these figures have been revisited to offer different dynamics compared to those we were used to, while retaining, as in the case of Ser Pinnus, his own action on hero power, or Reno's peculiarity of acting only in absence of duplicates in the deck it belongs to. Once the theme of the expansion was defined, Blizzard worked to bring into the inn one hundred and thirty-five new cards inspired by the setting of Saviors of Uldum, inspired by ancient Egypt. Between mummies, plagues and ancient gods, most of the new cards are linked to the dynamic Rebirth, quite simple to guess even starting from the name alone. Once dead, the minion with this ability returns to life with a single life point, retaining all other characteristics of the base card. Coupled with other skills such as Rush (as in the case of the Restless Mummy or healing in that of the Defender of Khartut), the possibilities offered by Rebirth open the door to interesting game strategies. The new mechanic chosen for Saviors of Uldum certainly does not shine for originality, but at the same time once used it does not struggle to prove effective. While waiting for the meta to promptly prove us wrong over the next few weeks, the functionality of the Plagues seems a bit limited to us: these are cards available only for some classes, whose effect can take place on the minions present in the game, or even on the players themselves. For example, the shaman can transform all minions into random murlocs, while the warrior can destroy all damaged ones. On the other hand, the arrival of the new Mission-type cards was much appreciated right from the start, certainly not an absolute novelty either: shortly after they were unwrapped, the druid quest immediately started off strong, able to obtain the Fandral Staghelm's characteristic (activate both card chances with Choose). Still speaking of the meta, even if it is obviously too early to speak definitively, in recent days we have seen the various highlander decks impose themselves in an overbearing way, with particular attention to hunters and mages. Zephris the Great Helping the establishment of a certain type of deck was the arrival with Saviors of Uldum of Zephrys the Great, a one-of-a-kind card. Provided we don't have duplicates in the deck, in addition to being a 3/2 elemental, this genie of the lamp always offers us the possibility to choose between three cards that the artificial intelligence deems the most suitable for the game situation in which we find ourselves. Do you have an opponent with six life remaining? Zephrys might hand you a nice Fireball to finish the game. Or give you a Bengal to get rid of too many secrets played by the opponent, or even suggest a Harrison Jones to wipe out the other's weapon. The card is also good when played in curve with its two cost, with the possibility of obtaining an Animal Familiar to drop on the following turnssive. While Zephrys' dynamic may no doubt sound like ~broken~ to some, and we can understand why, considering you don't need to have duplicates in your deck to activate this card, we felt it added more to the game than it subtracted. Going to look at the purely aesthetic aspect of Saviors of Uldum, the design of the cards naturally follows the theme chosen for the expansion. Thus we find above all mummies in all sauces, accompanied by the new visual effect with which it is easy to identify the cards linked to the dynamic Rebirth. The design of the secondary cards is revealed as usual a little more sluggish than the ~top players~, with captivating designs and special animations. Zefris also proves to be the protagonist from this point of view, with an effective entrance together with its lamp to satisfy our desire for the perfect paper. Finally, moving on to the adventure in single mode, the strategy adopted by Blizzard for Saviors of Uldum does not change compared to that of the latest expansions. The new adventure will be called Tombs of Terror and will arrive only in September: its dynamics should be based on the same dungeon run type seen in the most recent expansions, taking part in the League of Explorers to face the Legion of M.A.L.E. and his evil plans.", "date": "2019-08-13", "grade": "7.5"}