{"name": "Metal Wolf Chaos XD", "ref": "https://multiplayer.it/recensioni/metal-wolf-chaos-xd-recensione.html", "text": "There was a period, during the early 2000s, in which Microsoft was constantly trying to forcefully enter the Japanese gaming market. This trend, which began with the very first console of the Redmond house, then continued even during the first years of their second generation, then going to be almost completely lost. During that period, however, titles like Ninja Gaiden on the one hand, crazy operations like Metal Wolf Chaos on the other, were desperately trying to spread the love for Xbox. With these premises, Microsoft worked closely with From Software, a studio now known almost exclusively for the invention of souls-like and for its current president Hidetaka Miyazaki. At the time, however, the Japanese team was famous above all for Armored Core, a particular series linked to Japanese mechas that constantly tried to reach new simulation heights, in addition to those of fun. Based on this experience, the ~caciarone~ and American wire Metal Wolf Chaos was born. A game always based on robots but strongly rooted in the culture and imagination of stars and stripes, with an important patriotic vein and a writing so crazy as to make those madmen of Devolver Digital raise their antennas. The most absurd thing about the project turned out to be the failure to arrive in the West, thus remaining relegated to the Japanese market. Things have changed these days: on the one hand it's finally possible for everyone to play it in a revised and corrected version; on the other hand, the introductory price is as competitive as could be expected, considering that the original copies cost a fortune. Mr. President The narrative premise of Metal Wolf Chaos is already enough to make anyone accustomed to madness like the Asylum films roll their eyes. During the 21st century, US President Michael Wilson is forced to deal with a coup d'tat perpetrated by Vice President Richard Hawk. The media throw fuel on the fire, which a little deceived, a little deceiving, often take sides in favor of the bad guy, plunging all of North America into chaos (sad choice of words). It is the current president who has to deal with this situation, who takes possession of his own mech renamed Metal Wolf and sets off to save his great country. With these premises and with an infinite series of crazy situations and dialogues, an over-the-top plot develops, but capable of eliciting more than a genuine smile, always resulting fresh and never falling into embarrassment. What is most surprising is the ability to be able to balance every single element in such a grotesque context that it is difficult to communicate to the public. However bizarre it may be, we assure you that for directorial and writing quality, Metal Wolf Chaos XD will be able to give you joys and this is all that is needed. Of course, all provided that you can digest the total lack of Italian. The gameplay with the robots It is clear that however interesting the setting may seem, all this must be combined with successful and fun gameplay, even more so considering the genre to which it belongs. Metal Wolf Chaos XD represents in all respects the stereotype of the third-person shooter, with free management of the view and the possibility of modifying and enhancing one's arsenal. The Metal Wolf is in fact capable of simultaneously equipping a dozen weapons per arm. With the push of a button, you can physically open a weapon wheel on your robotic limbs and scroll through the guns you've brought on a mission. While there are initially a handful of them, with the progression of missions, field research of technology, and a development system similar to that adopted by later Metal Gear Solid: Peace Walker (and more recently by The Phantom Pain), it is It is possible to dramatically increase your arsenal, touching the hundred, each one upgradeable for a certain amount of times. It is easy to notice some stylistic features of that progression that will take hold of videogame production in the early 2000s, however marked by the lack of an open world, or in any case of a narrative linearity. Here the title unfolds following a series of missions separated from each other and can often be tackled in the preferred order. Each of these brings with it a quantity of unlockable and collectible objectives, as well as a score that will be based on a series of values maintained by the player during the operation. In fact, it is possible to chain different actions, as well as jump and even use a thruster which, once its thrust is over, will weigh onl overheating of the mech and therefore on its health points. To add a pinch of pepper there is a further indicator which is recharged by defeating opponents and which, once filled, allows you to unleash a furious sequence of shots with all weapons equipped simultaneously. It is obvious how the gameplay, however frenetic and fun, stops at these main stylistic elements which for 2004 are not even too immature. Obviously not all the mechanics have aged in the best way and repetitiveness remains the order of the day; but this from our point of view does not cancel the visceral fun experienced in dusting off a title so far back over the years, but above all so far away as a game possibility. The remastered From a technical point of view, the modernization work of Metal Wolf Chaos can be considered successful. The possibility of even reaching a 4k resolution, having added support for 16:9 and updated the entire graphic system in general, already represent an excellent incentive to purchase. It works differently with artificial intelligence, which unfortunately collides with a level of attention that is not even exciting at the time, and which today, in most cases, is really difficult to digest. Totally helpless soldiers, unscratchable structures to be destroyed and sponge bosses are some of those elements that make Metal Wolf Chaos XD decidedly unacceptable from this point of view. To be honest, it should also be considered that it is an easy game in any case, in which dying is challenging and which only desperately tries to entertain and this it does in the right way. On the other hand, titles such as Left Alive also arrive on the market, which present themselves with wrong marketing and gameplay fifteen years back, to which Metal Wold Chaos XD still teaches something today.", "date": "2019-08-11", "grade": "7.5"}