{"name": "Assassin's Creed Odyssey: Il Giudizio di Atlantide", "ref": "https://multiplayer.it/recensioni/assassins-creed-odyssey-il-giudizio-di-atlantide-recensione.html", "text": "Assassin's Creed Odyssey concludes its adventure with The Judgment of Atlantis, the latest DLC included in the Season Pass of the Ubisoft title and the subject of this review. After dealing with Persephone and her Elysian Fields, as well as with the cruelty of Hades in the kingdom of the same name, the protagonist of the game decides to follow Poseidon and cross the gates of Atlantis, the legendary city which in Aletheia's simulation stands as the cradle of civilization, the place where the Isu created man and where a bitter conflict takes place between the two species, divided by too many differences yet surprisingly similar in vices and weaknesses. It is precisely to try to heal this fracture that we were chosen: Poseidon has followed our events and believes us capable of using the wisdom gained from a thousand battles and confrontations to play the role of Dicaste of Atlantis. What does this job consist of? Once in possession of the knowledge of the Isu, which can be assimilated through interaction with specific devices scattered throughout the map, we will be able to access any place in the city and understand who is acting in the right and who is not, deciding the fate of citizens and rulers. Atlantis, map and structure The protagonist of the DLC is obviously the lost city of Atlantis, which in this simulation is shown to us in the final stages of its heyday, just before its destruction. Structurally, the map is made up of concentric circles, joined together by raised bridges or at the level of the water, which surrounds them and can be navigated thanks to traditional boats. We are therefore talking about a very different scenario from the mountains of the Elysian Fields and the valleys of Hades, which can be explored at first with a little difficulty due to the complicated overlapping and passages to be overcome necessarily by climbing the walls and perhaps exploiting the creepers, which make the appearing for the first time in the game, to then call the trusty steed and proceed quickly towards the goal of the turn. The architectures are typically Isu and therefore take up the design that we were able to appreciate in the various ~caves~ of the Assassin's Creed series, which means that even the synchronization points look like modern towers, quite anonymous and often identical to each other. There are undoubtedly several very evocative landscapes, enhanced by a lighting system that makes good use of HDR but which in several points produces blunders that are difficult to miss, with the system that hurries to modify colors and reflections to make the most of the aesthetics of the area in which we find ourselves. Unfortunately the very long loadings in case of rapid movement and/or game over have not changed compared to the basic experience, although the map of Atlantis is much smaller than the entire Greek world: this is undoubtedly an aspect on which the developers they will have to work in view of the next chapter, which fortunately will run on platforms equipped with very performing SSDs precisely as regards the speed of loading the assets. Story, gameplay and missions The plot of The Judgment of Atlantis starts from interesting assumptions, but cannot count on the multiple ~emotional~ hooks of the previous DLC, which saw the return of some important characters, nor does it manage to stage memorable situations. At least the authors didn't wrap themselves up like in Campi Elisi, when one had to say everything and the opposite of everything without the possibility of maintaining a minimum of dignified coherence, first siding with one faction and then with the other: better then a less incisive story than a completely crazy one. However, even this productive aspect of Assassin's Creed must take a clear step forward: Ubisoft needs screenwriters capable of enhancing all aspects of a story and not only producing fascinating incipits, but above all it must equip itself with directors capable of making the most of the more intense moments, which are often represented without the right timing and the right attention: an unprecedented waste. In the end, therefore, only a very substantial challenge remains, with a series of fortresses to be conquered to obtain the Isu knowledge we mentioned earlier and the pieces of a new armor, that of the Dicaste of Atlantis. However, these are not the only upgrades on which we will be able to count in this DLC, which like the others improves one of the character's special abilities, in this case the Fury of Ares: by activating it, Kassandra or Alexios light up with golden light and inflict damage consistent even to the strongest opponents such as commanders, who are otherwise really complicated to defeat. The missions generally reflect the same pattern, with some exploratory assignments and a possible love affair which, however, can easily end up in a frustrating stalemate. Final considerations Is Judgment of Atlantis Worth Buying? From the point of view of the Season Pass to which it belongs, certainly yes. It is a pity that the authors of Assassin's Creed Odyssey have not managed to raise the level of the narrative and introduce actual novelties with the DLCs, but in any case we are talking about an extraordinarily thick post-launch support, which includes in the price not only six different campaigns with many new characters to discover, but also the collection of Assassin's Creed III Remastered. In the end, the story of Layla Hassan also proceeds in the present tense, with an important and ominous event that will inevitably have consequences on the future of the protagonist but, even here, a somewhat defeatist approach, evidently the result of the desire not to rock the waters too much to protect users who stopped at the original campaign and will resume events only with the next episode of Assassin's Creed.", "date": "2019-08-07", "grade": null}