{"name": "Elune", "ref": "https://multiplayer.it/recensioni/elune-recensione.html", "text": "Elune, as you will discover by reading this review, does not invent anything new: the Gamevil-branded title reuses the traditional formula of gacha-style strategic RPGs, i.e. with a summon system to draw new characters, and involves us in a fairly long campaign, which it unfolds within seven different settings and is accompanied by a couple of alternative modes that also prove to be useful in terms of grinding. The freemium aspect of the experience actually becomes prevalent starting from the third map, when you meet the first opponents that are difficult to beat: this forces you to retrace your steps and replay some missions or, as mentioned, try your hand at the Special Event modes and Challenge in order to obtain the rewards necessary to strengthen your team. The strength of the game undoubtedly lies in the abundance and quality of the characters, who despite being often stereotyped are really very beautiful to look at, with a generous fanservice in the case of female figures and, in general, a mature and convincing style , which is further highlighted by the goodness of the animations and some cutscenes that accompany the salient phases of the story (forgettable, in any case), in particular the opening. Summoning them therefore turns into a quite exciting event, and it is precisely on this that the developers have aimed to monetize: although it is possible to easily obtain new fighters even for free, the paid summons are the ones that guarantee the best results, not to talk about the very expensive ability to make a new selection if the drawn character is not to our liking. Fortunately, this is the only catch from which it is necessary to beware, since for the rest there are no particular constraints. Gameplay and structure As mentioned, the Elune formula starts from the evocation of the characters that are used to make up a team, with two lines (advance and rear) that give life to different strategies and add some depth to the gameplay. For the rest, however, everything is abundantly familiar: although the view on the battlefield often changes, the turn-based combat system gives life to the usual situations, indeed facilitated by a very immediate touch control system. The selection of the active character takes place on the basis of the characteristics, therefore our task will only be to choose one of the available attacks and touch the target of the moment to hit it. Naturally, the presence of characters belonging to different classes can change the face of the clashes, and it is always a good idea to have a healer in the team who can treat the wounds of his companions when needed, or someone who can increase the enthusiasm of the formation to make their more effective moves. The selection we dealt with seemed quite varied and interesting to us: a sword-wielding warrior on the front line, flanked by an agile but effective female fighter, and behind a healer, a sorceress with ranged attacks and a sort of ninja fast and deadly. The continuous unlocking of weapons, objects, coins and new characters allows individual fighters to be strengthened through traditional mechanisms, such as the fusion of useless cards and the equipping (even automatically, if necessary) of more effective tools. Nothing original, we reiterate, but it is a system that is placed in the perspective of an extraordinary technical realization, which underlines how much Gamevil has invested in the creation of this title.", "date": "2019-08-01", "grade": "7.5"}