{"name": "Mirador", "ref": "https://multiplayer.it/recensioni/mirador-recensione.html", "text": "Sauropod is a young Canadian developer who recently released Mirador, his second title inspired by great classics such as Bastion and Magicka and distinguished by a surprising feature on paper: in addition to defeating enemies, it is possible to create your own to give a hard time to the other users. Put this way it would seem like the forbidden dream of every dungeon master, but the truth is that the product launched as ~finished~ is, to say the least, incomplete. It starts from a citadel, a hub where you can meet up with other people and where there is a forge where you can forge your own sentinel, an aspect that we will explore later in the review. The player has the possibility to choose the alter-ego between a dog and an anthropomorphic crow: note that the difference is purely aesthetic because there is no inventory or other way to customize the avatar. As you can understand there is not much to do to prepare for battle, so you immediately turn to a portal that leads to another level ... absolutely useless, since the only activity to be carried out in the Obsidian Gate is to which involves opening a further portal that leads to one of the two regions of Mirador. If you think you're practicing with hordes of opponents in the perfect Titan Quest style, you're very wrong because, although the maps are quite large, they have a single enemy (the sentinel) placed in a central arena. That's right, there's nothing to do but knock the golem down. Much easier said than done, given the subhuman level of difficulty. The bosses have a health bar that is about fifty times higher than the player's, which is why it would be advisable to try the feat in the company of some allies. Lots of problems You can make light or heavy attacks (depending on the pressure on the joypad key), parries and throws of blunt objects. A fundamental function is that of the shot which allows you to move at a safe distance to avoid being hit by those spells that cannot be blocked: however it must be used sparingly because the charges are limited and it takes some time before the energy bar fills up again. Conceptually, therefore, the combat system is reminiscent of that of the various Dark Souls, a pity that the title of Sauropod is full of problems. The most serious is probably the lag: although you almost always play solo due to the lack of allies, the client still connects to the developer's servers which have often proved to be unreachable or terribly slow in response times, making it effectively unusable. When the hardware part works you come up against a level of difficulty, as written above, unacceptable even for the most skilled in using the pad. And for those who only use a mouse and keyboard? Well, know that, although Mirador was made exclusively for Steam, the classic input systems used by the ~master race~ are very badly supported: certain menus cannot be reached using only the mouse, the pointing system is bizarre, the keys are not reconfigurable. What does not change, regardless of what you use, are the response times of the commands: simply slow (this must be largely due to the latency of the servers we complained about above). If you manage to get the better of an opponent (which happened to us a couple of times) then there is no gratification that pushes the player to continue. In fact, as mentioned, there is no progression of the alter ego and the only rewards are ~pieces~ with which to build even more lethal sentinels. Few solutions So let's focus on this aspect on which it seems to us that the programmers have spent too much energy, leaving out the true core of the game. In addition to the physiognomy of the boss, its tactics can be defined; the software verifies that the rules of engagement are respected and validates the rider. Once the work is finished, you upload it to the game servers and wait for it to reap a few victims, thus obtaining other upgrades with which to make it even more invincible. Unfortunately, what should be the characterizing element of this MOBA is not at all engaging and this leads to the collapse of the structure it is supposed to support. Technically, the vector style can be liked, even if it risks getting bored quickly, but as it should be clear by now, what is missing is the contents. The title is still under development as evidenced by the presence of unused areas; moreover it is not acceptable that the whole experience is limited to a single repeated clash, with different nuances, ad infinitum. The bugs are countless: in a game that we managed to win, we were actuallyor left without energy; in others the attacks did not hit the sentry. Loading times would be unacceptable for traditional disk configurations, let alone a handsome Samsung 970 EVO used in the test.", "date": "2019-07-30", "grade": "3.5"}