{"name": "Sky: Figli della Luce", "ref": "https://multiplayer.it/recensioni/sky-figli-della-luce-recensione.html", "text": "Pirouetting through cumulonimbus clouds and gliding down green hills, the iPhone I hold in my hands is hot from too much exertion. Yet no matter how hot it gets, because in the dry summer of the App Store, Sky: Children of the Light is as pleasant as a refreshing breeze. In a period in which playing with a smartphone or tablet means increasingly pigeonholing colored icons in yet another match 3, dodging the predatory strategies hidden in free to play based on famous licenses or simply playing Fortnite, Thatgamecompany has brought up mobile devices an original and refined artistic experience, which would not be out of place on PC and consoles. Anyone who knows the Californian team's past will find influences and references to his previous works in Sky, from Flower to Flow, passing through the less famous Cloud (student project of the founder Jenova Chen), up to obviously the acclaimed Journey. But Sky is not just Journey in the clouds, and unlike the developer's other games it is a title in which the relationship with other players is at the center of the whole experience. Sky: the video game Sky is an exploration game that has two souls. On the one hand there is the more playful part, a journey towards a destination not too different from the one experienced in Journey. If in the 2012 game the final destination was a mountain on the horizon, this time the goal is to reach an imposing castle surrounded by a storm. However, getting there requires you to explore each of the areas of the world in search of spirits to save and fragments of light to collect, thus enhancing your cloak to fly higher and reach new territories. Each location is full of small and simple puzzles to solve, which most often ask the player to light a series of candles or find and follow spirits. The focus is once again all on exploration, and if some hostile areas can communicate a strong feeling of danger, there are no weapons to take up or bosses to fight. Just like in Journey, the mythology of the world is not explained directly, and must be intuited through graceful cutscenes and mysterious signs hidden in caves and sanctuaries, while the journey is punctuated by continuous pauses in which one pauses to admire breathtaking views and immortalize the most fascinating moments thanks to the photo option integrated by the team. Everything leads to an epic final arc that almost clashes with the rest of the work in terms of tones and mechanics, but which is based on a strong theme and rewards those who play with a grand finale. When it works, Sky is a captivating and relaxing game, in which to hover in the clouds, dart across green plains or play hide and seek among the trees of a forest, all accompanied by the solemn music composed by Vincent Diamante, who excellently picks up the heavy baton by Austin Wintory. But Journey was a title born on consoles and designed to be enjoyed with a controller in hand, and this clear spiritual heir often feels cramped in the small tactile screen of a smartphone. It's almost a crime that such a beautiful and stylish experience is frequently ruined by abrupt slowdowns (regardless of the selected graphics setting), while the touch screen controls have been the cause of some of the most frustrating moments of the whole experience : when I got stuck in the clouds without being able to find an escape route; when I slipped from a very high platform forcing me to do the whole path all over again, or even when I hit an obstacle in full because my avatar didn't want to know how to jump. Both configurations of controls (one or two hands) prove to be unsuitable especially in the advanced stages, when you need to perform more precise movements to move on small platforms or move with the right timing, and there is no doubt that the experience will be more more enjoyable when Sky inevitably comes out on PC and consoles. Sky: the social experience The second soul of Sky lies in its multiplayer component, and in Thatgamecompany's idea of wanting to create a sort of social hub to allow everyone to play together, interact or chat. It is possible to tackle parts of the journey together with complete strangers, friends or family, and the game is designed to reward all people equally in the same instance, so as to avoid any kind of competition or resentment. The interaction between the players takes place through a curious ritual: at first the other people appear all the same, gray faceless ghosts wandering in the game world; in order to reveal their aesthetic aspect, one must approach and unite one's candles, while to make a friendship one must sacrifice one. From moment that candles are one of the main currencies useful for unlocking new animations and aesthetic elements, it is obvious that you will tend to make friends only when you really want to deepen the interaction with someone. Unique is the way you can hold another person's hand and lead them (or be led) around the different areas. Having someone else drive you is like going on autopilot, trusting the other person and enjoying the show, and it's probably the only way you can share the ride with someone who is too scared to use the touch controls. The game provides the possibility of traveling with a friend, and at any time you can teleport to the exact point where the other person is; yet, it will be because the game is still immature, all too often it has happened that our character and that of our friend were suddenly separated or were unable to meet. However, one of the most interesting systems is that linked to communication between individuals, who in addition to emitting a small sound can perform an increasingly rich repertoire of animations, from clapping to bowing, from yawning to exultation, passing through expressions of approval or denial. Saving the spirits allows you to unlock new emotes, new poses and new tones of voice, with the result that the more you play, the more expressive you can be and communicate emotions. You can spend candles to strengthen your bond with a friend, unlocking animations that allow you, for example, to hug the other person or give them a high five. Some places seem to have been designed specifically to be shared in small moments of sociality, perhaps when we gather around a bonfire, when we compete in speed races along the slope of a mountain or skate on the surface of a frozen lake. It's an important evolution compared to Journey, but one that risks and goes one step too far by including a text chat. In the main hub and in some meeting places it is possible to sit next to another person and start chatting, somewhat breaking the magic behind the non-verbal communication on which much of the game is based. Many people avoid chat benches altogether, and it's understandable. During one of my first experiences I met an extremely sociable player, with afro hair and a harp on his back. After a few minutes spent flying, twirling and hopping in company in search of spirits, I decided to pluck up the courage and sit down on one of the benches in the hub to have a chat. Trying to role-play a bit, I complimented his hair, and asked him if he could play. He, after staring into space for an eternity-long instant, answered me with the emoji of a poop, got up and walked away. Scenes like this have always happened in any online game, mind you, but they clash infinitely more in such a sophisticated title and in which one is asked to spend time and resources to enrich one's non-verbal communication skills. Thatgamecompany has made sure to include all the tools necessary to report misconduct or inappropriate messages, but nothing is more dissonant than a fairytale landscape in which a little man in a cape exclaims ~Beta is 4 real pl4yers!!!~", "date": "2019-07-22", "grade": "8.5"}