{"name": "Defector", "ref": "https://multiplayer.it/recensioni/defector-recensione.html", "text": "It feels strange to play and finish Defector, an Oculus exclusive, so a few months after having experienced Sony London Studios' Blood & Truth, another exclusive, but in this case of PlayStation VR. It has a strange effect because they are essentially very similar games: imagine them as wood from the same tree, but each with very different veins. While the Sony game unfolds like a crime story with an unabashedly British taste, Defector puts us to grips with a very high-octane spy story. Both games basically try to do the same thing: bring back the no-nonsense shooting of the various Time Crisis, House of The Dead, Virtua Cop. What we once would have called ~shooter on-rails~, or on tracks, but which in virtual reality acquire depth and a renewed ability to leave us speechless, especially when done well. Defector makes us move freely in all its levels, but the spirit is unmistakably that. This new exclusive Oculus, whose review you are reading, superbly stands up to Sony production, becoming in no time at all one of the best exponents of the genre, as well as being one of the few that stands out on Oculus also through the opulence of the production who supported its development. It is clearly seen that Defector is an internally produced game, an irrefutable sign of a Facebook that has finally understood the importance of dictating pace and line, pushing its hardware with strong experiences. In short, Zuckerberg's company for some time now seems to have finally understood that you can't live with only third-party developers, and that if there is any giant who can press the accelerator, it is him. . Fists, guns and... From its exclusivity, Defector benefits in every possible way. The only aspect in which savings have been made a little is in the longevity which stops at five or six hours of play, which is the standard for similar experiences. The game clearly gives the best of the best between the explosions, while it immerses the user in the whistling of bullets or allows him to look out from a hole in the fuselage of an aircraft with a machine gun on his shoulder, and thus be urged to take down a entire fighter fleet like not even the best Schwarzenegger. The melee is really effective, where we will be called to block with one or both arms, and to respond with forehands, hooks and backhands. It makes you sweat, it makes you laugh, #it's hard. The game also reserves some rather interesting surprises in this regard, so much so that with a cool head we ended up preferring fistfights rather than shootings. With a weapon in hand, Defector in fact proves to be less precise than the controllers it supports: thanks to the context and the explosions you get used to it quickly, but much better could have been done on a technical level to make the registration of the shots more satisfying. After all, Oculus can count on more advanced controllers than the PlayStation Move, yet it is immediately noticeable that the shootings have not been built with the same care and experience as in the rival product. Despite everything, also in this case Defector does its job very well; this game doesn't focus entirely on shooting, which the London Studios product does. Defector immediately puts on the plate a much wider scope than Blood & Truth, not so much in the action sequences, but in that outline which here takes on much more intriguing nuances, thanks above all to a dialogue system that certainly wants to appear deeper and complex than it actually is, but still giving the experience a greater variety of situations and challenges. It is thanks to the dialogues that we will be able on several occasions to choose crossroads that will lead us to new and unexpected action sequences, or to test ourselves with investigative phases. The system doesn't always work properly, and sometimes you find yourself trying in bulk looking for the right combination of question and character, yet even in its worst moments this aspect continues to give consistency to the gameplay. Replayability is not lacking thanks to the crossroads structure, but we would have liked a few more secondary challenges. Graphics and technical department Technically Defector gets along extremely well, however leaving the side exposed for an unexpected aliasing which fortunately does not damage the fun. We played it on Oculus Rift Sle and the writings appeared extremely clear and although there is a lot of text - very fun to read the different biographies of the characters we will meet, and it is also useful in the dialogues - Defector always remains extremely readable and comfortable, sequences of action or not. Graphically this game can also count on a decidedly high numberof effects which, combined with good physics, give the adventure a further layer of spectacularity that we absolutely needed. Too bad for the somewhat stiff facial animations, which often abruptly report ~down to earth~.", "date": "2019-07-19", "grade": "8.0"}