{"name": "God Eater 3 per Nintendo Switch", "ref": "https://multiplayer.it/recensioni/god-eater-3-nintendo-switch-recensione.html", "text": "God Eater 3 also arrives on Nintendo Switch and we wanted to approach this review by tackling the many missions of a single player campaign in a fast and furious way that from the point of view of numbers and structure has nothing to reproach itself for, although it remains anchored to an outdated conception of the genre. Thanks to the experience gained on PS4, we were able to save most of the cutscenes, carry out the upgrades that we knew were more effective in battle (again ignoring, practically in full, the transformation of the God Arc into a firearm: use it during a fight it is too cumbersome and very unrewarding) and ringing assignments after assignments while growing our team of Adaptable God Eaters (GEA) thanks to the unlocking of new and more powerful skills. Replaying the title in this way, naturally creating a different character (this time a girl, however always equipped with a lunar blade: the best compromise between power and speed of execution), was actually pleasant and contributed in part to letting the the sense of disappointment that had overwhelmed us when we had to deal with the PlayStation 4 version of the game. In general, God Eater 3 fits well with the nature of the Nintendo Switch: used on the move, it stands as a valid alternative to the traditional Monster Hunter but, as written in the first review, it does absolutely nothing to shake off largely outdated mechanics and solutions. history and structure The lore of God Eater is particularly fascinating: we find ourselves in a post-apocalyptic scenario, a world devastated by the sudden appearance of the Oracle Cells and enormous creatures, the Aragami, composed precisely of this mysterious energy. The survivors have locked themselves up in fortified cities, while paramilitary organizations explore what remains of the big cities aboard huge caravans, trying to clean them up from the presence of monsters using a body of special fighters, the God Eaters. However, they are real slaves, young orphans who risk their lives for unscrupulous corporations that exploit their abilities, sending them into battle against the Aragami and replacing them in case of death with other recruits. This dystopia is told quite effectively throughout the series, although even in the third episode there are many now cloying stereotypes linked to a certain Japanese tradition, which unfortunately undermine the enjoyment of a narrative sector otherwise full of potential. The protagonist of the game must be created using an editor that is simple to use, with many adjustments and alternatives, and this translates into the unfortunate choice of having a mute character in the midst of a series of supporting actors who definitely love to talk. In short, what Bandai Namco proposes to us with God Eater 3 is a decidedly impervious narrative path, adapted to a structure that unfortunately does not even try to deviate from the original formula in the slightest, building the good duration of the campaign (which keeps you quietly busy for over twenty hours, doubling this value if you also dedicate yourself to secondary tasks) thanks to trivial expedients, first of all the reuse of the same maps for dozens and dozens of times, simply increasing the enemies inside them. The presence of the cooperative mode for four participants, locally or online, adds a pinch of strategic value to the challenges, but only on condition that you are in a minimally organized team: the artificial intelligence that usually controls our expedition companions works well and immediately rushes to our rescue when opponents knock us down, other users may not do the same. Gameplay and technical realization On the gameplay front, something has changed compared to the previous chapter, and in fact it is possible to approach the fights in a more dynamic way, using a quick shot (which consumes stamina, of course, but not so much) to quickly reduce the distance from the opponents and a set of special maneuvers that include choral moves, devastating combos and a shorter version of the ~bite~, i.e. the transformation of the God Arc into a beastly mouth with jaws, essential for obtaining precious loot from the corpses of killed Aragami and then using it, together with the collected money, to create or upgrade pieces of equipment. However, what would have been necessary to do, even in defiance of some of the dogmas that regulate the action survival genre, was a complete rethinking of the controls that could enhance one of the peculiar aspects of the series, namely the possibility of transforming the enormous blade that the God Eaterswield (be it a sword, sickle, hammer, or any other shape) in a rifle or shield via the press of a key. As mentioned above, in fact, resorting to the dynamic nature of the God Arcs turns out to be useless as using the viewfinder is quite cumbersome, hitting the Aragami with projectiles produces very little results and even activating the shield is an eventuality that you will only be forced to few times. Making these possibilities much more immediate, for example by activating the fire mode via the left trigger and assigning the parry to a single key, in concert with a greater incisiveness of these actions, would certainly have served the purpose. As it is, the experience of God Eater 3 does nothing but mimic the most classic of Monster Hunters, without asserting its differences and losing bite, as mentioned, due to the few scenarios that form the background for the missions. From a technical point of view, however, the Nintendo Switch version appears much more on the ball, and ironically what were the limitations of the game on PS4 almost turn into merits, in the face of certainly lower expectations. The developers had to give up something in terms of resolution, texture quality and above all effects: this is clearly visible even to the naked eye and the pop-up applied to some elements of the locations, together with dithering-style transparencies, demonstrates how little efforts have been made on this front. However, the performances hold up very well, which is the most important thing: both in docked and portable mode the frame rate appears solidly anchored to 30 frames per second, and this fortunately does not detract from the solidity of the combat system or make some sequences too chaotic. Portability, as already mentioned, also represents a very interesting extra for the type of experience proposed.", "date": "2019-07-18", "grade": "6.5"}