{"name": "Dragon Quest Builders 2", "ref": "https://multiplayer.it/recensioni/dragon-quest-builders-2-recensione.html", "text": "It seems that the titles of the Dragon Quest series do not want to know about landing in the West without first having been courted for several months. It is a bit the story of Dragon Quest XI, and also of the very current (at least in Italy) Dragon Quest Builders 2, sequel to the very popular first chapter released last January 2016. After more than three years, the very curious spin-off is back on current generation consoles, but not all: from 12 July 2019 it will be available on PlayStation 4 and Nintendo Switch, while fans continue to clamor for at least one PC version (and this since last December 2018, when the game was released in Japan). Now, two types of people are going to read this review. The first are those who played the first Dragon Quest Builders at the time, and who therefore can't wait to find out whether or not it is worth investing another 60 euros in the new chapter: how innovative is it? And above all, from what points of view? The latter, on the other hand, have played a few Dragon Quests from the main series along the way (maybe even all of them!) and wonder how much good an encounter with the improbable Minecraft could have done for the series. Let's start then, because there are many things to say: we played the title on PlayStation 4. Plot, first person, progression Dragon Quest Builders 2, like the previous chapter, is an action RPG heavily contaminated by sandbox mechanics. In reality, as in many other similar cases, the genre labels leave a little the time they find, because the game draws elements from many different productions, intelligently amalgamating them in what remains basically a deep, colorful and accessible sandbox , but which only partially matches a title like Minecraft from an overall point of view. We will talk about this above all later, while here we will limit ourselves to briefly recalling the plot of the game and the first hours of the adventure. Dragon Quest Builders 2 begins from the conclusion of the previous chapter and especially immediately after the events of Dragon Quest II: Pantheon of Evil Spirits. Malroth and Hargon have been defeated, but the forces of evil resist, represented both by the monsters that infest the world and by the more organized Order of Hargon. The latter aim to avenge their lord and conquer the Kingdom of Moonbrooke, banishing all Builders from the face of the earth and imposing the definitive dominion of destruction. If you're wondering how much it takes to have played the titles mentioned to fully enjoy Dragon Quest Builders 2, the right answer is probably: ~it depends~. The new sandbox by Square Enix and Omega Force is perfectly usable by newcomers, even by those who are completely unfamiliar with the Dragon Quest franchise. However, if you have played the previous titles, obviously, you will better understand some references to certain characters; if instead you played the first Dragon Quest Builders at least for the first three hours of the game you will experience a sort of ~return home~, noticing in the meantime how well it has been restored during the absence. In the initial stages, a small editor allows you to create your own protagonist, the main hero of the adventure: as was to be expected, the latter will not speak at all, but you can decide his name, haircut, complexion and a lot of minor details that (especially if you're playing in first person) you'll probably never notice. Yes, the first person is one of the novelties of Dragon Quest Builders 2 compared to the first chapter of the series, and it certainly represents a point in favor of immersion. It cannot be excluded that support for PlayStation VR for the title may come as a surprise at a later time; keep in mind, however, that during the construction of the buildings the precision of the design is somewhat affected by the lack of a freely adjustable game camera (present instead in the third-person mode). The long initial tutorial aims to explain to newcomers all the basics of Dragon Quest Builders 2 and the functioning of the main game mechanics: crafting, construction, combat, interaction with other NPCs. And the developers will continue to explain and explain even after the monster ship that took the main hero prisoner is wrecked, and even after you meet your first friends on the Island of Awakening. From this point of view, however, it must be remembered that the title is one of those that continues to teach even after many hours of play in the main adventure: it seems that there is always some detail to discover, some new mechanics that pop up, or simply enhancements and variations for those already present; each new island of the sol voyageIt serves to introduce at least a couple of noteworthy new main objects. These aspects make the Square Enix title a fresh, satisfying and incredibly long-lived production. Finished all the islands of the main campaign and defeated the bad guys, in fact, you can simply dedicate yourself to customizing all the worlds present, building what you like best and imposing your very personal rules (for example: no monsters around) even in the company of your friends. Gameplay: how to play Dragon Quest Builders 2 represents the enhanced, revised, corrected and updated version of the first chapter of the Dragon Quest spin-off series. Imagine the 2016 title as a kind of prototype, the first experiment in creating something new with a Dragon Quest theme, but contaminated with the sandbox potential offered by Minecraft. Now, after three years we hold in our hands a production that can easily be defined as ~mammoth~. Of course, still within the reference genre: but if we drew up a ranking with all the sandbox action RPGs, we wouldn't hesitate even for a second to place Dragon Quest Builders 2 at the top. Even tied with Minecraft, if there must be competition; however, it would be wiser to talk about contaminations, because Dragon Quest Builders 2 takes a lot from Minecraft and then reworks it in a very personal and original way. Explaining how Dragon Quest Builders 2 works from a gameplay point of view is very simple, it is less easy to realize the potential of long-term production, after dozens and dozens of hours of play; and above all, the variety, depth and customization possibilities of every single aspect of the game. In Dragon Quest Builders 2, first of all, you can destroy almost everything (but not quite everything-everything like in Minecraft). By destroying objects and monsters you will obtain materials, which you can then either place back into the game world as they are or (more wisely) combine them and use them as raw materials for something new and more technically refined: crafting. In short, throw down trees and scrub and then maybe build us a chair: just use a workbench. For weapons, however, there is a more comfortable blacksmith's workshop: the forged tools can also be assigned to party members and friendly NPCs, so that they can be useful against the monsters that infest the islands. And yes, because in Dragon Quest Builders 2 there is fighting, and a lot too. The islands of the game world are incredibly vast and varied from the point of view of the biomes present, and in every place you visit for the first time you will meet a couple of monsters never seen before. The combat phases are actually quite uncomfortable and wooden, also thanks to the absence of any type of evasive move: the battle is therefore reduced to an attack followed by a move away to eat something and recover health, then you return to the attack and everything is repeated until the enemy on duty falls to the ground. The difficulty level is never really problematic, and even if you die, you simply go back to the nearest camp / village. Each defeated monster can drop material on the ground and in any case guarantees experience points for party members; as you level up the main hero learns new recipes, improves health and stamina, and unlocks new weapons to forge. If it is important for weapons to level up, the new recipes and new construction projects are blocked in two different ways: by discovering them by chance by interacting with the game world, or simply by continuing in the main adventure. A separate article would then be needed to explain how villages work, where it is possible to devote oneself to the cultivation of a large number of crops: they can be entrusted to NPCs for management, and these stations also level up, completing the many missions secondary. Playstation 4 trophies Dragon Quest Builders 2 certainly could not miss the Trophies on PlayStastion 4, among which the shining Platinum naturally stands out. Bringing them all home will not be a particularly difficult undertaking: you will get most of the trophies simply by completing the main adventure. All the rest will instead ask you for something very simple in a title of this type: grind, grind, grind and collect all existing objects at least once each. Multiplayer mode and news Dragon Quest Builders 2 introduces many new features compared to the first chapter of the series. The first is the multiplayer mode, which works differently depending on the console you own. Both on Nintendo Switch that on PlayStation 4 it is possible to host online games or access those already available, even if only the host keeps all the progress and the collected material; the servers will be activated from July 12, 2019, so at the moment we don't know if Square Enix intends to improve online services or introduce something even vaguely similar to mini-games. The local multiplayer is managed in a more questionable way: on Nintendo Switch just disconnect the second JoyCon and deliver it to a friend physically present in the room, on PlayStation 4 instead you have to rely directly on the online, without local multiplayer. There is also no real-time cross-play, at most PlayStation 4 players can see the images taken by players on the Nintendo Switch, and vice versa. Dragon Quest Builders 2, we have already said it and we repeat it, represents a significant enhancement compared to the previous title of the Dragon Quest spin-off series. Almost every aspect has been revised or improved: now your hero can run, without forcing you to walk endlessly from one point to another on the game map; there is fast travel, which can be activated from the main game map after activating specific naviglobi or checkpoints; there is the first person, which guarantees a completely different approach to production. You can explore the depths of the sea, where obviously the protagonist's movements are slowed down, but there are also specific resources of that biome. You can glide from above using a kind of hang glider. You can share photos taken with the photo mode in every single moment of the main adventure or while exploring your own personal island. The other players will see them either from a special bulletin board or during the loading phases, and will also be able to express their appreciation with ~likes~. The general glance is almost always satisfactory, with no particular problems or slowdowns to report (just a little interpenetration between the characters, from time to time). On the other hand, the soundtrack is decidedly monotonous, in some situations, extremely accurate but not very varied.", "date": "2019-07-11", "grade": "8.5"}