{"name": "Terraria per Nintendo Switch", "ref": "https://multiplayer.it/recensioni/terraria-nintendo-switch-recensione.html", "text": "When Terraria first hit the market, it was the early years of a decade now winding down. The so-called indie gaming market had found its hens that laid golden eggs. Everyone thought that, as happened with the independent radios of the 70s, this production line too would be transformed into something sacred, almost venerable. Reality then proved to be different and probably closer to the cinematographic one. Where many independent developers have managed to find success (often because they are in any case driven by the same big giants towards which they made their big voice), most have been lost in oblivion, after having exploited their opportunity. This does not mean that real industrial phenomena have arisen from this movement, first of all that Minecraft which made its creator a billionaire and which has turned into the best-selling game ever. Shortly after its arrival on the market, Re-Logic launches Terraria, a particularly reworked version of that idea of creative freedom, eliminating a dimension and trying to repeat its success. We are certainly not talking about a title capable of selling that same number of copies, but the fact remains that Terraria has also become a manifesto of the indie scene by right. It now arrives on Nintendo Switch, with a guilty delay, but ready to let itself be shaped, as only it can do. Matter of preferences Over the years there has almost been a feud between Minecraft and Terraria supporters. What makes you smile is that, despite some strong similarities, the two titles travel on absolutely parallel tracks, without ever touching. The two-dimensional title, among other things, is extremely less massive and intuitive than the blockbuster of Notch. Fully understanding Terraria is a complicated and cumbersome task, which unravels between a few and scanty documentation and dozens of hours spent mining in search of useful materials. The updates that arrived over the months and years have added an exorbitant amount of content, bringing the already potentially infinite longevity to heights probably unknown to two-dimensional titles. The foundations do not move from what concerns this genre: we are called to dig, find materials to craft ever better tools, weapons and structures, so as to shelter from the elements and at the same time be able to claim our place in the Olympus of online creatives . It is easy to understand how the two-dimensional nature, combined with the lack of ~friendliness~ granted by the title to the player, make it a less played product, but this also entails an even more close-knit and expert community. The diffusion on any type of platform clearly fragments the use, but it is important to remember how Terraria can be easily enjoyed all alone, without any need to socialize with other players around the world. To add an interesting degree of challenge to the game we then think about a series of enemies and bosses that are deeply inherent in the structure of the advancement. Unlike Minecraft, where the choice of enabling and disabling enemies relatively changes the perception, Terraria gives the clashes greater utility, especially in terms of resources obtained. It is also possible to activate a hardcore mode which drastically increases the difficulty, but which we advise against for all those who are not familiar with the game. The port to Nintendo Switch It is useless to get lost in thousands of characters on a title that even the walls are aware of by now. Terraria is a game that every lover of videogame creativity should necessarily play. And in the light of a Switch version that hasn't given us any kind of problem (after all, we're also talking about a game of disarming simplicity), it seems difficult not to recommend it to all those who have a Nintendo hybrid. Visually far from bewitching, but able to give pleasant 16-bit moments, the game has not been affected by any problems from the point of view of the frame rate, even if it does not require who knows what particular specifications. The mapping of the commands, derived from that already applied to the console versions, is a fair compromise between the freedom of the PC version and that relegated to the limited maneuverability of a pad. The sound is certainly not the spearhead of a production that does all it can, as has already been repeated over and over again. The effects are limited to accompanying the slashing and building, as well as the pickaxe sections. Terraria certainly does not boast an extraordinary variety of environments, being also linked to a procedural generation of the map. However, this is not a problem, considering its very nature that requires the player himself to create a beautiful and lush world.", "date": "2019-07-08", "grade": "8.5"}