{"name": "Sea of Solitude", "ref": "https://multiplayer.it/recensioni/sea-of-solitude-recensione.html", "text": "There are many negative rumors about Electronic Arts (it is useless to summarize now) and one extremely positive one: it seems to treat independent developers, the so-called EA Originals, really well. Pad in hand, we don't find it hard to believe given the results achieved with the Unravels, the surprise A Way Out and this Sea of Solitude, whose review you can read, presented during E3 2018 and now finally here, installed on our consoles. Among the selection of titles to which EA has worked as a sounding board, the latter is undoubtedly the most authorial and complex. Sea of Solitude is indeed a choral work, the software house is Jo-Mei Games, but the hand of the charismatic Cornelia Geppert, producer in charge of the project, was clearly the only one in the position to leave an indelible mark on the work. Sea of Solitude speaks of Cornelia Geppert, of her darkest past, and does so with the words of Cornelia Geppert, with the ways of Cornelia Geppert, and although in one way or another everyone will end up appropriating some of it, there are far too many details to make this happen in the most spontaneous and effective way possible. far away Because Sea of Solitude is not only that game with the boat (which is not even used so much) but before anything else this adventure is a self-induced catharsis, in which reality crosses the waves to appear distorted at the end of the journey, monstrous, even lethal. A sea, indeed an ocean, which cloaks and pulls away from one's life and loved ones. Flashes of reality emerge every time the main character emerges from his mental frame, a black hole that sucks up happiness and can take on many forms and many names. Sea of Solitude is also a game about depression, and to tell us about it it often uses simple reflections, mirror games from which other forms of imprisonment emerge, other mental cages from which the more time passes, the harder it is to get out. As in real life, insecurity and fear slap in waves, underlined by Sea of Solitude with rain and storm surges that pierce the excess blue of tranquillity, when the nothings and nobodies, generated in our heads, can hurt us. From this point of view, the interactive story organized by Jo-Mei Games works well because you know what is happening, and manages to convey, thanks to the presence of these immense pitch-black monsters, sensations that closely simulate those that suffocate in moments in which discomfort thickens, and the usual feeble hope is crushed by the shirts of darkness. At the same time, the personal experience of Cornelia Gepper flows more didactic, and she has every right to overwhelm the rest with details that only by chance can belong to us, but which often ends up unbalancing an experience that with fewer words could have work much better, more universally. When this happens, it's a bit like being demoted from protagonists to mere spectators; position that we can only accept, bent to the author's will, but which we admit we found rather uncomfortable. Fears The Sea of Solitude game is certainly not a particularly complex work, and here the gameplay is clearly a pretext to make us feel as close as possible to the protagonist, instead of an element present to guarantee deep mechanics, or a real challenge. After the five hours and little more needed to see the end credits, Sea of Solitude remains more in the head than the solitary navigations, its labyrinthine level design, a physical and mental maze that will have to be faced with curiosity and courage, both to continue in the adventure is to pocket all the collectibles present. It is not a particularly complex landscape, but if the direction in which to go will always be clear, the road to follow will not be the same. The exploration is consequently extremely pleasant, never an insurmountable obstacle, alternating with timid platform phases, small action sequences in which the solution to the enigma or combat is never the fight. Often the exploration is broken up by segments in which we will have to move, swimming, from one safe position to another, trying to avoid the jaws of an enormous fish whose body is covered in black filaments of fear, while the face aberrantly recalls that of a man. Much of the game develops mainly on foot, or by swimming, first between the roofs of the buildings that will emerge from the water, then further and further down until the sea level has completely dropped and finally we will be able to travel, for the first and last time, the maze of streets now dry, finally defused by the morbid fears of the protagonist. Scale of emotions The Underwater World ofSea of Solitude acquires and loses colors, is enveloped by storms to return enchanting and silent depending on the emotional state of the girl at our commands. Artistically speaking everything is or almost very beautiful, except the animations of the protagonist who struggles from a technical point of view to blend perfectly with the surrounding environment. Animations of a higher level would certainly have given an edge to the whole project, bringing it closer to the stylistic features of Fumito Ueda from which he already seems to want to take as much as possible. Here the colossi are called monsters, and they get lost in thunderous chatter that has nothing of the ancient verses that echo in the ancestral glottis of the creatures of Shadow of the Colossus for example, more reminiscent of a coarser Studio Ghibli. It's not so much a lack of style, but a thoughtful choice that can please as well as disappoint because if this is solitude, we imagined it a little more silent. The soundtrack is of good quality, and gives what is needed to highlight moments and situations properly, often leaving the field free for sound effects, for a waltz of musical whispers that often end up pirouetting on the keys of a piano.", "date": "2019-07-05", "grade": "7.5"}