{"name": "Car Mechanic Simulator", "ref": "https://multiplayer.it/recensioni/car-mechanic-simulator-recensione-console.html", "text": "Here in the editorial staff there are those who love boring video games, just like the writer. What then is wrong to call them boring, they are only apparently: driving the subway, or a bus, without being able to cause that beautiful liberating chaos of a typical GTA, or managing traffic or the demolition of a building, doesn't exactly sound exciting. And even if sometimes it really isn't, there are certain software houses that, partly due to their commitment and partly luck, manage to transform normality into decidedly fun and rewarding gaming experiences, just as in the case of Car Mechanic Simulator, which we tried a while ago for PC and now comes to consoles. Along with our review of course. That great genius of my friend The series debuted in 2014 exclusively on PC, along with many other independent games that have spearheaded the resurgence of development without a major behind it, enjoying more and more success year after year. Like many indie games of the time, the first Car Mechanic Simulator was far from perfect, but its gameplay was crazy and original enough to attract the attention of many who still today find themselves fleeing the classic Triple A experiences, always too much similar to each other. Products like this, not only this one, also recall certain Amiga and PC games of the past century: not the most famous of course, but those that made the Commodore platform, and even more so compatible computers, so attractive for videogame lovers which the arcade spirit of console titles was not enough. For example, before inventing The Sims, Maxis simulated everything from skyscrapers to anthills, even playing with DNA in the fascinating Sim Life. We went from Detroit, where you had to manage a car company, to Pizza Tycoon, a name that requires no further explanation; passing through rather extreme stuff like Rock Star Ate My Hamster, an ancient Codemasters game in which the management of a rock band with all its typical excesses is comically simulated. Oddities that arrived with a dropper, but with a particular typically Japanese verve, even on consoles, however often remained exclusive to Japan as in the case of Densha de Go on PlayStation, and Tokyo Bus Guide for Dreamcast. Those of a certain age certainly cannot be surprised by the existence, today, of a Car Mechanic Simulator: a bloody mechanic simulator, oh does it seem possible to you? With a screwdriver it works wonders Car Mechanic Simulator exists, works damn well and is liked, so much so that it has generated sequels, a friendly porting even on Nintendo Switch and now this PlayStation 4 and Xbox One incarnation, almost identical to the 2018 version which has already been available on PC for some time. Like the best and most original simulators of the past, Car Mechanic Simulator is based on a profession that is also a passion, and you can almost feel it when the system takes over, and the game finally comes alive. Reducing it to a minimum, the invention of the Poles of Red Dot Games is very similar to a long puzzle full of variations, where it is necessary to identify the problem, and then solve it by disassembling, changing and reassembling the mechanics of the car in front of us. There is also a progression with new skills to unlock that will allow for example to unscrew faster, to understand with a glance and a rev what problem an engine has, as well as to access new and faster diagnostic tools. Once all the cars have been repaired in our workshop, we will be able to pick up the phone and choose from different advertisements which job to accept. In Car Mechanic Simulator there are two different types of employment: generic and story related. The latter are the only ones that will be introduced by a handful of lines of text, here the owner will describe the history, problems and use of the car to be repaired or simply overhauled. The inept like myself don't worry: it is a rather simplified representation of the interior of a real car, there are no electronics involved and even reassembling an entire engine is not that difficult since, in the appropriate mode, the game will show the contours of the missing pieces and will prevent us from assembling one without the previous one having already been inserted. Impossible to go wrong, except in the purchase of the parts to be replaced: all useless objects will in fact weigh on our wallet, but can still be used for another customer. By carrying out work and accumulating money and experience, it is also possible to expand your workshop to accommodate more cars at the same time, or by unlocking new work tables that will allow, for example, to repair some parts at home that previously could only be replaced. Customer requests are quite varied: starting from the simplest ~check my brakes~, to a more vague and demanding ~I hear loud noises coming from the noise compartment and now it is struggling to start~. Then there is the typical reckless purchase of someone who thought they had a bargain, and ends up with a $5,000 repair wreck. But it is also possible to adjust the bodywork, modify the interior, add spoilers, do some light tuning, even if many of these functions are exclusive to our vehicles and not that of the customers. When we have made a lot of money, we will be able to visit some places such as the junkyard, where we can buy skeletons of racing cars to rebuild life after life, and then resell them with a good profit margin. Wheaten from the sky Even on Xbox One and PlayStation 4, where we tried it, Car Mechanic Simulator imposes itself thanks to an innate originality and a surprisingly relaxing gameplay. The console port is almost identical to the PC counterpart, even the controls have been cleverly adapted to make it always quite easy to extricate ourselves from pipes, pistons and air filters. Who knows instead if better could have been done to speed up certain uploads which fortunately are not frequent, but are never in too much of a hurry to leave. Of real problems, if we exclude any bugs that we have not encountered, this game does not seem to have any. On the other hand, it does have shortcomings, and they become more and more serious with each sequel that does not include their implementation, even if it is far too early to complain about it. If this Car Mechanic Simulator will be your first title of the genre, at least thirty hours of entertainment await you, which could extend up to an abundant fifty hours of gameplay necessary not only to get to the bottom of the story mode, but also to see and carry out a little bit of everything that the product offers. But there is certainly a variety problem. In the end, the problems to be solved will always be those (despite the presence of more than 48 cars present and over 1000 spare parts to have fun with) and a real challenge problem since a mechanical failure, or a model economic that leads to a bankruptcy that is worth a game over. Another limit is the graphic representation of the workshop which, although stylistically it does not have major problems, is a space that does not have a dynamic exterior and does not allow for example to enjoy the daily life of this work with the noise of a virtual rain in the background, or a realistic coming and going of customers.", "date": "2019-06-25", "grade": "7.3"}