{"name": "Sprint RPG", "ref": "https://multiplayer.it/recensioni/sprint-rpg-la-recensione.html", "text": "Anyone who follows the mobile panorama even laterally knows for sure that Nitrome is one of the most active interpreters ever on the market: the British company rarely misses a beat when it comes up with internally developed products, while as a distributor it takes some risks in more and from time to time the proverbial donut without a hole happens to her. Since it was not made directly by Nitrome but by the small Fungus studio, the Sprint RPG present here therefore falls within the ambit of the more experimental titles of the English software house, but this time in an undoubtedly positive meaning. Read our review to find out more. Dungeons and smartphones The aesthetics of Sprint RPG is undoubtedly courageous, if not downright surprising: the title comes with a pleasant and effective monochrome pixel art in conveying the idea of a tribute to first-person role-playing games of the old guard, but which in the long run it makes you miss a little color. As with almost all Nitrome productions, however, even here the graphics play the role of mere accompaniment to a gameplay that is the absolute protagonist. The user's task is to get to the end of the corridors that make up the various game levels, eliminating the monsters that appear in front of him and collecting coins and treasures kept in the ever-present chests. Put like this, Sprint RPG would seem a mere reduction of classics such as Eye of the Beholder and Might and Magic, but in reality everything is based on particular and decidedly spot on mechanics that infuse the product almost with a rhythm game flavor. In the lower part of the screen peep out the virtual keys to press to advance, or three arrows relating to as many directions (right, left and forward), a shield to parry and a sword to attack. Each opponent you meet on your way needs a specific combination of these buttons to be defeated and thus leave the road free, but that's not all: the bar positioned at the top of the display indicates the time left to reach the finish line and it also acts as a health meter, emptying whenever you make a mistake while executing inputs. And we are not referring only to clashes with enemies: even just pressing the key to turn with a moment in advance or failing to hit a chest are concrete examples of actions that cause a reduction in the bar, forcing the user to always be attentive while looking for to reach the end of the level before the countdown expires. On these bases, Sprint RPG leaves some margin for error to the user in the initial stages, while in the advanced levels it transforms into a decidedly hardcore product that requires remarkable qualities of precision, speed and memory (in fact, it is necessary to remember the correct attack patterns of the enemies ) in order to be tamed: a surge in difficulty that we found excessively steep and which could be frustrating for users less willing to sacrifice and the inevitable trial and error. Another element that can potentially make one turn up one's nose is the massive presence of advertisements, often inserted even upon completion of the internships (and not in the event of death as occurs in many similar productions) and which can be removed by paying the usual heavy tax in the appropriate in-game shop, which otherwise serves to convert the money into gold coins essential to purchase new pieces of equipment. However, this is not a real bottleneck, given that the virtual currency is still obtained by playing and that the various helmets, shields, swords and boots perform an almost exclusively aesthetic function, giving only some negligible variations to the gameplay. Finally, in terms of longevity, Sprint RPG gets along more than admirably, thanks to a good number of schemes and the presence of a whole series of relics to collect which adds a further layer of challenge intended for more involved users.", "date": "2019-06-22", "grade": "8.3"}