{"name": "Crash Team Racing: Nitro-Fueled", "ref": "https://multiplayer.it/recensioni/crash-team-racing-nitro-fueled-la-recensione-per-playstation-4.html", "text": "We live in the years of the revival of the classics and the triumph of nostalgia. It doesn't necessarily have to be a good or a bad thing: the gaming sector, like any other, always continues to evolve keeping in mind its past. Sometimes even the requests of the players play a fundamental role, just look at what has happened in the last three years: first the return of Crash Bandicoot and its original trilogy, in the Crash Bandicoot N-Sane Trilogy, then that of Spyro in the more recent Reignited Trilogy, and now in June 2019 it's up to Crash Team Racing: Nitro-Fueled, whose review you are reading. After all, it had been well over three years that the nostalgic owners of the first PlayStation begged to be able to replay (with updated graphics, of course) their favorite racing game, probably the first they had experienced way back in 1999. And therefore here is that Activision has satisfied them, for the third time in a row: Crash Team Racing: Nitro-Fueled is the complete summation of everything that Crash Bandicoot aboard a go-kart has ever managed to offer. But after so long, and in the face of a market now saturated with similar titles, do you still have something to say to today's gamers? Or is it really just an operation designed for those who framed the case of the first PlayStation 1 title? Obviously you will soon know what we think, by reading our review. The remake: an ambitious operation When you find yourself reviewing a title like Crash Team Racing: Nitro-Fueled, a good reviewer basically has to ask himself at least three questions, a basis on which he then goes on to reason on a myriad of other issues and other details. First question: Is Crash Team Racing: Nitro-Fueled still fun, in June of 2019, with so much water under the bridge? The water under the bridge is clearly a metaphor that underlines the evolution of racing games in the last twenty years, light-hearted or serious. The answer to this first question is ~yes~. Second question: does the nostalgia effect work? Does it rekindle something in the players of the first Crash Team Racing? Okay, the question has split in two, but you will have understood very well what we mean. And here too the answer is ~yes~, to both. Third and last question: ~in terms of technical realization, is the remake a valid production?~ If even in the latter case it is possible to answer ~yes~, then Crash Team Racing: Nitro-Fueled really has all the credentials not only to justify its presence on the market, but also to carve out a place for itself that is not at all second-rate . Since the answer to all questions is yes, you will understand well how Activision has hit the bull's-eye again - and for the third time in a row - with the fond memories of the players. Twice of which with the same crazy marsupial, by the way. Crash Team Racing: Nitro-Fueled is an ambitious operation. You will not soon have in your hands the ~homework~ carried out by listless developers, but a real creation from scratch, made with love towards the original chapter. Indeed, towards ~the chapters~, in the plural, as you should have already guessed from the name of the game. It's called Crash Team Racing: Nitro-Fueled, a mishmash of terms that wants to underline how the base is yes Naughty Dog's Crash Team Racing, but on the latter they then add up (in a harmonic addition, not merely content) a large number of elements from the subsequent Crash Nitro Kart (Vicarious Visions) and Crash Tag Team Racing (Radical Entertainment). Everything has been redone from scratch, from the character designs to the details of the individual levels, passing through the menus, main hubs and animations. The player who buys Crash Team Racing: Nitro-Fueled today finds himself in his hands, and at a very fair price, a title that contains something like more than thirty tracks and at least 35 drivers, but in any case these are momentary numbers because Activision already has confirmed that new characters, grand prizes and accessories will arrive in the coming weeks, for a support that (hopefully) will last for at least a couple of years. Storyline and gameplay The narrative premises of Crash Team Racing: Nitro-Fueled are all in all sufficient, considering the context: the game even has a story that tries to justify, once again, the presence of so many characters, good and bad, from the main series of the marsupial. An awkward little alien with a passion for racing arrives on planet Earth and challenges its inhabitants to a series of races: whoever wins will decide the fate of humanity. If Crash, Cortex, Coco and company win, then Earth will be left alone; if instead N. Oxide wins, the planet will become a huge parching of concrete (which it already is, but details). The adventure mode, the first that will be offered to the player, consists of a series of worlds, each of which contains a limited number of tracks (usually four), the same ones that are found in the more classic Cups of the arcade mode. By finishing in first place in any single race, the winner unlocks the boss fight of the world in question, and can then move on to the next, and this repeats until the fight with N. Oxide. Clearly no one forces you to play the adventure mode, where you will have to participate in the grand prizes provided by the narration and at the most repeat the circuits by varying the game mode: the arcade mode offers you, and immediately, all the contents of the game: every single track, every single mode, and the ability to play with friends too. The gameplay of Crash Team Racing: Nitro-Fueled deserves some consideration, and this time the comparison with the first Crash Team Racing will be particularly useful. All the power-ups you remember are still there in their place, taken from their respective games and reworked in a very conservative and faithful way. Here, fidelity to the original work is probably a gold medal that Crash Team Racing: Nitro-Fueled takes home immediately, the player is willing to give it to him after just half an hour of play: because it is clear that Activision has faithfully kept the original game at his side all the time, in order to build it from scratch without neglecting any detail. The aim of the race is clearly to finish first by challenging artificial intelligence, or friends locally and online: the best ones will remember all the secret passages of each level and the position of the pitfalls, houses and wumpa fruits right away; good for them. All the others will immediately learn how to get the most out of the proposed upgrades: we recall in passing the presence of the TNT case, research rockets, bowling bombs, slow-motion stopwatch and many other gadgets. Not all are equally useful. Let's go further and let's be honest: compared to the boosts of similar titles on the market today, those of Crash Team Racing: Nitro-Fueled don't even shine all that much. Even some tracks have aged more than others: in linearity and design, even restored and refurbished in 4K, they remain forgettable, especially for the new player who discovers the title for the first time. The nostalgia effect will come to the rescue for all the others, and everything will become beautiful and unforgettable again, even if it is no longer so (or perhaps it never was, sometimes memory plays tricks on you). Playstation 4 trophies Crash Team Racing: Nitro-Fueled brings 35 Bronze Trophies, 10 Silver Trophies, 2 Gold Trophies and the coveted Platinum Trophy to PlayStation 4. The speed with which you will unlock all of them will depend a lot on two factors: your skill with racing games (especially arcade ones), and if you have played less than the original chapters of the series on the first PlayStation 1. In this case you will already know some tricks, secret paths, and collectible locations. In general, however, the challenge is not prohibitive. Mind-boggling content These considerations obviously do not detract from the value of Crash Team: Racing Nitro-Fueled as a game in itself, but they focus on very specific and partial aspects. We have not encountered particular problems in the technical or graphic or artistic realization of the title, for example: everything flows beautifully, everything has been redone from scratch with great detail. For the record, we inform you that the game runs at 30FPS on all platforms but still remains fluid and lag-free. Some small flaws can be found, however, and this applies to any video game: but is it really the case to go and underline tiny imperfections in the stone tiles of the Piramide Papu track? Or do we necessarily have to look for defects in some of the luminous effects of the Sewer Track, damn whoever invented its narrow and asphyxiated ducts? If anything, something seems to have changed precisely in terms of gameplay, in the responsiveness of the kart during drifts and wall jumps. But even here a couple of hours of play are enough, and you'll go back to being experienced pilots and ready for anything. Probably. We were unable to try the online mode, because clearly the matchmaking left our poor Bandicoot waiting for too many minutes, so much so that he ended up falling asleep. However, nothing portends particular problems, if anything we will return to notify you as soon as it is available in the next few days. From the point of view of thekept proposed, however, it is not possible to complain from any point of view. There are no speeches like ~okay, the original game has been remade, but some more content would have been nice~. They don't exist because in Crash Team Racing: Nitro-Fueled there is everything and more. Think of an object, an element, a kart or a character: it's there. We dare you to check. Seven different cups to compete in, online or offline. 32 trails, all different, and many of them are likely to bring a tear to your eye, bringing back precious memories of when you were younger. There is no shortage of additional modes, with related tracks or arenas: Battle, in which two players on two karts fight each other with power-ups until they die; Time Trial to perfect your times in the various tracks, Relic Races, CTR Challenges and Crystal Challenges, with particular items to be collected along the way before time runs out, or other most often infamous conditions. And again, Pit Stop which acts as a daily shop, where you can spend the accumulated wumpa fruits to unlock characters, decorations, aesthetic variants of the kart, new vehicles and much more. Tons of characters to choose from, many with additional skins and styles, plus new drivers on the way and some new content debuting with Crash Team Racing: Nitro-Fueled for the first time ever. For example some characters with a neon / futuristic uniform. We weren't blown away by the design, but the more content the better. And then the retro variants of Crash, Coco and Cortex are a love, this must be said.", "date": "2019-06-21", "grade": "8.2"}