{"name": "Assassin's Creed Odyssey: Il Tormento di Ade", "ref": "https://multiplayer.it/recensioni/assassins-creed-odyssey-il-tormento-di-ade-recensione.html", "text": "Assassin's Creed Odyssey: The Torment of Hades begins exactly where the first DLC of the second narrative arc ended, that is with the protagonist (in our case Kassandra) grappling with a challenging boss fight against the huge three-headed dog Cerberus. If you have read the review of the previous package and have played it, you will probably be pleased to know that the story narrated in the new campaign, which can also be completed in about ten hours, gets lost in much less talk and proceeds in a linear manner. without forcing us to swear allegiance to a character and then do the same with his bitterest enemy and try to justify the choices made in at least a botched way. Evidently the authors also realized that they had granted very little decision-making freedom in The Elysian Fields, and so the meeting with Hades takes place on the basis of fairly clear assumptions: having killed Cerberus and wanting to know the secrets of the stick of Hermes Trismegistus, we will agree to find the lord of the underworld four legendary champions who can guard the gates of the underworld, selecting them from a new list of objectives, that of the Fallen, made up of a total of eleven formidable fighters. Scenario and enemies As it was reasonable to expect, the map of Il Tormento di Ade includes a new scenario divided into three regions but completely different from the Elysian Fields: the landscapes have a very evident dominant sepia, most of the territories are whipped by a sandy wind which makes it difficult see beyond one's nose and some peculiar structures, of Isu derivation, overlook certain areas of the setting. There are several mountains, but fortunately they are generally found on the edge and exploration is not affected that much: moving from one point to another therefore does not become an odyssey of falls and climbs, as in the previous DLC, and the experience it benefits quite a bit. Of course, although consistent with the nature of the kingdom of the dead, it must be said that the aesthetic monotony of the map, so deliberately depressing in many of its situations, neutralizes what has always been one of the strengths of Assassin's Creed Odyssey, namely the possibility to discover new, fascinating landscapes while moving on horseback or on foot. As for the enemies, in addition to the aforementioned list of Fallen we will have to pay attention to a couple of new threats, specifically the infernal dogs that preside over the plains, which often prove to be very tenacious and dangerous opponents, and the ~shadow~ warriors, who can only be injured after activating special portals that reveal their features but limit our vital energy until the end of the battle. Story and characters The authors of The Torment of Hades obviously drew on Greek mythology to create the protagonists of this new campaign: on the one hand we have the disturbing Hades and his brother Poseidon who spend eternity betting on the outcome of certain events, including our mission, and the ferryman Charon, who takes care of leading the souls of the deceased across the Acheron river and that we will have to help on more than one occasion. Being able to access the land of the dead has clearly allowed the return of some characters who have passed away during the main story of Assassin's Creed Odyssey: a gimmick that has simplified the life of the developers, but which is very well justified given the conditions of the new adventure . While we don't want to reveal exactly who you'll be able to find, we can say that the thing has been handled narratively in a more than discreet way, to underline how unfortunately certain moments of the original campaign have not been managed to the best of their real potential. The figures in question will in any case be more enemies than friends, enriching the ranks of the Fallen and providing us with new, demanding challenges in which we will have to take advantage of the special abilities, a new particular equipment (the armor of the Fallen, in fact, necessary to access to some areas) and the strength guaranteed by a degree of experience which in this case will go beyond level 60. Playstation 4 trophies There are only five Trophies obtainable by playing Assassin's Creed Odyssey: The Torment of Hades. They are unlocked by defeating Cerberus and all the Fallen, closing the portals of Tartarus, obtaining upgrades for the staff of Hermes Trismegistus and beating the final boss of the DLC. In conclusion The Torment of Hades remedies the tangled, unhappy management of dialogues and choices seen in the previous DLC, as well as an exploration often made frustrating and difficult due to the many mountain peaks toclimb when passing from one area to another. The new map is obviously not as evocative as that of the Elysian Fields, on the contrary it is necessarily monotonous from a chromatic point of view while getting some design choices right, but it is in line with what the land of the dead should look like and proposes a fair number of novelties also on the enemy front, as well as several pleasant and surprising returns. In addition to some allies that it will be nice to see again, we will be faced above all with the souls of opponents we had already defeated and who rightly would like to take their revenge, giving life to even rather demanding duels, interspersed with escort missions, investigations and expeditions which, as usual, will give the best if faced in exploratory mode, thus depriving oneself of simplified indicators and paying attention to the various dialogues to understand where to go and what to do. The epilogue of the DLC certainly lays the foundations for a conclusion with great potential, which we hope will be worthy of the quantity and quality offered so far by the Assassin's Creed Odyssey Season Pass.", "date": "2019-06-14", "grade": null}