{"name": "Le Iene (Reservoir Dogs) - Recensione", "ref": "https://multiplayer.it/recensioni/le-iene-reservoir-dogs-recensione.html", "text": "Eidos has decided to transpose Reservoir Dogs into a video game which, in addition to re-proposing the key moments of the film, reveals some background and parallel situations to what was seen in the film 1992: The World Met Quentin... After 14 years, Eidos has decided to transpose Reservoir Dogs into a video game which, in addition to re-proposing the topical moments of the film, reveals some background and parallel situations to what was seen in the film, certainly a way to attract the attention of the most convinced fans of Tarantino's work. To transpose Reservoir Dogs into video game form, the reference genres could only be action and racing, an alchemy already seen in many other productions of these years. Robbery simulation... To a very classic setting, fortunately the peculiarities of the film have given way to propose something particularly innovative. If memory serves, it is the first time that we will find ourselves having to rob banks in a 3D video game and consequently face highly emotional situations such as convincing the director to open the safe, take hostages, use them as human shields to avoid being shot by the policemen and convincing the latter to disarm to keep alive the unfortunate person who was at the wrong time, in the wrong place. to a very classic setting, fortunately the peculiarities of the film have given way to propose something particularly innovative Robbery simulation... Undoubtedly right from the tutorial, the first hours of the game are truly exciting: the production of Eidos is imbued with the Pulp atmosphere of the film also thanks to the presence of the tracks from the film's soundtrack and excellent dubbing (including that of Michael Madsen, one of the protagonists of the cinematic Reservoir Dogs...) remained in English also in the Italian version of the game (but there are subtitles in our language). Then committing a robbery makes the adrenaline rise compulsively and the sensation of power you will feel is truly exhilarating as well as the pleasure of having all the members of the robber gang as your digital alter ego. Well begun is half done? After the excellent start, however, Reservoir Dogs tends to quickly show its limits: the 15 levels to complete tend quickly to move on the canonical coordinates of 3D action-shooters without however even remotely approaching the apex of the genre with the exception of the spectacular sequences ~Inferno di Piombo~ which start from the usual ~bullet time~ but manage to be even more impactful given that after firing an impressive number of bullets, a kinematic sequence will start which will show the lead entering the skin of our ~target~. The limitations mentioned are even more evident in the car sequences that do not convey any particular emotion except that of boredom with the hope that they will end as soon as possible due to a rather approximate realization of both the command system and the level design. after the excellent start, Le Iene tends to quickly show its limits Old generation The cross-platform nature of the title also penalizes the PC version even excessively given that in addition to a quality of textures, interaction with the environment, animations and polygonal models absolutely from ~old generation~ consoles (and not even of a high level), it presents monstrous and truly inexplicable drops in frame rate despite the specifications of the test computer (3.5 GHz processor, 2 GB of ram, 256 MB of video memory) were well above the recommended requirements indicated in 2.8 GHz for the processor , 1 GB of ram and a graphics card with at least 128 MB of memory. Thumbs down then for Babel, the proprietary engine of the Volatile programmers, which shows its greatest limitations on PC despite the great hardware potential. Cross-platform As written in the previous paragraph, Reservoir Dogs is a multi-platform product, intended for PC, Xbox and PlayStation 2. In the quality/specification ratio, the console versions prove to be decidedly more performing given that, apart from high definition, they do not present substantial differences compared to the Personal Computer version (the Xbox one, as always, has a slightly superior graphical cleanliness to the Sony console but the two versions are almost completely identical) so as to deserve a half point more in the vote. Final comment Eidos' excellent idea of reproposing a cult film like Reservoir Dogs in videogame form is only half successful. In fact, the game starts very well with some particularly good ideas and always maintains the atmosphere of the film that made Quentin Tarantino known to the world. Unfortunately however within a few levels, Reservoir Dogs tends toflattening on the most canonical and mediocre tracks of action shooters and with excessively repeated game patterns not to mention the bad parts to be faced in the car. Recommended for the most radical pulp fans who will be able to discover unpublished details on the ~nice~ gang of robbers in the video game. Pros All the atmosphere of the film Excellent voice acting and original soundtrack New elements of the story Cons Technically mediocre Insufficient car sequences Overly repetitive gameplay 1992: The World Met Quentin... Reservoir Dogs, in addition to being the feature film with which the world got to know the directorial art of Quentin Tarantino, can also be considered as the progenitor of that particular cinematic sub-genre called Pulp, which experienced its highest moment with another Mister Quentin film: Pulp Fiction. In 1992 the charge of aggressiveness, violence and bad language of ~Le Iene~ was undoubtedly surprising and even today the film is considered a real cult movie for those who love this type of cinematic experience.", "date": "2006-09-22", "grade": null}