{"name": "Archero", "ref": "https://multiplayer.it/recensioni/archero-la-recensione.html", "text": "A bit like gray, the roguelike mechanic goes with everything, it seems. In recent years there has been a tendency in the mobile panorama to insert the principles definable as roguelike - i.e. permanent death of the character and the need to start over from the beginning with each new mandate - in a lot of different contexts, perhaps finding in this way a good way to extend the longevity of some titles and deepen the challenge, perhaps being able to count only on a rather limited amount of scenarios. For these reasons, this mechanism also finds an elective affinity with the procedural construction of the levels, thus favoring variety thanks to a generation of continuously different experiences with each sequential restart. If you put all these features together and also add a surprisingly fun shooter-style action setting, despite its extreme conceptual simplicity, we can have an idea of what Archero, the protagonist of this review, is. It's amazing how this little game manages to almost perfectly match these various characteristics, while also packing genuinely fun gameplay. Of course, there are obviously many free-to-play mobile titles with action dynamics and a roguelike setting, but the balance found in Archero is truly remarkable. In the game we play an archer within various small levels and built in a procedural way but with settings that follow one another according to a pre-established scheme, changing every few levels. The archer shoots arrows continuously and automatically but only when he is stationary, so our task is to try to move him with the right timing and precision in order to avoid being hit by enemies but trying to do it only for the shortest possible time in order to continue attacking. It is a very simple but well thought out and effective dynamic, which is convincingly associated with the touch screen mobile control system and takes on further strategic depth with the application of power-ups, which are applied at regular intervals as the game progresses . More and more powerful As the difficulty of the levels progresses, the protagonist's continuous evolution counterbalances him, who by gaining experience always obtains new power-ups capable of expanding his firepower. The choice on which bonuses to use is entrusted to the player, who can therefore decide whether to increase the rate of shots, the power of these, the quantity of arrows fired, the angle or also invest in defense systems or in increasing energy , with all power-ups stacking on top of each other. It is important to find your own fighting style even in choosing the right evolutions, with the protagonist who becomes a real weapon of destruction as the levels progress. Despite the roguelike setting, the progression still leaves some persistent changes to the main character, thus configuring the game as a ~rogue-lite~: these are fixed bonuses that can be unlocked by investing the coins collected by completing the levels, as well as weapons and armor conquered with the loot and the possibility of directly accessing the more advanced levels, unlocking the gates that are found after a certain amount of schemes. All this helps to create a sense of constant progression, despite the fact that the game sends us back to the beginning of the world with every single death of the protagonist, essentially canceling the sense of frustration that the roguelike mechanism could determine. This continuous advancement in conquests and power by the protagonist, in addition to the immediate and fun gameplay, well studied also starting from the design of the numerous enemies that we find ourselves facing, create a real addiction that pushes us to start again every time with further momentum, trying to progressively improve the previous record. The level of challenge actually reaches considerable peaks and even reaching the fiftieth level to unlock the gate that allows direct access to the second world is a real feat and in this sense micro-transactions can become attractive, simplifying a bit the experience at least momentarily. However, it should be noted that these are not forcibly inserted through deliberately fallacious gameplay, which necessarily involves the use of in-app purchases. The feeling, game after game and death after death, is that we are dealing with a challenge which in any case can be won with greater commitment or perhaps by making different choices in the selection of power-ups and in the consequent construction of the character. The only real problem hereIn this sense, it is represented by the energy that is consumed with each game and which requires waiting to be recharged or resorting to micro-transactions.", "date": "2019-05-29", "grade": "8.2"}