{"name": "Druidstone: The Secret of the Menhir Forest", "ref": "https://multiplayer.it/recensioni/druidstone-the-secret-of-the-menhir-forest-recensione.html", "text": "Part of the team that made the two The Legend of Grimrock, arguably the best re-enactments of Eye of the Beholder-esque dungeon crawlers in recent years, he developed and launched Druidstone: The Secret of the Menhir Forest, a turn-based fantasy strategy game with strong role-playing game that takes a lot from the classics of the genre, but simplifying the formula for an unusually agile gameplay ... perhaps too much given the genre. The story of Druidstone tells of the abduction of the Archdruid of Menhir Forest. Who attacked the sacred place where he dwelt? Who is filling the environment with purulent cysts that destroy nature and give life to terrible monsters? To find out, all that remains is to face the thirty-five missions that make up the game, leading a party composed mainly of the druid Aava, the warden Leonhard and the red priest Oiko, plus other characters who join the group for specific missions or for gods features of the adventure. The story told by Druidstone is all here and, even if there are some interesting implications, it does not upset for the intrigues it proposes. Despite this, you can follow it willingly, both for the funny, even if a little naive dialogues between the characters, and also because in the end it never annoys, given that the interlude sequences are made with the game engine and don't make the detachment feel too much between the parts played and those told. Character management What really matters in a turn-based strategy game of this type is the combat system and character management. Let's start with the latter. By providing us with only a handful of heroes, Druidstone does everything to make them unique in their abilities and powers, while presenting nothing truly original compared to the canons of fantasy. Leonhard is the classic warrior with skills focused on combat and endurance, Aava has healing powers and fights using a bow and arrow, while Oiko is basically a wizard. By overcoming campaign missions, everyone develops their powers, gaining advantages and disadvantages on the battlefield depending on the situation. For example, Leonhard can hit all opponents around him with a tornado attack or, by unlocking the related skills, he can perform powerful sword slashing or multiple blows. Oiko starts out with simple magical missiles, but can unlock fireballs, chain lightning, and so on. The individual skills, represented by cards in the character sheets, can be improved by assigning them gems, which are obtained by carrying out missions. In this way, for example, it becomes possible to use several particularly powerful skills several times during a single mission, or their basic effects are enhanced (damage, healing, defense and so on). The number of gems that can be spent on a single card is determined by the available slots. If up to here everything seems extremely standard to you, the level growth will not change your mind, given that the experience points necessary to improve the characters are obtained simply by overcoming the missions and allow you to unlock new skill cards that add to those already possessed . After a handful of missions, we also get to unlock a shop where we can spend our hard-earned money to buy equipment. Also in this case it is possible to enhance the owned objects by applying gems to the available slots. In short, if everything seems extremely simple to you, that's because it really is. The only complication, if we want to call it that, is represented by the gems themselves, which are available in limited quantities and which therefore require you to make choices. Nothing dramatic, but a little planning is required to get the most out of individual characters. Combat system and missions Druidstone's combat system is also super easy to master. Consider that we didn't even have to follow the tutorial, made up of a series of messages that appear on the screen during the first missions, to understand the game interface, it's so derivative. It is simply based on a system that looks like a simplified version of Firaxis' XCOM series. We therefore have maps divided into square boxes with the characters managed through the classic double action: part of the points available each turn are dedicated to movement and part to attack, defense and other environmental interactions (opening chests, reading magic books, performing special actions specifics of individual missions and so on). Wanting to add some detail of secondary importance, after the standard actions it is possible to perform special moves (only if available), mDuring some missions, gems appear that give one more action per turn. Adding a little variety to the whole is the design of the individual missions, which fortunately offer varied and non-repetitive objectives. For example, already in the first one it is necessary to: clean up an area from enemies, destroy cysts within a certain number of turns, act as an escort for an elderly druid and light signal fires. Later you will have to face increasingly difficult fights and solve puzzles, based for example on pressing some plates or on reaching powerful gems. In reality, even regular missions often give the idea of having to follow specific patterns if you want to get to the end, which, if you like, is a serious limitation for the strategic nature of the game. Unfortunately, sometimes developing strategies is complicated, because the design provides for a continuous respawn of the enemies who, if faced head on, sooner or later end up destroying the party. However the title of Ctrl Alt Ninja is never particularly punitive towards the player, given that the main characters do not die but only faint and can be reused in subsequent missions even if they end up knocked out. New campaign missions are unlocked by completing the main objectives of the previous ones. At the beginning there are few, but soon the game map starts to fill up and you have a lot of choices, between those never faced and those that can be replayed to try to unlock secondary objectives. Let's say that in general when a mission is accessed for the first time it is really difficult to be able to complete it completely, also because they are often leveled in such a way as to be completed only in extremis due to particularly strong enemies or a quantity of shifts available too small. However, when you have more powerful characters you can go back and try again, taking advantage of the new skills available to unlock the fateful three stars (which yield loot and resources). Their enemies are the classic ones of fantasy games, including undead, electric jellyfish, ice giants, other humans of different classes and so on. Even the settings are not particularly original, since you start in a forest, but soon you enter a mountainous and volcanic area. There are also missions set inside strongholds with traditional architecture down to the last pixel. Finally, it should be noted that Druidstone: The Secret of the Menhir Forest is not a very long title, given that you can finish it in just under twenty hours on normal difficulty, with the game time varying depending on whether you want to complete all the objectives or not secondary. In any case, it has such a light game formula that many will certainly want to play it again at the highest level of difficulty, further lengthening the time spent in the Menhir forest. Finally, the level editor is worth mentioning, which allows you to create your own adventures and share them with others.", "date": "2019-05-28", "grade": "7.0"}