{"name": "Social Dev Story", "ref": "https://multiplayer.it/recensioni/social-dev-story-la-recensione.html", "text": "Kairosoft is a particular development team, which has built its fame not only by resorting to a single genre, but also to the same interpretation of this genre, so as to make any title produced easily attributable to the Japanese label. The game structure, the interface, the graphic style and the framing are practically always the same but the setting and the context to which the simulation is addressed change with each new send (except for the direct sequels, of course) . In every Kairosoft title it is a question of managing something and making it work at its best and at this point the options explored are really many: those who have faithfully followed the numerous productions of the team have been in control of development teams, anime producers, car stables racing houses, schools, farms, soccer teams, spas, shopping malls and pirate crews, to name but a few. With Social Dev Story, the subject of this review, we go back a bit to the origins, remembering what was probably the greatest international success for the Japanese team, or Game Dev Story. There is perhaps a bit of an exhaustion of ideas at the basis of this return to the simulation of videogame development, even if a slightly different area is explored here, namely the creation of mobile titles and for social platforms, thus inserting dynamics a a bit different than the romantic pioneering of console development of the origins in Game Dev Story. However, if you have already played the previous title, you will only be able to experience a certain dj vu with this Social Dev Story, as it is always a question of managing a development team engaged in the creation of video games. The mechanics are the same, that is, it is a question of navigating through various menus and looking for strategic combinations between the proposed options that can bring out increasingly ambitious and interesting video games, trying to increase the popularity of the software house but being very careful to re-enter the accounts both in the video game design phase and in the investments to be made for the expansion of offices and personnel. Compared to what has been seen previously, the possibility of combining different characteristics is added here (subject of video games, setting, genre and style) trying to find the right alchemy to gain a hold on critics and the public, always maintaining the taste for parody of the gaming industry at the heart of all game construction. Between simulation and parody As per Kairosoft tradition, the elements to keep under control in Social Dev Story are varied but everything is structured in such a way as to never be dispersive or excessively complex: the menus are many and stratified, the variables to take into consideration numerous, but the whole experience remains rather compact, becoming more complicated gradually as the development options and the size of our team increase. Compared to other games of the label, this seems to have a balance slightly shifted upwards in terms of difficulty, with the economic management of the company which is quite complicated and a certain difficulty in making ends meet right from the start. It is a question of understanding which are the most effective combinations between subjects, genres and methods of production and distribution to be more successful and this knowledge is obtained above all from experience, therefore some blind trials are necessary in the early stages. This randomness also derives from the sometimes excessive strangeness of the choices we have to make and of the game situations, all in line with the humorous style that pervades it but which sometimes does not make its development very clear. The structure of the game develops along two main lines: the actual development, which includes the design phases with the team ~meetings~ useful for unlocking new ideas and settings, as well as the actual videogame creation consisting of the various steps with the combinations of genres and game modes, and then the management of offices and personnel, which provides for a real construction of the company's spaces with the addition of furniture and infrastructures as well as personnel control between career management, hierarchies and roles, upgrades of various developers and salaries. The parody on the organization of the videogame industry is perhaps more pronounced here than in other cases, dealing with precisely those games that can be considered ~bad~ such as social and mobile titles, ironically precisely the market segments Kairosoft itself deals with. Then all the basic elements of this environment are reviewed, from the pressing requests of the publishers to the reviewsvisions of the specialized press, from the feedback from the players to the crunching to which we have to subject our developers with deleterious effects on their state of health and on the quality of the products, all represented with the light-hearted and facetious style that is typical of this software house. also underlined by the excellent graphics in full classic pixel art style now unmistakable of the label. Always in line with tradition, even the interface continues to be rather crude and in some cases not very comfortable or understandable, but it's another feature that Kairosoft has accustomed us to and that requires a certain period of acclimatization. Another potentially critical element is given by micro-transactions: the games of this label usually have a very soft approach to this aspect, preferring fixed on-screen advertising or invasive but essentially harmless videos, when not the possibility of buying the titles directly as a premium . Here we are faced with an economic system that revolves around gold coins, which are not often found in the game but are recharged in a very simple way using in-app purchases, which obviously pushes towards micro-transactions.", "date": "2019-05-25", "grade": "6.8"}