{"name": "Everybodys Golf VR", "ref": "https://multiplayer.it/recensioni/everybodys-golf-vr-recensione.html", "text": "Finding himself dealing with the PlayStation VR transposition of a series he's been working on for twenty years now, Clap Hanz could have easily limited himself to doing his homework: it would have been enough to take all the elements that made Everybody's Golf successful in course of all its chapters and add only that element of immersion typical of virtual reality to obtain a title that is certainly more than valid. The Japanese developers have instead preferred to dare with the present Everybody's Golf VR, cutting off cleanly with some stylistic and gameplay choices typical of the franchise and embracing a game model that is certainly more likely but which at the same time can give rise to some problems in terms of ease of use and quantity and variety of content. In short, a choice as courageous as it is risky: let's find out in our review if the final result was up to par or if it would have been better not to abandon the old route... More golf than everybody The first and most important distinctive element of Everybody's Golf VR compared to the previous episodes (and to the vast majority of golf games in general) is the abandonment of the usual gameplay mechanism linked to shots: forget the power and precision bars with a cursor to be stopped at the right time, because here the approach is decidedly more realistic, with all the positive and negative consequences that this can entail. Holding a Move controller (or a conventional Dual Shock, even if this is a less satisfactory solution) in your hands just like the handle of a golf club, you physically need to put yourself in a suitable position, lower your gaze to visualize the ball and swing with speed and angle appropriate to the power and direction you want to impart. A simulation in the true sense of the term, which works in an incredibly precise way especially considering the not exactly futuristic hardware of PlayStation VR: the software is able to faithfully implement the movements expressed by the player's body, with results that will immediately enhance the more skilled users or perhaps already accustomed to golf in the real world and who vice versa could cause some frustration in all the others. The learning curve of Everybody's Golf VR is therefore extremely variable from one subject to another, but it cannot be said that Clap Hanz has not done his best to accommodate everyone: an initial tutorial gives valuable advice on how to hit the ball, the settings allow you to define the gender, height and dominant hand of the player to improve detection, before each shot it is possible to make all the test swings you want and there is a very useful training field to practice before tackling the actual holes. These are divided into three environments to be unlocked progressively along with new sets of clubs, game modifiers and even different caddies each with multiple clothing items. Unfortunately, it is precisely on the pure and simple content front that Everybody's Golf VR shows its Achilles heel: you can only play single games without opponents with the sole purpose of improving your performance, without even the shadow of a mode tournament or any multiplayer component. There are a few modifiers that can shuffle the cards, but overall it really does lack a little more substance. However, the action on the field is so satisfying as to allow enthusiasts to overlook the serious shortcomings in terms of the playful offer of the Clap Hanz product. Executing a very long drive that takes you one step away from the green, coming out of a bunker with a textbook under shot or producing a perfectly calibrated putt and then watching with bated breath the ball heading into the hole are all actions that acquire a new flavor and tastier in this PlayStation VR version. The technical component then does its part, starting with a respectable graphic design that abandons the comic style of the previous chapters to marry a realistic cut: the settings are well made and detailed, and also the polygonal models of the caddies that accompany us in the field (the protagonists of some skits with an exquisitely Japanese flavor that can be chilling to a Western eye) are decidedly valid and animated in a convincing way. The work done by the developers on the interface is also excellent, with a few essential and clear indicators that are suspended on the starting tee like a sort of augmented reality inside virtual reality.", "date": "2019-05-23", "grade": "7.8"}