{"name": "Durango: Wild Lands", "ref": "https://multiplayer.it/recensioni/durango-wild-lands-recensione.html", "text": "Durango: Wild Lands is a project that NEXON has been pursuing for a few years now, even though the game only had a global launch a few days ago. The version we tested for this review can therefore boast a large number of updates, contents and refinements that the Korean development team has been able to implement over time, expanding the boundaries of the original experience towards unexplored territories and further enriching the package of features and facets. What has certainly not changed is the title's ability to destabilize, proposing an introductory phase which then turns out to be very different from the mechanics with which we will mostly have to deal. In practice, it all begins in a train carriage: there are several characters seated and we are asked to choose one on the basis of its physical characteristics. At that point we will be able to move from one carriage to another using an effective control system with an invisible and repositionable virtual analog stick, interact with some PGNs and get a minimum of familiarity with strictly survival elements, such as the need to satisfy hunger and thirst. Then all hell literally happens: the train is attacked by what appears to be a horde of dinosaurs, we have to take up an ax to try to save a little girl but it's all in vain, since a huge tyrannosaurus appears and rips through the walls of the train and causes a derailment. Gameplay and structure When our character wakes up, he has a bitter surprise: he is no longer in the world he knows, but in a sort of alternative dimension, a wild and hostile prehistoric land, populated by dinosaurs. He is picked up and cared for by a girl who explains where he is and what he will have to do to survive, in this case follow his instructions and complete more and more complex missions to level up, build weapons and objects, as well as entire settlements from a social point of view of the clans and with declinations also aimed at PvP. The first impact with this phase, we said, is destabilizing and underlines how the concept of narration is tackled in an at least bizarre way by Korean authors, but at the same time it confronts us with the best aspect of Durango: Wild Lands, namely the technical sector. We have not seen what the game was like when it was released in Korea, but the spectacle that appears before our eyes today is certainly remarkable: the characters boast very fluid animations, the general level of detail is excellent, the visual some water is really good and, in general, one has the distinct sensation of being faced with a high budget production; something that does not happen often in the mobile sector, in short. Of course, when you move into the innermost areas of the map, the situation inevitably changes due to the repetition of certain assets and the appearance of somewhat generic structures, but it is enough to come across the first dinosaurs to notice how much care the developers have put into the creation of the graphics and sound. The latter is characterized by a fairly epic soundtrack, with a cinematic cut, and by dialogues spoken in English with a sufficient level of acting. It is clearly a pity that the Italian is still missing for the texts, given that in the early hours there is a continuous display of information and exchanges that are a bit heavy. However, when you familiarize yourself with the interface, which still remains a bit dispersive, and you start ringing the missions, things mesh and you realize the potential of the game, especially if you have a passion for survival experiences. The assignments tend to repeat themselves, but the combat system boasts an unexpected thickness and there are dozens and dozens of unlockable skills with which to enrich one's repertoire, in the context of a quite substantial progression, which at least in the first hours does not set limits due to of the freemium format.", "date": "2019-05-22", "grade": "8.0"}