{"name": "Mordhau", "ref": "https://multiplayer.it/recensioni/mordhau-recensione.html", "text": "Mordhau is a multiplayer hack 'n' slash set in the Middle Ages whose large battlefields can accommodate up to sixty-four players. It's also one of the games with the most satisfying melee combat system ever, arguably superior even to that of Ubisoft's most expensive and famous For Honor. Developed by Slovenian Triternion using the Unreal Engine 4 and made possible by a successful Kickstarter campaign dating back to 2017 (which raised almost $300,000) it became an absolute hit on Steam, easily exceeding 500,000 copies sold in a matter of days. But to what is this result due? Combat system In the basic mode among the main ones of Mordhau, the Frontline one, the player assumes the role of a warrior selected from one of nine pre-set classes. If desired, it is also possible to customize it, but our advice is to do so only after having fully understood the combat system and having developed a style of play that makes this process more effective. However, the options are many: ranging from the choice of the skin color of our character (who without any claim to realism can belong to any ethnic group) to that of the equipment, which includes armor of all kinds, maces, swords, axes, bows and all the medieval trinkets you can think of. Obviously loadout is important, because it partly determines the style of play. In short, a warrior in full plate armor with a broadsword cannot expect to play speed. Be that as it may, once you have chosen you are immediately sent to the battlefield in a 32 against 32 match. The first games are traumatic: for newbies there is no mercy. The tutorial allows you to understand the basics of the game mechanics, but it is only practice that allows you to perfect yourself. It takes many games to start killing with awareness, to become even more competitive. Does that seem excessive to you? We can assure you that despite this Mordhau does not tire, because the player's improvements are palpable from game to game, even when killed very quickly. Basically the combat system is based on the timing of the blows and parries, so as to seem like a fighting game in certain situations. Most battles are won or lost by decisions made in seconds: rushing too fast a blow or parrying empty in front of an expert player means certain death, as well as running blindly towards the enemy thinking you are unbeatable. Note that it is not possible to perform moves in bursts and it is not possible to parry, because each action has its own recovery time, more or less short depending on the type of action itself. There are no winning moves in Mordhau, in the sense that every attack has a counter-move, and every parry can be reversed, whatever the weapon in hand. The inevitable result is that the winner is not so much the one who attacks first, but the one who is able to understand from the behavior of the opponent what his next move will be, so as to be able to anticipate it. All this translates into clashes that are so brutal, but at the same time also refined and very technical. What is not working Unfortunately Mordhau only really works in hand-to-hand combat, while it leaves something to be desired in other areas, i.e. in ranged skirmishes and in support classes. For example, archers are penalized by the excessive search for realism, which requires quite a long time between the release of one arrow and the next, as well as a certain difficulty in aiming due to the unavoidable oscillations of the reticle. It's clear that making archers too accurate would have detracted from combat, but as it stands now it's a pretty frustrating class to use. The problem probably lies in the very nature of Mordhau, which simulates but up to a certain point, for example by giving armored characters a freedom of movement that in reality they shouldn't have and by not trying to reconstruct in any way the real conditions of a field of medieval battle, although the maps are quite accurate in the elements that compose them and offer incredibly tense situations (despite the online). In short, archers in the Middle Ages didn't fight in the open field by bouncing along with the soldiers, so it's inevitable that using them like this makes them a little more clumsy than they should. A similar argument also applies to other classes, such as those of engineers, who build siege engines: in most occasions they are useless, given that the soldiers manage to solve most of the fights without the need for support. Let's specify better for: all classes can give their satisfaction, especially to those who dedicate the right amount of time to them, but with the growing diffusion of the game, players' attention is focusing only on some of them to the detriment of the others, because they are the ones with which you get the best results and have the most fun with. Other modes Mordhau offers two other main game modes besides Frontline (there are also classic ones like 1v1 and deathmatch, not included in matchmaking). Those who don't want to jump right into the fray should try the Horde mode, in which you have to face waves of CPU-driven enemies of increasing strength as a group. As is often the case in similar modes, encounters yield resources that can be spent on buying better equipment in order to prepare for the next wave. Mind you that this is not an easy mode, but at least it allows you to familiarize yourself with the combat system without having to face other human players, who are really more ruthless than artificial intelligence. It is also unusually rewarding and offers moments of great brutality. The third mode, the weakest one in our opinion, is the classic battle royale. The ingredients of the genre are all there: equipment to find, gradually shrinking play area, victory for the last player standing and so on. The problem is that the game system and the general slowness of the gameplay don't make the games particularly exciting. That is, in our opinion it doesn't make much sense to buy Mordhau for the battle royale mode, when there is so much better around. From a technical point of view, Triternion's game was only half successful. The graphic rendering is good, with detailed characters and particularly successful effects, such as those of the killings (although the budget available to the developers was not huge) but at the same time there are large drops in framerate on some maps, even in conditions of low crowding . Problems also from the point of view of connectivity, with the servers that still don't seem to be able to handle the load of players who have found themselves having to manage. In recent days, the situation seems to have improved compared to the launch, but perfection is still far away.", "date": "2019-05-20", "grade": "7.8"}