{"name": "Team Sonic Racing", "ref": "https://multiplayer.it/recensioni/team-sonic-racing-recensione.html", "text": "Almost seven years after the arrival of Sonic & All-Star Racing Transformed on the market, Sumo Digital returns to deal with the kart racing genre in an attempt to offer the public an alternative to the inevitable Mario Kart. The eighth chapter of the ultra-twenty-year series by Nintendo has not stopped enjoying enormous success globally - thanks to the publication of the Deluxe edition on Switch - but the lack of other proposals has evidently convinced SEGA to get back into the game by bringing Team Sonic to the market Racing, of which you read the review, a new and frenetic arcade title entirely set in the Sonic the Hedgehog universe. After having had the opportunity to test the final version, we are ready to give you our opinion in the review. Tracks and power-ups: dj vu guaranteed Unlike what happened at the time of Sonic & SEGA All Stars Racing and Sonic All-Star Racing Transformed, where the cast was distinguished by a certain variety, Team Sonic Racing aims to favor a monothematic approach. The roster includes a total of fifteen pilots, among which we find Knuckles, Tails, Shadow, Vector and the inevitable Dr. Eggman. Each of them has variable characteristics that take into account indicators associated with acceleration, speed, defence, handling and turbo, capable of slightly varying the characteristics and approach of each competitor once they set foot on the track. The developers have not ruled out the possibility of introducing additional subjects from other SEGA titles, but at least for the moment we have to be satisfied. The other change that immediately catches the eye, if we compare this product with the previous attempts born from Sumo, concerns the elimination of the transformations of the vehicles, to instead maintain a much more traditional approach which in fact brings the game considerably closer to Mario Kart, with all the limitations that this choice entails in terms of game dynamics, structure and general atmosphere. The proposed tracks are a total of twenty-one, divided into seven different worlds; twelve were created from scratch, while the remaining nine were recycled from previous titles. The tracks present a fair variety of solutions and approaches, although even on this front one cannot help but perceive more than obvious similarities with the classic Mario Kart ones. The design of the paths is discreet, even if less varied in solutions in terms of shortcuts and alternative routes than the much more illustrious competitor. What is not fully convincing, from this point of view, is above all the presence of portions that turn out to be a little too chaotic to manage, sometimes too dense and in other cases not always very clear in visually separating the passable areas from those which slow down the movement of your vehicle. Team Sonic Racing provides players with a total of 14 power-ups, which can be selected as usual by collecting the crates distributed along the track. Also from this point of view the game is very derivative, providing us with a series of alternatives that closely resemble its older cousin. For example, we have various types of missiles, a box to be left on the path to hinder opponents, a laser beam and musical notes that appear on the screen to distract the player from driving. There's even the Auto Missile to quickly catch up when you get entangled in the rear. In short, the dj vu effect is guaranteed, and it's a shame because some slightly more varied and original solutions would have enhanced the game by making it a little more recognizable. It would also have been possible to improve the consistency of the drift, often all too immediate and simple to manage, while returning the right impression of speed when using it and then receiving a good dose of boost in return. All in all, call the front and side stunts, which in essence practically never lead the player to make mistakes. We then found the developers' choice to introduce cartoons with the comments made by the characters during the course of the game not very understandable, completely superfluous but above all annoying to see while you are in the thick of the action. Game mode The main quality of Team Sonic Racing is linked to the presence of the game mode which involves competing divided into teams. In this case each team is made up of three drivers, for a total of twelve players lined up at the starting line. Each formation has the task of placing itself at the top of the standings, so as to obtain high scores which will accumulate at the end of the match, sanctioning the winning teamtrice. When a member reaches the head of his group, those in the rear are put in a position to take advantage of a luminous trail that increases the speed of travel. The other peculiarity concerns team actions, which provide for helping each other on the track, for example by sending objects, up to loading the Team Ultimate indicator. Once the bar positioned behind your car fills up, all you have to do is press a button to activate a turbo that lasts a few seconds, with which you can quickly gain ground on other competitors and at the same time continue to use even the normal power-ups available on the track. In this phase you cannot be hit and it is also possible to knock out opponents as you pass. Alternatively, Team Sonic Racing plans to tackle the typical Standard Race, or try their hand at the equally traditional Grand Prix, where you participate in a small championship divided into four stages spread over as many tracks. In the single-player mode you also access the Time Trial, which requires you to limit your travel times in an attempt to grab the platinum medal. Like any exponent of the category, Team Sonic Racing also gives its best when enjoyed in company. Clearly, the split-screen mode for up to four players could not be missing, which allows you to take advantage of both the versus mode and the team variant. Then we have the Team Adventure mode, where you are essentially introduced to the basics of the game through the completion of a series of tasks that can be completed both in single and in co-op. SEGA defines it as a narrative mode, although the short stories and dialogues that intersperse the missions are laughable, as well as completely superfluous to listen to. By completing these individual events you get credits which are then invested in the purchase of Mod Capsules; by doing so, a series of objects are unlocked for the customization of each driver's vehicles through modifications and aesthetic decorations. By completing the objectives set by these individual events, you can obtain stars and keys useful for accessing the following challenges. To close the picture there is the online multiplayer mode for up to a maximum of 12 players, in which you can access team or standard races, opting for the casual game or vice versa for the classified one. During the test sessions organized in the last few days we have not encountered any particular problems, but it should be noted that it was not possible for us to face matches with more than two or three players connected at a time.", "date": "2019-05-17", "grade": "7.0"}