{"name": "Total War: Three Kingdoms", "ref": "https://multiplayer.it/recensioni/total-war-three-kingdoms-recensione.html", "text": "Total War: Three Kingdoms has its weaknesses in its innovations, as we will see in the course of the review. Creative Assembly's Total War series has a peculiar feature, which is that it doesn't have really bad chapters. There are more and less successful ones, yes, but we are still talking about above-average products that a strategy enthusiast can buy with his eyes closed, simply by following his preferences in terms of scenarios. Of course, it must be said that from one Total War to another it is increasingly evident that the developers are in trouble in terms of innovations, probably more difficult to conceive and implement than you think. After all, we are talking about a well-established game formula that allows variations, but not revolutions, unless you try to start completely from scratch. Total War: Three Kingdoms is yet another good Total War that stands out from the others more for the setting, the China of the Three Kingdoms (Wei, Shu and Wu) of 190 AD, than for some new game mechanics. Chosen one among the many leaders available, the player's goal is to reunite the China described in the Chronicle of the Three Kingdoms by Chen Shou, dating back to the third century AD, and in the Romance of the Three Kingdoms by Luo Guanzhong, written in the fourteenth century , in the throes of a deep crisis due to the end of the Han Dynasty, which remained in power for four centuries. It is one of the most loved periods in Chinese history, as well as one of the most fictionalized, given that there is mainly general information about it and it is populated by a large number of important figures, who have inevitably marked oriental culture. It must be said that Total War: Three Kingdoms is certainly not the first video game with this historical setting, not even among the strategic ones, given the thirteen chapters of the Romance of the Three Kingdoms series by Koei Tecmo, but only a handful of games have been translated into one european language. In fact, those who don't follow the oriental video game industry could be faced with something relatively new, which is not a bad thing. Strategy map and diplomacy Total War: Three Kingdoms offers gameplay that is easily recognizable by anyone who has played any exponent of the saga in recent years. The game is divided into two macro sections: the strategic one, which is managed from a general map of China, and the tactical one, with clashes taking place on open battlefields or in cities and villages. The strategy map has a myriad of different functions, allowing for the expansion of the kingdom in different ways. Basically we have to employ resources to be able to accumulate the sums we need to expand the army, so as to be able to face the strongest enemies, but between saying and doing there are: cities to manage, making them develop so as to improve their productivity and the defences; territories to be occupied; borders to defend; diplomacy to take care of and edicts to be issued, with the latter unlocking bonuses and technologies and which are selectable on a kind of research tree, made in a pretty oriental style. To all this we must also add our capricious court, made up of personalities who support us on our path towards domination, made up of characters who must be satisfied in their requests if we do not want them to leave or, worse, to plot some plot against we. To satisfy them, it is enough to give them money and power, the latter represented by a leadership role in our government, but it is often difficult to please everyone and therefore problems are never lacking. In addition to managing the court, the player must also maintain relationships with other factions. From a strictly diplomatic and expansionist point of view, Total War: Three Kingdoms offers a truly rational approach to the problems deriving from the rise to power. Conquering everything and everyone by just fighting is simply not possible, because by spreading too quickly we end up antagonizing all faction leaders, with subsequent reprisals likely to temper our leadership race. So you have to go slow and make treaties, swallow some bitter pills to have the friendship of the strongest factions, such as becoming their vassals, standing up against common enemies and going to war against leaders who are indifferent to us just to help another who it can give us some advantages. There is no shortage of arranged marriages, allies used as bargaining chips, cities sacrificed for final victory and much more. Let's say that Creative Assembly has done everything to make diplomacy central, keeping the promise to completely overhaul it compared to the old Total War games, where it was much weaker. It was a lotalso made to give meaning to the objectives of the campaigns of the individual leaders (the missions to be completed that follow a precise order and which explore the plots of the Three Kingdoms), which have proved to be an excellent guide for taking the first steps in the game without uncertainties and to point out elements of the plot that might otherwise have been overlooked. The super heroes As mentioned in the previous paragraphs, another of the major innovations introduced in Total War: Three Kingdoms is the greater focus on heroes: unfortunately it is also the most controversial. Their weight on the gameplay is enormous, especially on the battlefield, where they display a power that is unmatched. Maybe really too much, so as to unbalance some situations making them absurd. For example, a hero unit can defeat an entire enemy platoon by itself, to the point of making the adoption of more refined strategies superfluous, especially when the situation is uncertain. Beware as heroes are not immortal, but it usually takes other heroes or large numbers of troops to defeat them, which creates major tactical inconsistencies, with these single units managing to terrify cavalry and archers alike, especially when well equipped and high-end. The hero units from this point of view are very well-kept, with dedicated skill trees, different according to their specialization, and with a wide range of objects and mounts that can be found by playing, which give the whole thing a certain role-playing touch. Heroes are also essential on the tactical map, where they can be sent to perform certain tasks (collect taxes for example), so as to alter the population's productivity and happiness. From this point of view, Creative Assembly has done an impeccable job of differentiating the heroes and giving them their own character and specific skills, so much so that their usefulness varies enormously depending on how they are used. However, we confess that after a few hours of play with the (super) heroes active (Romance mode), we switched without too much guilt to the Records mode, which at least on the battlefield makes them very normal units, as it should be . Unfortunately it is only with this mode that the gameplay of Total War: Three Kingdoms manages to shine, but at the same time it loses one of its few important innovations, thus making it even more similar to the other chapters. In short, the battles become the same as always, with large armies made up of hundreds, if not thousands of units facing each other on different terrains. The classic elements of the series are really all there, with the player moving individual platoons after having deployed them in the initial phase, with vegetation that can be used to hide troops and to make them more difficult to hit, with barricades that can be placed to protect the access roads to cities and so on. Battles are decided by the placement and skill of moving units, as well as their number. As in the old Total War, it is also possible to win some desperate fights by adopting more elaborate tactics (except when the resolution is left to the CPU), obviously all provided that, as already mentioned, the heroes, who create significant imbalances and they literally take over the whole scene, marginalizing the other units. China of the Three Kingdoms Creative Assembly has worked a lot on the scenario of Total War: Three Kingdoms, both in terms of graphics and interface, with the latter that sometimes pays in legibility stylistic choices, with overlapping elements and others that remain in evidence despite being inactive. In any case, it is undeniable that a great deal of research has been done to make the different graphic elements that make up the game as characteristic as possible. For example, the heroes' units are colored differently according to their characteristics, following the Wu Xing philosophy that links each color to an elemental force, while many interlude sequences are created following the ink-shaded painting style, in so as to immediately convey that cultural exoticism so loved by the Western public. Too bad that the dialogues and the directorial style of the more traditional interlude sequences are not treated in the same way and follow Hollywood models too much. These are obviously secondary elements for a strategic one, which very few will notice, for what remains a generally very good job, despite the final effect being that of a fake Chinese vase. From a more strictly technical point of view, Total War: Three Kingdoms is in line with the most recent Total War, inparticular in the graphic rendering of the battlefields, where we have not experienced major slowdowns despite the very high number of units fielded. Furthermore, while playing we have not encountered particularly annoying bugs or crashes, but without a wider case study we cannot take the absence of problems for granted. The music is also excellent, also in an oriental style.", "date": "2019-05-16", "grade": "8.0"}