{"name": "Rival Stars Horse Racing", "ref": "https://multiplayer.it/recensioni/rival-stars-horse-racing-la-recensione.html", "text": "The passion for horses must be a serious matter. We say it hypothetically, because honestly we don't have much to do with this area, but looking at the amount of films and video games that deal with the subject, one thinks that such a profitable source of inspiration can draw strength only from truly intense, which deserve great respect. We approach the subject with a total layman's perspective, but it is with the thought turned to a subject capable of moving emotions and dreams that we find ourselves facing Rival Stars Horse Racing in this review. To tell the truth, the game really does a great job to introduce any user, even the furthest from the equine world, within its complex mixed structure between racing, simulation and management, somehow managing to be also engaging. beyond what one may think about horse racing. There is also a story behind it: the protagonist is the descendant of a family of jockeys traditionally linked to racing horses, called upon to take over the reins of the family business that has fallen into disgrace to give new glory to the house, victory after victory. It is therefore easy to identify the two main guidelines on which the game action is focused: on the one hand the actual race, with the direct guidance of the horse on the track and on the other hand all the numerous aspects to be taken care of in order to carry on the ranch and horse farm. Within this hybrid structure there are a large number of possible actions and elements to keep under control in order to obtain the best results in the race, continuing the story through the achievement of the numerous objectives set by NPCs, employees and colleagues of the farm. Rival Stars Horse Racing immediately proves to be a rather deep but well manageable game, thanks to an extensive tutorial that guides us in every single aspect, in addition to the ~missions~ of the story which, in fact, serve to give an direction to our actions and they also work well as a progressive introduction to the various facets of both racing and the expansion and maintenance of the arena. Horses and micro-transactions Rival Stars Horse Racing looks very good, due to a fairly well-made graphic system that would look good even on major platforms and a good clarity in terms of menus and interface, all elements that facilitate immersion in a game that has a lot of contemplative and few truly active elements, given that even the racing phases essentially require strategic management of the horse's forces, more than any ~driving~ skill. For the rest, it is above all a question of investing resources for the expansion of the ranch structures, training the horses, participating in the races and expanding and managing the breeding through the purchase of new specimens and the mating, obviously aimed at giving birth subjects endowed with remarkable characteristics and high profile pedigree. In short, as a good management system, the game offers us to click on icons and think about controlling various economic aspects, even if the phases of the races manage to break the monotony a bit (although they are themselves somewhat repetitive). All this to say that a minimum of attraction for classic management is necessary to fully appreciate the game in question, which still manages to introduce us quite well into its meanders, even without being big fans of horses. So far, so good, but the cumbersome problem of micro-transactions emerges after the enjoyable first hours of the game. Being a free-to-play, the whole structure is based on expectations and the expenditure of currency to avoid them, in a mechanism that becomes increasingly oppressive as we enter the more advanced stages. If at the beginning the collection of in-game currency and resources necessary for improvements to the structure is particularly simple, with purchases that are sporadic and in any case well sustainable with the rewards that are obtained simply by playing, the balance becomes progressively more unfair, with competitions becoming increasingly selective and difficult, training requiring breaks of several minutes, and resources for construction, management and breeding increasingly scarce unless spent with real money. The constant presence of notices on the various ~VIP passes~ (called differently but with the classic system of the special paid package) refer to the concept of pay to win, even if the marginal presence of online multiplayer makes it less critical than usual .", "date": "2019-05-01", "grade": "6.5"}