{"name": "Active Soccer 2019", "ref": "https://multiplayer.it/recensioni/active-soccer-2019-recensione.html", "text": "Those who grew up in the era before the explosion of FIFA and Pro Evolution Soccer will probably remember with pleasure the distinctly arcade-style football titles that were very popular between the end of the 80s and the first half of the 90s. No-frills productions such as Sensible Soccer, Kick Off and Goal! they soon became a legend for an entire generation of young boys who grew up on bread and the Amiga. Active Soccer 2019 is therefore aimed primarily at that niche of nostalgics who still today remember with pleasure the countless hours spent in front of a virtual ball, alone or in the company of childhood friends, when the internet was still at the dawn of its existence and the online multiplayer was seen as a sort of wet dream reserved for the future. Gianluca Troiano and the Italian studio The Fox Software already have some experience in the most genuine revival of the arcade-style football of the past: after the chapters published in 2015 and 2016 on mobile devices and Xbox One, the Italian team returns to the office with a new version, this time destined to land on the screens of Switch. Nintendo's hybrid console would seem to be the ideal place for a product of this nature, so let's find out more through our review. Virtual football of yesteryear Active Soccer 2019 offers a rich variety of teams divided as usual between the normal club teams and national teams. Obviously, there are no official licenses, to the sure advantage of variety: in fact, there are no less than 1,250 formations overall and more than 25,000 players. It is also interesting that a good number of formations from the past are included in the count, because in fact a bit of healthy football from the 80s and 90s cannot ignore the old protagonists who made us love it. Everything is made even more nostalgic by the fact that you can access the Team Editor. Just as it was in the days of Sensible Soccer, the names of squads and individual athletes can be changed one by one to be replaced with their real counterparts. Beyond this pleasant opportunity, Active Soccer 2019 offers a very basic control system, entrusted to the four buttons of the Nintendo Switch pad for managing the normal pass, the filter, the cross and the shot. A specific input is missing for light contrasts, regulated by simple marking with the left analog stick, but obviously, if necessary, it is possible to close the opponent's advance with a nice slide worthy of the best Paolo Maldini. In this sense, the title of The Fox Software succeeds in the purpose of entertaining immediately, capturing very well the spirit of the titles that inspire it. Simplicity which, moreover, can be modulated both by selecting the level of difficulty of the opponents and by deactivating automatic dribbling and facilitated movements to have a distinctly old school feeling in return. During our game we could not help but encounter a limited reactivity of the opponent's artificial intelligence, not used to press the player during the ball possession phases. Another recurring issue we've encountered is the high frequency of woodwinds that happen to hit in virtually every game; a factor that presumably could be solved with the first patch already confirmed by the developers, which among other things will include improvements to the graphics sector, raising the usable resolution in portable mode from 900p to 1080p and an improved frame rate. Before each match, a wide range of settings can be set, especially from the point of view of the shots. The orientation of the field can be fixed vertically, horizontally or diagonally, but it is also possible to decide at what distance and at what height to set the camera, depending on your preferences. The traditional one positioned vertically is still the best to bring back the challenges in Sensible Soccer. Other settings include the choice of variable weather conditions and three different game speeds. Predictably, the available modes maintain a very standard approach: in addition to the quick game and the simple tournament of a minimum of 4 to a maximum of 64 teams, one can opt for the very classic Career mode in which to take part in national and international competitions, taking care to also manage the transfers and financial movements of the company. Finally, it is possible to access the Training section, where you can practice across the pitch or try your hand at executing free kicks and penalties. The highly conservative setting of Active Soccer 2019 is evidentalso in the management of the multiplayer which, at least for the moment, only plans to try their hand at fierce local challenges for up to a maximum of four players. The tradition has also been respected as regards the creation of the soundtrack present in the game menus, entrusted to the care of Chris Huelsbeck. As perhaps the ~older~ ones will remember, the German composer is remembered for having created the music for titles now lost in the folds of time such as Turrican and The Great Giana Sisters.", "date": "2019-04-28", "grade": "8.0"}