{"name": "Staxel", "ref": "https://multiplayer.it/recensioni/staxel-recensione.html", "text": "Before proceeding with the Staxel review, we are contractually bound to offer you a quiz without prizes. Let's get started right away. The player is called upon to restore an inherited farm trying to restore it to its former glory and make it prosper. What game are we talking about? Stardew Valley? Perhaps. The game world consists of 3D cubes that can be demolished to get raw materials to use in the fields or to build things. What game are we talking about? Minecraft? Perhaps. In addition to the farm, you also need to take care of a village full of nice and helpful people. What game are we talking about? Animal Crossing? Perhaps. Gameplay But no, dear readers, we're talking about Staxel (which surprises you), a game so derivative that it's almost endearing. Our adventure begins with a short tutorial, which explains the basic mechanics, so we have to dedicate our soul and colon to our farm, tilling the land, planting vegetables and rebuilding the infrastructure necessary to make it thrive, such as barns, chicken coops, fences and more. In reality, the fulcrum of the game is another, that is, making oddities to show to friends in multiplayer and streaming, given that there is no real strong goal to pursue and that the resource management part is the most bland could exist, considering that in less than a year of game time you manage to have a working farm that produces resources at will to do practically everything. In reality, some village characters can give us quests, but they are really simple and repetitive in their objectives (go to point A and take object B, bring object X to character Y and so on), as well as without a common thread , so after a while they just become a nuisance and you just end up neglecting them. Seasonal events occasionally pop up and add some variety, but even these are repetitive and sketchy and ultimately add little or nothing to the gameplay. For the rest, a decent narrative side is simply missing, which those who have played Stardew Valley know are not secondary to cement the affection for the game world and its inhabitants, especially in such an intimate and familiar scenario. After all, in Staxel we have such freedom that we can completely demolish the houses of complete strangers without being told anything. We understand leaving the initiative to the player, but in this way certain aspects of the gameplay completely lose meaning and the very presence of the village becomes useless. In short, apart from the farm, the Stardew Valley side of Staxel is really deficient and the relationships they establish with the characters of the village are of an unheard-of paucity. The Minecraft side also suffers substantially from the same problem, i.e. it is well done but does not reach the glories of its model. There are resources to gather and use to build items that give you access to more complex designs, and you can customize just about everything. The variety from this point of view is good, but Mojang's title is much more complete in materials and obtainable results, so much so that it is not clear why anyone should prefer Staxel if they like this type of gameplay. From a technical point of view, however... no, no 'instead'. Here too the inspiration from Minecraft is evident: blocky game world with ultra-stylized models. There are a few more details, but nothing that makes you cry for a miracle. In summary, Staxel works, but after a few hours of play it shows major structural limitations that make it an end in itself. In a certain sense it is the classic streaming game which does not even have that shred of originality to give it something unique.", "date": "2019-04-23", "grade": "6.0"}