{"name": "Suburra: The Game", "ref": "https://multiplayer.it/recensioni/suburra-the-game-la-recensione.html", "text": "Suburra: The Game is a point-and-click adventure starring the characters of the Netflix series of the same name, focused on Roman crime. The player plays the role of three characters that you should know well, namely Aureliano, Lele and Spadino, selectable at the beginning of each chapter. Ours have to deal with a risky and complicated situation involving the Vatican, a stolen briefcase, a little boy killed and many shady individuals (protagonists included). The first exploratory phases also act as a tutorial and explain the simple interface that allows us to move and interact with the various hot spots with just a few taps, all perfectly visible thanks to icons that indicate their presence and function. When needed, that is, in the event that one or more criminals are faced with it, the combat mode can be selected, which essentially requires hitting the opponents at the right time, observing the filling and emptying of a fist-shaped icon. Although exploration and fighting are very present, the fulcrum of Suburra: The Game are the sequences with multiple choice dialogues, which allow you to delve into some aspects of the plot and to get more into the spirit of the characters, to get to know their different facets. Conducting the conversations is up to the player, who from time to time has to choose which answers to give, as well as whether or not to share some information obtained during the missions with the other gang members. Different choices not only lead to different reactions, but also positively or negatively influence the relationships within the gang itself. Obviously the texts are written following those of the TV series, so the Roman dialect, or what remains of it today, abounds everywhere. Gameplay In strictly narrative terms, the situations that we find ourselves experiencing in Suburra: The Game are those typical of the TV series and of the crime series genre. The protagonists are the classic mavericks who give themselves to crime by predisposition, family ties or simple desire for social revenge. Violent, ruthless and determined, but at the same time driven by a system of values of their own, they visit seedy bars, brothels, rival hideouts and all the most iconic places of the genre they can think of. In total, the game is divided into seven short chapters (you finish in a couple of hours) which correspond to as many missions. During the latter, in addition to beating and talking, there are also valuables (joints, cocaine and so on), which can be resold on the black market to make money and buy equipment. At the end of each chapter, all the loot accumulated with the selected character must be shared with the gang, even if you can decide from time to time to hide something in order to have more resources to use during missions. The micromanagement side of Suburra: The Game is all here. If desired, there would also be a stylized map of Rome used for getting around, but in reality it doesn't offer much food for thought, given that you always know where to go and the places that can be visited from time to time are decided by the plot, without the possibility of revisiting those already explored, apart from hideouts, gang meeting point and fence. Technique On a technical level Suburra: The Game is characterized by good low-poly graphics, which makes the atmospheres of the series well. The developers managed to convincingly reproduce some landscapes of the Roman suburbs, even with limited means. In particular we are referring to some buildings, which were evidently designed starting from real views. Even the various animations are made with care. It must be said that the game world is not huge, but we are always talking about a title sold for a few euros and without microtransactions, so it was not legitimate to expect more. Also noteworthy is the use of augmented reality through Google's Arcore system. Used at home with a Huawei P30, it didn't work very well for us, in the sense that it proved to be counterproductive in confined spaces, where 3D objects forced us to move away because they were too intrusive. In any case, it is an accessory function that can be deactivated, so in the case it can also be ignored completely and live happily.", "date": "2019-04-19", "grade": "7.0"}