{"name": "Super Dragon Ball Heroes: World Mission", "ref": "https://multiplayer.it/recensioni/super-dragon-ball-heroes-world-mission-recensione.html", "text": "The success of Dragon Ball is there for all to see: even thirty years after its first release, Akira Toriyama's manga continues to be very popular on television, in the cinema and in video game stores. While Dragon Ball Super: Broly also arrives on the big screen in Italy and the sequel series is preparing to continue after a creative break, video game tie-ins follow one another on the shelves that alternate excellent productions - such as Arc System Works' Dragon Ball FighterZ - crazy shit. At first glance, Super Dragon Ball Heroes: World Mission would seem to fall into the second category, but things are not quite as we will explain in this review. Inspired by the arcade cabinets that we have been finding in Japan for some time now, the Dimps signed title does not need real cards to work on Switch, the ideal console to better enjoy an experience that is decidedly different from the usual fighting games. History Dragon Ball Heroes cabinets catapult players into a series of stand-alone adventures that work a bit like Dragon Ball animated feature films, introducing many new characters into Toriyama's universe. Many of them, however, come from parallel or hypothetical timelines, following the mythology established by the two Dragon Ball Xenoverse. In this way, Bandai has managed to design hundreds upon hundreds of different cards, representing not only the iconic characters of the series - such as Goku, Vegeta, Trunks and so on - but also fusions, transformations and variants that are as unthinkable as they are bizarre. Have you ever wondered what Nappa would look like in Super Saiyan version? Or what would Gotenks look like as an adult? Super Dragon Ball Heroes: World Mission will answer these and other perverse curiosities with over a thousand cards, although the most recent expansions of the arcade cabinet are missing. Story mode is completely new; while not exciting at all, the chapters into which it is divided tell a little story that will not fail to make the super fans of the series smile. The player takes on the role of a kid who is passionate about Dragon Ball Heroes, the card fighting game that is all the rage in a world where Toriyama's series is practically revered. We are more or less at a cross between Inazuma Eleven and Gundam Build Fighters, get an idea of the absurdity and multiply it by ten when Great Saiyaman III appears, a hero who will push us to literally enter the virtual video game to investigate the strange phenomenon that is materializing the worst enemies of Goku and associates in the real world. The protagonist and the friends who will join him will face the crisis with optimism and enthusiasm, happy to be able to fight alongside their heroes, a little less to face real aberrations of history that they have learned to love. The story, as we said, is nothing special: the game tells it through kinematics filmed awkwardly and subtitled in Italian, but the dialogues are often sparkling and make fun of the increasingly absurd drifts that the plot takes, staging clashes between strange formations and surprising. The various Dragon Ball characters interact little in this scenario, being mostly cards at the service of the protagonists. The speech is slightly different in the Arcade mode, divided into various sagas that pit the player's decks against the enemies of the moment, often coming from alternate dimensions and realities. Playing Super Dragon Ball Heroes: World Mission for the story frankly makes little sense. All these sagas and modes only serve to organize the hundreds of missions that the player can go through to unlock features, rewards and other bonuses, or simply to challenge themselves and experiment with different decks. Technical Problems Obviously there are no physical cards in this Dragon Ball Heroes spin-off, but that's exactly why we suggest the Switch version: the game is clearly a former Nintendo 3DS title ported to the new platform of the Kyoto house and to PC, impression suggested by a decidedly ancient technical framework and confirmed by the myriad of mini-games and touch interactions that appear on the screen, without even changing the wording to adapt to another type of input. And so the game will sometimes ask us to touch the screen or swipe your finger across it, even if you are playing with a mouse and keyboard or with the Joy-Con in your hand and the console stuck in its Dock. Beyond these inconsistencies, which are ultimately resolved by moving the sticks or pressing the keys, at first glance Super Dragon Ball Heroes: World Mission seems like a decidedly crude title. The polygonal models are discreet but scarce in terms of detcuts and definition, also due to a particularly incisive aliasing especially when playing on TV. Once again, the portable mode of the Nintendo hybrid console reduces the defect on the small screen, but it certainly cannot reprogram the rigidity of the animations and the poverty of the scenarios in which the battles take place. In short, technically Super Dragon Ball Heroes: World Mission is a decent disappointment that risks alienating interested fans, and this is a pity because behind its antiquated appearance hides a very interesting and engaging strategic game. We have to come to terms with a series of important obstacles, first of all the impossibility of skipping the skits during the fights, the repetitive frequency of which gets boring within a few hours, but, overcoming them, a much deeper and more profound title emerges. longer than expected. The online mode Cross and delight of the most competitive players, the Online mode represents a substantial extra if you fall into this category of users. We have ascertained a fair stability of the servers, but also a low turnout of players: keep in mind that to play online you need a subscription to the Nintendo service, of course, so we considered the Online mode an added value, evaluating Super Dragon Ball Heroes: World Mission especially from the point of view of massive single player content. Cards against cards The Japanese play Dragon Ball Heroes with the cards they have physically collected, scrolling them on the reader of the cabinet to interact during the clashes between the deck they have prepared and that of the opponent. The video game obviously doesn't need this mechanic: the cards are obtained by completing missions, by defeating certain enemies or, much more simply, by randomly drawing them in the gacha shop after exchanging the tickets obtained in the other modes. Double cards turn into ticket fragments that the player can then use to draw other cards, but also accessories, consumables and so on. The interesting thing is that, using the materials obtained by playing, it is even possible to create completely customized cards in the Laboratory, as well as entire missions to be uploaded to the network for other players. Between this option, the Arcade, the Story, the Tournament and the Online mode to challenge other players, Super Dragon Ball Heroes: World Mission therefore reveals itself as a title rich in content. A series of tutorial missions explain the combat system. It may seem simple enough at first; it's actually quite complicated, above all because of the countless variations that intervene during the clashes based on the skills that distinguish the various cards. The same characters can appear on different cards with completely different abilities and bonuses, so even the less rare cards end up having their own importance and usefulness, refuting the initial impression that it is enough to form a deck with the most powerful Dragon Ball characters to win any game. encounter. Some missions have special conditions that prevent the use of certain cards or inflict disadvantages that only certain cards can prevent, forcing the player to review their deck. Fortunately, up to fifty different ones can be saved. In general, the player can build their deck as much as they like, but it's important to balance the forces on the field if you want to win. The cards are divided into three types: there are Heroes, Elite characters and Berserkers. Types characterize the balance of cards in terms of power and vigor, the stats that essentially govern battles, but it is important to remember that cards of the same type can attack simultaneously and that each deck is composed of a total of seven cards. The player lays out the cards on the battlefield, divided into three front and one back strips. The front three stripes determine the performance of the cards played: the closer they are to enemies, the more damage they will inflict and the more stamina they will consume. If the latter is completely discharged, the fighters are stunned at the mercy of the opponents, so it is important to understand when to attack and when to recharge the cards in the back strip, where they will rest and, at the same time, support the companions still in battle with some skills. The fights are essentially divided into up to five rounds. Each round begins when the player gives up combat or the setup time runs out. At that point, he attacks the deck that has accumulated the most power first by deploying his cards. The power simply determines the order in which the two decks will attack, but every three thousand points one energy point is charged andthe latter, in the following turn, will allow the cards to use the famous special attacks of the characters represented. All of this, however, only happens if the player wins the moment of the ~impetus charge~: a kind of quick time event that determines the amount of damage inflicted or received during battle. It is for this reason that it is not possible to skip the skits in which the characters fight and it must be remembered that some cards even influence the difficulty of the quick time event in question. The clashes of Super Dragon Ball Heroes: World Mission are full of mini-games that require you to touch the screen in various ways, perhaps by scrolling your fingers, or moving the cards from one point to another, and each mini-game expresses a different mechanic, staging the combined attacks of two or three characters, the evocations of the dragon Shenron and the dragon Polunga, the activations of the capsules, the divine interventions of the funny Zen-o, the fusions, the different transformations and so on. Beyond the iconic special techniques, the fights are a riot of fanservice: the thousand and one cards in the game allow for an extraordinary variety of decks, synergies and formations, especially if you begin to consider the skills and characteristics of the characters, which it becomes practically mandatory in the most difficult missions. It is a complex and intricate game system, hidden behind a technical sector that makes you turn up your nose: if Dimps had taken better care of this aspect, Super Dragon Ball Heroes: World Mission would have become an unmissable title for every Dragon Ball fan.", "date": "2019-04-10", "grade": "7.0"}