{"name": "Ninety-Nine Nights - Recensione", "ref": "https://multiplayer.it/recensioni/ninety-nine-nights-recensione.html", "text": "The Magnificent Seven As already mentioned, one of the main features of Ninety Nine Nights is the possibility of using 7 different characters, each of which has its own strong personality and its own story, which shows the war at the base of the game from different points of view. Here are the fighters we will have to identify with: Inphyy - sister of Aspharr, at the beginning of the story she contends with her brother for the leadership of the Knights of the Temple, a sacred order devoted to the protection of humanity against the hordes of goblins. Despite his young age (17), he demonstrates great skills in combat and in leading the army, but in some cases he tends to lose control due to excessive impulsiveness. Aspharr - is the older brother of Inphyy and his role model, another contender for the leadership of the Knights of the Temple. A strong and skilled fighter and a wise troop leader. Despite his combative qualities, Aspharr does not identify with the ideal of war, and continues to question the validity of his actions and the need to use violence. Miyfee - a mercenary endowed with the power of light (spark). Miyfee is the classic big man with a heart of gold, not driven by particular ideals but rather by the need to fight for a living, yet he is gifted with great common sense, and hopelessly in love with a powerful mercenary who fights alongside him. Tyurru - a very young witch endowed with enormous magical powers. He appears several times within the stories of the other characters as a valid external aid, fighting alongside humans. Tyurru represents a particular character since he is the only one not equipped with physical attacks but only medium-long range magic. Klarran - like Tyurru, represents outside aid for human fighters, until he becomes a playable character himself. It is a cleric, also endowed with enormous destructive powers. Dwingvatt - is a goblin warrior, who represents the other side of the coin in the history of N3. Using Dwingvatt it is possible to see the war between humans and goblins on the other side of the fence, he is a fighter who has decided to take revenge on the humans who killed his brother. Mysterious character - appears after completing the game with all the other characters, you will only discover him then, although it is possible to meet him already during the first missions. He is certainly a rather particular individual... A world at war Ninety Nine Nights has a typically fantasy setting, filtered through oriental taste and style. The plot that acts as a background is extremely classic: in a world populated by humans and various creatures of other races (orcs, goblins, elves, giant frogs and so on) the coexistence of all creatures is ensured by the presence of a magic crystal , called Orb. When this is broken, the precarious balance that kept everything in peace collapses, causing the predictable decline resulting in a bloody war between all the factions of the composite world. Instead of focusing on a main character and building the plot around it, the developers have decided to field seven different characters (three immediately available plus four others that can be unlocked later), each with its own characterization and protagonist of its own micro -story, capable of giving a more multifaceted view of the main macro-story. We therefore have Inphyy, the beautiful seventeen-year-old leader struggling with excessive ferocity in combat and an inferiority relationship towards her brother Aspharr, the Miyfee mercenary who seems more interested in conquering the beautiful warrior colleague rather than freeing the earth from enemies, or Dwingvatt, who as a goblin captain gives us the opposite view of warfare from humans. During the missions we will also find ourselves, in some cases, in front of crossroads, which will require us to make a choice on how to continue the game. These choices will obviously be reflected in the course of history and in some cases will determine particular crossings between the micro-stories of the various characters. The idea is valid and keeps the interest alive in the game, pushing the player to face it with all the fighters available, but it is also true that the brevity of most of the plots often leaves a bad taste in the mouth, with five, six missions at most available to each character that often lead to a somewhat truncated ending. However, the choice to create characters with relative depth, not excessively stereotyped as often happens in similar cases, is appreciable. Button Masher The structure of the game is entirely based on a very simple concept, which in English is called semplicement ~button-smasher~, or crush-keys: press repeatedly on two keys to perform a large number of moves, eliminating industrial quantities of enemies. The gameplay is essentially a continuous repetition of the same situation, with our character besieged by an overwhelming number of enemies to be faced with white weapons and devastating combos, practically feasible by pressing the only X and Y keys (except for some combos that includes jumping or sliding to complement). The combinations are many and different, the sequences resulting from pressing the keys, with moves that are always spectacular and with a great visual impact, which vary in difficulty, power and scenographic effects as the level of experience reached by the character increases. However, it is also true that they are all effective in more or less the same way, which leads more often to repeating the same combo over and over than to gradually learn the new ones that can be used. The core of the game is therefore this: to jump into the fray and mow down as many enemies as possible. The downed soldiers release particular red spheres that charge an auxiliary energy bar (bar of the stars), which once charged makes the B key active. When this is pressed, our character enters Overstrike mode and transforms into a real destruction machine, a berserk capable of exterminating entire waves of enemies in a few seconds, which in these conditions release blue spheres, useful for charging a second energy bar capable of releasing even greater power (Overspark). Button Masher One of the few tactical evaluations that the game subjects us to is precisely the choice of the right times in which to trigger the special power, to be reserved preferably for moments of greater crowds but not to be used too sparingly, as it is an indispensable element for leveling up in level. The accumulation of experience points determines the RPG component of Ninety Nine Nights, which is actually quite poor: as the level increases, the statistics and slots available to equip the objects that are around the battlefield and all inside the chests, useful for changing the characteristics of the protagonist and the guards who accompany him. The gameplay is essentially a continuous repetition of the same situation, with our character besieged by an overwhelming number of enemies to face Button Masher The latter, on the other hand, represent the only strategic ambition of this Phantagram / Q Entertainment production, a bare-bones legacy of Kingdom Under Fire. Before the start of the mission we can select the two teams that will make up our army among infantry, heavy infantry, archers and spearmen, the problem is that in any case the only orders that can be given are practically ~halt~ and ~full speed ahead~ , with soldiers typically just charging into the enemy army en masse, keeping them engaged before the lead hero arrives. Which is substantially immortal, except then having to collide with the end-of-level bosses, more ~tough~ than the mass devoted to massacre, and which, if they were to cause their death, would force the player to start the level over again, since there are no checkpoints intermediate. In missions lasting even more than forty minutes, this is quite frustrating. You are warned... A piece of 99? The graphics of Ninety Nine Nights seem to reiterate the general situation in which Japanese developers (Japanese-Korean, in this case) find themselves grappling with these first Xbox 360 games: they seem to be behind the results simultaneously achieved by their Western colleagues. Still based, apparently, on the same engine used for Kingdom Under Fire, N3 focuses all its ability to amaze the player on the amount of characters on the screen at the same time. In this it succeeds, but neglecting the care in the representation of the scenarios, rather dull, repetitive and very uninspired with little possibility of interaction, and the stability of the frame-rate, which in the most critical phases involuntarily contributes to emphasizing the chaos of the battle with drops in fluidity. In any case, the battle scenes are impressive: seeing hordes of enemies rushing towards us coming down the hills, while our army charges and the blades clash is a particular sight, the impression of a violent impact between the armed hordes is rendered perfectly , returning an almost physical sensation. The graphics engine also manages to handle the large number of characters on the screen well, characterizing each of them with animations that are varied enough not to give the impression of a huge screen.series of clones who all carry out the same move. The use of the effects is good which, especially during the execution of more complex combos or in the Overstrike and Overspark phase, make the clashes spectacular, transforming them into exciting choreographies for the description of which the adjective ~epic~ fits perfectly. From an auditory point of view, the effects are average, while the music is particularly spot on, one of the strengths of Ninety Nine Nights: entirely orchestral, the musical pieces accompany the game action well in a dynamic way, rarefying in moments of calm and intensifying dramatically during the toughest and most decisive fights. Even here, however, there are some problems caused by the somewhat hasty finishing work, when you notice enemies who get stuck in the elements of the seabed or when you are in narrower environments and the camera creeps behind the polygonal structures of the walls , showing the emptiness that they hide A special mention goes to the full motion video footage that chisels the stories of the various characters, of high quality and with a nice character design, however they are reduced to the bone like the stories they tell, short and not very detailed . Goals Most achievement points are obtained by simply finishing each character's stories, with scores varying according to the length and difficulty of the various storylines, but there are also others that can be reached in different ways. An objective is unlocked by facing a special final mission of Inphyy, two others, particularly rich (200 points), are obtained by completing the missions with a minimum score of A (i.e. with A or S) and by making everyone reach the maximum experience level the characters, i.e. the 9. Comment Despite being a fundamentally different title from Phantagram's action-strategic series, the feeling you get when playing Ninety Nine Nights is that of being faced with a step backwards compared to Kingdom Under Fire. The decision to streamline its structure and focus everything on the immediacy and quantity of enemies on the screen resulted in an excessive impoverishment of the gameplay, giving life to an overly simplified game. The strength of N3 lies entirely in the exaltation given by the obsessive fight against a quantitatively overwhelming enemy, and by the satisfaction provided by the combination of the spectacularity of the combos that can be carried out with good ease and their extremely destructive results. This basic gameplay fragment is, however, too insistent and devoid of alternative outlets. The simple mechanics and the frantic action still make Ninety Nine Nights a fun game, but not very long-lived and refined, also burdened by the total absence of online content and the inexplicable lack of any multiplayer mode. Recommended to Hack 'n Slash lovers and to aficionados of the undoubted charm of the Phantagram artists' chara design, without too many reservations. Pros: The battle scenes are a pleasure Fair variety given by the different usable characters Beautiful soundtrack Cons: Game structure too shallow Artificial intelligence almost non-existent Technically, only sufficient Despite some ambitions of the game in question and Phantagram's experience in the field, what Ninety Nine Nights has that is truly strategic is only its planning within the market, as one of the products carefully chosen by Microsoft to push Xbox 360 even worldwide. inside the difficult Japanese territory. Given the great success in particular of Koei's Dynasty Warriors series, which N3 seems to be inspired by in more than one element, Phantagram have decided to modify the game model on which Kingdom Under Fire was based, whose appeal is evident here, and enhance the action component, making it more immediate and relegating all the strategic elements to the background. To supervise the change of course implemented by the Korean developers led by SangYoun Lee, was called Tetsuya Mizuguchi of Q Entertainment, whose undisputed experience in the world of video games, in Japan and beyond, would have acted as a guarantee for the quality of the product. In short, the premises were there, but the result does not seem to live up to them, nor to the level reached by the two chapters of Kingdom Under Fire released on Xbox.", "date": "2006-09-12", "grade": null}