{"name": "Summon Night: Swordcraft's History", "ref": "https://multiplayer.it/recensioni/summon-night-swordcrafts-history.html", "text": "Craftknights of the Round? At the beginning of the adventure, the player is first given the opportunity to choose his own alter-ego between a male, Cleru, and a female, Pratty, and then to answer some questions that will decide the Summon Beast protector, among the four featured in the game. Be that as it may, the plot remains essentially the same: the protagonist is the son of Shintetsu, one of the greatest Craftlords of Wystern, the Sword Capital of the world of Lyndblaum, who disappeared years earlier to save humanity. The Craftlords run the capital, and throughout the adventure we will participate in the tournament that will choose the new Craftlords who will take the place of those who disappeared in battle years before. At the center of the story, of course, there is the mystery of Shintetsu's death, which will slowly unravel, until Cleru/Pratty is faced with a destiny greater than he thought, linked to his father's swords and to the goddess protected by Craftlord themselves... If the plot turns out to be simple and linear despite the numerous twists and revelations that will definitely spice it up, it is also due to the fact that many narrative sequences are ~customizable~: the Summon Beast assigned at the beginning - a sort of guiding spirit, the choices made during the various dialogues and the affinity reached with the various supporting actors will influence both the story and the ending. It must be said that Atlus has seasoned the whole story with a strong dose of self-irony, which at times appears redundant and linear in an almost ridiculous way, voluntarily snatching a smile from the player when, for example, some characters explain that they already know what happened to the protagonist and what he will have to do for script reasons or not to make the game too long! Sweat, sparks and blood The brevity of the main-quest, of about ten hours, is due to the amount of optional elements that revolve around it: first of all, Summon Night is a ~dungeon-crawling~ type RPG in fact, and the aim of the game, in addition to following the history is precisely and above all to forge increasingly rare and powerful weapons. The construction process of these weapons, divided into five categories (swords, axes, spears, gloves and drills), is extremely simple: once you have learned a technique (generally through our teacher Brom or the various supporting actors) you will have to recover the materials necessary to perform it. These are kept in the Labyrinth, a huge ~dungeon~ in the basement of the Tower of Craftlords, recoverable from defeated monsters or from chests destroyed with our hammer. Basically, in the Labyrinth you fight monsters, get materials, and then go back to your forge to build a new weapon. Given the frequency of random clashes, the combat system was designed to make them less heavy and never boring: the mechanics recall that of the Tales series, with the player directly controlling Cleru / Pratty in a two-dimensional battlefield. It is possible to jump, perform combos and special attacks with the weapon used (interchangeable with three others equipped at the same time), retreat, charge monsters and obviously summon the Summon Beasts to unleash their magical powers: both the protagonist and his Summon Beasts, in fact, increase in level with the clashes, acquiring new points to be placed in the three main statistics (strength, agility, defense) of the protagonist and new spells to cast. However, not only is the number of spells that can be used limited, but each weapon has a resistance value which decreases with each blow inflicted or parried, and which once reset will result in the destruction of the weapon in question. In short, the battle-system turns out to be varied and fun, seasoned with a fair dose of strategy, also based on the elemental properties of weapons and monsters, which as they progress through the labyrinth become increasingly large and insidious. Old but not too old This episode of Summon Night dates back over three years ago, and feels the weight of the years, and despite everything demonstrates an exquisite technical realization: the settings are very colorful and detailed, even if sometimes a bit monotonous (as in the case of the Labyrinth ), but Summon Night gives the maximum in battle, where the quality of the animations of characters, monsters and spells proves to be decidedly high. The various artwork of locations and characters are also of excellent quality, while the variety of monsters leaves something to be desired, which at a certain point all look alike except for the color. Unlike the subsequent episodes, Summon Night suffers from the absence of sampled speech: both the story and the fights therefore follow one another in absolute silence, and we will have to wait for the next episodes to be able to hear the very Japanese squeals of attacks and spells. Again, from the point of vIn terms of sound, the music turns out to be a bit pounding, suffering from the mediocre capabilities of the GBA and a certain repetitiveness, although some are decidedly pleasant and catchy. Short but intense, Summon Night focuses above all on replayability thanks to the enormous amount of combinations capable of influencing the plot, leading it to five different endings. The core of the game, always building new weapons, remains fresh for hours and hours, stimulating the player's curiosity and his desire to further increase his power: as a dungeon-crawler, Summon Night succeeds perfectly in its objective, making the intrinsic repetitiveness the gameplay engine itself. The technical realization, between ups and downs due to the age of the product, shines in particular for the graphic quality of the fights, which three years ago on GBA really made a great impression, and bodes well for the sequels to come. In short, while waiting for the next episodes, improved every time from every point of view, Summon Night turns out to be much more than a pastime, and deserves at least one look from both RPG lovers and more classic action-adventures. Pros: Schicciapensieri, linear and flowing. Multiple weapons, endings and subplots. Simple and fun combat system. Cons: Technically old, especially the music. Very short, and repetitive. Atlus rarely engages in the RPG genre, but just as rarely it fails to hit the target and those who have memories of Thousand Arms (PSOne) or the more recent Riviera for GBA can only think so. Summon Night is a series that already enjoys great success in Japan, counting not only various episodes that appeared on home and portable consoles, but also various animated series and comics. Three chapters have already been produced for Game Boy Advance, but this is the first to be localized in English.", "date": "2006-09-12", "grade": null}