{"name": "Ghost Trick: Detective Fantasma", "ref": "https://multiplayer.it/recensioni/ghost-trick-detective-fantasma-recensione.html", "text": "We often talk about how Nintendo has been able to innovate and stand out with its consoles and how some talented developers have been able to exploit these peculiarities to put them at the service of experiences full of brilliant ideas. Well, Ghost Trick: Ghost Detective, Shu Takumi's puzzle-based adventure, certainly has these characteristics. Originally released in 2010 in Japan, and then arriving in the West the following year, the game took advantage of the Nintendo touch screen DS to give us a particularly fresh and appetizing gameplay, inevitably devoted to trial & error, but able to give great satisfaction and, above all, to put itself at the service of a truly particular and engaging narrative. We are therefore very happy that, thirteen years later, one of Capcom's greatest and least known adventures has been revived in the context of a truly well-crafted remaster, capable of enhancing the splendid design of the characters and scenarios, the animations and the music : we tell you everything in our review of Ghost Trick: Ghost Detective. Story: the night of secrets Ghost Trick: Ghost Detective, the very first sequence A man lying on the ground, a girl with red hair and a hitman armed with a shotgun: the iconic opening sequence of Ghost Trick: Ghost Detective immediately introduces two of the main characters of the story, namely the young detective Lynne and Sissel, the dead man who he ~awakens~ in the form of a ghost and discovers, after speaking with a mysterious desk lamp, that he possesses special abilities. Well yes: despite being reduced to a spirit, the protagonist of the game has the power to take possession of some of the objects present within the scenarios and operate them where possible, provided you can reach them by moving your soul within them. That's not all: it can travel along telephone lines to move from one place to another, even over great distances, and above all it can rewind time by four minutes in case it comes into contact with the corpse of a recently deceased person. Not having the faintest idea of who he really is and why someone killed him, Sissel decides to use his skills to shed light on what happened and to help those in need; first and foremost Lynne herself, who seems to have a bad habit of dying in the most disparate ways, and who somehow got entangled in a situation bigger than her, witnessing a secret she shouldn't have discovered. : Ghost Detective therefore starts from a truly captivating incipit, carries on a narrative with undoubted Japanese traits and introduces characters and situations that are truly remarkable in their absurdity, without sparing us powerful twists and unexpected revelations in the context of a campaign consisting of eighteen chapters, which will keep you busy for at least twelve hours. Gameplay: specter, specter of my lusts Ghost Trick: Ghost Detective, the mechanism of jumping from one object to another If in terms of the story the title written and directed by Shu Takumi manages to be terribly effective, reiterating sentences and concepts so that they remain well impressed in the mind and create that harmony that is found only in great stories, also in terms of gameplay the formula stung by the developers Capcom boasts a strong personality and still remains very enjoyable today. On Nintendo Switch you can use the touch screen to control Sissel's powers, exactly as in the original for Nintendo DS, but also using the analog sticks and physical buttons the solidity of the experience remains well preserved, in a curious and successful mix of intuition, glance, timing and imagination: these are the ingredients you will need to solve the various challenges and move forward. Ghost Trick: Ghost Detective and the incredible charm of its characters, often inspired by the works of Tezuka The very first sequence, for example: there's this hitman pointing a rifle at Lynne and he's going to kill her if we don't find a way to stop him. The closest object to Sissel's corpse is a bar, and by ~possessing~ it, by transferring our soul into its core, we will be able to extend it to temporarily disarm the criminal, allowing the girl to escape. Do you understand the mechanism? During the campaign there is a very gradual and thoughtful progression, the situations gradually become more complex and multifaceted, and so in practice the trial & error component becomes an integral part of the experience: it is necessary to make mistakes to see how certain events take place in the four minutes available to us and understand how to change things. Extra content Capcomhas not limited itself to remastering the graphics and sound of Ghost Trick: Detective Ghost, but has seen fit to add some extra content to this re-edition of the game, in this case an encyclopedia with all the characters of the game as they are presented, a really interesting gallery of images and artwork, a player for the songs from the soundtrack and finally a nice minigame, Ghost Puzzle, which is unlocked once the campaign is completed. Graphics and sound: a fantastic remaster Ghost Trick: Ghost Detective, the graphics have been remastered in an excellent way If it is true that the concept of remaster applied to polygonal graphics does not always return excellent results, highlighting for example the angularity of geometries conceived when the computational power of gaming machines was substantially lower than today's, when speaking of raster materials the speech is obviously different and the latest technologies can be of great help. In the case of Ghost Trick: Ghost Detective we started from assets originally designed for a screen with a resolution of just 256 x 192 pixels, which Capcom somehow managed to bring it to 1080p without losing quality, rather finding it again as when dusting a precious object. About the original materials, with a higher definition, or a resample made using artificial intelligence? Ghost Trick: Ghost Detective and the addictive enthusiasm of Missile, master of life Whatever the answer, it doesn't matter: Shu Takumi's adventure shines in a new light in this reissue, the extraordinary character design with its many tributes to Osamu Tezuka is substantially enhanced and the same happens to the animations of the characters, still more fluid and hand-drawn like in a cartoon, as well as to the many scenarios that we will be able to visit in the game. Wanting to look for the proverbial nitpick, sorry that we have not found a way to add some graphic elements where necessary for ~ broaden~ the view and abandon the 4:3 of the Nintendo DS version in favor of 16:9, instead of opting for the side bands: a frankly ugly solution, only partially counterbalanced by the presence of the double soundtrack, original or rearranged by Yasumasa Kitagawa .", "date": "2023-06-27", "grade": "8.0"}