{"name": "Pizza Tower", "ref": "https://multiplayer.it/recensioni/pizza-tower-recensione.html", "text": "Poor Peppino Spaghetti just wanted to have a hard time. The mustachioed restaurateur had finally had a stroke of luck: a nice Italian restaurant in which to churn out pizzas and serve steaming plates of spaghetti with tomato sauce. Instead, fate came to put a big foot in it (from a chicken, good for broth), with the opening of the nearby Pizza Tower, a threat to the survival of Peppino's poor humble restaurant. But the last word has not been said, as Peppino will not give up and, angrier than his sauce, has decided to make a single bite of the tower. Helping him in this 2D platformer with a very nineties aftertaste will definitely be a pleasure. Let's find out the details in this Pizza Tower review. From Wario Land you have a view of the valley Pepp, watch out for the piranha! Do you remember Wario Land? It was a very nice series of 2D scrolling platformers from Nintendo, originally born as a spin-off of the Super Mario Land series on the Gameboy. The protagonist was the garlic enthusiast Wario who, running like a madman, broke everything in his path. Over the years, several developers have succeeded at the helm of the series, but Nintendo seems to have abandoned it for quite a while. On the other hand, 15 years have passed since the last title, Wario Land: The Shake Dimension on Nintendo Wii. Pizza Tower picks up right where the Nintendo series left off. In fact, Peppino Spaghetti is clearly a less braggart Wario, but much more frustrated and enraged (heh oh, he's Italian, after all, bad mood is our typical characteristic). The tendency to run and smash everything in its path is borrowed from Nintendo's garlic eater. Certainly the gameplay of Pizza Tower takes several concepts from the Wario Land series, adding a pinch of Sonic the Hedgehog speed and a sprinkling of 90s platformer madness. Peppino will have to climb the five floors of the Pizza Tower, finishing levels and defeating bosses. Tasty ingredients (to save) The first boss is a giant tomato. Did you expect anything else? In each level, we will have to save some of the typical ingredients of the pizza (mushrooms, cheese, salami, etc.), so as to obtain monetary bonuses at the end of everything. Once you've accumulated enough coins, just pay to open the boss door and tackle the last obstacle before going up to the next floor. In between, there are various bonus levels, costumes to unlock and various other goodies, but the basic gameplay of Pizza Tower remains the same: finish the levels in the shortest time possible, earn money, defeat the bosses. That's not all though, there is definitely much more to discuss. Of course, the first thing that catches the eye, even from a single image of Pizza Tower, is the graphic style. It is in fact a tasty soup between the craziest animated series of the nineties (above all, Ren & Stimpy), idle scribbles in Microsoft Paint and a sprinkling of Nintendo from the good old days. The final bowl is to be savored calmly, above all for the flood of details that we will find in every single screen, as well as such a number of animations that, even after playing for two hours, we will continue to find new ones. It is no coincidence, in fact , that to act as a perennial guide there is a monitor at the top right with Peppino's sweaty face telling us about his emotions. He hurt himself? Do you see him particularly agitated? The monitor, in addition to making us smile with Mr. Spaghetti's funny faces, is also useful for regulating the combos we're doing and the speed at which we're going, elements that we will have to look after during each level. Run run Pepp Peppino will be helped by some pais So let's get to the gameplay. As mentioned, Pizza Tower cannot be defined as a mere Wario Land clone, given that the focus is not on finishing the levels, but on exploration and bringing home as high a score as possible (so-called score attack). Each level is ideally divided into two moments: the purely exploratory one, in which it counts to try to kill as many enemies as possible (and store combos) and the final escape. The exploration phase allows us to catch ingredients, learn the tricks of the level, as well as search for secret areas. Escape, on the other hand, gives the player a limited time to return to the starting point and exit the level. When the time available expires, we will be thrown out unceremoniously and will have to start all over from scratch. And here we come to the crucial point where Pizza Tower plays everything: the controls. Considering that much of the time we'll be spending darting through increasingly complex levels, trying not to interrupt combos or escape before the timer runs out, the key is precision. Onthis, we confess that we have not found Pizza Tower quite perfect, above all because it will take more practice than usual before arriving at what we could define as full... control by Peppino. Not because there are keys to memorize, really just a couple, but while running every little directional movement will have to be precise and remembering the (simple) key combinations correctly will still take some time. In this, hard to blame those who think that a control involving more gamepad keys would have been better, rather than going to put the directional cross in the middle. Surely, before getting caught up in the frustration of throwing a pot of boiling sauce at the monitor, it will be better to practice a little in the first few levels. Certainly, the satisfaction of being able to guide the good Peppino in superfine and tasty combos (from ~Cheesy~ to ~Brutal~) seems just like when we manage - or managed - to make Sonic dart without anything stopping him. But one thing to eat, a pizza? Even Santa was missing from the list... The level design in Pizza Tower is generally well made, even if it discounts some solutions that are perhaps a little too bad that will brutalize those who have not already suffered with platformers of various infamy. After exploring the first floor, each level often adds some new elements that characterize each scenario. For example the cemetery where we will be able to surf on the corpses (yes), or the farms where a violent hen will snuggle in Peppino's hat or, again, transforming into a ghost so as to overcome some sections. Here too, Pizza Tower goes beyond the simplest Wario power-ups, pushing itself into a much more surreal and fun dimension. We believe that what emerges most strongly from Pizza Tower, managing to convince even the most frustrated to try again new that cursed level is, however, the humor that pervades every forkful. Apart from the perfect way in which the whole game feeds on Italian food between spaghetti, pizza and meatballs, the comical gimmicks in each level are amazing. We could list the worried face of the ingredients when Peppino burns his bottom in the boiling sauce, the Pope who blesses us by treating our throats burned by spicy chicken wings with holy water or Peppino who gets stuck in a pizza box he uses to fly . Who gets the last slice? Nice-a! Finally, it is impossible not to mention the excellent work done on sound design, really full of delights. Instead of the easy and banal solution of stuffing everything with pseudo-Italian shouts, Pizza Tower makes every sound immediately recognizable. Exquisite soundtrack as well, which switches from funk to metal toppings with ease, always keeping within a sonic palette typically from late 90s platformer. In short, the Pizza Tower team seems to have succeeded where Nintendo seems to have fallen asleep by now, preferring to focus on easy toppings to chase after the most popular flavour. Here we find a succulent pizza seasoned with crazy 90s animations, heart-pounding gameplay and fun gimmicks that will keep the attention of even the least hopeful player towards the true return of quality 2D platformers. Grab a slice and bite them all, because Pizza Tower is a rich and fragrant offer.", "date": "2023-02-05", "grade": "8.0"}