{"name": "Cure Hunters", "ref": "https://multiplayer.it/recensioni/cure-hunters-la-recensione.html", "text": "We have seen all kinds of pretexts to justify the carnage in video games: the plots of the old shooters are not exactly high-profile novels, but in no case so far had it happened to us, in a ~run and gun~ shooter, to be a doctor dedicated to finding a cure against a mysterious epidemic. Well, this is instead the premise of Cure Hunters, the protagonist of this review. The fact that you still spend time eliminating everything that moves on the screen with the use of various weapons should therefore not be misleading, because the goal apparently is much higher than any possible side effect given by a behavior so unaccustomed to the Hippocratic rules. The bizarre story tells that in 2078 a mysterious meteorite crashes on the earth's surface, unleashing a terrible virus that quickly infects most of the world's population. Faced with so much decay, the last line of defense is made up of a team of highly trained Cure Hunters, or a sort of particularly fierce version of Doctors Without Borders specialized in finding a cure for the overwhelming virus. At the head of this handful of heroes is General Vaccinez, a character who probably would not hesitate to pave the no-vaxes with napalm but who in this complicated situation must manage the forces in the field to try to free the various areas of the earth from the invasion of infectious elements. One of the most skilled agents on this front is Dr. Dellton, or the initial protagonist of Cure Hunters, even if there are numerous additional characters that can be unlocked later with the investment of the money earned during the games. In the game we therefore find ourselves controlling Dellton or some alter-ego in his mission to clean up various areas of the Earth from the infected and fight against bosses. Run and gun roguelite Basically, Cure Hunters is rather close to the classic tradition of shooters with platform elements. It could therefore be defined as a ~run and gun~ and it fits well into this sub-genre, but it also has characteristics that make it rather peculiar, thanks to the inclusion of roguelike, or rather ~roguelite~ style elements. According to the latter, if you are killed before eliminating a boss or completely cleaning an area, the accumulated progress is lost, which raises the level of challenge by requiring special attention to any move. Often starting from scratch, the developers have adopted the usual solution of procedural generation of levels, in order to differentiate the game at each run and make exploration always stimulating, even if the results achieved on this front can cause controversy. It is true that the constituent elements of the scenarios are remixed, but a certain sense of tiredness nevertheless emerges in the numerous postponements at the beginning of the areas, also given the ease with which a life can be lost. It must be said, however, that Lucky Kat Studios has done a really good job with regard to the shooter feeling, integrating it quite well in a platform-type context and staging everything with a very pleasant and well-finished graphic style. The level design isn't exactly the element of greatest interest, as always happens when roguelike mechanics and procedural construction of the levels are involved, but the shooter dynamic is convincing between the behavior of the weapons and the variety of enemies, while the bosses are able to provide interesting challenges. The money earned on missions can be invested to expand and upgrade your weapon, or to restart after death without having to start over. Obviously, the free-to-play essence of the game fits into this roguelite mechanic, which allows you to buy credits with the expenditure of real money or watch advertisements to earn in-game money or the possibility of continuing. On this point of view, among other things, there is perhaps an excess of zeal on the part of the developers, who in order not to miss anything, have placed mandatory advertising videos even at the end of the levels.", "date": "2019-03-30", "grade": "7.3"}