{"name": "Battle Souls", "ref": "https://multiplayer.it/recensioni/battle-souls-recensione.html", "text": "Battle Souls plunges us into a disturbing fantasy scenario, a world abandoned by the gods and plunged into darkness, where men and villages are at the mercy of hordes of demonic creatures. A group of adventurers decides to go to the mountains, looking for a passage that could guarantee them access to new places, but the task is not the simplest: to get to the destination you have to overcome four different scenarios, each characterized by twenty increasingly complex missions, available in three degrees of difficulty. New title for iOS and Android from the Spanish team Talesoft Studio, Battle Souls uses strategic RPG mechanisms and a turn-based combat system to put us in front of different gatherings of enemies from time to time, during a fairly long but inevitably repetitive campaign. The game clearly refers to the excellent Darkest Dungeon, but fails to capture the atmosphere or depth, greatly simplifying the gameplay and transforming the clashes into a simple exchange of blows between characters with different values in terms of health, resistance and attack ability. The strength of the experience lies precisely in the large roster of warriors, archers, soldiers armed with cannons, thieves and magicians that can be summoned using the game's hard currency and inserted into the four slots that make up the team. Each of them boasts some peculiarities, such as zone maneuvers that deal damage to multiple targets or precision shots from a distance, the ability to heal companions or cast curses. In short, composing the strongest possible team represents the key to success, and it must be said that from this point of view the game has no problems releasing high-level units completely free of charge, asking in exchange for only a few seconds of patience at the end of each boss fight to watch short commercials. Gameplay and structure The main screen of Battle Souls contains in an interesting way the various sections that it is possible to control between one mission and another: the portal for the summons we have already mentioned, the management of the team (not always very clear when the characters begin to become many), the available achievements (in the form of tasks to be completed to obtain a reward) and of course the list of missions, divided as mentioned between four different settings for a total of eighty stages, each available in three degrees of difficulty. Going from the lowest to the highest level obviously translates into stronger and more resistant enemies, pitfalls that occur more frequently but also better rewards in the end. The exploration of the stages takes place according to a two-dimensional dungeon-style scheme, in which you have to move the ~pawn~ that represents the team and face random events from box to box, for example suffering wounds due to an unexpected trap or facing to the dilemma of looting a body or giving it a proper burial. The encounters are therefore regulated by a random system, and when the team comes across a group of enemies, the view takes on the connotations of an opposition to the Darkest Dungeon, in fact, with the fighters on one side and the other who in turn launch the own strikes (from a shortlist of three possible actions, at least initially) until the enemies are all eliminated. The obstacle course continues up to the last box, that of the boss fight, where we will face even more formidable opponents and then return to the base with the loot ... or in a coffin. In reality, the mix of generous drops and low difficulty makes the first twenty missions of Battle Souls quite trivial and, in short, you have to wait quite a while for the situation to become a little more eventful, but the limitations of the gameplay and the consequent repetitiveness of the situations could make you let go in advance, despite the lack of constraints related to freemium mechanisms. The pixel art graphics are undoubtedly fascinating, but very lacking in terms of animations, which are limited to very few frames. Furthermore, the game is not optimized for the iPhone X display, and so it happens to see elements and assets in the side bands that should have remained hidden.", "date": "2019-03-21", "grade": "7.0"}