{"name": "Unit 4", "ref": "https://multiplayer.it/recensioni/unit-4-recensione-nintendo-switch.html", "text": "According to one of the great universal laws, the existence of which is kept hidden by many but recognized by all, the games of the past sooner or later also arrive on Nintendo Switch. There are due exceptions, it's true, but when it comes to indie, independent productions and minor titles, the application of this law is practically obvious: it happens again these days with Unit 4, an old-school 2D platformer as colorful as it is infamous. Some of you will remember it with a smile (the best ones, probably): two years ago it arrived on new generation consoles and on PC. Time passes but the old glories remain: the Gamera interactive team (which we remind you, is Italian) has prepared a nice porting to Nintendo Switch. We tried it for you, and therefore we offer you its review. Storyline and gameplay Unit 4 is the same game as two years ago, if you have time for a comparative investigation you might even consider going to the review of Unit 4 for Xbox One by good old Spotti. The main innovations with which it arrives on Nintendo Switch are purely technical, aimed at exploiting properly (when possible) the peculiarities of the hybrid console of the Kyoto house: for example from the point of view of the vibration system, the HD Rumble, the rearrangement game controls, and so on. There is also the Unit 4 Clash of Agents content already included in the package, whereas previously it was logically distributed separately after the official release. The plot of Unit 4 is the most functional there can be for the introduction of the true heart of the production, namely the gameplay: there is a group of four heroes in space who must recover a certain object that has been stolen by a certain villain, because yes. It is not important who the villain is, nor who the heroes are: it is important instead that the paladins of the good in question are exactly four and that each of them has its own characteristic weapon/skill, because this has a great impact on how the game works in itself. Everything you need to know about Unit 4, especially from the point of view of its curious game controls, will be explained to you by the practical, quick and enlightening initial tutorial. Gamera Interactive has probably created one of the most effective tutorials in recent years, with an incremental, clear, logical level of difficulty, and above all that allows the player to immediately realize what will await him shortly thereafter; i.e. carnage. We will return to the aspect of the difficulty of Unit 4 a little later: returning to the heroes, each of them has a particular color and ability. The blue hero is the most agile of all, and the only one to possess the double jump; the red hero is strong and slow, but can sprint and shoulder charge into nearby enemies (as well as move gigantic crates); the green hero has a grappling hook, and a grappling hook always comes in handy in space, right?; finally the yellow hero is the sage-sensei able to become invisible and to prolong the jump with a sort of slow-motion glide. As the caption of some cheap blockbuster might read, ~individually they are weak, but together they are very strong~. And this is perhaps the main advantage of Unit 4: the level of difficulty probably suitable for very different types of players. We are going to tell you why. Multiplayer mode and difficulty Unit 4 is an old-school 2D platform game that is extremely brutal and punishing when played alone. The single user takes control of one of the heroes and tackles the levels (developed horizontally) starting from the beginning, facing a variety of enemies, obstacles and platforms, collecting items and collectibles, then fighting your way to get to the goal. There are checkpoints placed at strategic points, often really bad; there are many coins to collect, which will later be used to upgrade and customize your base of operations (a spaceship); there are many enemies, big and small, which at the slightest contact will eliminate the protagonist forcing him to start over (or from the last checkpoint). Now, when alone, Unit 4 allows you to swap your hero in an instant with one of the other three on the bench. For example, after a series of jumps made with the blue hero, perhaps it is possible to find oneself in front of a box that is impossible to move: at this point, one changes on the fly with the red hero and throws it far away. Imagine, however, a situation in which there are many enemies on the screen, and it is really necessary to calculate every movement of the protagonist to the millimeter, as well as the exchange times between one hero and another to remain coordinated. An extra second could cause you to falland the green hero in a ravine before having time to swap him for the yellow one capable of levitating; a level design and a trial and error progression certainly don't make things easier. Here then is that the local multiplayer mode almost becomes a necessity for the less skilled, in order to get to see the end credits of the production. It is undeniable, among other things, that Unit 4 gives its best in four users: each individual present can hold a controller (or a Joy-Con) and impersonate a specific hero, so that everyone coordinates together until at the end of the level. In both cases, the experience is always satisfying and the level of challenge interesting: there are few levels, enemies and subdued situations in Unit 4. And if you are a pixel art lover, you probably won't even notice the small smudges present from time to time.", "date": "2019-03-15", "grade": "7.5"}