{"name": "The Occupation", "ref": "https://multiplayer.it/recensioni/the-occupation-recensione.html", "text": "The Occupation is the latest experiment of White Paper Games, a small independent studio based in Manchester, which someone will probably remember for the creation of Ether One. The two adventures have very few elements in common, while sharing the aim of the authors: to make video games focused on developing a plot and solving puzzles. In this case the skein to unravel takes an investigative cut, putting us in the shoes of a journalist looking for information and answers on events destined to change the life of an entire country. After completing the title on PS4, let's take stock of the situation in our review. History: journalistic investigations of the late 80s The story of The Occupation is set in the same universe as the aforementioned Ether One, although the two events are completely unrelated to each other. The events recounted in the game mostly take place within a single building on October 24, 1987. A recent terrorist attack killed 23 people, prompting the British government to consider passing the Union Act , a controversial bill that aims to implement significant restrictions on the individual freedom of British citizens. In the role of H. Miller, a journalist for a local newspaper, we are called to shed light on the events that have shaken public opinion across the Channel. A certain Alexander Dubois has been held responsible for the tragic act, but some rumors seem to clash with the official version formulated by the competent authorities. It was precisely with these intentions in mind that Miller decided to go to the facility where the perpetrator of the massacre worked, which is also the same where the explosion took place. Officially the protagonist is hosted to interview three individuals aware of the facts, but in reality the real objective is to extrapolate as much information as possible by trying to recover top secret details. To do this, it is necessary to access some areas of the building authorized exclusively for service personnel. Just as it would happen in reality, however, research has a significant limit: the inexorable flow of the clock's hands. Playstation 4 trophies The trophies of The Occupation are 16 overall, divided into 5 silver, 10 gold and platinum. Some are related to completing the story, others to performing certain actions during the game or collecting collectibles. Gameplay: a fight against time In The Occupation you have just four hours to try to successfully complete your delicate investigation. Miller crosses the threshold of the building at 15:00 and can stay there until 19:00 to collect as much evidence and information about what happened as possible. Not a minute more, not a minute less. At the end of his visit he will necessarily have to leave the facility, regardless of whether or not he was able to complete the work. For the entire duration of the game it is therefore possible to consult the watch that the protagonist wears on his left wrist: a sort of countdown therefore marks the frantic search for probative material between one appointment and another on the official agenda. The further variable to keep in mind is Paulie, the security officer who, moving between the rooms and corridors of the building, checks that everything is in order. To avoid problems, you have to act stealthily: sneak into restricted areas when the man is not around, change direction as soon as you see him in the distance armed with his torch, and so on. One of the surest methods of not being detected is to take advantage of the ventilation channels hidden in various sectors of the structure, where you can slip in to reach offices that are otherwise out of reach. As you may have already guessed, being identified can have harmful consequences on the continuation of the investigation: in some cases you end up receiving a simple warning and it is possible to continue without limitations, but in other situations the player is blocked and escorted to the manager's office of security. With a quick shot, we thus find ourselves in front of another individual in his sixties, who will not hesitate to recommend himself so that the unpleasant incident does not happen again a second time. Moreover, by being in the wrong place near the times at which the interviews have been scheduled, there is also the risk of passing directly to the next sequence without having had the opportunity to attend one of the scheduled appointments. The Occupation mostly has a limited duration dictated by the passage of time, with the exceptionof a couple of sequences in which brief flashbacks are experienced from the perspective of a second character. In the manner of the most consummate assault journalists, Miller writes down everything that may be needed in his trusty notebook: the main objective is developed in the first item, to which all the elements concretely identified with exploration will be added. We then have a second item in which the questions to be asked of people informed about the facts are updated. Their number will depend on the player's ability to find evidence and evidence that can somehow shed light on the whole matter. Finally, in the third and last item there are a series of observations useful for research purposes. Although in terms of gameplay, the idea behind The Occupation may seem captivating, the development of the narrative has not proved to be sufficiently convincing. Especially in the second part of the story, the events are told in a rather confused and poorly articulated way; over time the questions outnumber the answers and even the epilogue fails to deliver a gripping and paced conclusion to the gameplay experience. Even the characterization of the characters involved, as a whole, seemed unconvincing to us. On the console, however, one cannot help but point out some limitations that afflict the control system: evidently designed for use with a mouse and keyboard, the interface has not been optimized to work properly with a pad in your hands . Difficulties that arise both in navigating the few menus available, and in interacting with the objects available in the scenario; the result is a clear inconvenience of use that contrasts with the reduced choices and times granted to the player. While turning a blind eye to the duration of loading times, The Occupation also presents some problems at the localization level. The dubbing remained the original one in English, and so far nothing strange. The anomalies instead emerge by observing the subtitles in Italian, given that not all lines of dialogue have been regularly translated into our language. The hope is that, at least on this side, the necessary corrections will soon be made through patches.", "date": "2019-03-11", "grade": "6.0"}