{"name": "Left Alive", "ref": "https://multiplayer.it/recensioni/left-alive-recensione.html", "text": "Here we are with the review of Left Alive, a game which, as we will explain below, only confirms a productive confusion of which we had already had a clue. If last summer The Quiet Man had given the opportunity to understand the inability to better choose projects entrusted to third-party developers, what happened with this latest title linked to the Front Mission universe is surreal. It is useless to try to get around it, because Left Alive is a disaster from every point of view, from the technical one to the gameplay, passing through the narration and the inconsistency of the game situations. We try to shed light with a minimum of objectivity. A story of political fiction The plot of Left Alive is as close to the culture of political fiction as it is possible to find on the market today. The choice to set the title in the Front Mission universe, hiring names of the caliber of Shinkawa, had allowed the game to carve out its own slice of an audience attentive to development and eager to immerse themselves in this new epic. During the first half of the 22nd century, the world was politically divided into macro-regions perpetually at war. Poverty and the value of life have drastically dropped and the line between good and evil is more blurred than it has ever been to date. In this scenario close to the post-apocalyptic, the stories of three different characters take off: a soldier with the desire to become a Wanzer pilot (the mechs of Front Mission), a young policewoman and an ex-convict, framed for a murder that has ever committed. Against the backdrop of an occupation in progress by a military body, the fate of the world is moving, hiding behind the war situations bigger than us, which could change the entire course of events. The story of Left Alive is not bad in itself, it even manages to find some good twists as you approach the final part. However, what buries it under its own weight is a writing of the dialogues bordering on the embarrassing, supported by player choices that often lead to totally inconsistent answers and changes to the storyline that are difficult to understand and quite superficial. The race towards the ending (of a disarming paucity) unfolds over the course of fourteen chapters, which turn into as many missions almost equally divided between the three protagonists. The real problem of a story that never meshes and that ends when it still has to make us understand in which direction it wants to go, is its inability to capture the attention of the viewer, too busy trying to forget the jumble of interactive mediocrity that acts as an interlude between cutscenes. The characters are all damn sketchy, coming to totally disappear from the scene for entire sequences, only to return and add nothing to their own psychology. It is difficult to make up your mind and really understand who the enemy is, leaving this figure to a character who is seen too little on stage and just as little is able to convey. Overall, it is not difficult to say that the narrative side of Left Alive is the best of the production, but this is certainly not due to its merit. Bad gameplay even in the 90s Now let's move on to the real sore point of the title: its gameplay. Left Alive presents itself as a third-person game with a strong stealth component, and a good part of its own coherence already decays on this statement. A title of this kind should respond to the primary need to overcome entire sections without the need to kill any opponent, or at least to knock him out silently. In practice, however, in Left Alive there are no stealth eliminations, just as a particular skill is not required to avoid being noticed by enemies. The ability to roam freely around the maps that make up the missions (including three or four slavishly repeated) only opens up to the player's desire or not to go and recover objects nearby, or to unlock and resolve the only type of mission secondary present, repeated an amount of times close to infinity. These are always and only reduced to escorting the survivors to the shelters, following pre-calculated paths from the game and unmanageable even in terms of controls. To give the order to move or stand still, we will be forced to literally stick to the NPCs with the risk that, once they are notified to move, they will choose the previously programmed track, without causing any problems even when a platoon appears at two meters away armed about to execute anything that gets in front of him. To make it all the more frustrating there is a lot of resourcesif limited, which transform the shooting phases into a ridiculous and unnerving dance, in which one tries without distinction to kill while saving as many ammunition and medkits as possible. Through your inventory it is also possible to give yourself to crafting by building a series of throwable objects and traps, so as to make life even more difficult for your opponents. This aspect could work great if the enemy's reactivity made sense: on the contrary, also due to an artificial intelligence worthy of a title from twenty years ago, Left Alive puts us in front of two-legged amoebas, unable to react sensibly and be able to forget about us after fifteen seconds, even after a rocket launcher hit. All these embarrassing situations never change for the entire course of the game, looking for the only real alternative in the few (and fortunately, we add) sections within the Wanzers. The mechs are cumbersome, slow, heavy and difficult to maneuver, which would not be a problem if at least these digressions were fun to play. On the contrary, the use of a Wanzer is so uncomfortable and unattractive that even when you are inside, the adrenaline subsides within a matter of seconds. If what we have said so far was not enough, the icing on the cake is represented by the clashes with THE humanoid boss, which boil down to unloading hundreds of bullets on each other. In short, nothing works in Left Alive, absolutely nothing, making the player understand in a matter of minutes that he is faced with an old, tired and poorly directed title. The penalty of the technical side Left Alive's graphics keep true to the rest of the pack. Low-definition textures, poorly detailed models, almost non-existent expressions, cut or completely eliminated animations and poor general graphic detail, tell of a title linked to a decidedly low budget, for too ambitious production standards. Certainly what makes you think the most is that the same - perhaps even smaller - budget assigned to Nier: Automata, gave rise to a technically poor masterpiece, but so beautiful to play and to live, as to overshadow everything else in the background. Here, however, nothing is saved and everything becomes more difficult to digest, with the desire to quickly forget what has been seen and played. Not even the excellent soundtrack, which like so many other aspects takes up the style of Metal Gear Solid with both hands, manages to revive the fate of an experience that is devastating also due to an inconceivable audio sector, made up of ridiculous samplings and of total disappearance. To conclude an unholy journey, the catastrophic optimization on PC takes care of it, with continuous changes in frame rate that hardly reaches sixty frames per second. It's really a pity, because a product like this and the premises with which it started out required and deserved a different treatment. Here instead we are faced with one of the worst works of the last ten years, and more than displeasure, it is anger that takes over.", "date": "2019-03-08", "grade": "3.5"}