{"name": "Skylanders: Ring of Heroes", "ref": "https://multiplayer.it/recensioni/skylanders-ring-of-heroes-la-recensione.html", "text": "It had to happen sooner or later: given the structure now prevailing in the mobile RPG, increasingly focused on collecting characters through the gacha dynamics, making them evolve and then colliding in turn-based battles, a reinterpretation of Skylanders based on this mechanism could not be missing. So here is Skylanders: Ring of Heroes, protagonist of this review, perfect representative of the union between the aforementioned mobile RPG and the Activision series, which in the meantime is going through a period of distance from the major videogame scenes waiting to understand what will become of her next the crisis of the toys-to-life concept. One almost wonders why it took so long to arrive, but it must be said that reaching the maturity period of this particular sub-genre, the game in question can take advantage of the precise coding of the canon that has developed over the years , resulting in fact well balanced and structured, although so ~canonical~ as to be somewhat derivative. In case you are not aware of the type of game, you can take as reference points various RPG-type titles reviewed in recent months on mobile platforms such as, to remain among the most recent, Epic Seven, Brave Frontier: The Last Summoner or digressions themed like Looney Tunes: World of Mayhem, with which Skylanders: Ring of Heroes shares most of the aspects but adding the now rich universe related to the series, which fits perfectly into this structure so focused on collecting many characters. Also in this case we are faced with a very simple and linear story, which essentially serves to kick off a long series of quests without in-depth narrative developments but all focused on turn-based battles, where the collection and evolution of the characters they have the upper hand over the other aspects of the game, which in any case appears very multifaceted in its various management and role-playing components. Catch them all Having started out as a toys-to-life (after Spyro, of course), the Skylanders series has always been about collecting characters and comparing them to their different abilities. This superstructure fits perfectly with the mechanics of the mobile RPG present here, where the different characteristics of the creatures to be collected are all used in battle, in the formation of parties as powerful and balanced as possible to be sent in the long series of quests. This predisposition already provides a clear advantage to Skylanders: Ring of Heroes, because the charisma and design of the characters are basic elements for the success of a game of this type, together with a setting that is somehow interesting and developed in a consistent with the entire infrastructure of the game, which otherwise risks flattening out in the often cumbersome mechanisms of collecting and managing creatures. The combat system is something extremely simplified: it is about choosing three characters to deploy and simply touching the keys corresponding to the various special abilities in sequence, calculating the recharge times and mana consumption, essentially waiting for the various cooldowns to be able to perform moves again. Soon we find ourselves, as often happens, simply activating the auto-battle and speeding up everything to immediately archive the practice-clash, just to make it clear how the battle is not really the heart of the gameplay. This is found rather in the summoning of creatures and in their evolution, which as expected also involve a whole series of in-game currencies capable of opening the door to numerous micro-transactions, even beyond the classic exhaustion energy that concerns every quest undertaken and which, compared to upgrades and materials for summoning, is not even a big deal. In the early hours there is no particular need to resort to in-app purchases but the game is clearly structured on grinding, therefore in the long term the risk of pay-to-win is concrete. For the rest, you find yourself managing among numerous party configuration menus, represented by a rather clear and pleasant interface, with the addition (to tell the truth, also rather superfluous) of the by now standardized management-style section which it allows you to build structures and engage in some collateral activities, among which the greatest is certainly the PvP multiplayer. It is clearly from the creatures and their management and evolution that Skylanders: Ring of Heroes draws its strength, even if the fact of dealing with a ~virtual~ collection disperses much of the original charm of Skylanders.", "date": "2019-03-06", "grade": "6.8"}