{"name": "Immortal Rogue", "ref": "https://multiplayer.it/recensioni/immortal-rogue-recensione.html", "text": "Immortal Rogue is a hack 'n' slash roguelike with an immediate and engaging approach, based on a very peculiar touch control system: our character moves on the screen by performing small swipes, executes the basic attack when we touch the display and the heavy one, regulated by a stamina bar, if we hold it down and then draw the trajectory of the maneuver. However, this is not the only peculiarity for the new title developed by Kyle Barrett, which tells the story of a vampire who awakens every hundred years and must decide from time to time who to make his victims to satisfy the inevitable thirst for blood. This choice is placed in a precise narrative context and is closely linked to the development of the world, which, albeit on a procedural basis, will take on different connotations depending on how things went. For example, it may happen that there are movements determined to bring society back to the Middle Ages, which translates into a basically gothic setting and enemies who fight like barbarians; or personalities who look at technology with great interest, and who can transform scenarios into futuristic cities, however besieged by soldiers equipped with powerful firearms. After doing some experiments and having survived long enough to observe one and the other type of evolution, however, the concept turns out to be a simple expedient to shuffle the cards of a formula that remains similar to itself, although supported by a certain atmosphere thanks to the skilful use of graphics and sound. Gameplay The experience of Immortal Rogue is therefore that of a dynamic and progressively more complex title, in which our goal is to survive as long as possible by ringing centuries and centuries to observe how the world changes around us and how things change in the same way. threats to our existence. In concrete terms, this translates into missions that have the connotation of simple arenas of relatively small dimensions, in which all enemies must be eliminated (and certain beam devices avoided) to then access a portal that will allow us to sleep for another century , after choosing an upgrade from those available randomly: they can be armor that increases resistance to specific attacks, extra effects of our maneuvers or different weapons compared to the sword with which we begin the journey, capable of inflicting greater damage or offering completely offensive modes unpublished (see for example the machine gun). At each game over it is also possible to spend some points earned to unlock permanent elements, in the form of support characters who improve certain statistics of the protagonist or maximize the probability of finding a certain weapon in the portals. In the more advanced stages, upgrades are essential, given that the opponents become very numerous and can be assisted by very resistant bosses (Dracula's emissaries). In these situations, the fight turns into a real dance, and it is then that Immortal Rogue manages to express itself at its best, prompting us to combine reflexes and a pinch of strategy to get the better of the thickest and most dangerous groups of enemies. Structure and technical realization Immortal Rogue is offered on the App Store and Google Play in the premium format, at a price of 5.49 euros, and does not include microtransactions. However, this is a bit too high a figure if we consider the average of mobile productions and the specific contents of a valuable product in some respects, see the general design of the characters, but spoiled by the usual limitations of procedural systems, with settings that have buildings arranged haphazardly on the map: an obligatory choice to avoid identical scenarios without actually having to draw hundreds of them, but rarely live up to expectations. Then there is the original but often problematic control system. The basic attack is in fact often confused by the game with a swipe, which in fact obliges you to take the measures well and fight using only the loaded maneuver, also due to a substantially higher effectiveness. Hitting the strongest enemies, in a context in which taking damage can strongly affect the possibility of continuing the game, is never the most effective strategy: therefore it is better to move, load the heavy attack and launch it at the right time to quickly take out the weaker units and damage the stronger ones, continuing to move until the end of the fight. The technical realization supports this type of system effectively, thanks to the retro style of the graphics and thegood design of the characters: elements that, in concert with the music, manage to create fascinating atmospheres.", "date": "2019-03-01", "grade": "7.8"}