{"name": "The Textorcist", "ref": "https://multiplayer.it/recensioni/the-textorcist-recensione.html", "text": "Take any bullet hell, mix it with Typing of the Dead, pour it all into the mold of a Japanese role-playing game set in Rome and you'll have half an idea of what The Textorcist: The Story of Ray Bible is, a decidedly unique all-Italian title. who manages to do the unthinkable by successfully merging three genres at the antipodes and enriching everything with lyrics full of sarcasm, sometimes successful, others a little less. But let's not rush too much and examine its characteristics. Pray The Textorcist tells the story of the exorcist Ray Bibbia and his crusade to clean up an imaginary Rome in full spiritual crisis, despite or, rather, because of the excessive power of the Vatican. Having discovered a plan involving demons and corrupted humans, Bibbia decides to fight evil and clean up the city with powerful exorcisms. In general, the story told by The Textorcist manages to be intriguing, despite some decidedly surreal choices, while the sarcastic tones of the texts are spot on for the narrative context in which they are set. However, do not expect anything too complex or profound, but only an over-the-top plot for a scenario full of gimmicks, which will be all the tastier if you know the places in Rome where the various chapters are set. For the rest at first glance The Textorcist looks like a shameless copy of any Japanese role-playing game from the 16-bit era, especially because of its pixel art cartoon characters (really well done). However, it doesn't take much to discover the peculiarities of The Textorcist, which are revealed right from the introductory sequence that serves as a tutorial: Bible fights and interacts with the game world by writing words. That is, it is the player who must write the words corresponding to the different actions to perform them. For example, let's say you are in the Bible study and you want to read his diary: to do this you need to type the word ~Journal~ on the keyboard. Similarly, if you want to access the office computer, write the word ~On~. Do we want to talk to a specific character instead? Easy: just approach and write ~Talk~. We specify that we are not dealing with a text adventure, since the words to be written to use the various objects all appear on the head of the Bible when he approaches them. After all, we're talking about an action with some adventure elements, so it wouldn't have made sense to complicate the player's life too much from this point of view. The difficulties lie elsewhere. The Textorcist demo As written in the body of the review, The Textorcist is a unique game. If you fear its originality, know that it is possible to download a demo from the game's Steam page. We advise you to do this in order to understand whether it is for you or not, especially if you do not know English or if you are particularly slow to type on the keyboard and do not have a controller. Fight The real fulcrum of The Textorcist is in the fights against the ten bosses of increasing difficulty that mark the various game chapters. As already mentioned, in each of them the Bible visits a different area of Rome in search of demonic activity to exorcise. There are known areas and others that are less known: for example, let's imagine that even non-Romans know the Via Appia Antica or the Colosseum, while areas like the Mandrione will certainly be obscure to most. However in each of them our exorcist has to deal with an enemy with unique attack patterns, for an experience that is sometimes exciting and sometimes frustrating. The fights all take place in the same way: once you reach the boss you have to type exorcisms in bursts to damage him, while trying to dodge his attacks. When he suffers a blow, Bibbia drops the book of exorcisms and, if he is hit a second time before recovering it, he loses some of his energy. As already mentioned, the bosses all have different attack patterns: for example, one throws bombs on the map that must be defused by taking a break from reciting the exorcisms, while another has ten laser nozzles capable of firing powerful lasers. The variety is high and sometimes amazing, with really tasty solutions that break the rhythm of the sea of bullets to dodge. The control system is obviously keyboard centric, with one hand taking care of the movements and the other typing words. And here comes the first major limitation of the game and the frustration we were talking about: we who type on the computer for work have not had major problems with the control system, which we got used to in a few minutes, but let The Textorcist try a person who doesn'tn use the keyboard with our same familiarity, the second boss has already proved to be too difficult an opponent, the source of major violations of the second commandment. Consider that The Textorcist is a title with ruthless difficulty, above all because of its bullet hell nature: dodging hundreds of shots while having to write words in a few moments with one hand, often without even being able to look at the keyboard, is not for everyone. Also considering that some words are not very simple (many formulas are in Latin) and that the advanced bosses have powers that complicate typing (for example one covers the words to be typed with question marks), you will understand how much MorbidWare's game can be elitist in choosing his ideal audience. Of course, if you are one of those who can move the character and type at the same time, or if you are intrigued by the idea of learning how to do it, you will find in The Textorcist an excellent title that will really put you to the test. The alternative is to play using a controller, which completely transforms the gameplay making it more similar to that of a kind of rhythm game, where instead of writing words, you have to compose them by selecting the letters from the two available assigned to as many keys (usually the backbones ). It is a system that makes the gaming experience much more affordable, but which paradoxically makes it lose some of its strength. Obviously it is the perfect solution for anyone who does not want to fight with the other system, much more difficult to tame.", "date": "2019-02-27", "grade": "7.8"}