{"name": "Anthem", "ref": "https://multiplayer.it/recensioni/anthem-recensione.html", "text": "We have tried to accompany you in the best possible way to this Anthem review, taking the right amount of time and avoiding getting lost in the race for fast and not very thorough coverage. After about sixty hours and a progression that has embraced almost all of the activities present in the title, it is now time to sum up BioWare's ambitious and controversial title. In a market full of products belonging to the genre, which have been able to innovate little and which have almost never been able to fully convince their audience, EA tries the coup, entrusting its loot shooter to a team in severe crisis, but from undeniable talent. Not everything went as it should and, far more important, no game belonging to this group can be said to be complete and finished when it arrives on the market. There are many reasons that led us to vote at the end of the review, which remains contextualized to this precise moment of Anthem, on which we will not stop working to let you know if it will become what it undoubtedly can be. The history of the Hymn and the Cataclysms Unlike what often happens in epics of this kind, and which BioWare itself did with its timeless Mass Effect, Anthem does not put a multiplanetary story on the plate, limiting itself to telling a future that, broadly speaking, recalls what has already been done also from Guerrilla with Horizon: Zero Dawn. Although the Earth is never mentioned, referring to the region as Bastion, the aim is to tell a story set in a remote future in which man has maintained a cultural and social base close to the tribal one, but with incredibly technological additions advanced. In this environment a far from sketchy plot develops, made up of ancient and inscrutable figures such as the ~Creators~: an ancient race of beings who have left behind them an almost infinite quantity of artifacts capable of generating monstrosities of every type. During the campaign, which boasts a variable duration between fifteen and forty hours (based on your in-depth analysis of the relationships with the various non-player characters), we are called to impersonate a spear specialist. These individuals represent the last bastion of humanity called to defend their land from the legacy of our ancestors. To do this, the Javelins come to their aid, advanced exoskeletons of various kinds, capable of transforming the spearmen into real war machines. Immediately after a successful prologue that is also useful for choosing the gender and general features of our alter ego, the rest of the aesthetic customization is linked to these armors capable of flying through the skies of Bastion. The plot woven by BioWare is deeper than could be expected from a title of this kind, but not tired or boring for this, precisely because of the freedom to choose whether to dig deep into the relationships and social background of the universe, or limit yourself to following the main developments from mission to mission. The dialogues and interlude scenes boast maniacal care, which is lost only in an inattentive and listless ending, but which introduces the next developments of the plot with great narrative ability. In fact, we will have to wait for next month to get our hands on Act I of Anthem, the moment in which the first sentient races to accompany man would seem to come into play. Although the bad guy of the moment is well written and moved by interesting ideals, however, the weak point of an otherwise interesting and enjoyable plot remains, net of a campaign that has not yet told us essentially anything. This is because Anthem is a game in complete evolution, also from a narrative point of view. Bioware's move is as courageous as it is risky, precisely in the light of the genre it belongs to: if we are usually used to loot shooters in which the plot acts as a corollary to the action, here Bioware tries to innovate, grafting content with releases cadenced over time a plot that will remain in hindsight one of the most successful details of the production. It is therefore up to you to discover what lies behind the truth of the Hymn of Creation, or the subterfuges with which the Dominion intends to take control of the world, without neglecting those psychological nuances that have always made the success of a house dedicated body and soul to good storytelling. The gameplay that half works To tell the truth, the title of the paragraph does not fully reflect the idea we have of the game. This is because the raw gameplay of the various expeditions does not work halfway: on the contrary, it is the user experience delegated to the menus and the management of customization that is not convincing at all. For a discussiona of these elements we refer you to the first test of last week, in which we tried to explain the reasons why Anthem is still a immature title within the panorama to which it belongs. The lack of specific references to the level of one's companions, the inability to customize one's equipment during expeditions and the inconceivable management of forced uploads to bring us closer to the other members of the group are just the tip of the iceberg of a half-functioning system and which, to date, still represents the biggest limitation of the title. What bodes well is that most of these problems can all be solved through a series of small tricks that Bioware seems to have already been thinking about for some time and which it will introduce over the next few weeks. Instead, the element that works and entertains is the more strictly playful one and that develops and expands into a shooter with extraordinary freedom of movement, made up of large spaces and a discreet level design. There is no doubt that those who do not appreciate the genre and find it damned repetitive will not change their minds thanks to Anthem, but all the others could find in the BioWare title a worthy replacement for the various Destiny 2, Warframe and The Division. What is most convincing is the differentiation of the approach to gameplay dictated by the four available classes. Here too we refer you to the guide dedicated to deepening each of them, but we can only confirm the good impressions we had also in light of the end game activities, which we will discuss later. We cannot hide that to date the variety of these activities is certainly not extraordinary: all the missions are reduced to cleaning specific areas of the map and solving basic puzzles capable of making us proceed with the mission, but on the other hand this does not differ essentially from what all of its competitors do. Even free play, or the ability to move arbitrarily on the game map, looking for global events and small clusters of enemies, does not stand out at the moment for the offer, with the hope that the contents arriving in March can add the right depth to a currently unattractive modality. And the endgame? The high-level activities of a title like Anthem have always been the main reason for success or failure. The ability to entice the player to continue spending their hours on one title rather than another is the fulcrum of a design that draws heavily on the ~narcissism~ of the players. The spasmodic search for new aesthetic elements and equipment finds its highest form in the end game and also demonstrates the ability of a team to understand the dynamics on which this genre draws continuously. Anthem for its part tries wonderfully, but this will is not always reflected in the implementation of a still immature and unattractive system. The small amount of raids (currently only three strongholds) and the legendary contracts alone are not enough to bear the weight of the constant repetition of the same missions, soon ending up leaving a bad taste in the mouth. It is true that BioWare seems to be aware of this, intending to expand the offer already in the next few days and with at least one big monthly update, including new events, further growth of their Javelins and a total change in the game maps. We reserve the possibility of deepening these details over time, but certainly the elements revealed by the team, which will be free for all players for at least the first year, bode well for an expansion of the offer which seems to be a detail kept in mind by the guys at BioWare. To date, what works the most is a difficulty progression system that broadly resembles what is implemented in Diablo-like ARPGs. Once you reach your driver's maximum level, the game opens up three more difficulties. Each of these dramatically increases the power of the opponents, increasing the drop rate of high-level equipment in return. This dynamic is the most successful of the package, forcing teams to implement specific team decisions, both in building their arsenal and in managing situations. The concatenation of elemental combos and the choice of the Javelin to bring into battle take on different connotations from the progression of the campaign. If in the first phase of the game simple brute force is sufficient to overcome any situation, an activity played at the Grand Master levels will require you to make more than a careful decision, even simply in the management of its components orpassive skills activated with each of them. The rarity of the objects found in fact, which ranges from the classic ~common~ to the ~legendary~, hides within itself not only a disproportionate increase in its power in battle, but also a set of characteristics (to tell the truth too randomized and sometimes even illogical) that chained together make the difference between good equipment and a real destructive weapon. On this BioWare seems to be already running for cover, working on the management of the generation of perks, making sure that every time these can be functional to the characteristics of the various classes. Here a substantial difference also comes into play in the artificial intelligence of the enemies, which, although it remains on the less than exciting standards of the genre to which it belongs, transforms high-ranking enemies into a more tough type of adversary and able to circumvent or better exploit the covers. Technically speaking We have already dealt extensively with the discussion concerning the technical sector of Anthem. Net of a series of compromises to which BioWare had to make to keep the title enjoyable and fluid, we fearlessly continue to affirm that there is nothing on the market, between always online and multiplayer titles, to boast a graphic detail of this level. With all due respect to all the useless chatter related to the alleged downgrade which, although present as happens with respect to any title from the moment of presentation to its actual release, has not distanced the game from an excellence unattainable by any other direct competitor. One could argue about an artistic component that is not always inspired and that leaves time that it finds in the complexity of the flora and fauna of Bastion, but none of this affects a visual power that is at times disarming, which it finds in the possibility of flying for the boundless maps of the game its most captivating element. Another due applause concerns the audio sector, embellished by a work on the sound effects of the armor of an almost cinematic level and which has snatched more than a smile from us towards an Italian dubbing among the best and most appreciated in recent years. Obviously there remains the need to have (at least on PC where we have tested it) an adequately high configuration to enjoy ultra details and a frame rate as close to sixty frames per second. However, the two big patches released during these first ten days have allowed the team to solve a considerable number of problems, improving the experience of almost all players. As regards the netcode and the multiplayer component, net of a disproportionate amount of users, we can only appreciate the fact that the title has never created any problems for us. This does not mean that we still have to record a series of tepid feedback from those who have experienced, especially in the very first hours after the global release of February 22nd, a few too many disconnections.", "date": "2019-02-25", "grade": "7.2"}