{"name": "Trials Rising", "ref": "https://multiplayer.it/recensioni/trials-rising-recensione.html", "text": "Motorcycles in trial trim, an increasing level of challenge and lots and lots of genuine fun: these are the qualities that in the past have sanctioned the success of the Redlynx arcade series. Born as a Flash game and quickly rose to prominence in the indie arcade segment a decade ago, Trials lived its fortune especially following the partnership signed with Ubisoft. After the misstep of Trials of the Blood Dragon, which had disappointed the expectations of the fans due to some questionable design choices, Trials Rising presents itself as the worthy successor of Evolution and Fusion, or rather of those that today can be considered the best episodes of the franchise. In the last few days, players have had access to the open beta, which allowed them to test 18 tracks with variable difficulty pending the launch on PC, PS4, Switch and Xbox One. In the meantime, we have got our hands on the final version of the game and we are ready to provide you with our final verdict in the review. Single Player: An Extensive World Tour The game structure on which Trials Rising is based has not received major changes compared to the past, but Redlynx has done everything possible to make the single player experience of this new chapter significantly larger and more varied. To make possible the maximum transversality of the scenarios, the introduction of the world tour was used as a pretext. The player takes his first steps by engaging in a series of competitions in the heart of the United States, and then moving to European and then Asian territories. The result is an incessant wandering in diametrically different territories. From the American hinterland to Italy, via Siberia to China and Japan, there really is something for everyone. There is no time to get bored, thanks to the very variable structure of the tracks, always capable of hiding a few small surprises, despite the fact that in the end the basic formula is more or less the one we have become accustomed to over the years: on board the own trusty motorcycle you have to cross rough linear paths, being careful not to fall while trying to reach the finish line in one piece in the shortest possible time. The best known feature, as well as the most satisfying, concerns precisely the physics of the vehicles of which you take control. In the initial levels everything seems relatively simple, but things get progressively more complex as the structure of the courses becomes more articulated, with steeper climbs, wider jumps, loops of the loop and so on and so forth. Once again it will therefore be essential to acquire mastery of the most advanced techniques that allow the correct management of the shifting of the rider's weight, combined with the modulation of the throttle grip, which can make all the difference in the world when it comes to winning the medal. gold. In this case, the contracts signed with some sponsors have been added to the traditional races, which essentially offer additional tasks to be completed on the tracks already beaten previously. For example, it is required to perform a certain number of somersaults forwards or backwards without making mistakes, or to beat other pilots guided by the CPU. The tutorial missions must be unlocked by completing competitions and allow you not only to learn the rudiments of the discipline but also to try to familiarize yourself with the more advanced features that become invaluable when the going gets tough. The other novelty introduced by Trials Rising are the Finali Stadio, a sort of final challenge for each of the nine sections that make up the single player campaign. In these situations you have access to an elimination competition, divided into several heats, where you have to worry about crossing the finish line by placing yourself among the first four competitors, then among the first two and finally at the top of the highest step of the podium. Only by achieving this achievement does one gain entry to the next section. By accessing the Challengers Mode, on the other hand, you have three attempts to beat as many pilots in rapid succession, thus obtaining a single equipment box. Yes, because prize boxes have also been included in Trials Rising, but the available cosmetic material can be forfeited with normal game progression or with the purchase of additional packages through the in-game currency. Trials Rising therefore maintains faith in its nature: to be carried to the end it will be necessary to have the patience to try and try again the most difficult levels, trying to make all the nuances that characterize the control system their own. Multiplayer is the level editorthe Trials Rising features a classic online multiplayer mode where you simply push your skills to the limits to try and beat the achievements of your friends and other community users. After all, the incentive to improve is one of the key factors in a product that makes replayability one of its mantras. Alternatively, an unprecedented tandem mode is available, in which two riders board the same bike and must try to manage the lean of the bike and the shifting of weight at the same time, with particularly exhilarating results. Like any self-respecting arcade title, there is obviously access to the traditional local mode for up to a maximum of four players, which allows you to create personalized playlists of tracks to be completed in rapid succession, complete with a final ranking based on the placements obtained. However, Trials Rising also sanctions the return of the effective level editor, which exponentially strengthens the overall longevity of the game thanks to the precious support of the community. Simply head to the appropriate section to access a large library of more or less successful experiments that will give you even more trouble. Assuming and not granted that you manage to complete everything else, because with Trials it is never taken for granted and those who have played the previous episodes of the series thoroughly know it all too well.", "date": "2019-02-25", "grade": "8.5"}