{"name": "Final Fantasy 9 per Nintendo Switch", "ref": "https://multiplayer.it/recensioni/final-fantasy-9-nintendo-switch-recensione.html", "text": "Square Enix has a strange relationship with its past. The news that some of the most popular episodes of the Final Fantasy series would arrive on Nintendo Switch and Xbox One was predictably received with excitement and enthusiasm, especially by those who, between the 90s and the early 2000s, never had the opportunity to face Sephiroth in Final Fantasy 7, escape with Princess Garnet in Final Fantasy 9 or be moved by the ending of the tenth chapter. Yet, when it comes to preserving the history of its most important games and reproducing them on the most modern platforms, Square Enix has rarely been able to do justice to the masterpieces of its past, accustoming fans to listless and imperfect ports and adaptations. So, when Final Fantasy IX was released on Nintendo Switch, no one was surprised to discover that the edition that appeared on the Nintendo console is nothing more than the same disputed and flawed port that appeared a couple of years ago on PC and PlayStation 4 , in turn based on the mobile edition dating back to 2016. For better, but mostly for worse. A port with a mobile soul Much like previous iterations of the port, Final Fantasy IX on the Nintendo Switch comes with a handful of noticeable graphical tweaks over the PlayStation original. Character models have been completely redesigned, sporting much higher polygon counts and richer textures. However, if on the one hand this treatment helps to rejuvenate the aesthetics of a game that feels the full weight of the twenty years that have passed since its debut, on the other it ends up highlighting one of the main flaws of the port. The ~new~ character models screech against the low-res backgrounds like a Chocobo's beak on a blackboard, and while the graphics filters try to patch it up, the result ranges - depending on the situation - from incoherent to annoying. Presenting backdrops in high resolution (and at 16:9) would require Square Enix to make a considerable effort, essentially having to redesign all the illustrations that form the background of the game and add completely new details to fill in the vertical bands that are now at the sides of the screen. However, through unofficial patches and mods for the PC version, the community of geek enthusiasts has shown that with better filters and more modern upscaling techniques it is possible to increase the resolution of the backdrops with infinitely more effective and pleasant results than those seen in the port arrived on eShop. The gorgeous cutscenes are higher resolution than the PlayStation originals, as are the Tetra Master's menus, various icons and card art, but since the Switch edition is based on the 2016 mobile port, even the interface has remained identical, with clear fonts and balloons (after all, they are designed to be readable on a smartphone) but at the same time cold and without any personality. Titles like Undertale demonstrate how a simple font is able to convey the imprint of a game, the temperament of a character or the intonation of a conversation. The only thing conveyed by the Final Fantasy IX font on Switch is instead the sense of detachment and coldness with which Square Enix has re-proposed to today's players what is a piece of video game history. If the graphics of the fonts, the style of the menus and the resolution of the backdrops can still fall within the sphere of personal taste, the same cannot be said for the technical problems that this re-edition continues to bring with it despite the numerous criticisms from enthusiasts. As on PC and PlayStation 4, in Final Fantasy IX on Switch it happens from time to time to find yourself faced with long loads before entering battle, framerate drops during fights and an annoying audio bug that makes the music track start over every once you finish a fight and return to the world map. Imperfect are also those optional options introduced to simplify the life of less patient users. An example is the possibility of increasing the speed of the game, a blessing to overcome the most trivial fights in an instant, but which outside of the battle transforms the experience into a Benny Hill Show gag, also making it impossible to follow the dialogues. The solution is therefore to pause the game before and after each battle to activate or deactivate the option, a tedious procedure that does not take into account the frequency with which enemies are encountered during exploration. And it's a shame to be faced with all these flaws precisely because Final Fantasy IX remains a stellar JRPG today as it was twenty years ago, with an exciting story set in an fantasy world full of unforgettable characters. There are those who hypothesize that Square Enix's difficulties in preserving its old masterpieces depend on the loss of original materials (we also discussed it in our retrospective dedicated to Final Fantasy 8), but regardless of the veracity of the argument, the Japanese company has in the past overcome obstacles of this type for market interests (with Kingdom Hearts 1.5 HD) or to cool the hot criticisms of the fans (with the controversial PC version of Chrono Trigger).", "date": "2019-02-20", "grade": "7.0"}