{"name": "Metro Exodus", "ref": "https://multiplayer.it/recensioni/metro-exodus-recensione-ps5-xbox-series-xs.html", "text": "Hope dies last and when you are forced to live in the dark tunnels of the Moscow Metro for twenty years, there is nothing more desired than to go out to the surface, look again at the sun shining, pick up a radio signal and discover that somewhere there are still free, uncontaminated lands where you can rebuild a semblance of normality. On the occasion of the review of Metro Exodus in the next-gen version for PS5 and Xbox Series X|S we immersed ourselves again in the disturbing atmospheres of the post-apocalyptic scenario created by Dmitry Glukhovsky, putting us in the shoes of the brave ranger Artyom for one last, exciting adventure out of the darkness, chasing hope aboard a train. Enhanced Edition Available with a free upgrade for owners of the original version for PS4 or Xbox One, the next-gen edition of Metro Exodus basically introduces four technical innovations: the resolution that reaches dynamic 4K, the frame rate that passes to 60 fps, the ray tracing and faster uploads thanks to the SSD. We talked about it in detail in a special special with the news of the update for PS5 and Xbox Series X|S. All these aspects have a substantial impact on the experience, not only clearly improving the visual impact of the game as regards the level of detail, reflections and effects in general, but also the precision and pleasantness of the gameplay, which benefits greatly from 60 frames per second. As far as loading times are concerned, we found them faster but far from instantaneous, in short, lower than the average for PlayStation 5 titles. Contents Metro Exodus, one of the open scenarios that revolutionize the experience. If you remember our review of Metro Exodus, or if you have already tried the game, you will know that the latest episode of the 4A Games series distances itself from the first two chapters quite clearly, experimenting with a mostly open setting, but which however does not correspond to the canons of a real open world. Wide scenarios punctuated by train stops, which nevertheless increase the variety of situations in concert with an approach close to the survival tradition. The exodus of Artyom, his wife Anna and their Spartan companions takes the form of a journey that lasts for an entire year and which takes advantage of the alternation of the four seasons to present us with locations that are always different in terms of climatic conditions and shades of color , which can be explored by day or by night depending on the approach we prefer: in the light of the sun we will find a greater number of guards and armed bandits waiting for us, while at night the patrols will be fewer but there will be more mutant beasts to watch out for. Gameplay Metro Exodus focuses on tactical combat, always keeping an eye on available resources. The more airy nature and the introduction of crafting add new facets to the traditional gameplay of the Metro series, which in this way gets very close to the RPG trend without going as far as to indicate life points and numerical damage. In fact, we will be able to collect resources around and build bullets and medikits, or disassemble the weapons of enemies on the ground and use their components to build upgrades for ours, once we find a workbench. In-game these aspects translate into a setting almost survival, as we said, in which there is the air rifle to ~pump~ every time, the mask to clean or repair, the filter to replace, the electric dynamo to recharge and ammunition is often scarce, forcing you to plan the actions are good when you are faced with a large group of enemies in order to avoid remaining unloaded and having to resort to a frankly ugly and ineffective melee combat system. Metro Exodus, a taste of the new effects used for narrative purposes. Therefore, frontal assaults are good where you have sufficient resources to support them, stealth eliminations are even better in which you can decide whether to kill or simply stun your opponents in view of the moral and practical consequences of such actions. However, having to put the two souls together, the guys from 4A Games had to limit the artificial intelligence of the enemies, which in many cases appears really modest. The elements relating to the interface close the circle, which already in 2019 did not appear revolutionary but today even more they feel the weight of the years, together with a narrative sector that moves between ups and downs, with dialogues that are a little too obvious and predictable compared to the reference material, the unfortunate choice of leaving the protagonist almost always silent and a voice acting in Italian well done butwith some obvious shortcomings, little supported by contrasting animations during the cutscenes. Technical realization and PS5 version We therefore come to the fulcrum of this review, namely the technical realization and, in particular, the innovations introduced in Metro Exodus for the landing on PS5. According to Digital Foundry's insights, the game performs better on the Sony console in terms of performance than the Xbox Series X version, offering a frame rate more firmly anchored to 60 frames per second, but paying the price on the resolution front. The dynamic scaler in fact, it comes into action in an overbearing way, working in a range that goes from 1512p to 1296p in the most complex situations and thus returning a generally softer image. Frankly this is not a problem during the sequences that take place in closed settings, indeed the mix of color tones, graphic style and sweetness creates extremely pleasant ~pictures~. The story is different outdoors, in particular with respect to vegetation, where some artifacts are more visible. Metro Exodus, a complicated situation in the middle of the journey. However, we are talking about more than acceptable sacrifices where the counterpart is represented by the implementation of ray tracing, also in this case the great protagonist of the visual sector. The impact of this technology on the rendering of the lights is evident, and although the final quality is not the same as we appreciated on PC, the improvement compared to the original edition appears to be remarkable. Of course, it would have been interesting to be able to count on different graphics modes, but the compromise identified by 4A Games is probably the one that we would all have chosen to use anyway. On PlayStation 5 we also find good support for the features of the DualSense controller and in particular for adaptive triggers, expressing a variable resistance according to the action we see on the screen, offering different feedback according to the weapons and, in general, do a great job of increasing the sense of immersion in the action.", "date": "2021-06-20", "grade": "8.0"}