{"name": "Age of Empires 2: Definitive Edition", "ref": "https://multiplayer.it/recensioni/age-of-empires-2-definitive-edition-recensione-xbox-cloud.html", "text": "Being able to play Age of Empires 2 with the gamepad is, in its small way, a historic event. Microsoft's real-time strategy game has been one of the most popular PC games for about 25 years, a true icon of that type of product that, despite everything, could not be had on consoles. Microsoft's strategy with Game Pass, however, no longer provides for barriers and this applies to both directions. So if all Xbox games are to be available on PC directly at launch, then even those genres that were once thought to be possible only on PCs must now find their way into living rooms (and even phones) across the globe. world. It happened with Flight Simulator, another simulacrum of the self-proclaimed ~master race~, and now it happens with Age of Empire. In this case, however, the operation is more risky than expected: several generations of consoles have now been tried by several development studios to adapt real-time strategy games to gamepads, but few have come close to having acceptable results. Curiously Age of Empires 2 is at the center of some of the most famous attempts: in 2001 Konami brought the original game to PlayStation 2, but it was a rather direct conversion in which the lack of practicality and precision of the controllers immediately emerged, especially if they have to emulate mouse and keyboard. Even the original developer of the series, Ensembe Studios, before closing its doors tried to create an RTS designed natively for consoles: even Halo Wars, despite its quality and high-sounding name, failed to clear the genre on Xbox. In the review of Age of Empires II: Definitive Edition we will try to see if after years someone has managed to close the circle. The definitive version Age of Empires 2 Definitive Edition brings everything from the PC version to consoles First, however, let's make a small premise. Age of Empires 2: Definitive Edition, as it is easy to guess from the name, is the definitive version of Age of Empires 2, a 1999 strategy that was re-proposed on PC in 2019 with improved resolution and graphics on the occasion of the twentieth anniversary. This edition, curated by Forgotten Empires, contains all the downloadable content and expansions released over the years, plus an unreleased pack designed for the occasion, as well as some small graphical tweaks introduced to make some units more enjoyable and map management easier , such as a more effective zoom. On balance, these are 11 historical campaigns that retrace the deeds of some of the most famous heroes in history (William Wallace, Genghis Khan and Joan of Arc, just to name a few), to which you can add cooperative missions, skirmishes and the classic multiplayer. Do not underestimate the improvement of artificial intelligence which, at the highest levels, behaves in a less mechanical and more credible way. All this to say that the version that will arrive on Xbox One, Xbox Series X|S and cloud on January 31, 2023, from a content point of view, is identical to the PC one. So, in case you are looking for more detailed information on the composition of the package and a description of improvements, we refer you to the original review of Age of Empires 2 Definitive Edition. The initial phase of Age of Empires 2: Definitive Edition is a cornerstone of the genre What you need to know in this case is that in Age of Empires 2: Definitive Edition the player will be called to make his kingdom prosper through different historical eras. It will be necessary to do so by developing mainly two elements: on the one hand there is the economic growth of the settlement, based on the exploitation of the resources scattered on the scene, on the other the management of the army, the inevitable tool with which to settle any differences with the other actors acting on the map. The Age of Empires 2: Definitive Edition campaigns decline this structure in different ways, telling the deeds of some of the most famous leaders in history so as to put the player in front of different challenges, such as having to face much stronger armies or having to get a fragile economy back on track. Everything as we remembered it, therefore, for this we focus on what it is like to play Age of Empires 2: Definitive Edition with an Xbox gamepad. An adaptation, not a conversion Radial menus are the key to this adaptation of Age of Empires 2: Definitive Edition To summarize, we can say that the one done by Xbox Studios is more of an adaptation than a conversion of the game. In fact, the developers didn't limit themselves to mapping PC controls to a gamepad, but they looked for a way to automate some processes, group options and simplifyare some operations. However, learning all the shortcuts properly takes time and the speed and precision of the mouse + keyboard combination are still unsurpassed, but it cannot be said that it is not possible to play Age of Empires 2: Definitive Edition comfortably on Xbox, also thanks to the new tutorials designed to teach strategies and controls. To achieve this goal, the developers have tried to limit all the information and options available to the player to a maximum of two keystrokes. This is thanks to an intelligent management of the radial menus, which change according to where the cursor is positioned: above a building you will see the management options of the same, such as the possibility of building technological improvements or creating a queue of units. On the warriors you can decide their attitude, whether to make them patrol an area or protect a building. Without any particular target, you will be able to access a more generic menu that allows you to send specific units to a point, for example a fishing boat on a newly discovered school of fish, or to access the general construction menu. In this way it will be possible to decide to build a building without selecting an inhabitant, the AI will then send one to complete the job. Furthermore, you can customize some of the slots in these menus, in order to adapt them to the needs of the game or simply to your own way of playing. Mouse and keyboard remain unsurpassed, but Age of Empires 2: Definitive Edition is also very playable on Xbox The directional cross allows you to jump between the different units (military, citizen or religious) with a double click you select all the soldiers of the same kind, while holding down the A key you can group all the units ~touched~ by the cursor. The economic management is very interesting: it will be possible to choose the occupation of each individual citizen in a timely manner or, by pressing the right trigger, one can decide to automate these processes. There are presets based on the era in which civilization is located and you can decide how many workers to allocate to a specific sector, with the others being managed by the computer as needed. Thanks to some shortcuts to jump from one point to another on the map and the possibility of zooming a lot, it is possible to manage the entire scenario quite efficiently, even during the most hectic phases. Vintage The graphic impact of Age of Empires 2: Definitive Edition is pleasant and very readable, but we see that we are talking about a game more than 20 years ago Despite the improvements in this Age of Empires 2: Definitive Edition, such as 4K resolution (1440p on Series S) or improved assets, we are still talking about a game with almost 25 years on its back. Therefore, from a purely technological point of view, it cannot be defined as beautiful or modern, but certainly functional. The units and buildings are clear and well defined, the maps pleasant to look at and well designed and the series undoubtedly has an unmistakable style, however it is impossible not to notice the ~jerky~ construction animations, the design of the menus and the vintage interface and all those things that have been conquered in these two decades of studying the game interface and quality of life. For the console version, however, some very interesting accessibility options have been added, such as the audio guide of the menus, colorblind mode, and a larger interface than menus. Context menu handling in Age of Empires 2: Definitive Edition works well The only sector that hasn't aged is the sound one, given that it could count on a good dubbing in Italian and epic music. Again the age of the sound design is noticeable, with noises disappearing if they go off-camera without a smoother fade. Ultimately nothing that affects the quality of the gameplay and the fun: Age of Empires 2 is still one of the best exponents of the genre and this Definitive Edition is extremely rich in quality content, with which to occupy dozens of hours between historical and intense campaigns multiplayer skirmishes.", "date": "2023-01-30", "grade": "8.5"}