{"name": "Unruly Heroes", "ref": "https://multiplayer.it/recensioni/unruly-heroes-recensione.html", "text": "The journey to the West is one of the best known and most exploited stories of oriental origin for the most varied multimedia adaptations, although probably few people actually know the cycle of classic novels attributed to W Chng'n, written around the end of the 16th century. The fact is that the story of the monk accompanied by the monkey, the pig and the demon has practically entered the global imagination of Chinese classicism and continues to be an infallible source of inspiration for those who intend to stage something particularly exotic. When a remarkable attention to the product from an artistic point of view is added to this base of fascinating atmospheres, then really interesting solutions can emerge, just like in the case of Unruly Heroes, which we examine in this review. In presenting the game, we can't help but notice how some of the members of the French Magic Design Studios team come from Ubisoft and have previously worked on the latest installments of the Rayman series, which is evident even at a first glance at this new title. Both in terms of structure and graphic style, the kinship with Michael Ancel's famous 2D platformer series is clear, although Unruly Heroes still manages to maintain considerable originality in terms of style and game solutions. First of all thanks to its peculiar setting, obviously, but also for the alternating use of the four protagonists who manage to vary the game action in an interesting way, in addition to the various solutions in which it is possible to find oneself during the levels. Beyond a few flaws and some intrinsic limits in the type of game, this debut from Magic Design Studios promises really well. There was a monk, a monkey and a pig The story broadly resumes the premises of the original text, with the four unlikely heroes sent to unknown lands to recover the pieces of a sacred parchment capable of maintaining harmony in the world. Unruly Heroes plays with the classic subject stressing the humorous aspects, in accordance with the cartoonish and colorful graphic style that characterizes the game, but the challenges that await the four are not to be taken lightly, between demons, spirits and assorted mythological creatures of course inspired by the traditional imagery of Chinese folklore. The structure blends elements of action and puzzle on a fundamentally platform basis, while remaining anchored to the classic tradition of the 2D genre, with separate levels, secrets to discover and occasional boss fights, within very different environments . Beyond the skill required in mastering the movements during the platform phases, great importance is entrusted to the combat system, as well as the use of a little ingenuity to get to the bottom of the puzzles. In many cases we are faced with environmental puzzles, linked to specific characteristics of the various settings, or we resort to the typical switches up to very particular conditions, such as the possibility of controlling beasts and enemies by exploiting their various abilities. The alternating use of the four protagonists with different characteristics works well to vary the action, but to this we add the many different situations, with frequent surprise variations that remind, again, the recent chapters of Rayman and some ideas that also refer to the Oddworld series. In short, both in the moments in which it demonstrates a certain originality and in the numerous solutions that are not entirely new solutions, there are excellent results to be recorded, thanks to an assortment of ideas and choices that are particularly happy also in terms of sources of inspiration. Puzzles and kung fu The abilities of the four characters are reflected both in the combat system and in solving puzzles, thanks to the different powers and tools they can use. Wukong the monkey is armed with his classic extendable staff, he is fast and can double jump, the monk Sanzang can glide, possess enemies and throw energy balls, the pig Kihong fights with a halberd and is able to flutter while the demon Sandmonk can throw mighty punches capable of breaking down walls, as well as double jump himself. The mastery of these different skills becomes essential to advance in the various levels because the puzzles require their correct alternating use, with some variations in correspondence with particular statues that activate further specific powers: the lengthening of the Wukong stick to overcome obstacles, levitation of Kihong which allows you to fly and reach inaccessible places, the energy spheres dthe Sanzangs and more. In short, just as regards platforms and puzzles Unruly Heroes offers quite a few challenging elements, but to these are added the fights which are practically constant and in some cases even quite demanding. The different styles of the four characters manage to always keep the action fresh, but the control system at this juncture is probably the weak point of the game: the response to the commands is not always perfect and the action, during the clashes, can become particularly chaotic and imperfect control does not help. This can also lead to moments of frustration in boss fights or in particularly complicated phases, also due to the sometimes rather punitive positioning of the save points. The medium difficulty level is not particularly demanding, therefore the errors that can derive from the control system are often not very perceptible but can increase those difficulty peaks that are noticed scattered in some moments of the game. Exotic charm The graphic style of Unruly Heroes is one of the strengths of the entire production, even if everything is still supported by an excellent study of the gameplay. In any case, packaging the game with such care is a notable plus, which allows the title to stand out in the chaos of indie productions on the market. The simple use of the 2D platform already determines a particular charm, but the developers have also shown that they know how to handle the material in question with a certain skill, enriching everything with an original character design, excellent animations and a beautiful construction and variety of scenarios. In short, from an artistic and aesthetic point of view, the work done on Unruly Heroes is masterful, an even more impressive result if you think that it is an absolute debut for the independent team. Also with regard to the contents, the offer is remarkable, considering that eight to ten hours (at least for a first run) will be needed to complete the game and for a platform of this type they represent a good longevity, to which must be added the possible replayability of levels for collectors of extras. The conclusion of the level is in fact evaluated on the basis of the time used and the amount of coins and special objects found, which encourages you to go back inside to get better results and discover the various secrets. It must be said that with such a long duration there are drops in rhythm and intensity, but these are physiological defects. The possibility of playing two-player cooperative multiplayer is interesting, but the problem is that this is not available online, at least for the moment, which significantly limits its possibilities of use.", "date": "2019-02-10", "grade": "8.4"}