{"name": "Hi-Fi Rush", "ref": "https://multiplayer.it/recensioni/hi-fi-rush-recensione.html", "text": "In the history of music, there have been bands that have conquered their place in the Olympus of rock after a long process of growth and experimentation aimed at making their talent sprout, while others, like an angry and heavily armed Viet Cong, they emerged from a bush and immediately took the top of the chart without the public having ever heard of them a week earlier. In a similar way to how records like Ten and Appetite for Destruction did in the field of music, for five days now Hi-Fi Rush has monopolized all the frequencies of the videogame debate, indisputably becoming the most listened to videogame of the moment. being announced and launched during last week's Developer_Direct of Microsoft helped to catalyze the attention of the curious on the new musical action of Tango Gameworks, but the truth is that the tam-tam exploded recently derives first of all from the stellar personality that the title was able to exhibit during that presentation trailer, even capable of overshadowing the other great protagonists of the evening such as Forza Motorsport and Redfall. The premises suggested the possibility of running into another first-party production with values similar to those of Pentiment, so we threw ourselves into listening to John Johanas' new project immediately after the event, remaining glued to it throughout the end week. In the Hi-Fi Rush review, here are all the reasons why your personal playlist will soon be enriched with a splendid new album. Small to whom? In the cutscenes of Hi-Fi Rush, Chai and the other characters are animated in an impressive way, better than a real cartoon Observing the lively gameplay sequences with which the game was presented, it was easy to fall into the temptation to declassify Hi-Fi Rush to an action with modest production values, capable of remaining invisible to insider radars due to its small size. In reality, already after the first hour of play it is easy to conceive the true nature of the new Tango Gameworks experiment, which after several horror films has chosen to take a completely unexplored path to test itself with something completely new. Although it was developed in parallel with Ghostwire: Tokyo, the title has absorbed the studio's efforts since 2017, after Johanas, fresh from the excellent The Evil Within 2, proposed the project to the top management of the company. The game is therefore the fruit of a respectable development cycle, and has absolutely nothing small, except the list of ~cons~ that you will find at the end of the review. Sparkling, colorful and magnetic, Hi-Fi Rush is a third-person adventure with an exquisitely punk soul, which inserts rhythm game elements into that classic action combat system typical of oriental productions and, above all, of some works created by the Studio 4 directed by Shinji Mikami, who settles for the role of executive producer here. We have a city to burn, Scott Hi-Fi Rush's boss fights are somewhat reminiscent of Scott Pilgrim and Ramona's seven ex-boyfriends Made with a magnificent graphic style halfway between cartoon and comic, which broadly recalls the color palette of that masterpiece that is Jet Set Radio, the story never takes itself too seriously for all the 13 hours we spent to complete it, while he tells the story of Chai, a boy from a not so distant future who wants at all costs to become a rock star. Cyberpunk 2077 taught us, you're not a rock icon unless you mend a mechanical arm and fight a megacorporation, and that's just what Chai will be up against, supported by a well-crafted cast of supporting characters that's slowly being integrated within the story throughout the game. The narrative background is linked to an incident in which Chai is the protagonist, and which leads him to have his iPod implanted in his chest. Vandelay, a prosthetics and robotics conglomerate, sees the boy as a manufacturing defect, and in trying to eliminate him kicks off an adventure openly inspired by the Scott Pilgrim comic series, naturally punctuated by hilarious boss fights against the top management of the company, each characterized to perfection. The story, as we said, mostly acts as a glue between one level and another and has no desire to keep you in suspense, as it flows lightly and carefree without missing a note. In short, the plot is a placid opening band that could discourage those looking for more rhythmic experiences on the narrative front, but woe to leave the place because the gameplay alone is worth the whole priceof the parterre ticket. Style and technique All gameplay of Hi-Fi Rush is filled with gorgeous comic-style effects It only takes a few seconds to get to grips with Hi-Fi Rush to understand how well the experiment devised by Johanas works. Basically, the game doesn't deviate much from a normal Devil May Cry or Bayonetta action, except that its protagonist has implanted a music player in his chest and, therefore, the whole world around him pulsates to the rhythm of music . On the notes of pieces like Lonely Boy by The Black Keys, Invaders Must Die by The Prodigy and Perfect Drug by Nine Inch Nails, we will be constantly tempted to press the attack buttons to the rhythm of the music, even if it is not obligatory, since the protagonist strikes in rhythm even if the pace of the song is not accompanied at all. fielded by Vandelay, and much better scores are obtained at the end of a fight, which is essential for anyone who does not want to end a battle with a bad grade. To tell the truth, trying to get an S at the end of each fight is the real purpose of Hi-Fi Rush, also because there are so many tools that the player can use to do it. An anthology combat system In Hi-Fi Rush we will always face robots, but the variety of enemies is very high During the first hour of the game, one may have the impression of being faced with a gameplay that is all in all simple, even limited, in which alternating between a quick attack (lasting one beat) and a heavy attack (two beats) you they can chain together a handful of combos that make Chai's job much easier. However, with each step that the player takes towards the end credits, the combat system is transformed, strengthened and enriched, wiping out the monotony that could easily make the experience offered by Hi-Fi Rush nauseating. Before completing the first level, you gain access to Go So attacks, timed shots placed at the end of a combo that allow you to inflict extra damage, and later you unlock dodges, parries and parries, which are not reserved secondary moves to an expert elite, but on the contrary the only way to eliminate the most advanced robots. By obtaining the wreckage that is scattered around the game world, you can buy up to 15 new combos, and other varieties of special attacks, a sort of super that recharges by hitting enemies or collecting batteries hidden in the area. While it would probably take four articles to tell you every little nuance of Hi-Fi Rush's deep and layered combat system, we're almost relieved to admit that at least when you put your weapons away, Hi-Fi Rush's new effort Fi Rush turns out to be ordinary. Maybe too ordinary. Each level is in fact extraordinarily linear, and is composed of an arithmetic and very cold alternation between arenas and platform phases which only in some very rare situations allows space for unique game sections. Luckily, the levels don't look alike so the flaw is somewhat tempered by a good variety of obstacles and environmental hazards, but if we're to find fault with Tango Gameworks' new title, it's definitely related to its level design. And there is also an endgame In the shelter, the Hi-Fi Rush hub, we will be able to talk to the other characters and participate in the endgame activities In the event that the thirteen hours of main storyline should not be enough to justify the purchase of the game for  29.99, you will be pleased to know that Hi-Fi Rush is supported by a very rich endgame full of new activities, in spite of anyone thought he was in for a little double-A adventure. Once the credits roll, not only will it always be possible to replay a level in an attempt to get an S for every fight in the game, but you will also unlock two types of new content, capable to project the hour counter of your save to the stars. The first is the Rhythm Tower, a very challenging timed mode in which the objective is to climb its floors while facing hordes of enemies, while fighting against the clock. Kills recharge it, while upgrades and treatments that can be purchased in a shop inside the tower cost game seconds. It goes without saying that completing it will present a real challenge even for the most experienced players, and we can't wait to find out what results the community will get in the attempt. The second novelty, however, is linked to the main plot, and plans to rego through each level in search of secret doors that were sealed during the first completion. There is a special challenge inside the door, such as the one that required us to clear the arena of enemies without touching the ground. We have no idea what lies behind the last door, but it doesn't matter. The Tango Gameworks adventure has a huge replay value when compared to the list price, not to mention that through the Game Pass it is available to everyone, at no additional cost, on PC, Xbox and xCloud compatible devices.", "date": "2023-01-30", "grade": "8.5"}