{"name": "The Grand Tour Game", "ref": "https://multiplayer.it/recensioni/the-grand-tour-game-recensione.html", "text": "The Grand Tour Game is one of the first products born from Amazon Game Studios, a team that the e-commerce giant founded with the aim of making its way into the vast and complex world of video games. Supercar enthusiasts will no doubt have already heard of the crackling TV trio formed by Jeremy Clarkson, Richard Hammond and James May. After relinquishing the reins of the British show Top Gear in 2015, the merry fellow tire dribblers had the good idea of creating a brand new show entirely dedicated to motors. Obviously in their own way, catapulting spectators to the four corners of the planet aboard dream cars, amidst improbable tests and lightning-fast challenges stuffed with tons of gags and a rich collection of jokes in perfect ~British~ style. On the other hand, the fulcrum of the transmission consists precisely in the ability of the three histrionic presenters to pierce the screen without many frills, entering into harmony with those who follow them from the comfort of home. After the first two seasons, broadcast on Amazon Prime Video in 2016 and 2017, the first of fourteen appointments that will mark the third season of the show until April 12, 2019 made its debut in the last few days. The idea from which The Grand was born Tour Game is precisely that of taking the original video materials and sewing a video game around them that makes the driving sections present in each episode interactive. At least on paper, the idea would seem to reserve some interesting ideas, but how will the production have proved to be tested by facts? Let's find out in our review. Episodic structure For the moment, the game offers three episodic packages which include the first episode of Season 1, the first episode of Season 2 and the first episode of Season 3. In this first phase, The Grand Tour Game therefore offers a limited retrospective on the debut episodes of previous shows, evidently in an attempt to give the player a few extra activities before moving on to the more current material. To start this third ride, Clarkson, May and Hammond set off again from the city of Detroit, an old temple of engines that has now fallen into disgrace. In addition to roaming the streets of the metropolis, the three ended up finding themselves in an old abandoned factory, transformed for the occasion into an improbable race course aboard three exciting muscle cars. As we have said, the interactive structure of The Grand Tour Game is characterized by a high fragmentation, but this does not depend only on the temporal distribution of the proposed contents. Each portion of the film in which places, situations and ~races~ are introduced alternates with actual road tests: the only ones during which it is possible to actually pick up the pad. The player is given the freedom to decide whether to blindly skip the filmed and descriptive sections to go directly to the action, but in our opinion this is a questionable choice given that the competitions offered in The Grand Tour Game have significant limitations. In short, it doesn't take much to realize that depriving the game of the program itself would make very little sense; let's try to better understand why. Arcade gameplay to the core, but the quality? The Grand Tour Game offers gameplay based on five types of competition. Given the structure of the program, speed races cannot be missing, where the presenters engage in standing starts to compare the acceleration capabilities of each car over short distances. There are timed races, in which the three performers challenge each other to achieve the best test, but also those that simply require you to reach a certain score by accumulating drift points. However, the most unlikely category is that of thrill races, in which all you have to do is drive at high speed and perform a series of maneuvers to fill an indicator that symbolizes the enthusiasm perceived by those behind the wheel. In these situations you are always involved in game situations of short duration and with the presence of only one car on the track. The only category that leaves a little more room for competition is the one that features races with activated power-ups. Along the lines of a Mario Kart or a Blur, the player takes to the track and can collect temporary power-ups for the car. Once activated, they end up affecting the performance of your own vehicle or those of your opponents. We find rather classic solutions, such as the NOS to increase travel speed or the rear smoke capable of obscuring the view of those in the rear. Others however are very much in line with the sympathetic nature of the programmea, providing, for example, to send noise disturbances or text messages to distract other drivers from driving. Each of these short clips provides for the award of three medals (bronze, silver and gold) depending on the skill demonstrated. At the end of each package it is then possible to replay the individual race events to try to earn gold in each category. In short, a lot of smoke and a little roast, even if the limitation of interaction is just one of the many problems that afflicts The Grand Tour Game. The main flaw we found lies precisely in the guide system. If on the one hand the distinctly arcade setting given to the product is in line with the target of the broadcast, winking at the more casual user, the interaction proved to be really too rough and undoubtedly not in step with the times. Not to mention the almost non-existent vehicle physics. Suffice it to consider that it is often sufficient to go flat out doing nothing but manage the drift in the curve. Braking and trajectories have practically no concrete relevance, so much so that in some cases even the fact of ending up against the barriers that delimit the route does not affect the final result that much. Indeed, it can even happen to do better times with this technique than when trying to drive carefully. Collisions with other vehicles and parts of the scenario are also very little, which are tremendously artificial and very little up to the standards imposed by contemporary productions. Furthermore, the way in which some contents present in episode 1 of Season 3 were handled is rather questionable. We are referring in particular to the moment in which Clarkson goes to the Donington circuit to test the new McLaren Senna. This section was literally cut from the video game because apparently the assets needed to make it weren't available. Yes, you read that correctly. The scene in question was therefore replaced with another test on the famous Eboladrome, where Richard Hammond tried his hand at the McLaren 720S. It would then be appropriate to briefly mention another design choice that shows all its limits, or rather the results of the races completed by the player compared to the results narrated from time to time in the broadcast. By completing the tasks you get a goal that in many cases is denied by the cutscene that follows. This is predictably because no one took the trouble to involve those directly involved in a series of alternative videos that would cover all the possible variants while giving the product a minimum of overall coherence. Multiplayer mode in split-screen and graphics Alongside the single-player mode, which strictly follows the episodes of the television series, The Grand Tour Game also offers a timid local multiplayer mode. There are two alternatives available: by selecting Duel it is possible to challenge each other on one of the single tracks unlocked following the completion of each episode, while by opting for Grand Prix one can try a group of races - always coming from the single single player episodes - with a maximum of three other friends. At least for now there are no online features of any kind, not even simple leaderboards related to times and scores. We found Amazon Game Studios' attempt to vary the contents a minimum to make The Grand Tour Game a title that can be enjoyed in a group, but even this portion of the game failed to convince us. And what about the graphics? From a technical point of view, the title is decidedly anonymous and, moreover, not without some problems. In addition to the aforementioned problems related to collisions, we have found frequent slowdowns in fluidity in some settings, with noticeable drops in frame rates that are not a little annoying while driving.", "date": "2019-01-26", "grade": "5.5"}