{"name": "Resident Evil 2", "ref": "https://multiplayer.it/recensioni/resident-evil-2-recensione-ps4.html", "text": "Resident Evil 2 is an extraordinary remake, in many ways a fascinating case study. It was obviously not easy to deal with the power of memories and the nostalgia of those who lived that experience in an intense and engaging way in 1998, but apparently the Capcom developers do not disdain challenges and indeed face them head on. without fear, aware of their abilities. The precedents were well known, moreover: two years ago Resident Evil 7 biohazard demonstrated how it was possible to revolutionize a franchise so popular and rooted in the collective imagination, even without actually doing it: the first person view and the passive phases had deceived many players, but they represented only one piece of the puzzle for a production that turned out to be more similar to the classic episodes than it appeared at the beginning. In the case of Resident Evil 2, however, the operation was even more complex and suggestive. The task was in fact to transport the historic chapter to the present day, completely redesigning its aesthetics and adopting a series of expedients that could somehow preserve that iconic mix of woody gameplay and tension, without giving users an action with slow and angular connotations. Mission accomplished? Storyline and gameplay The initial sequences of Resient Evil 2 are probably the ones that most distance themselves from the original, trying to bring the Capcom remake to the Olympus of cinematic experiences that are the most popular among triple A productions. It's all very engaging: the preamble with the distracted truck driver, the premonition of a disaster that is about to hit Raccoon City, the arrival of Leon Kennedy for his first day of service with the police department and the shadow of something not quite right already at a few kilometers from the city centre, at a service station. The two protagonists meet by chance and decide to continue together to try to understand what is happening, but soon after fate divides them and they face the nightmare alone. As you probably already know, the game actually includes four variants of the single player campaign, with the possibility of taking on the role of Leon or Claire and witnessing the events from their point of view, but also appreciating many small (and not so small) differences which make each playthrough worthwhile. By completing the campaign with Leon we will be able to unlock the alternative and parallel history with Claire and vice versa, obtaining the true ending and experiencing a duration of the experience that is around twenty hours for each double playthrough, as repeatedly anticipated. In fact, it happens that for the first run you need between eight and nine hours at an intermediate level of difficulty, while the following ones get shorter basically because you already have an idea of what to do and where to go, therefore downtime is reduced . However, it is appropriate to specify how Resident Evil 2 has remained in one's soul a title from 1998, when the average degree of challenge was substantially higher than the current standards and the developers didn't bother to insert a lot of backtracking, even ruthless (such as: I narrowly survived the path to get some items, I have no more ammo but I realize that I have to go back to the opposite side of the map because I forgot something), since usually this did not translate then into a lower grade point average. In short, the frustration of some sequences has remained intact, vivid, to underline how times have changed. Of course, from this point of view the authors have fortunately refrained from excessive malice. It's true, zombies take forever to die even when we hit them in the head and the knife has turned into an instrument subject to wear and tear, to be replaced from time to time if you are lucky enough to find another one, taking away the security of always remain with a weapon in hand. At the same time, however, in the boss fights the ammunition magically appears, the still unexplored rooms and the objects present are clearly indicated on the map, in line with the last episodes of the series, and finally the inventory marks the things that have run out of power. own utility, so that they can be discarded. This last function can be traumatic if it is used due to limited space requirements, given that a eliminated object is lost forever and not left on the ground, but fortunately with some improvements to the backpack the situation becomes more tolerable. Speaking of inventory and capacity, the game has also modernized in the save system, which is activated at the iconic typewriters, but does not require familiarswere ribbons of ink. As in the original, in the remake of Resident Evil 2 the Raccoon City police station stands as the undoubted protagonist of the adventure: it is an ancient building with a dark past, full of secrets to discover and dark corridors to walk flashlight, hoping that the unmistakable screams of a zombie (or, worse, the heavy footsteps of you-know-who) don't come from around the corner. There are completely new locations that we don't want to anticipate anything about, but in general the game retraces and revisits the 1998 chapter by changing approach, style and direction in order to connect the various needs and mix them in a solution that turns out to be surprising. In fact, we were talking about the gameplay that is both old and new: drawing great inspiration from the evolution that the franchise has experienced with Resident Evil 4, Leon and Claire can move by managing the view freely, with a behind-the-shoulder camera that takes advantage of every good opportunity to artificially shorten the distances from a possible target, thus creating a sense of constant tension. The aiming system also contributes in this sense, which acquires accuracy only when the weapon is stationary and does not lend itself well to close quarters, in which a large amount of precious ammunition ends up wasting. Also thanks to the zombies and their unexpected, staggering, now slow and now faster and nervous gait: a very convincing approach, which makes headshots more complicated than you think. Knife management, on the other hand, seemed to us linked to tradition, but all secondary weapons (therefore also grenades) can be used during special quick time events to ward off (or eliminate) an enemy after he has grabbed us, so as not to lose energy vital. Once you run out of ammunition, however, it becomes tough: you always find yourself fleeing, deprived of any offensive possibility, and this situation can last for some time; at least until you change the scenery and move on to the second half of the campaign, certainly less intense in terms of atmospheres and enemies, more science fiction in its own way. We were worried that Capcom would not be able to legitimize these very peculiar phases of the adventure and instead the smudges, also from the point of view of the characterization of the characters, seemed really negligible to us. The same can be said for enemies: zombies are certainly the most characteristic and gruesome, but there are also very dangerous lickers and other mutant creatures as frightening as they are deadly. There has been a general reduction of some categories, birds and giant spiders have been eliminated, but the dogs have remained and unfortunately their video performance is not the best. The boss fights certainly draw inspiration from those of the original Resident Evil 2, but they too have been revolutionized, resulting in being fairly challenging and engaging. Finally, a few words for the other playable characters besides Leon and Claire, protagonists of short but very interesting sections, which range in classic stealth, referring to some of the most recent horror productions, or introducing pleasant puzzle mechanics. Assisted mode If you are playing at the intermediate challenge level and you happen to run into a game over sequence (starting from the last save made or, in the case of boss fights, from just before the meeting with the enemy), Resident Evil 2 will offer you to switch to the so-called assisted mode. This is the classic change of difficulty present in many games, which makes enemies less resistant, increases the resources around, activates semi-automatic aiming and even offers the gradual recovery of life energy. In the Capcom remake, however, this feature takes on different connotations: firstly because once chosen it is not possible to go back and the performance is ~stained~ in the final report; secondly because, in fact, it adapts the degree of challenge of the game to current standards. Playstation 4 trophies The forty-two Trophies of Resident Evil 2 are mostly linked to the performance of mandatory actions during the campaign, such as accessing the police station for the first time, combining two inventory items, or completing sections with alternative characters . After that there are many achievements that need to be researched a bit and which revolve around factors such as collecting collectibles, spectacular kills (put a grenade in a zombie's mouth and then blow it up by hitting it with the gun) and performance in speedrunning optics. Structure and technical realization We've already talked about it but it's time to come backa second on the question: the four campaigns of Resident Evil 2 have differences (mostly narrative) which justify the time required to complete them all, changing the presence of objects and modifying some of the puzzles, but offer mostly identical scenarios and therefore already stored. This type of solution inevitably affects the involvement, because it is clear that from the second run onwards you are not caught by the same tension in scouring certain areas of the map, and at the same time it is possible to complete some phases more quickly because you he already knows. That said, each completion is rewarded with interesting extra content, ranging from alternative costumes for the protagonists to real additional modes, in particular The 4th Survivor: it is a survival mode in which, under the command of an Umbrella soldier, Hunk, we will have to try to reverse the map and eliminate a huge amount of enemies despite having limited equipment available. The offer will also be further enriched in the future, see the announcement of the free mode The Ghost Survivors. In short, we are talking about a fairly substantial product, which will keep you busy for several hours, arousing your interest in direct proportion to your attachment to the brand. On the other hand, the evaluation of an excellent technical sector goes beyond any type of nostalgic bond, which compared to the 1-shot demo seems to have paid more attention to the details and the quality of certain assets, almost always avoiding showing the side in close-ups of textures in low definition. There are a lot of reflective surfaces in Resident Evil 2, and the RE Engine manages them very well, apart from some artifacts on the walls of the station and the use of a lower resolution for this type of effect, which however must be taken into account . Very sophisticated solutions have also been used for a better gore yield, and it is therefore no coincidence that the torn innards or exposed muscle tissue shine under the light of our torch. The realization of the scenarios is excellent, with here too a peak in the first half of the campaign and the introduction of decidedly more generic assets in the second part, but the qualitative average remains very high and finds its best expression in the polygonal models, whether of the protagonists or zombies, equipped with a particularly rich set of animations, capable of returning different and credible reactions depending on the blow suffered and the damaged body part. The sound sector is also very valid, with a design that surprisingly exploits the binaural audio to even more clearly divide the noises in the stereo or surround panorama and thus communicate to us which side certain sounds come from. We found the Italian dubbing to be excellent, generally well interpreted, with very few shortcomings: a very welcome extra.", "date": "2019-01-25", "grade": "9.0"}