{"name": "Onimusha: Warlords", "ref": "https://multiplayer.it/recensioni/onimusha-warlords-recensione.html", "text": "Capcom is back: this is a statement that by now almost everyone feels compelled to pronounce. This awareness comes from a series of right market moves, alongside titles that have been able to raise the Osaka house from a certainly not exciting decade. Creator of some of the most iconic video game sagas ever, she has certainly suffered from a change in the industry that has somehow incorporated a large part of the Japanese software houses. Among the most successful series of the beginning of the millennium, Onimusha represents one of the most debated and dreamed of by many longtime players. Title born as a spin off of Resident Evil (like the equally requested Dino Crisis) with which it shares a series of production choices that have now remained in the common imagination, Onimusha had the merit of definitively paving the way for feudal Japan in video games. resurfaced in recent years. After having replayed the first chapter in its entirety in its remastered version, it's time to give our opinion. A tale of Oni and betrayal The narration of Onimusha: Warlords, exactly like that of the title from which it derives, represents one of the first examples of cinematographic staging in the history of modern video games. When it arrived on the market in the now prehistoric 2001, it was able to attract attention to itself thanks to a stunning technical and narrative sector. The appeal of feudal Japan, of characters such as Oda Nobunaga and folklore linked to demons, are three of the fundamental elements that made the series a great success with audiences and critics. Everything revolves around the protagonist, Samanosuke (who has the features and voice of the then famous actor Takeshi Kaneshiro), intent on reviving the fortunes of his clan following the departure of the leader Nobunaga and saving Princess Yuki, with whom he probably shares a relationship that goes far beyond simple friendship. During the (very short) campaign, lasting hardly more than four hours, Samanosuke finds himself exploring an entire fortress, its dungeons, a small portion of the exterior and moreover the world of demons, until the resolution of his mission. What is still striking today, albeit seen through the eyes of those who have experienced the technological progress of recent years, is Capcom's ability to create a work capable of captivating the viewer with a credible and well-acted narration (only in the Japanese version ), putting aside the lengths and trying to give a direct and fun title. The version localized in Italian unfortunately shows the side to an adaptation of the texts that is not always spot on, but nothing that affects its communication skills. The gameplay: how it was and how it is As previously mentioned, Onimusha represents a derivation in action sauce of that formula that Capcom had already tested and perfected with Resident Evil. Starting from the controls, iconically called ~tank~ precisely because they are close to that of a tank, which turns on itself to change direction and then move forward or backward, to get to the fixed camera, passing through the beloved pre-rendered backdrops. Just the controls represent the biggest change of this remastered, in terms of raw gameplay. If the camera has in fact remained fixed and strategically positioned in some specific points of the scenario, the method of use of one's alter ego now leaves room for free control delegated to the left analog. A necessary rejuvenation for a formula that has certainly made history, but which would have made the original version of Onimusha difficult to digest today, even more so than in Resident Evil itself. This element, although it facilitates the perception of the public and of possible new followers, pays the price for a game design not initially conceived for these movement possibilities. The resulting result is an incredibly simplified title in the clashes, making death an element almost totally detached from the experience. The bosses who in the original gave a hard time, due to the need to pay attention to every little movement and to use the lateral swerve and the parry as if they were your best friends, here they become almost an accessory element, outclassed by the possibility of managing in the best way their own demonic powers. In this sense it is important to remember that in Onimusha, Samanosuke can count on a demonic glove (which he possesses in the first few minutes) which allows him to absorb the souls of defeated enemies (someone said Sekiro?). These can be of three different types: red, useful to spend on upgrades; blue,delegated to the recovery of mana; and green, with the aim of healing the points won. To each of this type of souls, there are also three different weapons generated by the spheres that are collected during the adventure and which respond to the elements of lightning, fire and wind. The alternation of these three instruments of death is what all the advancement and simplification of the raids is played on. Alongside the swords, the bow and the rifle take care of it, useful from a distance to avoid losing precious vital energy. To remain faithful to its very nature, the guys from Capcom have decided not to affect the progression by inserting checkpoints here and there, but to still leave everything left to manual saving by interacting with the Oni mirrors, also useful for spending souls and enhancing your own equipment. During the campaign it is then possible to recover a good quantity of objects, suitable for solving simplified puzzles compared to those of Resident Evil, but which still respond to the usual dictates of the time. All the progress is in fact dotted with backtracking (never too invasive) to be able to open previously blocked passages. It is in this that the map that can be recalled on the screen comes in handy on the one hand, and on the other the uploads of this substantially non-existent remastered. It is clear that all these elements could not live in harmony if the complex were not supported by a well thought out level design and which still represents a shining example of how this aspect should be achieved. During the adventure it is also possible, in a handful of situations, to take control of Samanosuke's battle partner, a certain Kaede. The latter is unable to absorb souls, nor to fight with the protagonist's weapons. In fact, phases of exploration and recovery of objects useful for progress are entrusted to her, as well as specific sections dedicated to deepening a further narrative aspect. Nothing too tedious, but certainly the less successful sections of the title still remain today. It should also be noted, for completeness, the renewed presence of the rooms of the dark kingdom, an absolutely accessory element and which turns into nothing more than a horde mode designed to make you accumulate souls and recover an object, necessary to unlock the definitive sword of the game. The technique that counts the right From a technical point of view, the remastered of Onimusha does not differ too much from the works of recent years. Thanks to an exciting aesthetic sector for its time, the game is still enjoyable today, even if we are certainly not talking about a cutting-edge title. Models and textures have not been changed, only brought up to high definition, almost completely eliminating the annoying aliasing that long-standing titles suffer from today. What still impresses is noticing a work on animations and cutscenes capable of making Onimusha often more current than many today's titles, embellished with some really well done CGI sequences. To close the speech, the totally resounded soundtrack and the Japanese dubbing take care of it, confirming the narrative importance of a title of this magnitude.", "date": "2019-01-18", "grade": "7.8"}