{"name": "Ace Combat 7: Skies Unknown", "ref": "https://multiplayer.it/recensioni/ace-combat-7-skies-unknown-recensione-ps4.html", "text": "In the days that preceded the review that you have just started reading, the so-called Ten Years Challenge depopulated on social networks, where people posted their photos dating back ten years ago. If we were to do it with Ace Combat, we would arrive almost precisely at the release of what was so far the last chapter of the main trend of this series: in fact, there are eleven years that separate us from the end of 2007, when Ace Combat 6: Fires of Liberation arrived exclusively on Xbox 360. Since then a real era has passed in technological terms, during which the release of some more or less successful spin-offs has failed to fill the desire of fans to go back to the skies of the series published by Bandai Namco, spotted for the first time on PlayStation back in 1995. With almost a quarter of a century behind them and many hours spent flying in that of Strangereal, fans are waiting for the arrival of Ace Combat 7: Skies Unknown has grown day by day, also fueled by some postponements on the release date made over time. But January 18, 2019 finally arrived, and with him also the new Ace Combat: here is the report of the week we spent in the company of the new Project Aces effort. The plot: global conflict With a series with over twenty years of history behind it, it is easy to be intimidated by Ace Combat 7: Skies Unknown, especially if it is the first approach you have with this brand. We can tell you right away that the game does not require particular knowledge of Ace Combat's background to be appreciated: having an idea of what the story of Strangereal is undoubtedly allows you to catch some references to past events that are made from time to time , but the plot of Ace Combat 7: Skies Unknown still stands on its own. We therefore return to hovering between Osea and Usea, two of the continents that populate the parallel universe created by Project Aces. In Strangereal nations and federations alternate in a series of conflicts which in the previous chapters was also set in the future 2040, but which in Ace Combat 7: Skies Unknown is placed straight in the present. We are therefore in 2019, the year of the Lighthouse War. The name of the conflict derives from the space elevator built on the continent of Usea, as a joint peace effort for reconstruction after the impact of the planet with an asteroid. However, the nation of Erusea begins to see the work as an attempt by the Hosea Federation to reduce its sovereignty, thus making the political climate rather hot until the completion of the series of terrorist attacks that kicks off the war. During the twenty missions that make up its campaign, Ace Combat 7: Skies Unknown tells us the story of the Lighthouse War through the eyes of some characters involved at various levels in the conflict, from what is therefore a different and alternating point of view between the two sides on the field. Without going into revealing other details on the plot, the game focuses extensively on the use of drones in battle, thus putting the player in front of the threat posed by the agile flying units without a pilot on board. The character we control, Trigger, is a pilot of the Osian forces who is accused of having committed a serious crime, ending up for this reason in the Spare Squadron, a unit made up of detained pilots therefore deemed ~expendable~ by the authorities. We played the campaign with great pleasure throughout its duration (between ten and twelve hours, depending on one's skill), especially appreciating the direction of the cutscenes and the general atmosphere of ~Metal Gear in the skies ~ given by Project Aces to your creature. There is no shortage of twists and lighter interludes in the narrative, with which the developers have created a rhythm that always remains captivating. The variety of missions is also excellent, never the same between escorts, attacks and defenses carried out with different variations deriving from needs dictated by the plot or by the geological and meteorological situation of the area that we find ourselves flying over. The gameplay: head in the clouds Respecting the tradition of the series to which it belongs, Ace Combat 7: Skies Unknown also offers a type of flight with a strong arcade vocation, accompanied by a few simulation elements that serve more than anything else to remind us that even in Strangereal the laws of physics continue to exist . Those who have never flown an aircraft in the Ace Combat series will feel at ease from the first minutes of the game, also thanks to the choice available between the expert control mode and the beginner mode. Although the latter was designed precisely for those who are aAs a beginner with Ace Combat, starting directly with the first allows you to quickly obtain that extra gear that can come in handy in subsequent missions, but especially in multiplayer. An extra gear undoubtedly necessary, because the fact that Ace Combat 7: Skies Unknown is accessible does not mean that it can be easily liquidated. The advanced missions are in fact quite demanding, and the limited presence of checkpoints can lead to having to restart even quite large parts of them after a possible defeat. In terms of pure gameplay, the main innovations introduced by Project Aces in Ace Combat 7: Skies Unknown concern the clouds and the weather conditions in general, in the previous chapters rather marginal in the game dynamics. Knowing the perturbations and their effects can instead make the difference now, starting from the banal visual effect that leads us to pilot blindly between denser cloud banks. The effect of suddenly finding a rock in front of you is quite remarkable, as is the adrenaline rush you get in avoiding a collision at the last second thanks to a spectacular manoeuvre. Returning to the weather conditions, our aircraft will also start to wobble as it passes through the clouds, while the rain can cause the formation of ice on the surface of the aircraft, causing it to stall. Lightning, on the other hand, causes on-board instrumentation to tilt, thus making target acquisition and radar use more complicated in their presence. Also noteworthy is the possibility of performing acrobatic maneuvers that make use of the stall without accessing particular modes, thanks to which the more experienced pilots can put on a show especially in multiplayer. The aircraft tree is destined to keep us inside it for a long time, thanks to an impressive amount of vehicles and upgrades to unlock: in addition to the branch entirely dedicated to online mode, we find a total of about twenty-five aircraft to be obtained by spending MRP credits earned in battle. Among the aircraft, many historical names in the series such as the legendary Typhoon or the various F-15s, accompanied by models introduced in more recent chapters such as the Mirage 2000. Lovers of the Russian school can obviously count on the various MiGs and Su . Playstation 4 trophies Ace Combat 7: Skies Unknown flies into our PlayStation 4 with a total of fifty Trophies. The classic Platinum obtainable in the usual way is accompanied by two Gold, eleven Silver and thirty-six Bronze Trophies. To get them all you obviously need to complete the game's Campaign mode at least once, then get busy in the same through the three different levels of difficulty proposed. There is no shortage of Trophies dedicated to the online component of Ace Combat 7: Skies Unknown, which in turn contributes to obtaining the MRP points necessary to unlock some objectives, but above all to obtain planes and parts in the appropriate tree. Graphics and sound: immersive at the top While technically we'll have to wait for the PC version to see the best Ace Combat 7: Skies Unknown has to offer at 4K resolution, that's not to say Project Aces' fatigue doesn't perform well on PlayStation 4. In particular, the models of the airplanes stand out, with attention to their details and which can be visited by the player through the appropriate hangar section of the menu. Once in the sky, the view from inside the cockpit is the master, different for each type of aircraft we use. After taking off, it is possible to appreciate excellent panoramas, with a visual depth that is also noteworthy in the three missions dedicated to virtual reality (to which we will return in the next few days). Approaching the buildings on the ground, their detail obviously gets lost a bit, while especially in the replays it is possible to see some aliasing defects in the framed objects. However, Ace Combat 7: Skies Unknown runs smoothly for its entire duration, even when passing through the clouds: beyond the effects on game dynamics we have already talked about, the representation of the weather conditions provided by trueSKY technology gives the graphic realism a decisive push, opening the view to some literally breathtaking views. To feed the technical invoice of Ace Combat 7: Skies Unknown we find the excellent soundtrack composed by the usual Keiki Kobayashi, which accompanies all the missions with rhythmic and engaging songs. The dubbing is available in both Japanese and English languages, while the texts entirely in Italian still allow everyone to appreciate the dialogues that are in the interlude scenes and via radio during the missions. The intelartificial intelligence of the enemies is quite good, although obviously to raise the level of challenge of the dogfight it is necessary to turn to the multiplayer component. The latter includes a battle royale mode that pits eight users against each other and a four against four team deathmatch. We would have actually hoped to see a little more in terms of variety, considering what was the additional presence of Siege and Co-op already in Ace Combat 6: Fires of Liberation. In the matches that we had the opportunity to play online, the gaming experience continued without any problems from a technical point of view.", "date": "2019-01-18", "grade": "8.7"}