{"name": "King Crusher", "ref": "https://multiplayer.it/recensioni/king-crusher-recensione.html", "text": "It is not easy to keep up to date with the trends of the mobile market, because it is an extremely variable and dynamic panorama even if it has long since found some cornerstones in certain playful solutions. It is evident that many of the solutions that have proved to be ideal on mobile platforms are derived from a mixture of different characteristics and genres, standardized elsewhere but revitalized here by often even risky hybridizations, just as in the case of King Crusher, the subject of this review. In other situations it would not be easy to propose a game that mixes elements of puzzle, strategy, RPG, roguelike and the ~game of 15~ with a splash of the inevitable gacha, but in this panorama it is possible and this game by the Anakama team proves it. It is more simply defined as ~sliding puzzle RPG~ but the category is not exactly easy to interpret until you try it first hand: it is a question of controlling a group of adventurers, divided into various classes, during adventures that essentially take place as a succession of fights to be waged on a 3x3 grid. The enemies are located on the upper edge of the grid and the fighters must therefore be arranged according to their attack style: warriors, barbarians and short-range soldiers will have to attack from the front line while archers, wizards, clerics and others will be able to stay more sheltered, attacking from more distant boxes. However, we must be ready to move all party members at all times to avoid enemy attacks, sliding them from one square to another in a style that closely resembles puzzles based on moving squares. Perhaps a video could facilitate the understanding of this bizarre gameplay, but it's easier to proceed directly to the download and try it for yourself, because in truth the short and hasty tutorial works perfectly to immerse us in the basic mechanics, which obviously become more complicated as the levels become more difficult and the bestiary of enemies more varied. In essence, the clash requires the continuous movement of one's units on the grid to dodge enemy attacks, predictable by carefully observing the clues that appear on the screen, but at the same time also considering the effective arrangement of party members in order to inflict the most damage to enemies and maybe use healing spells sensibly. Knight pushers Explained, more or less, what happens in the heart of the action, we must also consider everything that gravitates around the fight. The quests are developed in sequences of levels, which usually offer clashes linked one after the other but can also offer different situations and somewhat related to the classic RPG tradition. It is possible to run into crossroads in the path and be faced with choices to be made with the probabilities determined by the roll of a die, in episodes that seem to have been conceived by a decidedly prankster dungeon master. It all feels like some kind of fantasy RPG parody, but it's clear that King Crusher's deeper dynamics are still a sincere homage to classic RPGs. The specializations of the protagonists are numerous and each has specific characteristics to learn and to best fit with the other characters, moreover the possibility of buying or conquering objects and weapons allows you to further modify the statistics and skills of the various fighters. To all this is added the now inevitable gacha dynamic, which however assumes a certain thickness here, given the evident difference in power that characterizes the heroes evoked in the different categories (bronze, silver and gold) determined by the expense necessary to carry out the ~ fishing~. The price is paid in in-game currency that is earned by fighting throughout the game, although it is possible to choose the easier but more expensive route, paying with real money. Ultimately, the micro-transactions are not too intrusive given the good rewards that are obtained even just by playing, although the percentages of obtaining the highest level summons are somewhat prohibitive, with the use of only in-game money. Rather, there are significant changes in difficulty in the more advanced levels, also thanks to the roguelike element which does not allow the fighters who fell during the quests to be recovered. The consequence of these is the usual grinding to which we are forced to increase the level of the various characters and which can easily be monotonous, although the structure of the game favors the continuous repetition of the fights without making everything too frustrating.", "date": "2019-01-17", "grade": "8.3"}