{"name": "Aftercharge", "ref": "https://multiplayer.it/recensioni/aftercharge-recensione.html", "text": "Aftercharge is a review entirely dedicated to the gameplay, the core of an interesting multiplayer first-person shooter that has just arrived on PC and Xbox One. The version for the Microsoft console, among other things, is also available with the Game Pass service and allows you to play in cross-play with the PC one, as will happen with the Switch version, coming soon. An original and immediate formula Aftercharge is an asymmetric team shooter with a rather particular formula. In the only mode present, which will also soon be available in a competitive version, three robots equipped with an invisibility device are called to destroy all the energy extractors on a map, while three defenders, in the pay of an unscrupulous corporation, must stop them , using the same energy sources to recharge special abilities and main weapons. The latter, depending on the character chosen five available, range from double pistols to rifles and are able to detect the presence of infiltrators, called worktronics, whose sole purpose is to eliminate the energy nodes that are draining the planet. To do this, they have energy available with which to remotely charge their companions and a skill each, different for each worktronic, which ranges from an energy shield to a burst capable of speeding up the destruction of energy extractors. But their main weapon, invisibility, vanishes when they are spotted at close range by guards who can then take them down more easily. Worktronic life, in essence, hangs in the balance, facing heavily armed adversaries who can be entangled, blinded and thrown but not knocked down. For this reason, the robots must make the most of their invisibility to hit the extractors and hide, trying to revive their companions as quickly as possible and signal their position, with the appropriate skills, when they have fallen. And they're all viable possibilities considering that if all three attackers go down before the six energy nodes are down, the game ends in a victory for the defenders. Around this dynamic comes to life a rather original and fun cops and robbers game, partly focused on the ability to make the best use of the skills available, but designed above all to enhance the strategic component. The importance of balancing During a match the gameplay of Aftercharge gradually changes and forces players to adopt different strategies. Initially the guards are forced to defend several positions, but they can count on several extractors to reload their weapons. As energy nodes decrease, the task of the guards becomes less burdensome, but they have to deal with the reduction of recharge points which makes it more difficult to move around the map. Precisely for this reason it becomes important for the worktronics to carefully choose which generators to deactivate first, in order to force the enemies to cover more space to intervene in defense of a position. However, doing so is not always easy. The maps are not immense, and it is a desired thing, while the defenders, as anticipated, have detectors that flash indicating the position of invisible enemies. And these, forced to flee continuously, still lose their invisibility when attacking an extractor, often finding themselves invested by the defenders' ranged fire. Furthermore, when a worktronic is down, it is easy for defenders to try to saturate the area with shots, in order to hit a robot who has come to help his partner. And to all this must be added the greatest number of skills available to the guards that make the life of the attackers complex, although not impossible. In fact, the balance seems quite good, between synergies, characters more or less vulnerable to others and maps that offer different hiding places to allow attackers to hide, forcing defenders to resort to teamwork, and possibly voice chat, to neutralize them . And it's a big plus for a first-person shooter where fighting is kept to a minimum, if everyone does their job. A team of organized guards can track down and anticipate enemies, while attackers can try to be quick, taking advantage of the invisibility that reactivates almost instantly after hitting a node, making escape simple even if not automatic. All this guarantees players a good margin of growth, both as individuals and as a team, and seems to work very well, with fun and rather fast games, even if the actual balance will become evident when players have gutted the gameplay and enterCompetitive matches, not yet active, will take place. Xbox One goals The thousand points offered by Aftercharge are largely related to skill in the game, but few are complex to obtain. The rest, which includes the two highest paying targets, is a simple matter of time. Content issue The Aftercharge formula is fresh and valid, the latency is generally sufficient to guarantee a good experience and a few tricks should be enough to guarantee a dignified survival of the Chaisawesome Games title, a shooter that has what it takes to find its own corner in the competitive landscape . This is on the condition that the contents gradually grow including new maps, in addition to the only four currently available, and new modes, in addition to the only one currently available, which is badly needed in the face of an evident shortage of content that we hope will be filled in the near future. On the other hand, we have already seen intriguing and well-balanced games disappear in a few months, or even weeks, sometimes due to the lack of modes, sometimes for support issues and often for an aesthetic issue. And here the aesthetic unlocks that can be unlocked with progress come into play, present in Aftercharge, linked to the ten characters, as anticipated, five for the attackers and five for the defenders, who however do not shine in terms of characterization. The cartoon-style look, mind you, goes well with the particular stylized science fiction with violet colors that characterizes the maps, well differentiated in terms of structure and in some cases also in terms of aesthetics, but the characters are rather generic and it is difficult to identify yourself, even by unlocking effects and other customizations that detail them. And the background is equally generic, just enough to justify the clash between the two factions, all centered on the clash between the Aftercharge Corporation, determined to drain all the Quanta energy of the planet Dusk 11, and the worktronics, awakened by an energy discharge and decided to stop the mining before the planet is destroyed. Instead, the general look works, characterized by a clear contrast between the central elements of the gameplay and the surrounding environment, with the result that the action always remains clear and intelligible. A finesse that goes hand in hand with a soundtrack that creates the right atmosphere, also offering us personalized themes, to be unlocked with the in-game currency that can also be purchased with real currency, which keep us company in the guise of the worktronics while, deactivated, we wait for a companion run to revive us thus putting us back in the game.", "date": "2019-01-14", "grade": "7.5"}