{"name": "Guacamelee! 2", "ref": "https://multiplayer.it/recensioni/guacamelee-2-recensione-xbox-one.html", "text": "Just a handful of months have passed since we got to play and enjoy the splendid Guacamelee! 2. The sequel to the first great success of the Canadians DrinkBox, despite an excessive simplicity and some shortcomings in terms of mechanics (present instead in the various re-editions of the original), had been able to raise the team's capabilities to the nth degree in terms narrative, ironic and level design. Juan's journey to turn the tide of the Mexiverse around has brought us new places and a wealth of powers. Now it's time to see how the game fares on Xbox One, aware of having in your hands, in the opinion of the writer, the best metroidvania of this new era of the genre, supported exclusively by Hollow Knight. The story and gameplay we know It is useless to dwell too much on elements that we investigated sufficiently just a few months ago. For this reason, if you want to have more specific details, we advise you to go and retrieve our review of the PlayStation 4 version. What is important to remember is that Guacamelee!, as its name already suggests, is a title that focuses entirely on reproposing in key humor of that part of Mexican folklore that strongly refers to the luchadores. These masked wrestlers, made famous to the general public thanks to characters who appeared in environments such as the WWE, represent real institutions in the Central American country. The Canadians of DrinkBox, evidently attracted by this imaginary, have channeled all their skills and studies on the subject, to recreate the most interesting and successful tribute to this land and its heroes. The protagonist, Juan, had distinguished himself years earlier by beating his great rival Calaca and restoring peace to the world. After years of inactivity and caught up in fatherhood, he is now a burdened man and unable to respond to the athletic needs of a luchador. Suddenly a series of rips in the Mexiverse force him back into action and thanks to his prodigious mask, the shadow of the extra kilos vanishes in an instant and Juan returns to his former glory, albeit without a large amount of his powers . Here begins a journey through the game world, made up of old acquaintances and unexplored places. The search for the old champion Salvador, who has been ill for some time and intends to find the Sacred Guacamole, will be the pretext for touring a multitude of different realities, meeting different versions of the same characters and accumulating a disproportionate number of new powers. The gameplay of Guacamelee! 2 absolutely does not differ from the great work done on the first chapter despite a series of new skills, which can be upgraded by spending coins in the main menu. The goal is to navigate the labyrinthine maps of the game, which benefit from a decisive step forward in terms of design, interspersing the progression with the clashes with the forces in the pay of Salvador. It is precisely the combat system that makes Guacamelee! the jewel that so many have praised. Where we are normally used to seeing metroidvanias that focus little on the combat phases, the DrinkBox title bases its gameplay on combos and holds, exactly as if it were a confrontation with suplexes and extremely choreographed shots. The possibility of enhancing your skills and chaining them together makes the game extremely varied from the point of view of progression, often requiring you to make the best use of your shots in succession, to reach otherwise inaccessible places. To support the human Juan, his inevitable chicken version takes care of it, which in this second chapter becomes even more central and to which an entire subplot has been dedicated. Overall, the system works so well as to generate addiction, which fades only in the face of the awareness of a non-exciting longevity, which stands at around ten hours. Another version, another jewel Just as it would seem to have been the case for the PC and Nintendo Switch versions, the Xbox One port also does its job very well. The colorful and inspired world of Guacamelee! 2 shines and enchants, thanks to a very solid frame rate and the possibility of exploiting the usual four-player coop. If you really want to nitpick, you could say that the title on the Microsoft console appears imperceptibly less saturated, but it is an element that can only be noticed when facing two different versions simultaneously. What matters is that you experience Guacamelee! 2 turns out to be the same and extraordinary that we were able to enjoy last summer and we can't wait for DrinkBox to make its now classic enhanced and con additional content. If you've been lucky enough to already enjoy the fun, perhaps it's still too early to spend your money again, but if your main console is an Xbox One and you're looking for a good metroidvania, open your wallet and let your green dollars, you won't regret it.", "date": "2019-01-11", "grade": "9.0"}