{"name": "The Last Remnant Remastered: la recensione", "ref": "https://multiplayer.it/recensioni/the-last-remnant-remastered-recensione.html", "text": "The Last Remnant is much, much more than what you may have read - at the time or today - around. Unfortunately, we add, because it is clear that few have had the grace to probe the depths of the product, but we will come back to this point. To talk seriously about JRPG you need to have played it, from the most to the least famous, you need to go beyond the conventions of the brand and explore without filters, aware of what the genre represents (goes) in terms of expressiveness of the teams involved. It is one of the most difficult video game categories to evaluate precisely because it is niche, for very few players who prefer the flow of emotions, feelings and stories that emerge from the product and often transcend it to technique, speaking of everyone's daily reality. The writer, ten years ago greatly appreciated The Last Remnant: it was a game with gross flaws in management and design, but it was also perhaps the best Square-Enix JRPG for fixed consoles of the seventh generation. Exactly: the game by Ueda and Takai, with Kawazu writing the script, had the merit of creating a cult among fans that the Final Fantasy XIII trilogy - perhaps the embodiment of the greatest productive and conceptual contradiction in the history of Square Enix - could just dream. The three characters, all unaccustomed to the spotlight, took the ball of the rampant Unreal Engine 3 and put the unconventional legacy of the SaGa into common factor, creating a title with obvious production limits in terms of invested resources - for the Japanese, programming on UE3 was a disaster - but capable like few other JRPGs of its generation of dragging with immediacy, freshness and a pinch of that healthy sadism that is always needed. We took some time to write this review of the Remastered version: we wanted to conclude the game once again, dissect it, analyze it again ten years later, try to understand why few people lived the story of Rush Sykes with the right passion. A fan called Nomura Few, very few of you will know that Nomura has always been a big fan of The Last Remnant: the news failed to go under the spotlight due to the tepid reception of the game at the time, but the good Tetsuya - years after the publication of the title - went so far as to be incredulous of the fact that the Wada management (the old CEO Square-Enix) was not considering the development of a sequel to Takai's work. Out of all the products Nomura could name and all the ones he could get excited about, he chose a seemingly minor JRPG. The explanation is simple, although few will agree: The Last Remnant is the embodiment of a very different Japanese role-playing dynamic, experimental and in some ways very forward in vision. Few dead times, enemies visible on the map, turn-based but also strategic combat system, extremely stratified but in its own way, cast of characters that are not equally characterized but all unique and with their own history, exponents of a stereotype perfectly amalgamated with the protagonists and enemies, capable instead of carrying on the narrative in pure Japanese style. All immersed in an ecosystem of rather interesting quests, different from each other and set in a very fascinating world, where magical and mysterious artifacts called Remnants guide the ambitions of kingdoms and city states with a typical oriental fantasy flavor. It is above all in the cities and in exploration that two great improvements of this Remastered are noticed: shorter loading times and a nice update to the textures and general cleaning make The Last Remnant Remastered a product that is still absolutely presentable today. Open battles The most particular and most stratified feature - but therefore extremely complex to master by standards - was the combat system: a mix of turn-based strategy based on combos of special moves, all while controlling groups of more or less characterized characters. Innovative on paper, also in practice: it was Takai's precise desire to insert a multiple control, precisely to break with a heavy legacy linked to always limited supporting parties. The structure holds up very well: thanks to the remastering work carried out, the battles are now more frenetic, enjoyable and almost devoid of those slowdowns that had destroyed any attempt to administer the product to the critics of the time. Sadly yes, the absence of the team's proper expertise in programming with UE3 made the battles a very immature experience, you could almost count the frames; seeing the game run on consoles today like the (now removed) PC version on the framerate side is an element that concretely changes the cards on the tablea and finally allows, even the most critical, to evaluate a top-level system for ideas and long-term pleasure. The Last Remnant Remastered is not an easy game to play, pitfalls are everywhere, some really tough bosses; fortunately Square-Enix has not oriented accessibility downwards, however inserting tricks such as autosave that help, even if it is more correct to say that they take away free frustration, especially in sequential clashes, with no possibility of saving the game in the middle. The inclusion of an option to increase the speed of battles was also good, we really appreciated it. After diving into the depths of its offering again, we can confirm that The Last Remnant Remastered has no additional content, but considering a mix of side quests, character quests, monster hunts and more, trust that the amount of investable time will satisfy you . We close with an incredible element, sadly forgotten by most of the time but absolutely amazing: Tsuyoshi Sekito's soundtrack supports the title with a very high quality audio support, capable of dragging, enhancing, loading and making epic moments something unforgettable. A real sonic throwback to the JRPGs of the 90s.", "date": "2019-01-07", "grade": "8.0"}