{"name": "Desert Child", "ref": "https://multiplayer.it/recensioni/desert-child-recensione.html", "text": "Desert Child has style, there's no doubt about that. Practically the debut work for the indie developer Oscar Brittain, the game is strongly characterized by a retro graphic style, which on the one hand recalls the cutscenes of the classic Flashback, on the other a whole series of 90s productions belonging to the adventure genre for PCs. Speaking of the Delphine Software masterpiece, also in this case the setting is a future dominated by corporations, which have extended their influence and brands far beyond planet Earth. In any case, we will be interested in the right of these narrative facets: the protagonist of the adventure is a restless young man with a passion for speed and hoverbike racing, with the dream of participating in a legendary grand prix that takes place on Mars . In fact, buying a one-way ticket to the red planet proves to be simpler than expected: it will be enough to string together a series of victories and scrape together a small nest egg, familiarizing yourself with some mechanics that we will find in a richer and more diversified guise in the new location. And once there? Well, we'll have to do it all over again. Gameplay As mentioned, the first part of Desert Child, the one set on Earth, represents a taste of what we will find in the scenario of Mars. The protagonist can move three-dimensionally along a small commercial street where he can sell energy cells won in races and get money in exchange, repair his hoverbike, eat something and of course enter the races. Vehicle damage and excessive hunger make it impossible to use the boost once on the ~track~, with disastrous consequences given that this mechanic is essential to be able to cross the finish line first. However, the gameplay of the course component is simplistic to say the least: with a view to horizontal scrolling, we will be able to move the hoverbike only up and down, using the boost to gain ground on the opponent, trying to avoid obstacles along the path and using weapons to destroy objects from which coins and refills for both the engine and the arsenal come out. The latter, however, can also be restored by coming into contact with a truck that automatically appears at the bottom of the screen when we have emptied the magazines. Unfortunately, the formula remains identical even as we progress through history, only with an increasingly higher degree of challenge which takes the form of the opponent's ability to activate the boost more often, forcing us to do the same. The only element of variety consists of the upgrades, which we will be able to access once we arrive on Mars, by purchasing them at a sales point (but without being able to choose them: we will catch something random) and literally fitting them into the electrical panel of our vehicle, in a sort of tantalizing Tetris minigame in which it is essential to have a suitable number of energy cells in order to power all the devices. In this way it is possible to obtain bonuses of various kinds, a laser sight, better management of the magazine and bigger bullets, more resistant armor and more: very important improvements to be able to finish the advanced races in first position. Playstation 4 trophies There are twenty-four Trophies included in Desert Child, and to obtain them you need to complete specific actions for the first time: buy all the discs, collect all the secret tapes, get the maximum notoriety, equip more than thirty energy cells and so on. Naturally there is no shortage of the most bizarre achievements, such as the one in which you have to relax for over an hour. Atmosphere and structure Once we reach the Martian scenario, Desert Child urges us to raise the 10,000 dollars needed to participate in the grand prix, which concludes the story with its races. In fact, it is a large grinding phase in which it is necessary to invent something to give an acceleration to the progression: if with normal victories you pocket just 100 dollars, it is possible to rig a race, try to hack of a bank, dedicate yourself to controlling a herd of kangaroos (yes) or deliver pizzas by bike to try to get more money and get to the finish line sooner. In between, a series of fairly stringent constraints concerning the game structure, set up as a succession of interconnected locations to be explored on foot to access record shops where you can buy the songs from the (beautiful) soundtrack, grab a bite to eat, repair the 'hoverbike and buy upgrades, just like in the initial stages.Often going to a particular place, such as the agency for registering for competitions or the pizzeria for which we deliver, kicks off the relative activity and then takes us back to the starting point and thus creates an artificial lengthening of the duration of the experience, which forces us each time to reach that place again in order to move forward. Nor is this so much the problem of Desert Child, which with its suggestions and its atmospheres can be appreciated, also thanks to some touch of class linked to the retro style of the graphics, but rather the already mentioned, excessive simplicity of the main phases, the competitions, which with such a low depth and strong repetitiveness make the experience frankly boring.", "date": "2018-12-23", "grade": "6.0"}