{"name": "Marvels Spider-Man: Silver Lining", "ref": "https://multiplayer.it/recensioni/marvels-spider-man-silver-lining-recensione-del-terzo-dlc.html", "text": "There's no two without three. After playing the two previous chapters of the DLC series entitled The city that never sleeps, Silver Lining's review takes us to the definitive epilogue of Marvel's Spider-Man. As promised, Insomniac Games has in fact published the new additional content on PlayStation 4 just in time for Christmas, thus respecting the roadmap announced months ago. In a New York that has long since rid itself of the Kingpin and the Sinister Six, the time comes for our friendly Spider-Man to show down with Hammerhead, a really tough guy to give up. We just have to put on the costume again, to get ready to whirl all together for the last time among the skyscrapers of Manhattan. Playstation 4 trophies Like its two predecessors, Silver Lining brings a total of six additional Trophies to Marvel's Spider-Man. Their subdivision was also done in the same way, with the only Gold-type obtainable simply after completing the story portion of the DLC. To collect all the others you have to complete some specific missions, as well as get busy in the challenges of the ever-present Screwball. The plot: Hammerhead again in charge The Silver Lining DLC begins where its predecessor Disputed Territories (here our review) ended, namely with the main villain Hammerhead defeated but not definitively neutralized. After recovering, the boss continues his work of rounding up the armaments left by Sable International in New York following the events told in the base game, thus managing to significantly enhance the equipment of his henchmen. Just as Black Cat had been the undisputed protagonist of the first DLC The Heist and then shelved in the transition to the second package, after being an important figure in Disputed Territories, Yuri Watanabe also leaves the scene, to give way to a new helper for the our Spider-Man. It is obviously Silver Sable, who has returned to the city to prevent Hammerhead from appropriating their technologies. Without going into excessive detail, we limit ourselves to saying that the plot runs off without particular upheavals from a narrative point of view, adding another couple of hours to the overall game time counter. Some issues such as the one related to Yuri Watanabe are settled a little quickly, to leave room for the preparation of an epilogue which is quite predictable even after the early stages of the game. Continuing with the analogies towards the previous DLCs, in Silver Lining it is once again the co-protagonist that strikes the most: in the case of Silver Sable, the final chapter resumes the relationship as enemies/friends between the superhero and the mercenary, forced to team up to defeat the enhanced version of Hammerhead. The dynamics of the relationship between Spider-Man and Silver Sable pass through the inevitable jokes of the first, putting the second in a position to give depth to its interpretation through a small moment of growth. As far as Hammerhead is concerned, we must confirm what was said on the occasion of the previous DLC: the bad guy of the moment continues to lack the charisma necessary to make him a fearsome villain, thus removing the bite even from the final battle itself. The gameplay: space for action To prepare the player for the showdown with Hammerhead, Silver Lining shifts its focus to pure action. The more reasoned game dynamics, such as those dedicated to small puzzles, are therefore (almost) definitively set aside. The special enemy units seen in the previous chapters are back again this time, unleashing a series of high-tech weaponry capable of engaging even the most skilled Marvel's Spider-Man player. Between large machine guns, shields, whips and jetpacks there is really something to worry about, and in fact the level of challenge presented in some moments is confirmed as quite high. Those who hoped to see something new will therefore remain dry-mouthed, but what gains is the spectacularity of the actions that we find ourselves performing in the role of Spider-Man: between aerial combat to stop enemies equipped with jetpacks and skilful use of the cobweb to remove come on trouble, it's really not boring. Some scenes are among the most exciting of those we have had the opportunity to carry out so far, thus highlighting Insomniac Games' choice to focus on action with this DLC. Secondary activities include the usual Screwball to organize diabolical games, together with the clearing out of the hideouts of Hammerhead's henchmen scattered throughout New York. There are also new costumes to unlock, including one dedicated to tfilm relogy signed by Sam Raimi. Going to conclude the considerations on the trio of contents offered by The city that never sleeps, even if the epilogue is not as strong as we expected, we must say that returning to New York was worth the total price of the ticket. The first chapter The Robbery (our review here) remains the one we liked the most: we don't need Hammerhead or Silver Sable if we fell in love with Black Cat.", "date": "2018-12-22", "grade": null}