{"name": "Raiden IV x MIKADO remix: la recensione del ritorno di un iconico shoot 'em up degli anni 2000", "ref": "https://multiplayer.it/recensioni/raiden-iv-x-mikado-remix-recensione.html", "text": "When dealing with the nostalgia factor it's always hard to put things into perspective. On the one hand there is the desire to rediscover lost emotions and feelings, on the other the danger that our memories will be contaminated. With Raiden IV x MIKADO remix you will face the same dilemma, especially if it has been a while since you have picked up a vertically scrolling shoot 'em up. Raiden IV originally came out way back in 2007 developed by MOSS a born studio from the ashes of Seibu Kaihatsu, creators of the Raiden series. Raiden IV x MIKADO remix, on the other hand, has already been appreciated on Nintendo Switch in 2021 and on January 31st will be released on PlayStation 4, PS5, Xbox One, PC and Xbox Series X | S. It takes up just over 900 megabytes of memory, but it has the potential to occupy many more hours than a 100+ gigabyte product if the goal is to reach the top of the world charts. Before spending 40 euros on a 16-year-old product, however, you have to be honest with yourself and ask yourself if the game is worth the candle. In this Raiden IV x MIKADO remix review we will analyze the (few) components of the game, its structure and the frustration factor to understand how much this dive into the past is a successful operation and if it is worth your time. The climb to the summit In Raiden IV x MIKADO remix you will be able to compete to try and conquer a place in the global ranking of the best players The plot of Raiden IV x MIKADO remix is almost non-existent, but for completeness we tell you anyway: a race of aliens called Crystals has attacked the Earth for the fourth time and a pilot with an experimental and super innovative aircraft has been tasked to stop them. The beating heart of this game is its vertical scrolling gameplay made of planes, unlikely bosses, bombs and above all scores. Raiden IV MIKADO remix has 7 levels in total, each one more difficult than the previous one and at the end of each one (or when you die) you will receive a score. This result can be added to your personal leaderboard, to compete against yourself, or published on a global leaderboard. If seeing your nickname appear in a neighborhood arcade cabinet was already an incredible feeling, being able to get to the top of the world is another matter. The road to the top, however, is less steep than in the past: Raiden IV x MIKADO remix, in fact, has a myriad of options for customizing the difficulty, including a ~Practice~ mode in which enemies do not shoot, designed to memorize the patterns and movements of the opponents. One of the mechanics introduced when the game saw its first evolution (in 2014 when it was released for Playstation 3) was the addition of the Overkill mode, which allows you to continue inflicting damage on enemy spaceships once they are defeated. All of this, of course, to receive additional points. Eliminating opponents moments after they appear on screen will also result in a higher score. These are simple mechanics, but to be maximized they require a lot of memory and training. To better manage deaths, bosses and extra lives, then, you can choose whether to face the levels in the light version, where everything is slightly slower. Unlike in the past, the developers have therefore thought of different tools through which to learn to play and improve progressively, so if the hunt for the top positions in the world rankings is one that motivates you, then Raiden IV x MIKADO Remix will not disappoint you. Spaceships and fairies It's not every day you get to choose a fairy as your warship but in Raiden IV x MIKADO remix it's possible Originally intended as DLC (for which MOSS has been heavily criticized), the two additional ships available in Raiden IV x MIKADO Remix look similar to the starting one, but in reality they control each other very differently. The Fighting Thunder ME-02, the base ship of Raiden IV, is very balanced, perfect for getting started and understanding the logic of the game. The primary weapon power and movement speed are average and its bomb (the special attack) can instantly clear all projectiles and enemies from the screen and deal a lot of damage as well. The Raiden MK-II, on the other hand, is the ship of the older Raidens and is recommended for more experienced players. Weapon damage is high, but movement speed is slower. Her bomb takes a few moments to detonate, but she's perfect for finishing off bosses thanks to her massive damage. Perhaps one of the strangest ~spaceships~ in shoot 'em up history, the Fairy is a rather difficult character to use. Its very high movement speed requires some training and couponsreflexes to be mastered, but in the most chaotic moments it is ideal for survival. Her bomb calls to the aid of fairy friends to attack all enemies on the screen, but it does not surprise for effectiveness or devastation. Surely it must be tried because seeing a fairy launching missiles and obliterating entire fleets of spaceships is certainly an unforgettable sight. What a sound! The music of Raiden IV x MIKADO remix knows how to make us feel like gods when we receive the most powerful weapons in the game Where experience will not disappoint anyone is in the music sector. In fact, this reissue owes the suffix MIKADO Remix to its soundtrack, renewed in collaboration with some of the most famous artists of the arcade music scene. We are talking about the likes of Go Sato Band, Heavy Metal Raiden, Daisuke Matsumoto (Cave) and Hirokazu Koshio/COSIO who have composed new tracks that have been placed side by side with the original (already iconic) ones to create a truly memorable experience. In this, Raiden IV x MIKADO remix succeeds where many other scrolling shoot 'em ups fail: the game involves all the senses in a balanced way, creating a sort of synesthesia made of explosions and techno music from which it is very difficult to emerge. Whether you're playing the very easy mode to feel like the gods of yore or you're trying to bring home a result worthy of the world rankings, this game's ability to take your mind and heart back to a dark mid-2000s arcade is incredible.", "date": "2023-01-27", "grade": "8.0"}