{"name": "Star Trek: Fleet Command", "ref": "https://multiplayer.it/recensioni/star-trek-fleet-command-la-recensione.html", "text": "It has been several years since Star Trek has been unable to find the right videogame interpretation and to tell the truth it seems to have always encountered difficulties in the enterprise, with the exception of some rare examples, such as the old Interplay adventures. It is therefore not surprising that the same situation has also reappeared on mobile, where Star Trek titles have so far been rather rare and neglected by most, but something could change with the arrival of Star Trek: Fleet Command, because it is evident that the Scopely team has undertaken this mission with particular zeal, seeking to deeply respect the series rather than simply exploiting it for its appeal, as we see in this review. It must be said that this is a rather demanding title: although it is a game inspired by the new narrative arc of Star Trek, with the characters who reproduce the actors of the new films in a rather faithful way, here we are not really talking about a tie - as a broader title. Star Trek: Fleet Command is in fact a strategic with managerial elements, which sees us engaged in the construction of a base from which to launch ourselves into space exploration, expanding our power and our influence in a universe torn apart by the constant clashes between the Federation, Romulans and Klingons. It could be defined as a strategic 4X of mobile derivation, which however presents a particularly fair and unobtrusive system of micro-transactions (being a free-to-play, of course). Furthermore, it combines this more properly strategic structure with some RPG-style elements connected to the presence of historical characters from the series, which can be recruited and applied to the ships in our possession in order to focus on their various skills and specializations. It's not a simple game: contrary to what often happens with mobile titles, here you have to get into the mechanics well before reaching a certain mastery and perhaps, paradoxically, it's less enjoyable on a mobile device than on a PC, but this depth is also its greatest strength. Space, the final frontier The game takes place on a vast star map, from which it is possible to access various systems, with the extent of the explorable space increasing as our means progress. There are, essentially, two directions along which the action develops: on the one hand, the construction and management of the base, which proceeds in the classic manner of strategic management, with the need to collect resources and invest them for expansion, with the construction of new structures and their constant evolution. Here the classic expectations of free-to-play games come into play, but the positive thing is that we are subjected to so many possible actions to take that it is difficult to run into moments of forced inactivity, which can therefore push towards micro-transactions. The other main direction is that of space exploration and actions driving the spaceships: these can be sent to various places to complete different missions, which include fights against enemies, defense missions, help, transport and so on . The possibility of influencing the balance by making some decisions during the ~quests~, which determine our diplomatic address, is also particularly interesting. Based on how we behave during some focal missions we can tend to alliance with the Federation, with the Klingons or with the Romulans, thus choosing our path between the different forces that vie for control of the known space without a pre-established path necessarily to follow. As you progress through the game, you unlock new characters who have different and more or less influential skills based on their level of rarity and these can be used on ships in order to take advantage of their characteristics. Clearly, it is a question of strategically employing these vessels based on the skills associated with the commander, which determines a further tactical feature of the game structure. Ships, planets, characters and map are represented with excellent polygonal graphics particularly detailed and faithful to the original design of the subjects. The problem is perhaps the scale used to stage everything, which on the screens of some smartphones can make the elements to be followed very small and confusing. Excellent thing, however, the texts completely translated into Italian.", "date": "2018-12-13", "grade": "8.2"}