{"name": "Insurgency: Sandstorm", "ref": "https://multiplayer.it/recensioni/insurgency-sandstorm-recensione.html", "text": "New World Interactive has returned to the Middle Eastern theater of combat, after the historical parenthesis of Day of Infamy, with the sequel to Insurgency, an online tactical shooter that we reviewed about four years ago. The success of the previous titles was amazing (over 5,000,000 copies) and allowed the Canadian development team to expand and aim even higher, thanks also to the help of a publisher like Focus Interactive and the landing, for the first time, on PS4 and Xbox One. Let's find out the result in our review. A delicate match The world of online FPS has evolved with important titles that have joined historical cornerstones such as Battlefield and Call of Duty. Between the battle royale at PUBG and the unbridled action at Overwatch there is a synthesis that New World Interactive had been able to grasp since the first Insurgency mod. Let's start in order by premising that, after the cancellation of the single-player campaign, the title remained usable only online, both in cooperative, against bots controlled by artificial intelligence, and in competitive where all the soldiers are commanded by people in the flesh . In the first case you can only play Checkpoint, a mode that involves the capture and destruction of sensitive targets controlled by the CPU: as you progress, the opponent's skill becomes higher and higher. In the opinion of the writer, it is more of an addition that slightly increases the meat on the fire but which could very well have been done without. In PvP there are three other match types: Push, Firefight and Skirmish. Push is the most frenetic and the one we played most often (leaving the computer to find the first available server): the attacking team must reach the defenders' weapons depot within a set time. Attackers start with five ~waves~ of respawns, meaning a chance to respawn once killed, defenders have twenty. If the first ones manage to capture the first of the three checkpoints, the wave counter will fill up, something that can never happen to defenders. Firefight is decidedly more reflexive, also because fire support is disabled, the number of classes reduced, and rebirth is possible only after conquering a control point. To win you need to capture three control points or, alternatively, eliminate all opponents. Skirmish is probably the most balanced mode: the two teams compete for checkpoints and at the same time have to destroy the weapons depot located in the opposing base. Conquering (or recapturing) an objective resets the team's respawn count. Competitive matches always involve direct confrontation between two teams, made up of a maximum of 16 players each who, at the end of the match, exchange roles. Lots of classes, lots of class Insurgency provides the beauty of eight classes, each meticulously characterized by specific skills, almost as if it were an RPG. They are all limited in number, apart from the rifleman who is the classic all-rounder: in addition to this we find the specialist (short-range rifles), the machine-gunner, the demolisher (rocket launcher), the supervisor (presumed special weapons, in truth the loadout is very similar to that of the rifleman) and the marksman (sniper). The commander deserves a special mention, the only one who can launch offensives (in the form of bombings, air strikes, drones), but to be able to do so he needs an observer to stand by his side. These are real finishing moves capable of breaking the kidneys of the team that suffers them and, based on our experiences, they are perhaps too effective (certainly they can be used too frequently). The weapons are those typically used in battles in Syria and Iran by local troops, so we will find the inevitable SKS, the Kalashnikov, the AKS, the M16A2, and numerous others, each with its own rate of fire, penetration capacity, times charging and so on; they can be customized by adding accessories such as sights, compensators, grips, grenade launchers. The combat system is very rewarding, as are the ballistics of the rifles: a really good job that requires lightning reflexes and in-depth knowledge of the map. In Insurgency, suppressive fire is more than ever an excellent way to clear the rooms of enemies; smoke grenades are essential and can make the difference in conquering an outpost; rocket launchers are deadly because with their mad shrapnel they can eliminate anyone within meters of the missile's point of impact. To provide a further tactical nuance we think the vehicles, whose presence, honestlyente, it seemed a little too pretentious to us, apart from a couple of points where they actually proved to be useful. Mastering your arsenal requires a lot of practice, but the experience of those who have hours of playing behind it is visible and can really shift the balance of a battle. At the end of each match you are rewarded with both ranking points and virtual currency with which to purchase exclusively aesthetic embellishments for your soldier. One shot is enough to leave us The combat system, while not reaching Arma's realism, is very severe and demanding, also due to a series of extreme choices regarding the game interface. First of all, the virtual viewfinder is missing, so shooting without aiming with the right button means relying heavily on intuition. Then there is no real minimap and the only hopes of understanding where an enemy can be found are given by the alertness of the allies, having in mind that the origin of the (presumed) enemy remains displayed only for a few seconds . The medikits are missing and, moreover, they would be of little use since a single shot, or even a grazing explosion, may be enough to pass away; in the few cases in which the blow is not lethal, it is sufficient to remain protected for a few seconds to restore health. There isn't even a shot remaining indicator, just an icon that gives an idea of how many magazines the player has left. To this must be added the lethal friendly fire: the identification of opponents during the agitated phases of a conflict is not always immediate and so it will often happen to hit an ally believing that it is an enemy. The diabolical way in which the maps have been structured does the rest: the designers have inserted entry points in every corner of each building and it is practically impossible to think of being able to guard an entrance or an escape route by yourself and this pushes even more to team up with their teammates. Everything written should make one think of a typically tactical title with stealthy rhythms, but this is not always the case, especially in Push mode: the awareness of having the possibility of returning to the game, combined with the countdown, enlivens the clashes not a little which are always characterized by a remarkable rate of adrenaline. The maps are quite large, they develop mainly on the horizontal plane but there are several underground and elevated passages that reward explorers. The scenarios, as written in the first bars, are typical Middle Eastern ones, with the refinery, the mountain camp, the devastated city, the crossing of two paths in the desert: in total we count only six that are aesthetically similar to each other. Graphics and surroundings Graphically we are faced with a good job, certainly not able to amaze, but still functional to the intentions of New World Interactive, which has paid more attention to the dimensions and structures of the maps than to the actual visual gratification. The polygonal models are sufficient and the interaction with the environment is very limited, while the textures are within the norm. In a nutshell, those glimpses that please the eye a little more than necessary are missing, but on the other hand the physics are very good, with some walls that can be perforated by bullets, thus resulting lethal for those who are hit. Despite numerous users complaining about poor optimization in the official forums, with our system we did not detect any uncertainty, with a frame rate remaining steadily above 67 fps at the monitor's native resolution (3440x1440) with all the details at the maximum level. Certainly much of the credit goes to the new RTX 2080, but as far as we're concerned, we can't confirm the complaints of those suffering from stuttering with a GTX 1080Ti. From a technical point of view, the audio sector is undoubtedly the master, to say the least majestic: let's not exaggerate if we say that it is one of the best ever heard in a video game. We are not referring only to the thunderous explosions that ~break~ the eardrums covering any surrounding noise, but above all to the positioning of the sound effects and the (automatic) voices of the characters. The acting is crazy, with insults and requests for help from which transpire the terror and anger that are experienced in the tremendous excitement of an urban warfare: if we add the voice messages of the players to this, the apotheosis is maximum. You are practically always surrounded by the sound of footsteps, by the hiss of bullets and bursts of machine guns from which you try to understand the hiding places of the enemies. When the bombings start we crouch in a corner waiting for the fnoise around is over, terrified of coming out of hiding (just like it would in reality) and often overshadowing the fact that the enemy is capturing the point we were defending. Surely there is still work to be done on the net code, because although the servers are not excessively populated (there are around 1500 online users after the approximately 5000 who took part in the open beta) we have often witnessed such exaggerated lag that we made believe that on the other side there was some sly. Several times we died despite the enemy not having a line of fire, and in one case we happened to fall to the ground even a few tenths of a second before the explosion of a grenade (there were no enemies around).", "date": "2018-12-13", "grade": "8.0"}