{"name": "Jagged Alliance: Rage!", "ref": "https://multiplayer.it/recensioni/jagged-alliance-rage-recensione.html", "text": "One of the most widespread practices on the videogame scene in recent years is the recovery of old intellectual properties to make remakes, reboots or new chapters. As long as a series has had a certain appeal, even eons ago, that someone is ready to dig its grave to exhume the corpse and revive it with necromancy. In rare cases the process goes well, despite the loss of the soul, and you have small jewels suitably renewed (eg Shadow of the Colossus for PS4), in others you have decent titles, however attractive for longtime fans (take the remastered Titan Quest), and at the bottom of the queue is Jagged Alliance: Rage!, whose problem is basically that it was raped by some mobile strategy during development. But let's go in order. The Jagged Alliance series (mostly the first two chapters) is famous for effectively combining turn-based strategy, RPG elements and stealth; technically it was never cutting edge, but that didn't matter given the depth of its gameplay. Then came the 3D chapters, Crossfire and Reloaded, which in the face of decisive graphic improvements have compromised on everything else, displeasing the historical fans. These are the classic cases in which by going in search of a wider audience, publishers not only do not find it, but end up alienating even the most dedicated audience. Many hoped that Jagged Alliance: Rage! was therefore the chapter of redemption, the one that would have brought the series back to its original glories. Unfortunately this is not the case: indeed, it is probably the worst Jagged Alliance ever, especially if you play it with a mouse and keyboard. Gameplay Jagged Alliance: Rage! begins with a cutscene in which we see a helicopter crash, then we have to select two characters from six to start our first mission. For those wondering, we specify that it is not possible to create characters, but the entire game is spent with the pre-packaged ones. Obviously they all have their pros and cons, including special abilities that can be activated (Rage abilities) that make a lot of RPG action and that clash a bit with the canons of the series. We would happily delude you by saying that you have to learn to choose the right mix of characters to pass the missions, but the truth is that you can easily pick two or more at random and adapt your actions to their characteristics, the artificial intelligence is so stupid and easily deceived that often getting ahead is just a matter of patience (play the Hard level now, the third of three, if you want a bit of a challenge). There are actually exceptions, which we will discuss later. In any case, the skills of our heroes range from the ability to attract enemies, to that of healing lost health, passing through better stealth skills and all the rest of the typical sampling of the genre. Our main objective is to stop a drug lord and his cartel, even if in certain moments the enemies are so endearing that we begin to root for them. In reality, there are moments in which they really put them in difficulty, making it impossible to move forward without changing tactics, and then go back to being the fools they always were. In short, what we can call the difficulty curve goes a bit on its own, traveling at low altitude for most of the time and reaching absurd peaks in unexpected situations, so much so as to force you to restart the current mission to apply a strategy different. Fortunately the missions are short and set on such small maps that the problem is very minimal. Let's say that in general there are real bottlenecks in the gameplay, which require a kind of trial & error that is not exactly very pleasant, but which have a relative influence on the flow of the game. Notwithstanding the above, to finish the main campaign of Jagged Alliance: Rage! it takes about ten hours playing on Hard level. Not very many for a strategy game, but considering the relatively low price ( 19.99) and the cooperative mode for two players, let's say it's acceptable. Cartoon graphics Much less acceptable is the imprecision of the mouse and keyboard controls, which require particular attention in order not to perform unwanted actions due to the contextual selection system. As already mentioned, with a joypad the problem does not arise, because the actions can be selected more effectively and with less risk of errors. Sure, a strategy to play with a controller on PC doesn't make a good impression, but we believe it's an indicative characteristic of the real target of Jagged Alliance: Rage!, which is certainly not the veteran of the series, as much as the Clash of Clans player looking for redemptionne (said in figurative terms). Moreover, this impression is also confirmed by the cartoon graphic style, which has nothing to do with the typical realism of the series. The very verbosity of the characters, who talk to each other for long minutes, often making jokes from Marvel films, is indicative of where the developers want to go. The problem is that, as much as the game systems are extremely simplified compared to the old Jagged Alliance, as much as the graphic aspect is more captivating and as much as the game tries to meet the casual player in every possible way, it will hardly meet the favors, while veteran players will avoid it like the plague, because there's really nothing here that's made for them or that will somehow appeal to them, unless over the years they've taken massive doses of player pills average and have forgotten what is meant by a true strategic. In short, from the point of view of the mechanics and the depth of the gameplay, the deterioration is so clear and dramatic that it does not deserve any justification.", "date": "2018-12-10", "grade": "4.0"}