{"name": "Top Gun", "ref": "https://multiplayer.it/recensioni/top-gun.html", "text": "In the blue painted blue The Campaign, the heart of the game that also offers a Free Flight mode as well as a nice multiplayer for four players, begins with three training missions that will allow us to become familiar with the control systems, which are two, Arcade and Simulation. Don't be fooled by the name though, as the second, although actually more demanding than the first, still has few simulative ambitions: in practice the only difference is that to tack it will not be enough for you to simply press left and right on the directional cross, but you will first have to turn your vehicle 90 and then push the stick down. Apart from this, everything remains identical, including the paraphernalia which is limited to the classic machine gun with infinite bullets and a hundred missiles equally divided between guided, for enemy MIGs, and not, for stationary structures on land or at sea. The three aircraft available, F-14 Tomcat, F-16 Fighting Falcon and F/A-18 Hornet, are well reproduced graphically but they don't seem to present many differences in practice, and in any case at the beginning you will have access to only the classic F -14. The action is pleasant, purely arcade, devoid of particular defects but also of stratospheric merits In the blue painted blue The control of the plane takes place exclusively via the directional cross and keys, while a radar will be displayed on the touch screen (useful up to a certain point, because it tells us the position but not the height of friends and enemies, and often especially in the first games , you tend to lose your sense of direction for a moment and find yourself outside the area of the skirmish) and a button to change the view, from outside to inside. After training you immediately jump into the action, committed to facing waves of MIGs accompanied by one or two allies, without disdaining to shoot down some targets on the ground, all in a completely 3D environment where you can roam at will, and therefore not forced into the typical rails of other games of the genre. The action is pleasant, purely arcade, devoid of particular defects but also of stratospheric merits: the opponents always offer a worthy challenge even if they are not guided by a particularly developed artificial intelligence; instead, the programmers used the classic arcade tricks such as a disproportionate number of enemies in some cases, and a chance of being hit dictated more by the situation and the level of difficulty than by your mistake or by a particularly skilled Russian pilot. The difficulty is also increased by the fact that once the missions are shot down, they will have to be undertaken again from the beginning, and given the length of some of these, it sometimes ends up being frustrating. Cruise missiles Um Back to us: multiplayer presents the always welcome possibility of sharing a single cartridge, even if in this case the choice of planes is limited to the Tomcat only; which in any case is not an irreversible loss, given the aforementioned similarity in the behavior of the three vehicles present. Rather it is the game action itself, in multi, which is quite disappointing, inferior to the single experience which is based on the hordes of enemies to face and avoid, which is missing when fighting friends. The graphics of Top Gun are quite detailed and precise in the reproduction of the planes and above all very fluid (granite 60 fps) and fast, even considering a nice effect capable of representing the sense of speed when this goes beyond a certain level. On the other hand, that of defects, the ground and the sea are very little detailed and above all the textures are of very low quality, presenting that dirt and low resolution typical of the first DS productions. The scenarios are then quite varied, even if there is nothing new regarding the genre. The sound, on the other hand, is almost completely negative, anonymous 80s rock to accompany our daring manoeuvres, and a few sampled phrases, poorly sampled among other things, which you will soon begin to hate due to the frequency with which they are proposed. license we have already spoken, we just have to move smoothly to the final comment ... Top Gun is pure and simple arcade, which does its dirty work not even badly. Who knows what atrocities cannot be attributed to him, if we exclude a poor sound and an exploitation of the beautiful license close to zero, yet the occasions in which you will feel gratified in the all in all bland and linear game action are very rare. It will be pleasant hours and nothing more when you accompany Maverick and his companions on their missions, but at this point we wonder why, with so many more exciting gaming experiences on DS, you shouldsettle for spending some carefree time. Sure, the alternatives of the same genre aren't that many, and if you're dying to enlist in the Air Force Look for it on hire!Pros Perfectly fluid and fast Vehicles well reproduced graphically Almost always pleasant to play Cons but nothing more Sound to forget License underused very little And these are problems that Top Gun here is unlikely to help solve. Strange fate, that of the tie-ins of this historic blockbuster, which are many starting from the NES era, but which for some strange reason have never fully exploited a license that can still appear quite juicy today. On closer inspection, the reason isn't even very strange, it's simply the cost of the license, but today we see far less important films with far more expensive licenses, exploited to the core, however, with the reproduction of even the most insignificant details in the video game ... With Top Gun, however, we have to settle for just one piece of the beautiful soundtrack, the names of the four protagonists, Maverick, Jester, Iceman and Slider accompanied by beautiful faces completely obscured, three planes and a campaign that presents here and there some elements seen in the movie. So, with an unprepared soul (at least if you are among the fans of Tom mentioned above), we board our old railway and we are about to take off", "date": "2006-08-07", "grade": null}