{"name": "Super Smash Bros. Ultimate: la recensione", "ref": "https://multiplayer.it/recensioni/super-smash-bros-ultimate-recensione.html", "text": "Attention: as often happens with Super Smash Bros., we have not been able to test the online mode because it will only be activated when the game is released. To get news about it, tune in to our website on Monday. There are two ways to approach our review of Super Smash Bros. Ultimate, one diachronic, therefore analyzing the entire path of Super Smash Bros., and one synchronic, i.e. evaluating the quality of this last chapter for Nintendo Switch, hic et nunc, comparing it only to what the current market has to offer. We will try to stay in the middle, and for this reason we decided to start our review from the mid-90s, when Masahiro Sakurai, then an employee of HAL Laboratory, was working on an alternative fighting game, temporarily christened ~Battle Royale for 4 players~. A draft built for the Nintendo 64, elaborated between one project and another, which the president of the company loved, who happened to be also a programmer. Satoru Iwata and Sakurai gave substance to that idea without it becoming a main project of HAL Laboratory for a long time; some employees complained that the president was apparently smiling too much while programming that simple sketch. Neither of them probably, while sensing its potential, could have imagined that that project, in 2018, would have become one of the most renowned, sold and played games on the planet, and that it would have been the last fighting game to be able to afford a colossal production. Many have wondered if Super Smash Bros. Ultimate is a Deluxe edition of its predecessor (and, let's make it clear right away, it isn't), and there's a reason for this: because it pursues the same goal, that is to get to the publication of the ~definitive~ episode. On Wii U Sakurai had come close to the goal, but the path had been partially compromised, in terms of timing and organization, by the birth of twins on 3DS. Now there is the Nintendo Switch, a hybrid console, and there is no longer a need for two editions of the same game. However, and here we can only go to personal feeling, this is not the only reason why Super Smash Bros. Ultimate, unlike its predecessor, hits the target perfectly. The Wii U iteration was almost perfect, but cold, mechanical in a sense. After all Sakurai, already at the time of Nintendo Wii, was partially tired of the saga, and of serialization in general, so much so that he founded his own company, leaving HAL Laboratory. One person had convinced him to retrace his steps, the same person who had helped him define the original draft, precisely that president (who died in 2015) who had a fraternal relationship with him. If Super Smash Bros. for Wii U was a task, Ultimate for Sakurai was a mission. The basics of gameplay For those who have never played the series, even in Super Smash Bros. Ultimate the basic concept of the gameplay is very simple: from two to eight players compete in a stage, which can be changing or not, structured or smooth, small or big, trying to shoot himself out of the ring, so that the other can't re-enter. Each time you hit the opponent, the percentage of his damage meter rises: the higher the number, the more your blows will throw him away from the battlefield. It is an atypical fighting game both because it contemplates many characters on the screen, and because it gives great importance to the vertical component, and because the moves, or the tactile formulation of the same, are the same for each fighter. It is essential to immediately learn that you have two jumps available, plus an additional move, which can be performed by pressing ~up~ plus B, which allows you to get even higher, to thus return - hopefully - to the ring. Each fighter can run, jump, brake and parry (RZ) through a defensive bubble, which erodes more and more as they take damage in close quarters. If in one against one it is central to understand how to roll (RZ plus the inclination of the analog stick), in wild multiplayer it is much more important to know how to perform a good Smash, or the shot that comes out by tilting the right analog stick or, more elegantly , holding down A together with a direction. If A is not pressed for a long time, the wrestler strikes faster, but also weaker. Each character therefore has three Smash: one low, one high and one side. The same applies to special moves, which follow the same logic but are associated with button B, and the latter, although twin in formulation, vary greatly from one fighter to another. Then there are the grips, the possibility of curbing the fall by tilting the stick in the opposite direction, and the opportunity to interrupt (or almost) the same by clickingZR upon impact against a wall. Wavedashing, absent in this form since the days of Melee, is also back, to the delight of the Pros. And, precisely in relation to the GameCube episode, it must be said that this chapter is not only an acceptable compromise, but the best possible one: the movement is more segmented and faster than in the last few episodes, and at the same time it ~vulgarises~ some advanced techniques , making them easier to perform. The road that leads to mastery is still long and hard, but it is feasible and, unlike in 2002, it does not require a ravine to be climbed three-quarters of the way: the route is more harmonious, and protects both beginners and enthusiasts. We can't predict if Ultimate will really be able to bury Melee for good, but it will certainly entertain and engage both newcomers and Pro players. Better than the Wii U chapter already did. Characters, scenarios and visual aspect We cannot tell you in detail about every single element of Super Smash Bros. Ultimate: it is a colossal production in terms of numbers and attention to detail, and to describe it all, more than an article, a small treatise would be needed. However, we will do our best to highlight its essential qualities. There are seventy-four characters, an impressive amount in and of itself, even incredible seeing how much each one is cared for from a tactile and visual point of view. Sakurai loves video games, a concept that we will reiterate later, and one of the ways in which this passion flows into Super Smash Bros. is precisely the combat system: the wrestlers, as far as possible, resemble those of the original series: some for the moves available and the loading time that require, like Cloud, others for the sensation of weight and speed, like Mega Man. There are seventy-four considering the Eco characters, i.e. those born from the same base (Ryu and Ken, Peach and Daisy, for example example), but not the real clones, such as the various Koopalings which, although different in the polygonal model, boast the same moves and characteristics as Baby Bowser. Anyone not impressed by this data should consider that each new wrestler not only adds to the roster, but creates a further series of match-ups, as well as moves and details to work out in the old ones: the most striking example is Kirby, who can suck in opponents by taking on (part of) their appearance and abilities. Among the new characters the Inklings stand out, really appreciable in the movements, in the refill and in the shooting of the ink. Some of the old fighters have been extensively modified, such as Link, heavier than usual and declined to the new standard imposed by Breath of the Wild. And we're not just talking about looks. The bow, central in the last masterpiece as never before, has become more important and powerful also in Super Smash Bros., and the sensation given by the HD Rumble when the instrument is stretched to its maximum potential is really effective. They are small details, tiny examples of how Ultimate is taken care of in this respect: not only does it bring back every wrestler that has ever appeared in the series, but it also adds others and makes changes to the old ones. In Super Smash Bros. there are even 108 stages, a dozen unpublished, others taken - and updated - from the old games. Here perfection had already been practically touched on Wii U, where Sakurai had decided to introduce the separation between Omega and ~normals~, thus making each scenario attractive even to Pro players. Basically Omega and Ruins are smaller and flattened versions of the stages (with or without three aerial platforms), ideal for white-weapon combat. At the same time this split has allowed the developers to indulge themselves in the standard edition of the scenarios, which since the previous chapter are more changing, varied and dynamic than ever. Both characters and scenarios are extremely pleasant to see, and above all on the TV (1080p against the 720p of the undocked Switch) they exhibit a glance superior to the Wii U episode. If in Super Smash Bros. Ultimate the most evident qualities are the cleanliness of the image and the amount of detail on the screen, the meticulous animations and a surprising depth of field of the scenarios contribute to the visual jubilation. We weren't fully convinced by the arenas taken from the Nintendo 64 game, which are re-proposed in high resolution while maintaining the ancient style: a nostalgic and indebted choice to the progenitor of the series, but it won't be appreciated by everyone. Melee, a multiplayer surprise Before delving into the fray, queen mode of Super Smash Bros. Ultimate, some further considerations on the graphic aspect, and how much it can influence the tactile feeling of a game. The movesiments are faster than in the past, perhaps even drier, yet they seem softer: this is thanks to the smoke trails, more or less voluminous according to the intensity of the blow, which follow the movements of the characters. A sensation enhanced by the new, rapid zooms at the moment of a successful and potentially decisive Smash. They are simple details and directorial choices, but as already mentioned they improve the tactile feeling of the game. Speaking of scrums, as mentioned before we cannot describe every single option. They are too many. There are Tournaments, relay battles, those with altered gravity or with modified rules, with the absence of weapons, with their presence, which can be further declined in low, normal or intense, even single objects can be deactivated or less. Unlike in the past, this Super Smash Bros. Ultimate tries to encourage the customization of the clashes: it allows you to face them in some standard modes (timed or lives), but does everything possible to suggest that there is no ~right~ way ~ to approach this title. Fans of the most canonical fighting games can play ~energy~, a section that does not contemplate the typical Smash damage meter, but a simple number to be lowered until it reaches zero: here it is important to hit rather than throw far. Among the most relevant introductions, always optional, there are the Spirits (which we will talk about shortly), and a bar for the Final Smash, which allows you to perform the homonymous move, albeit weakened compared to the one resulting from breaking the appropriate ball. For the uninitiated, it is a rare, incredibly effective and potentially lethal shot, which in this episode has been speeded up, brutalized and more integrated into the basic mechanics. But rather than talking abstractly, we would like to tell you two practical examples that demonstrate how great Super Smash Bros. Ultimate multiplayer is: yesterday we tried playing it in five, because now the Brawl is extended to eight (potential) players. We chose a random stage, with all possible items and the Final Smash bar activated. We were three individual users, and two Diddy Kongs as a couple. Fighting in these conditions is comparable to having to score on a normal football field, but with forty-four athletes inside: you have to seize the right opportunity at the right moment, trying in the meantime to get beaten as little as possible. The two Diddy Kongs, with red (and pink) shirts and a yellow star in the centre, finished the battle by shooting peanuts - in the game - and praising Marx - in reality. A delirious and fun state of sharing the experience that only an exceptional party game can offer. And this is rare. But the battle immediately following demonstrates why Super Smash Bros. Ultimate is unique: we switched to dueling by choosing Link and Ganondorf, with no weapons or special bars, dodging and rolling on an Omega version stage. The control system is the same, but the result is a totally different game, yet just as fun and much deeper. There are great fighting games and great party games, only Super Smash Bros., depending on the variables, manages to be both. The Spirits and Single Player mode The only shortcoming that we could attribute to multiplayer is the absence of the old Events much appreciated in Super Smash Bros. Brawl, especially in a collaborative key, but criticizing a similar aspect with so much content, which creates valuable substitutes, would perhaps be excessive. In the review of Super Smash Bros. for Wii U, however, we had complained about the lack of classicism - paradoxically - of the Classic Mode, which in Super Smash Bros. Ultimate returns in all its splendid orthodoxy. A path in stages, with duels and group fights, a bonus stage and a final boss. We underline here what, for us, is one of the very few flaws of the game: in Super Smash Bros. for Nintendo 64 (and Melee) the stage bonuses were personalized, similar in setting but different from wrestler to wrestler, and not only were they fun , but represented engaging tutorials to the character in question. Here, in Ultimate they would have served both to vary the only Bonus Stage present, identical for all, and to facilitate the transition from one character to another. For the rest, the path of the Classic mode is only to be commended: the customization with themed scenarios, enemies and (sometimes) bosses justifies the repetition of the same section with different characters. However, the real focus of the Super Smash Bros. Ultimate single player lies in the Adventure, ~The Star of Hope~, which is closely related to the newly introduced Spirits. The latter replace the Trophies and their de", "date": "2018-12-06", "grade": "9.4"}