{"name": "Mutant Year Zero: Road to Eden", "ref": "https://multiplayer.it/recensioni/mutant-year-zero-road-to-eden-recensione.html", "text": "The time has finally come for the review of Mutant Year Zero: Road to Eden, the awaited son of the latest incarnation of a Swedish role-playing game that is well over thirty years old. And it is a goal passed thanks to a fascinating setting that we find in the turn-based strategy developed by The Bearded Ladies, published by the well-known Funcom and characterized by a combat system inspired by XCOM. But we are talking about a very different title from Firaxis and not only for the lack of a macro-strategy dimension: the individual missions of the latter in fact leave room for a more fluid experience, excluding loading between one area and another , which is defined by the developers as a tactical adventure and mixes a pinch of exploration, a linear but robust plot, massive graphics, a lot of atmosphere and a strong stealth component, something that is in the DNA of part of a software house populated by several exiles from the Io team Interactive that dealt with Hitman. Mutant animals against the world The world of Mutant Year Zero: Road to Eden is a cemetery of men, memories and more or less functional technologies, scraps like the human ones who still try to survive in the Ark, while the outside is in the hands of robots, mutants and cultists from strange powers preparing to do something crazy and dangerous. But hope never dies, not even when you find yourself in the shoes of a hulking, no-nonsense boar named Bormin or a cocky-humor anthropomorphic duck named DUx, a character who embodies the spirit of a title that mixes gloomy atmosphere and irony. Indeed, being different from those who are already different makes the main protagonists of Mutant Year Zero the perfect heroes, special enough to stand out even in a world of mutants and motivated by the need to find out where they come from, whatever the cost. Two against the world, therefore, at least initially, given that the team is made up of three. And this is where Selma comes into play, a woman with prodigious legs and the first of three recruits who will also allow us to employ a powerful psyker and a fox with nerves of steel in the field. But before getting there, you have to go a little way starting from the arrival at the Ark which, once discovered, like the other areas, can be reached instantly with the fast travel. Something to keep in mind, among other things, because the vertical city houses the shops that allow us to exchange the scrap found, upgrade the weapons found or bought, make them even more effective thanks to the upgrade modules and unlock team bonuses using the obtained artifacts. All essential resources, ingredients of an evolution of the characters that also includes various mutations, real passive and active skills that enhance the characteristics of the characters making them more and more effective. And it is here that we finally come to talk about the gameplay of a title which, while allowing us to reach some areas of a higher level ahead of time, avoiding enemies or taking a certain crossroads, rewards those who face opponents systematically and is all in all linear, excluding some nifty clues that add a dash of investigative spirit to the experience. Weapons in hand, however, the possibilities are many. Once a threat is approached, its range of perception appears on the screen in the form of a large red circle within which we must not be seen or heard. To reduce its amplitude we can turn off the flashlight and this allows us to place enemies in the vicinity of the opponents, to finally kick off the ambush with one or more team members. And finally we are faced with the classic turn-based combat system based on grid movement, destructible cover, line of sight and percentages that determine the chance to hit, score a critical or activate additional weapon effects which include knockdown, robot disable, destruction covers and more. Attacking always ends a character's turn while armor blocks direct or other damage, and helmets show off a lot of more or less useful defensive abilities depending on the enemy faced. To all this are added the obvious guard mode (overwatch), although limited and not too effective for balancing issues, as well as grenades of various types, secondary weapons and medkits. Turn-based strategy in the service of stealth The minimum difficulty level of Mutant Year Zero: Road to Eden is normal. In fact, the easy mode is not among the design choices of a title that confronts us with tough enemies and asks us to exploit every resource at our disposal. But we are not dealing with a game that makes things too complicatedcate: the interface clearly shows us which enemies have an eye on one of our companions while the aim modifiers always modify it in 25 percentage point shots. Furthermore, the equipment is shared between all the characters who can access all the medikits and grenades available at any time, without forcing us to make cumbersome exchanges before a fight. And this means that the player's attention is always focused on the atmosphere, on the stealth dimension and on the challenge, as anticipated rather high. On our side we have stealth and freedom of approach, but on the other enemies equipped with many insidious abilities including psychics capable of dominating the mind, medical robots that can revive the fallen, incendiary enemies equipped with infinite Molotov cocktails, mutant guard dogs, hunters capable of striking from great distances and enemies capable of calling for reinforcements. Neglecting just one of these aspects can give a big advantage to enemies who are undoubtedly aggressive, even if often reckless, especially on the base difficulty. But this is clearly designed to dilute the challenge of an experience that suddenly becomes more fluid once you accumulate some levels, hit points, skills, weapons, armor and some experience in stealth dynamics. On the other hand, often these allow us to eliminate entire groups one enemy at a time and it would be reckless not to exploit them, given that an enemy's alarm can call them in droves forcing us into desperate fights. Of course, if successful, the silent killings take away something from the commitment on the field, making the balance difficult to weigh, among other things, but those looking for a more substantial challenge can raise the level of difficulty, which, among other things, is possible directly in game, switching to the difficult mode, where the energy recovered after a fight is only half, or to the maximum difficulty, which does not provide for the recovery of life after the clashes. All this in the face of enemies who do not gain life points, which ensures that the mechanics work at all levels, but they gain effectiveness and reactivity, while we lose medkits. And it is a detail that changes the cards on the table, making good resource management vital and at the same time guaranteeing greater importance to mutations designed for survival. Mutations that become even essential with the Iron Mutant mode, applicable to any level of difficulty but can only be activated at the beginning of the game, which introduces permanent death, takes control of the player's saves and significantly increases the longevity of a title that even without activating it he still kept busy for more than thirty hours. Much of the time, let's be clear, we spent exploring the maps in search of secrets, studying the movements of the enemies and trying again after failing an ambush, but time literally flew by. Too bad for the final fight, less surprising than we would have hoped, but the twist is not lacking and somehow closes the circle, even if the last sigh of Mutant Year Zero tastes like a cliffhanger. Eighties charm, in a triumph of explosions and debris Among the undeniable merits of Mutant Year Zero: Road to Eden we find a technical sector of a different profile, atypical considering the genre. The guys behind The Bearded Ladies have undoubtedly taken full advantage of the Unreal Engine by bringing in advanced lighting, volumetric haze, thick grass, real-time reflections and vibrant colors, all seasoned with a generous dose of environmental destruction. Some textures, among other things, really leave you speechless, but there are also less well-finished ones just as there are evident qualitative differences in the character models. If Dux is undoubtedly spectacular, both in the animations and in the overall rendering, Selma, as well as all the characters with still human features, ends up in the list of the least exciting points of a title which, however, makes up for it with showy pieces of equipment that add a lot to the look of the characters and help to keep the overall aesthetic judgment high. Unfortunately a good part of the experience is consumed in a forest often surrounded by huge mutant brambles that suffers from some variety problems, but the developers have done a great job in making it as varied as possible by exploiting snow, ambient light, foliage, huge robots , expanses of corpses, train wrecks, dumps and camps. The overall level of detail is undoubtedly high and in the final hours it grows further, giving us breathtaking glimpses of citizens, which crumble into a triumph of splinters and bricks between grenades, plasma cannon shots and satellite bombardments. A real show that suffers thoughof conspicuous slowdowns, among other things not always related to the destructibility or the polygonal mass. In fact, it happens that the framerate of Mutant Year Zero drops below 60fps in a meadow, and this regardless of the resolution or the video card used, a sign of some optimization problem that adds to anomalous collisions, attacks that do not seem to respect the aim rates and glitches of various kinds. But the patches of these days have already fixed the biggest problems and there is nothing that has prevented us from reaching the credits with great satisfaction, delighted by an atmosphere that alternates between melancholy, anger and irony effectively. The illustration-based cutscenes are modest but work, supported by more than good audio samples, effective Italian-subtitled jokes and a soundtrack that mixes the eighties synth of Blade Runner and 1997: Escape from New York with a combat theme that directly mentions the first UFO. And there are even some vintage rock fragments that come out of some half-broken radio, icing on the cake of a title that just needs some refinement to be considered fully successful.", "date": "2018-12-04", "grade": "8.5"}