{"name": "Legends of Kingdom Rush", "ref": "https://multiplayer.it/recensioni/legends-of-kingdom-rush-recensione-nuovo-strategico-mobile.html", "text": "More than a kingdom, Kingdom Rush has become a sort of empire, with ramifications in various videogame genres on the mobile landscape, therefore it is not surprising that it has finally also arrived on the front of turn-based strategy games with a more classic setting, as we see in this review of Legends of Kingdom Rush. The series was born as a tower defense, which in itself is already a derivation of the strategic, but in this case it goes right back to the origins of the genre in a reinterpretation of the most classic declination of this type of game, namely the turn-based one and also manages to be convincing. It is obvious that it is a somewhat simplified version of the genre, suitable for consumption on mobile platforms and therefore designed from scratch for a type of fruition different from the old-style strategic one: the interface is simple and suitable for use on touch screen, the options are varied but rather clear, not too stratified and generally understandable even by a younger or less attentive audience, but the core of the game is very solid and surprisingly recalls various elements of the RPG. Legends of Kingdom Rush features classic turn-based strategy elements The general aesthetic fits perfectly into the climate of the series, as well as the characterization of the characters and the story, clearly very cartoonish and very little original, but the gameplay underlying all this is fundamentally different from the usual tower defense and manages to propose the basics of turn-based strategy in a simple and fun way. However, it is not just about tactical clashes on the battlefield, given that we are also faced with different situations in addition to the obvious care on party composition and on building characters as strong as possible, advancing from level to level and unlocking new ability. Distribution through Apple Arcade also completely excludes the worst drifts of the genre given by the usual presence of micro-transactions: Legends of Kingdom Rush is a complete game that does not require waiting or in-app purchases to go ahead and this is a strong point of considerable amount, provided of course that you have a subscription to the service. Strategic with a hint of RPG Everything starts from the general map, divided into various geographical areas in turn made up of numerous junctions to be reached by following different roads, which trigger different events. In most cases, each junction corresponds to a battle on the battlefield, but this is not always the case: some points of interest offer meetings with NPCs with whom to talk or trade, we can discover villages or take part in situations that closely resemble a real pen and paper RPG, no less. This is a rather surprising element of Legends of Kingdom Rush, which in the midst of a game obviously designed for mobile platforms and a basically young audience offers situations in which we can choose how to act based on the different abilities of the characters and the good old throwing of dice. These are simply situations that are resolved by choosing one of the various possibilities, but the outcome of these depends on the statistics of the characters, the objects found earlier in the course of the adventure and the roll of the dice, which certainly brings a smile even for RPG traditionalists. In Legends of Kingdom Rush, the map features forks and alternate choices However, the core of the gameplay is the clash on the battlefield, which takes place in the typical turn-based strategy manner, controlling one character at a time of the party, making him move on the boxes based on his range of action and choosing whether to use attacks or defensive maneuvers until the end of the turn. Also under this aspect it is a sort of general summary of this type of game: the strategic choices are given above all by the assortment and by the field disposition of the various classes of characters (which can be summarized in tank, ranger and mage) and by the priority give to the various targets, also considering the presence of any interactive elements of the scenario that can provide advantages, such as explosive barrels and things like that. The more particular and profound variations of the combat system are missing (the influence of the conformation of the terrain, the reliefs and the orientation of the characters, for example) but there are still simplified versions of the more widespread ones. There are attacks that modify status, hits that pierce armor and others that affect the area, thus adding layers of classic depth to the structure of the game.", "date": "2021-06-20", "grade": "7.8"}