{"name": "Armored Brigade", "ref": "https://multiplayer.it/recensioni/armored-brigade-recensione.html", "text": "Armored Brigade is not a title for everyone and it doesn't even want to be. Over the years, the gaming market has divided into more or less large reserves, often not communicating with each other. Some genres have almost died out, while others have been ghettoized due to their difficulty in penetrating the mass market. Strategists rightfully fall into the second category. Obviously we are not talking about Clash of Clans-style rose water strategy, but about complex war simulators that require hours of study just to understand the balance of forces between the different units and to start producing sensible tactics on the battlefield. Armored Brigade is just that: we are talking about a real-time strategy set in modern Europe, characterized by the accurate reconstruction of more than five hundred military units. In total there are four maps to choose from (five if we count the tutorial one), all huge and used differently depending on the selected battle and how you decided to customize the game. From this point of view, the options offered are really many and the entire review could be filled with it. For the sake of brevity we say that it is possible to simulate an impressive amount of war situations, from simple urban clashes to large-scale battles, both using the included maps and creating new ones with the powerful editor provided by the developers, which allows you to modify or even create new scenarios that will be added to the fifteen standards. In short, from the point of view of the amount of content, you can't really complain, despite the fact that multiplayer is completely missing. Unfortunately, complex game mechanics such as those of the Veitikka Studios title would be ill-suited to being used online, unless you sacrifice some of them. Gameplay Armored Brigade is at its best when it comes to the battlefield. The entire gameplay is centered around planning and giving orders to your troops, studying your opponent's moves and reacting accordingly. As mentioned above, all units have been recreated with great fidelity and with a wealth of characteristics that make them more complicated to use than it might seem at first glance, especially when you start to understand how much different types of terrain affect each of them. However, putting into words the complexity of the game system is not an easy undertaking. Let's say you can send troops to scout, attack, layer orders so that they are carried out in a certain sequence, and much more. Fortunately, the game interface is mastered quite quickly, also because it has been designed in an essential way to allow the player to issue orders quickly during the action. What is complicated is getting into the game dynamics. Nothing wrong with a similar title, which thrives on the ability to involve those players looking for more complex gameplay than the classic ~assemble all the troops and charge~. However, all this would not work if it were not accompanied by an artificial intelligence worthy of the name. From this point of view Armored Brigade does an excellent job: the CPU is able to develop very complex tactics that use all the tools available effectively, without having to resort to tricks (or at least without doing it in a blatant way). For example, he is able to skilfully combine troops, to use reconnaissance means following a stringent logic and not to make gross mistakes in defense. In attack, however, it is more problematic and in some cases it tends to isolate the units a little too much, sacrificing them in an absurd way (probably to prevent stalemates in battles... after all, its first task is to make the player feel some pressure ). The friendly artificial intelligence is also very valid, the one that helps us manage some aspects of the game and which is indispensable in the most complex situations: unless you think you can move hundreds of units at the same time, it is inevitable to use it. In general, artificial intelligence and scenario design create really interesting and exciting situations, which are difficult to register in the most commercial strategic games, between ruinous ambushes, sudden reversals of the field and so on. Let's say that Armored Brigade is the classic title that, after running in, really has a lot to offer. Of course, there is a bit of studying (consider that the manual alone is about four hundred pages), but strategists will be satisfied. From a technical point of view, however, there is little to say, given that Veitikka Studios seems to have done everything to make itmake it as essential as possible: the graphics do their job, that is, they describe the action and the battlefield well, but nothing more. Obviously this is certainly not the title with which you will twist your new video card or in which you will find who knows what stylistic ambitions. It is a wargame and behaves as such, even visually.", "date": "2018-11-28", "grade": "8.0"}