{"name": "Pocket Card Jockey: Ride On!", "ref": "https://multiplayer.it/recensioni/pocket-card-jockey-ride-on-recensione.html", "text": "The original Pocket Card Jockey for Nintendo 3DS is about to be delisted with the closure of the eShop, all the more reason to keep this review of Pocket Card Jockey: Ride On! in mind, as it could shed some light on an often overlooked title in the West and which would risk being totally lost. So congratulations to Apple Arcade which once again demonstrates its ability to make a remarkably accurate selection of the mobile offer, not only recovering a lesser-known Game Freak game, but also promoting a general reworking that makes it a richer and more technically advanced as well. Pocket Card Jockey: Ride On! it is a mix between a solitaire and a horse racing simulation, and this in itself is enough to frame the madness of the situation well. In perfect Japanese style, Game Freak does nothing to hide this bizarreness, loading it with surreal humor also through the story, which sees a young jockey grappling with the metaphysical and vaguely blasphemous consequences of a disastrous first approach to this sport. Between fatal accidents, divine encounters and threats of hellish sentences, ours finds himself having to run and win to save his soul, no less, but all told with an attitude between the insane and very little dramatic nonsense. Basically, our hero is totally incompetent when it comes to horses but seems to have a great talent for solitaire, which is why the Lord himself (who strangely looks a lot like the manager of the stables) decides to combine the two and allow him to run using his particular ability, thus creating the strange association between cards and horse racing. Solitaire and horse racing Pocket Card Jockey: Ride On! at the start he suffered a mini-solo to decide position and lane Don't be deceived by the absurd presentation: Pocket Card Jockey is a rather complex game especially as regards the strategic management of the horse, which requires dedication to be fully understood and mastered. The gameplay revolves around the classic solitaire dynamics, i.e. the association of the cards in scale up to the elimination of all those present on the table, but this represents only a part of the composite structure of the race, which is quite deep and multifaceted as a sort of simulation with strategic implications. In the heart of the action, while the race is displayed in a stylized and cartoonish way in the background, in the foreground we are dealing with the solitaire and with various decisions to be taken on how to move the horse. The card phase takes place at least three times a race, to mark some fundamental sections of the race such as the start, the middle phase and the last corner before the final straight: the solitaire mainly serves to accumulate impetus and increase the relationship between jockey and horse, all elements that are essential for the success of the race because they increase speed, resistance and the possibility of final acceleration. Modifiers can be applied to the cards to be purchased at the shop before the race or collected directly as a bonus on the track, which they can simplify the action and multiply the advantages given by the elimination of the cards. However, all this is only a part of the game mechanics, which also includes a series of tactical maneuvers directly linked to the positioning of the horse and its control on the final straight, making the whole system quite deep. Pocket Card Jockey: Ride On! the characterization is caricatured In the intermediate phases between those based on the cards we can move the horse to different positions on the track, at the cost of some stamina points: positioning towards the center of the track allows you to consume less stamina but it is easier to find yourself stuck in the traffic of your opponents, while moving towards the outside there are opposite implications. Also considering the possibility of collecting bonus cards scattered at different levels on the track, this positioning mechanic is strategic and requires a certain study in terms of advantages and investment of energy, also because a large part of these must be reserved for the final sprint. On the straight yet another phase of the game intervenes before the finish line: in this case we can directly control the horse by making it move to different lanes in order to dodge and overtake the opponents (but with maneuvers that always require a certain amount of time and energy), as well as to be able to use the whip for a limited amount of times in order to momentarily accelerate the horse (but with the possibility of obtaining additional bonusesi if this system is not used). The Apple Arcade version Pocket Card Jockey: Ride On! it has various management and managerial components In terms of structure and content, Pocket Card Jockey: Ride On! it's essentially the same game previously released on Nintendo 3DS, but Game Freak has made some technical improvements to make it look better on Apple Arcade devices as well. We are not dealing with a game that needs to make a great show of graphics, but the characterization is excellent and charismatic, able to immerse us in the particular atmosphere of horse racing according to a particular typically Japanese humorous and caricatured touch. The cutscenes and sections during the race, with horses and jockeys in what could be called a sort of ~super deformed~ style and colors shot to the max, create a cheerful atmosphere that integrates well with the general spirit of the game . On the other hand, even the controls are perfectly suited to the touch screen, given that they substantially exploit the same system in the original version as well. Among the additions of this version for iOS, we note some new implementations on the management front, with a menu richer in options that also allow you to control and modify the ranch, change some aspects of the horses (which have their own specific progression), access the shop where you can buy items that can provide bonuses and even a ~battle pass~ style system that unlocks achievements and progressive rewards from day to day. On this aspect, however, there is no need to fear possible drifts with micro-transactions, given that Pocket Card Jockey: Ride On! is distributed within the Apple Arcade catalog and is a really good introduction. From a management point of view, the implementation of the breeding and growth of horses represents a further important aspect also to lengthen the longevity of the game.", "date": "2023-01-26", "grade": "7.5"}