{"name": "Titan Quest - Recensione", "ref": "https://multiplayer.it/recensioni/titan-quest-recensione.html", "text": "Total action To make it clear what Titan Quest is made of, it is enough to know that about ten seconds pass from the beginning of the game (a brief dialogue with a herdsman on the run) to the first carnage. From here on it will be a furious pressing of the left mouse button, with tens of thousands (literally) of monsters appearing in front of the hero in an attempt to block his path. From time to time you will have to deal with the inevitable end-of-level bosses, to then reach the city centers where you can be assigned new subquests and stock up on potions. Simply put, a photocopy of Diablo. The plot, despite Randall Wallace (former screenwriter of Braveheart) being hired, as well as being substantially specious, fails at all in the attempt to capture the player: the numerous dialogues that are faced once you arrive in the city do not reconcile with the rhythm hectic of the game and most of the time you end up skipping them to get back to the battle as quickly as possible. However, it is enough to know that the Titans, superhuman entities confined to the underworld by the gods of Olympus, are returning with the help of the usual crazy priests ... clearly only one person is able to stop the army of evil. Poor customization The creation of your alter-ego is very much reduced to the bone: just choose the sex and you can immediately start beating your hands. Honestly, we wouldn't have minded a little more customization at all, even if during the game, by distributing the skill points deriving from the level increase, you can forge a character more devoted to white weapons rather than magic. In addition to the usual attributes (strength, dexterity...) it is possible to choose two of eight disciplines that regulate different characteristics, such as resistance to blows rather than mastery of fire magic. Within each of these experience points can be distributed in order to enhance a certain skill (for example the berserk mode for battle masters) and thus give life to heroes with unique characteristics, partially making up for the initial limitation. The adventure is vast, and will lead you to explore Greek, Egyptian and Asian landscapes, all very detailed and full of historical references, from the oracle of Delphi to the Great Wall. An important feature is that, as in Dungeon Siege, the map is a continuum without loading between one setting and another. Credit must be given to the designers for having maintained a coherent stylistic line and for not having wanted at all costs to insert settings that may be spectacular, but have little relevance to the places to visit. The main plot unfolds in an absolutely linear way; there are simple, almost ~obligatory~ secondary missions, but, at least in Greece, it is sufficient to stop in every city. Starting from Egypt, things get a little more complex, because it is necessary to retrace one's steps in order to continue with the plot; in any case nothing particularly complicated. As initially written, the real challenge is represented by the exaggerated number of monsters that hurl themselves at the player at every turn: among the mythological bestiary there are harpies, minotaurs, jackals and scarabs, just to mention the most familiar. Unfortunately the difficulty level (there is only one available at the beginning) is not the most demanding, and essentially requires always using the same strategy: you launch yourself into the heart of the battle (with all the enemies that are magnetically attracted not as soon as they enter the visual field), you start clicking on the left mouse button and as soon as your health drops below the guard limits, you press the healing potions button. In 99% this tactic was successful, even against the most aggressive opponents. Naturally, it is possible to recover amulets, shields, swords and alembics of all sorts from the corpses of enemies (the vendors in the city offer, as per tradition, very little), with the stated aim of reaching ever higher maximum damage. On closer inspection, this is one of the most tantalizing aspects: there are numerous armors and relics to be recomposed a little at a time which, put together, give extraordinary modifiers; unfortunately, however, the most powerful objects appear with the dropper (we even completed over half of the game with a sword obtained in the opening bars), while there are tons of useless things. Fortunately, with the press of a key, it is still possible to highlight only the items worthy of attention. The goods are stored in an inventory which is gradually expanding and which is equipped with a very useful feature, because it automatically comparesselected items with equipped items, making it quicker to select optimal armor. System requirements Titan Quest (branded ~the way is meant to be played~ NVIDIA) is certainly demanding from the point of view of hardware resources, at least in maximum detail. The test was carried out with an Athlon FX-57 and GeForce 7800 GTX: although the configuration is far superior to the recommended one, we recorded some annoying slowdowns especially near caves and in general in night landscapes. Do not underestimate the importance of the disk subsystem: no problem with the two Western Digital Raptor 74 Gbytes (Raid 0) of the supplied system, but those who have only one hard disk should make sure to leave a good percentage of free space and to defragment before starting the game experience. The view is isometric and cannot be modified: you can at most zoom in to admire the action more closely, but in most cases the player will prefer to keep the camera at a safe distance in order to spot the hordes of enemies nearby. To report some inaccuracy in the control especially in the descent towards caves and dungeons. The graphics engine, one of the most refined out there, really deserves a mention. The plays of light are the masters, even if the frenetic pace does not always allow you to appreciate certain high-class details, such as the sun's rays which, penetrating between the leaves of a palm, are dynamically projected onto the walls or onto the characters they pass below. The elapse of day and night is also very suggestive, while unfortunately there are no other environmental effects such as rain or fog. Among the negative aspects to report some annoying slowdown and not exactly low system requirements. The soundtrack plays its role admirably, accompanying the carnage without ever giving boredom; the sound effects are also good, while the speech (for what little there is) is flat and unconvincing. Upgraded Titan The title being tested was updated to version 1.08. The patch (it's currently the first and can be downloaded from our Files Area) has fixed several problems in both single player and multiplayer modes. However there are still some snags that could be fixed very soon. The second update is expected by the end of July and will contain improvements to the editor and performance on low-end graphics cards. In terms of longevity, Titan Quest is second to none: the main mission takes almost thirty hours to complete, but those who are afraid of finishing too quickly shouldn't worry, given that further difficulty levels are unlocked to face to always upgrade most likely the hero. Then there is a discrete multiplayer mode, more fun on LAN than on the internet, in which players (up to a maximum of six) help each other to complete ad hoc maps (perhaps created with the supplied scenario editor) or even the main quest. In fact, those who find themselves in difficulty with some creatures will be able to host a game on their PC where guests will start playing in the same point where the host made the last save. Final comment The anachronistic nature of the Titan Quest game structure is the basis of the global judgment of the Iron Lore production. Those who think they can have fun simply by exterminating disproportionate numbers of monsters will surely be satisfied by the care with which the clashes have been balanced and by the visual aspect that is as clean as it is scenographic. For others, however, it is yet another proof that it is not enough to reincarnate past successes with cutting-edge techniques: the extreme repetitiveness of the action could turn longevity into monotony, and make the DVD put away in the case waiting for some friend for fun, albeit occasional, matches on the local network. Pro Graphic section Immediacy of the action Longevity Cons Poorly tactical and too repetitive clashes Too many slowdowns Voice acting of the protagonists not up to par Titan Quest is the first production of Iron Lore, the new company of Brian Sullivan, co-founder of Ensemble Studios and creator of classics such as Age of Empires and Age of Mythology. It was precisely the studies carried out for the creation of the latter that gave rise to the hack and slash RPG subject of this review.", "date": "2006-08-02", "grade": null}