{"name": "Assassin's Creed Rebellion", "ref": "https://multiplayer.it/recensioni/assassins-creed-rebellion-recensione.html", "text": "Assassin's Creed Rebellion is a very distant title compared to the last episode of the Ubisoft series that appeared on iOS and Android devices, that Assassin's Creed Identity which had tried with great ambition to reduce the traditional gameplay of the franchise into a fascinating experience, albeit limited by a simplistic approach, typical of many mobile productions. In this case we are faced with a curious strategic RPG with chibi-style characters: a completely new interpretation for the brand, which the developers of Behavior Interactive have been able to use in an effective and pleasant way, offering us a rich roster of Assassins both cute and deadly. The plot of the game takes place between the events of the Ezio Auditore saga and those of the film with Michael Fassbender, with the former visiting his colleague Aguilar at the Spanish Brotherhood to take stock of a series of Templars that must absolutely be eliminated. After completing a short tutorial, let's go: the map is divided into areas that include main missions, related to the story, and a variable amount of side quests, which however soon reveal their value only for grinding purposes. Gameplay and structure The action of Assassin's Creed Rebellion takes place in turns, as we manage a team made up of three characters who can belong to different classes. We naturally have the Assassins, skilled at eliminating opponents silently, climbing walls and hiding, but also fighters who give their best in head-on battles, refined swordsmen and expert defusers of traps and devices. Before each quest, an optimal team composition is suggested to us, so we find ourselves grappling with a two-dimensional scenario, divided into watertight compartments, with each ~room~ posing a different dilemma to solve. If there are guards, we will be able to immediately understand our success rate in trying to eliminate them depending on the selected character, then just choose one of our fighters and advance, carrying out a silent killing or, perhaps if it goes wrong, a duel rounds in which we will probably lose some vital energy. The objectives of the missions can be different and therefore do not revolve solely around the annihilation of a specific opponent, but perhaps involve the collection of objects, tests and treasures that will replenish the Brotherhood's resources. Depending on the situation and the character we will have different options available to proceed, for example with the more cunning Assassins we will be able to hide in a well or behind an object, throw coins and wait for the guard on duty to arrive to hit him with the hidden blade; or even avoid the fight altogether, going unnoticed to the next destination. However, the special actions are not infinite, therefore it is necessary to carefully evaluate what to do and when, using one's resources in the best possible way from the point of view of the mission. Simulation and freemium mechanisms According to our experience with Assassin's Creed Rebellion, it unfortunately appears clear how the game suffers from a balance that is a bit too monetization-oriented, which puts the level of the characters ahead of anything else with respect to the completion of quests. You can therefore be as cunning and skilled as you want, but you will hardly be able to overcome a challenge designed for Assassins with a higher degree of experience; and to meet these requirements you will only have to do a little grinding, repeating missions that have already been completed or dedicating yourself to secondary ones and events (which for the moment, however, seem to be governed by an unusual paywall, in the form of a subscription). It is a pity that this mechanism comes into action already at the end of the first area, substantially slowing down progress and bringing the experience on the tracks of monotony, waiting to finally be able to have the skills necessary to continue in the story. On the outline front, the developers have done a great job, with the possibility of building, enhancing and finishing a sort of Spanish Villa Auditore, with various rooms dedicated to training, espionage, ceremonies that determine the evolution of the characters ( in the presence of sufficient fragments of DNA) and so on, all with a style that visually recalls the vaults of Fallout Shelter, without boasting the same depth. We have already talked about the peculiar graphic style of the game: it is very pleasant, net of some renunciations from the point of view of the animations and a certain tendency to re-propose the map assets. Nothing to say on the other hand about the sound, which welcomes into its own soundtrack some of the most iconic tracks from the Assassin's Creed franchise, absolutely gorgeous.", "date": "2018-11-20", "grade": "7.0"}