{"name": "Marvels Spider-Man: Territori Contesi", "ref": "https://multiplayer.it/recensioni/marvels-spider-man-territori-contesi-recensione-secondo-dlc-ps4.html", "text": "Having archived the review of the base game for some time and a month ago that of its first additional content, the time has come for Marvel's Spider-Man to go down the hill in the journey made by its DLCs. The city that never sleeps - this is the name given by Insomniac Games to the series - in fact continues today with Disputed Territories, the second chapter of the new plot line started with The Robbery. About thirty days after our meeting with the Black Cat, the time has therefore returned to take on the role of Spider-Man, to face again the threats that in New York show no sign of diminishing. New enemies await Spider-Man on the horizon, and we certainly don't want to keep them waiting! Playstation 4 trophies Disputed Territories introduces the same number of Trophies as its predecessor in Marvel's Spider-Man, with respect to which the type of objectives proposed remains unchanged. The total of seven Trophies present in Disputed Territories is thus composed of one of the Gold, one Silver and five Bronze types. To get them all, the obligatory step is to complete the story narrated in the additional content at least once, and then possibly dedicate yourself to completing the secondary activities. The plot: Hammerhead against all As anticipated by the ~To be continued ...~ with which La Rapina ended, Territori Contesi picks up exactly where its predecessor left off, of which you can read our review here. We therefore find the city of New York grappling with the war between some gangs, which broke out following the capture of the Kingpin and the events told in the main story of Marvel's Spider-Man. The main villain is once again Hammerhead, increasingly determined to gain power within the Maggia to thus bring the criminal organization to have a greater grip on the entire city. A conflict is therefore underway among the criminals who make up the Maggia to establish command, which Hammerhead intends to win in the simplest way possible: eliminating all rivals. In order to conquer New York, the criminal decides to vigorously confront the police force as well, taking possession of the armaments left in the city by Sable International to succeed in the enterprise. Set aside Black Cat and also forgotten Mary Jane if we exclude a few jokes on the fly, Disputed Territories sees the presence alongside Spider-Man of Yuri Watanabe, acquaintance present since the base game as a collaborator of the superhero from within the police force . The brutal violence perpetrated by Hammerhead catches Yuri unprepared, forced to shoulder all the responsibilities of what is happening in New York at the hands of the criminal. The relationship between Spider-Man and the policewoman is therefore at the center of this new DLC, within which the romantic effusions of the Black Cat towards our little spider leave room for more serious themes. We have already said enough about the plot and we will not go further, limiting ourselves to stating that just like a month ago, the story of Disputed Territories continues to be followed in a quite pleasant way, although this new DLC lacks a charismatic character like Felicia Hardy. Hammerhead himself as a villain could perhaps do a little better in this same respect. The most appreciable aspect of Disputed Territories is Yuri Watanabe's reaction to the events that take place, which lead the policewoman to face some conflicts with her role. The gameplay: the team that wins doesn't change The main dynamics of Disputed Territories obviously remain faithful to those of Marvel's Spider-Man, to whose review we refer for any further information on the matter. Compared to The Robbery there are some small innovations, dictated by the rise of Hammerhead as a bad guy: the first line of secondary activities is in fact linked to the criminal dens of the hammerhead's henchmen, in which we have to clean up the places where the criminals lurk . Screwball, Spider-Man's ~social villain~ that we already got to know between the base game and the first DLC, is back once again. Also in this case, by completing the tasks it is possible to obtain the three additional costumes introduced by the Disputed Territories, which compared to its predecessor gives more space to the action. The new enemies equipped with a heavy machine gun seen in The Heist are joined by some units equipped with a special shield with which they can defend themselves from Spider-Man's attacks more effectively, then also using it to inflict damage on the spider. The combined presence of these two types of opponents makes the difficulty level of some battles particularly challenging right from the start, forcing the player to movequickly using all the skills that Spider-Man has. We happened to die a few more times than in the past, but by understanding what your mistakes are, it is still possible to continue after a few attempts. The stealth phases are rather limited compared to The Heist, as are those in which we have to solve puzzles, limiting ourselves to a mission in which we have to spy on some enemies using the Spider-Bot and little else. Moving towards the conclusion, we can only confirm the opinion expressed on the occasion of the previous DLC: if you liked the original game The city that never sleeps is an excellent excuse to go back to weaving cobwebs among the skyscrapers of New York, taking advantage of it if of Disputed Territories to enjoy a rain-wrapped Manhattan for an additional trio of hours. Also in this case the plot of the DLC is linked to the next from the ~To be continued ...~ that we mentioned at the beginning, so the wisest choice remains to buy the entire package also taking advantage of a possible offer on the occasion of the upcoming Black Friday. In our ranking of Marvel's Spider-Man Disputed Territories DLC it ranks overall below its predecessor, together with which it still leaves more than satisfied at the moment.", "date": "2018-11-20", "grade": null}