{"name": "World of Final Fantasy Maxima", "ref": "https://multiplayer.it/recensioni/world-of-final-fantasy-maxima-la-recensione-per-switch.html", "text": "First released on PlayStation 4 and PlayStation Vita, then converted for Windows PC, the unlikely spin-off in chibi sauce also arrives on the new Nintendo console taking advantage of the release of the Maxima pack, an update - sold separately in the case of the previous versions - which adds a whole series of extra content aimed at prolonging the adventure with some new challenges and a potential link to the increasingly probable sequel: in addition to the New Game + mode, in fact, Maxima introduces some new champions - among which Noctis and Y' shtola - but also a minigame, some new mirage, the inevitable superboss to defeat and more. World of Final Fantasy on Switch is almost identical to how we remembered it, with the addition of the portability that the unique Nintendo hardware offers and a few nasty bugs that we hope Square Enix fixes soon. Jiganti and lilichini For the uninitiated, it is worth remembering that World of Final Fantasy Maxima is an episode unrelated to the Final Fantasy series, also because Square Enix has risked a kind of Pokmon clone for the occasion. The protagonists of this story are twins, Reyn and Lann, who have lost their memory and who to remember what happened will have to capture the ~mirages~ scattered around the world of Grymoire, creatures taken directly from the Final Fantasy universe - like chocobos or malboros - which ours can use to fight. The various mirages have different sizes that strategically affect the composition of the group during the fights. In fact, the largest mirages can carry Reyn, Lann and the smallest creatures can stand on top of their heads. The two brothers can also change shape and transform into ~jiganti~ or ~lilichini~, super deformed counterparts who can ride on the back of the biggest mirages. Each ~stack~ of mirages is a sum of the stats and abilities of the mirages that make it up: World of Final Fantasy Maxima is a very simple game only in appearance, since it hides a great depth that is especially evident towards the end of the game and in the optional challenges accessible only after finishing it. In the options menu you can choose whether to scan the battles in turn or in real time, using a variant of the Active Time Battle used in the old Final Fantasy or a hybrid solution. In the turn of our pile we will be able to choose which skill to use, whether to attack enemies, heal our heroes or imprint our opponents, that is, capture them to add them to the Mirage, a kind of encyclopedia that also allows us to improve mirages, unlock their powers with points earned at level ups and even evolve them into bigger and more menacing creatures. World of Final Fantasy Maxima is therefore a fairly deep role-playing game in terms of gameplay, but it must be emphasized that the plot and dialogues are rarely taken seriously: from this point of view, the Square Enix title wants to be not just a letter of love to true fans of the series, but also an excellent starting point for those who have never tried their hand at a JRPG. The result is therefore an enjoyable but unpretentious adventure that focuses heavily on gags but which does not disdain more serious tones, although it is difficult to remain impassive every time curmudgeons like Cloud or Squall enter the scene in their adorable lilichina form. The Switch version The Switch conversion of World of Final Fantasy, immediately including the Maxima update, appears more similar to the original PlayStation 4 release than to the PlayStation Vita: the latter lacked shaders and anti-aliasing, therefore returning an image quite dirty and flat. The PlayStation Vita version defended itself well, from the point of view of the hardware in question, but unfortunately it also suffered from some slowdown and too long loading especially when opening the menus. Knowing Square Enix's not-so-excellent resume in terms of conversions, our fear was that the Switch version was plagued by the same problems, instead we were faced with completely new critical issues. Net of a slightly less effective anti-aliasing in Dock mode, the Switch version is therefore practically identical to the PlayStation 4 in terms of lighting, frame rate anchored to 30 frames without noteworthy slowdowns and fast loading between a screen and the other or when opening and closing menus. Problems arise mostly when switching to portable mode, but not in the way you probably think: the resolution naturally decreases, and World of Final Fantasy Maxima loses the anti-aliasing filter and gains a kind of blur effect probably meant forblur the notorious lineups and return a less dirty image. It's a ploy that works in part because the image is actually significantly cleaner than the PlayStation Vita version, which was the reference handheld up to now, but also blurry and muddy. It is not particularly annoying, mind you, and in this sense the Switch version automatically becomes the best in portability, thanks also to the possibility of putting the game on standby at any time, a very convenient feature especially in a JRPG like this where the points of rescue tend to be particularly distant. However, we have encountered some bugs and technical problems that we hope Square Enix will solve as soon as possible with some patches, which they have not yet done at the time we are writing these lines. When switching from portable mode to the Dock with the software running, for example, the resolution does not change and the game spreads the portable image on the TV screen with decidedly lackluster results: at that point the only solution is to close the software and restart it directly in the Dock, throwing away the versatility of the entire system. Another even more worrying problem occurs when you go back to the dashboard without closing the software and open applications such as the eShop or the news page: at that point the interface faces slowdowns such as to crash the whole system, forcing the shutdown and the consequent restart... with all due respect to any pending game. Square Enix, what are you up to?", "date": "2018-11-19", "grade": "7.5"}