{"name": "A Space for the Unbound", "ref": "https://multiplayer.it/recensioni/a-space-for-the-unbound-recensione.html", "text": "It takes some time to understand why the shades of blue and light blue are dominant in A Space for the Unbound, the latest video game created by the Indonesian team Mojiken. Once you understand, you never look at the sky the same way again. The roads traveled by Atma, Raya, Marin and the rest of the vibrant cast of characters are filled with life, but also with bullying, domestic violence, oppressive expectations from their parents. The kids trapped in these 90s videogames are poised between the magic (and, at times, the horrors) of childhood and the responsibilities associated with adulthood: above them, an endless, deep, always beautiful sky, which often takes up more than half of the screen space. A Space for the Unbound is a narrative-driven point-and-click adventure, with lots of text - and excellent average quality writing - and simple but meaningful interactions with the environment and the inhabitants of the city, including a myriad of cats, essential in the expertly woven plot by Mojiken. In a world that focuses on the West and its customs, it is splendid to turn our gaze towards the East and especially towards the magnificent colors of Indonesia, where post-colonial architectures coexist with a nature capable of reflecting all the nuances of the human. Against a slight drop in pace in the central part of the game, we can say that A Space for the Unbound is a great confirmation for the Mojiken developers, who reach new expressive and artistic heights. We tell you about this extraordinary teenage adventure in our review of A Space for the Unbound. All the colors of the soul The story of A Space for the Unbound begins with Atma and Nirmala writing a short story The story opens by introducing us to Atma, a boy who attends high school, and Nirmala, a girl with a fervid imagination passionate about drawing and writing. Atma helps her little friend structure a story that Nirmala seems to care very much about, and which will be the leitmotif of the entire plot of A Space for the Unbound. Unfortunately, Atma is swept away by the waters of the nearby swollen river, only to wake up mysteriously in class, at school, and make the acquaintance of a girl, Raya, who tells him she is his girlfriend. It immediately becomes clear that the plot of A Space for the Unbound wants to leverage supernatural elements, but overall the story created by Mojiken is concrete, vibrant and current. This is because it deals with difficult topics, but manages to do it with elegance and with very little rhetoric: a useful initial warning informs us that topics such as anxiety, bullying and depression will be touched upon. There is also room for strong criticism of the school system and the expectations of parents who are sometimes forced to ask for exorbitant loans to be able to afford to send their children to school, seen as a place of ~glorified detention~, more similar to a prison than a an institution that should cultivate knowledge and sensitivity. You can see it from the oppressive architecture, from the bars present at the entrance, from the violence of the bullies under the distracted gaze of the teachers. And yet, in A Space for the Unbound there is always room for the beauty of the sky, for the spontaneous - but not obvious - affection of a kitten met on the street. It is the story of a journey dedicated to the development of the ability to take care of ourselves and others with love, in the name of the apocalyptic powers of a girl apparently like many others. If this message of mutual understanding seems contradicted by some game mechanics - beating bullies as hard as possible with Street Fighter-style combos isn't exactly the best way to teach empathy towards others - A Space for the Unbound redeems itself in some moments surprising, in which the solution lies in taking a step back and limiting yourself to listening to the reasons of the other. Here you can enter the mind of an elderly person to help him remember his brother, or help the proceedings of a court surrounded by solemn squawking geese, or even help a gamer who is passionate about arcade games beat a deadly boss, in reality nothing else that his bossy boss at work. Dive into the soul of others The Indonesia of A Space for the Unbound is a meeting place between different cultures and religions This is the central mechanic of A Space for the Unbound, aimed at allowing Atma to enter the minds and hearts of friends and opponents to discover their authentic reasons, looking for the problems that prevent them from expressing themselves fully. The Spacedive will lead us into the depths of the human soul, offering the Mojiken team the perfect assist to showcase the extraordinary artistic skills of theits members: from the kingdom of Raya's kittens to the Masterchef-like of the poor cook tormented by her grandfather's expectations, the minds of the supporting actors of A Space for the Unbound always offer fascinating ideas and suggestions, very rich in imagination. As we mentioned, there is no shortage of clashes , managed in a very simple way through combinations of keys that appear on the screen. Nothing too complex even in the point and click aspects of the title: the solutions are usually intuitive, except for a couple of more structured puzzles. In general, it is the story and the surprises of the Spacedives that keep the players' attention high for the twelve to fifteen hours necessary to complete the adventure, accompanied by secondary objectives drawn from a list of experiences to do in life compiled by Atma and Raya at the start of the game. Pixel art offers unforgettable glimpses and always maintains great clarity in what is happening on the screen; as for the music, we were delighted to discover an all-Indonesian musical genre, the keroncong, the result of the integration between Portuguese and local musical traditions starting from the 16th century: very coherent for a story that makes encounters its main theme. With the Spacedive we can enter the most hidden areas of the soul of the characters of A Space for the Unbound Too bad for the lack of an Italian translation, which would certainly have expanded the audience of potential local players for A Space for the Unbound, but this is absolutely understandable for an independent production that does not make use of stratospheric capital. The large amount of texts requires a good level of understanding of the English language, even if the dialogues are written in a plain and simple way, without excessive linguistic frills.", "date": "2023-01-25", "grade": "9.0"}