{"name": "Valiant Hearts: The Great War", "ref": "https://multiplayer.it/recensioni/valiant-hearts-the-great-war-recensione-nintendo-switch.html", "text": "Knowing the past is essential for understanding the present and designing a better world for the future: a concept that has been repeated to us so many times at school that it has been trivialized, isn't it? Yet it is enough to listen to the news, take a look at the main global events, to understand that we have learned nothing from the past. Among the many topics that are more current than ever, let's take only one into consideration: war. Perhaps we have forgotten not so much what it means to wage war, but rather what it means to live it. In 2014 Ubisoft Montpellier decided to remind us of this, using the videogame medium to reach the largest possible youth audience. Valiant Hearts: The Great War, a small, digital production, perhaps forgotten by most, lives again these days on Nintendo Switch. And with our review we want to explain why you should play it. Plot: Great War, Little Men The protagonists of Valiant Hearts: The Great War are not great generals, famous leaders and particularly charismatic figures. Instead, they are little men, very normal people who led a quiet life until the general call to arms. However, this does not mean that Emile, Freddie, Anna and Karl at the same time cannot be considered Valiant Hearts, i.e. literally ~brave hearts~, hearts that are not afraid. The four main protagonists of Ubisoft's touching and melancholic narrative find themselves in a war they never wanted, involved in the action of forces greater than themselves, each moved by personal interests, but never in the cynical sense of the term. Anna is looking for her missing father, Emile is a family man who only wishes he could go home, Karl has been estranged from his French wife and son because he is German, Freddie wants to take revenge on the Germans who took away everything he had more expensive. The story told by the developers continues tense, pressing, quickly towards its conclusion: no dead time, no uncertainty, thanks also to the excellent dubbing in Italian and the expressiveness of the narrative voices. We must also underline another very important quality of Valiant Hearts: The Great War, namely its highly educational value. Did you know that during the war of 1914-1918, chlorine gas was used for the first time, deadly on the battlefield? And that to stop it you could only resort, at the time, to handkerchiefs soaked in urine? And that for the first time both sides relied on over fifty thousand dogs trained to rescue soldiers buried in rubble, mostly German Shepherds? Valiant Hearts: The Great War contains these and hundreds of other curiosities, important facts such as the battle of the Marne and small details related to daily life, complete with historical photos. Some are immediately available from the bonus menu at the beginning of each game chapter, others will be unlocked by collecting the many collectibles hidden everywhere. The production clearly demonstrates that a video game can amuse, move and at the same time inform, enrich the knowledge of the users. The care of the historical material collected and proposed by Ubisoft is accompanied by that linked to the narratives of the events of the individual protagonists: each of them has a diary, updated by continuing in the main adventure, so that the player can take stock of the situation at any time . Gameplay: part graphic adventure, part puzzle Valiant Hearts: The Great War is a valid graphic adventure, made in a style halfway between caricatured cartoon (but never grotesque) and comic. Characters and backgrounds are drawn in a style that is now delicate now more incisive, with warm tones in quiet moments but which immediately become cold during war scenes. To continue the narrative, the player is usually called upon to solve rather simple tasks: interact with a certain element of the scenario, collect and use a specific object, operate a lever, lift a tow hook, and so on. There are also some faster sessions, in which, for example, you have to escape the fall of dangerous explosive devices on the battlefield, or dodge machine gun bursts, but the challenge level always remains low; no difference or additional stimulus even by disabling the on-screen hint system. The environmental puzzle games in which we will have to solve slightly more intricate situations do not shine particularly, even with the help of our faithful four-legged friend, because usually we know better or worse, almost always soto do already at the first superficial glance of the level; make a mistake, get stuck for more than two minutes or get eliminated by a German, that's really difficult in Valiant Hearts: The Great War. A real pity, because a slightly more demanding challenge especially towards the final stages of the game would have only done the title good, satisfying the player even more. Clearly Ubisoft has decided to invest almost all of its attention on the narrative, which however cannot remain the only valid element of a production and push the actual ~video game~ into the background. The conversion on Nintendo Switch is excellent: both in portable mode and inside the dock, the Ubisoft title is fluid and beautiful to look at, without even a hint of jerking or slowdowns. We have already had the opportunity to appreciate an excellent conversion in recent weeks with Child of Light, which also arrived on Nintendo Switch: the UbiArt engine is perfectly optimized on the Nintendo hybrid console. The introduction of the touch screen commands for navigating the menus in portable mode is also certainly appreciable, a pity that it was not also introduced in the actual gameplay: the adventure could have been even more immersive. Not that it isn't already on its own, of course.", "date": "2018-11-15", "grade": "8.0"}