{"name": "Spyro: Reignited Trilogy", "ref": "https://multiplayer.it/recensioni/spyro-reignited-trilogy-recensione.html", "text": "If we mention the development studio Insomniac Games many players will rightly associate it with Marvel's Spiderman, Sunset Overdrive or Ratchet & Clank. Before all these games, however, there was one, actually three, which indelibly marked the childhood and adolescence of many players: Spyro the Dragon. Building on the success achieved with the remake of the trilogy dedicated to Crash Bandicoot, Activision has tried to do an encore, entrusting the Spyro: Reignited Trilogy to the Toys for Bob team. No one better than them could take this responsibility since the purple dragon is one of the flagship heroes of Skylanders, toys-to-life incredibly appreciated by young players. Will the developers have managed to abandon their vision of Spyro to re-access the flame of the original titles? Below, our review of Spyro: Reignited Trilogy. Game mechanics and options The remake focuses on the first three games of the saga, namely Spyro the Dragon, Ripto's Rage (arrived in Italy in 1999 as Gateway to Glimmer but proposed with the American name in the remake) and Year of the Dragon, titles that Insomniac originally handled at the time Games before handing over the rights to co-producer at the time, Universal Studios. In terms of content, therefore, nothing is missing from the appeal, and the average duration of the titles remains the same as twenty years ago, oscillating between 25 and 27 hours of total play and concluding all three games at 100%. The Spyro: Reignited Trilogy screen opens thus giving the player the ability to manage three save slots. In each of these, the completion percentage of all three games is tracked simultaneously, showing in the background the game world where the game left off in the previous session. Unfortunately, the historical openings of the games have been cut, with the sign containing the name of the developer and the appearance of the dragon: from this point of view, the work done by the colleagues of Vicarious Visions for the Crash Bandicoot N.sane Trilogy is clearly superior. However, a few seconds of loading are enough to wipe out the disappointment of the initial screen, because the care that Toys for Bob has poured into his Spyro: Reignited Trilogy is visible in every single detail. The games maintain their conformation, with each title made up of several main hubs to which the individual game levels refer: in each of these the gems must be collected and the dragons saved, the talismans and spheres collected and the unhatched dragon eggs found. Each passage from one House (as game hubs are called) to another is interspersed with a boss fight and to access the next House it is always necessary to score a certain number of objectives. Also unchanged is the mechanics relating to the health of the character dictated by the color of Sparx, who can be fed with the butterflies contained in the animals scattered throughout the levels. The dragonfly that accompanies Spyro also helps him collect the gems: however, it seemed to us that Sparx's range of action is more limited than in the past and that the insect in general is more ~distracted~ leading the player to get lost on the street a few gems from time to time. Even the game menu differs little from the original one, offering the possibility of customizing the audio, setting the different volumes as desired, and the camera, changing it from passive to active and inverting the axes. No options relating to resolution, frame rate and HDR have been received, even if this is not a problem because visually the remake is flawless. Finally, there is the possibility of playing with both the original command interface or with the updated one which assigns instantaneous camera centralization to the left dorsal button and Sparx's gem-finding ability by pressing the left analog, which we will return to later. in the review. Technical performance: details matter Always remaining within the context of commands, the discourse relating to the feedback of the latter must be addressed, different from the original and intimately connected to the update made on Spyro. Toys for Bob is very familiar with the little dragon, but for the Spyro: Reignited Trilogy the developer has taken a step back, recovering the old design by Charles Zembillas and shaping a physical characterization that fits better with this model. Thus Spyro acquires very feline and harmonious movements: we often see him propping himself up on his front legs by lifting his rear, just like cats do when hunting, and even in the simplest movements he acquires a lightness that would not be attributed to a reptile. In addition to arousing a certain sympathy, the dragon's movements go very well with his temperament butgame feedback balances change. The original titles were characterized by a marked woodiness, while in the Spyro: Reignited Trilogy a fluidity as new as necessary is appreciated. Animation and controls go hand in hand, but the best aspect is being able to fully enjoy this smoothness using both the analog stick and the d-pad. It takes a minimum period of time to get used to, as is the case with all platformers, but once you have reached sufficient familiarity, you no longer notice it. Spyro's animations are just one of the aspects that Toys for Bob has taken care of in the reconstruction of the game and perhaps it is not the first that catches the eye when you are inside the levels. Everything has been redone from scratch and with maniacal precision: the design of every single character, enemy and pet that populates the game worlds has been revised while the scenarios have been enriched by numerous details but without becoming unrecognizable. Thus the difference between the different terrains is perceived (where the grass is even modeled in threads): each material (wood, metal, ceramic) has a realistic rendering not to mention the overwhelming quantity of visible effects at each interaction of the character with the side. However, what really marks the aspect of the game are the lights and the water, perfectly managed by the Unreal Engine 4. Although Spyro has always been a very colorful game, and in this the Reignited Trilogy does not deny itself, what was missing totally at the time it was the depth given by the shadows, non-existent. Now the plays of light are an integral part of the environment, recreating not only a truly suggestive atmosphere but interacting with the water in a way never seen before in Spyro. By immersing yourself in water, the consistency of the fluid is perceived and the amount of light present in the layer affects visibility. The totally underwater worlds, such as Torri Acquaria and Spiaggia della Conchiglia, thus turn out to be the most alien but at the same time the most successful in graphic terms. The work of addition and refinement affects both the graphic side and the audio sector. The sound effects already present in the old titles are slightly different but all well recognizable (when you hear the laughter of the Thieves a shiver will run down your spine!) while many others have been added: by straining your ear you can hear the flapping of wings of Sparx, the clicking of Spyro's claws on hard surfaces or the clatter of faun Elora's hooves. The reproposition of the original music by Stewart Copeland, curated for the occasion by the composer himself, is perfect. We Italians then find ourselves, finally, faced with an effective localization with voice actors up to the role. The voice of the little dragon does not resemble that of the past and the English-speaking pronunciation ~Spairo~ is officially cleared but an excellent job was still done both by the voice actor of Spyro and by the others. Many dialogues are practically unchanged, seeing the characters pronounce the same exact words as twenty years ago: a negative note is the presence of subtitles only in the dialogues between NPCs, where a dialogue mask automatically opens, but not in the cutscenes. Playstation 4 trophies Spyro: Reignited Trilogy PlayStation 4 Trophies are broken down by chapter. Each episode of the trilogy will therefore have its own series of objectives linked to essential passages of the events narrated, to the completion of the games and to extra challenges required by trophies such as hitting four enemies in a row or launching into some record and / or daring feat. Persevering isold school We would like to be able to close the review of Spyro: Reignited Trilogy here, without having to add any negative notes ... which unfortunately there is. We mentioned earlier that the dragonfly Sparx is a bit hasty and doesn't always collect the gems around the dragon. This issue is resolved by pressing the left analog stick, tasking Sparx with pointing to the nearest abandoned gem. This insect ability in the original games was very rare and only purchasable at a certain level of game progression, while in the remake it was offered to the public very lightly. There are two possible reasons: either there was actually a design problem with Sparx causing the insect companion to be inefficient and thus leading the developers to solve it in this way or, an even darker but unfortunately more plausible hypothesis, the addition was made to make the game less frustrating for the new generations. In our opinion, the most likely is the second one, given the long experience that Toys for Bob has gained with younger users: in short, we are talking about a developer who knows today's children well. Questhe addition, which will seem insignificant to most, totally annihilates the only virtuous value of this game. It cannot be hidden that already at the time Spyro, like Crash Bandicoot and other 90s titles, were not undisputed masterpieces: of course, they had their dignity and historical importance, but if we think that at the time of Year of the Dragon they were already milestones like Final Fantasy VII and Metal Gear Solid have been released, Insomniac's dragon pales in comparison. But a game like Spyro taught something very valuable: perseverance and patience, values that today's children seem to have lost. Not being experts in early childhood education, we don't know how educational or healthy driving an eight-year-old boy crazy about the completion rate of a game is, but many gamers today have been trained by such challenges. Some might see in this discourse the envy of former children who in their day struggled to complete the various games and therefore want to see today's children suffer in the same way but this is not the case. Ours is not sadism but a deeper examination of the nature of the game: what is the point of playing with a help of this magnitude a title that is already easy in itself, very schematic, at times repetitive and which makes ~completism~ its maximum challenge ? Because once you've seen all the game worlds and defeated the bosses there is still a lot to do if a player wants to, but that takes away part of the enjoyment. We don't want to rage too much in the face of all the splendid work done, but this detail conceptually penalizes the excellent material produced by the developers and constitutes an important starting point for reflection on the players of tomorrow. However, we want to conclude this review by telling you about the feeling that this remake conveys, using a comparison that we hope touches the same plucked strings in the soul of those who dealt with this review. Have you ever visited a place from your childhood as an adult, like the old kindergarten? Although the memory may be a little rusty, wandering here and there one realizes that nothing seems to have changed. The location of the rooms is always the same, the color table, the toy boxes, even the rack where you used to hang your backpacks, it's all there where you left it. What changes, however, is the perspective with which you look around: the chairs that were once comfortable are now tiny, the rooms that you remembered as immense are not actually that big and the sinks in the bathrooms that you used to tiptoe to as a child are now to the knee. It's all as you left it... but smaller. Not because the dimensions have really changed but because you have grown in the meantime. The Spyro: Reignited Trilogy, pad in hand, conveys this feeling of an unchanged world but which has shrunk over time because, simply, the player has become great. And this is a thousand times better than feeling like a child again because by diving into the past you lose the awareness of adulthood, while Spyro: Reignited Trilogy can be appreciated both through the eyes of a mature player and through the eyes of a twenty-year-old child does.", "date": "2018-11-12", "grade": "8.8"}