{"name": "LEGO Harry Potter Collection", "ref": "https://multiplayer.it/recensioni/lego-harry-potter-collection-recensione-nintendo-switch.html", "text": "It is already the second time that TT Games, instead of developing a LEGO-themed tie-in of Fantastic Beasts and where to find them, limits itself to re-producing the two titles inspired by the Harry Potter books and films released at the turn of 2010. LEGO Harry Potter: Years 1-4 and LEGO Harry Potter: Years 5-7 date back to a time when TT Games titles did not yet have the open world and represent, in this sense, the first attempts by the British developer of shake up the formula that made it famous. Whereas the new prequel to J.K. Rowling is about to hit the cinema these days, so it makes sense to re-propose the same compilation released a couple of years ago for PlayStation 4 and Xbox One for Switch. This means that LEGO Harry Potter now has several years on its back: will it have aged well enough? And what can Nintendo Switch offer today? Games LEGO Harry Potter Collection combines in a single software LEGO Harry Potter: Years 1-4 and Lego Harry Potter: Years 5-7, the two games that follow the cinematic - and literary - misadventures of the young British wizard, albeit transformed into a parody basis of LEGO bricks and sign language. As mentioned above, these titles date back to before TT Games began to dub its games with original audio from the films (this is the case with LEGO The Lord of the Rings) or with completely unedited jokes as happened in LEGO Marvel Super Heroes or in the latest LEGO DC Super-Villains. This means that the cutscenes that pick up the story between one level and another will be characterized by a mostly gestural humor in which our heroes express themselves in groans and grunts, making reference scenes into real parodies. The result is often hilarious, especially when it comes to making fun of the cruellest enemies like Voldemort or Professor Umbridge, but by now the dialogues are missing, mostly because the silent scenes give back a strongly retro feeling and who doesn't has seen and re-watched the original films may struggle to understand the plot. The TT Games title is especially aimed at Harry Potter fans also because it often mentions the novels and all those small details that have not found a place in the film adaptations. For lovers of the saga it is a real gem and probably the best videogame tie-in dedicated to the work of JK Rowling. In this sense, it is important to remember that we are still faced with titles designed also and above all for the little ones, simple and immediate video games that strongly focus on the collecting side of the players: the campaigns are completed rather quickly, then the levels are replayed to find the hidden bonuses. The explorable Hogwarts castle was one of the first steps towards the open world scenarios we saw later, so the LEGO Harry Potter stages are much more fragmented, divided into rooms separated by short loads. However, we are talking about two titles that trace Harry's first seven years in the wizarding world, so there are several levels to play. The conversion The LEGO Harry Potter Collection formula is always the same: you explore the stages by defeating enemies and destroying everything to collect as many bricks as possible. The bricks accumulated can then be spent on collectibles and bonuses that will help us collect even more. Once a stage has been completed and the new characters have been unlocked, it can be replayed in free mode with any combination of characters: each character has skills that allow him to solve the various puzzles, unlocking passages that perhaps were inaccessible before. Often these skills correspond to some of the most famous spells and as the game progresses Harry learns new formulas with which to challenge some opponents to a duel or overcome certain puzzles. Unfortunately the LEGO Harry Potter puzzles are not always convincing, mostly from a mechanical point of view: TT Games hasn't touched the collisions even on this occasion; in general, the British developer has limited himself to copying the code without retouching it, with the exception of the remastering work which in any case fails to prevent the years that have passed since the release of the two adventures from being noticed. The images are in fact sharper and cleaner, which all the more highlights the old-fashioned polygonal modeling and low-resolution textures. However, the game runs smoothly at 60 frames and without uncertainties in both Dock and portable mode: in the latter it gives its best because you notice less ... wrinkles in the graphics, moreover the LEGO titles lend themselves very welland portability, since they can be eaten in bites and pieces. Obviously it is possible to play in multiplayer mode by dividing the two Joy-Con, which makes LEGO Harry Potter Collection a great title to play on the sofa with a friend or a smaller relative who can elbow you every time you die.", "date": "2018-11-05", "grade": "6.5"}