{"name": "Swords of Legends Online", "ref": "https://multiplayer.it/recensioni/swords-of-legends-online-recensione.html", "text": "If in the recent test we were moderately impressed by what we saw in Swords of Legends Online, trying the final version of the game published last July 9th we were really surprised by what we saw. We tell you why in the Sword of Legends Online PC review. Swords and chains Swords of Legends Online - the game world The return of an ancient enemy, a chosen one, the chains of captivity breaking and an ancient sword capable of wounding the gods. Once again the hero's journey returns, in a different way than what has already been seen in other works, to once again consolidate the concept that it is adversity and the way in which it is faced that forge man. We had already anticipated how the narrative of Swords of Legends Online (key element of a genre that wants to anchor players to the continuous return to the game servers), was not revolutionary. Yet, after a week of play, numerous missions completed and a road that points straight towards the continued support that the developers will offer with the monthly publication of activities, new raids and end-game content, we believe that what is proposed is really fascinating and well thought out What makes the narrative of Swords of Legends Online interesting is not so much the parterre of characters and their excellent characterization, but everything that surrounds the events, giving them context, supporting the story and expanding the sensations of amazement and involvement of the player. The great value of Sword of Legends Online is the ability to always keep the player's attention to the story. The creation of fascinating dungeons, of recognizable places, is a way to realize what was previously only hinted at and delegated to the mere imagination of the player. Sword of Legends Online: A combat phase Given and considering what has been said, it is right to dwell on the artistic quality and world design of the game. From this point of view, the game offers many interesting ideas. The inspiration behind Swords of Legends Online is clearly that of Eastern mythology with a large focus on Chinese mythology. Characters, events, costumes, settings, all reflect the classic iconography of an East halfway between fantasy and fairy tale. To characterize the whole thing more, however, is a continuous and not a little veiled dark nuance that the title inserts on and off. The flow of artistic coherence is broken by these gloomy, dark sessions, dungeons, or parts of the world, which contrast with the shiny game world that often offers flashes of lush nature and opulent constructions. A continuous reminder of the eternal struggle between light and dark, a constant reminder to the player that resting on one's laurels is not a part of Swords of Legends Online. Even the sound element in this MMO is really important. The sampling of ambient sounds and the composition of the soundtrack are two highlights of this experience. Even the presence of the Bard as a class and the use of the Guzheng as a weapon (one of the most famous stringed instruments of the Chinese tradition) offer an idea of how meticulous the care for sound has been. Action and planning Sword of Legends Online: Spectacular combat Once the discourse on artistic and narrative characterization has been completed, it is time to talk about gameplay. Sword of Legends Online offers you two types of control: one more tactical and one more action. In the first, the cursor will be released from the movement of the camera, allowing you to interact with the icons on the screen and only by holding down will it allow you to interact with the view. The second plus action binds the cursor to the view, making some actions more complex. The exchange between the two can take place at any time with the press of a key and we assure you that both are useful. Our solution was to find a compromise of situations in which to use both, but the adaptation was not traumatic. Once you understand this, the game is in all respects a classic MMO with flashes of action. Skills and masteries are the beating heart of gameplay customization, and the interchangeability of classes in two roles is another focal point. The masteries are in fact what allows a class to ~sway~ between two roles: the Bard for example can move between a pure healer mastery and a dps hybrid mastery. This choice is made to ensure more variety of approaches in parties but also to favor the single wolf game. In total you will have six classes: Bard, Spellsword, Summoner, Spearman, Berserker and Reaper. The characterization of these six is really maximum and the progression of each one is also well thought out. Precisely to this propositionito we want to underline that the game is absolutely not pay to win and therefore the enjoyment is extreme also with regard to PvP. Sword of Legends Online: let's go into action On a mechanical level, the fight revolves around the main and secondary attack mapped on the left and right mouse keys and on the series of skills distributed on keyboard keys. You will customize the mapping according to your convenience. What we can tell you is that from the point of view of combat fun, Sword of Legends has nothing to envy to the more famous World of Warcraft or Final Fantasy XIV. dodging will become paramount. Frenzy, strategy, but also combat animation, everything is really satisfying. An honorable mention must be made for the mobility of the character. By playing you will be able to move and jump in a stratified and satisfying way, you will be able to perform stunts worthy of the best principal dancer at La Scala and once on your mount (there are really bizarre ones) you will also have the possibility to move vertically. We assure you that this point has repeatedly been a source of joy in migrations from one point to another. Sword of Legends Online: The Summoner in action Moving parallel to the component of the combat system and classes (we remind you that the character can also be customized on an aesthetic level with an excellent editor), we find the playful offer. Swords of Legends Online not only presents the classic story missions - main and secondary - but also puts dungeons, raids, mini-games on the plate and a series of more marginal contents compared to the narrative experience which, however, are just as important. Let's talk about housing and PvP. If the second (of which there is not much to say) is instantiated in certain areas of the game and can be skipped completely, housing is something more tantalizing and we are sure that it will be avoided less. The possibility of building your home on top of the clouds is not a trivial matter and the possibilities offered are immense. We go from the structure of the terrain to the creation of the interior. You will have hours of entertainment at your disposal, if you are a lover of these solutions, an alternative to the classic hours spent tackling missions and fights.", "date": "2021-07-16", "grade": "8.8"}