{"name": "Perfect Grind", "ref": "https://multiplayer.it/recensioni/perfect-grind-recensione.html", "text": "Skateboard games are a sub-genre that was really strong twenty years ago: the possibility of exploiting the three dimensions represented a substantial novelty and the developers tried to explore it more and more convinced, which gave a certain freshness to all the productions that pointed in that direction, even the sports ones. Fans of the old guard remember both the classic Tony Hawk's Pro Skater and the cartoonish Jet Set Radio: titles that undoubtedly inspired the tiny Flying Pants Games team, formed by just two people, who took cel-shaded graphics and an elaborate trick system to bring their own version of that kind of experience to iOS and Android. Does the final result stand as a perfectly executed acrobatic maneuver or as a grind gone wrong in which you get your testicles back? We tell you about it in the Perfect Grind review. Old school gameplay Perfect Grind, a trick performed on the fly on the ramp The Perfect Grind references are clear right from the start and the developers have managed to reduce that type of setting effectively on the touch screen: with the device strictly vertical, in portrait mode, it is possible to use a finger to move the view and see your character start, who at that point will move automatically until we carry out a maneuver to stop him. We will therefore be able to head towards ramps and railings, jump and let the system automatically hook us to the ledges, then managing the balance of the grind through a simple indicator or by performing mid-air tricks or held rotations that clearly require a good landing in order to be successfully landed and recorded the total score, and then move on to the next challenge. Although the mechanics of the gameplay do not appear particularly refined, and indeed the automatic movement ends up making the management of the character a bit chaotic and imprecise, also highlighting collisions and sketchy interactions, after a while you become familiar with the philosophy basis of Perfect Grind and having fun, provided obviously that you appreciate this type of formula. its time and which could immediately appear to you as ~already seen~ if years ago you dedicated several hours to the various Tony Hawk's Pro Skater and Jet Set Radio. In short, the ideas that you will find in this game are not exactly fresh and you could feel the pinch ... or fall in love with it, it's up to you. Structure Perfect Grind, here are the grinds and how to perform them The Career mode, which represents the fulcrum of Perfect Grind, will see us choose a skater among those available (with the possibility of unlocking others using the coins earned up to that moment), complete a short tutorial and then launch ourselves into some scenarios with the aim of completing the missions that will be assigned to us by the NPCs with whom we will find ourselves interacting, as part of a sort of rewards path that allows access to the subsequent maps. The game can be downloaded for free from the App Store and Google Play, although by paying 3.49 it is possible to unlock a couple of extra modes (the Free Skate score challenge and the Park Editor) and eliminate the advertising trailers, which actually arrive a bit suddenly and end up breaking the rhythm of the action. Our suggestion is undoubtedly to try the game and reward the authors if you intend to spend some time there. Technical realization Perfect Grind, our character interacts with a non-player character who provides him with new missions As mentioned at the beginning, among the inspirations of Perfect Grind there is also Jet Set Radio, a great classic of cel shading graphics: a technique that we also find here, used in a more than discreet way to add character to the various characters available, some of which quite absurd (see the, uh, anthropomorphic banana). Unfortunately, the scenarios cannot count on the same thickness and indeed appear generally empty and dull: a pity. Little to say about the sound sector, made up of some music and very simple effects, which however go silent at the first commercial break: a glitch that we found during our test on the iPhone 14 Pro and which we hope the developers will fix as soon as possible through an update.", "date": "2023-01-20", "grade": "7.0"}