{"name": "The Missing: J.J. Macfield and the Island of Memories", "ref": "https://multiplayer.it/recensioni/the-missing-jj-macfield-and-the-island-of-memories-recensione.html", "text": "After Deadly Premonition and D4, Swery has probably spent a lot of time playing the works of PlayDead. We feel like saying this, because the great change of perspectives and the substantially reduced budget of The Missing: J.J. Macfield and the Island of Memories, are so closely reminiscent of Inside, as to almost give a strange sense of dj-vu. Certainly this can only be a source of pride, considering that the work in question is among the best 2D experiences of recent years, also capable of touching the deepest chords of the human soul with difficult and dramatic themes. The game by Swery and his team, on the contrary, tries to dig into the problems of the life of a young woman, with a soul that is probably more childish, but who desperately tries to take control of her own life. With an extremely particular 2D puzzle game structure and a fragmented narrative entrusted to the player's attention and discovery, The Missing is a strange, particular work that is difficult to digest by the general public, but which once again confirms the great ability to a designer to tell a story in an extremely personal way. After all, these are the dynamics of authorship, and we are more than happy about it, net of all the smudges. I'm J.J. and this is my story The adventure begins in the middle of a two-girl outing on the shores of an island off the coast of Maine, in eastern America: a place extremely familiar to all lovers of the king of thrills, the Stephen King who somehow tainted Swery's work with regards to atmospheres. J.J. is the protagonist, a young girl with long blond hair, accompanied by her lifelong friend Emily. The relationship between the two is close, it would even seem to go beyond the limits of friendship and for this reason they find themselves several times alone to escape to the Island of Memories, telling each other and confiding their most intimate thoughts. Waking from sleep, Emily appears to have disappeared and J.J. goes in search of her friend. From here a particular story unfolds, narrated mainly through the messages that are regularly delivered to JJ's cell phone, and which also tend to bring up old conversations with her mother (who constantly pushes her to study and make her way in the life that matters) and some friends and acquaintances. Peeping out among the new contacts is F.K., a sort of toy that seems to have come to life and that behaves like a kind of nice stalker, despite the constant requests from J.J. to leave her alone. The approximately five hours of progression therefore advance in this way, between a puzzle and a new message, relegating the possibility of deepening a background to the player's will which, if ignored, almost completely compromises the pleasant use of a particular and intimate title. We certainly can't nor do we want to spoil the surprises for you, but know that The Missing boasts an ending with a rather interesting twist, which closely recalls the madness and genius of a particularly clever designer like Swery. What is only partially appreciable, from a narrative point of view, is the lack of propensity for in-depth analysis outside of messaging, which risks damaging the production with a series of dead moments that break too much the rhythm of a rather spot-on progression . I'm dead, but I'm not dead The gameplay of The Missing is extremely particular. It is to all intents and purposes a horizontal scrolling puzzle game, managed through a series of sections and environments that follow one another without interruption and which put a considerable amount of different methods on the plate to be solved. Certainly the level design, despite an extremely small production, is able to appreciate some interesting moments in the progress of the title. However, what is both disturbing and ingenious at the same time is the idea of transforming the body into a full-fledged weapon for the first time. J.J. in fact he finds himself immortal at any moment, discovering it at his own expense in the first bars of the adventure. This possibility allows the title to play with the body parts of J.J. as if they were real throwing objects, or simply with the possibility of becoming so small (it goes as far as the survival of the head alone) to pass through spaces that were previously impossible to reach. Very important in this sense is physics, for years the workhorse of puzzle games, here too it takes over, giving many satisfactions when it comes to completely overturning gravity following a particularly violent death. This change of plane and perspective affectsthe whole surrounding environment and on objects, making movements and actions available that were previously impossible to perform. With the simple push of a button it is then possible to return to normal, giving color again to the dull body of J.J. and seeing her run as before. Speaking of this, it should be noted that the movements of the protagonist and the related animations are deliberately woody and long over time, generating a particular feedback pad in hand and giving J.J. a humanity that is difficult to find in works of this kind. All is helped by the progress of the deaths, necessary but painful, capable of transmitting all the agony of the action, thus managing not to turn into a mechanical game of death and resurrection. We empathize with the pain of the protagonist and regret the awareness of having to collide again with demolition balls or rotary saws, aware however of the need inherent in the continuation of his research, more important than the pain itself. It is precisely this aspect, intimate and almost sadistic, that makes Swery's work a jewel from an authorial point of view, managing to overshadow a general quality of the production that is certainly not exciting, especially from a technical point of view. The puzzles follow one another without too much difficulty, net of a couple of decidedly too bizarre sequences compared to the rest, and accompanied by a few moments of escape from the only real boss of the adventure, which are the least successful of the whole game. The technique that does not dazzle As mentioned above, from a technical point of view, The Missing puts all its limits on the plate. It is a low-budget production which however does not tend to hide the paucity of some textures and the modeling of the levels, far from works such as the aforementioned Inside. To put things right there is certainly an interesting stylistic figure and a successful dark atmosphere, but which does not hide the independent nature of the product. Different speech as regards the sound field which, as mentioned, tends to reproduce the sounds and agony of J.J. almost frighteningly realistic. These are the elements that somehow allow you to go beyond all the limits of the case, still giving a pleasant and interesting experience, albeit in some way less incisive than the previous works of the Japanese author.", "date": "2018-10-17", "grade": "7.8"}