{"name": "Child of Light Ultimate Edition", "ref": "https://multiplayer.it/recensioni/child-of-light-ultimate-edition-recensione-nintendo-switch.html", "text": "In 2014 Ubisoft came out on consoles and PC with two smaller titles than the publisher's well-known giants, but with so much charisma that they are still remembered today by most players: Child of Light and Valiant Hearts: The Great War. Nowadays, if someone remembers a game almost five years after its first appearance, it means that the title has somehow marked him, has left something precious in his memories. This is the case of Child of Light, at the time a small light of hope and originality in a landscape dominated by productions that are often too similar, and which is back these days on Nintendo Switch with the Child of Light Ultimate Edition. Fairy tales never get old: they continue to be told because they always keep their magic. Child of Light has also kept its magic, it has only moved it to the latest Nintendo console - let's rediscover it in our review. Plot and Gameplay: a fairytale RPG Austria, 1895: it's Good Friday and little Aurora falls into a deep sleep similar to death. He awakens in an enchanted world inhabited by mysterious creatures, some adorable, some decidedly dangerous: it is the Kingdom of Lemuria, threatened by Evil and the witch Umbra. Aurora, at first alone and disoriented, receives a good dose of aid as foreseen in the most classic fairytale narration: a sword with which to defend herself, and the tender Lucciolino as a companion. The mission to save not only Lemuria, but the whole of Austria begins: Aurora must come back to life and reunite with her father in danger, in a clash between good and evil, between light and darkness. Only the child of light, the Child of Light, will be able to make a difference: but will she be able to discover the mysteries related to Lemuria and the Umbra Witch? Today like four years ago, Child of Light immediately kidnaps not only little Aurora, but also the player in her enchanted kingdom: the title could be tasted and completed even simply to enjoy its melancholic, fairy-tale narration, capable of making players of all ages become children again. But the gameplay is equally valid, apparently light and carefree, in reality much deeper and more tactical than it might seem at first glance: Child of Light is an RPG with an oriental style developed by Westerners, divided between platform sessions dedicated to exploration alternating with actual combat phases. The clashes take place strictly in turns: all the characters are in position, the good party on the left and the bad guys on the right, and await their turn to act. The actions are marked by the ATB bar: each turn first requires a waiting phase and then one dedicated to the execution of one's moves, which can be the replacement of a member of the group with one of those on the bench, the use of a tool magic, physical attack itself, or a spell. Child of Light seems to offer simplified clashes, but it is not like this: while never reaching the levels of complexity of the other famous exponents of the genre, each battle offers good possibilities for variation and different strategies. Every enemy and game character is weak against certain attributes and resistant to others; your party members specialize in something and possess unique abilities; weapons, armor and equipped items can be upgraded with Oculi, which provide extremely interesting additional bonuses, including more experience points in battle or weaknesses and resistances towards certain enemies. And then there's the real touch of Child of Light: Aurora's little friend, Lucciolino, can use his light to blind enemies during the waiting phase, slowing down their actions and bringing the protagonist and her allies into advantage. A must-have feature at the highest difficulty level. The conversion to Nintendo Switch So far we have told you some of the many reasons why you should give Child of Light a chance, if you haven't already done so in the past: a literally fairytale storyline, told and dubbed in excellent rhyming Italian; an accessible combat system, but also fairly deep and satisfying. To explain the third reason why we return to recommend Child of Light, we need to address the issue of conversion on Nintendo Switch, which turns out to be not excellent, but definitely valid. Child of Light was and still is beautiful to see: the Nintendo Switch docked mode returns Lemuria at 1080p and 60FPS with very high graphic detail, unforgettable backdrops, fluid and enchanting animations, once again just as if we were in a fairy tale. The UbiArt engine is able to give great satisfaction, and the latest Rayman Originsand Rayman Legends have amply demonstrated this. In a work that seems completely hand-drawn and in which the combinations of delicious pastel colors make the game world alive and melancholic, never as in this case is it important to have a dignified conversion. And Ubisoft did it, because on Nintendo Switch Child of Light is technically and artistically speaking an excellent port. We found some uncertainty, however, in portable mode. With Nintendo Switch out of the dock, the visual rendering remains excellent, but the frame rate begins to show some small hesitation: nothing serious, and it is good to repeat it once again, these are absolutely not flashy problems or capable of compromising the gaming experience. But yes, in portable mode Child of Light is not as beautiful as in TV mode: but you only notice it because the title has accustomed us to excellence in almost all its aspects. Finally, keep in mind that Ubisoft's little gem arrives on the Nintendo console with all its additional content that you might have missed along the way: the additional mission ~The problem of the golem~, the inked Aurora and Princess of the Wind skins, a bag with many oculi already available at the start of the game, a healing ability exclusive to the protagonist and a bag of bonus stardust.", "date": "2018-10-15", "grade": "8.8"}