{"name": "Mountain Climber: Frozen Dream", "ref": "https://multiplayer.it/recensioni/mountain-climber-frozen-dream-recensione.html", "text": "Mountain Climber: Frozen Dream opens with a story told in English, about a cheerful, successful couple with high expectations for their children except for one. And so, while his brothers become skilled mountain climbers, Sammy seems to have to resign himself to being a short, fat and out of shape boy. However, his passion, his determination and a big heart will allow him to perform extraordinary feats. Of course, it will be up to us to make them come true, in this distinctly hardcore platformer, which closely resembles the atmosphere and style of another successful indie production, Celeste. The two titles share the alpine setting, the retro graphic style (although in the case of Mountain Climber there is much less ~softness~ in the animations) and the vocation for deadly traps that can determine the game over within a few failed attempts. frustrating our efforts and bringing us back to square one... unless you have an extra heart to spend or you agree to watch a short advertising film to get a new chance. The game's campaign is made up of five increasingly complex levels, in which new pitfalls are gradually introduced to deal with. We therefore pass from the spikes on the icy walls to the unstable blocks, under which it is better not to hesitate; from moving platforms to deadly moving mechanisms. The control system appears particularly immediate: holding the device vertically, just use a single finger on the touch screen to make the character jump or make a quick forward dash. The movement to the right or left is automatic, so all we have to do is bounce from one surface to another, but choosing perfect timing. A challenge too simple? Far from it. Gameplay and advertising Mountain Climber: Frozen Dream is inspired by Celeste as mentioned, but in some sequences it also recalls the controversial Flappy Bird due to the ruthlessness of an approach that tolerates very few mistakes and punishes us, at least virtually, by filling us with advertising. The promotional trailers are actually too many, we don't remember another mobile game that contains such frequent ones, and the only way to eliminate them is to buy a package priced at 4.49 euros: a lot, if we consider the brevity of a campaign that succeeds to entertain for a certain amount of time solely due to the high degree of challenge. The difficulty of some passages could discourage those who are not used to this type of experience, as well as excite those who are looking for games that can put them to the test; but whatever your personal sensitivity in this regard, there is no doubt that on the monetization profile we have exaggerated: the continuous appearance of advertising videos breaks the rhythm of the action and could soon make you want to continue. And it's a shame, because at least the concept of Mountain Climber: Frozen Dream, its atmospheres and the underlying message would have deserved a better valorisation. From a technical point of view, a decent pixel art work has been done and it is also interesting to see the dithering in the background to simulate a narrow color palette, as happened at the time of 8-bit platforms. However, there is a basic rigidity in the animations that creates a great distance from the comic and very pleasant solutions of the aforementioned Celeste.", "date": "2018-10-10", "grade": "6.5"}