{"name": "Assassin's Creed Odyssey per PC", "ref": "https://multiplayer.it/recensioni/assassins-creed-odyssey-pc-recensione.html", "text": "Assassin's Creed Odyssey takes the rich legacy of Origins and builds on those same foundations an experience ever so rich, immersive, capable of taking the sense of discovery that we find in the Ubisoft franchise to a new level. Thanks to the new exploration mode, which once activated minimizes the suggestions and lets us discover the areas of interest for each mission on our own, supported as usual by the eagle search function (Icarus, in this case), it's nice to climb into saddle your horse and embark on adventurous excursions in the Greek hinterland, visiting new and fascinating places we did not know existed. The year in which the story of Assassin's Creed Odyssey is set corresponds to the beginning of the Peloponnesian war, which saw Athens and Sparta face each other in a violent way, and it is precisely in this dramatic context that our character will find himself operating, offering your services as a mercenary to the highest bidder, whether of one faction or the other. It is also the first episode of Assassin's Creed in which we are initially asked if we want to play the role of a male or female protagonist, Alexios or Kassandra. Whatever our choice, the structure of the plot does not change: the two brothers will switch roles and will have to deal with the same events and the same supporting actors. The new and more in-depth RPG approach, with multiple-choice dialogues, the romance element and the system of choices and consequences, will however change the course of events also in an important way, allowing us to characterize the protagonist in a different way and finally reach to one of nine possible endings. To get there, however, it will take dozens and dozens of hours in which we will get to know our character more deeply: a renegade Spartan, who survived by a miracle after being thrown down a mountain as a boy. Having taken refuge on the island of Kefalonia, as an adult he will inevitably have to face his past. Characters, missions, structure and gameplay For this second walkthrough of Assassin's Creed Odyssey we opted for the male protagonist, Alexios, finding him surprisingly similar to the Assassins seen in previous installments of the series. Unlike Kassandra, we set out to design him as an arrogant and ruthless mercenary who doesn't hesitate to kill his opponents and who takes revenge very seriously, but reluctantly goes the extra mile to help those in need. In short, a sort of anti-hero and we are very curious to see where the choices we are making on his behalf will lead us: we will be able to explore the question of crossroads and differences in the coming days. The game map is literally huge, full of different activities that alternate between main and secondary missions, the latter featuring much better narrative elements than usual, as well as characters who will remain with you in one way or another. And it is not little, indeed. After all, Odyssey can count on a very thick lore, in which historical figures such as Herodotus, Socrates, Hippocrates, Thales and many others find their place, who alternate with unpublished but generally interesting supporting actors, with whom perhaps to entertain a love affair. This specific aspect of the experience is sometimes an end in itself, but there are times when it actually adds something to the plot or characterization, and that's enough to appreciate the introduction. The campaign consists of three different storylines that can be completed individually, but the structure of the quests makes it impossible to proceed quickly towards the conclusion: at some point you will have to deal with too strong opponents and you will necessarily have to dedicate yourself to some side activity to be able to level up and/or unlock new skills that can allow you to stand up to these threats. Fortunately this element, which is often found in action RPGs, is not imposed as an end in itself, but finds support in the large amount of things that can be done within the map: clean up enemy positions, weaken the two warring factions , engage in large-scale engagements or spectacular naval battles. These last features contribute to making the experience of Assassin's Creed Odyssey more full-bodied and varied compared to that of Assassin's Creed Origins, already extraordinarily full-bodied in itself. Speaking of the episode set in ancient Egypt, on the gameplay front the link with this new adventure is evident: the revolutionary layout of the controls is reaffirmed and enriched with new facets, which allow you to parry or dodge at the last minute.or moment to activate a bullet time thanks to which to sink several shots against a defenseless opponent. At the center of the combat system, however, there are special abilities, which are unlocked as you level up and which allow you to shape the character by activating moves related to three different approaches: Hunter, Warrior and Assassin. This means that you can favor the attack from a distance with charged and aimed shots, paralyzing or poisonous, or emphasize a stealth approach by improving silent kills, the ability to move without making noise and to perceive the environment. Or again you can focus on face-to-face clashes, activating moves such as the iconic spartan kick (very useful if you want to make someone fall from a raised area), a frontal charge, a spectacular finisher or the possibility of using fire, poison or other to temporarily make your shots more effective. For further details, we refer you to the review of Assassin's Creed Odyssey for PS4. The PC version At its best, Assassin's Creed Odyssey offers an extraordinary spectacle on PC. Naturally, high-end components are needed to achieve this type of result, but 1080p with ultra settings and 30 frames per second should be within the possibilities of many users, delivering an experience with the same consistency appreciated on PlayStation 4 and Xbox One. but visually richer and deeper. Once the HDR has been deactivated, which makes the colors of the game more realistic but substantially less vibrant, the scenario that opens before our eyes is quite suggestive and it is a pity that we have only been able to capture a few screenshots in the Phocis region, after trashing all those saved with the high dynamic range active due to exaggerated saturation. Just like in Assassin's Creed Origins, the most evocative scenes are those that take place in the morning or afternoon, when the sun casts splendid shadows on the streets and buildings, perhaps filtering through the trees. The series has unfortunately detracted from the practice of running on the roofs for a while, and it's a shame because in Odyssey jumping from one house to another still offers an excellent show between colors, shadows and tile thickness. All the images that you see accompanying the article were taken at a resolution of 2160p and with all effects at their maximum, therefore they represent the game in its best guise. But how does the PC we used manage to run such graphics? As seen in the benchmarks of Assassin's Creed Odyssey, not even an RTX 2080 Ti can handle the new Ubisoft title at 4K maxati and 60 fps fixed, not having the margin necessary to guarantee these values in any situation. In our case, with a good but not extraordinary processor (i5 6600K @ 4 GHz) and a GTX 1080 Ti, the test scored 39 frames per second on average, with a minimum of 27 frames and a maximum of 58. That means, and we have verified that it is possible to play basically in two ways. The first option is to keep all settings maxed out, for the highest possible visual quality, while always staying above 30fps. As mentioned, it is a similar value (actually mostly higher) than that appreciated on consoles, however net of a superiority in terms of definition, effects, lights and shadows. The second option, more multifaceted and subjective, instead provides for some sacrifices in order to reach the range of 60 frames per second. Wanting to stick to the 2160p resolution, it is possible to completely disable antialiasing (or activate a ~hardware~ FXAA from the NVIDIA options panel), lower the quality of the shadows and volumetric clouds: this is enough to play at an average of 50 frames per second without major problems. Where instead you don't want to give up any effect, the now traditional scaler is present which decreases the native resolution while leaving the output intact: in our case it was necessary to go down to 50% (therefore at real 1080p) to appreciate a frame fixed rate at 60 frames but keeping all the adjustments at maximum. The day one patch will definitely improve performance, adding some valuable headroom. What we can say is that, played with greater fluidity, Assassin's Creed Odyssey behaves much better, especially when you have to dodges and parries at the last second. The options currently available for graphics are the same seen in Origins and allow you to change resolution (with relative scaler), v-sync, fps limiting, general quality, adaptive quality (which acts only on antialiasing and not on resolution).one in its entirety, proving to be very ineffective at maintaining a specific frame target), antialiasing and shadow quality, environment and texture details, terrain, random elements, fog, water, screen space reflection, volumetric clouds, texture details and quality for characters, ambient occlusion and depth of field. In short, quite a few options that allow a certain freedom when it comes to adjusting the various parameters to obtain the best result according to our needs. One last but important note: thanks to the use of an SSD, we appreciated extremely faster loading on PC than the console version.", "date": "2018-10-04", "grade": "8.8"}