{"name": "Colossal Cave", "ref": "https://multiplayer.it/recensioni/colossal-cave-recensione.html", "text": "A video game enthusiast can only love the Williams spouses. What they achieved in the 80s, the peaks they reached with some of their titles and the way they conceived video games are inevitable landmarks that deserve to be remembered forever. So their return to the gaming scene after many years of hiding, caused by the sale of the company they had founded, Sierra Online, and by the profound and destructive reorganization of the same, can only be cause for celebration. After all, how can you not dream of Roberta hand-drawing the images of Mystery House creating the first graphic adventure in history? How can we not thank her for the King's Quest series and for Phantasmagoria? How can we forget Ken Williams' policy of placing productions completely in the hands of the authors? It's not just a question of looking to the past, but more of knowing how to distinguish the moments of the past on which the present is based. Precisely for this profound respect that the two deserve, it is really difficult to write a review of Colossal Cave. Why Colossal Cave? Inside the cave is a little bit of everything Before proceeding, it is important to shed some light on the project and its origins. Colossal Cave is nothing more than a modern version of Colossal Cave Adventure, the first text adventure of the story written by Will Crowther in 1976, which owed its name to the Mammoth Cave in Kentucky, of which it reproduced part of the topography. In particular, the map copied the entrance, called Bedquilt, and the Colossal areas. The objective of the game, which is the same as the 3D makeover, was to enter the cave, find as many treasures as possible and then exit, accumulating points linked to the player's actions. The protagonist was an adventurer in search of fortune without particular characterizing elements (in fact it was the player himself who played him). Colossal Cave Adventure was a very important title for the world of video games, not only because it launched a genre, but also because it was the first to discover the narrative potential of the medium, making the interaction the protagonist, despite playing with a completely textual interface and the places visited were only described. Widespread at the university level, it became very well known in the then restricted circle of those who had access to computers. Roberta Williams was an avid player of Colossal Cave Adventure, in Don Woods' version (which added score and several fantasy elements inspired by Tolkien's works such as The Hobbit and The Lord of the Rings trilogy). It was to the point of letting herself be kidnapped for days and days, until she finished it, then inspired, thus developing the idea of writing an adventure too, getting help from her husband Ken for technological issues. In fact, Crowther and Woods' game marked the beginning of Sierra Online. All this preamble serves to make it clear that the relationship between the Williamses and Colossal Cave Adventure is deep and well-rooted, to the point that when Colossal Cave was announced, those who know them considered it more a way to reconnect with that part of their story than they had abandoned, that to make money. Here come the problems, because if as a sacred act the game is understandable, unfortunately it has too many things that simply don't work. Out of time There is also a pirate in Colossal Cave As we mentioned, Colossal Cave is an attempt to translate the historic text adventure into 3D, but in doing so we forget, probably even consciously, that more than forty-five years have passed since then. We mean: a player of that time may also find it nice that the ~look~ command becomes an eye-shaped cursor which, when clicked, provides a generic description of the place where you are, with references to the objects looked at directly (if useful), but a new player will be led to wonder why such a function, given that the object is clearly visible in front of him and is well recognizable. The interface as a whole is a kind of large citation of the text parser of Crowther's game, but as we said it will leave those who have not tried that experience completely indifferent and, indeed, will create annoyances, because it mixes a bit the collection and use of objects linked to verbs is obtuse, with WASD commands that are not exactly optimized (if desired, it is also possible to play only using the mouse). For example, we already imagine many wondering why they have to turn the flashlight on and off in the inventory, why the slots for items are so limited and what is the point of scoring in what is basically a point and click adventure. In Colossal Cave there are definitely beingsyou fierce At the same time, some steps to be able to get all the treasures will seem abstruse, where in the text adventure they worked perfectly. Oh yes, because the Williams have chosen to keep the same structure, forcing the player to go back and forth to pick up and drop off some objects, due to the limited inventory. Now, in the original it was a matter of writing ~n, s, w, e~, i.e. it didn't take much to return to places already visited, especially when you knew the map well. Here things get more complicated, in an era in which the player will not immediately understand that he has to leave the silver nugget placed at the beginning, and then return to pick it up at a later stage. It is true that you are not obliged to find all the treasures, even if that is the goal, but certain delays are now unbearable, especially in the face of a fairly large game environment, made up as it is of fifteen areas. Graphically Colossal Cave is what it is The main problem with the game, however, is that paradoxically a great deal has been lost in the translation from text to 3D. Colossal Cave Adventure doesn't render well when shown. It was a game made up of about 700 lines of code, whose texts were often very short so as not to take up too much space. There is a world of difference between reading: ~You are standing at the end of a road before a small brick building. Around you is a forest. A small stream flows out of the building and down a gully,~ and seeing the building , the stream and its surroundings in a 3D world. What, when described, questioned the player about his first move to make, projecting him into the adventure with a few words, now that it is viewable appears as miserable as it is unnatural, because it was built paying little attention to likelihood, also thanks to a very flat graphic style and an overall quality of 3D objects that really leaves something to be desired. It seems to be faced with a game of a few years ago made by fans ... which if we want is the truth, since the Williams are and do not seem to have thought too much about the transition from text to 3D, limiting themselves to celebrating the game wich was. The place is not the most reassuring This is not to deny that Colossal Cave has its moments too. A longtime player like the writer has experienced no small pleasure in the face of certain quotations or the classic solutions adopted for certain puzzles. But precisely because, coming from that era, he didn't need help to understand many choices. In a sense it is something already chewed and digested. At the same time, however, it was impossible to deny that we are dealing with something that has reason to exist only as a manifestation of part of some people's psychic universe. A little bit, to aspire to the greatness of the original.", "date": "2023-01-18", "grade": "4.0"}