{"name": "Assassin's Creed Odyssey", "ref": "https://multiplayer.it/recensioni/assassins-creed-odyssey-recensione.html", "text": "Assassin's Creed Odyssey is a terrifyingly large game. The developers of Ubisoft Quebec started from the solid and extensively renewed foundations of Origins to pack an incredibly rich experience, which improves the gameplay in some respects and makes certain mechanisms related to the combat system more coherent, now more focused on special skills. The news, however, above all concern the setting of ancient Greece, literally huge between the hinterland and islets, and the fascinating lore represented by the most representative historical figures who lived during the period of the Peloponnesian war. This results in varied and narratively challenging subquests, the interesting introduction of the romance element, the return of the Black Flag-style naval sections and the addition of large-scale battles that closely resemble what was seen in For Honor . A ~real~ Assassin's Creed? There is no doubt: after the conclusion of the Desmond Miles storyline, Ubisoft seemed to have completely lost track of the situation, negligently neglecting the events of the plot set in our times and picking up the thread only with the last episode. Before going into the Assassin's Creed Odyssey review, we would therefore like to answer some of the questions that fans of the franchise will certainly be asking themselves. Odyssey continues the story of Layla Hassan? Yes, even if not in a concrete way. Is this a ~real~ Assassin's Creed? Depends. The series has recently taken a different turn, more devoted to exploration and adventure, however going to materialize what was the original vision of Patrice Desilets, that is a large and fascinating world, with many new situations to come across by going tour. Last question: why set the game in a historical period in which the Assassins and the Templars did not yet exist? The answer here is quite clear: to discover the secrets of the Pieces of Eden and the First Civilization, closely linked to the Greek world. What honestly surprised us was finding ourselves faced with a product that was anything but sketchy from a narrative point of view: net of a direction not yet at the level of the best videogame productions, which unfortunately often badly manages sequences that would have benefited from and different ways, the story of Odyssey is not a simple expedient to justify the setting, but an engaging story, with visceral traits, full of human contradictions (do you know the fact that you can fight for Sparta or Athens indifferently?) and excellent characterizations. Story and characters Assassin's Creed Odyssey is the first installment of the series that allows you to choose whether to face the adventure with a male or female protagonist. After opting for the canonical option, Kassandra, we shaped her character through a series of important choices, portraying her as an extraordinary but loyal fighter, fiercely homosexual, who does not shy away from emotions but rather often lets them carry her and applies this philosophy also to the thankless trade of mercenary (~mysthios~). Hers is a disturbing past: born and raised in Sparta, as a young girl she survived by a miracle when her father threw her from a mountain, guilty of having tried to save her still infant brother from the condemnation of an oracle. Carrying an important family relic, the legendary spear of Leonidas, Kassandra managed to reach the Greek island of Kefalonia and there she was welcomed by Marco, a sort of small businessman very good at getting into trouble. At the beginning of the game we get to know the protagonist and some side characters (Marco himself, the little foundling Phoebe), gradually being involved in a chain of events that will lead us to leave aboard a ship of our own, the Adrestia, to complete the mission commissioned by a mysterious Greek tycoon. The matter soon takes on the contours of a family matter for Kassandra, but there is no need to reveal further details: net of some not exactly brilliant aspects, especially towards the end of the main storyline, the plot of Assassin's Creed Odyssey is there liked: the authors have intelligently used the ~lore~, the Greek mythology and the revelations concerning the Isu to build a story that flows coherently, without acute details but at the same time without the flaws to which the series had accustomed us. A better or worse narrative component than Assassin's Creed: Origins? The question is very subjective: Bayek's saga was based on revenge and the sacredficio, supported by atmospheres that this new chapter fails to replicate, perhaps also due to a less marked artistic personality. Of course, those who are eager to get to the point immediately will have to deal with a structure that effectively prevents them from proceeding straight forward, making it essential to complete some side quests from the perspective of parallel macro missions, each with its own conclusion. Assassin's Creed Odyssey requires over forty hours of play just to get to the end of the main storyline, it natively uses the enemy self-leveling system that Origins had introduced with an update (thus avoiding that some initial missions, tackled later, prove too easy) and, in general, it can keep you company for a month or more, depending on how much time you want to dedicate to it. In short, an incredibly full-bodied experience, which however manages to never lapse into boredom thanks also to the solidity of a truly suggestive cast of supporting actors. We will find ourselves dealing with figures such as Hippocrates, Socrates, Pericles, Herodotus or Thales, to name just a few, but also with unpublished and equally fascinating characters, with whom we may eventually decide to establish a relationship. There was great curiosity around the romance element of the new Assassin's Creed, but we can say that it is an appreciable feature, certainly welcome: triggered by specific dialogue choices, most of the amorous encounters take place behind strictly closed doors, but some sequences take a few more liberties and manage to convey beautiful emotions. Controls, weapons and items It became clear from the announcement of the game that the backbone of Assassin's Creed Odyssey was the same as that of Origins, but as mentioned, this new episode introduces some important innovations also in terms of gameplay. The controls are the completely renewed ones with which we are now familiar, with the back keys for light attack, activation of skills and parrying (by pressing them together at the right time), the left trigger to use the bow and the right one to perform a heavy attack. The lack of coherence with respect to the silent killing, assigned to the Triangle key, appears less marked this time, also thanks to an enhancement of the maneuver itself (which can be upgraded together with other moves, including a more effective stealth killing that consumes an adrenaline bar). On the inventory front in Assassin's Creed Odyssey a simplification has been made in relation to the bow, which is no longer divided into various categories but belongs to a single type: to shoot special or multiple arrows you need to unlock the related skills. The rest was handled in a similar way to the previous episode, with a class distinction for each of the weapons (swords, clubs, spears, axes, daggers) which is reflected in a very evident way when we take a tool to the blacksmith to improve its effectiveness. That said, the set of weapons and armor created for the occasion is splendid and quite varied: as the level progresses we will tend to find the same components only of better quality, but it is still a very large selection. Small but important note: it is possible to equip a helmet (or a hood), thus taking advantage of an extra protection, then choosing whether or not to view it in-game, thus leaving the face of the protagonist free. Skills and combat system In Assassin's Creed Odyssey the skill tree has been completely overhauled and now includes three different ~paths~: Hunter, Warrior and Assassin. Each of them allows you to unlock specific upgrades and powers. The Warrior class includes, for example, the iconic spartan kick (which proves to be tremendously useful in combination with the verticality of many scenarios: a well-aimed kick is enough to make even a rather tough enemy fall, provided he does not possess specific skills), a charged shot, a ~finisher~ with a sequence of attacks, a frontal charge and a momentary boost to shots. The Hunter class revolves around the use of the bow and allows precision shots, charged shots, paralyzing or incendiary arrows, explosive arrows and, in general, the amount of damage done with each maneuver. Finally, the Assassin class regulates the moves that we will be able to use in stealth mode, the sound of footsteps, the perception of objects (here too the classic Eagle Vision is a distant memory) but above all the effectiveness of the small blades (no blade hidden, however). It's unlikely to proceed focusing on a single category, but the game allows you to reset the a's at any timeunlocked skills to distribute the experience points obtained during the campaign in a different way. You certainly need a mix of skills to get by in the various situations: assaulting an enemy base to eliminate its boss and steal its treasures often requires an alternation of approaches, even more so if the rank of the guards is higher than ours. It never happens to run out of arrows, this is true, but unlike Origins it is difficult to reach a degree of power such as to eliminate dozens of soldiers with long-range shots and quietly go to collect valuables among the corpses. The balance makes the fights full-bodied and challenging: in this perspective, the special abilities, which can be spent by consuming the adrenaline bar indicators, help but are not decisive. Dodging attacks at the last moment activates a bullet time that is not beautiful to look at but rather effective, during which it is possible to ring a series of blows to the enemy without him being able to react. Enemies and artificial intelligence The times of Assassin's Creed IV: Black Flag are certainly long gone, when the protagonist could accumulate kills on kills and leave behind a mountain of bodies: in Assassin's Creed Odyssey the action RPG vision introduced with Origins is consolidated, and therefore it happens that you have to flee when you find yourself surrounded by three or four high-level enemies. Furthermore, the funny practice of the ~train~ has been dismantled once and for all, with opponents waiting for their turn to strike: in a condition of numerical inferiority we will almost never be able to complete a combo without another participant in the clash trying to hit us , however succeeding if the sequence is not undoable. How does artificial intelligence behave in this and other cases? The rules of the stealth genre are quite clear: making the perception and reactions of the guards realistic would mean transforming the experience into a frustrating trial & error, because once discovered we would have to definitively give up the silent approach. In the game, therefore, a simplistic middle ground is observed: being spotted creates a rather lasting state of alarm, but it is possible to recover by fleeing and hiding away, after having broken eye contact. All considering a certain strategic dynamism, given that the alerted enemies will begin to wander around the camp in groups, dividing only after a while. The conquest of the outposts is a clearly repetitive practice in its dynamics, but fortunately it is interspersed with a large number of different events, which in some cases also include a clash with very powerful bosses belonging to Greek mythology. Finally, there are the mercenaries: they roam the map like those of Origins, but are managed differently. These are worthy adversaries, tough and often accompanied by wild beasts, who are hired on the basis of our actions: their intervention can actually break the eggs in our basket, especially when they arrive in the middle of a siege, but defeating them will allow us to obtain new items and to increase our popularity as a mysthios, moving up in the category ranking. Difficulty and modes of exploration Assassin's Creed Odyssey allows you to set the difficulty on four levels at any time (easy, normal, hard and nightmare) and to change the exploration mode, making it guided as in the other episodes or free. We found the game quite challenging at an intermediate level, thanks to the aforementioned auto-balancing system for enemies and a couple of moments in the campaign that require you to do some grinding in order to continue, but the system that regulates the depth of the exploration represents an important novelty, which changes the consistency of the experience in many ways. During missions you are traditionally asked to find something or someone, to infiltrate a place and steal an object, to eliminate a target. Well, with the new mode it will be essential to make the most of the dialogue system with multiple options to obtain the information we need and to identify, for example, a limited area where to investigate. Once on site we will be able to recall the eagle Icarus in an identical way to Senu, using the stationary flight to mark points of interest, enemies, treasures and so on. This kind of approach makes the game more realistic and inspired, but also clearly a bit slower. Moving on to the guided solution, the differences are considerable: the targets immediately appear in the distance and you find yourself ringing the missions one after the other, a bit like in a chain", "date": "2018-10-01", "grade": "8.8"}