{"name": "FIFA 19: la recensione del gioco di calcio di Electronic Arts", "ref": "https://multiplayer.it/recensioni/fifa-19-recensione-gioco-calcio-electronic-arts.html", "text": "Among the football fans who flocked to read this FIFA 19 review, we will certainly find those who believe that the beauty of sport lies in its ability to subvert predictions. ~The ball is round~, we often hear it said, to mean that it is able to give surprises even when everything would seem written in advance. A feature also inherited from virtual football, where the user is in direct control of what happens on the pitch, thus feeling first-hand all the emotion of a decisive goal in added time. At the videogame level, the challenge has been taking place for over twenty years between the FIFA and Pro Evolution Soccer series, with legions of fans behind them comparable to real fans who support and cheer on their team. Over time, the two rivals have competed for the prize for best football simulation, in some cases proposing a drawn comparison like the one we are witnessing in the current year. The PES 2019 review has in fact shown us that despite the absence of the Champions League license, the Konami title has been able to get its claws out with an excellent edition, to which FIFA 19 will therefore be called to respond properly on September 28th. The good news we bring to you today is that you won't have to wait until this date to find out how it will play out, as we have tested FIFA 19 for you and are ready to tell you about it. The Journey: Alex Hunter and company At the time of the FIFA 17 review we titled the article with the phrase ~The Journey is just the beginning~, but it is for FIFA 19 that this title is worth more than ever. The adventure of Alex Hunter is in fact only one of the alternatives offered by EA Sports to the player, who in FIFA 19 can count on a series of possibilities capable of quenching even the greatest thirst for football. For those who have been passionate about the career of the young English footballer in recent years, Il Viaggio is obviously the starting point: the story picks up where we left off, with Alex Hunter looking for redemption in a big European club after the experience in the USA, while his friend Danny Williams tries to consecrate himself in England. The way the story is told allows us to control both, adding to them also Kim Hunter, Alex's young sister and promise of American women's soccer. If you have already tried The Journey before, its dynamics in FIFA 19 will be quite familiar to you: in fact, you go back to passing the time between training sessions and matches, in which you need to hit the objectives given by the coach to remain starters and improve the statistics of the our players. Even if, as in the past, the dynamics are a bit repetitive in the long run, they find benefit in the alternation between Alex, Danny and Kim in history, thanks to which we can explore different leagues and genres, including of course women's football. In Alex's case, in addition to the ability to control the team or individual player, we now find the ability to move only some team members onto the pitch, the so-called ~partners~: prominent figures who inspire him to improve his technique. Thanks to the good workmanship of the interlude scenes, made with the usual Frostbite engine, the story manages to keep the player's interest alive, occasionally offering some small reminder of the results obtained previously (remembering any FIFA 18 saves). It's clear though that in the highlights The Journey goes where the developers set out to go. A good deal of patience is required as you wait for the time to pass between the many uploads, which unfortunately end up breaking up the pace excessively between one scene and another. The modalities: no rules and lots of Champions League The news of FIFA 19 certainly does not stop at Il Viaggio. This year the developers have also got their hands on the so-called Kick Off, or the place where up to FIFA 18 you could kick off a friendly match without too many frills. The spirit remains more or less the same, but now you can set some elements related to the presentation of the game or to the gameplay. Among the former we find the choice of setting, including the Champions League final or another national or European cup. In the Custom Rules you can instead overturn the game of football as we know it: among the selectable rules there is the Survival mode, where each goal corresponds to an expulsion in the team that scores it, Shots from Outside, where the shots from outside of the penalty area are worth double, until you get to No Rules, where offside is abolished together with all kinds of fouls. A real ~royto the rumble~, unappealing when played against the CPU, but designed to increase the enjoyment rate during couch multiplayer sessions with friends. Similarly, ~best-of~ match streaks avoid the task of keeping a score in local challenges. Going further, we find the predictable possibility of playing a Champions League dry, even if the most appetizing way to tackle this competition is linked to its integration into Career mode. Inside it is in fact possible to play the Champions League with your team, thus enriching the experience of this important type of FIFA 19 offline game with the most important club trophy. Still with regard to the Career, those looking for particularly demanding challenges will find bread for their teeth thanks to the addition of the Ultimate difficulty level. In the FIFA 19 universe, we certainly cannot forget FIFA Ultimate Team (for FUT friends), the ~game within the game~ which has now become a fundamental part of the online life of many users. Ultimate Team can now count on the dynamics called Division Rivals, similar to what has already been seen in myClub with PES 2019 and in general in the seasons of online competitive games: after playing a few matches to determine your starting division, the player is placed in a bonds with others with the same ability. By earning points, you can move up to the top tier division week by week, while accumulating rewards to spend on improving your team and qualifying for the Weekend League. The popular Squad Battles are also back, while for the signing of players we point out the new Player Picks: thanks to these, it is possible to select from five players the one you want to add to your squad, thus obtaining greater freedom in composing it than in the past . Finally, with the arrival of the Champions League license, expect themed events and competitions for FUT as well. The gameplay: control, timing and spectacularity After expressing our first impressions on the game dynamics of FIFA 19 tested on the occasion of the demo release, let's analyze the game in the wake of the sessions we spent between its various modes. The cornerstone on the pitch is the Active Touch System, thanks to which athletes respond quickly and effectively to user commands. Since the first games, hitting is the way players control and handle the ball, using the various parts of the body to tame it. Thanks to the new dynamics and the inevitable additional animations, the movements all take place with greater fluidity: in particular, the volleys are carried out with remarkable naturalness, allowing us to hit the ball at whatever height it is. The so-called 50/50 Battles act in combination with these dynamics, with which the tackles now appear less scripted and more random, with unpredictable reactions from the ball following contact between the players. Speaking of tackles, although they were almost always punctual in their interventions, there were occasions in which the referees surprised us a little by their lightness in handling those standing, not sanctioning clear interventions on the man. As promised, we have paid particular attention to Timed Finishing, a new dynamic that allows you to increase the accuracy of a shot by pressing the button a second time at the moment of impact with the ball. We feel that this feature has a very balanced risk-to-benefit ratio, requiring a high level of concentration and timing to avoid the shot ending in a corner. Even if the system can be completely deactivated via the menu, from what we have seen it is enough simply not to try to press the shot again, to let its trajectory be calculated in the traditional way. Beyond the personal liking for this new game function, as it did some time ago with the Tactical Defense, EA Sports should be acknowledged for trying from time to time to renew years-old dynamics, accepting the risk of meeting the favor or not of gamers with what is proposed. As far as the artificial intelligence of FIFA 19 is concerned, we can declare ourselves satisfied, even if not as fully as we would have hoped. The new Dynamic Tactics allow the player to have more control over the players' behavior on the field, establishing their tasks with greater precision. Our teammates are skilled in following directions, covering spaces and proposing themselves for a shot where they identify the possibility. The aspect where FIFA 19 contne fail to convince concerns the CPU game: the strongest teams exercise an obsessive tiki-taka, carried out with a rhythm that is sometimes unreal. To be able to counter the maneuver without frustration, a decrease in game speed would help, which in our opinion is still too high. However, the decision to keep the pace high seems to be part of a very specific philosophy, with which EA Sports wants to link realism and entertainment in FIFA 19. As for the latter, the use of stunts by the players seemed a bit exaggerated to us, even when they would not be needed. Furthermore, we cannot help but imagine that online (especially in FUT) the now many tricks will be very popular, easily achievable after a little practice. Graphics and sound The acquisition of the Champions League allows EA Sports to place the missing piece in its puzzle. FIFA 19 obviously shows off the competition wherever it can, providing fans of the series with the most complete and immersive chapter yet. In cartel matches, the fans show dynamic choreographies also dedicated to old glories, contributing to the presentation of each match with elements that now have little to envy to what we see on television in reality. The many licenses present, including that of our Serie A, complete the enormous offer of FIFA 19 in terms of official names, logos and crests. As for the players however, EA Sports continues to adopt its usual approach: the most famous champions are practically equal to their real counterpart, even touching peaks higher than those of PES 2019, then going down in the level of detail with the players less notice. Compared to the competition, the number of faces of not very famous players reproduced in FIFA 19 is significantly lower: just try to take a tour of the medium-low ranking teams to realize this. Those who love La Liga, however, will find several improvements starting from the sixteen new stadiums included in the game, from which the ~usual~ Camp Nou is missing. With the addition of new facial scans such as those carried out for the Premier League, the Spanish league gains further in terms of involvement, making us hope that sooner or later it will be up to us Italians too. As already mentioned, the feeling with the game from a physical point of view is quite good, thanks to the high level of player response; provided you set the level of help to semi-automatic or manual, as stated after testing the demo, the passing system convinced us more than in the past, even if the weight of the ball still appears too light at times. We have also seen progress in the management of collisions, one of the historical problems of FIFA, but even in this case not entirely as it happens to see skits bordering on the comic between players who get stuck. The ambient sound is simply perfect in giving the user the impression of being right in the middle of the field. The commentary in Italian was once again entrusted to Pierluigi Pardo and Stefano Nava, now more at ease after several editions; the sample of phrases is large and adapted to individual matches and competitions, but there are still some problems in the way in which the phrases are adapted to what happens on the pitch, thus leading to incorrect interpretations of some situations by the couple. The use of connections on the sidelines just to ask how much time is left until the end of the game is also a bit funny. Finally, we point out a welcome restyling in the appearance of the FIFA 19 menus, which however remained similar to the past from a functional point of view.", "date": "2018-09-19", "grade": "9.0"}