{"name": "Persona 4: Golden", "ref": "https://multiplayer.it/recensioni/persona-4-golden-recensione-xbox-playstation-switch.html", "text": "How strange to write Persona 4: Golden review today. The Atlus game, in some respects so modern, made its debut way back in 2008, even on PlayStation 2. Although fifteen years is not a short time, this extraordinary role-playing game would not disfigure in front of one last release. If it is true that the graphics are now dated, what Persona 4 fails to do polygonally, it does so through designs of boundless and, indeed, timeless beauty. The soundtrack is also fundamental: we don't want the beautiful soundtrack of Persona 5, but it is from here that Shoiji Meguro's touch has become fundamental, blending perfectly with the visual style from which it can no longer be separated. The coup de grace is given by the cast and the setting: compared to the illustrious sequel, Persona 4 is more intimate, warmer and, once finished, it overlaps with our personal memories as if that year passed in the small town of Inaba , which is the background to the events narrated in the game, we had actually experienced it. Serial killers Persona 4: Golden: the focal point of the game is, as always, the school attended by the protagonists There are games with a particular magic, an invisible quid sometimes unknowingly created by a particularly inspired team. Persona 4 is undoubtedly one of these games. If with Persona 3, which also arrived on these shores these days, the development team reinvented the series to bring it up to date, Persona 4 is the chapter that Atlus has used to perfect it. Here you will find all the features that made Persona 5 great: the social links that turn friendships into experience and new powers, the fast and fun turn-based combat, the soft background beat and of course this Mephistophelean otherwhen inspired by the darkest David Lynch , combined with more pop Shintoism, will take us on the trail of the serial killer who is threatening the city. Guardian of the parallel world of Persona 4, which is accessed through the TV, is as always the lanky Igor, one of the few characters to be present in every game of the series. The official mascot of the game, the character you will find instead of Morgana from the fifth chapter, is the beloved and irresistible Teddie. But in general it's really hard to find a character who isn't of the highest level: starting from the protagonist up to the rude Kanji Tatsumi, passing through all the girls in the group, but without forgetting the very sweet Nanako (who would now intonate a ~Tutti days are special since Junes!~), that of Persona 4 is as varied as a close-knit cast. However, Inaba cannot fail to feature in the cast, this rural city hit by the same economic crisis that has made many local towns deserted, where young people are so busy dreaming of distant metropolises that they do not understand how important it is what is slowly fading around them : the small temple with its equally small and ancient legends, the characteristic river where you can go fishing and of course the Shichiri Beach, the beach which in the Golden version proposed here will be the backdrop for exciting summer trips on a motorbike which will take the protagonists towards their adulthood. Like all Personas, the fourth is also a coming-of-age story, spread over a year which only in the end will prove to be the most important of a lifetime. The Dojima apartments will make the city warmer, where the protagonist will move at the beginning of the game, after his parents have left for a long business trip away from Japan. Although smaller and less elaborate than the attic of the Caf Leblanc, our refuge in Persona 4 is much more welcoming, almost a real nest that will protect us from the increasingly heinous crimes that will threaten the city's naivety. Finally here we are in front of the Yasogami High School which as a rule will represent the glue that will unite the protagonists in an invincible team of fighters. Waiter, the usual... Persona 4: Golden: the fights are slightly more static than those offered by the sequel, but perhaps even more interesting in some cases In terms of gameplay, Persona 4 is almost indistinguishable from its famous sequel with the exception of the dungeons. In the fifth game these are divided between procedural, set in the subway, and main, whose form is pre-established, while in Persona 4: Golden they are all procedural and therefore devoid of that characterization that would have made them more elaborate and interesting. It's the only fly in the ointment, then expertly solved in the next game, of an adventure that runs and runs like clockwork, finally freed from that old-fashioned difficulty that in Persona 3, dfter a mistake, it sent you back to the last, often too far, save. In this new version we find softer graphics, but not more detailed and some improvements that will make our raids more comfortable including a quick save system and the ability to select the level of difficulty, in order to make things more difficult than normal. 'last time you played Persona 4 or to reset the challenge proposed by the fights, great for those who only want to enjoy the story. Persona 4 Golden: All dungeons in this game are procedural, just like the secondary dungeons in Persona 5 A small and appreciated effort on the part of Atlus which, however, in some ways is also the bare minimum. We weren't promised much more, that's true, but the result is yet another version of Persona 4 Golden, and not that definitive and truly updated edition by today's standards that this game perhaps deserves.", "date": "2023-01-17", "grade": "8.5"}