{"name": "Frozen Synapse 2", "ref": "https://multiplayer.it/recensioni/frozen-synapse-2-recensione.html", "text": "While we tested Frozen Synapse 2 for the review, we imagined the Mode 7 guys busy testing every single aspect with the care of medieval miniaturists, care that is noticeable not only in what is seen on the screen, but above all in what does not appear. Starting from the graphic design, passing through the online and offline modes and the individual game mechanics, in Frozen Synapse 2 there is nothing that is out of place or that is excessive and redundant, to the point of being almost irritating in its aseptic perfection . Single player campaign The main mode of Frozen Synapse 2 is the single player campaign. By starting it, the system procedurally generates a stylized futuristic city, the theater for our actions. We are the head of one of the factions that control the city and we must be able to expand to the detriment of the other factions present, using legal, but above all illegal, means. Basically we have to solve the missions that are assigned to us to accumulate money, expand our territory and find precious relics to activate at the headquarters to get various bonuses. At the start we have two teams, one defensive and one assault. By accumulating resources, however, we will be able to hire new mercenaries to form other teams, or expand existing ones, so as to be able to carry out several missions simultaneously. From the point of view of running the campaign Frozen Synapse 2 offers a certain freedom, because it allows you to follow the main missions or ignore them completely to focus on generic contracts. The main missions are usually introduced by dialogues with some of the city's key characters (faction leaders, political personalities, entrepreneurs and so on), dialogues which also help to understand the power games in progress and to better define the scenario, giving it a greater thickness. Let's say that ignoring them is a choice that we recommend making only after having finished the game at least once, in order not to miss most of the narrative side and to better understand the weight of diplomacy, i.e. to give greater importance to the relationships between the forces in the field , which can come together in alliances of convenience or in moments of open war, up to the conquest of the command centers of the adversaries or the loss of ours. If you recall, the first Frozen Synapse had nothing like this, focused as it was on the tactical part. For the sequel, Mode 7 has opted for a more open and dynamic structure, so as not to bind the player to a linear series of missions, while guaranteeing him a greater variety of objectives. In principle, the typical mission requires you to kill all your opponents, but there are many variations, such as robbing banks, kidnapping personalities, defending certain objectives and others. Mission mechanics However, the core of Frozen Synapse 2 remains the tactical part. Once a mission has started, it is necessary to place the squad's units on the map, then start what we can define as a work of analysis, experimentation and refinement of the action. Basically, the game interface provides us with a series of commands that can be given to the individual units, which will determine their behavior in the next round. For example, we can tell him to move, to kneel, to shoot on sight, to wait, to concentrate on a certain area, to pick up or drop objects and so on. Each round lasts five real seconds and allows you to carry out a certain number of actions, so much so that by giving orders that require more time to be completed, these are spread over the following rounds. The interface, not very easy to master, offers various functions that allow you to study the action virtually before making it effective. It is thus possible to simulate the behavior of our men and opponents, adjusting the shot where necessary. Obviously the simulation does not correspond 100% with the real action, a feature that makes the study phase even more intriguing, with the player applying the new information acquired from game to game, taking into consideration an ever-increasing number of variables. The maps of the individual missions, while following pre-set models, have randomly generated elements, so as not to repeat themselves identically if you want to play the campaign several times, while the equipment of our men depends on their value on the market (plus their weapon is powerful, the more it will cost to maintain them). Obviously, some time is required to master the entire system, especially if you want to carry out particularly complex actions. The interface is not exactly immediate and, although there is a tutorial that explains almost all the functions, the advanced ones require a greater impeng to understand all the implications and to understand when they can be more or less effective. Nothing impossible, mind you, and it is also obvious that a similar title cannot be expected to be as immediate as any action. Let's say that ours is more of a warning to prevent you from being lost in the face of the first difficulty. Particular praise deserves the artificial intelligence, much improved compared to the first Frozen Synapse, capable as it is of analyzing our moves effectively and acting accordingly. Multiplayer and graphics Mode 7 has also worked hard to expand the multiplayer. The asynchronous mode is back, with the possibility of playing a game against another human player at different times, and a new section has been added where multiple players face each other asynchronously in a single turn on a pre-set scenario. Both modes allow you to effectively put into practice what you learned in the single player campaign, with the obvious advantage of the human factor, which adds a certain unpredictability to the whole. From a technical point of view, Frozen Synapse 2 evolves the style of the first episode, maintaining the same futuristic minimalism, but with a greater number of objects represented and a lot more variety in the settings themselves. Although there is nothing to cry out for a miracle, Frozen Synapse 2 appears as a title with a very strong and in a certain sense unique stylistic identity, even if not exactly very original.", "date": "2018-09-13", "grade": "9.0"}