{"name": "Valkyria Chronicles 4", "ref": "https://multiplayer.it/recensioni/valkyria-chronicles-4-recensione.html", "text": "Despite the acclaim received at the release of the first Valkyria Chronicles, SEGA has never managed to properly frame this franchise. That first episode, released just ten years ago, had sold relatively little at home and around the world, but had received enormous acclaim: the critics and the audience who had played it were dazzled by the splendid watercolor style, by the plot that intertwined the life at war and the relationships between the young protagonists, with solid and convincing strategic mechanics that mixed turn-based action with real-time action. Valkyria Chronicles was a real gem, yet SEGA, for some reason, decided to continue the series on PSP with two chapters that came to us sobbing, and a spin-off on which it's better to drop a pitiful veil. In short, by now we took it for granted that we could put the proverbial cross on this series, and instead SEGA managed to surprise us with a new chapter designed precisely to win back old fans and captivate new ones. The story: the other side of the war SEGA in a sense had a good intuition: instead of continuing the perfectly self-contained story that began in the first episode or in the PSP sequels, the Japanese developer employed a ~J.J. Abrams~ maneuver. Put simply, we are faced with an approach not entirely dissimilar from the one that the aforementioned director took in the making of the first Star Wars belonging to the new course: thinking he had to win new fans, he practically rewrote and reshuffled those moments that made the history of the film and the franchise. The team that wins doesn't change, then? Well, not really, because Valkyria Chronicles 4 isn't really a sequel, as the story takes place at the same time as the first episode, just in a different country of this strange alternate Europe. Focusing on a completely different group of characters, it is not necessary to have played the other Valkyria Chronicles, although some dialogue and quotes referring mainly to the first one do connect, more like a wink to the loyal ones who had it played. After all, the protagonists once again belong to the Federation, the resistance that opposes the invasion of the Empire in the Second European War, but this time the roles are vaguely reversed: if in the first Valkyria Chronicles they had to defend us mostly from the attack of the imperial forces, on this occasion we will take the initiative by attacking the capital in the role of Claude Wallace, the commander of E Squadron. Naturally this military operation will not go as planned and the war will put a strain on the relations between the members of the squadron . Like its predecessor, Valkyria Chronicles 4 also explores the consequences and meaning of war, and does so with all-Japanese delicacy: the gags and interlude sequences are reminiscent of Japanese anime, thanks also to the beautiful soundtrack by Hitoshi Sakimoto and to the clean and delicate stroke of the designer Raita Honjou, and in addition to never being banal, they delve into the personalities of fellow soldiers and, in some cases, their deep ties of friendship. Color note: the texts have been completely localized in Italian. An excellent gameplay but with few novelties Players of the first Valkyria Chronicles - recently re-released in a remastered version - will immediately feel at home. The setting of interfaces and menus has remained essentially the same, with the Book mode that allows you to access the various saving and system functions, as well as reviewing each cinematic or replaying the various missions, conveniently cataloged and divided into short segments for a easy consultation. From the Book mode you can also access the barracks, where the player can micromanage the E Squadron exactly as it was done in the first Valkyria Chronicles: in fact, it is at this point that we begin to notice so many, too many similarities between the two titles. In the barracks we can operate the peculiar leveling system, assigning the experience points earned by fighting to the various categories of soldiers such as scouts, engineers, snipers and so on. Once a certain threshold is passed, the entire unit levels up and occasionally learns specific new skills. Still in the barracks we can get to know our fellow soldiers better, unlocking new side missions or combat skills, and also change accessories and weapons. The latter are obtained by completing the various tasks or by going through the Research and Development division, always ready to churn out new instruments of war after we have reached certainthe points in the story and paid increasing amounts of money or experience points. The management of E Squadron is essential, because the various units are distinguished not only by different parameters and combat skills, but also by a series of circumstantial advantages and disadvantages that are triggered in certain situations and help to better define the characters: for example c 'is a sniper who, being very shy, immediately runs out of action points when spotted by several enemy units at the same time. The idiosyncrasies of various soldiers are also important because some of them have likes and dislikes towards others that can affect their performance in battle. Once we have taken the field and started a mission, after passing the detailed briefing, we will have to deploy our units and slowly make our way towards the objective on duty. Valkyria Chronicles 4 is played exactly like the Valkyria Chronicles of 2008: in this sense, the concrete innovations can really be counted on the fingers of one hand and are limited to a new unit - the grenadier, which can attack from a distance and offer excellent fire cover to his companions - and the ability to attack enemies in concert or to put up a desperate last stand if you are about to go down. In fact, when a unit dies, the player has three turns to recover it physically: if he succeeds, he will be able to deploy it almost immediately, otherwise, in the case of units of lesser importance for narrative purposes, he risks losing it forever. Valkyria Chronicles 4 is in fact a rather difficult title with significant and unpredictable difficulty peaks. It's not strictly necessary to resort to skirmishes to gain additional experience points, since with a little logic and strategy you can overwhelm your enemies even in the most desperate situations, but you have to move with caution, taking advantage of the large three-dimensional spaces to hide from the sight of the enemies. During our turn we have a certain number of action opportunities available, represented by small medals that are consumed every time we take control of a character. Movements are limited by an indicator that discharges with each step, so it is essential to plan your movements and take advantage of shelters such as tall grass or low walls to hide from enemy fire. Each type of unit has capabilities that make it more or less suitable for certain tasks, so scouts move further than anyone else, spearmen can shoot down tanks, engineers can replenish their teammates' ammo, and so on. Missions are often long and staged with different objectives and challenge the player with intricate layouts, environmental obstacles such as fog or bad weather, and much more. In short, there is no shortage of variety, and even if it knows everything a little already seen, SEGA has managed to re-propose the formula so well that it becomes difficult to really blame it. Perhaps something more could have been requested on a technical level, but the wonderful canvas style manages to effectively hide the technical flaws from superficial looks: Valkyria Chronicles 4 is really nice to see, there is little to add.", "date": "2018-09-12", "grade": "8.5"}