{"name": "Zone of The Enders: The 2nd Runner", "ref": "https://multiplayer.it/recensioni/zone-of-the-enders-the-2nd-runner-recensione-pc-ps4.html", "text": "When it comes to Hideo Kojma, it is often pointed out that he has always and only dealt with his goose that lays golden eggs. However, the reality is different and, over the course of his career, among the various titles in which he has taken part, there is a series that has left its mark in the hearts of many fans: Zone of The Enders. Based on the most classic of Japanese stereotypes, that of mechas, ZOE put players in a position to take part in a great futuristic epic aboard huge robots, the Orbital Frames. After an interesting first chapter but plagued by a disarming repetitiveness and a depth of gameplay that is not exactly Oscar-worthy, the sequel, The 2nd Runner, arrives on the market in 2003. Unanimously recognized as the most successful of the series and able to make up for all the shortcomings of the original, ZOE 2 is still today considered one of the best robot-themed titles that the medium has had the pleasure and honor to host. Fifteen years after its release and after a collection arrived on PlayStation 3, it's time to jump back on board the Jeuthy and see if the journey is still worth it. My name is ADA The story of ZOE 2 starts a couple of years after the first chapter. Dingo Egrett is a researcher of Metatron (fundamental resource for the energy supplies of the future) engaged during an excavation on Callisto. While doing his job he comes across a deposit that hides an Orbital Frame, the Jeuthy commanded by the young Leo in the first chapter, and he is forced to take command of it to save his own skin. Within a matter of minutes, which act as a prologue to the adventure, Dingo is called to collide against hundreds of BAHARM military force drones, until he meets an officer named Ken Marinaris, a woman in command of another OF : Ardjet. Having escaped the danger, however, he is forced to capitulate shortly after under the blows of Anubis, OF Jeuthy's twin, piloted by the commander of BARHAM: Nohman, an old acquaintance of the protagonist. From here a series of events unfold that raise the narrative several steps compared to the original, managing to keep the attention high for the whole ten (rather scarce to tell the truth) hours of the campaign. Between rescue and escort missions and fights with a multitude of bosses, Dingo will have to come to terms with his past and return to the soldier's shoes, after having sworn to himself that he no longer wants to have anything to do with the fights. Playstation 4 trophies The twenty-five trophies of ZOE 2 will require you to complete the campaign, to find all twenty side missions and also to perform a series of timed actions during the adventure, with the consequent possibility of losing them and being forced to repeat the section to take them home. Hunter warned, is forearmed. Of course, the coveted platinum is not missing, to the delight of those who can't live without trophies! The remastered of the remastered This new version of ZOE 2 is based in part on the work already done a few years ago for the collection released on PlayStation 3. It would be legitimate to ask why Konami decided to limit itself to the second chapter, but an in-depth look at the work done is enough to understand reasons easily. What makes this version of the game unique is the double nature of technical remastered, which offers the incredible joy of 60fps and 4k, and the possibility of experiencing the entire campaign via virtual reality. Although ZOE is a third-person action, this new implementation allows you to enter the cockpit of the Jeuthy and control it with the help of the helmet. It goes without saying that you will be called to compromise from the point of view of technical detail, but the fascination generated by finally feeling ourselves on board a mech cannot be hidden, turning into reality the dream of millions of children who grew up on bread and Japanese cartoons . Unfortunately, this is net of a series of problems generated by the amount of enemies on the screen and by the frenzy of the gameplay, which sees its point of greatest depth in the shots and changes of direction. For this reason you will soon find yourself using the automatic lock system, which will allow you to always keep an eye on the enemies closest to your position. A particular and interesting experience but certainly not for everyone. Those who already suffer from the use of virtual reality will hardly be able to digest the speed of the action of ZOE and, even for the veterans, it will be advisable to take a good break for each game session. Different speech regarding the classic version of the title (the one that we too have thoroughly tested). What really baffles about this remastered, which does not adjreaching nothing in terms of content, it is a very remarkable aesthetic overhaul. We are still talking about textures and models from fifteen years ago, but the fluidity and the high definition modernization make ZOE 2 a feast for the eyes still today, thanks to the amazing polygonal models and the animations so accurate as not to disfigure in the presence of many titles of recent production. To embellish everything, a series of cutscenes created with the classic style of the anime, which prove to be perfect when it comes to overcoming the passage of time, are still today visually captivating and made with the utmost care. The gameplay then remains the classic one of the series, frenetic and explosive at the right point, despite the serious problem of a camera that did damage in its time and which still today struggles to keep up with an action often at the limit of the understandable, especially during the advanced stages. Even the sound sector has been meticulously cared for with a remastering work that seems to want to give even more color to the whole, helped by a soundtrack that is still spot on and exciting today.", "date": "2018-09-07", "grade": "8.0"}