{"name": "Monster Hunter Generations Ultimate", "ref": "https://multiplayer.it/recensioni/monster-hunter-generations-ultimate-recensione-switch.html", "text": "Monster Hunter Generations was released two years ago on Nintendo 3DS and represented, in several respects, a real evolution for the series that Capcom had started on PlayStation 2 way back in 2004. By introducing Styles and Arts, Generations steered that system in a more dynamic direction of combat which, in its rigid elegance, had become the trademark of the franchise. And while Capcom was rejuvenating the series, at the same time paying homage to more than ten years of monsters and maps in an almost complete package that was not only meant to be innovative, but also respectful of tradition: a nod to the now conquered Western public, finally free to roam in every village and chase monsters in virtually every map released up to Monster Hunter 4 Ultimate. Evolution, tradition and revolution in one game: the path of Monster Hunter seemed traced, but then came Monster Hunter World. Coming out first on PlayStation 4 and Xbox One, then recently on PC, Monster Hunter World has shrugged off the artifices of the past to adapt to the new generations and not only in a strictly technological sense. Monster Hunter World, however, came out several months after Monster Hunter XX, which is the Japanese version of this Monster Hunter Generations Ultimate that is only now peeking out on western shelves. The game, initially conceived for Nintendo 3DS, was then converted to Switch and comes to us at a time that is anything but suspicious: thanks to the success of World, Monster Hunter is experiencing a renewed youth all over the world, which is why this Generations Ultimate thrives on a decidedly anachronistic reflex that puts us in a difficult position. For this reason, our review will analyze the main novelties of this iteration compared to the previous one, then it will focus on a series of reflections which, we hope, will help you understand whether the game is for you or not. The main novelties in combat If you've never played Monster Hunter Generations and want to know more about the features that distinguish this chapter, we can't help but advise you to read the comprehensive review we published in July 2016: Monster Hunter Generations is basically that, a tribute and at the same time a revision of the series. In this sense, Capcom has essentially recycled the assets of the previous Monster Hunters, making us revisit the villages and maps where the previous episodes took place. This involves a certain anachronism, as we said, even if the old maps have been revised and corrected to embrace the verticality introduced in Monster Hunter 4 Ultimate. In terms of gameplay, however, Monster Hunter Generations Ultimate proposes all the weapons already seen in the previous chapters, including the Sword and Insect Falcione, net of the usual list of all-round balances. Monster Hunter Generations also introduced the Styles and the Arts, a further element of customization within the combat system. In addition to implementing a whole new series of Arts - special attacks that can only be used after filling the appropriate indicator - Monster Hunter Generations Ultimate offers two completely new hunting Styles: the Alchemical Style and the Valorous Style. The Alchemical Style is all about the Alchemical Barrel, a specific item that, when used, produces various types of gadgets and consumables. It also allows you to equip up to three Arts and enables an indicator that charges over time and using the Alchemical Barrel, enhancing the hunter. It's an interesting style but less versatile than it seems, while the Valiant Style seemed much more dynamic and fun to play. The Valiant Style, in fact, from the beginning enormously limits the possibilities of attack and movement of the hunter, reducing the number of hits in the combos. The sheathing animation is different however, as the player can interrupt it at any time for a surprise attack; moreover, if the hunter sheathes his weapon at the right time, he automatically dodges the monster's attack and suffers much less damage. Furthermore, the blows inflicted charge an indicator which, once filled, finally unlocks all the moves in the repertoire of that weapon, sometimes greatly enhancing its effectiveness. It is a high-risk style that offers many satisfactions, once mastered, but which obviously has its contraindications: the hunter, for example, can equip only one Hunting Art. The return of the G-rank Bearing in mind also the possibility of playing as the Cacciamiao, i.e. the cFelyne companions, the two new styles join the Guild Style, the Aerial Style, the Shadow Style and the Offensive Style to guarantee an impressive variety of situations and strategies, even in the face of the introduction of some new monsters - such as the imaginative Valstrax and the ominous Ahtal-Ka - and the return of certain old glories such as Lao-Shan Lung or Barioth. Capcom has also extended the list of Deviant monsters that in the previous Monster Hunter Generations represented the real endgame: there are six new ones, among which the Cruor Diablos and the Deviant counterparts of Astalos, Mizutsune and Gammoth stand out . In total, Monster Hunter Generations Ultimate has 129 monsters of which over 90 are large and therefore a quantity of weapons and armor that literally touches the thousand. In short, in terms of content, we are faced with the most complete and richest Monster Hunter ever. In fact, Monster Hunter Generations Ultimate also offers players an important challenge: the G rank. It is appropriate to shed some clarity on the matter. For years, Capcom has punctually produced two Japanese versions of each iteration of Monster Hunter: the second was as a kind of expansion that extended the game with new, more difficult missions belonging to a category called, precisely, G-rank. stubborn to localize the second version directly in the West, so we ended up taking the G-grade for granted until we found titles like Monster Hunter Tri, Generations or World in our hands where the G-grade actually wasn't there. Monster Hunter Generations Ultimate, despite being the first Monster Hunter to come out for Switch, is actually the expansion of the title released for Nintendo 3DS two years ago, and therefore includes the infamous G rank which translates into a barrage of decidedly difficult, calibrated missions for the multiplayer experience. The latter turned out to be pleasant as usual, even if the delay in the release in the West, in complicity with the clear advance with which we were able to test the code, prolonged our search for hunters eager to shoot down the same monsters we aimed for. However, the G rank did not betray our expectations: the monsters turned out to be much more tough, unpredictable and aggressive, in the face of those who had found Monster Hunter Generations easy. The new skills, weapons and armor have opened the door to hundreds of new opportunities, throwing us into that fantastic loop that makes the Capcom series so addictive. The more advanced missions will give even the most seasoned hunters a hard time, proposing unsuspected combinations of monsters and variants that it is impossible to kill without a minimum of coordination, especially if you consider that in Monster Hunter Generations Ultimate you cannot communicate vocally, but only through preset phrases, unless you use some support software such as Discord and the like. Reflections and considerations There's no getting around it: Monster Hunter Generations Ultimate is an older generation product and what's more, it's the remastering of a title developed for Nintendo 3DS. The graph is not contemplated. We can argue about the art direction, always exceptional, and the variety of weapons and armor that embarrasses Monster Hunter World, but buying Monster Hunter Generations Ultimate means having to resign yourself to washed-out textures, low polygons and constant loading, as the maps return to being divided into small areas without solutions of continuity. Fortunately, Switch returns a very clean and solid image both in portable mode and in the Dock: the Capcom title travels at 30 frames per second without uncertainties and yes, the variety of scenarios and creatures does not make you regret the ultra-realistic style of the most recent multiplatform iteration . Having said that, it should be clear by now that Monster Hunter Generations Ultimate is a content-wise unrivaled title into which hundreds of hours can be invested. Still, even having spent thousands of hours between that Monster Hunter Freedom Unite for PSP that we started hunting with and all the subsequent iterations up to Monster Hunter Generations, replaying an old Monster Hunter after playing four hundred hours in Monster Hunter World it was, quite simply, traumatic. Be that as it may, simplified or facilitated, if you prefer, Monster Hunter World has brought so many improvements to the formula in terms of quality of life that those little things we have been used to for years, such as the need to carry pickaxes or nets to collect the materials, or even just simplyhaving to mark monsters with paintballs in order to locate them on the map made us turn up our noses. They are now obsolete dynamics that belong to the past and do not make the experience more engaging, only more cumbersome and rigid. Fortunately, the ability to import our Monster Hunter Generations save - via an abstruse process involving the download of a specific Nintendo 3DS app and a very 90s-esque coded data transfer - allowed us to begin testing straight out of G-rank, wearing the best weapons and armor made two years ago. We don't feel like saying anything about the combat system, except that actually going back to wielding bows and crossbows in the old way was difficult, as long as it still works very well and in some ways the rigid and limited movements go well with the lack of unpredictability of the monsters . The truth is that Monster Hunter World has refined and smoothed the gameplay of the series in an extraordinary way and Generations Ultimate represents a much less ideal entry point for those who have never gone to monster hunting before. You will therefore have to ask yourself a few questions before opening the wallet. To begin with, you will have to ask yourself how much the variety of monsters and the longevity of the experience matter to you, because if you are looking for a title that can entertain you for a really long time, probably more than Monster Hunter World, then you have found it. On the other hand, if you have appreciated the changes made by Monster Hunter World, then Generations Ultimate initially it may seem even indigestible to you, at least until you get used to the old formula again. If you've never played Monster Hunter before and want to try your hand at the franchise for the first time, you'll have to ask yourself a few more questions. Do you like gaming while watching TV or do you prefer portability? How challenging must your first hunting trip be? How important are the presentation of the game, the soundtrack, the graphics to you? Monster Hunter World is the most accessible game and also the most beautiful to look at, Generations Ultimate the most complete and challenging. Finally, if you've played Monster Hunter World, you're in yet another category, and you'll have to ask yourself how interested you really are in learning about this franchise's past. In Generations Ultimate you will hunt for some of the most iconic monsters in the series, but you will have to deal with a significantly different control system and some important limitations. In short, consider the purchase well, try the demo available on the eShop and try to understand, in the specific case, what impact Monster Hunter World has had on you, before diving headlong into this new adventure.", "date": "2018-09-03", "grade": "8.0"}