{"name": "Lone Ruin", "ref": "https://multiplayer.it/recensioni/lone-ruin-recensione.html", "text": "When a game is successful it is normal that it produces a certain number of clones, which try to exploit the formula in order to attract the same potential audience. Be that as it may, in some cases the source of inspiration is so evident that the operation becomes almost blatant, as we will see in the review by Lone Ruin, which looks to Hades while failing to even come close to the quality of Supergiant Games' game. Combat In Lone Ruin combat is central Lone Ruin is a very simple title to describe. Once the game has started we have to choose the first spell with which to tackle the levels, basically our bullets. In each stage we have to do the same thing: kill all the waves of enemies, the number of which is indicated by a clearly visible icon bar on the screen, using our powers and dodging their attacks by sprinting. The creatures we will meet are of various types and are differentiated above all by the attack patterns. It must be said that a single enemy is not very dangerous, but things change when faced with a multitude of opponents, all with their own powers, which transform the screen into a controlled chaos in which we are called to get out of the way, reducing at the same time the number of attackers. Once the massacre is over, you get a reward, to then choose which one will be that of the next stage, between the two available. The only important variations are the presence of shops, areas where you can spend the money accumulated by killing enemies, and that of stages with more rewards, in which the waves are more numerous, more difficult and the creatures involved are stronger . Once you have passed a certain number of stages, you have to face the boss on duty (three in total), like a giant tree (the first, we won't tell you the others because they are in fact one of the few surprises you will find while playing), which as you can guess have unique and particularly dangerous attack patterns, which draw heavily from the world of bullet hell. Killed the beast, you can access the next level. Note that the choice of rewards does not change the stages, which remain simple arenas, with nothing interactive. There are stairs, corridors, chasms where you have to avoid falling, but in general they are very small and don't offer much in terms of variety. Spells The bosses are the best part of Lone Ruin, too bad there are only three In short, Lone Ruin is a pure combat system, in the sense that apart from enhancing yourself with new active or passive spells, there's really nothing else. Even narratively speaking there is nothing. The protagonist is a sorceress who wants to get to the center of the ruins of an ancient city to find out what has corrupted it. Point. On closer inspection it is only an excuse to exploit the twin stick shooter mechanics, which as we have said and as you will have understood look heavily at Hades. So each spell works differently from the others, so as to profoundly change the style of play to be adopted. There are chain lightning that allow you to adopt a more conservative tactic, or the classic fireballs that require a more direct approach. There is the scythe which only allows attacks from short distances and which favors greater agility, or there are timed shots which allow for greater tactics in relation to the stages. In addition, other spells can be collected during the games, which create quite layered builds, even if you never get to the level of what can be obtained from the son of the king of the underworld. Lone Ruin ends really quickly Their clashes are not bad and they also manage to excite, especially when they start to become more challenging. Too bad that everything lasts very little and that the system itself is already too limited in the short distance. Incidentally, Lone Ruin ends in a breath. It took us less than three hours to get to the end of the ruins and defeat the last boss, so much so that we didn't even believe it. Of course, there is the possibility of replaying at a higher level of difficulty and there is the Survival mode, which allows you to play as long as you can stay alive and is linked to online points competitions, but the reasons for repeating the experience are very few, apart from an immoderate passion for the game formula. An end in itself The graphic style is not very incisive His graphic style is not bad, at least at a first impression, made up of dark areas with a chromatic palette that fades towards ethereal colors (celestine, purplish), between mists that surround the environment and well-highlighted outlines of objects which go toform a cohesive whole, while always guaranteeing very high legibility. The problem is that, lacking a strong mythology to support everything, the maps don't have much to tell and are limited to being procedurally generated dark battlefields, where you can massacre very generic enemies. Ultimately we are a character who descends into the depths of the ruins of a city to purge the evil that corrupted it a thousand years ago, but where is this city? Why are we so interested? Didn't we have anything else to do to pass the time? Lone Ruin is very repetitive Here, perhaps the main problem of Lone Ruin is that it focuses so much on its mechanics that it has forgotten everything else, even to give a reason for them other than their mere existence. The result is so functional as to leave you almost dumbfounded by the speed with which you forget it, as if you had assembled an Ikea cabinet instead of having played. As a light experience it could also be fine, but considering that Hades is around, who surpasses him in everything, and that the world is full of roguelikes, we really see no reason why you should descend right into these ruins.", "date": "2023-01-16", "grade": "6.0"}