{"name": "Legend of Solgard", "ref": "https://multiplayer.it/recensioni/legend-of-solgard-recensione.html", "text": "Legend of Solgard represents a substantial evolution for the King-branded productions, given that it abandons the traditional Saga-style formula to deliver us an original mix of strategy and puzzle, narratively inspired by Norse mythology. Ragnarok is on the horizon, but there is someone who can stop it: the cunning Embla is designated as a champion by the spirits of good, who give her a weapon capable of giving her the powers of the Sun goddess. , the girl will have to explore the realms of Midgard, Jotunheim, Vanaheim, Helheim and Niflheim to defeat the powerful creatures bent on ending the world. Where the map of the scenarios and the route in stages are old acquaintances for those familiar with the titles of the English company, the most important innovations arrive on the gameplay front. In fact, the idea behind Legend of Solgard mixes match-3 mechanisms and turn-based strategy to compose a system that obviously needs to be assimilated and understood at first, but which after a few games fully expresses its full potential, involving us in a truly exciting challenge . In each mission, the screen presents the faction of the creatures controlled by Embla and that of the enemy troops, behind which is the portal that we have the task of destroying, with a clear indication of its life points. The goal is therefore to get to hit the portal and destroy it, possibly making our way through the hostile units after having created more or less powerful creatures in turn, equipped with different characteristics and abilities depending on the type. Yellow, green, purple and red units are projected onto our ~board~, selected from a collection of characters that can be upgraded according to the gold in our possession and the cards obtainable with the ever-present prize boxes. We will therefore have to use the moves available to combine these units in various ways, giving life to attack creatures of different sizes, resistance and speed depending on the number of elements that compose them and the form of aggregation. At the end of each round, our soldiers will attack the enemy in front of them, possibly reaching the portal to inflict damage equal to the value of their health, and then disappear. Gameplay and structure Immediately describing the gameplay of Legend of Solgard is not very simple, but trust me: the mechanisms of the game appear very clear after a few games, giving way to fun and tactical depth. In fact, the combinations allow you to create barriers to repair Embla from the attack of enemies (its energy must be preserved, under penalty of game over), or to further strengthen giant creatures that we have created and which require more turns to be able to act according to the size. In short, there are many possible situations, which change depending on how the enemy troops are deployed, their danger and the possible presence of bosses. Yes, the game also includes challenging boss fights, some with huge and threatening monsters, which we will have to face trying to intercept their attacks in time and preparing effective countermoves to inflict the greatest amount of damage possible. As you progress in the campaign, the freemium mechanisms that naturally characterize the game emerge, primarily the energy of action that limits the number of missions we can try within a given period of time, but also an increase in the difficulty that at some point it can force you to replay previous levels to do some grinding or devote yourself to alternative modes in order to obtain the resources necessary for unit upgrades. Limits that are willingly accepted, in the face of the goodness of a production that will certainly be able to keep you company for quite some time, considering the number of stages available and the abundance of characters that are unlocked along the way. From a technical point of view, the game, developed by Snowprint Studios, is very colorful and boasts a pleasant, if perhaps not extraordinary, graphic style. The touch controls are very simple and the music proves to be functional to the action, accompanying us in our battles in the best possible way.", "date": "2018-08-28", "grade": "8.5"}