{"name": "Graveyard Keeper", "ref": "https://multiplayer.it/recensioni/graveyard-keeper-recensione.html", "text": "It doesn't often happen that you are faced with an almost overwhelming amount of information, data and mechanics to manage within a few minutes of starting a game, at least in the current gaming landscape. We are so addicted to the continuous and redundant tutorials, to the gradual and smooth insertions that it is easy to find ourselves disoriented, not to say baffled, in front of the strange menus, the small icons and the dozens of possible interactions within every single screen of Graveyard keeper. And this is not a negative thing, mind you: a title that pushes us to study and apply ourselves, even having to seek help from guides placed outside the game itself, given the scarcity of instructions present and the quantity of parameters to manage, it has undoubtedly intriguing aspects and the substantial support that is already emerging from the community between wikis and various forums is a clear indication of the interest that this game is attracting among users. It's a somewhat old-fashioned situation that can only occur within independent projects, which do not present themselves as products suitable for everyone and on the contrary stand out precisely for their particularity in terms of structure, accessibility and taste. Indeed, Graveyard Keeper is particular in all three fields mentioned: it is a strange hybrid between management, farming simulation and RPG, it is decidedly deep, layered and complex and finally it stages situations that tend to be quite distant from the politically correct, looking into risky territories such as religion, the representation of the afterlife and funeral rites with a ferocious and macabre irony that may not be appreciated by everyone. Popping up a bit as a surprise, this title by Lazy Bear Games (the Punch Club team) and TinyBuild also gained attention for its release directly within the catalog of freely downloadable titles by Xbox Game Pass subscribers, therefore finding itself in a large-scale distribution that catapulted it into a perhaps unexpected situation even on the part of the developers, thus amplifying its disruptive effect. A strange story The story has a dramatic incipit but soon tends towards the ironic, not to mention the macabre grotesque. The protagonist is an ordinary man who is run over on his way home and finds himself in a kind of limbo, where a mysterious being projects him into a medieval region to fill the role of manager of the local cemetery, without too many explanations. The main narrative line therefore sees us engaged in an attempt to return home, which necessarily passes through indulging the absurdities of fate and trying to carry on one's role in the best possible way, but intersects with a dense plot of secondary stories and colorful characters that greatly enrich the game world. The narrative is not exactly a preponderant element in Graveyard Keeper, which for the most part sees us engaged in very pragmatic occupations, however the strangeness of the supporting characters and extras paints a sort of theater of the absurd that stages something truly peculiar, complete with non-trivial choices entrusted to the player for which we often find ourselves having to bring out a cynicism that is not common in the world of video games. In short, we are far from the relaxed atmosphere of rural simulators such as Stardew Valley, a title that is easy to think of even looking at the images of Graveyard Keeper, but from which it distances itself in several respects. The presence of a story and a specific construction already configured for the protagonist, although not very detailed, are aspects that contribute to making this title somewhat peculiar, inserting it within a more defined narrative frame, as well as the writing of the dialogues and the characterization of the bizarre cast amazes for their wit and also for a certain depth of views and topics covered. Conversely, it largely lacks the extensive customization that is at the heart of games like Stardew Valley, where the vague and open characterization puts the player at the center of everything. It's all quite different from what one might expect: the talking skull Gerry exposes us to a cynical and ruthless vision of life, the talking donkey who supplies the cemetery with bodies has a rebellious nature and seems to tend to belong to a political current of extreme left, while the irreproachable rigor of the inquisitor inspires a certain terror but could represent a key element in being able to quickly overcome the obstacles that hinder us towards a return to normal life. This just to give some examples of the oddities to which the game subjects us, whileloads us with commitments without leaving a breather. The hard life of the cemetery manager The central core of the gameplay is the management of the cemetery, but it is only one of the many elements to keep in mind and follow with extreme care within the multifaceted game world of Graveyard Keeper. As far as cemetery management is concerned, the elements are typical of the genre, with the arrangement of the coffins and the need to make them increasingly pleasing to the eye by enriching their aesthetic elements with the progressive release of ornaments, religious symbols, flowers and more. This, at least, as far as the more superficial aspects are concerned, but decidedly more obscure mechanics are hidden behind these first facade elements: the general evaluation of the cemetery depends in fact on a set of factors, which also take into consideration the conditions of the bodies inside inside the tombs. For this reason it is important to increase one's knowledge in terms of anatomy and science to access better conservation systems and treat the corpses with a certain speed immediately after delivery by the talking donkey, to prevent them from decomposing and ruining the cemetery average. When one realizes that a corpse cannot lead to positive results, solutions come into play that give a good idea of how this game confronts us with decidedly macabre situations, with the possibility of burning the bodies but also of eliminating them by throwing them in the river. So far we are still in a rather delicate area, but the grotesque soon emerges when we discover that among the standard functions of the cemetery manager there are also autopsies, with the possibility of obtaining pieces of corpses to use them for scientific purposes, stealing bones and leather to obtain materials for weapons and equipment but also simply cut slices of meat to resell as food in the tavern or use them in the stalls of village festivals. We have talked in detail about these aspects closer to the central core of the gameplay to understand a little the general spirit that pervades Graveyard Keeper, but we must consider that the affairs surrounding the cemetery are only a small part of the actions we find ourselves carrying out everyday. Always keeping in mind one's energy as a point of reference, the depletion of which forces us to go home to sleep with a certain frequency, it is possible to take part in an enormous amount of actions. A multifaceted world Virtually everything on the screen, in the exploration of the village and the surrounding natural sceneries, opens up to some type of interaction within the hybrid structure that includes elements of exploration, resource gathering, crafting, management, trading and even combat and dungeon discovery. The aspects to take into consideration are so many as to make it impossible to fully explain them in a single review, just know that the various actions allow you to collect three different types of experience points, which can be used to unlock various discoveries within of numerous skill trees with assorted forks that allow you to obtain various technologies, tools and different possibilities of action in the game world. Scattered around the settings there are different work areas, where to implement projects if the right technologies have been unlocked. Although all this can attract and satisfy the most passionate of the mixed management-simulation genre, the idea that emerges is that the developers wanted to overcomplicate the game, loading it with cumbersome elements that make it difficult to keep ideas focused on some particular purposes , disseminating the quests with mini-targets to be passed in order to advance in a sort of continuous grinding in order to complete every single action, in order to unlock the necessary upgrades from time to time. On the other hand, the fact of being able to deal with a myriad of different actions and assorted quests at any time also favors the variety of the experience, thus softening the typical monotony of wild grinding, which still remains at the base of the game mechanics . To favor identification in a game in which immersion is not exactly easy, at first, the excellent graphic characterization also contributes. The high-definition 2D, rich in detail and represented with an excellent style, is always pleasant to see, even regardless of the morbidity of some elements shown on the screen. However, at least on Xbox One there is a certain inconsistency in fluidity with some frame-rate drops and a certain jerkiness in scrolling while traversing the map, things that could however be fixed with the next updates.", "date": "2018-08-24", "grade": "7.5"}