{"name": "Yakuza Kiwami 2", "ref": "https://multiplayer.it/recensioni/yakuza-kiwami-2-recensione.html", "text": "Yakuza Kiwami 2 represents the culmination of the operation that Toshihiro Nagoshi has set up to relaunch the SEGA franchise internationally. If in fact Yakuza Kiwami presented itself all in all as a compact, medium-length production, in the case of this sequel the authors had to deal with a campaign that can exceed thirty hours (the timer marked eighteen and thirty at the end of the story, in our case, but we left behind an enormous amount of challenges and subquests) and, not happy, they also added three unpublished chapters starring Goro Majima to the package, set after the events of the first episode. The final result gives the sensation of going a bit in a hurry during the early stages, as mentioned in our test of Yakuza Kiwami 2, but things literally take off when the more substantial collateral activities are introduced (the Cabaret Grand Prix and the Clan Creator, in this case), the secondary quests become denser and more interesting (although they include a large number of fairly trivial situations, which are resolved with a simple fistfight) and the plot is gutted, which does not disappoint this time either thanks to the fine hatching of every single character, as well as an excellent and refined narration, which does not skimp on unexpected twists over the course of sixteen engaging chapters. After the clash with ~Nishiki~ and the loss of his love, Kazuma Kiryu thought he was done with the Tojo clan, but a friend's desperate call for help forces him to backtrack. Indeed, the mission is delicate: someone needs to meet the leaders of the Omi Alliance to negotiate a truce and put an end to a clash that is filling the streets of Kamurocho with blood. Of course, this is only the incipit for a story full of fascinating characters, welcome returns and events linked to tragic events of twenty years earlier. Because the past, as we know, always comes back to ask for the bill... Structure and scenarios As a good remake, Yakuza Kiwami 2 does not differ in structural terms from the 2006 original, proposing a now consolidated formula for the series, which alternates cutscenes, exploration, side activities and fights. Conceptually everything is very simple: you are asked to move from point A to point B and face a new fight each time; but it is the context that makes this system terribly fascinating. First of all, there is the narrative aspect, which undoubtedly represents the most valuable element of the franchise, as well as (we imagine) the one that requires the most resources to be represented in the cutscenes. The plot was written by the expert Masayoshi Yokoyama in collaboration with Makoto Itakura and Seishu Hase, and is told through interlude sequences crafted with extraordinary care and perfect timing, truly spectacular when they prelude a duel or help build motivation necessary to viscerally hate the villain on duty before being able to finally get his hands on him. Then there's the actual gameplay, which comes as a mix of exploration, adventure, and combat. The two scenarios included in this episode, Kamurocho in Tokyo and Sotenbori in Osaka, are truly existing destinations (they are actually called Kabukicho and Dotonbori, respectively) and well known by fans of the Yakuza series, but they never cease to fascinate thanks also to the use of assets, effects and ~seamless~ solutions deriving from the use of the latest version of the Dragon Engine. It is for this reason that, against a frame rate locked at 30 frames per second instead of the 60 of Yakuza 0, in the game it is possible to access shops, restaurants, clubs and so on without the need for loading, in a dynamic and even interactive when you get involved in a fight and the window of a convenience store gets in the way. Walking inside the two locations, reproduced in great detail, perhaps activating the first-person view, allows you to breathe the atmospheres that actually permeate those places, and those who have visited them will be able to confirm this. As in reality, wandering through the streets of Kamurocho and Sotenbori in the evening offers a substantially superior spectacle to the daytime glimpses: thanks to the many luminous signs, which are reflected in the puddles or on the river that crosses Osaka, but also to a blur effect that is applied to scenes in the distance and helps to make them even more realistic. Combat system In Yakuza Kiwami 2 it often happens to come across hooligans, bullies and criminals of various kinds within the map: once they have noticed us, they will run in our direction and, ifachieved, we will only have to fight. In this case we will be able to develop a repertoire of moves that grows as we progress in the adventure, unlocking new maneuvers and finishers of great impact thanks to experience points, which can be performed when the rage bar is full, in a way contextual to the presence of interactive areas (walls, light poles, bridges), when one grabs one of the many roadside objects (signs, plants, clubs, bicycles) or a weapon proper (daggers, swords, pistols, rifles and so on). Unfortunately, the three different fighting styles introduced with the aforementioned Yakuza 0 and also transported in Yakuza Kiwami have been eliminated, which means that in the game Kazuma will defend himself using a single position but enriching it, as mentioned, with new maneuvers as the time. In the first few hours, however, this choice proves to be controversial, forcing us to always alternate the same combos to eliminate the opponents on duty and experimenting, moreover, with some funny ragdoll-style glitches when enemies or our own character are thrown to the ground . There are some interesting variations on the theme, for example the charged shots (very useful against bosses, generally not inclined to get damaged with standard combinations), but as mentioned you need to be patient during the first hours of the campaign, waiting to be able to enrich the set of attacks at your disposal. In any case, the yield of the blows is excellent and the level of challenge seemed more consistent than usual on the normal difficulty level, forcing us as never before to resort to special equipment and weapons that the protagonist can carry with him to shoot them out as needed. From this point of view, the integration of collateral activities with the growth of the character is fundamental: if the previous conception of Yakuza saw culinary entertainment as a simple pastime, Yakuza Kiwami 2 adopts the latest solutions to ensure that having a good meal not only restores Kazuma's energy, but also gives him experience points useful for various upgrades in strength, health, defense and anger, to improve commonly used skills (see the ability to run longer without stopping to catch his breath ) and unlock, as mentioned, new moves that can make the fights more varied and fun. Side missions and side activities The Yakuza Kiwami 2 campaign is in itself very full-bodied and intense, but it is above all the many secondary missions that enrich the experience, making the number of hours necessary to complete everything 100% rise dramatically. Unfortunately, there are several optional quests that are resolved within a few seconds, as already mentioned, and only provide for a settlement of accounts so that the NPC on duty remains satisfied. However, many other stories are really worthy of attention, especially when they shed light on aspects of Kazuma's personality that are rarely highlighted, or when they put the character in completely absurd situations. A couple of examples without big advances? When Dojima's dragon finds himself dubbing a yaoi video game, only discovering during the course of the work that he has to engrave certain lines; or when a boss wants to show his gratitude by taking him to a place where there are special carers who look after middle-aged men dressed like babies; or even when Kazuma lends himself to modeling for the photo shoot of a very particular professional. To these activities are added the classic minigames of Yakuza, namely darts, mahjong, billiards, cards, karaoke, golf and battling center, as well as the SEGA Clubs in which you can try your hand at the complete versions of Virtua Fighter and Virtual-On, as well as with the inevitable UFO Catcher. Then there are unedited and crazy situations like the Toylets, that is, challenges to those who pee more intensely; or the itchy photo shoots of idols (in the flesh). Finally, there is the clandestine arena of Purgatory, the mysterious underground city seen in the first chapter, and the aforementioned activities relating to the management of a cabaret club and the clan creator: in the first case, a girl must be assigned to each client so that she can entertain him at best and make him spend as much as possible, in the second case placing fighters on the map to stem the sorties of a group determined to ruin our business. Goro Majima's campaign Yakuza Kiwami 2 includes an unpublished mini-campaign in which we will be able to put ourselves back in the shoes of Goro Majima, trying to shed light on a series of internal machinations of the Tojo clan but which seem to go beyond the territory of Kamurocho, towards Osaka. The story is mvery short and with its three chapters it can be completed in less than a couple of hours, depending on the approach, but there are characters and situations that will not fail to excite those who have enjoyed Yakuza 0. In terms of plot, it's funny to find all the typical elements of an episode of the series, even if in a very synthetic way. Under Goro's command we won't need upgrades nor will we be able to complete side missions, just wander around the levels in search of enemies to face, moving as usual from one place to another according to the indications. The fighting style in this case is based on the use of the knife and is really lethal, fast and effective; so much so that you will hardly find any hitches, even in situations of strong numerical inferiority or against the bosses. Playstation 4 trophies There are fifty-nine Trophies present in Yakuza Kiwami 2, and it is clear that to obtain them it will be necessary not only to complete the two campaigns included in the package, but also to try their hand at the many secondary activities present in the maps of Kamurocho and Sotenbori. For example, we will unlock an achievement after completing the first ten secondary missions, winning the cabaret club tournament, enriching the Majima Construction roster for the Clan Creator, or tasting all the types of drinks available at the iconic roadside vending machines. Graphics and sound From a technical point of view, Yakuza Kiwami 2 is a gem: just like for the first episode, the developers have replaced all the assets with recently made materials, giving the game an absolutely current, fascinating and very impactful aspect. There are no flaws in the work carried out by the members of the Ryu Ga Gotoku Studio, indeed there is obsessive attention to even the smallest details, without coming across a texture out of place or a scene that could reveal age original of the production. The adoption of 30 frames per second is justified by the richness of the scenarios, which as mentioned can be visited in their entirety without waiting for any loading: the speech includes shops and restaurants, but also stairs, lifts, corridors and apartments. There are some ragdoll-style glitches during fights and a bit of aliasing happens on some objects in the world, but beyond that there is very little to complain about: the environments have absolutely splendid views and the polygonal models of the characters are impeccable, also equipped with a rich set of animations. A very similar speech can be made for the sound sector, which includes a disproportionate amount of dialogues in Japanese (with English subtitles) recited in a convincing and intense way, as per tradition for the series, and supported by an excellent soundtrack quality.", "date": "2018-08-23", "grade": "8.5"}