{"name": "The Walking Dead: Our World", "ref": "https://multiplayer.it/recensioni/the-walking-dead-our-world-recensione.html", "text": "The Walking Dead: Our World brings together two elements with great potential: on the one hand a famous license like that of the television series produced by AMC and based on the universe created by Robert Kirkman; on the other, augmented reality, a technology made famous in the mobile sector especially by that blockbuster that responds to the name of Pokmon GO. Nothing to say to whoever conceived this mix, therefore, who will not fail to total a few million downloads from the App Store and Google Play; also thanks to the now traditional freemium model, which allows you to download the game for free and use it without paying anything, unless you want to unlock extra items or speed up progression from a certain point on, avoiding the well-known phenomenon of grinding. But how does the game work? By interfacing with the maps and GPS integrated into your smartphone or tablet, The Walking Dead: Our World identifies your position within the city, placing points of interest around you from which you can access as many missions. Some can be reached without moving, for home use; others require you to walk around a bit with the phone in your hand, obviously taking care not to print yourself in a pole and not get run over. Once the stage has been selected, we will be able to choose whether to face the walkers within a fictitious scenario or activate the AR mode. In the latter case, we'll have to frame the floor with the camera for a few moments, then lift the terminal to see the zombies invade the real settings around us. The rest is left to simple tap-and-shoot mechanics. Realism, missions and gameplay There is no doubt that augmented reality is a very interesting technology and we will certainly see new productions, even high-budget ones, that use it to offer us engaging and visually spectacular experiences. Even The Walking Dead: Our World, in its small way, succeeds in this intent: the placement of the undead in the scenario appears plausible and the good level of detail of the polygonal models does the rest, although often you find yourself having to shoot through the companion controlled by artificial intelligence who provides us with their support, selected from a shortlist of characters from The Walking Dead television series, to be progressively unlocked. However, the setting brings with it some problems: on the one hand the completely accessory nature of augmented reality for gameplay purposes, with some situations in which it is preferable (and quite a bit!) to use the fictitious background rather than the real shot; on the other hand, the great confusion that is generated when we find ourselves using a crowded location, with people who continually cross the zombies and whom we actually end up shooting, generating sequences (which can be shared on social networks, moreover) which it would be easy to point out as not very educational. The achievement system always provides good reasons to move forward, collect points and virtual currency, as well as unlock the cards necessary to upgrade many elements, including our weapons; but the gameplay itself is too simplistic to be able to guarantee a minimum depth and some variety, especially in the long run.", "date": "2018-08-18", "grade": "7.0"}