{"name": "Sneak Ops", "ref": "https://multiplayer.it/recensioni/sneak-ops-la-recensione.html", "text": "Stealth action is a type of game that is not easy to manage, which usually requires strict rules in order to function properly. One of its pillars is usually level design: a rigorous and well-studied arrangement of threats, between guards and control systems to avoid, in correspondence with reasoned scenarios, normally represent the main ingredients for building a functioning stealth game. For this reason, the idea of such a title based on practically infinite levels and provided on a daily basis may seem like a sort of heresy, yet in Sneak Ops this solution works properly. The fact is that the Noodlecake game does an excellent job of reducing stealth to a minimum, transferring all the action to a more immediate, strongly arcade level, in which the limits of the paths to follow and the boundaries between safety and threat are perfectly visible. In this way there is not much room left for interpretation: the game action is very close to that of a puzzle game focused on strict and clear rules, with well-defined solutions within a limited amount of possible actions be able to carry out on a map divided into a chessboard. By playing with this limited number of fundamental elements it is possible to create a potentially infinite number of combinations, resulting in ever-changing levels even if structured on the same characteristics and general rules. This is how Sneak Ops manages to be a good stealth action despite being based on an enormous amount of levels and with a practically infinite progression, obviously just don't expect all the different situations and complex gameplay solutions present in large productions belonging to the same genre, because the challenge here centers around a very basic mechanic. Snake Ops Sneak Ops is specially designed for mobile platforms and this is evident right from the control system: in order to work best in this area, the game is based on a very simple interface, in which we simply have to tap on the screen to indicate the point where we want to move the protagonist. The latter moves along a sort of grid that makes up the entire game map and automatically finds the path to follow according to a good pathfinding system, but obviously in most cases it is necessary to calibrate the path to the millimeter, indicating to the protagonist the safer path step by step so as to avoid the numerous threats present in the scenario. The central mechanic of the gameplay involves passing unscathed through the gaze of guards and security cameras, visible as the classic mobile cone from which it is necessary to stay away in order not to be intercepted. In most cases, therefore, we find ourselves choosing routes out of sight, remaining covered behind elements of the scenario or exploiting the limits of the enemies' viewing angles, in a continuous search for the right timing and precisely controlling our special agent at all times. inside the winding bases in which it finds itself. It is possible to attack some guards to obtain a momentary KO but not all soldiers can be taken down in this way, therefore stealth action is always the main choice to face any situation. The levels often offer multiple choices between forks or alternative paths, often related to the collection of floppy disks, which serve as in-game currency for the use of saves. The latter can be done at various points within the long levels, broken up into much smaller sections bounded by doors. Saving can be done by spending the floppy disks or watching advertisements, but it is possible to save a bit by avoiding saving in every situation and thus limiting the function to moments when it becomes strictly necessary, thus also raising the level of challenge. It is also possible to eliminate the ads by spending 3.49 euros, effectively buying the game and thus also unlocking the ability to save freely, even if this is not necessarily a positive thing (while the elimination of the ads is undoubtedly a big step forward) .", "date": "2018-08-16", "grade": "7.8"}