{"name": "Monster Hunter World", "ref": "https://multiplayer.it/recensioni/monster-hunter-world-recensione-pc.html", "text": "Let's make a necessary premise: we didn't expect it. It seems silly to start like this but it's actually exactly what touches us most. Eight months after the release of Monster Hunter World on consoles, and even a couple of months ahead of schedule, Capcom brings the latest and most successful incarnation of its flagship title to PC players as well. What we didn't expect was the success of a conversion that remained in the shadows for several months and that made us think so badly after the last tests that had highlighted an aberrant fluidity. Needless to tell you that we are not here to tell you about the life, death and miracles of a title that was already more than gutted months ago in our first review, which is why after a small smattering we will focus on the goodness of the conversion. Whether you have already peeked at the vote or not, we want to reassure all pcists: Monster Hunter World is not only very enjoyable on PC, but it is most likely the best port ever made by Capcom, and we can only be delighted with it. The New World Let's take stock of the situation: Monster Hunter World is the latest addition to Capcom's huge family of hunting titles. An entirely original genre that has given birth to a series of more or less successful clones, this is the series that has engulfed the Japanese videogame market and which, over the years, has carved out a more than substantial slice of the public also in the West. After about ten years spent on the tiny and poorly detailed screens of PSP and 3DS, the series is finally back where it belongs most, on those home consoles that allow it to express its full potential. This whole idea of rebirth and change has also seen its counterpart in the structure of the title, with a New World, repeated over and over again, as the backdrop to the whole adventure. It is still a rather pristine land, where a few handfuls of hunters get busy within five different biomes and as many huge maps. All well designed and full of elements to interact with, both as regards the collection of materials and as regards the usefulness of certain elements of flora and fauna during battles with monsters. During the scarce twenty missions of the campaign, which can never be retraced but can be replaced through the side missions and the arena, the game will exploit a very simple and banal narrative pretext, that of the search for a great old dragon, to put you in front of a multitude of monsters to hunt in five different zones and habitats. Once these tasks have been completed, the real end game will open, with a series of high-ranking missions and ever stronger and more aggressive monsters, but which allow the collection of better materials and, consequently, the forging of weapons and armor. After all, Monster Hunter has always been nothing but this, the slavish repetition of the same scheme: you hunt a monster, you decide whether the equipment linked to its materials can be useful, and if the answer is positive, you face it that number of times necessary to accumulate all the necessary. Repetitive? There is no doubt, but if the series has this incredible success it is precisely due to the extraordinary depth of an exhilarating and technical combat system at the right point, supported by a lasting progression full of possible variables. Certainly the lack of now key elements of the series such as the G Rank represent a point against the longevity of a title that is already shorter and easier (as far as we are concerned in an extremely intelligent and positive way) than the previous ones; but the fact remains that the team's continued support and current ability to devote themselves body and soul to free DLC could bring us this new and very long section of the end game sooner than we might have thought. The netcode To date, with about forty-eight hours of life, the PC version unfortunately suffers from a constant problem of overcrowding of the servers, which often leads the title to throw you out of the sessions. We are even among the lucky ones, to which this thing has happened just a couple of times, but we know of cases where online cooperation is still impossible. However, when everything works, we have not encountered any problems with lag or sudden disconnections during a group mission, a sign that the work on the netcode is not to be totally thrown away. Just a few adjustments will be enough to make it as fluid and functional as the one we have been enjoying on consoles for months. The port you don't expect There is no doubt that the decision to delay the release of Monster Hunter World on PC has generated some discontent inan increasingly important slice of the public in the video game market in recent years. It is probably for this very reason that Capcom has thrown a huge amount of resources into developing a port that arrives in the shortest possible time. Against all expectations, in fact, just a couple of months after that ~autumn~ announced at the end of last year, the latest addition to the Monster Hunter family has landed on Steam, with great joy and equally commercial success. The rumors of the last few weeks had scared quite a few, given that there was talk of a still rather dirty code and a fluidity that bordered on the unplayable. We therefore launched Monster Hunter World with a certain fear, also thanks to the unfunny coincidence of a strange and incomprehensible pad support, which required us to go through the Steam settings to even be recognized by the game. Once this flaw was overcome and the introduction launched, something immediately made us understand that perhaps the last-minute miracle could have been accomplished. After about fifteen hours spent on the conversion (and more than a hundred on its console counterpart) and a campaign that is now almost over again, we are free to confirm that all PC gamers still scared of buying this title can consider themselves more who are satisfied with the work done by Capcom. It is true that we have tested it on a rather performing configuration and which therefore may not reflect the general public, but following a search for information also through ~less gifted~ friends, we can confirm that Monster Hunter World is appreciable and enjoyable by a large group of players. The possibilities in terms of graphic choices do not make a miracle cry and the general glance is substantially identical to the console one (even losing something in terms of texture definition), but as regards the fluidity and response to commands, this version has nothing to envy to its cousins, on the contrary, it improves the granite nature of the frame rate and the substantially reduced uploads in every respect, brought almost to zero for those who own an SSD. To be honest we have to admit that someone has complained of sudden crashes and some strange incompatibility with some video cards and with SLI. All problems that Capcom is aware of and which it communicated a few minutes after the release and the first reports, but these are isolated cases and we must stick to our experience and those of the good twenty people we have had to deal with .", "date": "2018-08-13", "grade": "9.0"}