{"name": "State of Mind", "ref": "https://multiplayer.it/recensioni/state-of-mind-recensione.html", "text": "The announcement of State of Mind has created quite a stir in the ranks of Daedalic fans. The guys from Hamburg are famous for being among those who best embodied the old point-and-click style within a market that no longer welcomes this kind of experience. After the enormous success of the Deponia series (with a rather tired last chapter to tell the truth), a couple of years ago they managed to surprise everyone again with the splendid Silence, the spiritual sequel to A Whispered World, which will turn ten in the course of 2019. After the parenthesis dedicated to the license of Ken Follett's The Pillars of the Earth, the German team has decided to throw itself body and soul into a profoundly different adventure and which, in some way, wants to wink at more famous titles , such as those of Quantic Dream. We then move on to the third person view and a completely three-dimensional world, as well as fully voiced. The biggest mistake that could be made in approaching State of Mind is precisely that of placing it alongside productions with a substantially higher budget. For this reason, analyzing Daedalic's latest effort is a thorny task. We will try to be as impartial as possible, focusing on some critical issues which, net of the awareness of the production dimension, fail to elevate the title to a great exponent of an extremely appreciated genre and which has replaced precisely what made the Teutonic house famous. An adult and unsettling plot The plot of State of Mind starts from an incredibly current and abused assumption during this year, especially with regard to television. What would happen if, out of the blue, we wanted to transport all the collective consciousness of the people, within a single and huge virtual world. Goodbye to diseases, no more problems, easy erasure of negative memories and virtualization of the body you've always wanted. As idyllic as it may seem at first glance, there is always a price to pay and the need to submit to a system which, like it or not, always has bosses and managers who want to get rich with their own technological prodigy. Already in this way we have perhaps told you more than we should have, but over the course of the ten hours necessary to conclude the title, there will be a way to surprise yourself on more than one occasion, thanks to a rich and never banal script. The protagonist, Richard Nolan, will be joined by a series of other characters, some more successful than others, but all worthy of being told in a large picture that sees the fate of humanity at stake (and we are talking about the very essence of the term ). The campaign is run through a series of cutscenes, interspersed with (sometimes too long) loads, and set in a good amount of different scenarios. In the course of history we will also be able to impersonate four other individuals, who will always be useful to deepen and carry on Richard's story. If you are a lover of the cyberpunk and dystopian genre, State of Mind could easily be one of the best narrative experiences of the genre within the gaming world. Too bad the problems all come together when it comes to the raw gameplay. The static nature of low-budget gameplay Let's be clear: State of Mind is not a disaster. On the contrary, it is a title that runs off rather smoothly and which will almost never become frustrating. Unfortunately this is not attributable solely and exclusively to a great design, which should somehow make up for the limited budget. The biggest problem of the game lies precisely in its static nature. We are now accustomed to titles of this kind that put us in front of a myriad of interactions and possible crossroads. State of Mind on the contrary is the modern revival of a graphic adventure, in all respects. Forget about large areas to explore to find particular interactions; long multiple-choice dialogues with which to steer the discussion in one direction or another. Certainly there are choices that will have important repercussions on the plot (basically a couple during the second half of the campaign) and which will lead to seeing one of the three different endings available. However, these choices come after an incredibly long series of short in-depth scenes (some even rather superfluous) which will only require you to interact with what will be marked on the screen even tens of meters away, through huge narratively justified triangles by the grafts of augmented reality that all citizens possess. State of Mind's Berlin of 2048 is alive and also well characterized but will never really be able to enter theheart, due to a gameplay that is too guided and that when it lets itself go to ~action~ drifts, it pays the duty of a production not worthy of the great titles of these years. One cannot fail to praise the German team's willingness to try to make a leap in quality, but at the same time one cannot deny that the company was only half successful, often leaving a bad taste in the mouth. The adventure resumes during a second part that is certainly more varied in situations and settings, trying to insert even some small puzzles and research of material, but all elements so bland as to leave one indifferent and never fully satisfied, at the service of a narrative that advances with ever-increasing speed and ends when perhaps the title was really starting to get its claws out from the point of view of game design. Daedalic remains aware that he is on the right track to have his say also in the genre of third-person adventures, hoping that someone will notice the talent and decide to invest a few million more in the team. PS4 trophies The State of Mind trophies do not deviate too much from the stylistic features of the genre. Basically everyone, whether it's the ten of bronze, the twenty-two of silver or the two of gold (there is also the coveted platinum, don't worry), gather after completing a story task. Leaving aside the inevitable ones related to progression, all the others will be the opposite of each other, during those short and forgettable phases in which to choose whether or not to feed your child, or if you have managed to put him to sleep. Nothing too difficult, you just need to repeat the operations necessary to collect all the collectibles. Technique makes style What Daedalic has managed to find the right compromise between ambitions and possibilities is the technical and stylistic aspect. Forget the Detroit facial models and animations. Also forget about the incredible performance capture of the Quantic Dream title and try to immerse yourself in a dystopian world that focuses all its innate inspiration on the low-poly style. The world represented in State of Mind is improbable and damned far from photorealism, but the choice to represent everything through models made with this technique also allows it to surprise and not disfigure. The textures do not make a miracle cry and the animations are the most basic it is possible to find on the market today, but the design of the world and its reinterpretation of a very close Berlin allow the player to enjoy the right identification. The dubbing then varies from excellent to good and the possibility of playing the title completely subtitled in Italian will make all those of you who still do not speak English happy. The soundtrack is discreet, which never leaves you stunned, but is able to give you some good glimpses, especially during the excited final stages.", "date": "2018-08-13", "grade": "7.5"}