{"name": "Overcooked 2", "ref": "https://multiplayer.it/recensioni/overcooked-2-recensione-PS4.html", "text": "The Cooking Mama franchise seems to have burned down and died out at one point, but the love between video games and culinary science continues. Like all romantic relationships there are ups and downs, and the titles of the Overcooked series represent the ups: after a first episode able to sell quite well on consoles and PC, Overcooked 2 is also ready to debut on all platforms in a bit circulation. Behind the scenes, probably in a chef's uniform, there are once again the guys from Ghost Town Games and Team17: we spent several hours in the company of stoves and dishes to prepare, and it's time to understand where and how the second chapter innovates of the series, or if instead he simply limited himself to proposing the same winning recipe. Does Gameplay prefer it grilled or well done? Overcooked 2 is a small but solid party game in which the player improvises as a funny chef: his task is to carefully prepare the dishes to be served to customers and also bring them to the table in time before their interest fails, collaborating meanwhile with the other companions and avoiding creating a mess in the kitchen. Those who have spent hours with the first Overcooked at the time will already be perfectly at ease with a sequel that completely inherits its basic mechanics: this has allowed the developers to play it safe right away, where by altering even only partially the gameplay they would have perhaps compromised the delicate balance on which the production philosophy rests. The premise is one of the funniest and most improbable: the ruler of the Onion Kingdom has obtained the powerful Necrognammicon (one of the many quotations from the title: Lovecraft's Necronomicon) and awakened a ravenous horde of Malfirm Bread from their own graves. Only the most skilled chefs can save the realm, preparing all kinds of delicacies to feed the attacking zombies; it is clearly a mere narrative pretext, to somehow justify the long sequence of levels always marked by the same objectives: to prepare food in time and serve the dishes on the table. And the Story Mode of Overcooked 2 offers so many levels: they are divided into different game worlds, each of which is easily accessible on the colored board that acts as a map and main hub. Starting from the castle of the Onion Kingdom, the chefs move aboard a small orange pickup truck on the game map, gradually reaching more and more distant stages. Each level represents a challenge in the kitchen: alone or in company you have to prepare the delicacies indicated at the top left of the screen. Each kitchen has different areas from time to time in which the main materials are arranged, stoves, pots, sinks to make your dishes shine, cutting boards and then the area in which to place the dishes ready to be served to customers. A short tutorial immediately puts players at ease, showing the fundamental elements of Overcooked 2 gameplay: knowing how to manage your own kitchen, and above all knowing how to coordinate with other players. It all seems extremely easy: there are the foods that are still raw, there are the cooking points, just ~combine~ the dishes within the same dish and then take it to the customers. In practice it's a whole different story, because the tasks must be done quickly, you always have to keep an eye on all the stations, the recipes change from level to level becoming more elaborate, and above all a cook can never do two things in the same same moment. While the pasta is finishing cooking, it can be tempting to start slicing the tomatoes, but just a couple of seconds of distraction and the stove ends up in flames, forcing the team to take up the fire extinguishers and bring the work environment back to normal. normality. The coordination between the players is therefore the heart of the entire production, and Overcooked 2 is designed to be played in a group, not alone: of course the Story Mode can be tackled alone, but the difficulties will certainly not be few, and reaching the maximum score within the most advanced main levels practically impossible. Not to mention the bonus levels, in which the challenge rises decidedly upwards, proposing increasingly complex cuisines and with more difficult steps to learn and manage in an optimal way: for example, adding phases of boiling and frying, or mixing less linear ingredients than usual. Playstation 4 trophies Overcooked 2 also serves up a large group of Trophies on the table, including a glittering Platinum Trophy. Obtaining them can prove to be a desperate undertaking as well as a real walk: playing alone it will be really difficult to be able to accumulate aperfect score (3 Stars) in every single game level of every proposed world, but in the company of a couple of friends everything becomes extremely simple and immediate, just being able to coordinate. Among other things you will also have to play a series of matches online and in the company of other players. Online mode and bonus recipes: the dessert is on the house Overcooked 2's Story Mode is a welcome addition and in itself offers several hours of entertainment, especially considering that each level can be replayed at will by yourself or with friends, taking home up to a three-star reward for completing served many dishes within the time limit, accumulating substantial tips from customers. But the real novelty of Overcooked 2 is the addition of a mode that fans have been asking for for some time: the Online one. No more cumbersome procedures for two to play on the same PC: now on the latter and on consoles it is possible to select the Cooperative or Versus Game Mode and participate in games with up to four players simultaneously. It is possible to choose to collaborate with a group of friends to complete the mission objectives (cook, cook and cook again) or challenge them to whoever manages to serve the most dishes in a row while respecting the recipes on the screen, always with the whole series of obstacles proposed by the game levels. Unfortunately we were able to play a few games online, because there are still not enough users with their own copy of the game, but what we saw seemed stable and functional: in the absence of a pair of headphones and voice chat, a quick emote base allows you to praise (or taunt) your teammates' performance. In terms of content and technique, Overcooked 2 is a very solid production, it proposes ideas that have already proved successful at the time, and it insists on elements that could be further enriched. Again there is not only the Online Mode, in itself already a fundamental incentive capable of pushing everyone to buy a little, but also completely new recipes such as burritos, sushi and sashimi. You won't find many unpublished ones before completing the main story, but those present are certainly a further stimulus to the variety of game situations and the actions to be performed in the kitchen; the possibility of customizing your own chef also goes in the same direction, choosing from a series of funny human or animal characters, and gradually unlocking new ones by completing the various levels. Some are less inspired than others, especially human ones, but it's hard not to love anthropomorphic animals, among which we mention at least the crocodile, the panda and the mouse. Equally noteworthy is the soundtrack, with audio tracks in some truly memorable and very successful moments, and the excellent level design choices: maps that change due to atmospheric events, malus that put a spanner in the works of our chefs, rotations of the playing field and slowdown platforms are just some of the many obstacles between a well-cooked dish and its customers. Of course, the other side of the coin must also be considered: the novelties mentioned are also the only ones that make the real difference with the first title of the series, and if you don't have friends to play with on your sofa it will be difficult to get satisfaction from the campaign game, because it is not possible to get help from chefs controlled by artificial intelligence and you risk going crazy managing everything alone, especially in the last worlds of the main adventure. Of course, after all, the best dish is also the most difficult to prepare.", "date": "2018-08-07", "grade": "8.2"}