{"name": "WarioWare Gold", "ref": "https://multiplayer.it/recensioni/warioware-gold-la-recensione.html", "text": "Even though we've all had a soft spot for Wario since his first appearance, and though the bond has since strengthened with Wario Land, it's certainly thanks to WarioWare that love has become something big. Because when WarioWare, Inc .: Minigame Mania arrived on the Game Boy Advance in 2003, the madness of such an over the top character exploded in full force of him. A collection of minigames, or rather microgames, each lasting a handful of seconds, to be played in quick succession; each with a different functioning, to be understood and translated into success in order to move on to the next one immediately afterwards, seamlessly. Over the years the various chapters have introduced new mechanics sewn around the capabilities of the hardware, passing from the use of only the keys to the introduction of the accelerometer (WarioWare: Twisted!) to that of the touch screen (WarioWare: Touched!). A remarkable success, which led to the release of 6 episodes in as many years. Then a certain impoverishment of ideas or simply the wear and tear of the basic formula itself led to a slowdown in the pace of publications, so much so that it was since 2009 that a WarioWare on portable consoles had not been released, with only Game & Wario for Wii U released in the meantime. However, WarioWare Gold for 3DS is not a restart or a rethinking of the franchise, but rather a compendium that summarizes in a single title the best seen throughout the microplayer career of the fat mustached anti-hero. Old and new gameplay In fact, WarioWare Gold contains over 300 mini-games, a record figure for the series. However, only about fifty of these are really unpublished, with the vast majority recovered from the previous chapters. This is a partial disappointment, which quite clearly indicates that a large budget has not been exactly dedicated to the game; on the other hand, the publication on 3DS, a console at the end of its brilliant career and now inevitably used for the most part by a very young or casual user, realistically indicates what the ambition of such a title is. Precisely for this reason, WarioWare Gold is probably more suitable for those with little or no experience with previous releases than for longtime fans. The structure of the Story Mode precisely provides for a subdivision into 3 categories of challenges each divided into 5 levels: the Pigiatutto league, the Giratutto and the Toccatutto. Each of them is, predictably, linked to a type of mechanic among those mentioned at the beginning of the article, which therefore refers to the most successful episodes of the series. Each level is dedicated to one of the historical characters who have accompanied Wario over the years such as Jimmy T., Mona, 9-Volt, Dr. Crygor and so on, all with their relative short storyline told through fully voiced sequences in an excellent way . It's a pity that the stories are rarely truly inspired, eliciting a few smiles at best, and a yawn at worst. Obviously the gist remains the microgames, and from this point of view it cannot be denied that WarioWare Gold still manages to entertain today, despite the strong sense of deja-vu destined to be felt very soon by those who have followed the franchise carefully over the course of Some years. More accessible difficulty Between hairs to pluck, fingers to stick in the nose, doors to keep closed, kittens to keep dry from the rain under an umbrella or rather micro sequences of Nintendo games from the 8 and 16 bit era to be completed in the blink of an eye , time passes pleasantly. That WarioWare Gold is aimed above all at a ~new~ user is also confirmed by the system of continuing the game even after losing the initial 4 lives, all this simply by paying out a modest amount of coins. This inevitably lowers the overall difficulty level, to the point that veterans will necessarily have to complete the Story mode (in no more than a couple of hours) to unlock some slightly more substantial challenges. At this point the greatest incentive to continue playing, beyond the records to break, lies in the accumulation of the aforementioned coins to be used to buy the many collectibles to be unlocked via a Gashapon-style machine. These are divided into categories, and most of them are interactive, thus giving a further playful depth to the pure and simple completionist will. It is a little sad to note that in no case within WarioWare Gold is the three-dimensional effect exploited, although it was a clearly unsuccessful feature in the offer of Nintendo's last pure portable. On the visual component, given the characteristics of the game, there's not much to sayor to expect, while the audio component - as already mentioned - deserves applause for the brilliant and complete dubbing in Italian.", "date": "2018-08-02", "grade": "7.4"}