{"name": "La Mulana 2", "ref": "https://multiplayer.it/recensioni/la-mulana-2-recensione.html", "text": "Whenever the difficulty of video games is brought up, everyone pulls Dark Souls out of their magical columnist hat, as if the From titles were the only ones who had the courage to abandon the too permissive level of challenge of blockbusters modern. For heaven's sake, the merits of the work of Miyazaki and company are undeniable, but back in 2005 an equally complex and full of mystery title was released, the difficulty of which makes souls-like seem like a picnic on the plain during a mild spring day: La-Mulana. Not that the notoriety of the project is comparable to that of the aforementioned series: Nigoro's work was initially born as a ~passion project~, and a technical sector designed to make it look like an MSX title has certainly not helped to amplify the media resonance. however its impressive depth (or the echo of curses, one of the two) has managed to make it a small cult, to the point of starting the development of a complete remake with a more modern graphic design. Today that remake is considered among the best 2D video games ever created by a minute but a very passionate handful of fans, more than enough motivation to make the sequel a sort of polar star of two-dimensional gaming for anyone who had the mental strength necessary to complete it. And we want to tell you about that sequel in this review, since it took years for Lemeza to pass the baton to his daughter Lumisa, but finally La-Mulana 2 has arrived among us, ready to tear us apart with even more cruelty than its predecessor . Ruined holidays We immediately put the foundations of the narrative on paper, given that La-Mulana 2 is a direct sequel also from the point of view of history, and sees Lumisa - the blonde daughter of the previous protagonist - committed to following in the footsteps of her parent due to mysterious events concerning the ruins of La-Mulana. After the previous adventure, in fact, the mysterious complex was almost completely destroyed and reconverted by the good Xelpud into a lucrative tourist attraction... which is once again populated by monsters for no apparent reason. Your help therefore becomes necessary to protect the investments of the sympathetic old man, and it won't take too long to discover that the origin of the evil is no longer La-Mulana, but another place of perdition called Eg-Lana, even more perilous than the previous. For the record, if you hadn't understood it from the premises, even this sequel doesn't take itself absolutely seriously: the characters are always absurd and the advice that arrives via email from Xelpud and the other supporting actors, albeit useful, are always designed to make you do some good laugh. That said, the plot takes advantage of a perhaps excessively convoluted mix of various mythologies, which makes it all a lot more confusing than the first chapter. In any case, a minor defect: the qualities of Nigoro's work reside in something else. On the other hand, you will only absorb the story through remote communications and talking to some characters scattered around the ruins of Eg-Lana, since La-Mulana 2 is not a linear experience, but a terrifyingly branched metroidvania exactly like the game that makes it preceded. Here the watchword is ~exploration~, and there is no need to be deceived by the first half hour - much simpler and more guided than the beginning of the first adventure - because a few hours of play are enough to realize that the new ruins are not they will have no pity for the beautiful Lumisa. The progression, in this videogame, is after all very different from what is usually observed even within this complex genre: the Nigoros wanted to make La-Mulana ~a natural evolution of 2D games~, and to do so they thought avoid like the plague an easy to understand level design, shortcuts to follow naturally, and clear indicators. Of course, wandering through the various rooms you will find switches and alternative ways capable of making navigation easier, but we are still talking about a title where forgetting a clue, failing to solve a puzzle, or leaving out some detail can block you for hours, not minutes. The charm of pain Much of the charm of La-Mulana lies precisely in this nastiness: its ruins are overwhelming, a very difficult skein to untangle. The fact of being able to teleport between the few save points available does not deceive you, because you will still have to memorize (or mark somewhere) those places where - due to lack of objects or skills - you have remained staring into space, and you will often find yourself gladly doing crazy and desperate backracking to find the right chest, or notice a minuscolo forgotten but fundamental passage. This type of advancement is certainly not for everyone, and we assure you that it can be frighteningly frustrating at times, since it happens that you overcome horrific obstacles only to reach an area that is useless at that moment, or have moments of lightning-fast progression interrupted by some trap mortal. However, we must not give up, because when you manage to make concrete steps forward in La-Mulana 2, the satisfaction is incredible, and clearly superior even to that felt in the predecessor. Yes, because this sequel takes the philosophy of Lemeza's adventures to the limit: here practically every object, including secondary weapons, has some specific use for activating the mechanisms hidden in the halls of Eg-Lana, and it is therefore impossible even to consider one's own attack tools as simple weapons (not to mention that sometimes it is necessary to sip them to always have someone available). Everything is taken to the limit, including the apps that can be installed on the protagonist's laptop, which not only allow her to receive messages or obtain extra clues, but also to memorize indispensable mantras to advance or to take advantage of ~negative~ saving tablets that would otherwise be useless for teleportation. PC memory is limited though, so you'll have to install and uninstall as needed. True, sometimes the formula becomes too convoluted, and anger rises easily when hours of progress are lost due to a well-concealed trap door; yet La-Mulana 2 manages to completely capture the player's gray matter, pushing his observation skills to the limit. No other 2D game out there forces it to the same level, and the fact that it's even more pronounced in this sequel can only make us love it. Pixel perfect Of course, the game is not lacking in flaws even if observed in this light: on the one hand, its very intricate structure is amazing, but if more often than not the traps are indicated by some clue (corpses nearby, a skeleton with a note to read, et cetera), dangers can happen that are sudden and nearly impossible to avoid without guidance, and it's a really annoying form of trial and error in an already so bad product. The bosses, then, are difficult to defeat - and never so numerous due to the presence of midbosses scattered in the various areas - but many of them are not particularly inspired and are often easily bypassed if you catch the imperfections of their patterns (the thing at the sometimes it is clearly intended, sometimes it is not, and allows you to eliminate enemies enormously more powerful than you well ahead of time). The combat is also identical to that of the predecessor, and is therefore very close to that of the first Castlevania: Lumisa is armed with a whip like her father and just like him, she only attacks frontally, but she gets various primary weapons in the game equipped with attack areas different, while the secondary ones are designed to make the most of the weaknesses of some opponents; the platforming element and positioning are therefore the real focus of the action. Yes, in short, perhaps more could have been done in terms of overall evolution, and although there are new mechanics in the game such as the possibility of walking crouched, or interesting interactions of certain objects with special surfaces (the claw allows for example to rotate around to some columns), La-Mulana 2 follows exactly the formula of the first episode, trying to take it to the next level with even more puzzles, things to note and secrets. In all sincerity? That's perfectly fine: it was an almost perfect equation before, it still is now, and the only slightly out of place thing we found is the increased need to take care of NPCs, which can derail in some moments. Overall, this game is truly a stellar experience for any hardcore gamer, sure to challenge even the most seasoned of gamers. Seriously, it's harder than the first La-Mulana; the Nigoros didn't hold back at all this time. The end is far away We close with the technical sector, although there is not much to say about it. La-Mulana 2 is aesthetically very similar to its predecessor, and maintains a very pleasant retro style, with some improvements here and there. It's certainly not the most beautiful game around, but its look works, the variety between the areas is remarkable, and the simplicity of the graphics is necessary so as not to lose sight of some very important details during exploration (there are, for example, very well hidden on certain surfaces, which if lost from sight can block progression for a long time).The most evident improvements are linked only to the animations of Lumisa, more accurate than those of Lemeza, but it is a small thing. More important is instead to go back to the hardcore element for a moment, because we have to make a sad admission during this review: we weren't able to complete the game in time for the embargo, and even waiting a couple of days beyond the established date doesn't c 'was way to get to the finale. We played La Mulana 2 almost without breaks, but even after thirty hours it still seems like we still have an eternity to the final stages. This should make you understand what the scale of Nigoro's title is: we have explored countless areas, defeated bosses of all kinds, collected an inordinate number of objects and skills, yet we believe that it will take at least fifty hours before reaching closure, always that something doesn't block us first. It's our personal ~mea culpa~, but even if for some reason the title breaks completely in the end (and we strongly doubt it, considering that we only found a handful of bugs during the adventure) the quality of what we played up to now is such as to consolidate our assessment without ifs and buts. Whatever the cost, however, we will arrive at that damned conclusion, as we did for the first chapter.", "date": "2018-07-31", "grade": "9.0"}