{"name": "Mega Man X Legacy Collection 1 e 2", "ref": "https://multiplayer.it/recensioni/mega-man-x-legacy-collection-1-2-recensione.html", "text": "We believe there are few franchises as iconic as Mega Man X. The Capcom series, which began in 1993 on the Super NES, represents a twofold evolution. On the one hand, the Blue Bomber saga made the leap in technological quality with all that it entailed also in terms of level design, much more complex and layered than that of the Mega Man who had preceded it. On the other hand, Mega Man X earned a much deeper and more intricate story and lore that developed from episode to episode with the addition of new characters and revelations: it certainly didn't reach the levels of an RPG, mind you, but it toyed with fan expectations and what little they knew about the fate of Mega Man, Protoman, and so on. Playing Mega Man X, in chronological order, is not only like taking a dip into the past, because it is also a study on how video games have transformed into a single generational passage, and not only on a graphic level, but also on a structural level. The Mega Man X Legacy Collection released these days finally allows anyone who has missed these historical titles to fill the gap and find out why some of them still remain today, after all these years, among the most loved video games ever. Legacy Collection 1 If it is true that not all Mega Man X have succeeded with the hole, almost nothing can be said to Legacy Collection 1 which includes the first four episodes: Mega Man X 3 is perhaps the weakest of the quartet, but mostly because, despite the innovations it introduced - such as the possibility of controlling Zero, albeit very limited - as the last title for the SNES was a little too ~more of the same~. Mega Man X and Mega Man X 2, on the other hand, are simply unassailable, and perhaps because they were less loaded in terms of gameplay and still lived in a moment of relative simplicity in which the design of the stages and bosses was the absolute protagonist. Furthermore, this compilation comes out in a period in which the taste for retrogaming and pixel art is strong, so it is even easier to appreciate the level of detail that the Capcom artists had managed to instill in each stage and in each sprite, guaranteeing a variety of enemies and situations still unbelievable today. And it was the early 90s, years in which Mode-7 was one of the most sophisticated graphics devices around. We highly doubt you've ever played a Mega Man in your life, but if so then it's worth specifying that Mega Man X takes place in an unspecified future where the Reploids, androids with free will, live shoulder to shoulder with the human beings. When some of them go mad or turn evil, they become Mavericks and at that point bounty hunters such as Mega Man X, Zero or Sigma enter the game: the latter, in turn contaminated by a virus, at one point declares war to humanity and becomes the main nemesis of the series. The common thread that binds the various Mega Man X is actually much more complex than that and has its roots in the mythology of the series and in the experiments of Light and Wily, the scientists who had built Mega Man and the Robot Masters in the original series. The first title of the X series to give greater prominence to the narrative component is Mega Man X 4, the game that closes the Legacy Collection 1 and which made its debut on PlayStation and Saturn in 1997. Many fans consider it the best exponent of the franchise for via the numerous cartoon interlude sequences, the elaborate plot and, above all, the possibility of controlling a version of Zero that is completely different from X both in terms of mechanics and in the development of the story. Legacy Collection 2 Capcom has well thought of dividing this Legacy Collection into two packages and it is possible to choose which one to buy digitally at a rather low individual price. The second compilation includes, of course, the other four games released between 2000 and 2004 with mixed results. Mega Man X 5, in the original ideas of the historical producer Keiji Inafune, should have concluded the story with a tearful ending. On the gameplay front, it introduced quite a few innovations such as the possibility of ducking and clinging to supports, but also a series of RPG-like mechanics that should have revived the formula: according to many fans, however, they only ended up weighing it down and endings multiples, based on the progression of the player and on some choices made between one stage and another, have messed up the mythology of the series a lot. Mega Man X 6, in fact, takes place shortly after the conclusion of the fifth episode, and calls into question some twists with ambiguous consequences. They're both great platformers, featuring even cleaner, sharper 2D graphics, but feel easily scriclock structure and tight budget. The situation of Mega Man X 7 and Mega Man X 8 is much more complicated. The two titles that close Legacy Collection 2 were both released for PlayStation 2 between 2003 and 2004. Capcom had desperately tried to renew the formula of the series but Mega Man X 7 had mostly turned it upside down: using a 3D engine and the cel shading effect, the Japanese developer had decided to alternate the horizontal scrolling sequences with a series of completely three-dimensional stages in which Mega Man, Zero or the new supporting actor Axl are filmed by a camera behind. The idea may not seem bad, but the pace and the control system - the pride of the series since the very first episode for the SNES - absolutely failed to replicate the glories of the previous episodes. For this reason, Mega Man X 8 returned to propose a structure in two and a half dimensions, using polygons only to modernize the look of the game. In this sense, the latest Mega Man X to be released ever is also one of the best of the compilation thanks to the fast pace of the action, a series of interesting innovations - such as the possibility of controlling two characters at a time - and a level design much more polished than the other titles in the Legacy Collection 2. It's not just a compilation While dividing the Legacy Collection into two distinct volumes, Capcom has included the same additional content in both, so that players can enjoy them regardless of the compilation they have decided to purchase. The main novelties, in terms of actual playable content, are certainly two. The Beginner mode allows you to face every single Mega Man X with a series of significant concessions that make the experiences much easier: Capcom titles are decidedly difficult and can become frustrating, therefore the possibility of inflicting more damage, taking less and not dying instantly in contact with certain surfaces such as barbed ones, they could be useful for those who want to enjoy the games without too much paranoia. The Challenge mode, on the other hand, is completely at the other end of the spectrum, guaranteeing above all to the veterans of the series a kind of not bad ~boss rush~: in fact, the players must fight not one but two bosses at the same time, coupled with themes that fill the screen of attacks and obstacles to dodge with pinpoint precision. In short, memorizing the patterns and the right weapons to use in each stage is essential. To complete the offer, there are a series of secondary goodies. The most interesting is undoubtedly the OAV ~The day of Sigma~ originally proposed in the Mega Man Maverick Hunter X remake for PSP: it lasts half an hour and tells the transformation of Sigma into Maverick. The other contents are the classic ones that are found in all compilations for better or worse: a collection of illustrations, a jukebox to listen to every single song, the various historical trailers, even a catalog of action figures and other collectibles. If we can be considered quite satisfied in terms of content, it must be admitted that Capcom has done a more discreet job also on the conversion front, net of some slip-ups. Obviously it is possible to customize the experience by choosing between two filters that soften the pixelated graphics or superimpose an effect that simulates the rendering on cathode screens, and it is also possible to reconfigure the keys, choose between different languages - which, unfortunately, does not restore the original Japanese audio in the cartoon intros, so you can forget about playing Makenai Ai Ga Kitto Aru etc. - and save your game instead of memorizing passwords in the case of the more archaic Mega Man X. It goes without saying that the first Mega Man X in two dimensions are the ones to suffer the most on the wider panels, which is why we found ourselves much more comfortable in portable mode with the Switch version: on the small screen, in fact, the Mega Man X still look great, even if we noticed some unjustifiable slowdowns in the most agitated sequences, slowdowns that also occurred in the original versions due to the strain to which the SNES hardware was subjected but which, frankly, we would have preferred not to see again in 2018 even at the cost of betraying the fidelity of the conversion. The reasons for these issues are still unknown - there's no way the Switch can't handle two-dimensional titles from the 90s better, so the problem could be related to the way the console is emulating them. Mega Man X 7 and Mega Man X 8 have instead undergone a form of superficial remastering and boast sensitive anti-aliasing and a generic frame rate.ally stable, which helps to better digest the questionable choices in terms of character design and animations. Furthermore, having only tested the Switch version, we can confirm the existence of a sensitive and annoying input lag: in portable mode it is less pronounced and you can play without too many problems, while when the console is in the Dock it becomes decidedly annoying and frustrating.", "date": "2018-07-27", "grade": "7.0"}