{"name": "Go Vacation", "ref": "https://multiplayer.it/recensioni/go-vacation-recensione.html", "text": "In addition to a rather sunny mood, Go Vacation in the Switch version made us smile more than anything else because the form and substance are of a Wii game. Polygons, textures, appearance, logic and above all concepts all sink their hands into an era that is in some ways magical, albeit quickly forgotten by consumers who are now tired of motion control at the time. For this and other reasons it is ironic to note that the port of Bandai Namco - very direct - is a casual party game in an era completely opposite to that of the original release as today, of casual game consoles linked to motion controls, there are no they are practically more. There will be a reason, you say, and we agree; but Go Vacation was and is a product mainly for children, with activities, gameplay and philosophy designed for a very young user, perhaps even on vacation, so it should be treated and explained as such. What unfortunately, in such a context, clashes a lot, is the full price: there are some small innovations but for a simple port with increased resolution, seven years later, it is strange to ask for such an important donation again. Adventure park With four thematic resorts available, Go Vacation is essentially a large park of mini-games within which Bandai Namco, to differentiate its creature from first-party competitors and increase player satisfaction, had inserted exploration mechanics and small discoveries. On Switch, everything develops in a similar way: the solo adventure is a long guided tutorial in which by changing means and following advice and indications, you pass from one game to another without real solutions of continuity, through an always calibrated learning curve down to a low level of difficulty. If experienced by young and inexperienced hands, the journey turns out to be fun; the Go Vacation single experience is a path that maintains itself on the same line of entertainment, without ever getting up to peaks but not even going down too much into playful flatness. Our hands, however, have been extensively trained by years of motion control: unfortunately, if the age range rises, the adventure mini-games struggle to take hold. The gameplay is almost always dominated by basic movement mechanics, as well as by combos of up to two keys, which translates into what was written above: the difficulty and structure of the single player is not made for expert users, but for entertaining groups of precise players, or casual. There are nice mini-games, others less so, some fresher, sometimes already seen or with a truly non-existent bite. The exploration logic works quite well: the alternation of available vehicles and the presence of secrets provides a good little bite to experiment and turn, alternating progress mini-games here and there. Nothing incredible, but not noteworthy either; the loading screens are more surprising than anything else, very dry and sometimes long. All in all, the proposed single route is worth the sum of the parts. More The adventure, in addition to providing a neutral journey, without particular narration or interaction with non-player characters, is the tool that allows you to unlock the mini-games outside the story and then re-propose them in group contexts. If this is your real goal, know that the Switch version makes a fairly faithful transposition of the original counterpart, supporting the Joy-Con, the Pro Controller in single and multiplayer up to 4 people, perhaps even using a single pad in specific cases. It must be said that the human element immediately undermines the CPU issue: having sentient people alongside exponentially raises the interest and profile of games where there is a competitive margin, making some experiments even very fun. How not to mention the challenge with squirt guns or snowballs, or trivially even tennis, albeit less refined than experiences at the time queens like Wii Sports: in short, there are moments of pleasure in multiplayer, a sign that the casual game of minigames still knows give satisfaction if positioned in the right way. Go Vacation is inspired by other sacred monsters such as The Sims to offer construction and customization mechanics: the game offers the possibility to build a villa and fill it with objects. Just let yourself go to the challenges launched by the NPCs to enrich yourself with tools to give touches to your villa. Again nothing earth-shattering, but it's a nice addition. Apart from this, let's return to the focus of the paragraph: it is evident how Go Vacation thrives on multiplayer and it is within this circle that the product offers slightly more transversal activities in terms of personal data.", "date": "2018-07-27", "grade": "6.5"}