{"name": "No Man's Sky Next", "ref": "https://multiplayer.it/recensioni/no-mans-sky-next-recensione.html", "text": "The universe is a boundless ocean of mysteries, a dark vault studded with bright lights that we observe in amazement from afar, forced by our earthly ties to imagine details that cannot be captured by a lens or by the analysis of the radio signals that they come from the cosmos. But this sensory limit of ours is the engine of a thousand imaginaries, an incubator for thousands of alien races, highly advanced technologies, intergalactic empires and mysteries as profound as the darkness of deep space. No Man's Sky is made of this material, the long-awaited promise of a living and ever-changing universe, a hybrid between survival and space simulator capable of enhancing exploration as never before. And it is on this factor that Sean Murray has pushed by any means, inflating the hype of his little boy up to the dramatic debut of a title launched at breakneck speed by the high-sounding declarations of the founder of Hello Games and destined to crash with a very different reality. a reality linked to the effective possibilities of a team that in its moment of maximum size reached 15 employees. The chaos generated by the impact was such that it overshadowed the game's merits and raised fears for its future, but while the network heatedly discussed the hype and the exaggerated reactions of a certain type of audience, Hello Games got to work on the foundations of a lame title but with great potential. And this is how we arrived at Next, the fourth update and a new step towards the hoped-for redemption of a game that has changed enough in the past two years to convince us that the time has come for a new review. The hard journey of a team in search of redemption Sean Murray's enthusiasm has involved us all. Even the most die-hard Star Citizen fans melted imagining a dynamic universe, as alive and deep as the imagination itself. Then, suddenly, here we are again with our feet on the ground, horrified witnesses of a media Caporetto in front of which many would have given up. Yet Murray and his boys didn't do it and, while continuing to stumble over a few declarations too many, they went forward, step by step, driven by the good response from the public up to the Next update which promises to usher in a period of global events and content created following the wishes of the community. It is no coincidence that this update finally allows players to interact, even violently, while introducing aesthetic customization dynamics that undoubtedly appeal to a large part of users. But before talking about it, it is good to retrace the road that has brought us here. With the Foundation update, the Hello Games guys quickly made up for the lack of a challenge, focusing on survival dynamics with a dedicated mode. But the most important novelty in terms of mechanics was the introduction of the bases, complete with a creative mode to plan them without wasting resources, accompanied by crops and devices to automatically collect resources, to leave messages for other players and to create points of rescue. Furthermore, with the evolution of the procedural generation algorithms of the planets, suddenly more diversified and colorful, the variety of visuals has gained, while on the crafting side new resources and new technologies have appeared, but the substance has remained the same, all focused on gathering materials to buy new ships and reload ship and suit systems. The core of the experience has remained a mesmerizing solo journey between visual and musical symphonies, far from the simulation complexity of other titles of the genre and far from online. This at least until the Path Finder update which introduced planetary vehicles, the possibility of playing timed races on circuits created by the players and the online sharing of the bases, the first taste of something structured on the multiplayer side. But what we appreciated the most, faithful like Murray to the idea of an intimate journey through the universe, were the division of ships into classes, the differentiation between weapons and the harbingers of a real functional economy for the most important update of all: Atlas ascent. With the update released on the occasion of the first anniversary of No Man's Sky we finally found ourselves surrounded by a real universe structured on the basis of economies, balance between races and procedural missions useful for obtaining resources and increasing our fame towards the factions. All topped off with new materials, thirty hours of story-related content, terrain manipulation, improvements to atmospheric flight and a taste of multiplayer with the conexploration division. No Man's Sky: four updates for a radical evolution No Man's Sky has grown a lot thanks to the updates that have transformed it into a high quality survival game, a hybrid between adventure and space simulator that takes us through the thousand colors of a universe made of suggestive caves, breathtaking horizons, radioactive storms, mysterious structures , cosmic anomalies, ancient relics, real planets to explore, destructibility of the terrain, infinite procedurally generated animal races, commercial outposts both planetary and in space, deep sea where it is now possible to build, ancient relics and a management of dialogues and exchanges suggestive commercial, made of alien words to learn and engaging descriptions. From this point of view No Man's Sky can today be considered a successful product, undoubtedly superior to any other from the point of view of planetary exploration, although obvious limitations remain as in the case of the combat and flight mechanics which, although improved over time 'inside the atmosphere, are nothing short of basic. But this approach has never seemed out of tune to us from the point of view of a title designed to be a journey before a challenge, at least as regards the main mode which, unlike the survival mode, encourages us more to explore. What we have heard and still miss is a stronger narrative component, partially disappointed by the Ascent of the Atlas update which added 30 hours of content improving the usability of the narrative dimension, but settled for a formula anyway impalpable and diluted, similar to the intimate spirit of the game but insufficient to distract us from the repetitiveness and limits of the no Man's Sky universe. And this is where Next comes into play, with the promises of community events and with the first real interactions between players that replace that first disappointing taste limited to a picnic with friends transformed into impalpable lights. But there are also some novelties for those looking at the survival dimension with the experience becoming more complicated from the point of view of resources and crafting on the wave of a more complex material system, which makes us suffer a lot for the chromatic metal, and of the decrease of the resources obtained from the asteroids. But the fundamental components to move forward are always at hand and it doesn't take long to become familiar with the new features which include the possibility of immediately building the terrain manipulator, now necessary to draw on some materials. The aid doesn't end there, with the addition of freighters to buy and send on missions to increase income and build a true empire. The management dynamics introduced with the autonomous means of collection is therefore deepened and it is here that we find the true evolution of No Man's Sky, even if the addition of a multiplayer dimension, unfortunately limited and destined to arrive late for the GoG version, is undoubtedly relevant in the era of connectivity. The Next update: a step towards new horizons The Next update allows you to load your save to play and chat with friends and strangers in four-player instances. These can be reached through matchmaking, which is decidedly quick and effective in finding compatriots, even if we have preferred to invade the universe of a colleague without paying too many compliments. Guided by an icon who showed us his position, we rushed towards him to exchange two gestures and some objects, but things soon slipped towards the inevitable confrontation which, while entertaining, highlighted the limits of a system of combat designed more to explore planets alone. Things work better in space, thanks in part to the planetary flight adjustments, but the lack of structured PvP makes collaboration all the more appealing. It is clear that structural dynamics such as the sharing of missions are missing, but with friends acting as followers it is possible to aim for more important targets to divide the loot on the deck of our frigate from which we can even command a fleet and which we can further customize thanks to to the hundreds of components added to the base crafting system. Bases that can now be more than one, can be built on any planet, can be immense and are more varied thanks to the addition of hundreds of new components. With such news we are sure that we will soon be surprised by the engineering work of the community, enhanced by the aesthetics of a title that strikes the attention with an effective mix of hi-tech, bright colors, rounded shapes, effectsstylized light fetti and spaceships that appear to be built with colored bricks. But what on paper looks like the nightmare of those who have eaten too much gives us unique suggestions, guaranteeing the Hello Games title a distinct personality. And it is an evolving personality, technically grown with each update and also enhanced with this latest update which improves the rendering of the water, the character models, the planetary textures, the design of the space stations, the behavior of the animals, the details of the aircraft, the generation of the terrain and the clouds, now undoubtedly more lively and dynamic, as well as obviously adding the third person view and the customization of the avatar. All seasoned with various refinements to the interface, now more refined and understandable. Unfortunately there are several glitches and some details out of place, but the technical sector defends itself very well, at least until we talk about performance. The pleasure of entering the planetary atmosphere is punctually compromised by the eternal hiccups caused by loading which are understandable, given the need to represent an entire planet, even if they are more evident with AMD GPUs and this leaves room for optimization possibilities. Possibilities that extend to the framerate considering that a simple spheroidal station drops the performance of our far from modest configuration from 90 to 26 frames per second. In short, not everything still works properly and the new features of Next need some refinement to make full sense. But Hello Games' commitment in these two years has taken us far, so much so as to convince us to believe that Murray's redemption may be just a few updates away.", "date": "2018-07-26", "grade": "8.0"}