{"name": "World War 3", "ref": "https://multiplayer.it/recensioni/world-war-3-recensione.html", "text": "The world of free to play first person shooters is busier than ever and every newcomer, in order not to drown, must present itself to the public with a strong identity and solid gameplay. This is not the case with World War 3 which, in both categories, fails to reach the goals of its competitors due to some technical problems, but above all a widespread lack of originality. Developed by the Poles of The Farm 51, World War 3 has a very strong Slavic iconography in the customizations, weapons, soldiers and above all in the maps that reconstruct, in some cases very well, some iconic locations in Eastern Europe and Russia. Picking up the weapons of World War 3, however, it takes little to notice the many little things that don't work in the game. Its premise is simple: try to merge Call of Duty and Battlefield to create an experience as fluid as Activision's shooter and as modular as the one developed by DICE. The problem is that, in the current state of things, the game does not aim to create something new or innovative but is limited to copying functions and modes from one to the other. However, being free to play and exploiting elements of games that can cost tens of euros even months after their release, the work of The Farm 51 could carve out its own niche of fans and with this review of World War 3 you will be able to understand if you it is an experience that suits you. There is no shortage of weapons The weapon customization system in World War 3 is identical to that of Call of Duty World War 3 can count on a fair number of weapons, all with a plethora of accessories that can be unlocked with use. If you know the Call of Duty gunsmith system then you will immediately go with that of WW3. Each gun has a series of levels, completing which new sights, magazines, types of ammunition, stocks, grips and more are made available. More powerful and advanced weapons are unlocked as the player level increases through the usual system of experience points at the end of the match. Given the unnecessary complexity that has gone into the process of unlocking new weapons in the CoD universe, going back to WW3 simplicity has been a breath of fresh air. If the game does well in terms of quantity and variety, the same cannot be said of the sensation that all these weapons give when using them. The best possible comparison is with the state of Battlefield 2042 at launch - there doesn't seem to be a direct connection between the bullets that come out of the barrel of your rifle and the impact they have on enemy soldiers. The effort in the direction of realism is there, but the developers have chosen a path that is incompatible with the style they have given to their product. No one would fire an assault rifle in automatic mode on a real battlefield - most soldiers use M4 and AK47 in single shot mode to be accurate and not waste ammo. There are games that have replicated this type of guerrilla warfare to perfection and WW3 would like to do the same, but its gameplay is fast-paced and frenetic, rarely tactical. The result is an arsenal that is hard to control in the midst of a confusing firefight. Well thought out loadouts In World War 3 the management of the resources that make up each soldier's equipment is well done Where World War 3 does well on a conceptual level is in the management of the loadout, or everything that a soldier carries around when he is on the battlefield. In addition to the classic primary and secondary weapon, each WW3 operator has an explosive with him (fragmentation grenade, claymore, anti-tank mine, C4, etc...) and a gadget chosen from a medikit, which completely recharges the health of two soldiers , an ammo pack, and an equipment kit that replenishes armor and grenades. Then there are 3 types of armor that offer ever greater protection: Kevlar, ceramic and steel. But beware of the weight: each weapon and each piece of armor has an impact on the character's mobility. This means a slower run, a shorter slide and a reduced speed when passing obstacles. This intelligent and balanced way of managing what your character carries with you presupposes a more reasoned gameplay, in the style of Battlefield, where the goal is to coordinate a team advance rather than a jumble of lone wolves a la CoD. Here WW3 collides again with its identity crisis: it wants to be tactical, but also fast, precise but also explosive and, unfortunately, the final result is more like a Call of Duty with big maps and vehicles than a Battlefield refined and lively. This is also seen in the systemrespawn, which is heavily taken from Battlefield (along with the squad management system) but which the game DICE lacks the intelligent reading of what's going on around a squadmate. We often happened to be positioned in the open in a line of fire (and not behind the cover that our ally used) or to appear inside a wall, unable to move, because there was not enough space in a closet or on stairs for our body. Vehicular disaster A rare moment of stability aboard a vehicle in World War 3 Where World War 3 let us down the most, though, is in vehicle handling. They are wooden in interactions with the playing surface and have a serious problem of lag for those who look at them from the outside, especially the smaller and more agile ones. This problem reached extremes where some light tanks, from our perspective, teleported 3 or 4 meters forward or backward when we tried to hit them with a rocket launcher. Even the audio management of some means of transport is full of flaws. Helicopter and bombing sound effects, for example, have a problem with the difference in volume between when inside a building and when outdoors. The sudden change in volume when exiting a door was such, at times, that we had to quickly take off our headphones. Heavy tanks also have a very low engine sound so it is difficult, while running alongside, to distinguish a functioning enemy vehicle from those used as scenery. The only positive note of WW3 vehicle management is that, unlike Battlefield, the tool to repair them is available to everyone: to use it, just approach a damaged vehicle and you will be offered to equip it to fix your tank armed. There is also a problem with the operator lines of dialogue, which we were provided with sometimes in English, sometimes in Russian or sometimes in Chinese. However, the idea of making the character count the seconds in which he is ~cooking~ a grenade or when, having removed the fuse, is held in his hand to anticipate its explosion once launched.", "date": "2023-01-12", "grade": "5.5"}