{"name": "La recensione di GRIDD Retroenhanced", "ref": "https://multiplayer.it/recensioni/recensione-gridd-retroenhanced-nintendo-switch.html", "text": "GRIDD: Retroenhanced was born from an idea of Antab Studios, a small independent Italian team made up of only three people. As you can easily guess by looking at the images, the developers wanted to create a game that paid homage to the 80s; on the one hand with the captivating neon graphics that wink at Tron, on the other with the classic shoot'em up structure, combined with a graphic sector more in line with current events. In reality, the first episode of GRIDD was released on mobile, more precisely on Windows Phone, with a more traditional structure: that of the canonical horizontal scrolling 2D shooter. Some time later there was room for a sequel also proposed on Android, where for the first time a 3D structure was adopted with a view positioned behind the spacecraft to be controlled. GRIDD: Retroenhanced is basically an evolution of the same concept to adapt the game to home platforms. The first version released was the one for PC, available on Steam since May last year, which was immediately followed by the conversion for Xbox One a few weeks later. Now, almost twelve months later, the frenetic shooter from Antab Studios has also landed on Nintendo Switch and we have thus taken the opportunity to try it and put our sensations on paper. Arcade mode The old school atmosphere that is already perceived at the first impact with GRIDD: Retroenhanced passes first of all from the audio sector, based on effective electronic sounds that are repeated in a loop without being tedious. Indeed, the opposite is true: the music manages to effectively support the rhythm of the game, supporting the frenzy that makes its way as soon as you enter the tricky Arcade mode. Once you take to the field you have to start dodging laser beams, light barriers and fierce enemies at maximum speed who will do everything to put a strain on the reflexes even before the patience of the user. The small aircraft to be controlled will function as a sort of trojan intent on insinuating itself into a super-protected mainframe to destroy its code from within. To succeed in the enterprise, it will be necessary to deal with a highly hostile Artificial Intelligence, which will use every resource to keep the infrastructure operational and safe. The spacecraft moves at a fixed speed, so it is not allowed to accelerate or decelerate as needed. The only possible action is dodging. For the rest, all you have to do is shoot everything that moves, doing your best not to suffer damage to the hull. To put it in other words, GRIDD Retroenhanced is the typical title that, just to pay homage to the glorious 80s, offers a very simple and immediate gameplay. However, under accessibility there is a level of challenge that is decidedly not within everyone's reach. At this point it is necessary to make some clarifications on the management of the shots, which in the opinion of the writer have proved to be more of a limitation than a way of enhancing the interaction to differentiate themselves from other illustrious exponents of the genre. The view located behind the spacecraft is not only not fixed, but it is also positioned slightly at three quarters: this translates into a few too many headaches in the initial stages of the game, especially when you have to get in tune with the management of spaces. At first, one has the perception that the reference points are missing: not exactly the best in a game where speed and readiness are everything. Our main concern therefore concerns the reactivity of the movements, specifically when we come across the various bosses that the enemy AI puts us in front of. All too often it happens to move around with an approximate idea of the surrounding space and this leads inevitably to generate frustration. Suffice it to consider that the Arcade mode does not provide for the presence of checkpoints, consequently when the ship is destroyed, the raid must necessarily be resumed from the beginning. The automatic lock-on on enemies and the prerogative of shooting continuously by holding down the dedicated button take care of it; a choice if we want very little 80s, but which at least serves to counterbalance the shortcomings of the camera. Furthermore, the automatic aim does not always work in the best way with respect to one's positioning in the field: it happens, for example, that by moving the ship to the top and bottom of the screen, or to the sides, the viewfinder does not remain focused on the target, ending up requiring more due time to get rid of the threat. Endless mode Once the arcade section has been completed, it is possible to unlock the Endless mode, which involves tackling a generating pathto with procedural criteria. In this case you have to try to survive as long as possible, getting a high score and trying to climb the scores online. We are talking about the only alternative section to the Arcade one proposed by GRIDD: Retroenhanced, but at least in this phase it happens to face many more variations on the theme than in the initial path. Also in this case it is possible to access three different types of power ups, useful for restoring the integrity of the spacecraft or alternatively the firepower multiplier x2 or x3. By knocking down the enemies that appear in front of us, and successfully avoiding as many obstacles as possible, it is possible to forfeit a progressive score bonus which will significantly improve the final evaluation and positioning on the leaderboards when the game is over.", "date": "2018-07-19", "grade": "S.V."}