{"name": "Pocket Rumble", "ref": "https://multiplayer.it/recensioni/pocket-rumble-recensione-202503.html", "text": "You know that little gem from Stardew Valley? Well, because Pocket Rumble has almost nothing to do with him, but we had to start somewhere. Irony aside, at a first glance at the presentation trailer of both titles there is a detail that immediately catches the player's eye: the publisher's logo and the artistic style. Both were published by Chucklefish, both sporting delightful pixel art graphics. The soul, yes, is profoundly different: they come from the same direction, but while the never too praised Stardew Valley is a hybrid between the simulator and the RPG with a rural theme, Pocket Rumble is proposed as an economic and simplified alternative to the arcade fighting games from the 90s. We know what you're thinking: yet another fighting game that wants to steal some light from sacred monsters like Street Fighter and Samurai Showdown? The matter is actually more complex, and the title developed by Cardboard Robot Games on Nintendo Switch has charisma to spare. Simple but complete fighting game Pocket Rumble is, for once, a fighting game that takes the player by the hand and calmly and patiently explains the tools of the trade: that is, the sacred art of remembering combined commands to perform lethal moves and throw opponents to the ground. Needless to deny that newbies and non-experts always feel displaced at the first lap of any Street Fighter: for those not used to the genre it is difficult to win a match without pressing keys at random, often with discrete results but completely linked to the fortune; not to mention the certainly satisfying, but also steep learning curve, which requires several hours of training before reaching a mastery worthy of the name. Pocket Rumble thinks differently, and wants to offer a title that can be used immediately by everyone with just a few minutes of lesson: for this moment it simplifies the keystrokes to the bone, the management of the energy bars and the possibilities of its characters, so such that it's all simple enough to understand, but not too trivial in the long run. The risk is in fact that of proposing a winning offer for a couple of hours of play but then necessarily superficial, especially in view of online competitions: Pocket Rumble on Nintendo Switch manages to keep its balance on this delicate borderline between simplicity and complexity, between accessibility and difficulty of mastering. The attacks of the characters are just two, and are performed with A and B. Our hero gets up, down and jumps, and performs a couple of special moves: that's it. There are no sophisticated techniques in the proper sense of the term, no complex key sequences to keep in mind or difficult to perform in practice: where the lists of commands are eliminated, the long press takes care of the counterpart, in combination with the directional movement. Holding down the movement stick in time (and synchrony, as in any good fighting game, is really important) in combination with the light attack allows you to perform the standard special move; accumulating enough energy, you can then think about launching the final attack, logically more devastating. Each character has unique characteristics and particular abilities, which are also reflected in different energy bars, with a very particular style. A simplified gameplay, but solid and able to give satisfaction even to the experts of the genre, is then combined with some truly noteworthy goodies. Art direction and gameplay Pocket Rumble has the advantage of being immediately usable by everyone, but it also has other arrows in its bow: one of these is the excellent quantity and variety of content offered, especially if weighed against the asking price for the title, just about ten EUR. The game menu is also simple and streamlined: it immediately lists the various proposed modes on the screen, one after the other, while everything is rigorously made in a colorful, balanced and pleasant pixelated style. There is of course the possibility to compete against other opponents online, randomly or by invitation via the Nintendo Switch friends list: in ranked matches you start with a certain global position, and as you lose or win matches you climb the ranking towards the 'up or down. Before launching yourself onto the net against real opponents, it is advisable to make sure you are able to defeat at least the virtual ones: the single-player mode therefore offers a series of challenges against artificial intelligence, divided into arcade, versus and career progressions (the fiction of a global tournament involving all wrestlers present). And speaking of wrestlers,Pocket Rumble certainly does not skimp on the charisma of the main roaster: as they usually say, ~few but good~. There is a young boy, new Ryu, who just like the adult of the same name in Street Fighter is able to launch a hadoken-style energy wave; there is a girl who is very reminiscent of Samara from The Ring, and in fact she is a ghost capable of disappearing and throwing her own head against her opponents; there is a girl who fights accompanied by her cat, who offers her support with annoying but effective very rapid attacks. In all there are eight characters present: few, and it is one of the main limitations of Pocket Rumble, but those few that are there also appear almost perfectly balanced, as well as immediately recognizable and always able to elicit a smile. Each of them is fully customizable by the player, who can select the preferred color palette at will: an extra point that adds to the delightful pixel art-based artistic direction.", "date": "2018-07-17", "grade": "7.8"}