{"name": "The Spectrum Retreat", "ref": "https://multiplayer.it/recensioni/the-spectrum-retreat-recensione.html", "text": "The Spectrum Retreat is a very particular title, also and above all if we consider the young age of its author, Dan Smith. The project was born when the developer was just fifteen years old and earned him the BAFTA's Game Making Award in 2016. This naturally aroused the attention of a publisher like Ripstone, who decided to produce the game because became the interesting narrative adventure that landed a few days ago on PC, PlayStation 4 and Xbox One, with a Nintendo Switch version also coming out during the summer. The protagonist of the story is a man named Alex, who wakes up in a mysterious and disturbing place, without remembering how he got there: the Penrose Hotel. Managed entirely by creepy-looking androids, which we will never really see move, the structure somehow acts as a prison for the character we control, a concept that becomes clear as soon as we get hold of a special smartphone and receive the call from a woman named Cooper, who seems to be trying to get us out of here. However, a few minutes will be enough to understand that the building is not something concrete, but a virtual construct that requires codes, strict respect for a loop and the resolution of a sequence of puzzles in order to discover its secrets. But do we really want it? Two stage gameplay As Cooper explains to us, the Penrose respects a precise pattern that provides for the morning wake-up call, breakfast in the hall and, once the available missions have been completed, the return to the room for a well-deserved rest. Every time the sequence repeats there is something different in the virtual world that surrounds us, small details or important aspects that gradually reveal the sad story of Alex and his family, leaving clues about what happened before. Our interlocutor does not seem aware of how things actually went, therefore she will limit herself to indicating a series of objectives to be completed in the context of a gameplay that is divided into two distinct parts, while leaving the first person view intact and a layout of the controls that on PlayStation 4 is confirmed as very simple and immediate, with the interactions entrusted to the triggers. On the one hand we have the exploration of the hotel and its rooms in search of numeric keypads and the relative codes (sometimes hidden nearby, sometimes more difficult to find), which allow us to access special areas, effectively entering folds of the structure; on the other, the more dynamic and interesting action that takes place precisely at this juncture, and which will see us use the protagonist's special smartphone to interact with a series of devices, initially colored cubes, in order to activate and deactivate barriers along a path ~transferring~ the shades from one object to another. The puzzle mechanics always remain quite static, halfway between The Talos Principle and Q.U.B.E. 2, but they propose a clearly evident and thought-out progression, which introduces new systems on each floor of the hotel (there are five in all, plus the hall and the roof), making the puzzles more multifaceted and complex. Fortunately, it rarely crashes, which allows you to complete the campaign in about five hours: considering the decidedly low price, this is more than adequate value. Playstation 4 trophies The fifteen Trophies of The Spectrum Retreat are obtained by completing the puzzles of the five levels of the Penrose Hotel, performing a series of actions for the first time (the first code, the first teleporter...) and completing the campaign by revealing both available endings. Puzzle and technical sector The Spectrum Retreat focuses a lot on the atmosphere, and the dialogues (in English, subtitled in Italian) help a lot in this sense, thanks to the excellent interpretation of Amelia Tyler; while the musical accompaniment seemed a bit too derivative to us, so much so that it clearly reminds us of an instrumental outro by Keane. The game is driven by Unity and stably maintains 30 frames per second on PlayStation 4 Pro, but exploring the Penrose you come across a very considerable amount of gimmicks placed there to prevent the production costs of the project from rising: this is how the lack of animations and the general static nature of graphics that appear dated on several occasions, unable to surprise even for a few moments. Some details of the effects further clarify the concept, see the ~handcrafted~ lighting system, the decidedly banal textures, modest effects on some surfaces and some annoying glitches (during the early stages it is sometimes difficult to move, as if there were obstacles on the ground).It is therefore clear that the fulcrum of the game is not in the technical sector, similar to that of an indie game, but in its gameplay. From this point of view, the two souls of the experience boast very different characteristics: the ~surface~ exploratory phase is less brilliant, is rather boring and unfortunately fails to best convey the subplot which is then revealed in the finale, while the puzzles offer a fair amount of challenge and variety, net of some really trivial and very fast-solving puzzles. As mentioned, the mechanics become progressively more complex, new ways of interacting with the scenario and new abilities for the protagonist are introduced, finally mixing all these ideas in the last phase.", "date": "2018-07-17", "grade": "7.0"}