{"name": "Nyjah Huston: #Skatelife", "ref": "https://multiplayer.it/recensioni/nyjah-huston-skatelife-recensione.html", "text": "Nyjah Huston: #Skatelife is the latest step in a marketing campaign that aims to exploit the notoriety of Nyjah Huston, the currently highest paid skater in the world, capable of establishing himself as champion in Street League Skateboarding four times. However, the mobile game developed by Hugo Games does not represent Huston's debut in the videogame field, given that the twenty-three-year-old Californian has already appeared in various episodes of the Tony Hawk series as a playable character. In this case we are talking about a simple and immediate sports arcade for iOS and Android, which does not invent anything in terms of tricks and mechanics, but which immediately reveals itself as fun and carefree entertainment, to be pulled out when you want to perform some stunts to pass some time. After completing a short tutorial, the structure of Nyjah Huston: #Skatelife consists of a sequence of increasingly articulated missions, which provide for the correct execution of a certain number of tricks within a scenario. The initial Skate Park lends itself very well to learning this type of dynamics, given that it presents all the infrastructures that we will also find further in the campaign: benches, railings, trampolines, ramps of various kinds, stairways, electricity cables and more. What we will have to do within the locations will be to take advantage of the interactable points in order to complete the maneuvers indicated, and perhaps even score a high score in the meantime. Gameplay and stunts The control system of Nyjah Huston: #Skatelife is based almost entirely on the touch screen, and the commands are quite simple: with a touch it is possible to jump, automatically hooking onto any objects for a grind, but the maneuver can be made more effective by holding down and releasing the screen, a solution that is also necessary to move from one area to another via a large leap on a ramp. While performing a grind it is possible to change position to increase the score through slides on the screen, and the same happens while we are in mid-air, with the foresight in that case to calculate the times well for a safe landing. Errors are not severely punished, they simply waste some of the total time available to perform the maneuvers indicated for the mission, which are ~accumulated~ so that the stage can be retryed and the set of tricks completed with the moves which are missing. Unfortunately, we encountered a couple of problems with the interface and controls: the former fits poorly on the iPhone X screen, the latter tend to become mysteriously inaccurate when using the right side of the touch screen. Hopefully an update fixes everything. The accelerometer is instead called into question when our character is hovering after a quick landing: we will have to tilt the device as indicated on the screen to avoid a disastrous fall. This system, certainly not original but effective, is supported by an enhancement system that uses the points and virtual currency earned in the field in order to improve certain maneuvers, so that they can make more when we perform them. Leveling up also unlocks new content, without ever really feeling obliged to buy hard currency with real money, which is obviously a very important aspect for a freemium production like this. From a technical point of view, the game defends itself well, even if it doesn't shine in any department: the scenarios tend to resemble each other a little too much due to the use of very similar tones, while characters and animations follow a comic style that we found spot on for such a title. Too bad for the music, terribly repetitive.", "date": "2018-07-17", "grade": "7.0"}