{"name": "Kingdom Come: Deliverance  From the Ashes", "ref": "https://multiplayer.it/recensioni/kingdom-come-deliverance-from-the-ashes-recensione-202194.html", "text": "Kingdom Come: Deliverance - From the Ashes suffers from a typical defect of DLCs that try to enrich the gameplay of a game with pleasant mechanics: despite the efforts, it manages to convey only a sense of incompleteness and substantial uselessness. We had seen something like this with some Fallout 4 DLC, which tried to be original, but only turned out to be fake (it was not by chance that the best was a narrative DLC). But what is From the Ashes all about? On paper, the idea is good: after a certain event in the campaign, Henry, the protagonist, is appointed bailiff of a destroyed village, Pribyslavits, and has to rebuild it. The first problem that emerged from our test is that this is not an endgame content, but a midgame one. For example, we had the misfortune to try it with an advanced save, finding very little difficulty in completing the reconstruction mission. But let's go in order. Rebuild and manage the village In From the Ashes Henry has to rebuild the village with shops and other activities by basically filling slots for pre-set buildings (you can't choose where to build). A problem already emerges here: it is not possible to build everything, but you have to choose. But why do it if at the end of the work there is still a lot of free space left completely unused? We are talking about wooden houses, not skyscrapers. Another problem: after the reconstruction, Pribyslavits ends up containing almost all the recreational activities of Kingdom Come: Deliverance, but none of them are new. In short, there is an arena, but it's just another arena; there's an alchemy station, but it's like all the others, and so on. The reconstruction itself is an activity that does not require any specific management skills. There are two things to do to succeed: spend money and go around running errands. Here you should have already understood why playing From the Ashes with an advanced save is harmful: if you immediately have a large amount of money, the reconstruction is very fast and within a couple of hours you have really seen everything that the DLC has to offer. Playing it with a new game, on the other hand, the fruition time is extended a bit (but not much). The operations to be carried out are always the same, but at least they require more time because you are forced to pay more attention when you go around and because you still have to spend money on other activities. Furthermore, the daily income given by the village assumes greater importance in the game economy. In some respects From the Ashes does not appear to be a complete disaster and on paper it has some interesting elements. For example, it is possible to build buildings of different styles based on the architect you decide to hire. After the reconstruction you get some valid resources such as new horses and some more powerful than average items (purchasable from shops). In addition there are disputes, i.e. Henry is called to solve citizens' problems by making choices (basically it is multiple choice dialogues). The beauty, however, ends here. In the long run you are overwhelmed by the many limits that end up completely killing even the best elements: the different appearance of the buildings does not change anything in terms of management and functionality of the same; new resources are nice, but they are superfluous, while solving citizens' problems is an activity for its own sake that has no impact on the rest of the game world. In short, you should have understood what we meant at the beginning of the article when we talked about a sense of incompleteness and substantial uselessness: From the Ashes seems to have been stuck to the game, rather than designed to enrich it. Hopefully future Kingdom Come: Deliverance DLCs will be better.", "date": "2018-07-10", "grade": "4.5"}