{"name": "Call of Duty: WWII United Front", "ref": "https://multiplayer.it/recensioni/call-of-duty-wwii-united-front-recensione-202205.html", "text": "July opens the door to the third Call of Duty: WWII DLC, a downloadable content that doesn't change Activision's annual plan one iota. Three new maps for competitive multiplayer, a new zone for war mode and an interesting addition to zombies complete a circle that has been repeating itself for years now, ready to change probably only with the next iteration, where the lack of a campaign and the pressure of the Battle Royale mode will inevitably have to coincide with a different support from Treyarch. United Front, on the other hand, continues undaunted to give fans exactly what they expect, not disappointing expectations but not even exalting or changing the mind of those who have long since abandoned this Call of Duty. In short, it is the usual package that throws wood on the fire, a flush of new things to do that will ferry us towards the fourth and final annual DLC. Operation Supercharge between new and already seen While in Los Angeles Treyarch is racking his brains over how to make the public digest yet another Battle Royale, in Sledgehammer they were lucky enough to come up with the War mode which, for heaven's sake, hasn't brought anything terribly new to shooters since which simplifies what has already been seen in Rush on Battlefield but which has also been able to offer a good diversion for those who chew Call of Duty every day. Operation Supercharge moves from the European continent to finish in Tunisia, in an attempt to forcefully wrest the Mareth line from the hands of the Axis, for an enjoyable and highly dynamic, albeit very linear map. Sledgehammer has focused on the spectacular to present the new map, with an unprecedented parachute assault thanks to which to start targeting the Germans even before touching the ground. The level design is interesting and has many long-range shooting lines, therefore perfect for snipers, while not forgetting to create special areas for melee and short-range clashes. In short, it is a well-structured map, and extremely beautiful to look at. Explosions bring down parts of the scenery, continuous shelling deafens and distracts the player, for an atmosphere that gives the real feeling of conflict. As far as the objectives are concerned, however, Supercharge does not exalt or innovate, broadly proposing what has already been seen in the other War maps. We will initially have to defend air supplies and then detonate a bridge by placing charges, ending up with conquering specific objectives by hoisting flags and always moving the line of conflict one step back. It is interesting to see how the new weapons and recently added classes, such as the cavalry for example, have substantially changed the way of approaching defense points, making it much easier now to perch or take refuge behind substantially insurmountable shield walls. Fortunately, given the good mix of objectives, there isn't one faction having the advantage completely over the other for a map that is at least balanced and fun to play. Three new maps enrich the DLC But United Front, as usual, also focuses a lot on competitive maps which, however, are not particularly inspired, despite the presence of Monte Cassino, an Italian area that should at least be worth a few more points for our local players. Unfortunately, however, the idea of heavily exploiting verticality, thanks to a whole series of destroyed buildings and buildings to climb, does not do justice to a location that could really give much more. Call of Duty: WWII's lack of mobility makes it difficult to make the most of heights, for fights that therefore tend to be resolved on the same level, favoring snipers and campers instead. From the point of view of strategy and design, the passages on the edge of the map are very interesting, which basically allow you to be able to fire directly in a single direction without fear of being surprised from the side or from behind, a situation that rarely happens in maps of Call of Duty given the custom of creating rooms with multiple accesses. However, the visual variety is good, with warehouses enriched by works of art and squares with fountains of the medium to cover any control points. Market Garden is another quite forgettable map, rather classic in design and without any real interesting ideas. A sufficient job but which will hardly remain in the memories of the players since, unfortunately, it leads to having close combat for the umpteenth in the playlists of this new chapter, a type of approach already present in large quantities in the other maps. Finally, Stalingrad is the most successful United Front map, of a decent size and with the possibilityto approach matches in diametrically opposite ways. You can therefore take up a sniper rifle and cover your companions over the distance or arm yourself with machine guns and fight in the sewers. Stalingrad, as you'd expect, is literally covered in snow with footprints on the ground making it easy to spot enemies, adding an interesting layer of strategy. Revolution for zombies on COD The work done by Sledgehammer on the zombie mode is very, very interesting this time. The new chapter, unlike those seen in the basic version and also in the following DLCs, betrays the custom of giving players a different approach, which avoids the tedious first slow waves to favor immediately more frenetic and dynamic gameplay. Instead of having a single huge map in which to search for various pieces and solve puzzles, this time we will have to deal with three mini chapters with randomized objectives in which we will have to resist nine waves and then face a mini boss on duty. The matches thus become faster and it is extremely more interesting to follow their evolution, also because the randomness of the loot has been made even more predominant this time. Scattered around the map we will find several weapon crates but which contain only and exclusively random weapons divided by type. By paying a certain amount of shocks, therefore, we will be rewarded with a random gun of a specific category, thus forcing us to adapt our style of play to the finds, an interesting choice and able to vary the usual routine. The three levels are also enormously distinguished by the conformation of the different locations, one of which is set on a boat, with enemies who will attack you from all sides while the final passage will take you to a frozen cave. Also interesting is the new progression and bonus system that will improve your performance, giving you various types of bonuses as you progress in the mode: a more than discreet incentive to stay anchored on the serves and properly strip the new Nazi Zombies experience by Sledgehammer.", "date": "2018-07-10", "grade": "6.5"}