{"name": "Warhammer 40", "ref": "https://multiplayer.it/recensioni/warhammer-40000-gladius-relics-of-war-recensione-202186.html", "text": "It may seem strange to some, but to date a 4X (explore, expand, exploit, exterminate) set in the world of Warhammer has never been created, despite the fact that with the Games Workshop brand a bit of everything has been done on a videogame level: from wargames, which we can consider as its natural genre, to pure action, passing through completely online titles. Warhammer 40,000 Gladius - Relics of War then comes to fill a gap. Slitherine, the publisher, and Strayligh, the developer, had already dealt with Warhammer to create the turn-based strategy Warhammer 40,000: Sanctus Reach, one of the games most consistent with the original wargame. Warhammer 40,000 Gladius - Relics of War addresses the brand from another point of view, putting us in the shoes of one of four factions: Astra Militarum, Necrons, Orks and Space Marines; with the aim of finding and exploiting the resources of the planet Gladius Prime, especially the archaeological ones. In reality one of the factions, that of the Necrons, is formed by the ancient inhabitants of the planet, now extinct, awakened by the others and by their desire to get their hands on the ancient relics hidden on Gladius. In simpler terms, whatever faction you choose, the player's goal is to expand on the planet with cities, bases and strongholds and create a vast army to search for resources and exterminate the aggressive local fauna and opposing factions. The four factions Games of Warhammer 40,000 Gladius - Relics of War are fully configurable. At the beginning you have to choose which faction to play with, how big the game world should be, which will be procedurally generated, the general difficulty level and more. The possibilities of selecting the strength of the individual factions on the field and of creating teams, so as to better articulate the matches, are interesting. The factions not only differ aesthetically, but each have their own advantages and disadvantages, which make them more or less suitable for different playstyles. For example, the Astra Militarum spend nothing on infantry, but have to pay more attention to troop morale. The Space Marines, on the other hand, are the classic all-round faction, with the limit of being able to found only one city per game, but expanding their influence with the Fortress of Redemption. On the other hand, the Orks are an extremely unstable faction from the point of view of military moods, with no particular bonus for the expansion, but with a great articulation of the reactions of the single units. Finally, the Necrons have healing powers that allow units to take cover on the battlefield, but they can only build their cities on the ruins of their civilization. Each faction then has its own units, with some favoring infantry, for example the Orks, while others have more performing vehicles, such as the Astra Militarum. Exploration and combat Unlike in other 4X, in Warhammer 40,000 Gladius - Relics of War the exploration phase is decidedly problematic, in the sense that the planet Gladius Prime abounds in fauna and environmental dangers of all sorts (poisonous boxes, fortified towers and more), which added together make the search for relics and new resources much more difficult than in other titles of the same genre. In short, sending a single infantry unit to explore the whole map is a real suicide and it is therefore advisable to form small armies to overcome the starting area. Be that as it may, usually the game system takes care to make us start in a quiet area, with at most a few low-level enemies around. Going around, however, it will be inevitable to run into gigantic robots, gigantic centipedes and gigantic floating creatures (when they are bad they are also gigantic, there is little you can do). The progression, in this sense, is very slow and it is often necessary to fight tooth and nail to maintain some strategic outposts. If you haven't figured it out, Warhammer 40,000 Gladius - Relics of War is all about combat, that is, creating and managing troops in ever-increasing numbers. Each unit has its own characteristics and levels up as you gain experience on the battlefield. By founding cities and researching new technologies (each faction has its own research tree divided into several levels), new units will be unlocked, the old ones will be equipped with new means (for example, grenades), more or less armored vehicles will be obtained and will have access to heroes, special units with unique powers. The combat system itself is very simple: each turn a unit has a certain number of action points to spend, which it can use to move, to use an ability or a power, or to attack. The effectiveness of attacks varies depending on a multitude of different factors: the type of square occupied (a forest protects more than an arid plain), the distance from the enemy, the type of unit attacked, the status and equipment of the attacking unit and so on. At the beginning some factors take a back seat because the forces in the field are limited, but when you find yourself managing clashes against dozens of units at the same time, leading as many of them, some tactical evaluations become essential, especially if you have selected a medium difficulty level -high. In general, this is the fulcrum of Warhammer 40,000 Gladius - Relics of War, whose games can last many hours thanks to its tactical depth. Try to organize a meeting on a medium to large map, with at least four other medium / high level factions and you can say goodbye to your days. Here the developers must be applauded for having created a good artificial intelligence which, despite making some mistakes, has proved to be able to put us in difficulty several times. Sure, playing with other humans is better, but even alone you can't complain. Management In all of this, the phase of city management takes a little second place. Not that it is missing, given that each city must be grown by constructing buildings and occupying the surrounding territories, but it is a fairly simplified aspect compared to other 4X, evidently put at the service of the military side. That is to say, cities tend to be above all unit factories, whose slow and constant expansion is never too penalizing, unless there are gross errors (for example, not taking care of all the resources by favoring only one). At the beginning it seemed like a problem, but in the advanced stages, when armies grow and things get difficult, being able to concentrate on the battlefield is a significant advantage that made us better appreciate the agility of city management. In short, Warhammer 40,000 Gladius - Relics of War really convinced us a lot in its general lines, despite some small problems. For example, on a visual level it has some flaws. We are not talking about actual graphic quality, which for a 4X is definitely not decisive (although something more...), but about some readability problems that make it difficult to understand by eye the path that the unit will follow by clicking on the destination . This is an apparently trivial problem, but we confess that in some cases we have been deceived, wasting a turn of the unit, because perhaps we had not noticed a difference in level of the terrain that prevented a direct approach. It doesn't happen very often, but in the most articulated areas you notice it). Another problem is the lack of content. Surely there will be more in the future, but currently Warhammer 40,000 Gladius - Relics of War does not offer a huge variety. Of course, consider that learning how to use the four factions well takes time and that the military side is really deep, so there is something to play, but we hope that other factions and other events related to game progression will be introduced in the future (overcoming certain objectives progress through the history of a faction and unlock certain events), so as to eliminate that feeling of being left with nothing to discover after a few hours of play.", "date": "2018-07-09", "grade": "8.3"}