{"name": "Children of Silentown", "ref": "https://multiplayer.it/recensioni/children-of-silentown-recensione.html", "text": "Lucy is a little girl who lives with her parents in a village surrounded by a forest where everyone follows stringent rules: you don't go around the streets after sunset, you don't scream and you don't leave the inhabited area. Anyone who violates them ends up disappearing and never coming back. It is said that terrible monsters live beyond the trees, which, however, no one seems to have ever seen. Lucy strictly adheres to what is prescribed, at least until one day a dramatic fact explodes her desire to discover the truth, kept somehow at bay until then. We try to explain in the Children of Silenttown review why its story is worth following to the end. Gameplay: the chants Most of the adventure takes place in the village Elf Games is a talented Italian independent development studio that had already proven itself with the excellent Little Briar Rose, a point and click adventure with graphics inspired by the artistic style of stained glass. Children of Silentown, which maintains the same genre, is proof of great authorial maturity, both in the story it tells and in the visual style: a hand-drawn 2D detail that recalls illustrated children's books. So we have characters with very large heads, completely white round eyes and stylized limbs in which hands and feet cannot be seen, and we have ~painted~ environments that form a dream world, in which every object takes on a strong symbolic value . The general idea that the game immediately conveys is that of being inside a dark and melancholic fairy tale in which we go around collecting objects, combine them and use them in the same scenario through a convenient inventory that opens on the left side of the screen. As the story unfolds, Lucy will also learn songs, which will become increasingly central to solving the various puzzles. We're not exactly in Loom's parts, but the reference to Lucasfilm's game appears quite clear, even if the music is used in a very different way here. Each of the chants consists of three notes and has different effects, resulting in unique mini-games. For example, we can literally mend the dreams of some people, by running a thread on some flaps of fabric trying to pass through all the buttons, so as to find out what they want, or we can ~illuminate~ secret areas by lighting eyes on grids, avoiding but to shed too much light in some specific points. The mini games are linked to the individual songs and are repeated more and more difficult until the end of the adventure, but never being impossible. In this way you can follow the story constantly, reaching the end in just over six hours, a perfect time given what has been told (then you can continue playing in new game + mode if you want). The puzzles There are also many classic puzzles in Children of Silenttown Speaking of the classic puzzles, those based on the collection and use of objects, we can say that we didn't have any major difficulties. In the sense that the things to do are clear enough and it's not difficult to find what you need, even in the absence of a key that shows all the interactive objects in the scenario. Note that the control system is completely different depending on the peripheral used. So, using the mouse, the gameplay is that of a Simon the Sorcerer-style point and click, with the cursor allowing you to explore the entire scenario while stationary, where using a controller you have to move Lucy directly making her physically reach the interactive objects to highlight them. We played using the mouse, but we also briefly tried the other system (useful, for example, if you want to play on Steam Deck or on a console), which turned out to be functional anyway, by virtue of the fact that the game world is not very large and the objects to interact with are all clearly visible. The adventure In Children of Silentown fear of the unknown creates monsters Don't expect a massive adventure. Children of Silentown is basically set in two scenarios: the village and the forest, with the first which is made up of some key places that can be visited freely, where you spend most of your time, and the second which offers an experience in a certain more guided sense, made more of situations than exploration, with a greater number of mechanical puzzles and a particular focus on the songs. The choice is justified by the evolution of history, which basically tells of ancestral fears and how human beings founded civilization around them, ending up repressing curiosity towards the unknown and marginalizing all those who do not accept certain rules. with a bittersweet finish that does not console and does not rsolves the initial conflict, apart from Lucy's individual one, resulting in it being all the stronger and more spot on. In short, the ~Disney effect~ has been avoided and, indeed, we have tried as much as possible to problematize what is a very classic universal theme, working closely around the narrative core of the adventure. In this sense, Elf Games has proved to be very capable of never losing the thread of the conversation, which it has built consistently from the beginning to the end, leaving no room for escape towards the absurd. Each chant has one type of mini-game tied to it Thus we have characters characterized in a simple and profound way at the same time, who form a variegated human community, where every individual aspiration collides with the rules imposed by the conditions of life of the same, and who reveal themselves to be more articulated than it might seem at first glance, gradually revealing unexpected and much more multifaceted traits than it initially seems. For example, Lucy's father is both the classic parent worried about his daughter's well-being, and the allegory of an authority that imposes rules without motivating them and without allowing the individual to contest them, even in the face of undeniable truths. The songs themselves, in addition to being linked to the game mechanics, are an active part of the sense of the same, a symbol of Lucy's will to express herself, who throughout the story tries to find her voice again. Bales that disappear Lucy will often find herself alone Overall we loved Children of Silentwown, so much so that it captivated us from the beginning to the end. That said, we did notice some odd glitches, such as grammar errors in screen passages, that could have been avoided. For example, entering the farmer's field from the village square, a bale of hay in the upper part of it mysteriously disappears. The same goes for a bulletin board with pictures posted on it, which becomes a door as you go around the building. These are small things, but they are noticeable, above all because we travel around the country a lot in search of objects and characters and in the end it is inevitable to notice them. For the rest, the work of Elf Games has convinced us. It was quite an adventure, for what it lasted.", "date": "2023-01-10", "grade": "8.5"}