{"name": "New Gundam Breaker", "ref": "https://multiplayer.it/recensioni/new-gundam-breaker-la-recensione-201532.html", "text": "The animated series Gundam Build Fighters has awakened worldwide interest in Gunpla, an abbreviation for Gundam Plastic Model which, precisely, identifies those scale models which, once assembled, reproduce the features of the Mobile Suit appeared in the many franchises related to Gundam, the combat robot designed by Yoshiyuki Tomino in the 70s. Bandai has been making these kits for years, but lately there has been a real spike in interest which has led the Japanese developer to build them - pardon the pun! - even a series of video games called Gundam Breaker. New Gundam Breaker is the latest iteration to see the light, but also the first to arrive on our shelves. Bandai probably wanted to evaluate the western response, but instead of locating the excellent Gundam Breaker 3, which had already been released in Japan for some time, he preferred to focus on a product that really left a bad taste in our mouths. The story and the campaign: the fanservice that kills Once the software has started and the initial screen has passed, we will be able to change the name of our alter ego, a student who the game ideally calls Kasuga. At that point, New Gundam Breaker catapults us into the campaign, the only single player mode that translates into a sort of visual novel made up of very long dialogues dubbed in Japanese but, fortunately, written in good Italian. The problem, sadly, is the plot. It is clear that the Count of Monte Cristo should not be expected from a game of this type, but the way in which New Gundam Breaker mixes the clichs and stereotypes of more or less recent anime is cloying to say the least. Kyosuke enters a Japanese school aimed at training the greatest model makers in the world, but he discovers that education is in the hands of a school committee of bullies who have imposed new strict rules to the detriment of the creativity that should characterize Gunpla builders . Conflicts in this school are resolved by having the Gundam models fight through a virtual simulator very similar to the one used in the Gundam Build Fighters series: the students record their models and these take shape in virtual reality, ready to fight for their ideals. There's even a bit of Food Wars! (Shokugeki no Soma) in this story, given that the protagonist and some classmates form a resistance with the express purpose of finding new allies and overthrowing the student council, thus restoring the creativity and dignity of the institute: who follows the manga/ culinary anime by Yuto Tsukuda, will find many similarities with the council of 10 Elected and the Central Foundation which border on plagiarism. Along the way there is also a little time for love: every now and then it is possible to choose which answer to give to our friends and some decisions, by demonstrating a certain interest in one study partner rather than another, unlock missions secondary or alternative routes that lead to different outcomes and kinematics. The dialogues and story of New Gundam Breaker are peppered with unlikely characters and jokes full of fanservice that will understand only the die-hard Gundam fans: the campaign would be a nice diversion, if only there were other single player modes to play. Playstation 4 trophies You will be able to unlock 41 trophies, including the platinum one, to which three gold trophies, fifteen silver and twenty-two bronze are added. You will achieve this by completing each mission with the highest possible rating, collecting every piece of Gunpla or by repeatedly winning even in multiplayer mode. Fun-filled gameplay Before moving on to what works (and not) in this title, we must necessarily explain how to play in the true sense of the word. The missions - whether they are the single-player ones in the Story or the online multiplayer ones - are structured in two-on-two or three-on-three challenges in three-dimensional arenas that reproduce some iconic Gundam scenarios, such as the space colonies, or the classes in which the school lessons, and then we find ourselves fighting between chairs and furniture as if we were in Toy Story. Each Gunpla is made up of various pieces (head, arms, legs, chest, backpack, melee weapon and ranged weapon) and each of them grants stat bonuses and special abilities like in some sort of RPG. The purpose of the missions is not only to defeat the opposing team, but to earn more points than it by the end of time, and these points are earned by destroying the opposing Mobile Suits which, like us, will regenerate in a few moments, or by completing various random objectives that show up during the mission.Sometimes we will have to defeat a certain number of enemies that will appear in waves, sometimes we will have to open a certain number of chests, in some cases we will have to knock down a miniboss and the team that scores the final blow will receive the points. In reality, however, the heart of the game is represented by the loot, the infamous ~loot~ to put it in English. Each defeated enemy will drop a completely random piece of Gunpla that we can instantly equip instead of the default one - which comes in handy if, unfortunately, we have destroyed the part in question during the fight - or that we can deliver in a special box that for for some reason he changes position during the battle. Once the mission is completed, each piece of Gunpla owned when the time runs out or delivered during the battle will be added to our very personal collection, while all the others will be automatically sold and converted into a currency that we can then spend in a virtual shop to buy the individual Gunpla pieces we came across. The Equipment menu, in fact, allows us to build and customize our own Gunpla, choosing each single piece, starting with the internal frame which guarantees a precise attitude in combat, and then moving on to coloring, washing, even airbrushing and choice of surfaces. Do you prefer a metallic or textured Gunpla? Want to apply stickers? Do you like dings and scratches? The construction of the Gunpla is a lot of fun because it requires a certain strategy in choosing the pieces and the skills they give, while the parameters of the Mobile Suit go up and down: it is important to find a certain balance if you want to prepare the perfect battle Gundam. Unfortunately, however, this part of the offer is strongly linked to combat missions, which are far from fun and also quite irritating. The problem is not related to their length or to the chaotic overlapping of secondary objectives, but to a control system that to define as bad seems to us a euphemism and which sends any presumption of tactics to the nettles. The response to the commands is slow and awkward, with the X key linked to both the sprint and the jump which forces the player to remain in an absolutely neutral position for a few moments if you want to leap instead of sprinting in a certain direction. Each combo or special attack inflicted or received causes moments of recovery that slow down the clashes and drain them of any dynamism, making them seem like a succession of attacks in turn in which only the one who has the most life and who does the most damage wins, in the face of parameters and RPG stats. It is not even possible to aim at a precise target, but only to shoot in a generic direction, while the proximity lock-on prevents you from selecting a specific opponent when the screen fills up with enemy units, in addition to those that make up the opposing team. In these terms, New Gundam Breaker is also a technically spartan title which, for some absurd reason, manages not so much to slow down, but actually to freeze in some moments of the fight, for example when you change a piece of Gunpla or start a new mission secondary: the game simply stops and resumes after a few moments, throwing the player into absolute confusion.", "date": "2018-06-25", "grade": "4.0"}