{"name": "BlazBlue: Cross Tag Battle", "ref": "https://multiplayer.it/recensioni/blazblue-cross-tag-battle-recensione-ps4-201295.html", "text": "It seems that Arc System Works has decided to leave the past of the two dimensions behind and move into a future where the Unreal Engine 4 gives life to fighting games that look like interactive anime like Dragon Ball FighterZ and Guilty Gear Xrd. In this sense, BlazBlue: Cross Tag Battle represents a farewell in style, but also a summary of what has distinguished the Japanese developer in all these years, namely lightning-fast battles, layered mechanics and crazy fighters. To succeed in the enterprise, Arc System Works has first of all drawn heavily in its most important two-dimensional franchises, in the so-called ~anime fighters~ with which it has become famous in the arcade and in international tournaments: BlazBlue of course, then Persona 4 Arena - which needs no introduction - and Under Night In-Birth, a lesser known title in the West that was born primarily as a visual novel and then became a fighting game. A shocking mixture, in short, designed with an eye to new players, as often happens lately: in our review you will find out if the operation was successful. The Fighters: A Roster Under Indictment A lot of controversy arose around the cast of BlazBlue: Cross Tag Battle in the days leading up to the launch, when Arc System Works clarified how it would organize a roster that producer Toshimichi Mori had promised to be immense. In fact, the wrestlers should have been over fifty, but the title at the time of launch only had about twenty: another twenty will gradually become available over the months in the form of paid DLC, and in the meantime the president of Arc System Works , Minoru Kidoka, announced that the team is working on another twenty DLC wrestlers that will represent the offer of the second season. In summary, in short, whoever buys the game finds a basic roster made up of twenty characters: ten come from BlazBlue, four from Persona 4 Arena, four from Under Night In-Birth and two from RWBY, a bizarre webseries that in some way she snuck into this universe. You will therefore understand the perplexities of those who, like us, have seen this fighting game transform into a kind of ~game as service~ in which two thirds of the roster are paid. It could be argued that it is a matter of little change per wrestler and that basically it is up to the player to choose which characters are worth spending it on, and in fact it was not so much the now quite ordinary format of the offer that unleashed the ire of the fans - just think to Street Fighter V or the previous Arc System Works fighting games - as much as the fact that there is very little work behind these fighters: the developer has extrapolated the sprites from the other games and implemented them in this one, simply adapting them to the new mechanics. This has translated into a significant imbalance on the front of the fighters, but also and above all in a decidedly antiquated visual presentation: the sprites, however detailed and colorful, suffer from a certain dirt that clashes with the beautiful backdrops, especially if you play on panels that enhance the sharpness of the images. Added to this is the paucity of an episodic campaign which, as expected, struggles to justify the meeting of the parallel universes involved. Arc System Works fighting games have always been characterized by long story modes that tell the story as if they were an anime, bizarre yes but engaging in its own way. The plot of BlazBlue: Cross Tag Battle, on the other hand, makes no sense at all. The characters collide due to incomprehensions bordering on the ridiculous, their objectives are not clear because they presuppose knowledge of the series they belong to, the script simply does not have a precise direction and you end up turning off your brain and skipping the dialogues of a visual novel that it takes too long. Fortunately, in terms of content BlazBlue: Cross Tag Battle also offers an in-depth tutorial, a Survival mode, the inevitable Missions mode and a hub in which to wander around in the form of an avatar to socialize with other players and challenge them in combat. The new combat system As we have said, however, BlazBlue: Cross Tag Battle is not only aimed at franchise veterans who cross each other on the battlefield, but also at the potential group of beginners who are approaching an Arc System Works fighting game for the first time. In this sense, the Japanese developer has streamlined and heavily revised the combat system, finding an effective compromise that makes it functional and intuitive in less expert hands and at the same time satisfying and layered in those of more experienced players. The fighters havethey essentially consist of two basic attacks which, when pressed repeatedly, ring automatic combos of medium length. A third key is associated with the Clash attack: the latter performs various functions, for example it allows you to launch enemies and enhances some attacks, guaranteeing defensive and aggressive actions at the same time. Finally, a fourth key triggers the so-called Change Duo, or rather the crucial feature of this fighting game expressed in that Tag in the middle of the subtitle. BlazBlue: Cross Tag Battle is in fact a two-on-two fighting game like the recent Marvel Vs. Capcom Infinite and by pressing the appropriate button it is possible to immediately exchange the fighter in the field with the one in the rear, prolonging the combos, interrupting the enemy ones and allowing a slow recovery of the most recent damage. Basically the entire gameplay relies on the dynamics of exchange and the possibilities they offer in conjunction with the indicator called Cross Gauge which is charged during the fight and is consumed by using the most powerful attacks or the most elaborate maneuvers. The Partner key instead allows you to call your partner into the fight for a quick hit and run whose shape depends on the directions pressed together with the button: in this way, Arc System Works has easily circumvented the serious problem of selected characters in ~tag team~ fighting games just for their support attacks, granting some versatility in any situation. At this point a novice would already have all the means to be able to have his say in a match. The control system is intuitive and the special moves, made up mostly of identical rotations and keystrokes that depend on the type of attack you want to use, are easy to memorize. It only takes a few minutes - and a visit to the Tactics mode which teaches you how to play with detailed explanations and practical tests - to learn how to play and put together more or less complex combos, then time and experience help you invent new chains in which to insert special attacks and Distortion Skills. The game also offers a temporary boost when you lose one of the fighters and have enough charges in the Cross Gauge: called Resonance Blaze, this mode boosts our surviving fighter - a bit like the X-Factor of Ultimate Marvel Vs Capcom 3 - and unlock the deadly Astral Heat which, when landed, immediately ends the fight. The more experienced players, on the other hand, will be able to sink their claws into a combat system that has a lot more to say, including Ukemi, Cross Burst, rejected and so on and so forth, needless to dwell. BlazBlue: Cross Tag Battle, in this sense, demonstrates all the experience and expertise of Arc System Works, redefining its traditional, complex mechanics without distorting them.", "date": "2018-06-20", "grade": "7.5"}