{"name": "Fortnite", "ref": "https://multiplayer.it/recensioni/fortnite-recensione-nintendo-switch-guida-201052.html", "text": "Fortnite, and especially the free Battle Royale module, really needs no introduction. In fact, we are talking about a product that boasts over one hundred million players worldwide, which in April grossed almost three hundred million dollars and which is preparing to face a competitive season at high levels. The game's debut on Nintendo Switch was just a matter of time, given also the well-known compatibility of the hybrid console with the Unreal Engine 4 and the fact that to anticipate the official announcement, revealed during the special E3 Direct 2018, there have been at least a couple of leaks. Downloadable for free from the eShop, Fortnite sadly welcomes longtime fans with bad news: they cannot use their existing account where it is linked to the PlayStation 4 experience, which translates into having to create one from scratch and therefore give up the achievements and experience obtained previously. Beyond this unpleasant hitch, however, the game on Switch is exactly what we know, even though it is only present in the Battle Royale mode and therefore without the Save the World cooperative campaign. How to play: alone or in a group? Downloaded within twenty-four hours by over two million people, Fortnite is certainly not afraid of matchmaking on Nintendo Switch, which in fact takes place very quickly and with the traditional indications on the number of connected players, the preferred region in terms of latency and the presence of any users from other platforms, which however never occurred during our tests. Epic Games was also able to activate the much coveted voice chat through the use of simple earphones with microphone and connection via jack, rather than through the cumbersome and anachronistic procedure of the official Nintendo app, although this function will only be implemented in the next few hours and we have therefore not been able to verify its functioning at the time of writing this article. As mentioned, the Switch version of the game is based solely on the Royal Battle mode, available in all its variants: Single, to face ninety-nine players alone; Couples and Teams, to collaborate with other users by forming a couple or a team of four; 50 V 50, which takes the team concept to the extreme, pitting two huge factions against each other; and finally Sfida tra Cecchini, which can also be played alone or in pairs, with the prevalence of precision weapons for a confrontation that will often take place from a distance. Gameplay: No waiver on Nintendo Switch In terms of interface, functionality, achievements and aesthetic microtransactions, the Nintendo Switch version of Fortnite does not differ in any way from what is seen on other platforms, but it is above all once parachuted onto the battlefield that the game reveals the goodness of a voted conversion to functionality and responsiveness rather than graphic detail, as was widely expected. However, let's focus on the first aspect, for the moment: although it runs at thirty frames per second instead of sixty, both in portable and docked mode, the Epic Games title returns an excellent sensation of fluidity, certainly deriving from a consistent frame pacing, made possible as mentioned by some aesthetic renunciation. It moves and shoots very well, in an experience that can be perfectly superimposed on the one we have already experienced on Fortnite for PlayStation 4, without glitch or latency problems except in the 50 V 50 mode. Unfortunately, the latter currently suffers from a fairly evident lag when the two factions meet, giving life to large-scale battles in which even the construction mechanics are used in a strategic way, to build ramps and barriers that allow the two large teams to avoid a completely open confrontation in the central areas of the map. While waiting for this specific option to be fixed by the developers, you can of course have fun with all the others and with the simple but tantalizing Battle Royale formula, in which you find yourself projected into a large scenario, without any equipment, and you have to explore the buildings in search of weapons, ammunition and any medical kits or armor potions in order to eliminate as many opponents as possible and aim to be the only survivors out of a hundred participants. The contents of the fourth season of Fortnite are also present on Switch, in this case the new Battle Pass with its renewed achievements, the large crater in the center of the scenario and, consequently, the jumping rocks that allow you to obtain a momentary agility boost. Graphics and concontents: some trimming needed We doubt that the decision to bring only Fortnite's Battle Royale mode to the Nintendo Switch, leaving out the cooperative campaign, depends on technical issues: Epic Games has seen fit to immediately focus on the matter, offering new users the most successful experience. the competitive one, completely free and waiting for the inevitable excellent news on the download front; which, we are sure, will set interesting records for the eShop in the coming days. The graphics are different, which uses the modularity of the Unreal Engine 4 to cut frames (as mentioned, on Switch the game runs at thirty frames per second instead of sixty) and details in order to deliver consistent, reactive, free of blunders that do not depend, as in the case of the 50 V 50 mode, on issues of pure and simple latency. We therefore notice some too many jaggies, the visual horizon is less clear, there is some pop-up, the quality of the textures sometimes appears significantly reduced and the buildings lack some details, but their destructibility remains unchanged and, in general , we don't pay too much attention to cuts; also because the polygonal models of the characters seem unchanged and, in general, we are not talking about a title that has ever made graphics its strong point.", "date": "2018-06-14", "grade": "8.0"}