{"name": "Aragami: Shadow Edition", "ref": "https://multiplayer.it/recensioni/200343-aragami-shadow-edition-aragami-shadow-edition-la-recensione.html", "text": "In 2016 Aragami proved to be an indie particularly appreciated by the public and critics, proposing itself as one of the last pure stealth games in circulation, together with Styx. A stealth game perhaps not very innovative, I agree, but extremely solid, so much so that at the time we promoted it with an excellent mark despite some small flaws in the optimization, amply compensated by an evocative, inspired and extremely fascinating artistic style. Two years later, Lince Works once again offers us its lethal son, enriched with a new expansion entitled Nightfall: the complete package is offered at 24.99 Euros, or if you already own the basic version you can launch yourself directly on the single expansion . Is it worth going back to feudal Japan to slaughter warriors of light? The answer is: of course yes! Because Aragami is here again with a very rich baggage of contents and new mechanics. New story, new characters, new skills Aragami: Nightfall allows us to experience the events immediately preceding the well-known plot of the main game: we can thus get to know Hyo and Shinobu, two Shadow assassins who on balance are also all that remains of the Empire following the invasion of the Kaiho. As we know, the warriors of light have captured and locked up the young Yamiko, who will later summon the Aragami to be freed: Hyo and Shinobu are currently on the trail of a mysterious Alchemist, in a series of events that will lead to the awakening of the 'Aragami, the avenging spirit. Nightfall offers four new chapters for the main adventure and partially unpublished contexts: we are still in the fantasy-feudal Japan imagined by Lince Works, but the nocturnal and disturbing atmospheres of the Aragami give way to sunlight and particularly bright new environments, whose winter valleys and decaying cities. It is possible to experience the handful of chapters by impersonating both Hyo and Shinobu, but the distinction of male and female gender is not accompanied by particular skills or possibilities in terms of gameplay: we will always have four special basic moves available, three of which are unpublished . Now our Shadow Warrior can in fact launch explosive kunai, performing an immediate kill and then following that of other soldiers in the range of the explosive, who are attracted by the corpse if present in their field of vision; it is also possible to call our ally (or ally) for help who will perform an immediate and stealthy elimination of any selected target, or throw stun grenades to sneak between particularly numerous groups of enemies. All these skills, even more than in the basic version of the title, significantly simplify a much more satisfying type of game if managed with simple stealth and accurate calculation of enemy movements, but also show particularly ingenious gameplay solutions; among other things, their invasiveness is limited by the number of times that we will be able to use them, just a handful between one game environment and the next, with the classic recharge times acting as an interlude. One aspect that has instead enriched the strategic component is undoubtedly the loaded elimination: with the Square command on PlayStation 4 we will normally eliminate an enemy, with a corpse collapsing to the ground, ready to be seen by all present and to trigger the alarm general; the charged elimination instead allows you to kill an opponent by making his body disappear on the spot, complete with a Tiger of the Shadow who comes out from who knows where and takes him away in his dimension. The advantage is that we will leave the area neat and clean without arousing suspicion, the disadvantage is that it really takes a long time to load the shot, which is therefore not useful in all situations. Playstation 4 trophies Aragami: Shadow Edition features two separate trophy lists. The first is that of the basic version of Aragami, with its Platinum Trophy: we will have to complete all the game levels, collect the collectibles hidden almost everywhere and unlock all the Aragami's abilities. The second list instead refers to the Nightfall expansion: of course the second Platinum is missing, because it is considered as a simple DLC, but the required objectives are also simpler and require you to complete the narrative and perform some special moves related to the new Shadow Powers . In two we make a massacre Aragami is a highly strategic title, which gives its best solo and probably without taking full advantage of all the upgrades made available by the developers: it is there that we are really driven to rack our brains, to calculate minutiously our path, to make the corpses disappear like madmen not to be discovered. A versatile title however, it is appreciated by all without really limiting anyone: the Nightfall expansion therefore introduces the online cooperative mode without canceling the fun or the general experience. On PlayStation 4 it is possible to play with a friend who also owns a copy of the title on PC, and who can therefore join our game at any time: in two the fun naturally doubles, but while coordination becomes fundamental it is equally clear that the level of difficulty drops drastically; a pair of assassins fighting together, when one of the two is already lethal with all his special abilities, make the four chapters of the expansion a walk. However, there is still one more possibility, and probably much appreciated by a large number of users: we tried it, and the stability of the netcode seemed good enough. Artistically speaking, however, Aragami: Shadow Edition offers two diametrically opposed contents, the first of the two (the main one) dark and fascinating, the second always valid in terms of mechanics and full of interesting innovations, but stylistically a cut below the companion: the two protagonists they are not at the same level as Aragami, and have not even received the right attention in the development phase; often woody movements, impassive faces and closed mouths during the dialogue phases are not exactly the best. From a technical point of view Nightfall is enjoyable and fluid: we just noticed some uncertainty in the checkpoint loadings after being eliminated and some smudging in the walls inside the buildings.", "date": "2018-06-06", "grade": "8.0"}