{"name": "Onrush sfreccia con la nostra recensione", "ref": "https://multiplayer.it/recensioni/200255-onrush-onrush-sfreccia-con-la-nostra-recensione.html", "text": "After the miserable end of Blur, Motorstorm and Split/Second: Velocity it was particularly difficult to imagine the rebirth of arcade racing games. Codemasters' Onrush doesn't just tip to overturn this prediction but, drawing inspiration from the most successful competitive games, try to establish itself also on the e-sports market, placing online competitions under the magnifying glass where teamwork is the only thing that really matters. In recent months we have seen an incredible evolution of the game both from a technical and gameplay point of view and now we are ready, after spending several hours behind the wheel, to give a definitive judgement. However, please note that given the nature of the game, the situation and rating may change in the coming months depending on community engagement and post-launch support provided by the developers. A problem, if we want to call it that, now relating to all productions born with this imprint, which inevitably require constant growth in order not to quickly end up being forgotten. So let's try to understand together if the foundations for growth are present and guess what the future of this new experiment will be. Start the engines Welcome to Onrush, an extreme competition where teams of six players go head-to-head with no holds barred for victory. An extremely simple basic concept, but which differs substantially from almost all racing games seen up to now where it was in fact the personal ability to be rewarded and recognized. Codemasters shuffles the cards a bit, proposing an original concept in its branch, drawing inspiration from the successful models that populate the current market. Onrush is a concentration of different types of influences, which mainly come from first-person shooters, in an embrace of that Overwatch by Blizzard capable of making record after record. Thus, instead of simply trying to cross the finish line first and pass under the checkered flag by uncorking the finest champagne, we will find ourselves entangled in a constant struggle between counters, jumps and acrobatics at the wheel of some ultra-tamarri racing cars that include not only cars sporty but massive 4x4s and agile two-wheelers up to the most exotic buggies. The vehicles are eight in all and, although the number is extremely small when compared to those seen in Forza Horizon or Burnout, you still don't have to be scared. Onrush has many more points of contact with a hero shooter, as we said, and each of the vehicles available has its own skills, a unique driving style and, above all, features in the race that must be blended well with those of the other team members if you want to have any chance of winning. Yes, because just like in Overwatch you can rely on heavy vehicles to provide shields to your teammates, access cars to ram and throw your opponents out as if you were assassins or even use motorcycles and guarantee your team bonuses for the RUSH. a sort of fuel to be spent to activate special abilities. The mix works reasonably well, even if the difference in driveability between one vehicle and another is not as varied as one might expect and the impression one gets is that the choice of vehicle, with the exception of ability, is not then so crucial. The biggest problem is dictated by the flattening of the speed, made standard for all vehicles: a choice that undoubtedly favors the racket on the screen while keeping the group united, but which in fact streamlines the game system too much, putting skills dangerously in the background driving. The trajectories and mastery behind the wheel are not essential elements, where strategy and knowledge of the game mechanics are incredibly more important, transforming Onrush into a game suitable for everyone but which prevents the individual from standing out as he deserves, a decidedly dangerous sword of Damocles for a game devoted almost exclusively to competitive online. All from the mechanic It must be said though: this Onrush is full of mechanics to be a simple competitive driving game. The most important part of all the gameplay lies in the turbo bar, a rather standard feature that is loaded through stunts, jumps and eliminations of opponents, but above all by sending the followers to the ground. These are nothing more than simple non-player characters with continuous respawn, mobile targets essential to keep up the pace of the game and guarantee you speed bonuses. The greater the turbo you will download and the faster you will fill the RUSH ability, a variable that potra overturn the course of the race or at least the round. That of the supporters, for example, is an idea we have already seen on Titanfall and which we have always appreciated, a feature that also goes well with this type of game, offering intense moments and great chaos on the screen. Then there is the need to use the turbo at the right time after a landing, a bonus to be taken by standing next to your allies; obviously the emphasis is also placed on sending opponents off the road, by ramming them or landing on them using one of the many ramps positioned on the tracks. The circuits are numerous and well characterized, even with variable weather, but unfortunately they are irrelevant for the purposes of the race itself. If in a shooter the map offers specific lines of fire and strategies to adopt, on Onrush this occurs only in part, reducing the competition to a simple breakneck race. Even the dynamic objectives do not help to make sense of the tracks and the modalities, taking away space from different options from always repeating the same actions endlessly. Instead of competing to cross the finish line first, we will have to face competitions for the control of mobile points on the circuit, consume more turbo than the opponents, enter some portals to accumulate extra time before the stopwatch reaches zero or even destroy the opponents in a limited-return challenge. Unfortunately these modes are not enough to give enough substance to the game, which does present itself with a sort of single player campaign, nothing more than a series of competitions in sequence to tell the truth, but which then only offers online competitions with no possibility of choose the mode to participate in, with the mirage of the ranked expected after the launch. Playstation 4 trophies Reaching platinum on Onrush is not particularly complex but requires perseverance and dedication. Some bronze trophies are essentially automatic to take and are activated by using the turbo for the first time or by eliminating any opponent but there are also those designed for completionists, forcing you to complete all missions in singleplayer tournaments. To get to platinum you will then have to spend a good amount of hours on the title since you will have to collect as many as 250 objects for cosmetic changes and get a good amount of medals in competitive matches. What if boredom comes? The biggest problem of this Onrush therefore is that boredom and repetitiveness take over too quickly precisely because of the lack of strategic depth that the competitions come to offer. It may be a title that will entertain you at first, but in the long run the enthusiasm could soon wane, bringing the whole community with you. On the other hand, Codemasters' choice to combine the driver's growth with the usual prize boxes should be rewarded, however this time they can only be unlocked with the credits accumulated in the game and leaving aside any micro-transaction. Yet there was plenty of room to put some since between the aesthetic customization of the vehicles and the drivers, complete with more or less rare skins, there is objectively something to gorge on. The graphics sector is also very good, with excellent solidity in the frame rate and an enviable general cleanliness. Of course, the physics engine does not make you cry out for a miracle and often bumps and impacts do not go exactly as you would expect, but overall the production defends itself more than well especially given the amount of cars, objects on the track and sparks that can be seen flying around the screen at all times. To underline the brawl then there are other questionable design choices, such as the teleportation for those who stay too far from the group, or the extremely marked elastic effect that will speed you up when you are in the rear. Choices that don't really reward those who are better at it, lowering the difficulty curve and making it almost superfluous to effectively counter opponents. Take the car you prefer, perhaps changing it between one respawn and another in the race, and try to do your best while chaos reigns supreme around you: a general rule that applies especially in races against artificial intelligence where your victory, or defeat, will never be in your hands alone but in the choices applied by the other nine computer-guided means.", "date": "2018-06-05", "grade": "7.5"}