{"name": "Wild West Online: la recensione", "ref": "https://multiplayer.it/recensioni/199702-wild-west-online-wild-west-online-la-recensione.html", "text": "We had tried Wild West Online at the time of the first public alpha and we didn't like it very much. No, no diplomacy: he disgusted us. At the time it was a completely empty title, where the few available activities were simply unfinished or poorly implemented. There was really a lot of work to do to improve it, maybe too much, but who knows over time... When the launch of a semi-final version on Steam was announced in recent weeks, we were startled: how long ago we had written the article cited? A quick check reminded us that it was mid-November last year. How many months has it been since then? About five. To some it may seem like trivial information, but in reality it makes us understand a lot, because in five months it was literally impossible to fix such a disaster, especially for such a small team (but even for a larger one, it is useless to be under any illusions). In fact, it failed and Wild West Online was finally released in a state that to call pitiful is an understatement. Basically it has two big flaws: there's almost nothing to do and what little there is works terribly, when it does. Moreover, it is a continuous asking for money to have disproportionate advantages over other players. If it were a free-to-play we would have tolerated it, but since it costs around thirty euros, really not. Indecent offers Microtransaction offers begin at the character creation stage. Not even the shadow of a tutorial, if we exclude a video on YouTube that explains little and badly some basic mechanics, completely ignoring the advanced ones. The customization options are also sparse and limited. All you can do is choose one of two factions to join and take a look at the few clothing available. Don't worry, because during the game you can spend real money to buy chests that contain other items of clothing. Did we already mention that Wild West Online is one of the most sinister attempts to squeeze money through microtransactions that has ever been made? In reality, with many hours of grinding something, it is possible to buy even without a credit card, but it soon turns out that it is absolutely not worth it. Let's get back to us. Having appeared in one of the safe cities scattered around the map, where you cannot be killed, we begin to search for quests and systems to exploit our faction membership. We discover that compared to the Alpha version some features have even been removed: you can no longer choose whether to be a bandit or a man of the law, some interactions with non-player characters have been eliminated and there are fewer missions to carry out... it's a bad thing, since they were and have remained very banal. The gameplay now focuses on factions taking over key cities. Sounds fun, right? Too bad it works badly. There are essentially two reasons: the first is that with a low-level character you are mercilessly massacred by veterans (there are no specific events for newly created characters); the second is that, simply, the assaults are decided by the numbers: the most nourished faction always has the upper hand. Since the game servers do not operate any form of player balancing, you will understand that storming cities is more of a pain than a pleasure. What about leveling up? In this case things improve slightly, because the characteristics increase and the advanced recipes for crafting are unlocked. The problem is that doing it is really a pain. A long sentence. Up to level 10 you only have a revolver with which to kill enemies is very difficult, if not impossible if they are of a high level. The other ways to get experience points are: explore the map (each place discovered gives some points) and dig up resources for crafting. Too bad that the latter give one experience point at a time (compared to thousands needed to level up) that the inventory is very limited and that the Wild West Online pickaxes are made of butter. In short, the result is that it literally takes hours to obtain the resources for the basic improvements. Exploration is also unmatched monotony, as the cities are practically all the same. Yes, the buildings are identical as are the NPCs and shops. If desired, there are also the aforementioned bad quests to carry out, but they are really repetitive and all require you to be a courier. If we add to all this that in general very little money is obtained from activities and that much of this is spent on equipment maintenance, you will understand that there is very little left to save. The Fair of Nothing Just to do us some additional harm, let's talk about the functioning of horses and theand shootings. Our equine friends are simply immortal. This makes sense, because if they died it would be really painful to have to go back to a city every time and spend money to buy them back. The problem is that they are also real battleships: shooting a horse has no effect and, practically, you can make them run on any terrain, as if they were tanks. In short, shooting on horseback is reduced to necessarily aiming at the opponent's body, without being able to apply any alternative or advanced tactic. If you are lucky and you meet a player of our same level or of a lower level you have some chance, otherwise you just die. After all, the very few players left on the servers at the time of writing this review make it difficult even to find someone to shoot each other with. Alternatively there is PvE content... ah right, there is no PvE content. But there are a lot of bugs and glitches to surround the whole experience. Honestly it is not surprising to know that behind this disaster there is the name of the notorious Sergey Titov (Big Rigs, Infestation: Survivor Stories), who did everything not to appear, but which was discovered by an investigation conducted on several forums . In short, something was wrong could already be understood from the marketing campaign, focused on deceiving players by exploiting the wake of Red Dead Redemption 2, we just didn't expect something so low, almost offensive. Trust us and pretend it doesn't exist.", "date": "2018-06-01", "grade": "2.0"}