{"name": "Space Hulk: Deathwing Enhanced Edition", "ref": "https://multiplayer.it/recensioni/199901-space-hulk-deathwing-enhanced-edition-space-hulk-deathwing-enhanced-edition-la-recensione.html", "text": "We liked Space Hulk: Deathwing in its original edition, released at the end of 2016. We had appreciated the great fidelity to the franchise, the continuous tension that accompanied the exploratory phases of the huge space wreck that we had been assigned to control, as well as the hardcore approach to gunplay that made the endless waves of Genestealer its trademark, spurring us on to better organize the team of Dark Angels at our disposal and the relative equipment in order not to succumb to the blows of the monstrous creatures. An element, the latter, ~dirtied~ in the single player campaign by the possibility of recalling a portal which, despite its times, gave us the opportunity to restore the health of the units and return to the battlefield as fresh as a rose instead of suffering really for a medkit or some extra ammo. Now the title is also available on PlayStation 4 (and on Steam, through a free update for those who already owned it) with the Enhanced Edition, which adds to the basic experience a set of special missions to be tackled after the story mode, a new class and aesthetic customizations for the Space Marines, all strictly without microtransactions and at an affordable price. The problem is that this edition has very little ~enhanced~ since it does not optimize the menu interface for control via DualShock in any way, it does not introduce any technical improvements or an important feature such as support for HDR (which with such dark scenarios and contrasts between lights and shadows it would have gone to the wedding), and least of all it guarantees the necessary graphic cleanliness or a fluid frame rate, limiting itself to thirty frames per second despite the visual complexity and a run-in engine like the Unreal Engine quietly allowed to dare more. Inside the Space Hulk There is something of value to the Imperium in the massive space wreck the Deathwings have stumbled upon, and it's up to us to find out what it is. Sent inside the Space Hulk together with two companions, an Apothecary equipped with healing abilities and an Assault unit equipped with a Gatling gun, we will have to explore long abandoned corridors to achieve a series of objectives useful for clarifying what happened on board ship, which Space Marines were involved and why. The route, which we can check by calling up a full-screen map, rarely involves simple movements from point A to point B, often preferring to block our way with various types of obstacles and force us to take long alternative routes that will inevitably send us into the arms of enemies. The detection of the Genestealer hordes and other types of hostile units takes place through a tool similar to the one seen in Aliens: Final Clash, and the tension of those moments is similarly high: the monsters can literally come out ~from the fucking walls~, rushing to crowds towards our team and forcing us to defend the position until the end of the wave, shooting like madmen who have seen something moving among the trees of a jungle, shouting ~contact!~. It is possible to take some precautions by electronically locking the doors behind you, so that at least you are not caught off guard by the dark swarm, and remember to check for any turrets to be disabled via remote hacking, otherwise a possible game over. Playstation 4 trophies There are twenty-four Trophies obtainable with Space Hulk: Deathwing Enhanced Edition. Rather than being tied to completing the chapters that make up the game's campaign, however, achievements are unlocked by completing specific actions (killing certain enemies, as well as a certain amount of them) and by obtaining complete sets of skills through the use of points experience earned during missions. Dead and oxen of your countries As mentioned at the beginning, Space Hulk: Deathwing Enhanced Edition manages the vital energy of the characters in an atypical way, delivering us a limited amount of medikits assigned to the Apothecary, to be used on any of the team members by order (the relevant wheel opens by pressing the right backbone of the controller), but also allowing us to call up a portal to project ourselves, after a few seconds, into a safe room where we will be treated and we will also be able to possibly modify the protagonist's setup, equipping different weapons (all strictly belonging to the Warhammer tradition 40,000) and special abilities that we will have unlocked in the meantime. Opening the portal during a large-scale attack is naturally very complicated, but as mentioned, the very fact of having inserted this possibility ends up sbto launch an otherwise truly fascinating experience in its ruthlessness, able to give its best especially when faced in a cooperative together with three friends. In this regard, unfortunately during our online tests we have rarely found situations that are fully playable and without problems, experiencing crashes and latency episodes that make us reflect on the state of a production that in the last two years does not seem to have made much progress, especially in terms of finishing. The same discourse extends to the technical sector in its entirety which, we repeat, disappoints when compared with other shooters available on PlayStation 4: the graphics are often dirty, there are beautiful architectures but the assets are generic, the effects are within the norm (moreover the ~intermittent flashes~ of the Gatling give a huge annoyance: incredible that the authors have not remedied it) and, as already mentioned, important features are missing such as support for HDR and a frame rate that could have easily traveled at sixty frames per second. The landing in retail format stores is not facilitated by a completely missing localization (the game is completely in English, texts and dialogues), and it's a shame because the Space Hulk: Deathwing campaign itself has a lot to give, especially to fans of the Games Workshop franchise.", "date": "2018-05-29", "grade": "6.8"}