{"name": "FIFA 18 World Cup", "ref": "https://multiplayer.it/recensioni/199774-fifa-18-2018-fifa-world-cup-russia-fifa-18-world-cup-recensione-del-nuovo-aggiornamento-dedicato-ai-mondiali-di-russia.html", "text": "For a few weeks now, the attention of fans of football games has been directed towards the next season. Before moving completely to the new chapter, EA Sports has one last surprise in store for FIFA 18 owners: in fact, a substantial update dedicated to the World Cup in Russia will arrive on Tuesday 29 May which will add modes and many exclusive contents, i.e. 2018 FIFA World Cup Russia. Invited by Electronic Arts to its studios in Guildford, England, we tested it as a preview a couple of weeks ago and today we can finally reveal everything we've discovered about this substantial expansion. To Moscow The FIFA 18 World Cup update is set up just like a sort of separate expansion, complete with dedicated menus and modes. First of all, on the initial screen we find the international tournament as we will see it starting next June 14th: the 32 qualified teams compete in 8 groups, which faithfully follow those resulting from the draws held last December 1st at the Sala Concerti of the State Kremlin Palace. It's up to the player to choose which one to support in order to reach Moscow and the coveted July 15th finale. Loyalty to the real competition is also guaranteed by the license for the 12 Russian stadiums, which are reproduced in meticulous detail even on the billboards along the pitch. There are also dedicated choirs, choreography, new introductory scenes and unpublished commentary lines, which allow you to immerse yourself perfectly in the global climate. But what to do, on the other hand, if the disappointment over Italy's failure to qualify for the next World Cup hasn't yet resolved? Well, in that case just start a custom tournament to change the tables a bit. For example, we could decide to create an alternative scenario where our national team managed to overcome Sweden in the play-offs: we then proceed to remove our Scandinavian friends from Group F, replace them with Italy and go to face Germany , Mexico and South Korea together with Buffon and his companions. Obviously the same can be done with all the national teams present in the game and in any group, thus deciding to qualify Vidal's Chile or Kessi's Ivory Coast. In a similar way, the tournament can also be played online, both against friends and against opponents from all over the world. Veteran players will also notice some extra changes within the game. For example, a real-time timer for recovery has been included, which helps to have a more concrete idea of how much is still left to play, even if it is not always accurate to the second. In addition, new animations and improved faces have been created for the stars of the qualified national teams, to offer a greater sense of realism when using certain squads. World Cup Predictor Along with the update, the World Cup Predictor will also arrive, a sort of simulator that will allow fans to try to guess the results of the matches of the World Cup. The system will present two modules, one dedicated to the results of the day's matches and one designed to predict elements of individual matches, such as the presence or absence of a specific player. Participants will then be able to participate in the prize draw. For more information, we refer you to the official website of the World Cup Predictor. A worldwide Ultimate Team As always, the Ultimate Team deserves a separate chapter, for some years now the queen mode of Electronic Arts football. Also in this case the World Cup version is separate from the standard one, although it shares the balance of credits and FIFA Points with it. For this reason, every time you buy a package in the section dedicated to the World Cup, you receive one of equal value to open in traditional FUT. Apart from this, the methods are quite traditional: in fact, there are online and single-player tournaments and drafts, as well as new squad creation challenges. Instead, the players present in the packages change, given that only those present in the squads of the qualified national teams find space, complete with updated evaluations for the occasion. The chemistry system also changes accordingly, giving priority to nationality and confederation (UEFA, CONCACAF, etc) rather than leagues and club teams. Then there are new icons selected based on past results in the tournament, with four new entries: Miroslav Klose, Hidetoshi Nakata, Gary Lineker and Bobby Moore. As always there will be updated players based on their performance in the tournament, with boosted cards like Team of the Week and the like. Pad in hand, on the other hand, essentially nothing changes, given that the update proposes again without rili changesevo the basic gameplay of FIFA 18. To have substantial news from this point of view, we will therefore have to wait for the next chapter. We conclude with a dutiful mention of the Switch version, which will receive the update exactly like the PC, PlayStation 4 and Xbox One versions: owners of the Nintendo hybrid will have all the contents of the update but, just like in the basic version, will have to give up the new kinematics in Frostbite and some online features such as friendly games with friends. Ultimately Fifa 18 - 2018 FIFA World Cup Russia is a really full-bodied update, which adds many world-themed modes designed to satisfy fans of all nationalities. It also has the undeniable advantage of being free and, above all, of being part of a period in which the EA title is heavily discounted: at the time of writing it can in fact be purchased for around 20 euros on all digital stores.", "date": "2018-05-28", "grade": null}