{"name": "NBA 2k6 - Recensione", "ref": "https://multiplayer.it/recensioni/nba-2k6-recensione.html", "text": "NBA 2K6 offers, as is logical to expect from a good sports title, a fair variety of game modes. In our view, the most interesting ones are those called Season and The Association. The first, as the word itself says, is the canonical one that will allow you to play the entire NBA championship up to the final stage to win the title. The other, however, appears perhaps the most complete. It consists in playing the General Manager of the favorite team, managing it both from an administrative and technical point of view. A bit like in Pro Evolution Soccer 5 for the Master League, but a little more refined. In the role of this ~character~ the user will be able to organize his own technical staff by choosing coaches, players and talent scouts to unleash around the USA in search of budding young champions, or even establish the team's weekly rhythm by planning the phases day after day of training or rest, and maybe take care of teaching tactics to our men if we really don't want to rely ~entirely~ on our coach. Obviously it will also be necessary to take care of the transfer market with the other NBA teams, taking into account the real rules of the federation, such as the salary cap imposed on the various teams on player engagement. Everything can be managed via a convenient graphical interface with a ~side-retractable~ menu. Another valid mode also from the point of view of longevity and the level of challenge offered is the ~24/7 the way to the EBC~, which is none other than the career mode. After creating a player through the appropriate editor, you must train him by earning points for his growth in certain technical-physical skills until he becomes a complete athlete, and thus bring him to play from the concrete pitches of his neighborhood to the parquet of the NBA stages. The ~Situation~ mode completes the picture, which allows you to take the field as and when you want, choosing, among other things, the time from which to start playing a match or the score, ~Street Ball~, where to challenge your opponents in exciting challenges on the asphalt of improvised pitches, and ~The Club~, a 3D venue on the model of the one seen in WWE Vs RAW in which, in addition to being able to furnish the environment with various gadgets earned by playing, you can compete in some mini-games such as darts. But it is on the parquet that NBA 2K6 gives its best. Once you take the field, in fact, it is finally possible to enjoy all the most substantial novelties of the title, launching yourself into a challenge to the last basket against the fierce CPU or a friend. Let's say right away that the first impact with the actual game can be ~dramatic~. The controls have increased in number and changed almost completely compared to previous episodes, and this could cause some problems for both fans of the series and newbies. These modifications, which mainly concern the management of running, feints, and shooting for a basket, once learned by the user, however, allow almost total control over the men and the actions they develop. In this sense, we point out the presence of a new execution system called ~Shot Stick~, which consists in the use of the right analog stick to operate a more controlled shot. Although initially difficult to master, this method will allow the user to make softer shots for a basket by moving the lever backwards, or dunks of different types depending on the movement of the player or the direction assumed by the analog stick itself while jump. The lever is also used in the defensive phase, given that with a small touch you can try to steal the ball from your opponent. The gameplay is not very immediate but engaging, therefore, on average difficult given the extreme realism that characterizes the title. It is also interesting to highlight how the tactical aspect has assumed an even greater role in this NBA 2K6 than in the recent past. There are several strategies that can be adopted by the various teams and can be used simply by selecting them in game in real time with the movement of the D-Pad (each direction indicates a pattern). Thanks to the good AI of the companions, these strategies allow the gamer to develop sophisticated and credible actions both in the defensive and offensive phase. Although the engine has remained the same as the previous edition, thus re-presenting slightly angular polygonal models for athletes, if seen closely, and well-made textures even if not exceptional, we cannot fail to highlight equally the good restyling made by the graphics 2K Sports, who have however made the right improvements such as to give greater aesthetic accuracy to the giocatori, the playing arenas and the surrounding environments, especially in the exteriors, now very well-kept. For a valid overview. Everything is seasoned with touches of class such as the public that slowly fills the structures, and that we sometimes see queuing at the ticket office, or the cheerleaders at the end of time. It's just a pity that these ~characters~ are made in an approximate way, with few polygons, but this is a ~problem~ that afflicts all today's sports titles due to the technical limitations of current consoles. The animations, the real highlight of NBA 2K6, give greater strength to the visual impact of the game. Well-kept, precise, the list of movements that can be practiced by virtual athletes on the field is very numerous and allow athletes to perform actions practically equal to those of their real counterparts. The audio sector is good, with a soundtrack characterized by Rap and Hip Hop tunes and in-game sound effects and well-made commentary, in English. Despite some small shortcomings and the loss of the ESPN license, NBA 2K6 is overall a respectable title. One of those who manages without frills to reproduce American basketball very well both from the management side thanks to the more in-depth Association mode, and from the one played. Defects there are, for heaven's sake, especially in the excessive difficulty of some games or, at least for some, in the controls, which, although simplified by the Shot Stick system, are a bit too numerous and could confuse newbies, but none of this minimally affects the general quality of the 2KSports title and our final judgment which remains positive. Pros Multiplayer mode up to 10 players Excellent artificial AI Texts in Italian Cons Absence of the 60 Hz selector A bit difficult for newbies Roster not updated to the new season Cross-platform NBA 2K6 is also available for Xbox, in a version that is practically indistinguishable from the PS2 version, were it not for cleaner graphics and slightly more defined textures. In the United States, basketball has for some time become the national sport par excellence, like and more than American Football, at least that's what it seems to be based on the audience and popularity data recorded by this sort on TV and in stadiums. For young Yankees, basketball represents what football is for us: almost an obsession. Perhaps lived in a more sporting way, without the excessive controversies or fanaticisms that daily afflict the sport most loved by us Italians, but always with a certain amount of attention. It therefore seems inevitable that many software houses focus their interests on the development of titles that reproduce all the fun that this sport can give to fans in a videogame key. After the good results of the previous chapter, the 2K Sports team has decided to create a new simulation dedicated to overseas basketball, the famous NBA. Not without some problems. First of all, the loss of licensing rights related to the ESPN brand, which in pennies translates into the absence of the TV brands and logos that characterized the series until recently. However, teams and leagues have kept the original logos and therefore the uniforms and Roster are the real ones (even if the latter is still ~updated~ in August 2005).", "date": "2006-06-28", "grade": null}