{"name": "SEGA Mega Drive Classics: la recensione", "ref": "https://multiplayer.it/recensioni/199565-sega-mega-drive-classics-un-tuffo-nel-passato.html", "text": "Writing a review of a collection of historical titles like this SEGA Mega Drive Classics is never easy, above all because it becomes impossible, and among other things it would be illogical to try to do it, give merit judgments on the graphics or gameplay, perhaps making direct comparisons between the game mechanics of the time and those of today. Furthermore, it is undeniable that the classic ~nostalgia factor~ may influence the judgment and a certain interest in these titles, it being understood that some titles have not lost their charm and fun despite the years on the back. Therefore, as we have often done in the past for similar productions, we will evaluate the overall offer more than the value of each individual game. A collection for all tastes SEGA Mega Drive Classics offers the best of the golden era of 16bit production, with over fifty of the most interesting games ever released on the SEGA Mega Drive and Genesis. Once the collection has been loaded, the user finds himself in a bedroom furnished in an 80s-90s style, complete with posters, a stereo, an old-fashioned television and a Mega Drive. In this customizable space you can access the various options and, above all, the library of games, each sorted in their original cases on a shelf. As in the most forbidden dream - obviously remaining in the purely playful sphere - of the kids of the time. By bringing the shot closer, you can then browse through dozens of cases to choose the titles to try. And from this point of view there is only the embarrassment of choice between old classics (and their sequels) produced by SEGA such as Golden Axe, Sonic, Space Harrier II, Altered Beast, Shinobi 3, Comix Zone, Virtua Fighter 2 or the Streets of Rage trilogy. And again, just to name others, Shining Force, Wonder Boy III: Monster Lair, Wonder Boy in Monster World and Phantasy Star. On balance we can not complain too much about the offer, given the quantity and quality, even if a careful analysis, we note the absence of other titles of a certain thickness of which we do not understand the lack. If the ~usual~ Moonwalker can also be postponed given the situation linked to the figure of Michael Jackson and possible legal problems, the same cannot be done for masterpieces of the time such as Out Run, Super Hang On, Mystic Defender and After Burner, just for name a few. In short, perhaps something more could have been done to meet SEGA enthusiasts. In any case, depending on the games, by pressing the left analog stick of the pad it is possible to select the region, while with the upper back keys, access the extras or the command that allows you to insert them among your favorites. Good fit Once you've chosen the game you want to play, the cartridge starts up in the digital Mega Drive and the images start rolling on the television in the virtual room. At that point you can decide whether to play in full screen or with the shot on the old TV. To make the games more usable today on the new consoles, some features have been implemented such as Trophies, the possibility of saving the game at any time, thus going beyond the limited number of ~continues~ of some games, and of configuring as desired pad commands. And again, the possibility of playing online has been included with a multiplayer mode complete with direct invitations or matchmaking to select occasional companions, and 2Vs2 challenges, as well as a ranking that takes into account progress in each game. At the time of our test we did not register major problems with access or usability of the modes. These additions are then joined by a series of options relating to the technological part. All games have been optimized for the 1080p format, with the possibility of using selectable side borders to adapt their 4:3 aspect ratio to 16:9 screens, and the addition of some useful and functional graphic options, so as to be more ~digestible~ to current televisions. Through the settings it is also possible to enable the mirror mode, or alter the graphics by setting a series of filters in the appropriate ~pixel scaling~ space. Depending on what you choose, the images abandon their checkered appearance in favor of more mixed colours, but also lose their brilliance and, in our opinion, their charm. But it's a matter of taste. The same ones that can convince a user to pay or not the 29.99 needed to buy the collection digitally or on disc.", "date": "2018-05-25", "grade": "7.5"}