{"name": "Super Hydorah: la recensione", "ref": "https://multiplayer.it/recensioni/199728-super-hydorah-super-hydorah-la-recensione.html", "text": "The ~retro~ shoot'em-up is now an established sub-genre, capable of tickling the palate of the nostalgics of the 80s and 90s, but also of finding the approval of new enthusiasts thanks to the immediacy of a gameplay that of the decades it has not known particular evolutions, and for this reason it has never made the great leap from niche entertainment to the general public. A few months have passed since the excellent debut of Super Hydorah on PC and consoles, but the shooter developed by Locomalito frankly seemed born for the mobile dimension, and in fact the iOS version of the game fully expresses the potential of the experience, thanks to a control system almost perfect touch. Little to say about the plot: an evil force threatens the galaxy, the Meropitian biomechanical creatures, and only a skilled pilot can oppose their advance. On board the powerful Delta Lance ship, equipped with a customizable arsenal based on the weapons unlocked from time to time, we will have to face a single player campaign consisting of a total of twenty-one stages, trying to complete them all or advancing as quickly as possible towards the final clash. We will find many different enemies and an avalanche of bosses waiting for us, the latter undoubtedly the flagship of the production: many, unique, well characterized both from an aesthetic point of view and from the attack pattern. Shoot everything While not revolutionizing the traditional mechanics of the genre in any way, Super Hydorah does everything possible to mix the cards and make the action more varied, especially in terms of levels. Most of them are characterized by horizontal scrolling, but there are also variants that move vertically or have numerous moving elements, to be reckoned with in the midst of the fiery inferno unleashed by the many opponents on the screen. We will be able to control the spacecraft by acting on an invisible stick on the left side of the screen, with an adjustable sensitivity degree, and use the autofire to not further cover the display, touching the right side of the touch screen only if we want to interrupt the fire or operate a smart bomb. Generally at the end of each stage we are given a new weapon, after which we can decide to equip it or not from the menu, changing the main cannon, the secondary one and the aforementioned smart. The options produce very different results: a more concentrated or wider shot, homing missiles (essential!) or cluster bombs, and so on. By eliminating the enemies, we will instead be able to collect green or red elements, useful for respectively enhancing the primary and secondary weapons, but also smart bombs and shields. However, the latter can regenerate after a few moments if the ~easy~ difficulty was selected at the beginning of the campaign: a step that we consider necessary, given that the Super Hydorah experience is anything but simple. In short, the Locomalito title works perfectly, apart from a couple of uncertainties regarding the controls: it sometimes happens that the touch ~falls asleep~ and there are situations in which strong currents tend to move the spacecraft, making its management difficult and cumbersome . We can also discuss the price of 7.99 euros, much lower than the PC and console versions, but in any case higher than the average on the App Store. The pixel art graphics, all raster and rotations, take up the aesthetics of 16-bit platforms and always flow smoothly, managing, as mentioned, to offer very varied scenarios also from a visual point of view. Likewise, the soundtrack perfectly captures the atmosphere of those years, although some melodies seemed a little ~already heard~.", "date": "2018-05-25", "grade": "8.5"}