{"name": "Chivalry 2", "ref": "https://multiplayer.it/recensioni/chivalry-2-recensione.html", "text": "If Torn Banner Studios' goal was to recreate the spectacularity, tension, involvement and uncontrollable chaos of a medieval battlefield, plunging us into the midst of large-scale clashes where literally anything can happen, this review of Chivalry 2 will tell you that it has been achieved. Brilliantly? We'll get there.Nine years have passed since the debut of the Chivalry series, which had no particular pretensions other than, in fact, making us relive the panic, the adrenaline, the fury of two armies fighting for control of a territory, for the defense of a castle or even inside a carousel, interpreted in this case as a bloody public show organized to entertain the nobility of the kingdom. Gameplay The idea behind Chivalry 2 is very simple: starting from the interesting mechanics of the first chapter to build a substantially more solid and refined experience, equipped with a combat system capable not only of rendering the impacts between iron, wood and flesh well , calibrating everything on the relationship between distances and timing, but also to offer unprecedented strategic facets and greater realism of the movements. The result of these efforts is evident right from the start, when you try your hand at the tutorial. Fighting in Chivalry 2 is a deeper experience than you might think, whether you're using the first or third person view. The attacks can in fact be accompanied by dragging the mouse or rotating the right stick (a combination that is not very simple to obtain on consoles, frankly) to change the point of impact of the blow on the fly and thus overcome the opponent's defense. Chivalry 2, here are the archers: cannon fodder in the absence of someone to cover them. The repertoire at our disposal includes various maneuvers, from the slash to the lunge, from the kick to the blow from above, from the special move to the dodge, regulated by a stamina bar that empties very quickly. The intentions are clear: on the battlefields of the Torn Banner Studios title there are no warriors able to easily escape death, also because everyone is wearing heavy armor and this is rendered quite well on the screen. The problem, already evident from our test of Chivalry 2 a few months ago, is that in the middle of the battle all these nuances are not exploited. There would be the possibility, mind you, but single duels are a rare commodity and don't last more than a few moments: the time that the soldiers of one faction or the other arrive to lend a hand to their partner, creating a situation of numerical superiority that leaves no escape. Chivalry 2 summarized in one image. In short, we are talking about a limit of the game, but thinking about it, also in this case a faithful representation of reality. In fact, you may be the most skilled swordsmen in the world, but in a similar context you will have the opportunity to exploit your skills only in a matter of seconds, taking advantage of a glimmer of opportunity that will have vanished a moment later, when in front of you there will be at least three or four enemies. In the end, assessing situations is also part of the skills required to survive as long as possible (mind you: as long as possible, not for the entire duration of the match) in Chivalry 2, together with the attempt to organize the offensives despite all the difficulties of managing sessions that can host sixty-four users in an enthusiastic and chaotic crossplay between all platforms. Classes and progression Chivalry 2 includes four different classes, you see them all in this image. Chivalry 2 focuses on the characterization of four different classes belonging to the factions of Agatha (blue) and the Freemasons (red), all available immediately: Archer, Vanguard, Valet and Knight. Each has an independent progression, which allows you to gradually unlock new specializations equipped with specific equipment and skills, for a total of twelve variants. The weapons that we will bring into battle will obviously make the difference, also and above all on a tactical level: an archer has short-lived if there is no one to defend him while he shoots his arrows, just as knights wielding spears, halberds or two-handed greatswords can sink more effectively than those using short blades, even if the latter can enjoy an extra cue and dance more easily around enemies to find a gap in their defense. Chivalry 2 allows us to dress our soldiers however we like. However, the central point of the progression does not lie in the upgrades, which in Chivalry 2 are absent in order to avoid phenomena tending to pay-to-win. With theresources earned in battle (or, if desired, with microtransactions) it is only possible to purchase aesthetic customizations, and from this point of view the guys at Torn Banner Studios have really put a lot of effort into it. In fact, we will be able to modify many aspects of the characters: from sex to face, from the hair to the beard, from the helmet to the uniform, passing through the voice, the friezes, the banner and obviously the appearance of the weapons that fall within their equipment. The alternatives are many, many must be unlocked and allow you to create a well-recognizable group of soldiers. Structure Chivalry 2, the moments before a fierce battle. This well thought-out system, which can count on the solidity of an apparently faultless network infrastructure thanks to dedicated servers, is expressed through three modes and eight maps. Depending on the scenario, we will be able to try our hand at violent team deathmatches or all-against-all, or with the most interesting stipulation of the lot, which works in objectives. In the latter case, what we will have to do is gradually conquer certain areas of the 'setting, thus allowing our siege engines to advance towards the enemy fortress or slow them down if we play in defense, in a rather varied and interesting alternation of roles and situations, which in some ways recalls the siege missions seen in Assassin's Creed Valhalla . Chivalry 2, a spectacular fight sequence. There is no single player content in Chivalry 2, beyond the tutorial and a section dedicated to offline training designed to somehow prepare us for the fury of multiplayer-based battles. From the start screen it is therefore possible to access the playlists for 64 players, those for 40 players and all-against-all, or manually select the server we are interested in and access it. As mentioned, the network infrastructure seemed very solid to us : probably thanks to crossplay, which increases the total number of users available per session, the matchmaking is resolved within a few seconds and during the action we have never encountered problems attributable to latency, despite the large number of participants for each single match. Technical realization Chivalry 2 handles hundreds of characters on screen without any problems. On the technical front, Chivalry 2 defends itself well. It is not a question of brute force or particularly sophisticated technological solutions, but of a mix of expedients and artistic direction that make the difference, creating, as mentioned, a very engaging atmosphere and recreating the spectacularity of medieval battlefields. From this point of view the first person view works much better than the third one, which ~facilitates~ some things by giving us a better way to control the position of any nearby opponents, but sacrifices something in terms of tension and involvement. The character animations, good but not excellent, also suggest first person as the best approach. A more than discrete job has been done in the field of effects, fire performs well as does blood, especially when it gushes from a freshly severed limb (which, mind you, could easily be yours), creating puddles on the ground that contribute to the Grand Guignol aesthetics of the Torn Banner Studios title. On water the reflections are simple cubemaps, but it seems that ray tracing could arrive in the future with an update. That said, performance is obviously the most important thing in a game like this, and in this respect Chivalry 2 does not disappoint, running on the test configuration at 4K and 60 fps with all effects maxed out, with no hesitation. Thanks to polygonal models that are not extraordinarily complex and to effects that prefer to remain light, but the final compromise seemed more than acceptable to us.", "date": "2021-06-18", "grade": "8.0"}