{"name": "Conan Exiles: la recensione", "ref": "https://multiplayer.it/recensioni/199009-conan-exiles-conan-exiles-la-recensione.html", "text": "Conan Exiles is a classic example of a game that has benefited enormously from Steam Early Access and is also one whose development team has proven to be very fair with the user, providing a rigorous schedule of updates right from the start and intervening promptly where most required. In short, seriousness has paid off at all levels and the finished product is definitely better than the one seen in the first versions, despite having been closed in a reasonable time and despite not having been completely redone. The thin plot puts us in the shoes of an exiled criminal sentenced to death, who is pulled down from the cross by Conan during the introductory cinematic. We're talking about a survival game like Rust or Ark: Survival Evolved that takes advantage of the world born from the pen of writer Robert E. Howard as a setting and which we have already talked about extensively in the past. As soon as you take control of the character, completely naked, you have to hurry to escape from the desert where we find ourselves, reaching a more friendly territory, so to speak. But first we can get to know the crafting system, which will occupy us for most of the game time. Collecting some vegetable fibers, stones and sticks, we can build clothes and have the first working tools: a pickaxe and an axe, both made of stone, very rough and not very resistant. Luckily in the meantime we have gained a few levels (the first ones are achieved very quickly) and we can assign points not only to the character's characteristics (six in total), but also to new crafting recipes, so as to have more options, which real weapons and the first construction materials for buildings. Despite the improvements, the crafting part has remained the most constant over time and hasn't changed much since the beginning. To collect material just find the resources and hit them with the right tool. Obviously more or less can be carried depending on the strength of the character, whose growth is quite fast at the beginning, i.e. when the so-called ~journeys~, tasks to be carried out in the desired sequence, are still very simple and immediately give a large number of experience points, but slows down in later levels. The general difficulty is calibrated well, but varies greatly depending on how you decide to tackle the adventure, playable alone, in cooperative or in PvP. To survive Before continuing with the description of the gameplay, it is fair to specify that, like practically all survival games that provide it, Conan Exiles is at its best when played cooperatively with friends. Unlike survival designed explicitly for the single player such as The Long Dark, Subnautica or The Forest, here walking around alone can cause too many difficulties. The new combat system, which we will discuss shortly, has rebalanced the situation a bit, but the fact remains that you get the best out of playing with others. For PvP the question is more thorny, because it requires accepting the usual problem of survival: omnipotent players on the servers, that is, those with an incredible number of hours of gameplay behind them, which make it very difficult to play decently. Our advice is to start gradually, studying the game system in single player or with a few friends, and then try your luck online, perhaps on servers where the shelters are indestructible. Currently it is the only way to be able to get into the action without drama, since there are people who have been playing it for over a year. But let's get back to us. We had left our exile grappling with the first problems to solve. Once you have unlocked some recipes and collected the necessary raw materials, you can finally build a small shelter (to build something, just click on the appropriate recipe in the inventory, provided you have the required resources), perhaps furnishing it with a bed of leaves, a chest for clearing excess material from your inventory and a bonfire for cooking food. Later we will have much more furniture to choose from, in addition to the various workbenches, essential for making the best equipment. Where to place our first home? Better near a body of water, so you don't have problems quenching your thirst. For hunger we will have to make do with some insects, at least until we have learned to hunt. We don't particularly like the place where we are, because the raw materials we find are only the basic ones. As soon as we have grown a little and we have stabilized we decide to go and explore the inside of the map. Conan Exiles manages the growth of the character and the difficulty of the game in a gradable wayual and flawless: the best materials are found in the most remote areas, reachable only when you have a character strong enough to survive the enemies who gradually get stronger. The first are other exiles, giant crocodiles and turtles, all dangerous but slow and easily manageable in the long run. Later we will meet much stronger and more numerous tribes, ice giants, living skeletons, mammoths, pumas and many other opponents, who will make the exploration of the different biomes problematic, but at the same time rewarding (it starts in a desert, cross a more luxuriant area and gradually head towards the rugged snowy lands, to finally arrive at a gigantic volcano). There are also bosses, i.e. particularly powerful opponents normally placed at the bottom of some dangerous dungeon, which can only be faced with the right equipment and adequate individual experience. And this is where the combat system comes into play. The new combat system Put bluntly, the combat system of the first versions of Conan Exiles was terrible: slow, slimy, imprecise and unrewarding. Luckily Funcom took the criticism and completely revised it. Indeed, it has really revolutionized it. Now fighting is no longer a pain and the player can manage to develop his skill in dealing with enemies. To be honest, it works all too well, with the introduction of the system of combos and special moves (different for each weapon) and the greater and more precise response of the bodies to the blows inflicted. Now entering a village full of enemies is no longer a torment, as well as facing more of them at the same time. Of course, it's not a walk in the park and you die very frequently, but at least you understand where the shots come from and you can clearly see when you hit, without our weapons slipping on the bodies of the opponents. The developers have also added a life bar on enemies to immediately give us an idea of their resistance, so perhaps not to waste time with those who are too strong. From this point of view, the work of the development team was simply impeccable: everything has been redone or remodeled, animations have been added and, in general, the old, obviously irredeemable model has been completely abandoned. Of course, it's still not perfect and, for example, when in melee aiming shots is difficult and you often end up hitting a friend, rather than an enemy. This doesn't mean that it's enormously better than the old one, which was a real pain. Thus, the construction of new equipment also makes much more sense, which is not limited to being a compensation for the defects of the combat system, but a reward for our greater skill. Of course, it takes a few hours of play to have at least iron weapons and armor, and much more to get to those made of precious materials, but the bonuses they give are finally perceptible on the battlefield. To say: we tried the game by launching an old save of a game carried on with the old combat system and we were amazed at how much more effective and rewarding our dark metal weapons have become to use than before. A better world In short, the road that leads from being an exile to becoming the ruler of a real citadel is long, but now it makes more sense to complete it. However, over the months Funcom has not only worked to refine the different game systems and add new ones (such as the climbing one, which allows the character to climb walls by consuming stamina), but has also worked wonders from a technical point of view. Conan Exiles has always been smoother than its direct competitors, especially Ark: Survival Evolved, but with the final release most of the old problems are gone. There are still some bugs, in particular in the final dungeon, but in the other parts of the game they hardly exist anymore and, in the face of the stability and fluidity achieved, they are not paid much attention anyway. Compared to the competition, Conan Exiles also has another advantage: the compactness and richness of the setting. The places in the game are not only graphically beautiful, but also have their own meaning within the scenario and mythology created by Robert E. Howard, which is expressed through the documents found during the adventure and in the architecture of the buildings that underpin the map. For some it will be an insignificant element, but in reality it adds a lot to the action and, above all, avoids the hodgepodge effect typical of many survival which, not havingor behind a conscious writing, they end up mixing everything that's in fashion a bit, creating silly worlds that end up resembling amusement parks. In short, a world is such not only because it has its own coherence, but also because it is organic and well described in its different parts.", "date": "2018-05-10", "grade": "8.7"}