{"name": "La recensione di Dungeon Hunter Champions", "ref": "https://multiplayer.it/recensioni/198699-dungeon-hunter-champions-la-recensione-di-dungeon-hunter-champions.html", "text": "The wait was longer than expected, but here we are finally grappling with Dungeon Hunter Champions, the interesting MOBA-style spin-off of the famous Gameloft action RPG series. Fresh from the success of the fifth episode, the French house has evidently reflected on what to offer its users again, and in fact the game responds to these needs quite clearly. In addition to a long traditional single-player campaign, in fact, there are missions with an alternative gameplay, which on the one hand lead to direct clashes and on the other to real battles in the multiplayer online battle arena style, within a map with different routes and with the inevitable towers to be destroyed in order to win the match. The same approach also opens up to competitive online, with interesting five-against-five battles that are quite rapid in terms of matchmaking, but at present tainted by some latency problems that we hope will be resolved as soon as possible; together with connection errors that sometimes do not allow you to start the application, and which we imagine are linked to the high number of users crowding the servers. The great adventure Delivered to us a powerful warrior and a maximum of three support units (from a roster of no less than two hundred and fifty fighters, net of all variants), which we will be able to control at will where necessary, Dungeon Hunter Champions catapults us into a very rich and with some interesting variations on the theme, whether it's the aforementioned MOBA missions or boss fights against literally huge opponents. The touch control system works excellently, thanks to the automatically repositionable virtual analog stick and the clear icons placed on the right side of the screen, which are used to activate the main attack and three specials, each with a different cooldown period . Skimping on this type of attack is useless; on the contrary, thanks to the brevity of the sessions, it is advisable to use up one's resources without ever sparing oneself, also because in a few seconds we will be in possession of all our weapons again, ready to confront ourselves with the mini bosses that usually await us at the end of a few paths. Unfortunately, no progress has been made on the combat system front compared to the previous Dungeon Hunter, the impacts are also undervalued in this case and the result is a general feeling of inconsistency and slipperiness. However, we are talking about mechanisms and dynamics that have always worked well in the world of MOBAs and are unlikely to disappoint those familiar with this trend. Proceeding in the campaign and leveling up, the other modes are unlocked, including competitive multiplayer, and there is no doubt that on the structural front the developers have done a great job, peppering the game with equally valid and interesting content. A different Dungeon Hunter Returning to the combat system of Dungeon Hunter Champions, it is clear and evident how the approach linked to the simplification of the mechanics has now taken possession of the franchise, unfortunately making the fights a mere matter of values in the field rather than skill. In fact we are faced with the desire to adapt a MOBA gameplay to an action RPG with missions, with all that this entails in terms of balance: the missions of the first hours are completed quickly and painlessly, without ever running into a game over, provided you use the bonuses and items that the system gives out in abundance. Even the action energy necessary to be able to descend into the dungeons is distributed with such generosity as to exceed the amount available by default by several lengths, giving rise to some doubts about the very choice to insert it. We are quite sure that at some point in the campaign things will take a different turn and the legitimate need to monetize will emerge, but as mentioned during the first few hours there really isn't the shadow of a challenge worthy of the name, which may force to fall back or switch from one character to another to catch his breath and use some healing spell. Similarly, lacking both the parry and the dodge, as happens by default in the multiplayer online battle arena, in the presence of a substantially stronger opponent we will not have a chance to tick it, unable to avoid taking damage and at the same time inflicting it ourselves . Sight for the eyes In short, we have a different Dungeon Hunter than usual, which draws on the MOBA genre and boasts a structure never so rich in missions, modes, characters and objects to equip and upgrade. But how do youen the game on an aesthetic level? Well, it is undoubtedly one of the most graphically beautiful titles ever seen on iOS and Android. The cartoonish contaminations and the feeling of being in front of a watercolor have taken a further step with this chapter, offering a perhaps derivative but convincing design for the characters, beautiful animations and dynamic scenarios, which often and willingly can be assembled and disassembled to pave the way to the next goal. Seeing all this in motion, with those colors and effects, is truly a feast for the eyes, assisted by a sound accompaniment that is up to the situation. The only problem, not a small one, is that the game at the moment causes the iPhone X to overheat quite quickly and consequently consume the battery, aspects that force you to close the application to bring the device temperatures back to normal values.", "date": "2018-05-03", "grade": "7.8"}