{"name": "Donkey Kong Country Tropical Freeze su Switch: la recensione", "ref": "https://multiplayer.it/recensioni/198581-donkey-kong-country-tropical-freeze-donkey-kong-country-tropical-freeze-su-switch-la-recensione.html", "text": "This is one of those reviews that certainly have meaning and weight today, but will have more in a few quarters, when we return to analyzing Nintendo's situation and the release of Tropical Freeze for Switch will no longer represent only the enriched and improved by a 2014 game, but the strategic summa of a company which in a few months will celebrate 130 years of life and which has just concluded what on balance was the most important shareholder meeting of the last two decades. Switch is doing more than well, Nintendo is healthy, it has managed a strong internal reorganization, it knows what it has to do in its future and the second half of the year seems to be rather well structured. Unlike Mario Kart 8 Deluxe, there is no middle suffix this time around. In terms of communication and brand, Donkey Kong Country Tropical Freeze for Switch is in all respects a new product and absolutely cut out for the new user, thus fitting into a semester in which Kyoto worked almost exclusively on maintenance, without shooting weight releases that rocked Metacritic. The perception of the console is so over the top that it has created a sort of positivity filter, which manages to overturn the usual controversies for remasters and the like. The idea of playing ~when and where you want~ today has a fresh concrete hinge to paraphrase and revive the very concept of a remastered edition. Not only that: the fact of taking up a catalog known for its quality but also for its unfortunate distribution places the products under a curious aura of justice in seeing them shine with their own light on a finally successful platform. Evolved monkeys Closing the topical hat we come to the fun part, the one in which we finally have the chance to embrace again, in its best form, a title that deserves much more credit. We've released some brand and character history these days, so we hope you know Retro Studios a little better. With its seven worlds, secrets, hidden levels and alternative routes, Tropical Freeze is made up of highly topical mechanics, strengthened by solid and varied gameplay. We like to point out how the brand has undergone an artistic turnaround with respect to the direction of the Stampers, setting the progress on a greater attention to pure platforming than the Super Nintendo trilogy. Design elements with practical importance are much more fused with great timing of jumps and platforms, often resulting in a sort of ballet in the air where precision to the pad and inertia of the bodies command. Thinking of the heritage of the English, everyone will solve the great best-worst question in their own way, but in our case the Retro approach is simply to be placed on a level of diversity and continuity, instead of (undoubted) quality. Kelbaugh's guys have taken the evolution of the Returns and made it injected with steroids: the resulting product is splendid in the art, in the shape, in the quantity of small elements that give life to the picture, in the well-kept animations of its protagonists, in playful feedback finally detached from motion sensors. It is an amalgam that has always convinced us, despite at the time some criticism of the difficulties and lack of courage of the new products which, however, today appear more part of a project rather than a badly managed whim, the result of the aforementioned swerve. In retrospect, Tropical Freeze represents the development maturity of a team that wanted and wants to establish itself today as a worthy heir to the characteristics that have always been typical of the brand, which are taken and married to the vision of Tanabe and Miyamoto, thus resulting in a great emphasis on platforming where the dynamic 2D factor wins more than the strategic inspiration to stop and think about how to use this or that element of game design. Sure, there will be no shortage of points for reflection, but Donkey Kong's new direction is technical, more about precision, less about constant innovation. In the most advanced worlds you will find beautiful playful and visual ideas but they will always be enslaved to a flow that will push you to move forward, a race where you occasionally catch your breath and then throw yourself headlong back into the dance of jumps and calculation of frames and millimeters. Here we return to the center of the previous paragraph: today we speak aware of the vision of Nintend's production in recent years, therefore what we once felt we were pointing to as criticism - or as the lack of an all-round vision of a team elected by popular acclaim as champion of the Metroid saga - today it has a concrete and precise flavour. It is therefore easy to pick up the title and let yourself be carried away by this perennial dynamism - not typicallyAmerican nte - which pushes the Retro vision high and draws the lines of a rosy future for the franchise. Provided of course that Wise remains firmly at the helm of the composition of the audio tracks, which to define astonishing is an understatement. We write it in bold, because you will remember these words when in a few years you will be surrounded by nostalgia: this is one of the most beautiful soundtracks produced by the entertainment world of the new millennium. Fly Funky! Donkey Kong arrives on Switch not without some news, but these are not the only ones to explain the choice to fully baptize the requested donation. It's all part of what is expressed in the first paragraph: having raised the bar in the price list is the result of a precise choice to dress it with first fruits and novelties, even in the eyes of those who - like myself - have already enjoyed a playthrough business suit. It is therefore not a cheap choice; it's something of a rebranding journey in shedding its past and reviving Retro work today, with features that can best handle the transition. This element, however, does not exclude it from a criticism of its attractiveness for historical users, while it could be digested without major stomach cramps by those who arrive today for the first time, perhaps following in the wake of this chat. Let's talk about what wasn't there until today: Funky Kong finally has room to show its worth. After acclaiming him on video, we tested the adventure in his company. Funky is the perfect solution for those who don't feel too much like howling in front of a game that is certainly not easy, even less to complete, but it doesn't just make the journey less difficult: with five hearts instead of two, all the abilities of supporting characters enclosed in one, the ability to rotate and move slowly in the air, the character gives a second point of view to time trials (and consequently speed runs). Therefore, if three years ago we were amazed by the difficulty of the title, Funky intervenes to affirm its right to exist, erasing previous criticisms with surfing strokes. We now come to the more hardware and performance part. Let's not hide that a good part of the time spent with Tropical Freeze to date has been in portable mode: it is too much of a turning point to be able to play a title like this from anywhere, disconnect the Joy-Con as needed and try the lust of local multiplayer . From a technical point of view, the framerate remains anchored at 60, while the image cleaning is greater thanks to the resolution increase to 1080p in docked mode. As you may have already read around, we confirm that the loading time between levels and map is much lower than the Wii U counterpart, a pity however for the absence of concrete additional content: evidently, new ideas are already being invested for the inevitable third part of the trilogy. Announcement at E3?", "date": "2018-05-01", "grade": "8.8"}