{"name": "Nintendo Labo", "ref": "https://multiplayer.it/recensioni/198595-nintendo-labo-kit-assortito-nintendo-labo-recensione-del-kit-assortito-il-futuro-e-di-cartone.html", "text": "Nintendo Labo has surprised everyone since its presentation. The idea of building cardboard peripherals, in fact, was welcomed as a somewhat crazy stroke of genius, which divided enthusiasts and caused a lot of talk about itself. After much talk, however, on April 27 Labo finally arrived on the European market: without being asked too much, we therefore immediately put all the potential of this new interactive experience to the test. Labo's resistance One of the major perplexities that emerges when speaking of Labo is undoubtedly linked to the resistance of the materials. In fact, the general idea, not without foundation, is that a cardboard toy is decidedly more fragile than a plastic one, as well as more subject to wear and tear deriving from exposure to water, grease or anything else a child may decide to throw on a new toy. In this regard, we can only confirm that the cardboard supplied by Nintendo is simple pressed cardboard, robust but certainly not indestructible. However, most damage from wear and tear or incorrect use can be repaired with simple adhesive tape and, if this is not possible, you can always replace the damaged pieces at low cost, buying them from Nintendo or using the original sheets as a model to create the missing parts directly to your own home. Creating a new way to play The cardboard is the real protagonist of Nintendo Labo, and indeed it could not be otherwise: inside the package there are about thirty pre-printed sheets, as well as a series of accessories, such as rubber bands, indicator stickers and washers, essential for assembling the different peripherals that make up the assorted kit, i.e. RC car, fishing rod, house, motorcycle and piano. However, there are no paper instructions: the construction of the Toy-Con - this is the name chosen by Nintendo for the individual elements of Labo - passes through the software of a cartridge for Switch, which contains in-depth interactive tutorials. The hybrid nature of the Nintendo console proved to be ideal for this first part: with the screen in table mode, you can use touch to move and rotate elements on the screen, zoom in on details and decide how fast you want to follow the instructions ( but if you want you can also use the Joy-Con). Everything is designed to adapt to the little ones, with completion estimates that allow you to estimate in advance the time to devote to each individual Toy-Con and a division into phases that stimulates breaks. In short, the creation component proceeds smoothly: the cardboard sheets are robust and easily recognizable, the pieces detach easily and thanks to the clarity of the on-screen instructions it is really difficult to go wrong. Nothing has been left to chance even with regards to the sound accompaniment, with fun effects and themes that progressively adapt to the speed of advancement. However, the construction is only one of the phases of the Nintendo Labo experience. Once the Toy-Cons are completed, we move on to an even more important section, where some of the many doubts that emerged during the pre-launch period materialize: the game. Play, but with your imagination Each Nintendo Labo Toy-Con has a dedicated game phase: the RC car transforms Switch into a remote control, the fishing rod allows you to hunt for fish in the deep sea, the motorbike to compete on various circuits and so on. In most cases, these are purely arcade experiences: you start the software, play a single game and when you get bored, put everything away. Of course, you can aim to catch the rarest fish of the abyss or compete in the three different difficulties of motorcycle racing, but those hoping for something more profound will be disappointed by the absence of any other stimulus for progression or competition. The house, for example, allows you to give life to a cute little creature, a sort of modern Tamagotchi with which to interact by inserting different elements from the windows. This way you can make him run on a wheel or make him participate in a handful of other nice mini-games useful for unlocking different types of food. However, there is a lack of variety in the scenarios and accumulating candies or broccoli only serves to change the color of its fur, without any influence on the survival or satisfaction of this little virtual friend. A similar argument also applies to the piano, but in this case the presence of the ~study~ makes everything much more interesting. In this mode you can change the resonance of the notes, the shape and amplitude of the sound waves, record your own music, add an accompaniment and jump between octaves to increase the number of notes to your liking.disposition. It is to all intents and purposes an electric piano with numerous possibilities, which will delight all music lovers. Yet even here we notice the absence of something. In fact, a mode of this type is largely inaccessible to those who do not already have a good musical education and for this reason a sort of ~school~ mode, where you can learn to play a series of classic songs - or why not, Nintendo game themes - , would have made the experience much more complete and fulfilling. What emerges is therefore the push towards a type of autonomous entertainment, where the users themselves shape the game. There are few bike tracks and arenas, but new ones can be created using the Joy-Con's gyroscope and infrared camera. The variety of fish is limited by only one marine scenario, but thanks to the aquarium mode you can create a large number of specimens to fish; or you can start family challenges to try and catch the biggest fish within a limited time. The RC car itself, slow and not really suitable for racing or adrenaline-pumping ~robot wars~, can be customized in an infinite number of ways, or it can be used by parents to start treasure hunts during a birthday party. It is no coincidence then that many of these ideas come directly from the ~Discover~ section of Nintendo Labo. It is here in fact that the ~magic~ is explained, or rather how the Switch technology (and above all that of the Joy-Con) can give life to a series of otherwise useless pieces of cardboard. And that's not all, because thanks to the ~Garage~ mode you can create a series of new Toy-Con directly at home. Many have already started testing its potential and we are sure that within a few weeks we will find a lot of original and fun ideas online. Sofia's Trial The long weekend on May 1st, with the first heat and the call of the lake a few kilometers from home, is probably not the ideal time to lock up a nine-year-old girl in the house with cardboard, especially if her two little cousins are in the garden waiting for you to play. Yet over the weekend we got our hands on Nintendo Labo Sofia has always been enthusiastic about building the new toys that have just arrived on the Switch. She spent hours trying (unsuccessfully) to catch a shark, enjoyed racing her motorbike and played her favorites on the piano. He passed it with flying colors and can't wait to play it again.", "date": "2018-05-01", "grade": null}