{"name": "Rise of Nations: Rise of Legends - Recensione", "ref": "https://multiplayer.it/recensioni/rise-of-nations-rise-of-legends-recensione.html", "text": "... what is certain is that Rise of Legends, in terms of the setting, represents in all respects a very welcome surprise What no one expected was just the total halfway point with respect to the setting. Rise of Nations revolved entirely around the historical reconstruction and completely set aside the fantasy aspect. Perhaps it will have been the experience of Alpha Centauri, or perhaps the ambition to finally produce something original, but what is certain is that Rise of Legends, in terms of the setting, represents a very welcome surprise in all respects . Although the choice of title fell on a sort of reprise which visually constitutes a clear connection with the predecessor title, Rise of Legends largely distances itself from its closest relative. Although inspired by the concept of the first chapter of the saga (if saga can be considered) there are countless changes that make ROL a title not only new, but also completely independent. Good morning starts in the morning A masterpiece is such in every aspect. RoL does not deviate from this axiom, taking your breath away right from the start. With wide eyes we see an excellent presentation, with an excellently made movie that briefly shows us the prologue of the events. A huge space ark that arrived near the planet of Aio breaks into several parts and falls to the mainland. Several eras later a thriving civilization seems to have developed around the forest where the main stump landed. We immediately leave the jungle to end up in an infernal scenario permeated with magic and mystery. The quick flash takes us back to a more serene view in which strange flying machines and mechanical creatures are preparing to face an imminent threat. Without ruining the ending of this short but wonderful introductory film, we can say that right from the start it is possible to appreciate what will be the strengths chosen to form the pivot of the setting. An unprecedented world By now it was an established tradition that RTSs, with very rare and not always successful exceptions, laid the foundations on two types of setting: the historical (or para-historical) one and the fantastic or science fiction one. What was still missing was a variation on the theme, something that didn't refer to preconceptions or worn clichs, something that brought, in short, a fateful and beneficial breath of originality. What came out of the forges of Big Huge Games is precisely the result of a research carried out in this sense, with the sole aim of offering the public something different that could overcome the habitual vision of archers with pointy ears at grappling with bullying orcs and trolls spear hatchets. here is therefore the reason for the first applause that we feel like giving to Big Huge Games. The ability and courage of having been able to merge three different styles into a single title, of having been able to grasp as many historical cues in the different narrative strands in order to be able to produce something absolutely alternative, original and unpublished An unprecedented world The world of Rise of Legends has been shaped around three main races never seen before, resulting in a captivating mix of genres. The incredible thing is that there is something for all tastes, without falling into the ridiculous or the obvious. The design of the structures and units seems to be inspired by the major narrative currents, each with its own particular connotation. The Vinci race plays a bit the role of the classic ~humans~. Perched in veritable fortresses of metal and steam, the Vincis base their power on mechanical inventions, automatons and the power of steam. Inspired by the steam punk genre (steam, precisely means ~steam~), this population avails itself of sophisticated old-fashioned-looking machines enhanced by futuristic gadgets and sophisticated electromechanical systems. The parallelism with the drawings of Leonardo, from which the breed takes its name, appears evident. If the Vincis represent the technological soul of Aio, the Alins represent the distinctly fantasy side of the title. The kingdom of the Alin is based on the power of magic, at its service we find magical and mythological creatures, dragons, giant scorpions and cruel evil geniuses. The whole Alin style revolves around the fairy-tale imagery of the Middle Eastern tradition, primarily the tales of the Arabian Nights. Finally, almost in the role of impassive and severe spectators we find the mysterious Cuotl. Following the serious failure of the space ark that was leading them to explore the cosmos, the Cuotls crashed on the planet Aio without the knowledge of the two largest civilizations already present on the planet. StHaving built a new civilization on the sidelines, starting from the same wrecks of the space ark, the Cuotl have been able to exploit the enormous technological baggage that accompanied them to subjugate the indigenous populations. Posing as divinities descended from heaven, they formed a new empire by imposing their power in the heart of the planet's lush rainforests, in the eternal expectation of reuniting with their civilization. Rise of Legends allows us to play steampunk, renaissance, medieval engineering, space technology, magic, science fiction and fantasy in a perfect narrative balance An unprecedented world For the creation of this breed, the developers have drawn heavily from the cauldron of fantasy stories, relying on the theses of those who suggest an alien lowest common denominator between the pre-Columbian populations and the ancient Egyptian people. Films like Stargate have shown us how, according to some scholars, a relationship between developed alien civilizations and the most ancient populations in human history would be possible. By rearranging this theme, the designers of Big Huge Games thought of creating a race that stood outside the box, capable of using technologies so developed as to seem magical, all seasoned with lines and designs referring to the Egyptian and Aztec pyramids and to the cult for the zoomorphic gods. The charm of this breed takes its strength from the mystery that springs from it. So here is the reason for the first applause that we feel like giving to Big Huge Games. The ability and courage of having been able to merge three different styles into a single title, of having been able to grasp as many historical cues in the different narrative strands in order to be able to produce something absolutely alternative, original and unpublished. Rise of Legends allows us to play steampunk, renaissance, medieval engineering, space technology, magic, science fiction and fantasy in a perfect narrative balance. Game mode The game develops on the classic formula by providing the player with the possibility of tackling the title in campaign, skirmish and multiplayer modes. Let's set aside the last two options for just a moment to better focus on the first opportunity to play. The campaign prepares the player for a gradual and total playful involvement by following a fixed but still dynamic path. The obligation concerns the lack of possibility to completely detach oneself from the logical thread of the narration by carrying out the three campaigns in order (the first alongside the Vincis, the second at the helm of the Alins and the last under the command of the Cuotls). The degree of freedom is instead offered by the very structure of the game. The campaigns are presented in ~Conquer the World~ mode (following the tradition started with Rise of Nations) in which the player is placed in front of a strategic map representing the territory at war, the areas occupied by the various factions and the statistics relating to each area involved. From time to time, at the end of each scenario the player is placed again in front of the strategic map on which he will be able to organize his own forces, study those of the enemy, carry out upgrades by spending the points assigned to him during the last scenario and, most importantly , set up the next battle by choosing which mission to face and on which front. While the goal to be achieved remains unique, the ways to reach it are innumerable and full of different game possibilities. In the thick of the action Once the scenario has been chosen, the player is catapulted into the heart of the action, suddenly impacting with a virtual world rebuilt by the developers of Big Huge Games. The maps are very accurate and present a level of detail that undoubtedly highlights both the effort employed by the builders of the development team and the presence of a robust and accurate builder editor. The introductory and interlude movies to the missions exploit the game's engine itself (as has become tradition) and do nothing but underline the good quality of the engine, completely rewritten for the occasion. Having become familiar with the interface, which is really functional (and moreover very similar to that of Rise of Nations, for the ~winning team...~ series) let's go and taste what the real game is made of. at the head of the army are the heroes, up to three per faction, who perform the function of command, supporting the troops with their powerful special skills of offense, defense and support for the morale of the troops In the thick of the action The system lays the foundations on a quest structure, the goal is to carry out the main missions; in the background the secondary quests, which paradoxically constitute the true essence in these casesof the game, adding important narrative extensions, offering higher scores if achieved and giving the possibility of conquering further objects useful for the cause. The organization of the units highlights the desire to sow order among the ranks of the armies; the infantry units are in fact organized in platoons. The production of a so-called ~front line~ unit is supplied en bloc, in platoons made up of a certain number of basic units. Each retains its own individual stats, thus losing hit points independently of the rest of the platoon; what keeps the unit compact is the organization in formation during the movements, preventing the useless dispersion of units which, isolated, could do nothing in a direct confrontation with the enemy. The basic units, more mobile and streamlined, but also more fragile and less effective in large battles, if not in large numbers, are flanked by highly differentiated special units equipped with special powers. At the head of the army are the heroes, up to three per faction, who perform the function of command, supporting the troops with their powerful special skills of offense, defense and support for the morale of the troops. Heroes make up the leadership of the army. As already said without them the great battles will be lost without any shadow of a doubt. The powers in their hands, albeit limited, can make the difference on the large number of units deployed. Each hero has a card which contains, in addition to the main characteristics, statistics and progress through experience. As the character progresses, the experience collected will allow him to unlock increasingly higher levels thanks to which the hero will be able to make use of certain powers, with the aim of gradually becoming more and more powerful and incisive. The administration of experience points, which must be divided among the various heroes, will affect the performance of the relative units in the field. City-states, impregnable fortresses While the units are engaged in battle, life in the command center continues in full swing. The cities are represented by real agglomerations of buildings, every time you want to build a new district you are forced to add it directly to the periphery of the agglomeration. The structures used for the technological and economic development of the population enlarge the perimeter of the city. The production units are instead placed on the sidelines, they can be built in any corner of the map, as long as they are within the area of influence of one of the cities in their possession. Up to three districts of the same type can be added until the fourth stage of city expansion is achieved. The larger the agglomeration, the greater the defenses that will gradually build up on the walls (also contributing to an excellent result from an aesthetic point of view, with city walls crowded with soldiers ready to defend the heart of their civilization) . interaction with other civilizations is not only possible, but constitutes one of the main tactics for achieving victory City-states, impregnable fortresses Interaction with other civilizations is not only possible, but is one of the main tactics for achieving victory. The game mechanics foresees that a city now brought to its knees by enemy attacks prepares for the conquest by exposing a signal of surrender. After a certain amount of time it can be captured and reused by the conquering forces. Similar speech, but essentially different, with regard to the neutral populations that enrich the pandemonium of the RoL maps. Each map features at least one agglomeration that can be annexed by force or diplomacy. Once he joins a faction he will be able to supply specialized units and cede those already present on the battlefield to the control of the player (or of the computer-controlled faction). Technofaith or creedology? Each civilization has at its disposal four technological tracks to follow for the development of its armies and the enhancement of production. The traces underline the predisposition of the three races to specific areas of development. The Vinci, hardened by centuries of internecine warfare between the lords of the various city states, are well aware of the power of the balance between battle, trade and diplomacy, aspects highlighted by the four areas of their technological traces: Politics, Prosperity, Sifting and Mining. The Alin, the children of the desert, can count on the power of magic, and place the greatest expectations in it. Capable of mysteriously regenerating their strength, they draw their resources from magic, rising unexpectedly", "date": "2006-06-23", "grade": null}