{"name": "La recensione di Vandals", "ref": "https://multiplayer.it/recensioni/198176-vandals-la-recensione-di-vandals.html", "text": "Four years have passed since the debut of Hitman GO, the mobile game produced by Square Enix which has practically invented a sub-genre halfway between puzzle and turn-based strategy. Well, in the absence of new releases in the same line for a few months now (the last one was Lara Croft GO), the French team Cosmografik Studio has taken care of bringing an experience based on the same mechanisms to the App Store, Google Play and Steam of gameplay, although characterized by a completely different background. In fact, in Vandals we play the role of a graffiti artist grappling with five different cities (Paris, New York, Sao Paulo, Tokyo and Berlin) and as many eras, skilfully represented on the screen by a well-chosen mix of graphics and sound. Our goal in each level will be to reach the exit, but only after having created an artistic mural in a specific point of the map, trying to be able to do so without ever ending up one square away from a policeman, otherwise the stoppage and game over. The interesting thing is that we will actually be able to draw on the walls using a set of simple tools (or an Apple Pencil for better results), changing the thickness of the stroke and the color from even a small palette, and then eventually sharing our creations with friends . Yes, even if it's very elaborate male genitalia. Give it to the graffiti artist As mentioned, the sources of inspiration for Vandals are very clear: there is the grid with its possible paths, there are movement shifts that are activated for both the protagonist and the guards, but also a whole series of tools that we can use it to distract the policemen and try to draw their attention to a point in the scenario, playing on the position and distance to reach the desired area each time. In the first stages, bottles are introduced, to be thrown into the square towards which we want to attract attention, or the whistle, useful for the same purpose but to be used only if we have a quick escape passage. Then the manhole covers appear, capable of substantially changing things thanks to the possibility of moving in an instant from one end of the location to the other, or the bushes, in which to hide and remain still, waiting for the guards to move without having to we too. There are stages that perhaps take the advantages offered by certain possibilities a little lightly, and which therefore complete quickly, but Vandals also boasts a certain degree of replayability, represented by a set of collectibles and a completely ~invisible~ approach , which is only achieved when we do not enter the sentries' field of vision even once. The system works really well, it is solid and demanding, with the progressive tendency to make the game maps increasingly large, multifaceted and intricate. Let's talk about the rest of very well-tested mechanisms, which are simply declined in a different way by the title of Cosmografik Studio and are equally valid. There is instead nothing derivative in the technical sector, which with its low poly style, the excellent use of colors and cartoonish animations manages to communicate a great sense of atmosphere, changing the approach depending on the city and the era in which we will be acting.", "date": "2018-04-20", "grade": "8.0"}