{"name": "Final Fantasy IV Advance", "ref": "https://multiplayer.it/recensioni/final-fantasy-iv-advance.html", "text": "Redemption's Song In fact, it was 1991 when the Japanese players, on their then brand new Super Famicom, found themselves experiencing the events of the Knight of Darkness Cecil, his beloved Rosa, his friend/rival Cain and many other protagonists who the unraveling of the story he placed them in front of them. There was something noticeably new in that fourth episode, apart from the obvious graphic-sound upgrade made mandatory by the doubled computational power compared to that which Sakaguchi's first three Fantasies had been able to benefit from. First of all, for the first time there was a first, real intention to evolve the genre playfully speaking, with the introduction of the Active Time Battle System which made turn-based combat more dynamic and frenetic than in the past. But above all  because, it is useless to hide it, the main raison d'tre of the genre lies, today as yesterday, in its effectiveness in telling a story  there was a whole new tension in the script, in the dialogues, in the characterization of the characters. Cecil's story is still set in a very classic medieval fantasy with all its conventions in the right place, but we are already starting to see hints of steampunk in the flying airships that from now on will always play a big role in each episode. Cecil's story, however, for the first time is no longer a fairy tale that compares Absolute Good and Absolute Evil, because Cecil himself must move between the two Kingdoms in a real path towards redemption, and make his own choice among a thousand very human doubts and perplexities rendered by the screenwriters with a skill that from then on will be the pride and pride of the JRPG Made in Square and an inevitable touchstone for all the other teams. Clearly, who today is accustomed to the delights of the modern JRPG, to its richness of situations, of facets, of emotions (and the movies, in CG or Real Time that are, in this sense, are an integral part of the appeal of this genre), will find some ingenuity, a couple of limitations, one or two things that could have been explored better, but he won't struggle to recognize, even if sometimes only in a nutshell, all the style that still today accompanies the events of the heroes - and anti-heroes - Square. Whether that goes more in favor of 1991's Squaresoft or detrimental to 2006's Square Enix is another matter altogether. Real time From a purely playful point of view (although the term should be seen in its own meaning when it comes to JRPG) the speech is more or less the same, because also in this case it was precisely with Final Fantasy IV that Square fielded a whole series of concepts, intuitions, canons that have accompanied the saga up to today and that only the twelfth episode, the last, demonstrates in fact that it wants to abandon, not considering FFXI which must be ascribed to a completely different genre. The most important of which is the already mentioned ATB System, which implemented the classic rule of turns recognizing for the first time each character his own speed in entering into action and consequently allowing the monsters to act even while the player was still engaged in choose the action to perform. For the rest then we have basically the same structure we are used to in the most recent FF, extremely linear and characterized by the presence of a whole series of elements (the Chocobos!) that will make the atmosphere familiar. Here too one could take the cue for a speech on how much the presentation and how much the substance has changed in Square games in all these years, but this is not the place. Cecil's story, however, for the first time is no longer a fairy tale However, what we are facing is not the slavish conversion of a Masterpiece of the last decade, as we have instead had the opportunity to see on none other than PlayStation and WonderSwan, platforms on which FFIV had already been converted: the suffix Advance is justified for this new portable edition first of all from a graphic-sound review that now places the title at the same splendid level as Final Fantasy VI for Super NES, and then from various additions to the plot and game system. From those, very relevant, of a couple of fresh dungeons and new dialogues that enrich and deepen part of the events and the personalities of the protagonists, to those, less important but always pleasant, of the bar that indicates the achievement of one's turn on the screen combat, some extra options such as the Illustrated Bestiary and a couple of nice mini-games and easter eggs here and there, in line with the evolution of the genre. Apart from this, the game remains the same, also bringing with it features that are frankly outdated today comand the too frequent random fights and the lack of variety of monsters to face. Other characteristics outdated but not necessarily to be viewed against are a certain difficulty of the whole, and a linearity and simplicity in the growth of the characters (since when we haven't seen a hero born from Level 0 and practically devoid of any possibility offensive and defensive?) and in the development of the story and in the game system in general which, however, depending on the point of view, can also please in an era in which, to seek evolution and originality, these aspects often touch the quirkiness and baroqueism. Luckily FFIV Advance also carries with it Uematsu's legendary, sublime, utterly perfect soundtrack, still unsurpassed today by many. Listen to it in all its facets and then buy the OST, we are facing a milestone. Finally, with regard to the other conversions, first of all the first western edition which in America became Final Fantasy II, here we notice a greater fidelity to the Japanese version; from this point of view, a demerit note to the Italian edition, which although as usual impeccable in correctness and grammar, too often fails to maintain the dramatic tones of the original, due to a contrasting effect between the seriousness of the facts and the tone of the unpleasant protagonists. Judging Final Fantasy IV in 2006 isn't as easy as it was in 1991, when the word to use was simply Masterpiece. We find ourselves in days in which loudly and from many quarters the complete revision of a genre that for years has been unable to renew anything other than the way in which it offers itself to the public - apart from sporadic cases - and if Square Enix and Nintendo they offer us none other than the game that more than any other has laid the same foundations that are criticized today, the perplexity is understandable. However, those who manage to put these reserves aside will find themselves with a memorable experience, perhaps not very exciting from a playful point of view but still splendid in terms of story, narration, characters and soundtrack that will enter the memory and will remain there for a long time. Paradoxically, reviving the usual scheme, however, devoid of those quirks that have appeared over time could also induce the longed-for sensation of freshness in some players... As for conversion and added value, then FFIV Advance is unquestionable, the effort has been there and it shows, and even if you already know the title, it is really worth reliving it in this new edition. Provided you overcome the reservations above Pros It is in the top 3 of the saga Excellent remake Memorable story, superb soundtrack Cons Old and linear game plan Too many random fights! Italian adaptation not up to par It is a common opinion among the public and insiders that the almost twenty-year-old Squaresoft saga has seen its global affirmation, in terms of success and quality, only with the seventh episode. Final Fantasy VII was, in fact, a real revolution for the market, due to the impact it had on the rankings and on the acceptance of the genre among Western players. It can no longer be considered as such if the characteristics of the game itself were considered, i.e. its history, its themes so unusual for the world of video games and the dramatic way of exposing them, as well as the combat system, growth of the characters and gradually enumerating all the fundamentals of the Japanese role-playing game. From this point of view, FFVII was ~only~ the culmination of a long journey that had actually begun six years earlier with, precisely, Final Fantasy IV.", "date": "2006-06-23", "grade": null}