{"name": "La recensione di Extinction", "ref": "https://multiplayer.it/recensioni/197722-extinction-la-recensione-di-extinction.html", "text": "Having entered our radar almost by chance, Extinction does not exactly have the reputation of being one of those highly anticipated and coveted titles by the public, much less a game ready to be elected as GOTY of this 2018. The premises were indeed those of a production that wanted to fly low, so as to dodge the now abused early access process like a bullet, arriving directly on the shelves at a price that, at least on PC, is usually reserved only for triple A. In short, we are talking about sixty euros for a game that at first glance closely resembles Fortnite, only aesthetically, but which pilfers ideas from other IPs here and there, to create an experience that is all in all fun but which frankly wears out too quickly. Let's see together at this point if it can make sense for someone or if it really should be left on the virtual shelves of digital stores. Attack of the giant orcs Extinction is a potpourri of unoriginal ideas. Let's start then from the setting of the story that wants our kingdom besieged by huge ogres, as tall as the watchtowers built for sightings. Humanity has thus decided to take refuge in small self-sufficient villages perched behind theoretically indestructible walls, and this shouldn't sound exactly new to you if you've even heard of The Attack of the Giants. Instead of having huge humanoids hungry for human flesh we will now find the Ravenii, orcs with brute strength and different in appearance but with the same goal in mind: to raze everything that moves and doesn't. To stop them we will have to think about our brave hero Avil, the last sentinel left alive and only to be able to stop the advance of the giants. To further complicate things there is also the enhanced regenerative factor of the Ravenii which not only makes them substantially immune to any common weapon, but also allows them to grow their limbs again after their amputation. However, the story tries to get out of the sow told with some cut scenes the past of the sentinels and reserving some unpredictable twists for the player. Too little to be able to revive the fortunes of a flat and slow narrative in its unraveling, gripped by a gameplay that just doesn't want to mix the cards on the table a bit. Our goal is therefore clear: having arrived in the battle area we will have to run towards the closest Ravenii, repeatedly hit its armor to shatter it and then amputate its legs and arms in order to load a special shot, the only tool to permanently decapitate them and make them disappear from this world. There are a few elements that bring variety to the killing of orcs and they all reside in the different types of armor supplied: very fragile wooden protections, others in metal that require you to break padlocks before being removed and still others that are indestructible or even related to black magic. The idea of mixing the various types is good so as to always have at least one vulnerable part and transform the mega fight into an exercise in style and intellect. Unfortunately, the variety of armor is not so exaggerated and soon, having understood the mechanisms, everything will be reduced to always performing the same actions until the mission is completed. Playstation 4 trophies The trophies must be an incentive to search for secrets, to complete missions in a different way than usual and to discover game mechanics that can test our gamer skills. Unfortunately, Extinction limits itself to doing a very basic homework and to take home the thirty trophies available for most of the time, it will be enough for you to follow the missions and complete the secondary objectives of the campaign. You will have to pour a little sweat into the extra modes but nothing unattainable with a little training, if you manage to beat boredom. But does he just kill himself? To activate the special shot it is essential to fill a dedicated bar, and it can be done by killing smaller orcs that randomly appear in villages or by rescuing hostages using special teleporters. And Extinction really is about it, and one could quickly dismiss it as an unfinished game, but it's actually much closer to a missed opportunity. The graphic style is in fact rather abused but it works just fine and the movements of the protagonists are graceful and very pleasant to see. You can run and jump between buildings and structures, climb roofs and giants like in any Dragon's Dogma and the combat is fast and adrenaline-pumping but far too simplistic. Attacks that can be chained always leverage on a single keyto be crushed, a real shame given that with very little extra productive effort it would have been possible to think of a more complex system of combos and dodges, which would reward technical players. Instead, even with the experience points to be accumulated in the post-mission in the form of gold coins and the talents to be purchased to gain new skills and enhance the existing passive ones, Extinction runs aground without trying to stand out from the crowd, remaining mired in a swamp of anonymity. You can try to enjoy the single player campaign, climb the leaderboards and break all records in a kind of horde mode or try your luck with the random modifiers of the side missions that will give you different objectives to complete, but nothing that will really save the day. package from the nefarious fate that awaits him.", "date": "2018-04-11", "grade": "5.5"}