{"name": "La recensione di ARK Park", "ref": "https://multiplayer.it/recensioni/197735-ark-park-la-recensione-di-ark-park.html", "text": "We have talked about ARK: Survival Evolved several times, to the point that the chances that you know what it is even without ever playing it are quite high. The timeless charm of dinosaurs and survival components has in fact made the title created by Studio Wildcard a powerful catalyst of attention, until its final version released in mid-2017. While a conversion for Nintendo Switch is being prepared for next autumn, the colonization of the various gaming platforms by the ARK brand does not miss the opportunity offered by virtual reality: this is how ARK Park has arrived these days, a stand-alone game created specifically for HTC Vive, Oculus Rift and PlayStation VR. The latter was the device chosen to visit our dear dinosaurs: let's see how it went. Jurassic VR As already mentioned, the creation of a virtual reality title dedicated to dinosaurs is dictated by the high attractiveness that such a game has on the market. For the occasion, Wildcard called into question Snail Games, a Chinese team currently also working on PixARK, another title linked to this franchise. Returning to our ARK Park, as the name suggests, the idea is to create a Jurassic Park in virtual reality, thus putting the player face to face with dinosaurs in the true sense of the word. We are thus greeted by an introductory room, where we get to know the basic elements of the game and start interacting with some lizards presented in the form of a hologram, before being able to access what are the real areas of ARK Park. What in ARK: Survival Evolved was a game experience to be enjoyed as a whole, in ARK Park was divided between two unrelated phases, which can be summarized in exploration and combat. The first takes us around the levels proposed to collect material and get to know creatures, while the second takes us on to face a horde mode of increasing difficulty, with the task of defending a turret from the assaults of the dinosaurs. This subdivision makes the survival sense of ARK: Survival Evolved a little missing, we imagine by deliberate choice on the part of the developers to create two distinct types of game, so as not to agitate too much those who have the viewer on their head with sudden attacks . However, the main problem is related to the repetitiveness of the exploration actions, while the combat phase does not require too much time before figuring out how to defeat the waves of enemies without particular worries. Finally, there is a third game area where you can build objects that can be used to make life easier in the exploration areas. To do this, it is necessary to collect the material that is offered to us in both phases of ARK Park, thus allowing us to also use the horde mode to collect useful elements for the crafting phase. Playstation 4 trophies Hard times for the ~platinum players~: among the ARK Park Trophies, in fact, none of the Platinum type appears, as instead it would be reasonable to expect even from the price of this title. We find a total of just twelve, of which only one Gold, three Silver and eight Bronze. Given the number, collecting them all does not represent who knows what effort, provided you indulge in the types of games offered by ARK Park between exploration and combat for a sufficient number of times. Head movement The ARK Park control system offers two alternatives: the inevitable DualShock 4 controller is joined by the pair of PlayStation Move. In practice, however, these do not add anything particular to the dynamics of the game, perhaps resulting even more uncomfortable: to move with the teleportation it is in fact necessary to point the head at the destination place, instead of with the controller. Inventory management works the same way, where you have to point your head at the object you want to use before selecting it with the appropriate button on the controller. In addition to making the entire gaming experience with PlayStation Move rather unusual compared to what has been seen in other titles, in the long run these choices end up causing excessive fatigue in the neck muscles, which must therefore be taken into account when playing ARK Park. Wanting to find an advantage in this system, we can say that you will hardly end up leaving the visual area of the PlayStation Camera, given that the bulk of the operations can be done with the head, keeping the body and controller often still. In terms of graphics, ARK Park offers a good level of detail when it comes to the creatures shown, allowing the player, as we said, to appreciate their features by being face to face. A little less beautiful is the graphic experience when examined as a whole: the view is in fact filtered by onesort of patina that hides a detail not quite at the same level as that of the dinosaurs. It is most likely the limits of virtual reality and the PlayStation hardware that impose such gimmicks, but we cannot fail to point out that the blur effect is annoying at times.", "date": "2018-04-11", "grade": "5.0"}