{"name": "Impact Winter: la recensione della versione console", "ref": "https://multiplayer.it/recensioni/197524-impact-winter-impact-winter-la-recensione-della-versione-console.html", "text": "Winter has just ended and the warmth of spring is almost upon us, but if you already miss the frost, there are those who have thought of you. We are talking about Mojo Bones, the development team of Impact Winter, a title we already talked about several months ago on the occasion of its launch on PC. A survival in polar temperatures, which we return to take care of by taking the cue offered by the arrival of Impact Winter also on PlayStation 4 and Xbox One, consoles for which it has been available digitally for a few hours. With a pad in our hands and a nice hot tea in front of us, let's go and see if and what differences there are compared to what we were able to appreciate about a year ago. A sudden cold As per practice, in this review we will limit ourselves only to mentioning the main features of Impact Winter, referring you to the article dedicated to the PC version to learn more about the themes it has in common with those consoles. Starting from the setting, which however we remember for the benefit of those who may be too lazy to click on the link above. Impact Winter takes us to an Earth devastated by heavy climate change, resulting from the impact with a meteorite that led the protagonist Jacob to take refuge inside a church in Brandon, Canada. Together with four other secondary characters, Jacob must be able to survive for thirty days, equal to the deadline given by the rescuers to reach the place on the occasion of a radio transmission intercepted by the Ako-Light drone. The latter is a multifunctional assistant, who accompanies the protagonist in his every movement outside the church, helping him to illuminate the area, dig in the ice and transport objects. He's not the only helper, since each of the inhabitants of the church is able to make its contribution: Wendy cooks, Maggie builds improvements, Blane provides advice on survival and Christophe is the inevitable tech expert. The player's task is not only to make Jacob survive, but also to take care of the rest of the company by ensuring the right supply of food, water and comfort. However, the only death to interrupt the game is that of the protagonist, the only playable character: if someone in the group fails, it is in fact possible to continue, however renouncing the elements and improvements related to the specialization of the character who has failed. Playstation 4 trophies Impact Winter arrives on PlayStation 4 with a total of twenty-five Trophies. In addition to the usual Platinum type, obtainable by unlocking all the others, we find six Gold, twelve Silver and six Bronze. Most of the objectives can be achieved by performing normal actions within the adventure, but to unlock them all you need to step into Jacob's shoes more than once. In particular, those related to the ~history~ of each of the four secondary characters require greater commitment, which can be completed by completing all the quests that are entrusted to us by them. Better, but not perfect Beyond a few missteps in the design of Impact Winter, reported in the same way on consoles, the PC version of this game did not go beyond a certain evaluation due to a few too many technical problems. A lot of time has passed since then, and fortunately on the console the effort of Mojo Bones arrives in an optimized guise compared to the one seen months ago, even if not completely cleaned up as one could expect. The use of the controller, obligatory in the case of consoles, removes what was the embarrassment of using the mouse and keyboard, but above all it can enjoy a much better level of response to commands. However, there remains a certain woodiness in the movements, mostly due to a somewhat sparse animation set. Unlike the PC version, we have not encountered any particular bugs, but above all now the uploads are much more bearable than the decidedly too long ones seen previously. In short, a good part of the defects detectable at the PC launch was fixed by the guys at Mojo Bones, but unfortunately we cannot say that the console version is free from problems. At least on PlayStation 4, in fact, there is a considerable number of episodes in which the number of frames per second drops significantly, especially in the moments following the transition from one setting to another or when walking outside in the snow. Owning a PlayStation 4 Pro doesn't help particularly, since this is precisely the model on which we tested the game. The graphic detail changes quite little compared to how we remember the game on PC, where, moreover, an ultra-powerful configuration was certainly not necessary to run Impact Winter.", "date": "2018-04-06", "grade": "7.6"}