{"name": "La recensione di OVIVO", "ref": "https://multiplayer.it/recensioni/197463-ovivo-la-recensione-di-ovivo.html", "text": "When technological evolution, but above all the maturation of taste and the technical-expressive experience of the developers, began to allow it, video games began to appear in the artistic sphere as possible means of communication and expression in which to channel ideas. Interaction as a founding element of the experience, in addition to their ontological essence of games, obviously limit certain specifically artistic evolutions but in the exclusively audio-visual field there are now many experiences that can be said to be at least close to a certain way of expressing themselves through the visual art that can recall the artistic creative process. Let's take OVIVO for example, which as a platform is based on a nice but not entirely original idea, however executed here to perfection: to control a sort of character that rolls according to the normal laws of physics but can switch at the press of a button from one side of the drawing to the other, distinguished by the two opposite colors black and white, responding to gravity in an opposite way from one side to the other. The concept is simple and needs no particular explanation - which in fact are completely absent in the hermetically silent setting of the game - but the real fulcrum of the action, on which the entire structure is built, is the composition of the levels. OVIVO stages real abstract paintings in black and white, whose ~zoomed~ details represent the various levels in which the rounded protagonist finds himself traveling. This becomes clear when at the end of these the view widens dramatically to reveal the overall design, which gives a sense (albeit always very abstract) to the entire journey made up to that moment. These camera shifts represent particularly impressive moments, capable of characterizing the whole experience of the game. White and black We are by now quite accustomed to the adoption of a minimalist and somewhat artistic graphic style in the videogame field, especially on the mobile market where solutions of this type are also particularly well suited to the type of fast and immediate use, as well as to the production of smaller dimensions that characterizes the titles on smartphones and tablets, which are often based on brilliant simple ideas and impactful artisanal technical achievements. OVIVO in this sense does not represent anything particularly new, but the idea of the overall picture to be crossed by constantly passing within the two basic colors that compose it remains interesting for all its (short) duration. The game offers three different types of controls, with the possibility of using the on-screen overlay keys or gyroscope controls, which are probably preferable on mobile devices. All we have to do is make the protagonist go in one of the two main directions of the two-dimensional plane and press a key (or touch the screen) to transfer him at any time from one to the other complementary section of the black and white drawing, passing through the sinuous lines of demarcation and immediately entering a dimension characterized by opposing physical forces, which materialize in a different behavior of the spherical character as regards jumps, rebounds and inertia. The sense of all this is simply to reach the conclusion of the levels, possibly by collecting the various elements that are scattered around as sorts of collectibles. It's a bit of the classic game case much easier to try than to explain, because with your hands on the screen it becomes extremely intuitive and simple to exploit the dimensional passages to perform even rather complex maneuvers and reach various difficult-to-access points of the levels.", "date": "2018-04-05", "grade": "7.3"}