{"name": "La recensione di Empires Apart", "ref": "https://multiplayer.it/recensioni/197353-empires-apart-la-recensione-di-empires-apart.html", "text": "The world of video games is made up of continuous returns. Especially in recent years, a certain dissatisfaction with the present has given great importance to the celebration of the past, multiplying attempts to restart from models that were considered forgotten or, at least, archived by the history of the medium. Real-time strategy is a genre that until not too many years ago was among the most loved by the general public: in particular, the years between the two millennia saw a truly impressive amount of releases. Unfortunately, they were often mere clones of the Dune 2 model, which limited themselves to improving the graphics (not even always) and trying some unpublished game mechanics, without however fully believing in it. One of the few titles that tried and managed to break the mold was certainly Age of Empires of the never too late Ensemble Studios, which added elements taken from the series to the classic gameplay model made of resource collection and accumulation of increasingly powerful troops Civilization, especially on the technological development front of the factions. The result was in many ways striking, both in terms of quality and for sales, so much so that a real secondary trend of the RTS was born. Filone to which Empires Apart belongs by right by the Italians DESTINYbit, which tries to have its say starting from that experience. Skirmishes between civilizations Let's immediately clarify an important point: although there are several single-player modes, Empires Apart is a title designed above all to be experienced online. Not that playing a few games alone can't be fruitful and can't give satisfaction: in particular the classic skirmishes are very useful for those who want to experiment with the various factions before challenging other human beings. However, the fact remains that the absence of a real campaign and the game structure itself call loudly towards the competition. However, it is right to spend a few words on the different single player modes, which are identical in essential parts to the multiplayer ones. The main mode is ~Skirmish~, in which the player must choose one of six available civilizations (Arabs, Aztecs, Byzantines, Chinese, French and Mongols) and face up to seven other opponents on maps of different sizes, set in seven different biomes. When setting up the game, you can also select one of four victory objectives: Assassination, in which you win by killing opposing heroes; Conquest, in which to have the upper hand you have to destroy the enemy town halls; Diplomacy, a variant of Conquest where you win by teaming up and Assassination of diplomacy, a variant of Assassination still focused on alliances. The six civilizations are very different from each other, it being understood that they all follow their own specific development line which gives them access to improved units, new military technologies and different buildings. In general they belong to three different philosophies: defensive (Byzantine and French), which favors entrenchment with accumulation of troops; technological (Chinese and Arab), where development gives access to future troops; aggressive (Aztecs and Mongols), in which the fate of civilization is linked to war, i.e. the more you fight, the more you grow. As should be clear, the three philosophies correspond to three very different styles of play, which are more or less effective depending on the situations and opponents. The other two modes for solo players are Survival - in which you choose a civilization you have to be able to survive as long as possible against the opposing hordes - and Challenges, in which you have to overcome six small challenges for each civilization. For example, you must be able to survive despite being outnumbered, or you must resist a cavalry charge using only priests, or you must kill settlers defended by the cavalry. In general, the challenges are very short and work like real puzzles, in which you have to fit the right moves to be able to make it. Fundamental mechanics and online modes The core gameplay mechanics of Empires Apart are very easy to explain and master. If you have already played other similar titles you can even skip the tutorial, they are so direct. You start out with a town hall, our command center, and a handful of settlers. The latter can be used in the collection of resources (food, wood, rocks, gold and so on) or in the construction of buildings, which are used to generate troops, to acquire new technologies, to increase the maximum number of hireable units and more Still. There are also purely defensive buildingsive such as fences, walls and turrets, which guarantee greater resistance to opponents' attacks. In addition to constructing buildings, resources must be accumulated to unlock various technological advances. In the presence of stretches of water, it is also possible to build ports and naval units. In particular, two biomes, Mare Nostrum and Islands, are designed to make the most of marine battles. Overall the AI offers a good challenge, especially on the higher difficulty levels. Usually the tactic of building a large army (as varied as possible) pays off, even if it is better to manage it by dividing it into groups of specific units, so as to be able to manage them faster when the situation gets confused. As a guide, it is sufficient to consider some basic tactics, centered on a system of ~rock, paper and scissors~ balances, to get the better of virtual opponents, while with human ones a lot depends on who is in front of us (it being understood that the balance of power among the troops are identical). Aside from some pathfinding issues, there's not much to report in terms of AI flaws. It should be noted that some of the bugs present in the old versions have been fixed with the various updates (at the time of writing this review version 1.0.4 was available), so it would be unfair to mention them as defects. Speaking of online modes, Empires Apart basically offers skirmishes, which can be configured exactly like the single player ones. The only variant is the possibility of taking part in one-on-one ranked matches, which earn points for the global ranking. Currently the servers are not crowded. Although this is not a defect attributable to the game, we are forced to warn you, because playing online means standing in long queues and then facing very strong people. If you don't want to run away immediately in frustration, we advise you to train alone for a few hours, trying to become familiar with the game system and beat the CPU on the highest difficulty level; or to dedicate yourself to learning online with a few friends. From a technical point of view there is not much to say. The graphics of Empires Apart is characterized by a well-crafted low-poly style, which guarantees flawless fluidity even on not very recent systems. The isometric shot, zoomable and rotatable as needed, is functional to the gameplay and is in the standards of the genre. In conclusion, despite the overall simplicity, it is undeniable that Empires Apart is pleasant to look at, above all by virtue of the well-chosen chromatic choices and the variety of buildings, troops and scenarios.", "date": "2018-04-03", "grade": "7.8"}