{"name": "La recensione di Detective Pikachu", "ref": "https://multiplayer.it/recensioni/197207-detective-pikachu-la-recensione-di-detective-pikachu.html", "text": "Developed by Creatures, rather than the usual GameFreak folks, Detective Pikachu is probably the bravest Pokmon-themed spin-off we've ever played. And we've seen quite a few over the years: we've gone from pinball machines to match-3, from fighting games to crossovers with Nobunaga's Ambition. One thing has always remained stoically unchanging: Pikachu. The adorable electric mouse, yellow mascot of the series since the early 90s, has become as famous as Mickey Mouse and over the years has even been the only pokmon to get its own voice in video games in which the little monsters usually express themselves in verses . Lo and behold, Detective Pikachu also gets rid of that iconic ~Pi-ka-chu!~ to give the little rodent the voice of a middle-aged man... and as absurd as it sounds - and even a tad creepy - it makes perfect sense: just follow the story of this... whodunit closely. And it's not a joke! A pokmon job Fortunately, the only person who can ~hear~ the hoarse voice of this wacky Pikachu who has lost his memory is the young Tim Goodman, who has arrived in Rhyme City to investigate the disappearance of his father, a famous private investigator. The two meet by chance, but obviously the ability to understand each other is not just a coincidence, even if various investigations will have to be solved to even this mystery come to the surface: the story of Detective Pikachu is made up of nine chapters and is completed in about ten hours. It's a passable yellow, albeit sweetened to please all ages, which is inspired by the pokmon universe as we know it, eyeing it from a slightly more... realistic angle, so to speak. Creatures abandons the cartoonish cel shading to which GameFreak has accustomed us to employ a style that is more reminiscent of the feature-length computer graphics films of Disney and Pixar. In fact, the story develops through numerous cinematics dubbed in English and subtitled in Italian which, almost like a small film, tell us the salient moments. The absolute protagonist is not even Tim, but the investigator Pikachu who constantly steals the show. We have seen many variations of Pikachu over the years, but the Japanese developer has outlined this bizarre version with obsessive attention to expressions and gestures: it really seems to come out of a noir tale set in the 50s, taking the player off guard with hilarious gags. We must admit that the adult tone of his voice had literally blown us away, at first, but the choice generates a truly amusing contrast. Even Tim and the other supporting actors manage to carve out some space for themselves, but obviously it's the pokmon, filtered through Pikachu's comments, the only one who can understand them, who give the story a particular touch even when it clumsily tries to assume outlines more serious. However, Detective Pikachu remains a title designed for the little ones both in terms of atmosphere and gameplay. And this ~light~ approach unfortunately detracts from the quality of the Creatures title. The investigations involving Pikachu and Tim also manage to amaze thanks to plots that are not exactly obvious, but the structure of the game is basically structured in the same way from start to finish: the player, controlling Tim in the third person, must question passers-by and examine every clue to accumulate a series of notes in his notebook. From time to time an extremely simple ~quick time event~ is triggered which gives certain sequences a vaguely dynamic flavor, but in most cases, once all the evidence has been collected, we move on to the final phase of the investigation in which we have to solve some simple logic quizzes. Failing is practically impossible, because Pikachu always allows us to try again and often literally feeds us the solutions. In most cases, the structure appeared to us so forced as to be frustrating, because the solution to a case happens almost immediately, but first we must necessarily find every clue - even the most useless and superfluous - to unlock the final phase. At that point, Detective Pikachu loses much of its charm, and becomes just a pleasant reading exercise in a Pokmon key.", "date": "2018-03-30", "grade": "7.0"}