{"name": "La recensione di Outlast 2 su Nintendo Switch", "ref": "https://multiplayer.it/recensioni/197031-outlast-2-la-recensione-di-outlast-2-su-nintendo-switch.html", "text": "Bauman once said that evil and fear are conjoined twins. A very particular phrase, which we can easily steal from the philosopher's books to apply it to Outlast. The title of Red Barrels is just that: the representation of evil, in every form in which it manages to manifest itself. The first chapter has been a huge success, so much so that it is almost celebrated as one of the best survival-horrors of recent years, and recently arrived on the Nintendo Switch in the Outlast: Bundle of Terror. Now it's the turn of the sequel: Outlast 2 in turn peeps out on the hybrid of the Kyoto house, almost a year after its publication on other consoles and on PC. Also in this round the porting work of the Red Barrels has left us satisfied: the team has again shown a certain care for their products. Ready to throw yourself into a nightmare based on deviant religious cults, sexual maniacs and blood? Someone walks among the rows Lynn and Blake Langermann are traveling by helicopter over a semi-desert and uninhabited area of Arizona. Lynn is a journalist, investigating the murder of a pregnant girl who died under mysterious circumstances. We take on the role of Blake, her husband (and cameraman). And for the first three minutes of the game we delude ourselves once again, as in the first Outlast, that all in all things can go well. But nothing goes well, because for some strange reason the helicopter crashes. We find ourselves separated from Lynn, wounded and lost in an area that doesn't start to seem so uninhabited anymore. Here and there, between rows of wheat and dirt roads, someone has erected wooden crosses. And in the distance is a very creepy village waiting for us in the moonlight. Outlast 2 a year ago raised the bar a lot compared to the first chapter, aiming for a wider, more distressing game environment and (if possible) even more intense themes. Blake finds himself entangled between the madness of the inhabitants and their very particular religious cult, on which we don't want to anticipate you more than necessary. Unlike the first Outlast, however, the narrative is much more linear and guided. Almost always you immediately and clearly understand where to go or what to do, and for all the other phases a few attempts at trial and error or a minimum of conscious exploration of the surrounding environment are enough. Once again the production has focused on a psychological survival horror, but this time much easier to understand, with a large number of documents and movies (the collectibles) to collect and analyze along the way, until everything concerning the distressing matter will be clear to us. The real experience of Outlast, what drives the purchase, is the journey inside the nightmare. The way it is told is extremely effective and the metaphor of the developers, who described the player as ~a mouse in a maze~, is valid. Provided you understand that the labyrinth is extremely linear, and that the level of challenge is not so much to be able to escape, but to enjoy the details scattered in every corner. The game modes have also remained unchanged from the first Outlast, receiving only a few minor refinements. Blake is not a warrior, he can only minimally rely on the resistance of his skin. The camera returns to dominate, with which to orient ourselves in the dark through night vision. Around we will find bandages with which to treat ourselves if we have received a few blows, and batteries to recharge our trusty instrument. For the rest you explore, you hide, you feel anguish from start to finish, and you suffer (it's also fair) some infamous jump scare. A scary port The title of this paragraph is metaphorical, we were unable to avoid the joke. But be warned: even if Outlast 2 certainly can't compare to the PlayStation 4 or PC version, it doesn't mean that things are going badly on Nintendo Switch. Indeed, already trying the first Outlast we have kept our expectations high also for the second porting, and they have not been disappointed. Outlast 2 on Nintendo Switch in handheld mode is incredibly solid, fluid and beautiful to look at, regardless of the technical details of the matter (which by the way have not yet been confirmed by Red Barrels). In TV mode, with the same frame rate, the visual quality undergoes a further little push, however leaving the glance always satisfied, and avoiding any type of smudging. We have had confirmation: Red Barrels can do porting, and it is probably also for this reason that they really don't want to lower the price of the offer. In fact, Outlast 2 costs a good 30 euros on Nintendo Switch, while elsewhere it has already been amore affordable numbers. That's not all, stay seated. With Outlast 2 comes what could be a welcome addition for all players who get tired of always dying in the same spot, and who may not have understood so well how to hide in a barrel or inside a wardrobe to escape enemies. It is the Adventure Mode, that is, the ~even easier than easy~ mode, suitable for simply enjoying the story of the game. The enemies are less aggressive, their blows lighter, the batteries much more generous, and from time to time Red Barrels takes us by the hand and suggests we do this or that to overcome a certain point in the game. Veterans who want a respectable challenge needn't fear: the higher difficulties, including ~Madness~ are always there. Everything else remained completely identical to what we saw on rival consoles and PC last year. No bonus content of any kind has been introduced, not even a collection of concept art or a gallery for audio tracks. This is a precise choice of the developers: while Outlast: Bundle of Terror was thought of as a collection of the first chapter with related DLC, Outlast 2 is re-presented for what it is, without additions of any kind. Additions that incidentally have not been developed elsewhere either, given that in the end nothing more was done with the DLC of Outlast 2. A criticism, on the other hand, can be leveled at the support of the HD Rumble, which has been implemented as a minimum as in the previous chapter. This means that the Joy Cons occasionally vibrate, according to completely arbitrary choices by the developers, but never according to a really carefully studied background plan. They could be used, for example, to intuit the origin of enemies, or to warn the state of the camera: Outlast 2 really offers a lot of ideas for introducing a complex tactile vibration system. Too bad, because the overall immersion of the title would certainly have enjoyed it. Another small flaw is the one related to the subtitles. They are also present in Italian, and this is good for those few dialogues present. Their size, however, is already insignificant in TV mode: let alone when we carry Nintendo Switch with us, where every single character takes on the size of an ant.", "date": "2018-03-27", "grade": "8.5"}