{"name": "La recensione di Far Cry 5", "ref": "https://multiplayer.it/recensioni/196996-far-cry-5-la-recensione-di-far-cry-5.html", "text": "~Did I ever tell you what the definition of insanity is, yeah?~ When it was relaunched with the third chapter, at the end of 2012, the Far Cry franchise became the protagonist of a substantial evolution that in many ways represents a case study. In fact, if the protagonist of the adventure was almost never seen and hardly communicated, on whose shoulders should we rest the weight of the narrative? Ubisoft developers had an extraordinary intuition at the time: that of the charismatic, crazy villain you love to hate. Declining it in different contexts was not easy, and it is probably for this reason that in many of its characteristics Far Cry 4 was all in all a derivative experience, so much so as to push the French house to ~take a break~ with the prehistoric episode of Far Cry Primal before coming up with a new and convincing strategy. Well, if in terms of structure and gameplay Far Cry 5 does not try in any way to revolutionize the series, in terms of setting and nemesis the situation is quite different. In fact, in this chapter we are no longer on a remote island or in a remote Asian region, but in the American hinterland of Montana, specifically within the fictitious region of Hope County; and there isn't a single ~charismatic villain~ to fight, there are four. We are catapulted into a splendid place, where certain values have always been deeply rooted, but which years earlier underestimated the dangers of Joseph Seed and his cult, Eden's Gate. Nobody believed exactly what the self-proclaimed ~Father~ and his disciples were doing to the inhabitants of the area, and so within a few years the church of Seed was filled with fanatical extremists armed to the teeth, ready to do anything to bring about the ~divine plan~ preached by their mentor. Joseph's lieutenants are his brothers Jacob, John and Faith: each of them controls a portion of the map, but above all each one tells a different story, terrible and ruthless in its implications. The multiplication of thick villains? Not a bad first miracle for such a young cult. My land We were talking about the missed revolutions: if we remove from Far Cry 5 the valuable (and bitter!) narration that is carried forward during the cutscenes, and which in certain moments goes to the limit of tolerability between ~marks~ and torture, what remains is the rich, extensive but well-tested sandbox that we have come to know over the years. The difference in this case lies in the ~zone~ structure, the same seen exactly one year ago in Ghost Recon Wildlands: the three areas of Hope County are controlled by John, Jacob and Faith, but to get rid of these dangerous members of the Seed family and finally face Joseph we will have to complete a certain amount of main and secondary missions, increasing the value of the ~resistance~. During the exploratory sections we will be able to free citizens held hostage who will decide to fight alongside us, destroy the outposts and nerve centers of Eden's Gate, launching in particular attacks on the production centers of their hallucinogenic drug, the ~gaudio~, used to bend the minds of the soldiers or to create real aberrations that attack with unheard-of ardor and do not bend even in the face of bullets. The plot used for progression is the same for all commanders: there are three levels of ~resistance~, and each stage will determine our capture, with a meeting with the villain on duty and a daring escape. Only when we have scored enough points will the final confrontation be unlocked, in the form of a very engaging sequence which will be followed by a boss fight consisting of several phases, some of which are truly frenetic and demanding. In short, focusing on numbers seems to have been Ubisoft's idea for this new chapter: larger maps, a greater amount of missions and four thick villains to fight. But how does this situation come about, and how is warfare on the streets of a normal American county justified? Here things actually shaky a bit and you have to make a certain effort in terms of suspension of disbelief: when our character, recently on duty, goes to the stronghold of Joseph Seed together with some colleagues and a federal agent to arrest the holy man, things don't go the right way, the service helicopter crashes under the weight of the fanatics themselves, who rushed en masse to save their ~father~, and we find ourselves forced to flee to survive. However, the operation is interpreted by the adepts as the realization of a prophecy, and it is for this reason that the entire region is in fact sealed, municipalitiescation included, for an unspecified time. Setting the story a few decades ago would perhaps have justified certain strains and made the plot a little more convincing, even if from this point of view, realism is the least of Far Cry 5's problems. In fact, the game fails to maintain a certain type of coherence in the normal in-game sequences, and in the end there is the feeling of being faced with two distant realities: on the one hand, the tense, violent, ruthless atmospheres of the cutscenes , on the other the need to deal with a frenetic and rowdy sandbox structure, which does not stand still for a second, which does not even give you the possibility to catch your breath since every ten seconds pickup trucks from Eden's Gate or groups of Edenites pass by on the street who spot us and begin to attack, regardless of the fact that we are engaged in a conversation with an NPC to discover further background and unlock new missions. In short, there is a fairly obvious direction problem, which in some cases leads to ridicule and unjustly penalizes the excellent work done in terms of narration, also thanks to the inevitable glitches and more or less annoying bugs (the character who does not start the mission, markers disappearing, companions not following you). Alone or in company The chronic lack of refinement, which prevents Far Cry 5 from making the leap in quality, is justified by the approximately one hundred and forty missions available in the campaign. It is possible to find a great variety in the tasks, both the main ones and the secondary ones: we will not only have to free outposts, but also recover very particular vehicles (to which the owners of the place have given a name...), locate maps and devices, rescue hostages trying to use a silent approach (otherwise the Edenites will kill them), steal tankers, hunt animals and so on. Among the secondary quests there are some that lead to extreme bad taste (see the mission in which you have to ~imaginatively~ kill some bulls to obtain their testicles, to be cooked in various ways for a thematic party in the Holland Valley), actually going to embrace a certain ~country~ culture. The same aspect is found in some characters with whom we will have to deal, in particular the ~mercenaries~ that we will be able to unlock during the campaign and use as support during the missions, assigning their intervention to the left and right keys of the d-pad. There are nine of them in all, three per zone, and they boast very different abilities: the deadly Jess Black, perfect for stealth raids thanks to her prowess with the bow; Grace Armstrong, an infallible sniper; Nick Rye, who will be watching our backs from above, aboard his plane. And then three different animals: the dog Boomer, the bear Cheeseburger and the puma Puccettina; fire expert Sharky Boshaw; helicopter pilot Adelaide Drubman; and finally Hurk Drubman Junior, a ~big boy from Montana~ armed with a bazooka, all beer and flatulence, whose dialogues (especially in combination with Jess) will make you more than smile. The use of mercenaries during missions introduces an interesting strategic substrate into the gameplay and even allows them to be revived when needed, although their accuracy is not impeccable and they often get into trouble rather than solve it. Speaking of collaborations, Far Cry 5 also allows you to play the story mode in online cooperative multiplayer for two players, saving progress only for the user hosting the game: the other will only earn experience points and could get some spoiler, so be careful how you organize it. Speaking of experience, successfully completing the missions allows you to get points that are useful for unlocking the ~traits~, the protagonist's skills that are divided into five categories. Among the many abilities that we will be able to obtain are the grappling hook, the parachute and the wingsuit, essential for tackling certain movements; increased health and improved survival skills; the ability to repair vehicles or open safes; weapon mastery, additional holster, or extra ammo pouch; or even the release of the second mercenary, since initially we will only be able to use one. Jim Jones and the People's Temple The authors of Far Cry 5 were probably inspired by various literary and film works to characterize the various characters in the game, but in the madness of Eden's Gate it is impossible not to notice references to the People's Temple, the cult created by the American preacher Jim Jones in the 70's. After making converts, Jones decided to found a community in Guyana and move therealong with a thousand followers, creating what he saw as the ideal city: Jonestown. However, rumors reached the United States government of abuses and harsh conditions for members of the congregation, who were cruelly punished for any insubordination; and so it was decided to send a senator, Leo Ryan, to monitor the situation together with some assistants. Ryan was killed before leaving Guyana, however, when it was discovered that someone had told him the truth about Jonestown. The event gave way to the realization of a plan that provided for mass suicide for the followers of the People's Temple: over nine hundred of them killed themselves with cyanide, Jones himself shot himself in the head. Arms and baggage In our battle against the many followers of Eden's Gate we will be able to count on a fairly rich but not immense arsenal, consisting of barrel weapons, pistols, light machine guns, shotguns, assault and sniper rifles, bows, heavy machine guns , rocket launchers and grenades of various kinds, to be selected using the traditional wheel that opens by pressing a back button, and to be restored at the shops located in the liberated areas of the locations, those where you can move instantly when needed. We have noticed a certain attention to balance, in the sense that you will often find yourself without ammunition and you will be forced to change equipment on the fly, stealing weapons and objects left on the ground by killed enemies, so as to experiment a little with all the tools available from Far Cry 5. An important element of the new Ubisoft experience lies in the great freedom of action that we are granted, which allows us not only to select the missions in the order we prefer, but also to face each situation in a different way. It is possible to try the stealth approach with stealth melee eliminations, hit enemies from a distance with a special weapon, send our companions ahead or proceed with guns blazing, experiencing in this case an excellent run & gun, solid and satisfying even in impacts, with the opponents who are probably thrown away by possible buckshot, or who collapse at the end of their life calling their companions to be treated: a situation that we will be able to cruelly exploit to our advantage, hitting all the Edenites who will arrive in help. The artificial intelligence therefore moves on two fronts: on the one hand there are brilliant solutions, such as stalking even distant ones, among the trees, but in general the patterns are fairly simple and it often happens to reach opponents from the side or behind without that they notice. To move around the huge game map it is absolutely necessary to be able to access a vehicle, and this is perhaps why the streets of Hope County are so obsessively guarded: a couple of shots at the edenita on duty and you can get on board a quad bike or a pickup, crossing the paved and dirt roads at full speed to reach their destination, or deciding to take some spectacular shortcuts. In this episode, however, we will be able to aspire to many different solutions in addition to road transport: helicopters, planes (armed with machine guns and cluster bombs, as is evidently used in those parts) and motor boats can be taken in certain areas of the scenario , while the lack of dirt bikes and monster trucks is a bit surprising. The driving of the vehicles is in any case of the arcade type, with different layouts available for the commands, and there is no shortage of specific skill challenges to be accessed between one mission and another. Far Cry Arcade In the liberated areas of Hope County, through specific cabinets, or from the main menu, it is possible to access Far Cry Arcade. It is a ~game within a game~, with a set of short missions to be tackled in single player or cooperatively, as well as a competitive multiplayer mode for up to twelve participants. We were able to try this experience in all its parts, albeit briefly, and it is undoubtedly a fun graft, capable of extending the already substantial Far Cry 5 campaign by a few hours. Random classes are selected from time to time, with different, and we are projected into over thirty maps between PvE and PvP, facing ever-changing situations: in one case we turn around at night in a forest, without weapons, in search of dangerous psychopaths; in another you fight with guns blazing against a sort of crazy all-female army. As for the competitive maps, they are mostly team deathmatches in very particular scenarios, some of which nicely pay homage", "date": "2018-03-26", "grade": "8.4"}