{"name": "PUBG Mobile: la recensione", "ref": "https://multiplayer.it/recensioni/196892-pubg-mobile-la-recensione-di-pubg-mobile.html", "text": "Capable of selling over twenty-six million copies between PC and Xbox One, PlayerUnknown's Battlegrounds undoubtedly stands as one of the most interesting phenomena of recent years. In fact, we are talking about a production that started almost from nothing, built around a simple but terribly fascinating idea: a huge island and a hundred players projected onto it, with the sole objective of fighting each other to decree a single winner in the end. From a purely technical point of view, the project has moved for a very long time between ups and downs, suffering from various problems but in any case managing to win the favor of the general public, absolutely involved by those mechanics that are so trivial yet so effective. PUBG matches are a level, to quote Antonio De Curtis: you start with nothing on (literally: during the first few games you won't even be able to afford clothes, which can be unlocked by opening the traditional prize boxes thanks to the currency won on the field), parachuting from a cargo, and you land in an area of the map more or less rich in structures and buildings. Inside them it is possible to find weapons, clothes, armor, medical kits, ammunition and accessories, the latter essential for modifying the equipment at one's disposal and increasing the variety of an arsenal that absolutely does not boast mind-boggling numbers. In short, you need a little luck to find the right objects and a little cunning to appropriate them quickly, after which you can proceed to the clash, identifying the other ninety-nine participants and trying to eliminate them in frantic frontal clashes or stealthily, taking them from behind. Over time, the playable area of the map will be restricted, in order to force even the most reluctant users (as well as the inevitable ~camperoni~) to have to converge in one point of the scenario, making encounters much more frequent and thus accelerating the closing of the match. Staying out of the ~valid~ area, in fact, will result in a progressive but inexorable loss of vital energy: in this case, it is better to get moving, perhaps finding some vehicle with which to move more quickly! The reckoning As mentioned, the great strength of PlayerUnknown's Battlegrounds lies in its ability to involve in a few minutes, allowing any player to make a difference once projected onto the battlefield; all from the point of view of three different modalities: deathmatch, paired with another user or within a team made up of four people, possibly activating the voice chat via the microphone of the telephone or tablet. Well, PUBG Mobile does not deviate from this formula in any way, keeping the structure developed by Bluehole intact and optimizing it for iOS and Android devices. After launching the game on iPhone X, the system automatically adjusts the graphics to the ~HD~ preset and the frame rate to ~high~, both of the maximum values available (the Ultra HD preset has not yet been implemented); after which, once inside the map, these elements guarantee an unexpectedly fluid and convincing gameplay, even in the most agitated situations. The visual impact appears modest as soon as you launch from the cargo, given that from a distance the assets are rendered in low resolution and with significant pop-up effects. Once the parachute is opened, however, the situation changes and the general quality increases significantly, offering us certainly less complex polygonal structures than seen on PC and Xbox One (and likewise much more down-to-earth effects, even and above all with regard to the lighting system, fixed on a single moment of the day), but at the same time clear textures and an environment that does not require further loading, despite its vastness. Whether you move on foot or on board vehicles, it makes no difference: the frame rate holds up and with it the touch controls, which can count on a really well organized layout, with some appreciable subtleties. First of all, the virtual analog stick, which remains fixed to the left of the screen but which in reality obeys our inputs wherever we place our finger, effectively acting as a repositionable, reactive and precise solution, which never misfires and also allows comfortably lock the ride in two different ways. This double command gimmick also concerns fire, with icons both on the right and on the left to be able to seize the moment, while a series of further icons allow you to jump, crouch, lie down on the ground, use the iron sight, open the map , change the equipped weapon, reload it, use any grenades and acceto the inventory, perhaps to use a med-kit or an energy drink. Contextually with the presence of objects to collect, a small window opens with the possibility of automatically taking certain things and letting us decide for the rest: a solution certainly inspired by the best other mobile titles have so far been able to offer. Then when you get to the point, that is to say the firefight, PUBG Mobile works: the aim is precise, the effectiveness changes depending on the equipped weapon and the amount of vital energy available allows you to allow yourself a mistake, without weighing too much the latency on our performance: it has never happened to us to die ~late~, perhaps after taking cover, as usually happens in the multiplayer of some famous shooters on PC and consoles. Of course, we are not talking about state-of-the-art gunplay, mind you: the feeling is scarce, the sensations of impact almost nil and the stakeouts in the end are a bit fantasy, all seasoned by the lack of an option that activates the automatic fire when an opponent is in the viewfinder, the latter feature that would certainly make the action more dynamic and exciting. What matters, however, is that all these factors put together produce a net result, which we can only judge as surprising.", "date": "2018-03-23", "grade": "8.0"}