{"name": "Sensible Soccer 2006 - Recensione", "ref": "https://multiplayer.it/recensioni/sensible-soccer-2006-recensione.html", "text": "today Sensi is here: redesigned, modernized, but with the same spirit as always Jon Hare's challenge After seven long years, the return of Sensible Soccer today, in the era of transition towards the next generation of video game hardware, takes on a particular meaning. The game derives from a stance towards the market, from a desire to reintroduce an alternative gameplay to what we are used to in current football simulators. There is no doubt that the gaming market, in the ~soccer~ sector, has been dominated for years by a duopoly formed by Pro Evolution Soccer and FIFA, with Konami and EA almost equally dividing the rich cake formed by electronic football fans. Difficult to get out of the way and risky to deviate from the stylistic features imposed by these two extremely successful series, which demonstrate more than any other title that they are in tune with what the public wants. This consequently leads to the fact of not having alternative choices, as far as football video games are concerned, both from a technical point of view (graphic solutions in primis) and as an approach to gameplay. In the light of this consideration, Jon Hare's choice to return to proposing his Sensible Soccer after seven years becomes understandable and acceptable, bringing it back to life as we remembered it: ~they are becoming predictable and boring and appear very slow compared to the brand new feels we have in store, Hare said at the time of Kuju Entertainment's announcement of the game, referring to the tired old (sic) soccer games currently on the market. A precise declaration of intent therefore seems to be hidden behind this return of a historic brand on the market, let's see how it went. 2 keys and go In stark contrast to the competition, Sensible Soccer comes with an extremely simplified control system, deriving on the other hand from the simple one-key control that characterized the Amiga version: two main keys plus one for running. With the A key you make the pass, the direction of which is, as already mentioned, completely free: prolonging the pressure on the key increases the force with which the ball will be hit. In the penalty area, this shot can also be useful for firing a low shot. With the B button you make the high shot, or the cross depending on the occasion, with the possibility of imparting, as per tradition, a more or less marked effect to the trajectory of the ball through the use of the analog stick. With the right trigger it is possible to perform a sprint by significantly increasing the speed of the player, however decreasing his ~stamina~. The contour Sensible Soccer 2006 is an exclusive release for the European market and this is demonstrated in the wealth of content dedicated to users of the old continent, with all the cups, leagues, European competitions and domestic first and second series leagues from all the major countries , as well as national teams from around the world and their league. However, the lack of any FIFA or UEFA license is felt, with the return to mangled names in order not to run into rights problems both for players and teams. Even admitting the purely multiplayer nature of this title, one cannot help but be baffled by the total absence of an online mode for multiple players The contour Through the editor it is obviously possible to modify data and names, but a long work is expected, although the distortions are often limited only to the modification of a few vowels. So the amount of competitions and the roster of teams available is largely satisfactory, what is missing is the solid management system to which the old Sensible World of Soccer had accustomed us. Completely removing the entire management sector, limiting it to a simple organization of formation and substitutions, to concentrate on the main core of the game, looks more like an involution than a valid choice. This removal also takes away an important pillar for the single player game, which also includes a certain lack of challenge due to the general lack of A.I. of opponents. Even admitting the purely multiplayer nature of this title, one cannot help but be baffled by the total absence of an online mode for multiple players, an absolutely unacceptable choice, even in the desire for a return to the original gameplay. However, direct multiplayer is present, for up to 4 players. An old classic with new clothes From a technical point of view, Sensible Soccer 2006 represents an excellent evolution of the original. The maintenance of the old framing and small letterssize of the players does not distort the game action, even if it is based on a respectable polygonal modeling, as shown by the replays, from a close-up view. The players are represented in a caricatured way through the use of cel-shading, which gives a cartoonish touch to the whole aspect of the game, with footballers with huge heads who perform plays with excellent and realistic animations. In the heat of the action, the game favors functionality, but the eye also has its part in watching the replays, therefore. The audio accompaniment is as faithful to the original as one could expect: there is no commentary during the game, the actions follow one another at a frenetic pace, in a general silence which, accustomed to the continuous chatter of modern commentary, leaves dismayed. The reproduction of the noise of the audience is also not extremely satisfying, with cheering and chants that seem somewhat unrelated to the game action and in general not very realistic. Apart from the revival of the historic song of the Sensible World of Soccer intro, there is nothing else to say on the audio side, truly reduced to the bone. sensible football What is most striking about the game is the minimalism that transpires from the menus up to the game: no pompous presentation, a few intermediate steps before entering the field, zero official licenses. The new Sensible Soccer looks like a hard core of old-fashioned gameplay compared to contemporary productions. The first impact can be unsettling, after years of getting used to the Pro Evolution Soccer or FIFA style: those who know the original game will realize that the setting has remained practically unchanged, while the others will perhaps struggle a bit at first to adjust to the game. The whole structure is based on the use of two simple keys (on the other hand the original used only one) and on the speed of action, in an approach with evident arcade characteristics. The framing, which cannot be modified, represents a large slice of the field, with miniaturized players, as per tradition, so as to be able to have a broad vision of the game even at high game speeds. The pace is very fast: the pace of the players and the aggressiveness with which they launch themselves in pursuit of the ball (the referee appears rather ~English~ in the direction of the matches, often overlooking absolutely unforgivable mistakes in a more realistic simulation) make it necessary not to relying too much on dribbling but rather on very rapid passes to teammates, arriving in the shooting area with impressive speed. Ball handling is directly derived from that of the Amiga original, with total freedom given to the player to set the trajectory and power of the pass without any CPU assistance in delivering the ball to nearby teammates, which can require a some time to be metabolized. To make the action clearer, the player in use is highlighted by an arrow starting from the feet and indicating the direction in which he is facing. At the time of passing or shooting, the arrow lengthens in proportion to the force imparted to the ball, depending on the duration of pressing the button on the pad. sensible football Compared to tradition, control of the ball is made less precarious by the way it remains attached to the player's feet, which did not happen in the old episodes, where a sharp change of direction was often followed by the loss of the ball, forcing users to acrobatic controls to maintain possession. The shot is, as per tradition, highly sensitive to the effects imparted via the analog stick, which can make the ball perform certain absolutely spectacular Super Tele trajectories, just as Sensible Soccer purists would have expected. The spin is in fact an integral part of the game structure, with the correction of the shot trajectory essential to obtain results in the match. In general, the pace of the game is the farthest one can expect compared to what other football simulations have accustomed us to: three quick passes, arrival near the area and shooting, or variations on the genre, typically with short touches from each player's part to the finish on the net, a fast and close fight. It may or may not like it, there is no doubt that Kuju has tried to do something alternative and has actually succeeded, while failing to avoid some problems that go beyond the stylistic choice of the game. Apart from the initial difficulty in managing the ~free~ pass, the organization of any action is undermined by the impossibility of being able to select the player without the ball to control,thing left exclusively to the AI which makes the game extremely confusing, often making a mistake in choosing the closest player to activate or quickly switching from one to the other causing you to lose orientation. The other platforms Sensible Soccer 2006 is available for Xbox, PlayStation 2 and PC. There are no substantial differences between the various versions, which all appear to have the same aesthetic appearance. Perhaps on PC, depending on the configuration, it is possible to enjoy better anti-aliasing, but given the chosen rendering style it is really difficult to tell any difference. The lack of online play also makes the Xbox and PlayStation 2 versions virtually identical. Comment Despite the enthusiasm with which the return of Sensible Soccer in 2006 can be welcomed, the defects found in this Kuju / Codemasters title cannot be overlooked. Hare's choice of field in wanting to propose an alternative videogame solution to the football games that dominate the market is commendable, but this Sensible Soccer is nothing but the re-edition of the old brand with a fine polygonal graphics, without any particular evolution. Instead, there are inexplicable shortcomings, such as the managerial section and the online multiplayer mode, which would have greatly benefited the title in question. The game is still the same, practically the same one that can be remembered from the times of the Amiga, and it is a good thing that it has remained so, but one cannot help but think that its realization has remained incomplete. The path taken is correct, but it must be pursued in a more thorough and complete manner. However, it remains highly recommended to fans of the series. PRO: It's really him, the old Sensi! Fast and great playable Valuable mediation between old setting and new graphics CONS: Game action often confusing No old management section No online multiplayer Memories are an integral part of videogame passion, the history of videogames is dotted with titles that, for a player, have particular meanings, melancholic or amused flavors. There are some that have marked eras, and have helped decree the success of certain systems, filling entire afternoons spent hammering on joypads or joysticks. One of these was Sensible Soccer on the Amiga, the undisputed dominator of the drive of the Commodore machine, when it came to challenging some friends in a soccer single combat. Seven years have passed since the last appearance of the brand on our screens, but today ~Sensi~ is here: redesigned, modernized, but with the same spirit as always.", "date": "2006-06-19", "grade": null}