{"name": "La recensione di Devil May Cry HD Collection", "ref": "https://multiplayer.it/recensioni/196489-devil-may-cry-hd-collection-la-recensione-di-devil-may-cry-hd-collection.html", "text": "We owe a lot to Devil May Cry. He taught us that demons can cry, and that slaughtering them with giant swords and guns with infinite bullets is hilarious. But above all we owe him the fortune of the entire action adventure genre. Who knows if Kratos would ever have existed, for one thing, without Dante. Strange things were happening in the early 2000s. Devil May Cry, perhaps not everyone knows, was born as a chapter of Resident Evil; then in the course of development you realize that it is becoming something too different. It has enough charisma to materialize in a new IP, and Capcom chooses to risk it, resulting in one of the greatest successes of the era. In 2001 Devil May Cry recorded very high sales on PlayStation 2, so high as to justify two sequels in the immediately following years, creating a real killer app on the Sony console. From there on it's history. A story that is not always positive, to tell the truth, with some missteps and other peaks of skill. Today, unfortunately, we find a misstep on our hands: the Devil May Cry HD Collection which arrives on PlayStation 4, Xbox One and PC, is nothing more than a commercial operation, managed with very little respect for Dante and comrades. But let's go in order. Devil May Cry today: user guide Demons are big and ugly and mean, but there are exceptions. Sparda, Dante's father, who is the protagonist of most of the titles in the series, is an exception. He rebels against his lineage, fights for mankind, becomes its leader and guarantees many years of peace. At the time of his death, all the portals between our world and the demon world were closed, ensuring the survival of man. All this is told to us by the introductory movie of the first chapter of the series: Devil May Cry. Things change quickly: in the 2000s, Mundus is resurrected. He is Sparda's archenemy, and he wants to annihilate the Earth. A mysterious woman, Trish, goes to Dante for help; the boy is a very powerful half-demon, the only one who can save the situation with tamarraggine, swords and guns. Thus begin the adventures of Dante, on the frontier between our world and that of demons. At the time Devil May Cry was a very fresh title, the fruit of that genius of Hideki Kamiya, father of other famous productions such as Bayonetta and Okami, just to name two. Many aspects were a real novelty in 2001: the mix of highly exploratory sessions and others dominated by ferocious fighting, for example. The spectacular screen combos of the protagonist, who the more he strengthened himself the more he was able to perform truly incredible actions by combining his two guns, Ebony and Ivory, and the gigantic sword Force Edge. The same cast of characters was particularly inspired, with protagonists cloaked in the right amount of ambiguity. Taking these masterpieces back into your hands nowadays, there can be basically two reactions. Anyone who played them back in the day becomes a child again, and remains enraptured: because they know that world, and live it again, with some benefits of a renewed technical sector. Those who have never heard of Devil May Cry, on the other hand, must first of all understand that they are titles published respectively in 2001, 2003 and 2005. At best, it's been thirteen years, which in this industry is roughly equivalent to a century. Inevitably, it is difficult (if not impossible) to find them as fresh as they were then: because they founded a genre, which has evolved and continued on its path. It's as if we play Bayonetta first, and then come back to Devil May Cry and find it incredibly slow. It's an unfair comparison: if this first Kamiya series hadn't existed, Bayonetta would never have seen the light of day. This discourse is partially dampened by examining Devil May Cry 3, the most modern of the three, still able to stand up to other valid exponents of the genre today. Playstation 4 trophies Devil May Cry HD Collection features the exact same trophies as the PlayStation 3 and Xbox 360 port. This means that trophy hunters will be able to take home (again) not one, not two, but three Platinum Trophies. It will still be a demanding challenge, because each title will have to be completed on the highest game difficulty of all: Dante Must Die. In this mode the enemies will be very fierce, and your health will drop very often: equip yourself properly. The (slightly) definitive collection And now is the time of the pains. Seeing the announcement of the Devil May Cry HD Collection, someone must have surely thought: ~wait a minute, isn't it already out?~. Yes, Devil May Cry HD Collection was released in 2012 on Playstation 3 and Xbox 360. Even then it was proposed as an updated version of the three main chapters of the series, a port that threw them into the world of high definition. Even then there was a good deal of inexplicable situations: the graphics had been improved, but only partially. Most of the textures had remained in low quality, the polygonal models had not been touched, the lighting effects not even remotely revised. The character models, yes, had undergone a facelift, the same as the loading screens. However, the game menus, the map and the cutscenes had remained unchanged from the original chapters on PlayStation 2, complete with a traumatic transition to 4:3 screens. An eyesore, which at the time could somehow be justified. Let's come to today's Devil May Cry HD Collection, and analyze the differences: first of all, the support for Full HD and 60 FPS, a very important feature in an action game. And then... nothing. The collection proposed on PlaySation 4, Xbox One and PC adds practically nothing to what was already seen in that of 2012. Not only that: it is even more serious the fact that Capcom has not even deigned to correct, after six years, many small details that would have made a difference and justified the purchase (again) of the same product. For example the quality of the movies: they are essential to follow the evolution of Dante's events, but very ugly to watch. They were ugly in 2012, let alone now that they alternate with Full HD gaming sessions. Every time we collect an object, a collectible or a weapon, the menu that opens is in 4:3, a real attack on the health of the player's eyes. Not even the game map was created from scratch. Go ahead the movies, which need a lot of work to be redone from scratch: was it really that difficult to pick up the maps and menus and at least update them to high definition? Was there really no time in six years to do even that? On PC things are probably better, at least 4K support has been introduced there, which is absent in the versions for PlayStation 4 Pro and Xbox One X (another case of laxity). On the other hand, it seems that the PC version is plagued by other types of problems, including that of the audio sector. Devil May Cry HD Collection includes the first three installments of the series: Devil May, Devil May Cry 2 and Devil May Cry 3: Dante's Awakening. Almost sacred, funny and important titles. But it is legitimate to ask a question: in the face of an important price, equal to 30 Euros for the digital version and 40 for the physical one, Devil May Cry 4 could not be added and thus close the series, waiting for the increasingly probable announcement of Devil May Cry 5? Among other things, since the differences are really minimal, the same chapters can already be purchased for negligible sums on PlayStation 3: an additional content, something worthy of attention, would certainly have appealed to fans, who on balance will be then the only ones to really have interest in the ~new~ port. The one operated on the Devil May Cry series seems (and cannot fail to seem) a shrewd commercial operation: to arouse a new interest in the series, to attract fans, all at the price of a very minimal effort. There has been some tweaking in terms of graphics, yes. Some textures are (slightly) better defined. The general glance, in some situations, has been enhanced. But it is little, too little to justify the new product, and above all its price. A complete remake of the series would certainly have been expensive to make, but that doesn't mean Dante's Adventures deserve such treatment. You shouldn't joke too much with a guy whose veins have demon blood. Armed with guns and a sword, by the way.", "date": "2018-03-15", "grade": "6.0"}