{"name": "La recensione di Q.U.B.E. 2", "ref": "https://multiplayer.it/recensioni/196225-qube-2-la-recensione-di-qube-2.html", "text": "Quite a bit of time has passed since the launch of the original Q.U.B.E., but we can say that the guys from the English studio Toxic Games have used these years fruitfully, bringing the game to other platforms and then dedicating themselves to the creation of an absolutely all-in-one sequel. height of expectations. For those unfamiliar with the series, it is a first-person puzzle-based adventure in which we take on the role of a character equipped with a special suit that allows him to interact with certain devices to create cubes of different colors and functions; all within an ~aseptic~, mysterious and labyrinthine location. The reasons why the protagonist of the first episode was there are revealed in the finale, and in Q.U.B.E. 2 the story is further enriched, dutifully emphasizing the narrative sector and creating a truly fascinating atmosphere. In this case we control the archaeologist Amelia ~Milly~ Cross, who wakes up wearing the same suit we talked about earlier, but without knowing how she ended up in the huge structure that forms the backdrop for the new chapter. She is contacted via radio by Commander Emma Sutcliffe, who briefly explains the situation and what her role should be: to find out more about the mysterious tower that stands on the surface of the inhospitable planet on which it is located. Surprises, however, will not fail. With only the laying on of hands Q.U.B.E. 2 takes up the formula of the first episode, however introducing new features and, as mentioned, a much more engaging and significant story, with two different endings and convincingly acted out by the interpreters who have lent their voices to the characters (audio and subtitles are in English, for the record). Using a controller, it is possible to jump by pressing A / X, eliminate a cube with X / Square and use the back buttons and triggers to change the equipped ability, interact with devices and make them produce electric blue ~bouncy~ surfaces , red quadrangular parallelepipeds or green cubes. Each of these objects has a specific function, and the game manages to introduce them very well, gradually, gradually raising the level of challenge and the complexity of the puzzles that we will have to solve to reach the end of the adventure. If we need to reach a raised platform, activating a reflective surface can make us ~bounce~ where we want, perhaps on a previously created parallelepiped, where we dropped a cube to create a sort of ladder to climb. However, these are only the basic functions: going forward in the campaign we will encounter mechanisms of various kinds that will intertwine their characteristics with the mechanics related to the creation of cubes: mobile platforms, switches, magnets, pumps from which oil and flames come out to make it burn, creating ~fiery bullets~ as needed to make it come into contact with doors that open only in the presence of heat. More and more complex If the first episode of Q.U.B.E. had to some extent a problem with the balance of the difficulty, which increased a bit too markedly during some stages, in Q.U.B.E. 2 challenge progression was handled near perfect. We completed the story in just over six hours, progressing smoothly and never encountering insurmountable obstacles, which means that the developers avoided putting obscure and difficult to interpret solutions on the table. Of course, it is also possible that the experience with the first chapter has provided us with solid foundations from which to start solving the puzzles of this new adventure, which in fact in the final part brings out really intricate puzzles, made up of various sequences that intertwine . Sometimes it is necessary to be really precise and reactive, but in general the solving of the puzzles is a matter of logic, of reasoning: activate the switches to see what they do, observe the position of the panels with which you can interact, put a pinch of ingenuity and sin never of fantasy: there are moments in which the same cubes will transform into real means of transport, to be projected using bouncing surfaces and / or inverted magnets while we are on top of them. The formula works very well, building on the experience gained with the first episode to shuffle the cards a bit, avoiding repeating the same situations and indeed managing to intelligently innovate the gameplay through the inclusion of many new devices. Proof of this is also the presence, from a certain point onwards, of areas with a large one in the centreelectronic unit to be reactivated by following the ~off~ cable crosses, which lead us to as many switches that can be reached, of course, only after solving a puzzle. Cube atmosphere In the original Q.U.B.E. the story seemed to perform a secondary function with respect to the action, revealing some details on the mysterious scenario only towards the end, when the previously aseptic and perfectly intact walls of the structure gave way to areas devastated after who knows what events. In this sequel, however, the situation is very different and the weight of the plot is felt right from the start, involving us in the journey that the protagonist decides to take inside the ~sentient~ tower which is the backdrop to the adventure. Triggered this mechanism, all aspects of the game begin to compete to create a certain type of atmosphere, sometimes disturbing but always engaging, capable of keeping you glued to the screen (it is no coincidence that we completed the game in just two long sessions) and to push towards the next puzzle, arming yourself with patience and ingenuity to quickly understand what needs to be done to move forward. You move, in this strange structure, smoothly: the small stairways are covered automatically, while on the larger blocks you have to jump, but in all cases the navigation is fluid and generally you don't get lost, also because it is always light to guide us. Thus it happens that in the middle of the campaign the scenario changes completely, becoming more ~rustic~ than it was possible to imagine, given the premises, and adopting completely different, warmer and more lively shades of color. A small stylistic revolution that also in this case gives great charm to the experience, enhancing its being a sequel, with growth that also takes place on an artistic and technical level. The splendid music effectively underlines the most exciting moments, while on the graphic front the work done by Toxic Games seemed impeccable to us, with the only exception of a decidedly old-gen rendering of water, although present on one occasion . For the rest, the Unreal Engine was exploited well and on the test configuration it guaranteed sixty frames per second stable at 1440p with all effects at their maximum, whereas instead to play at 2160p you have to file something or settle for forty frames: a choice that we do not suggest to do, given the importance of fluidity in some moments.", "date": "2018-03-13", "grade": "8.0"}