{"name": "La recensione di Final Fantasy XV: Windows Edition", "ref": "https://multiplayer.it/recensioni/196240-final-fantasy-xv-windows-edition-la-recensione-di-final-fantasy-xv-windows-edition.html", "text": "Final Fantasy XV: Windows Edition is identical to the console versions in terms of content. More precisely, it is Final Fantasy XV updated to the latest version and with all the DLC released up to now: Episode Gladiolus; Episode Prompt, Episode Ignis; Comrades and all the countless downloadable packs, sets and weapons released over the months. For details of the various contents, we refer you to the relative reviews, which will surely help you to get a more complete picture of the innovations introduced patch after patch and expansion after expansion. Unfortunately, the economic model of games as a service, to which Final Fantasy XV belongs, inevitably creates a fragmentation that makes it difficult to keep track of everything. Also consider that over the months, now inaccessible events have taken place, such as the crossover with the Assassin's Creed series. These are not tragic losses, also because usually these extras add little or nothing to the basic title, but it is right that you are aware of it. For the rest, the Windows Edition version remains the story of Prince Noctis Lucis Caelume and his three friends, Prompto, Gladiolus and Ignis, who must reach by car Princess Lunafreya Nox Fleuret of the kingdom of Tenebrae, betrothed to Noctis. Unfortunately, their mission completely changes nature after a series of events that upset the political balance between the kingdom of Lucis and that of Niflheim, which have been at war with each other for years. Will Noctis be able to recover the crystal that has protected his people for centuries? To find out, all you have to do is play. Brotherhood and Kingsglaive When it comes to Final Fantasy XV it should never be forgotten that it is a cross-media project. In particular the opening moments, including the events related at the end of the first chapter, may be unclear if you haven't seen Brotherhood, a free five-episode miniseries that chronicles the journey of the four protagonists before the start of the game's events, and Kingsglaive, an animated film focusing on the events that took place in the realm of Lucis while Noctis was away. By clicking here you will find all the episodes of Brotherhood collected, while Kingsglaive will necessarily have to be purchased in digital or physical format to be seen. In general we can say that they are not essential, but at the same time they help to get a more complete picture of the facts told during the adventure (Kingsglaive in particular). The PC version: technical magnificence and mod support In short, we know the game well. So, speaking of the PC version, it is above all important to understand if we are dealing with a quality port or a listless transposition, done on the cheap (Chrono Trigger style). The short answer is that we are facing a great port, but let's explain ourselves. Square Enix, which evidently wants to use it as a test bed, immediately presented the PC version of Final Fantasy XV as the most technically advanced. It's not for nothing that he created it in collaboration with the hardware manufacturer Nvidia, whose Gameworks effects stand out in full view in the configuration menu. But is it graphically so much more beautiful than the other versions? Let's go in order. Meanwhile, it must be said that it is very scalable. The configuration options are many and varied. For example, they allow you to set the resolution of the image, as well as the rendering one, but of course you can also define the details of the textures, the quality of the tessellation, that of the anti-aliasing and so on. In general terms there is a little bit of everything. However, the more geeks can go deeper with the tweaks by editing the .ini files (do it only if you know what to touch). The Gameworks options that can be activated from the game menu are: the HairWorks, which improves the rendering of the characters' hair; the VXAO, which activates Voxel ambient occlusion; the Turf Effects, which improves the rendering of the grass and the ShadowLibs, which improves the shadows of the characters. By activating everything, there is no doubt that the final image quality is much higher than that of the console versions. We go so far as to say, given the PC needed to run it in maximum detail, that we are faced with a first taste of next-gen. This is what we were referring to when we spoke of a ~test bed~. Played at 4k on a 1080Ti the game is a real show, with breathtaking landscapes and top-notch effects, evidently reworked for this version. Unfortunately we soon had to go back to 1080p and a GTX 960 to complete the test, with which in any case Final Fantasy XV performed more than worthily (don't be scared by those who say you need a high-end computer to play it). In general we can say that, properly configured, the game does notnever gave us any trouble. The only moments of uncertainty occurred with some summons, which bent the framerate a bit, but it must be said that they never prevented us from playing and, above all, from understanding what was happening on the screen (within the limits of the confusing system of combat). That said, Final Fantasy XV could be a good excuse to upgrade your video card... if it weren't for the fault of the data miners, buying one these days costs a fortune. Another valuable element of the PC version is the support for mods. The game's Workshop on Steam is active and, if you wish, you can already download various objects and costumes, all made by Square Enix itself, such as the Gordon Freeman suit for Noctis, or the Kiactus costume (with variations). However, if you search, you will also find other mods, such as the [Special K] FFXV Mini-Mod: Resource Mgmt. Performance, created to address performance issues experienced on some configurations. As many of you know, modder support can often make a difference on PC. For now there isn't much (it's the first few days, it's natural that this is the case), but something is moving, also because the dedicated forum is teeming with projects and requests, among which the most popular, needless to say, is a nude mods for Cindy. The control system also deserves a few words: we advise you to play with a controller, because obviously Final Fantasy XV was designed for it. However tinkering with the configuration menus and doing a little practice you can play safely even with mouse and keyboard. So don't be afraid of being penalised.", "date": "2018-03-09", "grade": "9.0"}