{"name": "La recensione di Lichtspeer", "ref": "https://multiplayer.it/recensioni/196074-lichtspeer-la-recensione-di-lichtspeer.html", "text": "To begin with, an unspecified Germanic deity of light takes the protagonist, suitably equipped with a horseshoe moustache, and decides to make him fight against hordes of enemies. So, to have fun. Since then the wretch in question has ridiculous fists that would not be strong enough to resist the required commitment - as always stated by the aforementioned Teutonic god - it gives him the power to throw luminescent javelins from his hands, with the possibility of enhancing their effects and adding also additional support skills. Here is the premise of Lichtspeer, which as you can deduce is a title based on a rather particular concept: in fact it is a sort of Angry Birds as a mechanic, but with elements that also recall tower defense in various respects. In short, we are alone against an abnormal amount of enemies who fill the screen with spears of light as a weapon to defeat them before they reach our position at the edge of the screen. Each level consists of a single screen, in which the opponents appear on the opposite side to ours and advance by walking, flying or moving in some way towards our position, more or less quickly. Our job is to shoot them down before they reach us and it's not always an easy mission, especially in the more advanced stages. Through an intuitive control system, by moving your finger on the touch screen we raise and lower the aim trying to identify the right trajectory to hit the target, with the possibility of attacking the weak points (usually the head) in order to reduce the number of shots needed to take down enemies. If we miss a beat, the divinity will make fun of us but if we make too many mistakes, he could decide to remove us directly from the world even without waiting for the various monsters to think about it. With a decidedly nice gimmick, the protagonist is replaced in the case by an identical one with the same name but a progressive Roman numeral next to it. Astral Javelin The control is therefore intuitive, based on short touches and movements of the fingers on the screen, also because the time to aim and throw the darts is really limited considering that we are under continuous siege. A problem with this setting emerges at an ergonomic level: keeping your hands at the sides of the screen, with your fingers near the edges (tapping with two fingers or with various combinations of movements activates secondary skills) you tend to cover important parts of the screen and it is annoying. The setting of the game obviously tends to enhance the search for the score and maintaining a good rhythm of hits, perhaps on the weak points of the enemies, increases the multiplier in order to create the usual progressive mechanics of the performance aimed at the high score. If you miss the target you lose the multiplier, but if you continue to miss we find ourselves having to restart from the beginning of the level, an eventuality that also happens with a simple hit by the opponents. To simplify life a little and at the same time deepen this basic combat system, it is possible to invest the money accumulated during the clashes (curiously called LSD but not to be confused with the famous lysergic acid: in this case the acronym obviously stands for ~Licht Standard Denomination~) in active or passive secondary skills, which work through cooldown keys becoming practically fundamental during the more advanced levels. Lichtspeer's edgy and stylized depiction of the world and characters manages to be functional to the game, maintaining clarity to the action, but also quite elegant in its retro-futuristic madness, with humor always remaining present in every situation.", "date": "2018-03-07", "grade": "7.8"}