{"name": "La recensione di Outlast: Bundle of Terror", "ref": "https://multiplayer.it/recensioni/195955-outlast-bundle-of-terror-la-recensione-di-outlast-bundle-of-terror.html", "text": "Going to sleep at night for the gamer is not always an easy task. Some titles encourage you to look over your shoulder a couple more times than normal after turning off the light. You never know what might be lurking in the dark. Recent studies show that those who behave in this way are not crazy: they have played Outlast. The title, together with its sequel, has established the independent studio Red Barrels as a creator of experiences that are halfway between disturbing and terrifying. Much more intense experiences than a Layers of Fear: Legacy, for example, another exponent of the genre recently arrived on Nintendo Switch. Outlast: Bundle of Terror is also part of a very specific marketing plan, which consists of bringing everything that could sell well at the price of a minimal conversion to the hybrid of the Kyoto House. Outlast: Bundle of Terror marks the arrival of the first chapter of the series on Nintendo Switch, while for Outlast 2 we will have to wait until the end of the month. Meanwhile we face the return of our nightmares, this time also in portable mode. The hospital on the hill The title of a famous horror film reads: ~don't open that door~. There must be a damn reason why some doors don't go open. But Miles Upshur, the protagonist of Outlast, probably doesn't know it. Or he's never seen the movie. For this reason, when he arrives at Mount Massive Psychiatric Hospital, lost in the hills and mountains of Colorado, he decides to ignore all the useful warning signs at his disposal. It is a dark and stormy night, there is no night watchman at the entrance to greet him (although his post is lighted and in operation), all entrances to the structure are barred, and clearly government vehicles lie abandoned at the entrance. Despite everything, our investigative journalist does not lose heart, crawls into the opening of a secondary entrance and slips inside the asylum. With him he only has his video camera and a notebook. The reason why we have to enter the asylum is all in all simple, as well as a mere narrative pretext to unleash the horror: a hospital insider warned us that strange things are happening in the structure, gruesome experiments on patients conducted by unscrupulous people. It's an opportunity for a real scoop, but what awaits us is nowhere near imaginable. The entire building is littered with blood, corpses, devastated environments and above all by beings who are no longer human. Our task after a few minutes changes: no longer to explore and understand, but to flee. Provided that the grotesque creatures roaming the corridors let us. Outlast is a solid and effective survival horror, based on a simple gameplay and characterized by an extremely linear development. In the role of Miles we will explore the corridors, dungeons and torture rooms of the asylum, armed with our trusty camera. It is the cornerstone of the production: it promotes immersion and allows you to see in the dark through infrared, thus identifying points of interest and approaching enemies. Its use helps to make Outlast even more of a heart-pounding experience: when the batteries run out, the camera will cease to be an effective tool and will leave us helpless, shrouded in darkness. We will therefore have to study carefully when and how to use it. As if that weren't enough, the game immediately warns us that Miles is not a warrior: in the face of danger he can do nothing but hide, waiting for the enemies patrolling the asylum to forget our presence around the corner and allow you to go beyond. The task of getting out of Mount Massive alive is not easy in ~normal~ mode and increases at higher difficulty levels, as enemies get more cunning and the camera more and more expensive. In all, however, a handful of hours will be enough to see the credits. Portable fear Apart from some small ad hoc adjustments necessary for the landing on the new hardware, Outlast: Bundle of Terror brings the same content already seen on other consoles and PC to Nintendo Switch. The package also includes the Whistleblower DLC, which tells the events prior to the main adventure, reveals interesting background stories on our principal and in a certain way connects to the story of Miles in its final stages. The port of Red Barrels is done with care, but points in a very different direction from that of Layers of Fear: Legacy. Rather than devoting himself to implementing the new mechanics of the hybrid console, in fact, it consolidates its strong points and makes them effective on Nintendo Switch as well. The opening of the doors, for example, does not linger in a Motion Control just mentioned, but remainsanchored to the traditional keys: Y and the left analog. The camera is always at hand and can be used with a quick press of the backbone R, while sprinting is done with L. The only really inconvenient command is the zoom for shots, which requires the d-pad of the left Joycon, but it's not the end of the world because it's rarely used in excited or important situations anyway. Even the HD Rumble is relegated to the background, and this is partially a missed opportunity: it could have contributed to making the experience even more anxious with a studied vibration system. In short, Outlast on Nintendo Switch is the same title already seen elsewhere, with the added advantage of portability; there was no hesitation towards the small possibilities offered by the Nintendo Switch hardware. This does not mean that, despite the somewhat high price, Outlast: Bundle of Terror is not a carefully crafted port. What scared the users the most was, as almost always, the technical sector, since the arrival console still has its limits. On Nintendo Switch, the Red Barrels terror offers an experience in 720p and 30 FPS in portable mode, while at the same frame rate the resolution rises to 1008p in TV mode. No, we didn't spell it wrong: it's really 1008p, and not 1080. Regardless of the numbers, the performances are good, whichever way you want to play. Probably the real ~new~ experience is the portable one, able to bring out the mechanics of Miles' ~live footage~ in a positive way, with the effect of poor visibility connected to it. On the positive side, there is also a stable frame rate, the absence of uploads (except the initial one) and a new menu design that makes consultation of the various items practical and fast, as well as the documents collected around the rooms of the mental hospital. On balance, more could have been dared, but apart from the lack of Motion Control support and the scarce use of HD Rumble, Red Barrels has followed a precise criterion in creating the version on Nintendo Switch: to re-propose its product for what it is , without optional frills that risked devaluing it instead, and making it appreciable from a technical point of view.", "date": "2018-03-05", "grade": "8.0"}