{"name": "La recensione di Aegis Defenders", "ref": "https://multiplayer.it/recensioni/195866-aegis-defenders-la-recensione-di-aegis-defenders.html", "text": "Shall we try to mix the platform with puzzle elements and tower defense? By now we can imagine them, the indie developers, around a table trying to match genres and videogame styles even clashing with each other in increasingly unexpected ways, to bring out something completely new from this overcrowded market. In this bizarre spin-the-mode of suggestions and game mechanics, sometimes it happens that a particularly absurd approach can actually work, which occurs above all when the team has very clear ideas, a handle on development and a certain mastery also for regarding the stylistic aspect. Aegis Defenders falls into this case study: although it is not without flaws, a game that manages to make a mix of platform, puzzle and tower defense work still deserves an honorable mention. In fact, each level of this title is initially proposed as a sort of Lost Vikings with different characters to be used to solve various puzzles in structured platform environments, then at a certain point it becomes a real tower defense in two play sessions which are actually detached from each other. Put like this, it is difficult to believe that such a video game Frankenstein can actually work, yet the creature of GUTS Department and Humble Bundle is well built and also playable, beyond some inconsistencies in design and general balance. None of its parts particularly shines, but the balance between the distinct sections manages to make sense of the composite nature of Aegis Defenders, held well together also by a decent narration - with even interesting cues and sometimes non-trivial dialogues - and by a construction of the game world that has a remarkable coherence, recalling in this sense some of the most intriguing indies such as Cave Story, Risk of Rain and Owlboy, with influences and atmospheres that lead up to Nausica. Ancient gods and mortals The elements most functional to the characterization of this game are its setting, the story and the narration with which this develops over the course of events (the texts are all in English). The world of Aegis Defender starts once again from a post-apocalyptic vision, in which survival is played on a difficult balance between gods and mortals. In this strange setting, entire nations huddle around ancient entities called Deathless, ruins or reflections of previous civilizations adored as immortal divinities by those who believe, representing a sort of glue for the new social structures that have been painstakingly created. In all this, some spoilsports could not be missing, here represented by a sort of atheistic faction that tries to free itself from the Deathless and live according to its own rules: but which side exactly the reason is in this clash is not easy to establish, and so the world of Aegis Defenders also carries with it some interesting reflections on religion and free will, no less. The beauty is that all this is told in a very little verbose way, gradually revealing itself during short interlude scenes between one level and another and above all through the dialogues between the characters, who interact with each other especially in the stages of camp at the end of each tiring day, when the moment becomes propitious for reflections on life, the universe and everything. A light but sanguine narrative, therefore, which takes place through non-obvious dialogues, very pleasant despite the fact that the story behind it is not exactly innovative. The fact that the project had initially started as a starting point for a graphic novel clearly appears in the excellent characterization of the characters and in such evident care in the construction of the atmospheres and the surrounding world, and these are all elements that greatly enrich the game, which starts by putting on stage the simple actions of the hunters of ruins Clu and Bart then expanding their borders to tell the fate of a world in precarious balance. Platforms and strategy Almost all the levels of Aegis Defenders follow a common pattern, which is also the stylistic feature of this strange hybrid game, or rather the division between the platform component and the tower defense component: a first phase sees the protagonists engaged in the exploration of a map until you reach a relic with a central role in carrying out the mission, with a platform-style structure with puzzles. The puzzles are mainly solved with the alternating use of the various characters, each characterized by different specific equipment and skills that allow you to interact in various ways with the scenarios and fight with different styles.It starts with the young hunter Clu armed with a rifle and her grandfather Bart with his trusty hammer and you get up to using four characters with the later addition of Kaiim and Zula, but you can always use only one hero at a time alternately (or one for each player, in the case of multiplayer). The platform phase contains simple puzzles to solve (mechanisms to activate, actions in sequence and doors to open) but also fights with enemies, and in both cases we find chromatic correspondences that force us to alternately choose one or the other character (such as opponents or doors of a certain color that can be respectively hit or opened by a specific fighter), therefore the action is always choral for the group of protagonists. It is clear that all of this finds its maximum expression in the cooperative multiplayer game, which is indeed the best way to enjoy Aegis Defenders, something particularly enhanced on Switch by the possibility of carrying out multiplayer ~on the fly~ with the two Joy-Con separate and split-screen. This impression is further strengthened in the second fundamental phase that makes up each level: the moment in strategic tower defense style. Once the ruin is found, a countdown starts which requires us to set up defensive structures to face the arrival of waves of enemies through some portals. In this situation, the other specific skills of each character emerge, which allow everyone to place a turret equipped with particular defensive systems. To add further strategic depth, it is possible to associate the turrets of two characters obtaining different effects for each combination. A beautiful but harsh world The fact of being set up to be enjoyed particularly in cooperative mode also brings out one of the main flaws of Aegis Defenders, namely a certain lack of balance in the single player game. Apart from the basic mechanics of having to constantly alternate the characters even for the simple clashes in the platform phases, which instead becomes quite fluid if two fighters are used at the same time, it is above all in the tower defense style moments that a certain imbalance emerges for those who face the solo game. The time available to deploy the defenses is always very limited to set everything up by yourself (at least in the more advanced stages of the game) and the elements to keep under control become too many for a single player, also because the artificial intelligence that manages the other companions at the same time proves to be absolutely insufficient to carry out even the most basic actions, which forces us to act personally on all the team members. Instead, these elements prove to be balanced in order to be rightly stimulating if you find yourself playing in two, but multiplayer should simply increase the quality of such a game, not end up being a deterrent for the single player. These drawbacks are exacerbated by an inharmonious progression of the difficulty, which presents significant peaks in the presence of some missions after a very affordable start, and can easily frustrate the less patient. To soften everything there is at least the excellent technical realization of the game, which is cared for and coherent in the representation of its particular world in pixels, managing to be even original despite the quantity of similar productions that now crowds the market.", "date": "2018-03-03", "grade": "S.V."}