{"name": "La recensione di Age of Empires: Definitive Edition", "ref": "https://multiplayer.it/recensioni/195298-age-of-empires-definitive-edition-la-recensione-di-age-of-empires-definitive-edition.html", "text": "In the end, the Forgotten Empires guys managed to meet the ultimatum and the ~definitive~ edition of Age of Empires, the immortal RTS released in 1997 by Microsoft and developed by the defunct Ensemble, is ready to be downloaded. This time the download speed of the Windows Store, the only digital platform on which it can be purchased, was in line with the performance of Steam and in a short time, thanks to the optical fiber, we were able to click on the game icon. The first impact with the single player sector (we had already talked about the multiplayer one in the test a few days ago) is a real heart sank. Apart from a skimpy restyling of the home screen, however in line with the stylistic features of the game, it seems to be catapulted into the middle of the nineties, in a period in which video games were finding their place in the world of mass entertainment and there there was still a certain space for ~bold~ ideas even in the so-called ~triple A~, a category in which Age of Empires fully recognized itself, being the flagship title of the new Microsoft policy which would lead, a few months later, to the development of the first Xboxes. Backstreet's back, alright(?) Those were the years of WarCraft and Command & Conquer, but also of Civilization, and Bruce Shelley (former right-hand man of Sid Meier at MicroProse), together with brothers Rick and Tony Goodman and Brian Sullivan decided to blend the two different philosophies of strategy (albeit not equally) to give life to the first of a series of games of which we are waiting for the fourth chapter, entrusted to Relic Entertainment. A brief review for those who were distracted at the time and for the younger ones who have not had, for reasons of registry office, the opportunity to get their hands on the CD-Rom of the first Age of Empires: it is an RTS that respects the postulates introduced by the sacred monsters of the genre, however adding the technological evolution which is one of the fundamental pillars of the Civ saga. Of course, all those aspects that real-time management would have made it too difficult to keep at bay are missing, but some nuances, such as the possibility of persuading the CPU to join forces in exchange for resources, or the priests' ability to convert to their cause the enemy units, are an obvious reference to Civilization. Hit me baby one more time The typical game begins with a worker: a handyman unit which, in addition to constructing buildings, can be used for the collection of food, wood, stone and gold, i.e. the four fundamental resources. The first few minutes are spent exploring the map in search of the richest areas and building the basic structures necessary to progress through the four stages of progress of one's civilization. There are as many as sixteen, but the development tree is unfortunately the same for all of them, apart from a few specific units. As you evolve, new structures and militaries become available while simultaneously unlocking upgrades for existing ones. The enthusiasm in rediscovering the old mechanics is quickly dampened by the re-proposition of limitations that perhaps could have been accepted twenty years ago, but which today are much more difficult to swallow. Our complaints particularly concern the path-finding logic of the units, which often get stuck remaining at the mercy of any enemies, or which limit themselves to attacking only the closest opponent autonomously; once eliminated they remain still and force the player to act with the mouse to avoid a drip. Even the artificial intelligence has remained the same: to have a good degree of challenge it is necessary to set at least the ~difficult~ level, but we realize that to be more fearsome the CPU simply ~cheats~ with the speed of resource collection , getting to build the most powerful units faster. In essence, therefore, it is sufficient to resist the first and numerous attacks to then launch the counterblow with an army that equals the enemy in number; objective made a little more complicated than in the past because with the Definitive Edition the maximum population limit has risen to 250. Although there is a certain variety in terms of infantry, duels with the CPU always reward the phalanxes composed of the most powerful that, in the final analysis, continue to be preferred even in challenges with ~human~ intelligence. The weight of the years The single player mode allows you to tackle nine campaigns: to the original eight (four of which are present in the Rise of Rome expansion, which has been integrated here) the Forgotten Empires programmers have added a ninth, The First Punic War, which sees how protagonists once again the centsRoman urions and which was featured in the expansion pack demo. Although at first the presence of new cinematic sequences to ~bind~ the various scenarios was leaked, we noted with mocking bitterness that the films, which were also present in the 1997 release, were completely eliminated to make way for aseptic fixed screens in which an annoying narrative voice presents us with the objectives to complete. Obviously, the campaigns are characterized by very special and non-repeatable situations and limitations in online games and represent, despite everything, the most appetizing scope of the celebratory dinner prepared by Microsoft, retracing the salient moments in the development of a civilization. Despite the springs on its back, this modality can still have its say, but in a short time it shows all the ailments of the years especially when compared with the most brilliant evolutions of the genre, among which it is impossible not to mention the no longer very young StarCraft II, whose Wings of Liberty campaign has recently become free, which has set standards of narrative and engagement of a completely different level. Once completed (it will take more than thirty hours) there is then the possibility of facing the computer, or other opponents in the flesh, by setting a series of parameters such as the morphology and size of the map, the victory conditions, possible alliances and so on. Lazy transposition The thing that most catches the eye is the updated graphics: the programmers have used the same engine of twenty years ago (the Genie), with a cosmetic work both on the textures of the terrain and buildings, and on the animations of the units. It certainly cannot be said that the result makes you tear your hair out, far from it: the mere awareness of being in the presence of such a sacred monster manages to make you accept a standard which, in our times, represents the minimum wage even for a production independent. The fact of being able to act on the zoom does nothing but turn the knife in the wound, since by bringing the gaze closer to the sprites one notices a work that certainly does not live up to the coat of arms of the saga. Naturally this Definitive Edition adapts perfectly to the FullHD standard and even to 4K, maintaining system requirements that are absolutely within everyone's reach, but it remains a cold consolation. The impression is that we wanted to feast on the corpse of Age of Empires with the minimum economic effort, and it is even more paradoxical considering instead how much had been invested in its time. The ~remastering~ of the soundtrack is much more effective, really pleasant in accompanying the player during the sessions, which are on average quite long, without ever getting boring. We are unable to express an opinion on the online sector as we have a version for the specialized press: we have simply noted that those technical defects that afflicted the beta seem to have been resolved, but it was not possible to join any game.", "date": "2018-02-19", "grade": "5.5"}