{"name": "La recensione di Radiant Historia", "ref": "https://multiplayer.it/recensioni/195040-radiant-historia-perfect-chronology-la-recensione-di-radiant-historia.html", "text": "Judging remakes and conversions is not as easy as it seems: you have to examine various factors, contextualizing the new proposal in the market in which it is placed, without clinging to the moment in which it originally came out. It may happen that the remake or conversion of a great title can receive a different evaluation than the original one: this is the case of this edition of Radiant Historia, which arrives for the first time in Europe with the subtitle Perfect Chronology. Atlus' JRPG, which revolves around time travel, was released in 2010 in Japan and was able to stand out in a library - that of the Nintendo DS - which was overflowing with Japanese RPGs thanks to an intelligent storyline and well-finished gameplay. We must admit that the decision to convert it now, in what we could define as the moment of sunset for the Nintendo 3DS, surprised us a little, but as they say... better late than never. Those who have time don't wait for time It is important to underline that Radiant Historia: Perfect Chronology is not a remake, but an improved conversion in several respects among which, however, the technical one does not stand out. If praise is wasted on the splendid soundtrack composed by Yoko Shimomura (Kingdom Hearts, Final Fantasy XV), the same cannot be said for the graphic sector which has remained substantially unchanged and overwhelmingly recalls its origins, which were already decidedly ~old school~ at the time of the original launch. Not that there's anything wrong with that colorful and carefully animated bitmap that mixes with the polygonal scenarios, but perhaps it would have been appropriate to at least rework on the graphic effects, especially in combat, which already seemed rather antiquated in 2010. Atlus, on the other hand hers, took care to replace the illustrations depicting the various characters during the dialogues: the new high-resolution artwork by Masaki Hirooka is not bad, but unfortunately they seemed a bit too generic and the pencil of the previous artist, Hiroshi Konishi , maybe it suited the atmosphere of the game better. Worst of all, they're available to download as paid DLC - which, frankly, we found chilling. On the gameplay front, however, the developer has made more appropriate changes and balances, but above all has added a completely new subplot that allows you to revisit some important points in the story to discover new implications. Radiant Historia, in fact, tells the misadventures of Stocke, a kind of secret agent of Alistel, a kingdom afflicted by a progressive desertification of unnatural origin which seems to be caused by the Granorg empire. During an important mission, Stocke finds himself in his hands a magical book entitled White Chronicle: our protagonist thus acquires the ability to travel through time and reach certain crucial moments in history, in which one choice rather than another can involve a totally different evolution of events. Accompanied by a band of captivating and well-drawn supporting actors, Stocke will have to travel back and forth between timelines to prevent the war from reaching a catastrophic end. In other words, we may have to go back in time to save a certain character, thus splitting the timeline into two paths: in one he will have survived and will help us continue the adventure, in the other we will be stuck forever. During our wanderings we will come across numerous enemies. The battles take place in turns on an isometric grid, but there are two very peculiar elements that characterize them. First of all, the player can manipulate the order of actions by exchanging the turn of one of his characters with that of another companion or even an enemy, in order to favor the execution of real combos. Furthermore, it is possible to ~move~ the opponents themselves with the special abilities of our heroes, approaching them to hit them with an area attack or separating them to weaken them individually. Essentially, the player must carefully manipulate both turn order and enemy placement to gain maximum advantage; this system grants an exquisite strategic depth to a deceptively simple but very creative combat system. Intending to make this edition attractive to as many players as possible, Atlus has implemented three difficulty levels aping Intelligent Systems and Fire Emblem, but the result leaves something to be desired. Leaving aside the intermediate level, which would be the original one, and a new very high difficulty level for JRPG veterans and experts, the Friendly level would have toought to be thought better: in essence, it allows you to avoid any fight simply by hitting enemies with Stocke's sword. If in other settings this grants initiative in battle, at Friendly difficulty the enemy simply disappears into thin air and the player gains experience points and loot as if they had faced them in the field. In this way, the player who decides to resort to this trick ends up transforming Radiant Historia into a kind of visual novel. On the one hand, it is a system that allows you to avoid fighting in already explored areas, especially when retracing some time points, but on the other hand, we would have preferred a better compromise or, more simply, the possibility of changing the level of difficulty to any time, which cannot be done. In any case, Radiant Historia is a balanced and permissive title: it's just a pity that it hasn't been localized in Italian: on balance, the English language could be the most difficult opponent for those who don't know it well.", "date": "2018-02-17", "grade": "8.0"}