{"name": "La recensione di Disc Drivin 2", "ref": "https://multiplayer.it/recensioni/195248-disc-drivin-2-la-recensione-di-disc-drivin-2.html", "text": "In a market that moves at very high speed like the mobile one, the case of Disc Drivin' 2 is more unique than rare: the original title (of which you can read our review) even came out in 2011, and in all this huge period of time the developers of Pixelocity have only produced Danger Boat, a game that certainly has not entered history. It will be said that patience is the virtue of the strong, but if seven years to make the sequel to a very simple mobile game is not something in the Guinness Book of Records, we are close: also considering that the starting material was not exactly nuclear science, given that Disc Drivin' was a very basic title both in mechanics and in construction, for this sequel with such a long gestation period it is reasonable to expect great things ... or maybe not? There are no more discs than once At first glance, little or nothing seems to have changed in Disc Drivin' 2, or at least they are not the changes one would expect from a sequel that arrived seven years later from its predecessor: the graphics and interface have been improved but not revolutionized, the sound is always reduced to a minimum, the horrible two-dimensional backgrounds still make their sad figure and it has even been inexplicably removed the text chat for online games. In short, not a fairytale introduction ticket, even if for a title like Disc Drivin' 2 the elements of interest are decidedly different and all revolve around the gameplay: however, even here it's not all roses and flowers, and the commendable intent of Pixelocity to shuffle the cards a bit collides with not always happy decisions and a decidedly clumsy insertion of dynamics related to in-app purchases. But let's go in order. The sense of the game remains that of pushing one's puck along paths bristling with obstacles, trying to cross the finish line by beating the opponents or the stopwatch: compared to the first chapter, the presence of updated physical routines is positively noted, and the persistence about the old camera problem that you can't rotate to see where you're going. The novelty with the most impact on the gameplay, however, is related to the fact that now the launch can be modified with a second intervention, capable of both correcting and prolonging the trajectory of the puck: a feature which, if on the one hand adds dynamism to the games, on the other it undoubtedly takes away some pathos, in fact almost decriminalizing mistakes. Even the management of power-ups has undergone a complete upheaval in Disc Drivin' 2: instead of immediately making them all available, the developers have decided this time to equip the user only with nitro, making all the other tools (old acquaintances inherited from first chapter but also new entries) that can be unlocked after reaching certain levels with experience points to be accumulated by trying your hand at the various modes. It must be said that the progression is quite rapid, but a certain disappointment remains for a mischief that we would have gladly spared ourselves and which greatly limits novice players. A welcome novelty is instead represented by the so-called Disc Abilities, real passive skills that can be activated for a single game and which guarantee the most disparate bonuses: there are 53 to choose from, an element that adds a pleasant layer of depth preparing for a competition. In the constant swing between more or less good ideas, Disc Drivin' 2 takes a nosedive when it comes to the introduction of an internal economy to the game, with a free to play model that makes you regret the good old prequel. The coins given out as a result of the competitions are used to buy cards with which to unlock power-ups, skills or new designs for your disc, in a mechanism not too dissimilar from the much reviled prize boxes; however, this currency is also required to be able to create personalized games with one's friends, and it is a real low blow capable of pushing the user to turn to the coin packs offered for sale in the appropriate in-game shop. app, in a product that is not stingy with advertisements. Opportunity makes the thief, and Disc Drivin' 2 seems to have made this proverb his own: too bad, because there's no shortage of content, with 16 well-crafted tracks and all the multiplayer modes of the prequel (online, locally or pass and play up to 8 players) with the addition of two different types of challenges to be tackled single-handedly to collect coins even in your spare time.", "date": "2018-02-17", "grade": "6.5"}