{"name": "La recensione di Fe", "ref": "https://multiplayer.it/recensioni/195161-fe-la-recensione-di-fe.html", "text": "The announcement of Fe, which took place during EA Play in 2016, had left us a bit dumbfounded. In fact, we are talking about a very different project from what Zoink! used to us, that is, titles characterized by a peculiar graphic style and by a humor that is as bizarre as it is effective, such as Stick It to the Man! and Zombie Vikings. The Swedish development team, which recently merged with Image & Form to give life to Thunderful, therefore wanted to demonstrate that they know how to juggle even with different genres and forms: a great test of courage, when authors come out of the own comfort zone to face challenges with an necessarily uncertain outcome. Well, after completing Fe in about six hours, but leaving behind several collectibles, we can say that the experiment is absolutely successful. The enchanted forest Fe is one of those titles that communicate through images, without tutorials and dialogues but absolutely rich in atmosphere and fairly clear contaminations, which seem to have their roots in the works of Studio Ghibli, but not only. The game puts us in command of a small black creature, witness to a sudden change in the large forest in which it lives: a horde of disturbing silent creatures have made their appearance, starting to capture animals and attack some huge gods, threatening the same tree of life. Its branches form the foundations of the nine areas that make up the open world that we will have the task of exploring, in order to collect objects, free animals and acquire their verse to obtain a total of six different powers. The voice is in fact a key element in Fe, it is no coincidence that great emphasis is given to the moment in which the protagonist manages to communicate with a creature, ~tuning~ the respective frequencies through the delicate and gradual pressure of the right trigger. The gift that the character receives from this instant of communion changes according to the animal: obtaining the yellow stamp allows you to make plants bloom and collect their explosive core, to be launched against Zelda-style barriers and prisons, as well as to ride on the back of huge birds to reach otherwise inaccessible areas; the purple one instead allows you to take advantage of certain flowers to project upwards, while the orange one gives you the ability to glide and to make plants blossom capable of creating updrafts that push us into the air. We don't want to anticipate the nature of all the unlockable skills, it is enough to know that each one has a specific function very well embedded in the structure of the adventure, which in these situations almost takes on the characteristics of a metroidvania. Genuine emotion moment That the boys of Zoink! have been inspired by the works of Studio Ghibli appears quite clear in certain moments, for example when you find yourself in the presence of the enormous deity of deer, although in truth speaking of ~deer~ is incorrect: the animal species present in Fe are bizarre crossings of pure fantasy, after all they inhabit an enchanted forest that has very little to do with a real scenario. However, we were saying about the divinity: when we find it chained, our task becomes that of freeing it by reaching the energy terminals of the ~chains~ that keep it confined in a specific perimeter. At a certain point, however, we will have to use our ability to glide and climb trees to get on the back of this gigantic creature, being careful to move on the shrubs that grow on its legs and sides when it has finished performing one of its huge steps. It is a magnificent sequence, perhaps the most inspired of the game, capable of conveying great emotion and enhancing the magnificent world created by the developers for the occasion. To contribute to the general atmosphere, however, there is also a majestic audio sector, characterized by a careful and punctual direction, with literally thrilling orchestral music at the end and, in general, sounds that have the rare ability to elicit smiles, when combined to the many funny creatures we will have to deal with during the adventure. Playstation 4 trophies The thirteen Trophies of Fe are obtained by completing specific actions for the first time and of course by completing the game, but also by giving vent to one's ~completitionist~ vein. In fact, there are achievements related to the collection of all objects, the execution of very long glides, the liberation of certain animals and so on. Is everything as it should be? In stylistic terms Fe is an absolutely successful product, capable of showing us a fascinating forest, with evocative landscapes, full of creatures distinguished byto a convincing design. Apart from some missing transition animation, highlighting the ~semi-indie~ nature of the project, and some drops in frame rate that occur at specific moments, everything is exactly in its place and the authors were able to use the shades chromatic in an intelligent way, without basing the characterization of the different areas that make up the vast scenario only on this aspect, as mentioned, of the open world type and without loading in the transition from one section to another. Wanting to nitpick a bit, we could say that the early stages of the game struggle to mesh, giving rise to mixed sensations which, however, disappear as the hours go by, giving way to a consistent degree of satisfaction. The appearance of the enemies, the mysterious Silent Ones, represents the icing on the cake: they are disturbing creatures, who walk slowly observing the environment with their only eye, from which a lethal ray can start when they spot us. Interestingly, they can also move quickly, spreading out and moving their limbs like spiders. We said they're creepy, didn't we? The stealth component dictated by the presence of these opponents, which we cannot defeat except by exploiting the support of certain animals, is not explored much and is mostly basic, but this does not weigh in any way compared to the enjoyment of the experience , which, moreover, is not even punitive: at every possible game over we start again from a checkpoint very close to the area in which we were eliminated.", "date": "2018-02-16", "grade": "8.5"}