{"name": "La nostra recensione di Monster Energy Supercross", "ref": "https://multiplayer.it/recensioni/195015-monster-energy-supercross-the-official-videogame-la-nostra-recensione-di-monster-energy-supercross.html", "text": "Milestone needed to make a qualitative leap that would allow it to compete on equal terms in a demanding market. We're not just talking about pure gameplay quality, but rather about visual impact and that graphics engine that for too many years now seemed to have reached its peak, failing to offer a performance of absolute value. With the acquisition of the Unreal Engine 4 license, things have finally changed and this Monster Energy Supercross - The Official Videogame is one of the very first experiments to arrive on our consoles by taking advantage of the new technology. We always talk about motorcycles and engines and, aware of the care that Milestone has always put into the reproduction of tracks and vehicles, we were really curious to find out how the new technical implementations would change the racing games dedicated to two wheels developed in our beautiful peninsula. The biggest doubt was to find out how Milestone would use his new ~great powers~, if only to throw smoke on the track or if to give that extra impetus to a gameplay that also needed a good dusting. How did it end? We tell you in the next lines! Career, best times and a lot of mud The game modes are not overflowing with opportunities: there is the possibility of choosing a single track for training, setting time records through the time attack mode, making a simple championship or jumping into a basic career, which will take you from the debut on a 250 up to compete with the top seeds in the 450 category. There is obviously the option to create your own rider from scratch by choosing the team and then start earning credits by winning races or, much more simply, satisfying the requests of the various sponsors who will push themselves to get you to stick their decals on your bike. In fact, the entire management of sponsors and prizes seemed a bit too simplistic, with the houses ready to give money and rewards based on our placement, obtaining better sponsors and rewards simply by leveling up during the various championships. There is no real correlation between victories and external investments and, in general, the entire career seemed less well-groomed than what we have seen in other games from Milestone itself. We certainly didn't expect something like Valentino Rossi The Game, but let's also say that even the careers of the most recent Moto GPs gave the impression of being more complete. The management of the team and the bike thus becomes only a miserable pretext, a light stimulus to continue the climb to success, leaving room only for the player's desire to race in series on all the various circuits and beat an artificial intelligence that becomes increasingly aggressive and stubborn. Alas, the AI is chameleon-like, transforming into an aggressive lion suddenly only to be overtaken on a tight curve with almost no fight the next instant, impassive as we speed past him. The other problem, where there is ample room for improvement, is the automatism of the behavior of the various drivers, structured in an identical way for each racer, giving the idea of having only soulless automatons next to them, all programmed to race in the same way. In short, we would like to see more personalities on the track, perhaps knowing that Zach Osborne is more determined and aggressive in corners than Jordan Smith and so on. On the other hand, here we are talking about Supercross and not the usual Motocross seen in recent years. Playstation 4 trophies Monster Energy Supercross - The Official Videogame truly has tons of trophies to unlock. To be precise, there are fifty cups to win, even if most simply ask to bring home the top step of the podium in every single race. There are also rewards for completing the career, for using the track editor and for accumulating in-game credits, which can be acquired simply by playing. In short, a good amount of hours awaits you if you want to platinum the production, but nothing too difficult or impossible. From rain to stadiums So what changes from the old iterations of the series? Meanwhile the game system: despite having been inherited from MXGP it has been heavily revised to be adapted to more dangerous and difficult tracks and circuits. In fact, the show in Supercross is always put in first place, with the tracks filled up to the neck with jumps, tabletops and whoops rigorously put in series to let the riders taste mud and kickbacks. The driving style then changes, with greater attention to be employed before the hairpin bends as you fight shoulder to shoulder with the other participants. In the game, everything translates into a greaterneed to adequately exploit the weight shifts of bikes and riders, a simple and effective task with the mapping proposed by Monster Energy Supercross. The bike is controlled perfectly, it is possible to set up curves and jumps perfectly and also the control in the air for executing the scrub is perfect. It is when you land that you turn up your nose a little, with recoils that are sometimes too mild and a system of collisions with other pilots that still leaves too much to be desired. On the other hand, we were very happy with the terrain, extremely realistic and with a good depth of the ruts, another old problem of the MXGP series which seems to have made good progress here. We are not yet at the levels of excellence given that there are no real depressions that can be seen at the end of the race after a Supercross session but it is still a good starting point. Finally, the plays of light, the revival of the stadiums and, as mentioned at the beginning, also the animations in the saddle of the pilots and their two-wheeled racing cars are excellent. On the other hand, there is a lack of animations designed for falls and impacts, a serious defect that causes a lot of immersion to be lost and which Milestone has been dragging around for far too many years now. Our hope is that now that the new engine has arrived and that the base is solid, we will start working hard and hard on these issues. Infinite longevity If the full Supercross championship license isn't enough for you, know that you can still try your hand online with other virtual riders and, above all, throw yourself headlong into the huge editor that Monster Energy Supercross makes available to you. Here you can choose the type of stadium and the complete shape of the track, with an engine for creating the track that is really elementary to use and extremely immediate. The interface is practical and it won't take more than ten minutes to build a good track, including the obligatory test by the artificial intelligence that will validate its online use. An amazing addition to such a game. We close our review of the Milestone product talking about the available cameras, which are becoming a trademark of this kind of titles: if in Valentino Rossi the view from the internal helmet was fully successful (but also a little uncomfortable), Monster Energy Supercross opts for something in between with the shape of the helmet but with a fixed camera, focusing on dynamism with that from the handlebars, incredibly engaging in this kind of game.", "date": "2018-02-13", "grade": "7.0"}