{"name": "La recensione di Dissidia Final Fantasy Opera Omnia", "ref": "https://multiplayer.it/recensioni/194673-dissidia-final-fantasy-opera-omnia-la-recensione-di-dissidia-final-fantasy-opera-omnia.html", "text": "Obviously it is no coincidence that Dissidia Final Fantasy Opera Omnia arrives in the West right now, one year after the Japanese release: in fact, the most recent incarnation of this spin-off series, initially born in the arcade, is also coming out these days and finally brought to PlayStation 4 after the long gestation of Team Ninja. However, unlike the console counterpart, Opera Omnia is not a brawler or a fighting game, but a role-playing game belonging to the ~gacha~ category such as Final Fantasy: Brave Exvius or Fire Emblem Heroes. With the latter, then, it shares the premise: the heroes of the various chapters meet and collide in an interdimensional world, in a kind of impossible crossover. The usual story full of microtransactions? A completely free Cloud Opera Omnia is set in the dimensional plane that was once presided over by Cosmos and Chaos, now supplanted by two new entities called Spiritus and Materia, and that is the same ones that manifested themselves to the heroes and villains of Dissidia Final Fantasy NT. The inexplicable appearance of numerous monsters convinces Materia to entrust a Mog with the power to call for help the greatest heroes of the multiverse, and so we find ourselves recruiting characters of the caliber of Cloud, Terra, Tidus and so on, wandering around a map composed of various nodes that are unlocked as we go and watch a new cutscene or defeat some enemies in battle. In fact, unlike the usual gachas, this Opera Omnia does not entrust the recruitment of heroes to chance: the protagonists and supporting actors of Final Fantasy will join us automatically, continuing in the story or completing the special missions published occasionally. The ~fishing of fortune~ instead controls the equipment of our pets, a weapon and an accessory marked with a number of stars that indicate their rarity and power: these objects improve the statistics of the characters and in some cases give them abilities special. Also, you can consume unwanted items to upgrade others. Improving your equipment and leveling up isn't enough though, because each character has unique characteristics that make them more or less suitable for certain fights. The Warrior of Light can protect teammates with a barrier, Tifa deals more damage to skeletons, Y'Shtola's magic slows down, and so on. The clashes take place in turns; even if the outcome can be entrusted to an automatism, one soon realizes that some battles must be faced in a more strategic and thoughtful way. Opera Omnia is a Dissidia, therefore the peculiar system based on the alternation of normal attacks and HP attacks comes into play: the former charge an indicator and the latter discharge it, reducing the maximum health of the targets by the same amount. However, we must be careful, because by consuming this indicator our characters remain defenseless and enemy attacks can affect their health. Strategically the right way, Opera Omnia's battles are reminiscent of those of a real JRPG, even if they tend to be repetitive in very long game sessions: good or bad is all there is to do in the game, between story missions and secondary objectives that can also be played cooperatively with other connected users. Beyond the gacha mechanics, to be evaluated over the long run given that crystals are accumulating at the moment - the currency necessary to draw weapons - as if it were raining, as often happens at the launch of a new title of this type, it must be said that Opera Omnia it is a well packaged product, very colorful and full of details. The various characters are well represented through a ~super deformed but not too much~ style, even if what struck us was above all the beautiful soundtrack, full of famous remixes and exciting songs. In the hours we have dedicated to the app, we have never felt the need to resort to the infamous microtransactions, managing to fish weapons of exceptional quality with only the crystals accumulated by playing the campaign: the latter, in fact, does not consume the usual indicators when reloading that limit the use, relegated instead to slow down the progress in the secondary activities which mainly serve to collect upgrade materials and increase the level of characters.", "date": "2018-02-06", "grade": "8.0"}