{"name": "La recensione di The Room: Old Sins", "ref": "https://multiplayer.it/recensioni/194584-the-room-old-sins-la-recensione-di-the-room-old-sins.html", "text": "It is clear how Fireproof Games has drawn the classic wild card with The Room. The series of puzzle-based adventures born in 2012 on mobile devices and later also appeared on PC has in fact immediately enjoyed great success among the public, basically thanks to the remarkable production values and the convincing adaptation of non-original mechanics to the touch interface of smartphones and tablets. Basically everything revolved around complex ~boxes~ with which to interact in a tactile way, activating mechanisms and solving puzzles. The result was a product capable of exceeding 6.5 million copies sold, an even more remarkable achievement considering that we are talking about a premium-priced game in a market in which it is very difficult to convince users to put hand to the wallet, if not through in-app purchases. That successful debut was followed by two further episodes with the last one, The Room Three, which ambitiously expanded the gameplay components by adding a strong exploratory element to the basic formula. With this fourth release, subtitled Old Sins, the English developer seems to have wanted to take a small step back from this point of view, returning to the more restricted environments of the beginning. The Dollhouse Let's be clear, this does not mean that The Room: Old Sins is a scale back of the ambitions of the series. On the contrary, Fireproof Games seems to have wanted to listen to the requests and criticisms of the fanbase, fond of the approach of the beginnings rather than the ~Myst~ solution of the third chapter. So here in Old Sins we return to face a single puzzle within a single room, even if much more complex and elaborate than its predecessors. In fact, the setting is that of a mysterious and gloomy attic, inside which a large dollhouse is kept. In reality, the latter is the absolute protagonist, given that it is on it that the player's attention will have to be concentrated. The brief initial tutorial explains the simple commands, which obviously, in a similar way to the past, exploit the capabilities of touch screens as much as possible: therefore, with the now classic movement of the two fingers, you can focus your attention on a detail or move away to take a broader look at the situation. Each area of the house can hide a secret or enigma to be solved, and this almost always happens through manipulation of the environment: by swiping the fingertip you can rotate dials, press switches, move mechanisms, pull levers and anything else that can come to mind, with a strong tactile interaction component which is undoubtedly the most interesting and peculiar aspect of the entire Fireproof Games series. The quality of the puzzles is almost always remarkable, with a very rewarding ingenuity of the situations that makes the progression engaging and challenging. Among other things, the presence of a single large object on which to act, the doll's house, is in reality far from limiting: not only for the size of the manor, which truly offers puzzles on which to act at every corner, but also for the discovery of rooms in which one can literally enter through a magical device. Obviously, other puzzles are placed within these, and the particularly frequent need to collect objects elsewhere in order to be able to solve them creates a connection between the various areas which gives an absolutely remarkable sense of cohesion. Finally, from a technical point of view, The Room: Old Sins reiterates the qualities of the previous ones, slightly improving the final result: what follows is a pleasant game to watch, with an excellent level of detail and a satisfactory general quality, even if the need making it compatible with as many generations of devices as possible inevitably forced us to make some compromises, especially as regards the quality of the lighting and effects.", "date": "2018-02-03", "grade": "8.5"}