{"name": "La recensione di Genital Jousting", "ref": "https://multiplayer.it/recensioni/194374-genital-jousting-la-recensione-di-genital-jousting.html", "text": "How can you not adore Genital Jousting? On the one hand, his foul mouth takes us back to the dawn of the videogame medium, when there were no limits dictated by the market and everything was allowed, especially in the field of personal computers; on the other hand, it's impossible not to immediately feel sympathy for a game that puts us at the controls of a penis, giving us the goal of penetrating the anus of other penises. It's just a pity that the enthusiasm lasts ten minutes, the time for coitus. Developed by Free Lives, the same team of the excellent Broforce and the excellent Gorn, Genital Jousting spent a few months in Early Access (starting from November 2016), before being launched in a definitive version in this strange beginning of the year , complete with a single player narrative campaign unpublished to surround the multiplayer modes (online and local). At first we didn't want to believe it: a narrative single player campaign? But if the protagonists of the game are big penises aiming to penetrate each other... what story will we ever be told? Predictably, the plot of Genital Jousting is a concentrate of absurd situations that develops through a series of mini-sequences that are coherent with each other. In the role of a male penis with self-esteem problems named John , we will have to try to make a career and find love, before attending a reunion between old school friends. Obviously the paradoxical implications are not lacking, just as there are amusing sequences, such as that of the vibrator test or a romantic scene made up of splashes and broken glass. What do we players do in these sequences? We listen to the narrative voice and move the penis (the one on the screen, we recommend), making it perform some very simple tasks that are described in the lower part of the screen. Don't expect who knows what, because usually it's enough to go from point A to point B, or grab some object, either with the glans or with the anus, to resolve the situation... also because the protagonist has no other forms of interaction with the world around him. After all, it's a penis, let's not forget that. The adventure lasts a total of an hour and a half and, rather than engaging with its story, ordinarily metavideogame, it entertains with some nice skits that put John in situations that are stereotyped but which, experienced from the point of view of a penis, are undoubtedly funny. It is also undeniable that it has a deeper underlying theme than it might seem, given that it attempts to reflect on life's failures, starting from school failures, as well as on the uselessness of choices in video games, choices which in fact are only alternative paths created by the developers to give us an illusory sense of freedom. Of course, given the actors, it is difficult to take seriously some moments that would pretend to be dramatic, but do not think that the problem is only in the representation. Much worse is the game system, which never accompanies it as it should. And in multiplayer? In addition to the narrative campaign Genital Jousting offers several multiplayer modes, which give their best when playing with some friends live. If desired, it is also possible to play online, but by now there are very few active players on the servers, so evaluate your social condition well before deciding to buy it or not. There are three multiplayer modes: Party, in which up to eight participants compete in various mini-games (a kind of Pong, a weight contest, a race among the stars in search of clouds and planets to penetrate, and so on) trying to win five; Traditional, in which up to eight players must try to penetrate each other, getting longer from level to level by accumulating points (the ultimate goal is to exceed a set length); Date Night, where two users have to perform different activities together to find love (pick flowers, go bowling, have a picnic, and more). Regardless of the modality itself, Genital Jousting does its duty when it becomes pure chaos, that is when the penises start to twist, penetrate and spray ... the problem is that all this entertains for a few minutes and then we inevitably end up switching to other. As we said, more than a game Genital Jousting seems like a joke and the beautiful and sinuous animations of the penises or the emergence of some strategy after a handful of games can do little to get this impression out of our heads. Mind you that it is not only a matter of repetitiveness, but of consistency, a feature that is almost completely missing from the title of Free Lives.", "date": "2018-01-30", "grade": "5.5"}