{"name": "Dragon Quest Treasures", "ref": "https://multiplayer.it/recensioni/dragon-quest-treasures-recensione.html", "text": "Like many RPGs, Dragon Quest has also had its spin-offs, and among the titles that have followed one another over the years, those focused on the colorful bestiary of the series - edited, as always, by the mangaka Akira Toriyama - are undoubtedly the most appreciated. Dragon Quest Treasures isn't exactly the new Dragon Quest Monsters: Joker that many expected, but with a cast like that of Dragon Quest XI, the spin-off practically wrote itself, and the idea of putting Erik and his sister Mia as protagonists , many years before they met the Bright One, was a stroke of genius. Nonetheless, we started our game with a touch of skepticism, and in our review of Dragon Quest Treasures we will explain what made us change our minds after the very boring initial prologue. Treasures and monsters Dragon Quest Treasures tells an adventure of Erik and Mia when they were children The prologue of Dragon Quest Treasures sets up the narrative of this spin-off, telling us how Erik and Mia ended up in the floating archipelago of Draconia after finding two magical daggers that allow them to communicate with monsters. Armed with this power, and the ability to sense nearby buried treasure, the two children form a brigade of their own with the goal of finding the Seven Dragon Gems - no, seriously! - before the other treasure hunters to restore peace in the lands of Draconia... and maybe become filthy rich at the same time. A plot that is a pretext, stretched a bit too long in a prologue that serves to establish the characters, rivalries and gameplay basics through a myriad of skits and dialogues that will strain the nerves of those who just want to play. The authors have watered down the characteristics of Erik and Mia, who are not yet the known swindlers in Dragon Quest XI: it should be noted that fans of the splendid Japanese RPG will only find them in this story, which practically does not relate in any way to the title original... if not for the music, which is exactly the same composed by Kichi Sugiyama for the eleventh chapter and for every other previous Dragon Quest. The more passionate, however, will recognize in the treasures unearthed by our heroes a riot of quotes and references to all Dragon Quests, including statues depicting iconic characters and monsters, reproductions of weapons and armor, artifacts and so on. Each treasure has a specific value, which depends on its quality and rarity: the overall count increases the rank of Erik and Mia's brigade, and the trick of the gameplay lies right there, the mechanism that transforms Dragon Quest Treasures into a small but unstoppable addiction . Once the aforementioned prologue is passed, in fact, a world opens up to be explored freely. To hold back the player there are only the passages that require specific movement skills and the level of the enemies, which can still be circumvented with a little skill, but basically it is possible to choose an island of the archipelago and immediately explore it in length and wide. The geographical structuring of the maps is remarkable. Each island represents a biome - the desert, the snowy mountains, the countryside and so on - and develops both horizontally and vertically. The monsters' abilities, such as gliding or throwing, help the player reach the different places, but there is no linear progression to be respected, since the abilities are all available immediately: you just have to get them. Dragon Quest Treasures, you can recruit almost any monster The story immediately entrusts Erik and Mia with a couple of little monsters, but the others will have to be convinced with a beating: by defeating an enemy, there is the possibility that he will propose himself to the brigade in the appropriate recruitment screen. At that point, we will only have to spend the required materials to annex the monster to the brigade and add it to the team, which is made up of Erik or Mia - we can choose who to control at the base, it being understood that there is no gameplay difference between the two or narrative - and up to three monsters. While there isn't a huge variety of monster families, each variant has different elemental vulnerabilities or specific spells or special hits, such as the Dragon Attack, a sort of super move that depletes the meter under Erik/Mia's portrait and hits all enemies in area. Choosing the right monsters is important not so much for their combat or movement skill kit, but also and above all for their perception skills that help to better find the hidden treasures in the islands. And this is where the Treasurer comes into play. Dragon Quest Treasures, the Treasurescope helps locate the rarest treasures If the monsters you take ushooks below are compatible with the treasures perceived on the island - a value that changes every time we return to the base - then we will find the less rare chests simply by sight. But in the event that there is a rare treasure nearby, the monsters will warn us to use the Treasurescope, an artifact that indicates the direction in which the chest is present and which triggers Monstrous Visions: in practice, take a picture from the perspective of each monster, and it will be up to us to triangulate the position of the precious to go and dig it up. It's an interesting dynamic - even if it could have been more intuitive and flowing - that is only the prelude to the gameplay loop, because at this point we have only scratched the surface of Dragon Quest Treasures. Up and down Draconia Dragon Quest Treasures, the Land of Behind is a snowy region Indeed, it surprised us that Dragon Quest Treasures combines a myriad of mechanics and features in a completely organic way, in a sort of irresistible assembly line. Let's take these blessed treasures: once collected, we will automatically entrust them to our monsters, who however can only carry a certain number each, and that number depends on their size and type. Not only. If a monster is defeated in battle, or hit by a stunning attack, it could drop the chest, which we will have to rush to get back before someone steals it from us. If Erik or Mia then finish KO, it's Game Over. And if, alternatively, we decide to return to the base with the emergency retreat, all the collected chests are lost: the only way to bring the loot back home is to make it on foot - and in this case the railway stations to be restored in the different ones help a lot. regions - or consume the traditional Chimera Wing. It's not over, because the brigade conquers new functions with each rank achieved, but at the same time it also finds itself facing new challenges. At some point we will also have to deal with the rival brigades, who will literally hunt us down as we explore Draconia, between ambushes and chases in which we will have to defend our treasure chests tooth and nail. Dragon Quest Treasures, the Glide helps to reach distant places and not to crash on the ground Fortunately, we will be able to count on various features, such as the canteen, in which we will prepare delicious delicacies that can temporarily enhance our monsters, or the armourer, who will make slingshot projectiles for us with the materials we have collected around Draconia. The slingshot is a very useful tool that you will tend to ignore in the first hours of the game, but which becomes more and more important as the adventure progresses. The combat system is in fact very simple. We control only Erik or Mia, who can chain together a stabbing combo, dodge with a decent invulnerability range somersault, or steal enemy items through a basic mini-game. Our monsters are controlled by a decent artificial intelligence, and at most we can order them to gather, attack a specific target or launch their Dragon Attacks. The slingshot, accessible via a combination of keys that allows you to hook targets easily, allows us not only to heal our monsters when necessary with specific projectiles, but also to control the battlefield using ammunition that paralyzes, stuns, puts to sleep , poison, or deal various elemental, direct, or splash damage. Dragon Quest Treasures, the slingshot is a very useful weapon especially against bosses As immediate as they are, the fights in Dragon Quest Treasures - which are not turn-based, but you will have already understood this - manage to be quite engaging, especially if you face higher-level enemies of the group. Which is not so impracticable: using the right bullets and monsters, and dodging if necessary, it is possible to knock out much more powerful enemies than Erik, and annex them as they are to the brigade. In this way, we find ourselves wandering around with the most disparate formations, and progressing in the game according to our own pace and skill, perhaps compensating for the monsters' weaknesses with Monster Medals, the only accessories we can equip to improve stats . However, the ~campaign~ remains anchored to the growth of the brigade, which unlocks the floors of the Daedalus, a sort of gauntlet divided into floors and difficulty/level bands. Each Maze boss holds a clue that leads to a Dragon Gem, but the missions are quite complex and there are new bosses to face by implementing the most disparate strategies. Dragon Quest Treasures is full of main and secondary missions - daily or not - that we can accept and carry outwith our times and which reward us with consumables, materials or treasures, making us better acquainted with the colorful inhabitants of Draconia. Dragon Quest Treasures, the treasures depict historical characters and objects from the saga From a strictly content point of view, Dragon Quest Treasures is an impressive title: there really is a lot to do and the interface, as intuitive as it is essential, helps to identify the different missions, the distances to travel and the objectives, but sometimes one gets the feeling of being a little overwhelmed by the interlocking mechanisms, for the simple reason that they all rely on a continuous coming and going interspersed with short kinematics, loads and long treks on foot or on the back of monsters. Some missions, then, are clearly structured to lengthen the broth, making us go back and forth from the headquarters only to manufacture an object or recruit a specific monster, fueling a certain sense of repetitiveness. The problem is felt above all because, graphically, Dragon Quest Treasures trudges and not a little. The glance is appreciable, and recalls Dragon Quest XI on several occasions, but its stability on the Nintendo hybrid console is dreamed of. This kind of open world pays the price for inconsistent fluidity, a pop-in that is sometimes annoying and a camera that tends to go crazy during fights, even by hooking up to enemies. When you climb to the top of a mountain, and from there you can admire the vastness of the island we are exploring, one cannot help but think of better optimized titles such as the recent Xenoblade Chronicles 3. Absurdly, Dragon Quest Treasures is there seemed more consistent in portability than in Dock, net of a lower resolution that just dirty the image. We're not talking about who knows what disaster, in short, but surely it could have been done better. Dragon Quest Treasures, the side missions are many", "date": "2022-12-08", "grade": "7.5"}