{"name": "La recensione di Lost Sphear", "ref": "https://multiplayer.it/recensioni/194016-lost-sphear-la-recensione-di-lost-sphear.html", "text": "Square Enix founded the small developer Tokyo RPG Factory a few years ago, in 2015, to fulfill the wishes of that niche of gamers who remember the Japanese RPGs of the 90s with shining eyes. In a constantly evolving market where the distinctions between genres are becoming increasingly subtle and new technologies allow for unprecedented approaches, Square Enix felt the need to recall the past and those titles that made its brand famous: Chrono Trigger, Final Fantasy VI, SaGa and so on. I am Setsuna was the first low budget project of this small team and managed to evoke, for better or for worse, the spirit of old school Japanese RPGs. Now it's up to Lost Sphear to keep the name of the tradition high, but is the new Tokyo RPG Factory title a step forward or backwards compared to the previous one? The lost world For the avoidance of doubt, it is fair to point out that I am Setsuna and Lost Sphear have nothing in common on the narrative front: the second is a ~spiritual~ sequel to the first, set in a completely different world. Returning from a hunting trip, Kanata and his friends Lumina and Locke find their country has disappeared into thin air, replaced by an intangible white mist. Kanata, who has been having strange dreams lately, somehow has the power to materialize memories and restore everything that disappears due to this unexplained phenomenon. Determined to help anyone in need, and to find out why he has obtained this great power, Kanata leaves for the capital and enters the good graces of the Empire but, as often happens, he will soon realize that the situation is much more complicated and that rebels who oppose the Emperor perhaps have their own valid reasons for doing so. The plot of Lost Sphear follows and surprises with some interesting twists in the final stages, but over the thirty hours needed to complete the game it struggled to win us over, probably thanks to the great linearity, some triviality at the narrative level - corrupt imperial stereotypes really are the death of fantasy - and a script that relies on long silent dialogues, completely in English and without portraits or illustrations to create the slightest empathy for the characters. The dubbing (in Japanese) is in fact exclusively limited to the fights and the slow pace of the narrative rarely manages to capture the player's interest in a much less original story than the one proposed in I am Setsuna. Compared to the latter, however, Lost Sphear enjoys a much more varied and colorful setting - we remind you that the previous Tokyo RPG Factory game was set in an almost completely snowy region - and much better characterized characters: apart from Kanata , the typical good and selfless protagonist, the supporting actors more or less all stand out and form a versatile and interesting cast. Playstation 4 trophies Lost Sphear offers 2 gold, 8 silver and 39 bronze trophies that unlock the platinum trophy. Most are obtained almost automatically, by overcoming certain obstacles in the story, while others are conquered by meeting certain requirements in combat or by performing specific actions, such as spending or accumulating money. Not to be forgotten The Lost Sphear demo hadn't convinced us much, but now we know that it was actually a glimpse of the game extrapolated around the first five or six hours of the adventure, shortly after Kanata and the others have recovered the first Vulcosuit. Unfortunately, the final version of the game confirmed some concerns we had about the technical sector, which actually turned out to be low budget and perhaps a little neglected, especially in the creation of the ~dungeons~, formed practically only by rooms and corridors to connect them. and in the composition of a forgettable and repetitive soundtrack. The character models are an exception which, despite the low polygon count, show off convincing animations especially in the clashes, when they use their special attacks. The mechanics of the game, obscured in the demo by the almost total lack of tutorials or explanations, turned out to be simpler than expected and offer an interesting point of contact between period RPGs and modern ones. Characters learn spells and attack skills by equipping accessories called Spritnites that are found around or bought in shops. So far there is nothing really original, but it is possible to associate additional Spritnite to those already equipped to infuse additional bonuses to the skills. In the first hours of the game it isof an accessory and negligible mechanism, but later it becomes very important to manage both the assignment of the Spritnite and the possible upgrading of the equipped weapons and armor in a more prudent way, also because the various bosses are really very tough. We cannot say that we appreciated these peaks in the level of difficulty, perhaps excessive at times: the enemies are essentially located in precise points of the maps and often do not regenerate, so it is almost always impossible to level up the characters at will - there are no random encounters as you explore the world map - and defeat bosses with brute force. The combat system in Lost Sphear is actually very tactical and revolves around the positioning of the characters and enemies on the battlefield: it takes place in turns, like in I am Setsuna or in any Final Fantasy with Active Time Battle to be clear, but characters attack areas that change depending on the skill chosen, so it is possible to hit multiple enemies at the same time. In this sense, we are also met by the so-called Momentum system already seen in I am Setsuna. Every certain amount of time, our characters gain an extra attack that we can launch by pressing a key at the right time, and it's up to the player to decide how many opportunities to accumulate and when to unload them, especially taking into consideration the fact that some Spritnites grant special bonuses upon activation of the momentum. Kanata's power also allows you to materialize artifacts in some points of the world map, influencing the surrounding area with specific bonuses, but unfortunately certain artifacts soon prove to be much more useful than others that we tend to never use. Finally, Lost Sphear introduces mechs called Vulcosuits to combat and exploration. With the press of a button you can don these steampunk armors and destroy obstacles or face enemies with a nice bonus to the main stats. Some Vulcosuits enhance certain spells while others unlock powerful combo attacks like Chrono Trigger's now iconic X-Slash. Actions performed with Vulcosuits, however, consume a shared gauge that can only be recharged by sleeping in inns or using some expensive items, so it is important to choose the right moment to wear them. In other words, though, you end up saving the Vulcosuits for boss fights to make them less frustrating, and it's naiveties like this that counterbalance Lost Sphear's good ideas.", "date": "2018-01-23", "grade": "7.5"}