{"name": "The Inpatient: la recensione del prequel di Until Dawn", "ref": "https://multiplayer.it/recensioni/194075-the-inpatient-the-inpatient-la-recensione-del-prequel-di-until-dawn.html", "text": "For Supermassive Games, the release of Until Dawn marked only the beginning of a journey that has led this development team to tie up with its cinematic horror for the realization of other projects. The Guildford-based team have also embraced PlayStation VR technology early on in their work, featuring among the names that helped launch the virtual reality headset with Until Dawn: Rush of Blood. A title the latter not without flaws, but still able to defend itself in what was a playground of fluctuating quality for PlayStation VR at its release. Coupling the good narrative quality of Until Dawn with the work done with Rush of Blood, the announcement of The Inpatient which took place during E3 2017 was greeted by many with the expectation of a proof of VR maturity from Supermassive Games, which could perhaps approach the still unattainable horror experience made a year ago with Resident Evil 7. The distressing settings of the Blackwood Sanatorium and the legends of the Native Americans, moreover, seemed to have all the credentials to put the right level of fear. We just have to go on to find out if The Inpatient manages to do it for real. Back in time The Inpatient is set in 1952, some sixty years earlier than Until Dawn. The choice of the year is obviously not random, as it is linked to some events well known to those who know the setting of the previously released title. Thus we find ourselves in the role of a patient admitted to the Blackwood Sanatorium, grappling with the most classic of amnesias that prevents him from remembering the past, apart from very few flashes of what happened before ending up there. Once the helmet has been put on, all we are given to know is that our case is followed by Dr. Bragg, director of the structure, who is keen to specify right from the start that his only interest is in our health. In an attempt to recover his memory, things will obviously take a very particular turn, embracing the legends that form the background of the story of Until Dawn to connect the two stories. Anyone who has had the opportunity to play the first title will obviously have the opportunity to grasp the references concerning him within The Inpatient, but Supermassive Games has nevertheless designed this game so that it can be enjoyed by anyone. As for the development of the plot, we must say that it does not offer particularly important ideas, being slow in the initial part and predictable in its epilogue starting from the first half hour of the game. Or perhaps we should say after the first quarter, as The Inpatient shares the same limitation as other VR-only games: duration. The story set in the Blackwood Sanatorium can in fact be completed in a time that is between two and three hours, thus leaving the flavor of a ~VR experience~ instead of a real game to those who complete it. The presence of some collectible elements tries a bit to get around the limit of duration, together with the same butterfly effect of Until Dawn which promises to change the epilogue of The Inpatient based on our choices. The curiosity to see the various branches may perhaps lead some to complete the adventure more than once, but considering the price of 39.99 euros we cannot help but believe that all this is too little to be satisfactory. Playstation 4 trophies The Inpatient offers a total of twenty-two Trophies, of which one is Platinum, six Gold, ten Silver and four Bronze. Many of them can be obtained by completing the game at least once, but those who want to collect them all must be ready to take at least a second lap in Blackwood Sanitarium, if not even a third to unlock all possible alternatives. Four jumps... on the chair From the moment the Blackwood Sanatorium situation begins to deteriorate, The Inpatient plunges us into an extremely dark atmosphere, in which the protagonist's moments of lucidity alternate with some dreamlike phases. The latter are undoubtedly the most successful, although on balance they are able to truly scare only in the moments in which they resort to the old ~jump scare~ trick. The most sensitive players will perhaps be able to find some disturbing element within them, but on balance we would have expected slightly more disturbing psychological findings. However, the game experience of The Inpatient is designed to make the player feel as immersed in the adventure as much as possible, and this is undoubtedly the aspect in which the work ofSupermassive Games succeeds the most. After choosing our character's gender and skin color, we then find them within the game thanks to the model of him, completely visible by moving his head. The control system leaves the possibility of choosing between the basic DualShock 4 or the use of the two PlayStation Moves: in the first case it is possible to enjoy greater precision in the movements, while in the second a more engaging type of interaction is guaranteed with items in the game. Considering that there are no fights or excited scenes, we can say that preference can be given to the two PlayStation Moves, thanks to which actions such as pointing a torch or opening a door are undoubtedly more realistic. The latest gimmick of the developers to involve the player concerns the voice recognition, which can be used to express one's choices in the dialogues: typically we find ourselves having to select one of two different options, with the possibility therefore to express with our voice what the protagonist is saying within the game. The recognition is also available for the Italian language (the dialogues are entirely dubbed) and in our test it worked quite well, thus allowing the player to speak to all intents and purposes with Bragg and the other characters of The Inpatient. Around the corridors From a technical point of view, The Inpatient shows itself perfectly on the ball, obviously due to the limitations imposed by PlayStation VR, especially in the graphic sense. The presence of closed and dimly lit places has given Supermassive Games the opportunity to indulge in attention to detail, developing a visual rendering that enhances some light effects. Even the audio undoubtedly has its qualities, accompanying the player in the exploration phases of the Blackwood Sanatorium with sinister noises and other gimmicks that feed the tension. In technical terms, the only really noticeable defect concerns the uploads, sometimes exaggerated in their frequency which thus ends up breaking the game action. Finally, as regards motion sickness, nothing to report except the presence of the usual option to define the degrees of rotation, up to the fluid movement.", "date": "2018-01-23", "grade": "5.8"}