{"name": "Sfida a carte nella recensione di Pathfinder Duels", "ref": "https://multiplayer.it/recensioni/194030-pathfinder-duels-sfida-a-carte-nella-recensione-di-pathfinder-duels.html", "text": "The classic RPG expert knows exactly what Pathfinder is, so a mobile title carrying such a name already attracts some attention from fans of this sector, but Pathfinder Duels aims to attract an even wider audience. The hook is in fact that of Hearthstone, the famous card game created by Blizzard and which has become, as often happens with the productions of the label in question, a real global phenomenon. Without inventing much, mind you, because the basic structure is the classic one of collectible card games from Magic onwards, but managing to find the right balance between game mechanics and lore that is successful, in a title that remains essentially focused on cards but where the side dish can make the difference. Potentially, Pathfinder Duels also finds itself in such a condition, with the difference that the 37Games game starts first of all from the well-known name that it carries with it to try to also constitute a valid alternative in terms of card game, mission more seemingly easy. To achieve its goal it relies on the typical characterization of Paizo Publishing for the illustrations and obviously for the representation of creatures, characters and settings, which are thus endowed with a remarkable style, rather classic but clearly derived from a production of a certain level . On the gameplay front we are faced with a fighting game with cards that apparently does not offer particular innovations compared to the canon, but still brings a couple of peculiar characteristics that manage to make it stand out in the tide of productions of the same type present above all in the field mobile. To this we also add a free-to-play setting that doesn't seem to push towards micro-transactions in a subtle way, obviously beyond the fact of playing on the desire to buy new cards, and this is also a good point in favor. Cards face up The combat mechanism is the classic one: the cards represent creatures, spells and summons, each of which has a certain amount of hit points and requires a certain amount of Arcana to be played, with the latter progressively loading each turn. Each card unleashes its ability against the directly opposed opponent's card, or against the enemy hero himself if the table is free, and the cards remain in play until they have exhausted their hit points. So far, we're sticking to the classic canon of the genre, but there are at least a couple of distinctive features in this game. The first distinctive element of Pathfinder Duels is precisely the arrangement of the cards on the battlefield: we are faced with a table divided into two rows of three boxes for each player, and the position of the cards has a prominence in the dynamics of combat. These are in fact used in order starting from the first box at the top left, and are also subjected to attacks in sequence according to the arrangement on the two lines: this means that the first line absorbs most of the attacks, leaving the second as a rear. If we consider that the cards are usually activated (with some exceptions) in the turn following the deployment, we are faced with a series of variables that make the approach to the clash particularly profound, starting right from the arrangement of the cards on the table. In practice, it becomes necessary to study the right position in which to place a card on the board based on both the pre-established order in which attacks take place, and the defensive potential that the cards intrinsically have, based on the principle of arrangement in rows. It is certainly a mechanism that is more difficult to explain than to use, so if the atmosphere attracts you, the advice is to try to take a tour anyway, considering the free-to-play regime without particular gabolas that push you to spend money. The other particular element of Pathfinder Duels is the characterization of the heroes, which derive directly from the Pathfinder lore and can be used alternately as protagonists in the game. Each of these has particular predilections in terms of skills that lead to specific selections of cards from the deck, moreover they can be equipped with objects that modify the performance of the entire deck in battle. Although naturally led to PvP, Pathfinder Duels can also count on various single-player missions supported by a story, so the offer is quite varied.", "date": "2018-01-22", "grade": "7.8"}