{"name": "La recensione di Romancing Saga 2", "ref": "https://multiplayer.it/recensioni/194017-romancing-saga-2-la-recensione-di-romancing-saga-2.html", "text": "There was a time when Japanese-style RPGs weren't viewed with contempt by Western gamers, but they were the daily bread of consoles out there. In the 90s the genre was selling very well, and a real artistic style had consolidated on Super Nintendo and Mega Drive: that of small but solid titles with a bird's eye view, pixelated, and more solid in gameplay than you think might ask at a cursory glance. It is a genre that finds its cornerstones in sacred monsters such as the first Final Fantasy, Chrono Trigger and Secret of Mana, little practiced today if we exclude the small independent productions of KEMCO and some brave new attempts (above all, the beautiful Project Octopath Traveler , which we wait like thirteen year olds in love). Romancing SaGa belongs to these times gone by, published for the first time in '93: twenty-four years ago. Not in the West anyway, and now Square Enix has decided to teleport it to the present day, with some minimal changes, among other things at an attractive price. Overall it went quite well. The black sheep of the family Romancing SaGa 2 begins in medias res: we find ourselves controlling a party made up of King Leon of Avalon and his handful of warriors, to eradicate the monsters that have nested in one of the game's many dungeons. However, a short film immediately introduces us to the context, which is certainly not the most original, but we must still be lenient and consider that he too dates back to twenty-four years ago. Powerful enemies have awakened in the Kingdom of Avalon and threaten its stability and the lives of its population. Fortunately, the legend also speaks of the Seven Heroes (the Seven Heroes) who will come together to defeat evil, but at the moment no one knows what happened to them. Our task will naturally be to find them, put them back together, upgrade them and defeat the forces of evil thus saving Avalon and the capital of the kingdom. And here comes a very important detail, which has always distinguished Romancing SaGa 2 from the many similar titles in circulation at the time: he is the black sheep of the family, not in a negative but distinctive sense. The game doesn't have a real protagonist: at the beginning we play as the son of the king, that's fine, but the war against the monsters will last years, many years. Centuries. And people are mortal, you know, so at some point... they die. And the various descendants of the king will also die of old age (or worse), whom we will find ourselves impersonating, century after century, according to a studied and efficient system of relay between the various descendants of the dynasty. But on closer inspection there are many original points of Romancing SaGa 2, which at the time made it something completely different from its competitors, and which even today ignite a spark of curiosity in the player. For example, it offers an excellent hybrid between the real RPG and the strategic-management: it's fine to fight and level up the party, but the management of the capital of the kingdom is no less important. A new university needs to be built there, the shop remodeled there, and the well down the corner needs a coat of paint. In this way, the morale of the population will rise and we will unlock new companions that can be used in combat, not to mention the various weapons and armor with which to upgrade ourselves. And the way the party itself levels up is also unique. We would expect experience points to accumulate for each member, for a gradually decreasing difficulty as we upgrade. Nothing further: the game becomes more and more difficult, as well as each individual dungeon is strengthened to offer resistance as we annihilate its monsters. In this way it is sometimes more useful to run towards the goal than to stop and destroy yet another giant moth, but in this way we cannot upgrade the heroes along the way. By leveling up, after each battle, each of them enhances their techniques (strictly divided between spells, white weapon attacks, and so on) but does not accumulate experience points, but Technique Points (PT) which will be used to enhance individual aspects for which they are best suited. Focusing only on magic or only on the sword is never a wise choice: if an enemy weak to arrows arrives, we will be completely unprepared and risk defeat. The title is designed to encourage you to cover all your aspects a little, enhancing all the possibilities of the characters. From mobile to TV Romancing SaGa 2 arrives on all consoles and on PC starting from the version recently released on smartphones. As you can imagine, this involves some unpleasant notes: exaggeratedly large dialogue balloons, revised and graphically updated backgrounds that cohowever they cannot hide their pixelated nature, which however clashes with the sprites of the characters, cared for much less. Not to mention the terrible input lag that afflicts at least the Nintendo Switch version that we got to try, in some cases you have to execute the same command three times to make the hero go where the hell we want. In combat, being a turn-based strategy, there are no particular problems, but avoiding monsters in dungeons to avoid clashes becomes even more difficult in this way. It is probably the Nintendo Switch in portable mode that offers the best possible gaming experience, an excellent compromise between the screen of a smartphone and the TV at home.", "date": "2018-01-22", "grade": "7.0"}