{"name": "La recensione di Superbeat: Xonic EX per Nintendo Switch", "ref": "https://multiplayer.it/recensioni/193487-superbeat-xonic-la-recensione-di-superbeat-xonic-ex-per-nintendo-switch.html", "text": "Unlucky in the West, abandoned by Sony and become the target of easy teasing, PlayStation Vita was a happy little oasis for lovers of music games. From the Project Diva series to the Persona 4 spin-off, Dancing All Night, passing through the porting of Deemo, or those excellent Taiko Drum Master V and IA/VT Colorful never released outside Japan. And then there was Superbeat: Xonic, which by combining the use of keys and the touch screen found the ultimate portable expression of the Bemani gaming legacy. This is why the arrival of Superbeat: Xonic EX on Nintendo Switch has attracted the attention of many rhythm game enthusiasts, a genre that has already timidly appeared on the Nintendo console with games such as Voez and Deemo, but which with Xonic he could sing a whole new tune. Monday night, the disco Spiritual heir to the DJMax series, Xonic EX offers the typical recipe of the genre: a flow of colored keys that approach the rhythm of the music, the need to press them with the right timing and a score multiplier to take to the stars. The peculiarity lies in the arrangement of the notes, which start from the center and approach both sides of the screen. In this way it is possible to play both using the Joy-Con keys (each of which corresponds to a channel), and by directly touching the notes on the touchscreen. Compared to the original for PlayStation Vita, Xonic on Switch is slightly less intuitive due to the reversed position of the analog sticks on the two Joy-Con. The most natural way to play on Switch would therefore be to disconnect the two Joy-Cons and hold the console alone as if it were a tablet, but unfortunately Xonic on Switch suffers from a series of annoying problems when it comes to drumming your fingers on the screen , with some inputs not being correctly detected making it nearly impossible to make long combos. The developers have repeatedly reassured fans of the imminent arrival of patches capable of solving the error, but to date the problem persists. Regardless of whether you play it on the TV or in portability, with the touch screen or with the keys, Xonic EX remains a synesthetic, enthralling experience with which you will find yourself tapping your foot in time to the music while you are at home or on the subway. The shapes and colors in the background pulsate, go to the rhythm of the music and contribute to making each track a sensory journey, although - especially with some songs - there is a lack of an option to deactivate the graphic effects, so as not to risk distractions and focus solely on improving your record. Simple and linear, the progression system always gives you goals to aim for and small rewards that go beyond the simple record in the standings: every time you complete a song you earn experience points, level up and unlock new songs, effects sounds and small avatars that give bonuses. You can freely customize your experience by setting the level of difficulty, the tempo of the song, the number of channels or any handicaps, such as notes that disappear or appear randomly. The variety of the tracklist is at the same time the strong point and the weakness of the game: the dozens and dozens of songs present range from K-Pop to rhythm & blues, from techno to trance, passing through some dubstep and progressive metal pieces, putting psytrance alongside to ragtime and rumba. There's everything, and this means on the one hand having a very varied musical experience, on the other that (as always happens in these cases) you'll sometimes be forced to play songs that don't meet your personal tastes.", "date": "2018-01-21", "grade": "8.6"}