{"name": "La recensione di Nindash: Skull Valley e dei suoi teschi di cristallo", "ref": "https://multiplayer.it/recensioni/193874-nindash-skull-valley-teschi-di-cristallo-la-recensione-di-nindash-skull-valley.html", "text": "Two years after the excellent Tactile Wars, the French developers of Ankama have tried to find new solutions for a mobile game that was truly immediate and that makes the most of the possibilities offered by touch devices. The result is Nindash: Skull Valley, a title for iOS that puts us in command of a skilled ninja engaged in a campaign consisting of nearly one hundred levels. The setting is that of Skull Valley, a scenario inhabited precisely by skeletal but particularly hostile soldiers, who have the bad habit of arriving from the upper part of the screen, in droves, waiting for our reaction. If even one enemy were to reach the bottom of the display we would find ourselves suffering a big damage and losing half of our vital energy, therefore we will have to make sure to eliminate every single ~skull~ before it's too late. But how? This is where the peculiarity of this mobile game comes into play, which is literally controlled with the tip of a finger. Just touch an area of the screen for our ninja to reach it instantly, with a lethal dash that eliminates any enemy along the way. Connecting these maneuvers with hostile formations therefore represents the key to success, from the point of view of an experience that uses a decidedly permissive freemium model: from time to time we will be asked to watch short advertising trailers, but we will not have to submit to any limitation , thus playing completely free. Like a ninja you climb the stairs... The structure of Nindash: Skull Valley is typical of freemium productions, with a path in stages and missions that are evaluated with the inevitable stars depending on our performance. The point in the game is not whether we can eliminate our opponents, but how quickly we can do it. Destroying the formations in an instant allows you to collect extra points which we can then spend to unlock new ninjas: an element of some interest, although in the end there are no real differences between one character and another, it's just a matter of skins. The action is made more varied not only by the amount of enemies arriving and by the ~module~ they decide to adopt from time to time, but also and above all by the presence of special opponents. The explosive ones, for example, must be absolutely avoided, while the armored ones must be hit twice to be eliminated; or there are the snappy ones, which can take us by surprise and reach the bottom of the screen, so as to damage us. At the end of the various waves a mini boss arrives, unfortunately always the same, which must first be hit repeatedly and then finished by completing quick time events that require speed and precision. For the real boss fights, those that are so diversified and quite challenging, you have to wait for the end of each area. The experience in general is very accessible, but at the expense of the challenge: completing the campaign in its entirety will take you some time, but you will hardly find yourself in the situation of having to repeat certain missions over and over again. Unfortunately, this is a vice systematically linked to the gameplay, but which does not undermine the enjoyment of the game, especially if you are looking for something light and fun. The excellent graphics do the rest, delivering nice characters and a very well done cartoon-style design.", "date": "2018-01-18", "grade": "7.7"}