{"name": "I nipoti degli Zerg - La recensione di Iron Marines", "ref": "https://multiplayer.it/recensioni/193159-iron-marines-i-nipoti-degli-zerg-la-recensione-di-iron-marines.html", "text": "Known to the general public for the tower defense trilogy Kingdom Rush, the Uruguayan development team Ironhide has decided with its latest title to change the register ... but without exaggerating. In fact, if the Iron Marines here present boasts a space setting that has nothing to do with the fantasy one of the aforementioned series, it is also true that it does not deviate too much from the genre with which the Montevideo studio has achieved worldwide success: the tower defense elements are therefore clearly visible here too, but with a real-time strategic basic setting that has prompted more than someone to welcome the arrival of Iron Marines as a new StarCraft for touch devices. But will it really be like this? With 3 you can buy the content you love on the Google Play Store with phone credit For customers 3 who use an Android device, having games, apps, music and much more is even easier and more fun. On the Google Play Store, in fact, it is possible to obtain the contents by paying them with the residual credit of your SIM or through your postpaid telephone bill. To do this, simply choose ~Debit to account 3~ or ~Activate Billing 3~ as the payment method of your Google account. This configuration can also be made just before purchasing any content, by accessing the menu next to the price of the content you are about to purchase to change the payment method. For more details and to discover the active promotions, you can visit this link. It looks like StarCraft but it's not It must be said that Ironhide has done nothing to avoid analogies with the Blizzard masterpiece, on the contrary: despite a decidedly lighter tone and a cartoonish look, it is undeniable that the scenarios and characters of Iron Marines draw strong inspiration from the imaginary of StarCraft. To clear the field of misunderstandings, however, let us immediately clarify that the similarities between the two titles essentially end here, with Ironhide's latest work proving to be a very valid combination of an RTS and a tower defense, but which does not have the structure and the depth necessary to even approach a sensible comparison with the historic Blizzard series. Having made this necessary premise, let's analyze the product in question, which, as written above, can count on numerous arrows to its bow. To begin with, Iron Marines boasts an absolutely remarkable content offering: the numerous missions that make up the single player campaign have varied objectives, there is a wide diversification in both the ranks of allied and enemy troops and the main menu allows you to spend credits and skill points accumulated by playing on a wide selection of active and passive skills and consumable items. Even at a purely technical level, the work done by Ironhide is substantially impeccable, with pleasant and detailed graphics that perform their function in a more than excellent way, sound that is up to par and above all a control system that is simple and complete enough: it is sufficient perform a tap to select individual troops (or a double tap to group them all), swipe on the screen to show them the direction to follow and then press on the indicators to release special abilities or focus on units and structures to open a radial menu dedicated to upgrades, all available upon payment in resources. A gameplay rests on this framework that sees the user engaged in exploring the various maps, eliminating enemy forces and unlocking buildings and then protecting them from continuous enemy incursions, using troops of various types, fixed turrets and heroes with specific skills. Iron Marines does nothing to make life simple for the player, limiting the tutorials to the bare minimum, immediately raising the level of challenge and not even contemplating the existence of checkpoints: a series of choices which, if on the one hand will exalt the purists , on the other hand they are destined to embarrass that part of the less savvy public. Equally divisive can be considered the decision by the developers to insert paid content (heroes, but also packs of resources and currencies) in a title sold at what in the mobile sector can be considered a full price: fortunately, however, the gameplay is balanced enough to allow anyone to continue only with their own gaming merits, leaving the purchases to those who prefer to forge ahead.", "date": "2017-12-31", "grade": "8.5"}