{"name": "Reigns: Three Kingdoms", "ref": "https://multiplayer.it/recensioni/reigns-three-kingdoms-recensione.html", "text": "The Reigns series is a great example of a weird idea capable of becoming a game that works well, and the success of the series demonstrates how its simplicity can be declined in different ways, telling many stories and still remaining valid. Of course, having come to the review of Reigns: Three Kingdoms, or the fifth chapter counting the various spin-offs, perhaps we begin to feel a little structural fatigue, given that the gaming experience has remained substantially the same, but this does not it doesn't mean that it remains a pleasant and brilliant game even in this case. The title was launched as a Netflix exclusive, downloadable for free by subscribers to the platform, which makes it easily accessible to a large number of users. The major variation here is the chosen historical setting, which reinterprets the Three Kingdoms period of China's ancient history in a decidedly free way. Starting from the Yellow Turban insurrection, the story of Reigns: Three Kingdoms (all written in Italian) broadly traces the main events of the period, even if it does so in a totally original way, with its usual approach based on dry questions and two possible answers that determine different outcomes in the story of the protagonist, or rather of the protagonists. All of this fits into an almost science fiction narrative substrate, given that we find ourselves interpreting historical characters from the past in which we are ~embodied~ through a sort of technological simulation, which also explains the roguelike mechanism of the game. In fact, in Reigns you die often, and this is part of the progression system itself. We start immediately after where we had arrived by playing another character connected by some degree of kinship with the previous one, trying each time to last longer but being able, in this way, to also try different paths each time by focusing on different attitudes. Browse the story Reigns: Three Kingdom, three screenshots from various stages of the game Reigns: Three Kingdoms continues with the same structure seen in the original, in Reigns: Her Majesty, Reigns: Game of Thrones and Reigns: Beyond. It's essentially a card game, but this concept permeates every aspect of the gameplay, beyond the strategic combat system. The narration and the ~managerial~ elements are all developed by leafing through a long deck of cards which each contain a fragment of history and ask a question which can be answered in two different ways: by discarding to the right or to the left we make our choice, which leads to a different development and consequences. Each decision also influences one of the four fundamental parameters visible in the upper part of the screen: resources for the people, charisma, military and intellectual capabilities, which must be controlled and kept within certain limits in order not to run into the premature death of the character in course and restarting with another. The beauty of this roguelike mechanism is precisely the fact that we can continue to experiment with different approaches through choices, through which we can build a different character each time, more set on the military regime or more open to the people, who do not disdain the celebrations or more imprinted on a moral and philosophical rigour. Each ~life~ is a segment of the long journey that leads us to cross the entire historical period in question, and with each death it is possible to see a quick synthesis of what we have managed to achieve between objectives and geographical areas crossed. A card game Reigns: Three Kingdoms, three more scenes from the game between card fights and storytelling The other fundamental phase of the gameplay is represented by the clashes, also focused on the use of cards. In this case, it is a question of selecting four character-cards from the deck that we gradually manage to build with the encounters we make along the way and deploying them on a battlefield, opposed to those of the opponent. The combat system is based on the direct confrontation between two opposing cards, each of which has life points, attack potential and any special abilities, so that not only the possibility of counting on powerful and varied cards becomes strategic (which depends however also by chance, given that the extraction takes place randomly) but also the ability to rotate them at the right time, so as to pit the most appropriate card against the opponent we are facing each time. The mechanism is apparently simple but it contains a certain amount of variables, linked above all to the special abilities and differentiated attack capabilities of each unit: the clashes are usually resolved in the space offew minutes, asking the player simply to rotate the formation of the four cards so as to face the one we want to use directly against the opponent's deck, then seeing the effect that causes the automatic attack. Although there is some strategic depth, the fight is decided largely by the quality of the cards deployed, given the simplicity of the basic mechanism, which makes it moderately addictive only at the most advanced levels. Eastern minimalism Reigns: Three Kingdoms is staged as a succession of more or less static images The graphic characterization of Reigns: Three Kingdoms is perfectly in line with that of its predecessors, set on extreme minimalism, or almost. The game is entirely made up of semi-static screens, being to all intents and purposes a series of pages to browse, interspersed with some short animations to present the new settings in which we move from time to time. In principle, these are geometric portraits with small variations to present the numerous characters with whom we interact: the style adopted has now become iconic for the series and is always very valid, but in this chapter the elements borrowed from Chinese traditions are appreciable , from the typical ornaments to the clothes and hairstyles that convincingly recall the era of the Three Kingdoms, always in a highly stylized way.", "date": "2022-12-06", "grade": "7.5"}