{"name": "Palle d'acciaio e fantasia nella recensione di Pinball FX3 su Switch", "ref": "https://multiplayer.it/recensioni/192998-pinball-fx3-palle-dacciaio-e-fantasia-nella-recensione-di-pinball-fx3-su-switch.html", "text": "For a gamer there is nothing more fascinating than a golden era coin-op, yet the pinball machine has an almost mythological aura of historicity with regard to entertainment machines, difficult to reach from a any electronic system. This obviously because they emerged much earlier and we can only imagine the impact that such objects could have had in the 50s and 60s, as regards the first introductions on the market. Having almost completely disappeared from the scene, pinball machines are finding a new way to establish themselves, paradoxically, precisely through the system that essentially eliminated them, namely the video game. Among the numerous series that have followed one another over the years, Pinball FX by Zen Studio is proving to be one of the most enduring and stoic, recently reached its third chapter and finally also arrived on Nintendo Switch in a version that reflects in all respects all that already seen on PC and other platforms but with some particular additions that further enhance it. For the basic information, therefore, we refer you to the review already published some time ago on these pages, but let's explore some of the peculiarities of the Switch version to see why this could in the end be the best version seen so far of Pinball FX3. Also in this case the game presents itself as a sort of platform: you start from a free table (Sorcerer's Lair, which is already present in FX2 but still very suitable for introducing the features of the title) and a wide range of others to be purchased separately individually or in thematic packages, with a total expense that can also become significant (without considering Adventure Land Pinball and Son of Zeus distributed free of charge for the first few days of launch) and which therefore also makes a selective evaluation of the tables useful to buy or not. As for this review, we were able to try the package of tables inspired by the Universal classics (Back to the Future, Jaws and E.T.) in addition to the initial triptych consisting of Sorcerer's Lair (free) and Carnivals & Legends (Adventure Land Pinball, Son of Zeus ). Wizards, portals, sharks and time machines It is clear how an evaluation of the game can derive from a sort of average between the various tables, the selection of which modifies the gameplay in a significant way given that on the game engine, as a basis, there is very little to discuss. It is a convincing replica of the pinball machine centered on a physical simulation which perhaps does not represent the maximum possible realism, but which has probably been studied to be the optimal meeting point between realistic rendering of the behavior of the ball and arcade interpretation given by the application of bonuses and power-ups. In fact, the latter is a peculiar feature of Pinball FX3, which deviates from the classic direction of pinball simulations to stage a new interpretation of them, adding a constant progression of the player and almost role-playing elements applied to the gameplay. The high score race finds a new justification here, in addition to the direct comparison with other players through the online leaderboards: the points earned also allow you to raise the level of experience and unlock special skills that can be applied to the various tables and affect the progress of the games. These are slow motion, multipliers and varied power-ups capable of bringing the challenge to the highest score on increasingly competitive floors. All this adds considerable variety to the basic gameplay, even if purists could turn up their noses at a digression now somewhat detached from reality for this pinball simulation. In fact, it is an excellent system to guarantee a certain longevity to the game, keeping the level of interest high thanks to the application of interesting variants even on a small number of tables and making every single game still important and significant in terms of constant progression of the player. Added to this is the growing variety of tables, many of which are based on licenses that are sure to appeal to large sections of the public: the price ranges from 2.99 euros for single tables to 9.99 euros for thematic packages. The Switch version Pinball FX3 on Switch is substantially identical to the other versions, apart from perhaps some differences that could emerge in terms of resolution, however of little importance in a game of this type. To its basic characteristics, the version for the Nintendo console, however, acquires the addition of portability, which can be a very interesting plus for a title that lends itself well to use on the move, made up ofmatches also short and detached. Similarly, the ubiquitous multiplayer concept that distinguishes the entire Switch philosophy gives a new dimension to local play in ~hotseat~ mode, with continuous alternation between players between one ball and another, as well as the same pervasive presence of the online between general rankings and between friends. Another distinctive feature of the Switch version is the possibility of holding the screen vertically for portable mode: in this case, obviously, the controllers are detached and the game is played by holding the screen in a position that more naturally recalls the classic trend of the pinball table, keeping a fixed shot that allows you to see the entire game board at a single glance. A flaw of this setting can be found in the miniaturization of the details on the screen, given the lack of zoom and the small size of the Switch's integrated touch screen, but being able to look at the entire table in a single shot is the ideal solution for being able to better manage throws and direct the ball with the greatest possible precision. It remains to be seen how much Pinball FX3 will be supported by Zen Studio in terms of additions and updates, but given what has been done in the previous chapters, we can be quite calm about the duration of the works also for this last interpretation. It is very probable that the pricing policy on Switch is not destined to be as aggressive as that applied to the PC version, but as regards at least the smaller packages, the expense seems decidedly commensurate with the contents offered.", "date": "2017-12-27", "grade": "8.0"}