{"name": "Anime oscure - la recensione di Animus - Stand Alone", "ref": "https://multiplayer.it/recensioni/193009-animus-stand-alone-anime-oscure-la-recensione-di-animus-stand-alone.html", "text": "Whatever the reference market, it is not easy to debut with an excellent product; yet that's exactly what the guys from 10Birds did, two and a half years ago, with Ire: Blood Memory. A little Dark Souls, a little Monster Hunter, the debut title of the South Korean studio showed that it is now possible to offer this type of experience also on mobile, where they are clearly supported by an adequate touch control system and by the thickness that would expect from games like this. Well, with Animus - Stand Alone this talented development team has taken another important step forward, abandoning the survival mechanics in favor of a hardcore action RPG approach and carrying out a consistent revision of the controls and the combat system. The result is in fact a spiritual sequel, so to speak, to their previous project, which reuses several times the excellent assets created at the time (mainly the rich bestiary of enemies) aiming however at a premium model and therefore at an experience that is in no way fragmentary, allowing us to start over from the last checkpoint, after yet another game over, without having to use virtual or valuable currency. In the game we wear the heavy armor of Morgan ~the pilgrim~, an extraordinary warrior who finds himself trapped in a desolate and inhospitable land, full of terrible pitfalls that we will have to try to survive, with a view to a campaign made up of different extra chapters and missions. With 3 you can buy the content you love on the Google Play Store with phone credit For customers 3 who use an Android device, having games, apps, music and much more is even easier and more fun. On the Google Play Store, in fact, it is possible to obtain the contents by paying them with the residual credit of your SIM or through your postpaid telephone bill. To do this, simply choose ~Debit to account 3~ or ~Activate Billing 3~ as the payment method of your Google account. This configuration can also be made just before purchasing any content, by accessing the menu next to the price of the content you are about to purchase to change the payment method. For more details and to discover the active promotions, you can visit this link. Alone in the immense void A short tutorial introduces us to the controls of Animus - Stand Alone, as mentioned a streamlined version of what we saw in Ire: Blood Memory. The largest buttons are those of the two main attacks, with the first one on the left for executing a devastating special that can be carried out once the rage gauge is fully charged. In the upper row we find the healing potion (we will have three available for each mission), the shield and the lateral discard, maneuvering the latter absolutely essential to escape us from blows that can inflict huge damage, or in some cases even kill us instantly . Finally, at the top, there is the lock-on button, which allows you to focus on an opponent and possibly move on to the next target, thus trying to manage situations in which you are outnumbered. The system works surprisingly well, with a set of priority inputs (see the one for dodging) which in all cases do not force you to wait for the end of a movement to be able to move away. The only limitation of this setting, if we really want to, is the lack of an option that allows you to enlarge or reposition the icons, in order to enhance the lateral gap with respect to the parade, which unfortunately proves to be ineffective as soon as more than two-hit combo. The game also supports MFi controllers, although this feature seems to need some filing for the moment in terms of responsiveness and customizations. The black warrior The missions of Animus - Stand Alone are set up as short excursions within fairly repetitive scenarios, which therefore cannot boast a great variety but act as simple backgrounds for the battles. Generally you have to face low-ranking enemies, albeit equally dangerous, to then get to challenging boss fights to be repeated over and over again, until we have memorized the enemy's numerous attack patterns and devised the necessary countermeasures. Between one stage and another we will be able to manage the loot and the coins collected to improve our equipment, sell or disassemble weapons and armor that we consider useless, but also spend the experience points unlocked to enhance certain characteristics of the protagonist: health, resistance , the duration of the dodge, the possible recoveryI was. From this point of view, the experience developed by 10Bird appears decidedly mature: not only is the skill tree convincing, but the equipment modifies the aesthetics of the character and using different weapons translates into unique approaches to gameplay. To give an example, the combination of sword and shield offers a decidedly different feeling compared to the thundering double claw: interesting and precious facets, which contribute to building an underlying solidity capable of surprising especially those who would not expect depth from a mobile game such. Wonderful creatures Although the bestiary of Animus - Stand Alone is largely recycled compared to what was seen in Ire: Blood Memory, there is no doubt that the developers have done an extraordinary job for the design of the protagonist and his splendid armor, as well as for the many different enemies and bosses that we will have to face during the campaign. To balance the details of the polygonal models with the need for a frame rate of sixty frames per second, it was precisely chosen to take less care of the scenarios, providing them with very few interactable elements and trying to exploit the bloom to enhance certain landscapes. In the end, it is an excellent compromise, and although some users complain of excessive battery consumption, we have not encountered any particular problems on the iPhone 7, or at least nothing incredible compared to mobile games with graphics of a certain level. In addition to the visual impact, however, the guys from 10Birds have also taken care of the sound sector: the effects of the weapons, the grotesque moans of some enemies and above all the epic-style music help to create a great atmosphere. Too bad only for the balancing of the difficulty, which seems to suggest at a certain point the need to do a little grinding: this leads us to think that some microtransactions have been inserted to further monetize, in spite of a sale price that is justified but definitely higher than the average on the App Store.", "date": "2017-12-27", "grade": "9.0"}