{"name": "Warhammer 40.000: Darktide", "ref": "https://multiplayer.it/recensioni/warhammer-40000-darktide-recensione.html", "text": "We have been eagerly awaiting the release of Warhammer 40,000: Darktide since the announcement, and why is soon explained: having greatly appreciated the work that Fatshark has done with Vermintide in the classic Warhammer setting, we were very curious to find out how the developers would declined the same cooperative action formula on the disturbing background of the Tetro Millennium. Indeed, there were all the conditions for an evolution of the solid but generally chaotic combat system of the first two games, given the introduction of sophisticated firearms and the simultaneous of enemies who attack from a distance, forcing us to use rifles to counter them. And then of course the scenarios, which mark a clear change of atmosphere by catapulting us into perpetual darkness, as cold as the metal that covers the corridors and walls that we will find ourselves going through in the thirteen missions available at the launch of the game, which can be downloaded at no additional cost from subscribe to Xbox Game Pass. So what was it like playing the role of a criminal determined to atone for his sins by putting his life in the service of the Imperium? We tell you about it in the review of Warhammer 40,000: Darktide. Story: All souls beg for salvation Warhammer 40,000: Darktide, the four protagonists In a similar way to what was done with Vermintide, the story of Darktide is told in the context of sequences generally placed in conjunction with the increase in level of our character, after a prologue that reveals how this criminal managed to free himself from the cell in which he was locked up during a surprise attack, but using his newfound freedom to join the troops in the service of the Emperor instead of going over to the side of the enemy. The one that awaits the warrior that we will be able to create using an editor, selecting not only gender, appearance and class to which he belongs, but also his background through the choice of his native world, the type of childhood and adolescence lived and a crucial moment, is therefore a life of redemption: the beehive city of Tertium has been besieged by hordes of outcasts under the leadership of a dark force, and our task will be to contribute significantly to its reconquest ... or die in the attempt. Classes: No weapon can replace zeal Warhammer 40,000: Darktide, the Veteran tab in the character select screen We were talking about the classes available in Warhammer 40,000: Darktide, which unlike Vermintide are four, exactly like the players who can participate in the various missions of the campaign in cooperation. The selection of origins and events that have marked their lives translates into a different attitude in battle, underlined by the abundant dialogues with teammates, but little else: too bad. The Veteran is a former soldier with great experience in using of firearms, it is no coincidence that his special ability is a sort of focus mode in which his bullets inflict damage multiplied for a few seconds. Then we have the Zealot, a fanatic devoted to the Emperor who uses mainly light and fast weapons, such as an ax and a compact machine gun, and who can sprint forward recovering all his stamina and inflicting deadly melee blows. The Psyker is a psionic mutant who draws on the power of the Immaterium: a sort of sorcerer who not only fights like a damned man, but possesses the ability to control the minds of enemies up to the point of making them explode, while his equipment can include weapons from slash and slash capable of emitting waves of energy to strike from a distance. Finally we have the Ogryn, a three-meter tall beast that stands like the classic tank, can defeat enemies with its charge and use slow but heavy tools. The game allows you to continue the progression of all four characters, although separately: it goes without saying that after trying each fighter and understanding which one we like best to use, we will focus on just one of them to level up and thus unlock not only more powerful weapons, but also a series of specific perks that they will be able to better define the build we want to create. Structure: accept your destiny Warhammer 40,000: Darktide, a group of enemies faced with guns blazing After completing the prologue, in Warhammer 40,000: Darktide we will find ourselves exploring the bridge of the Mourningstar spaceship, which acts as a hub and has activities that become accessible as we level up, obviously including the terminal through which we can select one of the missions available at rotation among the thirteen present at the launch of the game, characterized by five different levels of difficulty betweenlead to ever higher rewards. It is not possible to freely select the single shipment except by referring to those that appear on the screen, with an indication of the degree of challenge: a hitch that seemed quite annoying to us. After that it is possible to opt for a quick game, specifying the desired level of difficulty and in most cases finding yourself inside a match that is already good that it has started. We haven't had any issues with excessive latency, but loading into the game can get quite long. Warhammer 40,000: Darktide, one of the mini bosses in the game The plant looks like an evolution of what we told in the review of Warhammer: Vermintide 2, more collected and coherent than Fort Brachsenbruke, while showing some perplexity on the front of the equipment that can be purchased with the credits obtained in battle: the weapons for sale appear randomly from time to time and are often no better than those we already own, while any upgrades require extra resources and are therefore not immediate, which will slow down our possible progress a bit. It's a pity to note that the cosmetic items shop is instead already fairly stocked and does not have to be subject to these constraints, aiming moreover to make us spend real money for the complete customization of our warrior, given that the nest egg that will be given to us initially will only be enough for a single package. These are completely optional elements, it is true, but considering that part of the experience is still ~in the works~ and various features are not accessible, Fatshark does not make us a splendid figure. Gameplay: purify with faith and with fire Warhammer 40,000: Darktide, our war hammer is preparing to be launched From the gameplay of Warhammer 40,000: Darktide we expected an evolution of the mechanics seen in Vermintide, and so it was, although clearly the formula has remained the same as always. The futuristic setting implies the use of sophisticated firearms in addition to the cutting and bludgeoning weapons that characterized the system of the previous Fatshark cooperative action, although this in no way transforms the game into a real shooter. melee clashes are in fact still central, given that rifles and machine guns inevitably have a short magazine and long reload times which make them perfect for eliminating annoying snipers or small groups of distant enemies, but relatively useless when the terrifying waves that they now represent arrive a trademark of the franchise, also managed here through a procedural system that makes each game different from the next. Warhammer 40,000: Darktide, a Psyker uses his powers against an armored opponent The commands are practically identical to those of Vermintide 2 and therefore include light and charged blows, the possibility of instantly switching from a white weapon to a firearm, lateral or backward dodges, as well as the parry which turns into a push to manage crowding and create space for a counterattack. The same goes for the cooperative formula, which takes up the classic Left 4 Dead between minibosses who can immobilize us and who require collaboration between the players. Speaking of collaboration, it is inevitable that from this point of view the game sets very specific stakes. And so, although it is possible to complete the missions up to the third level of difficulty without too many problems even within a group that is not particularly close-knit, it becomes impossible to do the same with those of the fourth or fifth level unless in the presence of a very good team. coordinated, which communicates and also pays attention to the balance between the characters. Warhammer 40,000: Darktide includes highly spectacular sequences where fire reigns supreme The variety of enemies is excellent, with different types of opponents that we will find ourselves facing and who rush towards us with their heads down or remain distant to target us, whether they are equipped with armor or not. Button mashing is a rather immediate option to get rid of them, but in some cases you have to think and use the entire repertoire at your disposal to avoid losing too much health and thus compromising the rest of the journey. An excellent job has been done on the bosses , which boast well-differentiated patterns and peculiar characteristics, although on the design front the creatures of Vermintide 2 have something extra: an aspect that also in terms of setting becomes clear right from the start, given that the landscapes of Tertium, sometimes suggestive, they tend to aresemble each other in colors and atmospheres. Technical Realization: Faith is useless without works Warhammer 40,000: Darktide, a big enemy is about to bring his mace upon us On a purely technical level Darktide leaves a bit dumbfounded. We had access to the beta reserved for pre-orders, available before the official launch, but there was no way to run it at a stable 60 fps on our RTX 3070, much less by activating ray tracing, and so we gave up waiting for a day one patch which fortunately arrived and fixed most of the flaws. However, the game remains very heavy: the aforementioned ray tracing, applicable to reflections and global illumination, appears unapproachable if not using a very high-end GPU and still going down to compromises on the effective resolution front, as DLSS and FSR become essential tools in order to obtain a consistent frame rate, fundamental for a cooperative action experience of this type, which brings hundreds of enemies to the screen all together. Warhammer 40,000: Darktide, the graphics options In our case we managed to find a compromise by using 1440p with all presets at maximum and DLSS on quality, but keeping ray tracing strictly off. In this way it was possible to obtain a performance advance (about 80 fps in quiet situations) sufficient to guarantee an almost unshakable frame rate even in the most chaotic and spectacular situations, which as you can imagine in a product of this kind are the order of the day. Any other solution for the moment implies big sacrifices on the fluidity front, and in fact the idea of playing Darktide at 30 fps we don't know how attractive it can be. We therefore hope that Fatshark works quickly on a series of optimizations that make the entire system lighter: it is perfectly fine to pursue a technological evolution compared to previous projects, but in an online experience one must also think of the bulk of users, who average configurations far from stellar. Warhammer 40,000: Darktide, a look at the scenarios Is all this weight justified by the game's graphics? Yes indeed yes. Despite a series of minor glitches, the technical sector of Darktide shows off high quality assets both in terms of scenarios and characters, with a particular emphasis on the lighting system and effects, looking in this way of adding value and depth to an artistic direction that often finds its hands a bit tied in terms of pure and simple visual variety. We were also positively surprised by the sound, which in addition to the inevitable dialogues between the characters and the sounds of the battle includes a selection of very engaging songs signed by Jesper Kyd, which enter the field in the most critical moments to underline the tension of those specific sequences, and which complete the picture of a very well packaged audio design.", "date": "2022-12-06", "grade": "8.0"}