{"name": "Sniper: Ghost Warrior Contracts 2", "ref": "https://multiplayer.it/recensioni/sniper-ghost-warrior-contracts-2-recensione.html", "text": "Sniper: Ghost Warrior is not only the rival saga of Sniper Elite but it is also that look to the future compared to the series developed by Rebellion, which focuses on the Great Wars. Despite its limitations, CI Games has always strived to offer us a different war scenario, more forward-looking and towards the implementation of technologies that give the art of sniping a completely different flavor. The spinoff Contracts, then, with its approach similar to that of the more recent Hitman (IO Interactive) has managed to create an experience where freedom of action is entirely in the hands of the player: although the game puts us back in the role of the lethal sniper and infallible when it comes to shooting the bullet that counts, the one that will kill the target of our mission, the way in which the position is reached is at the discretion. We can proceed stealth, exploiting the possibilities offered by the setting and the gadgets owned, or adopt a more open-war strategy and face your enemies head-on. What in fact differs from this spin-off not only from Sniper Elite but also from the mother series itself is precisely the ~Hitman factor~; it works overall, it has found its place and makes the experience very pleasant in its mixing more traditional FPS with a fundamental basic tactics to bring home the salary. A year and a half after the debut chapter, today we are here with the review of Sniper: Ghost Warriors Contracts 2, well anchored to the ~team that wins, you don't change~ formula in its being fun and captivating but, unfortunately, still hampered by a not exactly brilliant artificial intelligence and more or less important bugs. Journey to Kuamar From the icy lands of Russia, we pass this time to the torrid heat of the Middle East, in the fictitious region of Kuamar (located between the borders of Lebanon and Syria). Raven, the infallible sniper whose role we play, is hired to stop the threat of Bibi Rashida, the president's widow and ruthless dictator who threatens to undermine the world economy with her iron fist. In short, the classic situation in which no one interferes until the issue becomes hot well outside the borders of those who war with their neighbors. Between armed threats and power plays, the danger posed by Rashida is absolutely concrete and it will be up to us to weaken her until we reach her, eliminating the most sensitive targets or sabotaging her resources. Nothing new under the sun, you have to cut off the monster's head after weakening it. We are clearly faced with a narrative pretext, just as it was in the previous chapter, but it's not a problem at all because it's not the narrative system that really holds up Sniper: Ghost Warrior Contracts 2.The adrenaline of completing the mission undetected, becoming the titular ghost sniper everyone should fear, carefully planning each move to fulfill as many challenges as possible in one go, experimenting with different approaches not only towards the target but the entire map and its pitfalls: CI Games manages once again to give us all this back, through the five areas that we will have to pass before reaching Bibi Rashida, following the footsteps of the original game step by step with minimal variations in terms of gameplay and presenting a better arrangement of enemies that values the stealth approach; unfortunately, the same are also the past problems. Invisible and patient Sniper: Ghost Warrior Contracts 2, patience is a fundamental virtue How to play Sniper: Ghost Warrior Contracts 2? For anyone unfamiliar with the first chapter, it's not just a question of placing yourself behind the scope of a sniper rifle and pulling the trigger: it's a patient game of slots, in which before reaching the objective we will have to make our way along the map overcoming its pitfalls - which could be individual patrols that are not too worrying or real outposts, perfect for teasing our stealth soul but not mandatory to deal with if you prefer to go a little wider and go unnoticed. Armed with our trusty sniper, a pistol with a silencer as a sidearm and a submachine gun as a secondary, we will have to make use of the gadgets available not only to survey the territory (for example, using the drone to remain hidden and mark enemies) but also to get rid of enemies in the most creative and effective ways possible. Everything is, as always, in the approach and in this sense the freedom of action is commendable. The main objective to carry out can be of various nature, from assassination to sabotage, but in between we can take the time to meet some challenges proposed by the mission to oget more money and skill points, both of which are essential to improve Raven both in terms of performance and equipment. The way of the sniper is certainly not parsimonious and the further we go in the game, the more it will be necessary to prepare in the best possible way to overcome the assignment unscathed. The only real novelty in terms of gameplay is the presence of automatic turrets, which represent a welcome addition in strategic terms if you need to eliminate, for example, two targets at the same time: we'll take care of one, ours will take care of the other. trusted and highly technological companion. For the rest, as always, the real protagonist of the game is the Dynamic Reticle System: it doesn't matter how far away the target is, in an instant we can calibrate the rifle optics to obtain the best possible shooting solution thanks to the indicators that will take into account distance and external factors such as wind, making us understand how best to align the viewfinder. For experienced snipers, the difficulty can be selected at the start of each mission, according to which different forms of aids in the HUD will be more or less active - for example the maximum level eliminates the red dot that tells you when a shot will hit. Sniper: Ghost Warrior Contracts 2, the kill cam always looks good In short, it is also clear from the name of the game itself that Sniper: Ghost Warrior Contracts 2 gives its best when you hold a sniper rifle: working in synergy with your equipment, experimenting with different solutions and bullets, is the core and the beauty also of this second chapter which once again enhances your best shots with the kill cam, thanks to which your kills are transformed into a cinematic riot of blood and bouncing heads. There are more than one solutions to eliminate sensitive targets, it's up to us to choose which one best suits our style and possibly, at a later time, try another one just to challenge ourselves in a different way. In this sense, the arrangement of both simple enemies and targets to get rid of is much better reasoned than the previous one, making up for a not too brilliant level design that unevenly alternates deserted vastness with cold and bare corridors; certainly the setting of the Kuamar does not help when it comes to the variety of environments, rather limited, however the fact that the developers have given weight to the criticisms leveled on the disposition of the enemies and have corrected the shot finds us absolutely favourable. As we have mentioned, Raven can improve himself or his defensive equipment (armor and mask) but also go to work on gadgets and, of course, on weapons: as far as building the character is concerned, you can choose a more aggressive style or one more low profile, or even create a mix of the two - improving our camouflage capabilities but at the same time equipping you with additional armor to better withstand wounds should they discover us. We are not talking about infinite ramifications as in RPGs, it is still an FPS and their presence is limited, rightly limited to what is really needed in the field. Speaking of weapons, each one can be customized in a rather thorough way and above all as regards the rifle as a sniper we will always have to make sure not only that we have equipped the best in terms of power, but also that we have mounted the optics that best suit our needs. Planning, we wrote it, is one of the pillars of the game in and out of the mission. This also applies to secondary challenges, which may require the use of special projectiles or gadgets to complete: the briefing is essential for understanding the objective and the environment around you. Same imperfections Sniper: Ghost Warrior Contracts 2, nothing prevents us from going even with our heads down If CI Games has shown that it has learned something from the past, by polishing some rough edges of the original game, it still stumbles over the same imperfections regarding artificial intelligence: of the four proposed challenge levels, only from the third one begins to perceive a vague sense of danger when you have to infiltrate the various areas. The reaction times of the enemies are slow, there is no intermediate alert state that pushes them in our tracks and before the indicator reaches its maximum peak we just need to take cover to stop being a threat. They make up for this slowness with an infallible aim, an aspect that would be fine if it weren't necessary even when we are literally a kilometer away and they are equipped with a simple machine gun; we could understand if the snipers in position were the ones who scored the shotson the roofs, since we would be playing on equal terms, if instead we are riddled with bullets by soldiers whose maximum range should not even reach halfway compared to our position, then there is a problem. Then the woodiness that distinguishes the climbing sections, which are very often uncomfortable: the mask worn by Raven allows him to identify the climbing points but the action itself proves to be very clumsy, unconvincing and imprecise, breaking the rhythm and also the feeling of being as an infallible assassin. The same fact of not being able to easily climb stone steps, finding ourselves forced to jump and potentially alert a soldier we would like to hit from behind, penalizes this side of stealth. The more Raven improves himself and his equipment, becoming more and more efficient, the more these aspects row in the opposite direction, clashing with an altogether sensitive progression. Also in terms of bugs Sniper: Ghost Warrior Contracts 2 is not putting much Well. These are not disabling problems for the experience but they are still annoying smudges, very occasionally interspersed with problems with the kill cam that crashes the game. It could be floating objects, a slight input lag in the commands when looking for the kill from behind, imperfections in the localization and other more or less evident defects that contribute to dirtying the game as a whole. To close, the graphic sector experiences ups and downs, above all due to the recycling of assets and a polygonal count that is not at its maximum; instead the lighting is good and even more the audio sector. Overall a decent work, which does not differ too much from the previous chapter.", "date": "2021-06-12", "grade": "7.5"}