{"name": "Super Sonic Run - la recensione di Sonic Runners Adventure", "ref": "https://multiplayer.it/recensioni/192796-sonic-runners-adventure-super-sonic-run-la-recensione-di-sonic-runners-adventure.html", "text": "During the 90s we Mega Drive owners liked to think that there was a substantial qualitative parity between the classic episodes of Sonic and those of Super Mario Bros. In reality, however, Nintendo productions have always had an edge , and this aspect emerged above all over time: while the adventures of the mustachioed plumber became increasingly beautiful and ambitious, those of the blue hedgehog ran into great difficulties, ending up on the verge of oblivion. The current scenario quite clearly reflects the abysmal distance between the two franchises, but as we know the mobile market is a world of its own, with different rules and sudden reversals in the face. A fertile ground, in short, in which to germinate a parallel tradition, relaunching the image of the historic SEGA mascot on iOS and Android devices. Yet even in this case, despite the unfamiliar context, it took very little for Nintendo to break the bank: although it was practically a debut title on smartphones and tablets, Super Mario Run exceeded two hundred million downloads, imposing itself within a genre that Sonic had helped to ~invent~, that of ~running platformers~. Without being discouraged by the impressive show of strength of the Kyoto house, SEGA has therefore decided to roll up their sleeves and prepare something special for Sonic Runners Adventure; firstly by entrusting the development of the game to an expert team like Gameloft, secondly by carving the experience to meet the needs of the fans, enriching it with many interesting aspects. The result is a truly excellent product, we can say it right away, which arrives on the App Store and Google Play, however choosing the now unusual path of the premium model, with a selling price of only 3.49 euros and the complete absence of microtransactions. The big challenge The Sonic Runners Adventure structure currently offers four settings inspired by the classic scenarios of the series (Green Hill, Desert Ruins, Lava Mountain and Sky Sanctuary), for a total of about fifty stages. The mechanisms that characterize the gameplay are basically the same as always: horizontal scrolling takes place automatically, at increasing speed, and our task within the levels is to jump where necessary (pressing on the right side of the screen), in order to to avoid traps, eliminate enemies and collect objects, on all the inevitable rings. The completion of each mission and the release of the ~stars~ depends on the objectives that we manage to complete along the way, with a view to a progression that requires a certain number of stars to allow us to reach the final confrontation with the boss, in person by Eggman. The stylistic variety is not one of the strengths of the game, and on this front the difference compared to Super Mario Run is quite obvious, therefore we will find substantial differences in the scenarios only by passing from one world to another. However, the developers have played the character card to unlock, and we are not talking about simple skins: using Sonic (speed class) or its counterparts we will be able to run and make triple leaps, while with Tails (flight class) we will be able to activate a push towards the 'high which will make the handling of jumps very different. Finally, characters like Knuckles (power class) will allow us to carry out a double jump power charge, proceeding horizontally, breaking through walls and eliminating enemies while remaining in mid-air. All following the rules of a gameplay that uses the same rings to guide our trajectories, in a very intelligent way. With Wind you can buy the content you love on the Google Play Store with phone credit For Wind customers who use an Android device, having games, apps, music and much more is even easier and more fun. On the Google Play Store, in fact, it is possible to obtain the contents by paying them with the residual credit of your SIM or through your postpaid telephone bill. To do this, simply choose ~Debit to Wind account~ or ~Activate Wind Billing~ as the payment method of your Google account. This configuration can also be made just before purchasing any content, by accessing the menu next to the price of the content you are about to purchase to change the payment method. For more details and to discover the active promotions, you can visit this link. Class is not water The classes are intimately linked to the first three worlds, with the fourth acting as a mix: a very interesting concept, which translates into a truly multifaceted and rather demanding experience, although at the same time it is practicallyte impossible to successfully complete levels intended for classes other than the one we have selected. Thanks to the rings collected, thus remaining on an exclusively virtual currency, it is possible not only to enhance the characters and unlock assistants and special objects, but also to continue the game in the event of game over, at least three times: a move that on the one hand it neutralizes any episodes of frustration, on the other hand it makes it perhaps a little too easy to get to the end of the game in a matter of hours. Will SEGA and Gameloft introduce new levels with the next updates? At the moment it is not clear, it may well be paid expansions, but it would be a completely legitimate strategy in the face of the quality of the product and a frankly negligible selling price, especially when compared with the 9.99 euros requested by Super Mario Bros. Finally, the technical aspect: putting aside a cel shading that is perhaps too heavy and demanding for a mobile screen, the developers have been able to render the character design of the characters and their animations very well, enhancing the style of the scenarios by inventing alternative paths , predetermined sequences, dizzying jumps and whatnot. The graphics engine also makes everything run very smoothly, accompanied by an engaging although somewhat redundant sound sector.", "date": "2017-12-20", "grade": "8.2"}