{"name": "La recensione di Saint Seiya: Cosmo Fantasy", "ref": "https://multiplayer.it/recensioni/192506-saint-seiya-cosmo-fantasy-la-recensione-di-saint-seiya-cosmo-fantasy.html", "text": "A terrible curse hangs over the Knights of the Zodiac: no one seems capable of developing a game inspired by Saint Seiya properly. Last time Dimps tried it with questionable results and now Bandai Namco is trying again by moving the brand to mobile systems. What might seem like a desperate move is actually a trend: by now everything passes through mobile systems and often turns into a tower defense, a match-3 or a gacha game or a smoothie of all these things . It also happened with the Knights and the ironic thing is that the manga by Masami Kurumada, from which the famous anime that made us dream from the 90s onwards was taken, lends itself well to games that are not strictly fighting games. Cosmo Fantasy proves it and puts players to the test right from the moment of installation: in fact, to start this app, you must first have reached at least the seventh sense. With Wind you can buy the content you love on the Google Play Store with phone credit For Wind customers who use an Android device, having games, apps, music and much more is even easier and more fun. On the Google Play Store, in fact, it is possible to obtain the contents by paying them with the residual credit of your SIM or through your postpaid telephone bill. To do this, simply choose ~Debit to Wind account~ or ~Activate Wind Billing~ as the payment method of your Google account. This configuration can also be made just before purchasing any content, by accessing the menu next to the price of the content you are about to purchase to change the payment method. For more details and to discover the active promotions, you can visit this link. The cosmos without imagination The app welcomes us with the warm notes of the original soundtrack of Saint Seiya: for fans who grew up in the 90s, Cosmo Fantasy is a blow to the heart not indifferent, even if it plays at home and follows the easy and safe path of gacha games. It's an autoscroller RPG, not too different from titles like Dragon Blaze, in which we deploy a team made up of up to five Knights: the first will be granted to us at the beginning of the game and they will be joined by those who we will unlock by continuing in the main campaign or who we will fish in the usual gacha style, at varying rarities. Each mission is made up of a handful of clashes that take place almost completely automatically, since the player can only activate any special shots after they have loaded. At that point the Knight in question will launch his most famous secret technique, inflicting much more damage to enemies with a spectacular animation. Cosmo Fantasy also requires a minimal strategic reflection in the composition of the team, based on the elements and on the positioning: some Knights are more resistant and should be deployed on the front line, for example. Once a mission is completed, the game home is overwhelming, to say the least, full of icons, messages and options. It's nothing a veteran of the genre should fear, as these titles are all a bit cookie-cutter, but a newbie will undoubtedly feel disoriented. However, the offer is the same: through the various menus you can customize the unlocked Knights by changing their equipment, you can tackle various types of missions, upgrade skills, draw new heroes, communicate with other players and so on. An indicator limits our daily games and recharges over time and the rewards are expertly dosed, so those who wish can swipe their credit card and go crazy, but Cosmo Fantasy is playable even without resorting to microtransactions. The problem is that it's not always playable. Our review arrives a week later than expected because installing the app was already a birth, between continuous freezes, endless uploads and looping downloads. We had hoped that Bandai Namco would fix the technical problems experienced by the vast majority of gamers - already months ago, if at all, and well before the western launch - but so far no patch has prevented the frequent crashes and annoying disconnections that turn into a torture of restart those few minutes that should be devoted to the game.", "date": "2017-12-18", "grade": "4.0"}