{"name": "La Fine di Zoe: recensione del nuovo DLC a pagamento di Resident Evil 7", "ref": "https://multiplayer.it/recensioni/192661-resident-evil-7-biohazard-end-of-zoe-la-fine-di-zoe-recensione-del-nuovo-dlc-a-pagamento-di-resident-evil-7.html", "text": "Warning: this article contains a few hints at the story of Resident Evil 7, including the final lines. Although almost a year has passed since the release of Resident Evil 7, the most recent chapter of the survival horror saga has kept a couple for this Christmas of not bad events that arrived a few days ago in the form of two new additional contents, together with the Gold Edition which contains the original game plus all the published DLCs. To accompany the old Confidential Movies (Vol. 1 and Vol. 2) we now find No Hero, a free chapter dedicated to Chris Redfield, and The End of Zoe, a paid episode that focuses instead on the figure of Zoe Baker. For the moment, let's postpone our considerations on No Hero to a later time, focusing in today's review on the adventure which is sold at the price of 14.99 euros. Family is everything The story of The End of Zoe picks up where we left off the only ~healthy~ person in the Baker family, namely on that pier where at the end of the main story Ethan Winters finds himself forced to choose whether to save his wife from the mutamice virus or the girl who helped him escape. From here we learn that according to the developers of Capcom in the end the protagonist decides to assert his love for Mia, thus leaving Zoe still prey to the insane horror of her family, but above all of Eveline's revenge. In fact, the help given by Zoe to Ethan does not go unnoticed, and the living biological weapon decides to punish the girl by leaving her half-calcified in the swamps of Louisiana. Shortly thereafter, a couple of Umbrella agents rush to save her, but Joe Baker, brother of the well-known Jack, breaks into the scene: believing the men in uniform to be the cause of Zoe's evil, Joe knocks them both out, and then interrogates one of them. Having clarified the unfortunate misunderstanding, the infection remains transmitted in Zoe's body, which has reached a stage for which the use of a powerful antidote in Umbrella's possession is necessary. From that moment, Joe's mission will become to recover the serum, thus saving his granddaughter's life. To do so, the protagonist of Zoe's End will have to fight his way through the old mycomorphs, offering us a whole new perspective on how to deal with the beings that terrorized us in Resident Evil 7. As an expert hunter in the hostile environment of the bayou and former member of the army, Joe does not in fact need firearms, but we will see this shortly. Before doing so, let's say that the overall duration of The End of Zoe is around two hours, with some replayability elements: we start from an additional difficulty level, to get to unlocking challenges and objects capable of completely changing a possible second experience as Joe. Playstation 4 trophies The End of Zoe adds six Trophies to the list of those already present in Resident Evil 7: one gold, one silver and four bronze. To get them all you have to complete Joe Baker's adventure at least twice, selecting the difficulty ~Joe must die~ on the second occasion. Mycomorphs with bare hands As a true tough guy, Joe Baker faces enemies armed almost exclusively with his fists, landing powerful series of punches that are able to knock down even the most dangerous opponents. An aspect that, as we said, makes us experience the dynamics of Resident Evil 7 in a completely new way, even if the general scheme remains the one we knew in Ethan's time. From this point of view, you heal yourself in exactly the same way as before, and you can use elements found on the street to assemble healing bottles. The use of fists as the main weapon leaves us rather bewildered in the initial phase of The End of Zoe, especially if we remember the effort made as Ethan to keep the mycomorphs present in the Baker house and in the surrounding area at bay. However, the End of Zoe keeps this paradoxical situation in mind, and addresses it by highlighting the B-movie side of Resident Evil with completely intentional exaggerations, among which we also find wrestling moves performed by Joe. Even a tough guy like him, however, has to give up punches on occasion, resorting to the use of spears to deal with enemies from a distance. His experience in hunting and survival techniques allows him to build this weapon with branches and waste materials, using it above all to venture into the waters of the swamp populated by very dangerous infected crocodiles. In addition to spears, Joe can build rudimentary bombs, with which to solve the worst situations. If you are willing to leave aside the paradox described above, it turns out that punching mycomorphsit's extremely satisfying, especially when you land a combo that explodes their heads or perform some kind of final fatality to take them out. Enemies are fought by pressing the R2 and L2 keys, used respectively to throw punches with the right and left hand. Even if Joe's strength always seems able to break down any obstacle, The End of Zoe does not completely give up the atmosphere of Resident Evil 7, proposing some situations in which the player is called to carefully evaluate whether to launch a frontal attack or less. There are some comparisons with the interesting boss on duty, always carried out with punches until you get to an epilogue in which an interesting twist will not be missing. Going to conclude, we can say that we found ourselves satisfied with The End of Zoe, even if some of its elements capable of making someone turn up their noses are easily identifiable. However, if you loved Resident Evil 7, our advice is to also grab Zoe's End sooner or later, perhaps taking advantage of a discount in some time.", "date": "2017-12-17", "grade": null}