{"name": "La nostra recensione di Hearthstone: Coboldi & Catacombe", "ref": "https://multiplayer.it/recensioni/192459-hearthstone-coboldi-catacombe-la-nostra-recensione-di-hearthstone-coboldi-catacombe.html", "text": "Writing about Hearthstone has now become extremely simple given that, with each new expansion, the player base expands and the latest estimates of this 2017 gave the goal of one hundred million users not so distant. It is therefore unthinkable that those who read specialized information sites are not aware of the product, which allows us to enter the specifications of the mechanics and cards with greater peace of mind. However, when such a result is achieved, development must always keep in mind the two currents of thought of its users which inevitably pull in two different directions. Pro players would like a game that is always balanced, where skill and deck construction can count on everything else while casual players, who represent the largest portion of those 100 million, want to continue having fun without too many worries and maybe even win few games during ranked matches. Blizzard, as per tradition, therefore decided that Kobolds and Catacombs would maintain this duality, a successful choice and which brought several interesting innovations to the game servers, keeping the spirit of the most successful online CCG intact. Ready to drop into the dungeon? To please players less affinity for competitive mechanics, the accelerator could have been pushed on the random abilities of the cards, on the extravagant powers of the heroes and on many other things. Blizzard, on the other hand, has a brilliant idea capable of adding meat to the fire without necessarily affecting the already precarious balance of the game: solo adventures. These had already been presented in the old raids, but here they return in a new guise and, above all, they are free and usable by anyone, even those who have just started and don't have any cards. That's right Kobolds and Catacombs puts quite demanding challenges on the plate with a whole series of bosses with the most extravagant powers to face with all nine classes of the game, and does so by providing you with all the necessary tools. Access the adventures, select the desired hero and as if by magic the deck will create itself. The difficulty curve is increasing and quite steep, so much so that even the most prepared players could start to find the first difficulties as early as the fifth or sixth boss. There are some variables that heavily influence the success of the enterprise, one above all the need after each victory to choose three exclusive cards that will be added to our preset deck. They are usually divided by theme, allowing you to choose between spells or jade allies or even large beasts to play in the advanced rounds, with the addition of the possibility of ignoring all the limits of the legendary imposed by the usual canons for the construction of the deck. To complicate things even more, there are some passive bonuses that can be obtained between matches that will give you very strong cards outside the normal collection, such as a card that fills your side of the field with legendary creatures or abilities that they shuffle the decks and reduce the cost of the cards with always rather amusing gimmicks. These boosts will be essential for you to reach the end of the dungeon and, trust us, if we tell you that the bosses you will have to face do not have the slightest desire to leave you free. Defeat all the adventures with all the characters and you will receive a new back as a gift, a little too little reward for the effort and effort required. The weakest side of all this is in fact the absence of any gain of gold coins or sachets, a modality that remains an end in itself and the fun that derives from it. However, we find that this is one of the best and most appreciable introductions to Hearthstone since launch and we sincerely hope that things will be further explored by Blizzard even with the new seasons, adding new bosses and new options and, why not, maybe even creating small dungeons to payment with rewards in a similar way to what already happens with arenas. Millions of cards to experiment with The meta, with the arrival of Kobolds and Catacombs has obviously been revolutionized and playing these first few weeks is probably the most fun moment ever. Players are testing and the meta is particularly flexible and variable. The new Recruitment mechanic, which allows you to put an ally with certain stats from your deck on the field, seems to have had a good impact and there are not a few decks that use it, one above all a brand new warrior made only of creatures from the high cost. But there is also a druid complete with Barnes and Y'sharij who works in the same way and not even thepriest trying to copy the ideas of the decks mentioned so far. What is rather surprising is the presence of the spell Hunter as a deck capable of imposing itself in the meta, a particular deck in which all creatures have been removed and which basically plays with the new Spellstones and the legendary weapon, as well as with the old Knight of the death. It is therefore interesting to see how two of the new additions of Kobolds and Catacombs have managed to establish themselves immediately: the legendary weapons have in fact found space in the Rogue, in an aggressive version of it that is very, very strong and also in the warrior recruit we were talking about before but also Mago and Hunter, precisely manage to exploit it properly. We are in the exact same situation as the Death Knights, with some weapons that have been played and that we will certainly see in the future while others struggle to find space or establish themselves, such as the Twig of the World Tree or the Shaman's Runespear. The appreciable thing about this new expansion is that it seems to have succeeded where many other expansions have failed: bringing at least one competitive deck per class into the meta. It is obviously a very complex task but Kobolds and Catacombs seemed to be able to get to the point in a much more effective way without upsetting the game system. The mechanics related to randomness obviously remain but, as the developers have said over and over again, the essence of hearthstone also lies in the most complete chaos that is created in some games, an original and indispensable feature found to continue to guarantee its success . If you hate the elusive RNG then resign yourself Hearthstone will always go hand in hand.", "date": "2017-12-12", "grade": "8.2"}