{"name": "La recensione di SpellForce 3", "ref": "https://multiplayer.it/recensioni/192435-spellforce-3-la-recensione-di-spellforce-3.html", "text": "SpellForce 3 doesn't come after many years of silence from the series as many believe. It is true that the second chapter, Shadow Wars, was originally released in the last decade, but in the meantime three expansions have been released, one linked to the base game, Dragon Storm, and two autonomous ones: Faith in Destiny from 2012 and Demons of the Past from 2014. Furthermore, both have been enriched by DLC and various extras that have kept the flame alive. Let's say that if SpellForce 3 exists, it is also due to the fact that the late expansions of the second chapter have sold pretty well. The first feature that stands out of the new episode is its positioning in the chronology of the series: all the other SpellForces had told stories following the ritual of the Convocation, with which twelve very powerful wizards had shattered the world of EO into many autonomous territories floating in the void, connected from portals; the long single player campaign of SpellForce 3, which lasts more than thirty hours, instead tells the immediately preceding events, in which obviously the world of EO is still intact. We specify that there is no need to have played the other chapters to enjoy it, but it is clear that some references will be clearer and tastier for those who have. Even some dialogues take on a different meaning if you are aware of how the situation will evolve. Let's also say that if it is true that the plot of SpellForce 3 is not original (society against wizards), the story fits well into the universe of the game and little could be done to change it (also because it has already been partially told in the other episodes ). Clarified the issues of continuity, we come to us. Role playing game The title begins with two large tutorial maps (depending on the difficulty level selected and how much you explore, it can take up to two hours to finish them) which essentially explain all the basic mechanics, both those for role-playing games and those for strategic real time. In the role of Sentenza Noria, commander of the Wolf Guards, we have to penetrate a fortress where a traitorous wizard, Isamo Tahar, is hiding. Along the way, our party, initially made up of three characters, expands to include a fourth (an archer), so we take possession of the first outpost, which allows us to study the resource collection system and produce a small army with which break down the gates of Tahar Fortress. Exploring the map we find enemies to fight and loot to collect. The combat system is very simple, whether you have chosen to use the new control system or the classic one: once you have identified the enemies, you have to click on them to attack them, selecting the skills of the individual characters or by pressing keyboard shortcuts, or using the skill wheel, which can be invoked on a single target. If desired, it is possible to leave it to the artificial intelligence, especially in the most agitated situations (army against army) in which it is difficult to control individual units. For the rest, the system does not present big surprises: the equipment must be assigned to the appropriate slots and varies according to the class of the character; by accumulating experience points you level up and you can spend extra points to improve attributes or to unlock advanced skills from the available skill trees (three for each character, chosen from six). In total there are six fixed classes, but they can be customized during the creation of the character, accessible at the end of the tutorial (we won't reveal anything, apart from who will be the hero or heroine of the rest of the campaign). For the rest, like the SpellForce of the past, also in the third there are maps designed for the RTS part and maps focused on the use of heroes. The latter are usually less open and contain more loot, with the latter ranging from standard items to magical equipment whose value is determined by the degree of rarity. At a superficial glance, the system may resemble that of Diablo, but in reality it is very different, because it is completely managed by the designers. In this way the progression does not suffer from the fluctuations of the case and, above all, there is never a shortage of objects to enhance the characters that you carry with you. In terms of interaction with the scenario, don't expect to find yourself faced with a new Divinity: Original Sin II. Sure, there are characters to talk to and get quests from and there are items to collect and others to examine, but that's about it. The focus is obviously on combat and the use of skills, a necessary compromise to make the transitions towards the strategic phases less abrupt. RPG maps also offer little puzzles (e.g. find a certain keyto open a given port), but nothing too complicated. Real-time strategy Returning to what was said before, SpellForce 3 is, like its predecessors, also a real-time strategy game. The two genres coexist peacefully in the gameplay, blending into each other without major trauma. Basically in the strategic phases you need to found a headquarters (or conquer it), to obtain a certain number of workers. From here you can then build the buildings for the collection of the seven available resources (wood, stone, food and so on) and those for the production of troops, with the latter linked precisely to the resources: the more powerful a unit is, the more it will require a rare material to be produced. The supply system is very similar to the one seen in SpellForce 2: having built a collection building, workers must be assigned to it, who will automatically go to look for the specific resource. The buildable buildings vary depending on the progress of the game and the unlocking of advanced blueprints. In total there are not very many of them, but it will take a few hours of gameplay before you get all the tier III blueprints. The troops that can be produced vary according to the race used (there are three: humans, elves and orcs) and range from the classic cannon fodder units to giants capable of wiping out entire armies alone. Like the RPG elements, the real-time strategy elements are streamlined compared to more genre-defining titles. This is probably a necessary compromise to integrate the various mechanics and to allow for the kind of expansive gameplay that the game is characterized by, based on the construction of multiple outposts on a single map, essential for pressing against enemy fortresses. In the early stages SpellForce 3 may seem like a too bland RTS, but when you find yourself in very complex situations, with multiple outposts to manage, multiple fronts to attack, multiple armies to form and heroes to direct, you end up appreciating the simplifications introduced and also the slowdown of the pace of the game, in particular in the collection of resources, which allows you to take the right time to carry out the various tasks. Obviously, if you're looking for something faster like a hack and slash, a genre SpellForce 3 has nothing to do with, look elsewhere. Successful mix? In short, is the mix of SpellForce 3 to be considered successful? Basically yes, also because you won't find better. The Grimlore title also proves to be very valid from a technical point of view, with sumptuous maps full of well-made details, whether they are large expanses of wood or city areas, for an EO that has never been so beautiful. Sure, the 3D character models aren't great, but you're looking at them from above most of the time and it's therefore hard to get the angularity. There are also several cutscenes, generally well done, but not comparable to those of bigger productions: in short, they do their job and nothing more. In general, SpellForce 3 lacks a bit of polish, although the developers are actively supporting with the continuous release of patches. In fact, many of the problems of the launch have already been solved. Speaking of the other modes, we point out the possibility of selecting extra scenarios for single player. These are different short adventures from the standard campaign: for now there is only one, but we believe that more will be released soon. Do not miss the online, with the classic skirmish mode in which you have to conquer the bases of the enemies. Nothing you haven't seen elsewhere, but SpellForce's unique mechanics make it an experience to do nonetheless. Of course, a few more maps would not have hurt, since there are only a handful of them, but we hope that the developers will soon remedy this problem too. Finally, the soundtrack is worth mentioning, made up of songs that well underline the epic nature of the gameplay.", "date": "2017-12-12", "grade": "8.0"}