{"name": "Tiro da Tigre! - la recensione di Captain Tsubasa: Dream Team", "ref": "https://multiplayer.it/recensioni/192369-captain-tsubasa-dream-team-tiro-da-tigre-la-recensione-di-captain-tsubasa-dream-team.html", "text": "Captain Tsubasa is one of the anime that made the history of Italian programming, raising an entire generation of young football-loving viewers. Based on the manga by Yoichi Takahashi, the cartoon has been subjected here to an adaptation that has changed all the names of the characters, fortunately leaving the rest intact. Tsubasa Oozora has therefore been transformed into Oliver Hutton, the infallible goalkeeper Genzo Wakabayashi has become Benji Price and their formidable rival, Kojiro Hyuga, has been renamed Mark Lenders. Understandable choices on a commercial level, but which can only create some difficulties for those who want to try their hand at Captain Tsubasa: Dream Team, the new mobile game developed by Klab and based precisely on the manga published in Japan since 1981. The game has in fact landed on the App Store and Google Play with an Italian localization as regards the texts, but the names of the characters have remained the Japanese ones and it will therefore not be easy to identify all the figures that appear during the single player campaign. inspired by the original story. In any case, the elements that have determined the success of the series are all present, with an extreme spectacularization of what happens inside the football field: the same interpretation that Inazuma Eleven has made its own and has been able to develop in the best way. Once the application is launched, it is possible to try the Story, the Series or the Online Games, although the last two modes are unlocked only after reaching the third and seventh experience level respectively. There is also an achievement system that rewards the completion of a wide range of actions, as well as freemium elements, represented by the presence of an energy indicator that is consumed with matches, virtual and real currencies, as well as the need to unlock players for their team through a random drawing process. Two champions The concept behind Captain Tsubasa: Dream Team is that of the team to be built from scratch, gradually unlocking new players to be included in the various roles and enhancing them using the objects that are obtained with each victory. All regardless of the narrative implications: although the story tells a certain situation with its cutscenes, for example the clash between Nankatsu and Toho, once on the field we will have to face the matches with the team we are building. This is even more true from the point of view of the Series mode, a sort of asynchronous multiplayer in which we will have to deal with the teams created by other users to climb the global rankings, and in Online Matches. But how exactly do matches work? Unfortunately, these are managerial-style simulations, very far from the direct and spectacular action of the aforementioned Inazuma Eleven: there is a view of the playing field with the various ~pawns~ that move inside it almost automatically, even if it is possible to act on strategy and pressing to emphasize certain approaches. Once two or more players come into contact, a screen appears asking us how we want to proceed depending on whether it is a defensive or offensive action. At that point the soccer player involved makes the difference: the superstars have special moves (see Kojiro Hyuga's ~tiger shot~, but the list is quite long), so they can spend some energy to perform them and proceed practically to sure shot; otherwise it is possible to select options accompanied by skill values that determine their success. It goes without saying that in the presence of an opponent substantially stronger than us there will be no story: he will win tackles, intercept shots and possibly (in the case of a goalkeeper) parry them. This type of gameplay can be exciting for Holly & Benji fans, determined to build their own dream team with a set of iconic characters to upgrade, but it soon proves to be reductive and repetitive, as well as excessively biased towards pure and simple statistics. In any case, the game performs its task of faithfully rendering the aesthetics of the manga, its most spectacular sequences and the storylines that we know well in Italy very well: elements that could be enough for an enthusiast to advance. It's just a pity that the soundtrack lacks the musical theme that we are all very fond of.", "date": "2017-12-11", "grade": "7.6"}