{"name": "Demoni in faccia nella recensione di DOOM VFR", "ref": "https://multiplayer.it/recensioni/192084-doom-vfr-demoni-in-faccia-nella-recensione-di-doom-vfr.html", "text": "If the end of this 2017 is so interesting for lovers of virtual reality, their thanks must go largely to Bethesda. The Maryland publisher has in fact recently dropped the Skyrim VR card, before a trio of releases destined to be completed with the arrival of Fallout 4 VR in a few days. In between, the arrival in our helmets of DOOM VFR, unlike the other two titles designed with virtual reality in mind from the outset. The demons of the historic id Software saga are therefore ready to hunt us down in a whole new dimension, this time immediately on multiple platforms, given that unlike Skyrim VR, DOOM VFR is in fact available for PC (HTC Vive) and PlayStation 4. It was the Sony console that hosted our return to Mars, one year after the reboot of the series released in 2016. To find out how it went, all you have to do is read on. Last survivor, but not for long For the benefit of those who do not know where the F of DOOM VFR comes from, let's immediately say that it is used to compose the acronym of Virtual Fucking Reality, a sort of homage to the BFG (Big Fucking Gun) recurring weapon in the titles of the DOOM series . From the last of these, the aforementioned chapter released last year, DOOM VFR inherits the setting on Mars, inside the UAC research center invaded by demons. At the beginning of the game we are called upon to control the last human survivor, who in reality is immediately killed by a demon. Thanks to some devilry, the victim's conscience ends up inside an artificial robotic organism, through which he can then try to understand what happened, while at the same time restoring normality within the structure. The old demonic acquaintances are teeming, and as per the tradition of the saga, the plot is only a small pretext to start cleaning up the infestation through adrenaline-pumping firefights in the company of an exorbitant number of evil creatures. In the case of DOOM VFR it is actually the protagonist who tells the story of the plot in his own words, perhaps to allow those with the viewer on their heads to immerse themselves more in the part. If you haven't played DOOM in 2016, however, fear not: the link between this and DOOM VFR is really weak and there is no need to be aware of what was told a year ago, except to find common points in the enemies and environments. For the rest, DOOM VFR alternates the brutal and adrenaline-pumping clashes typical of the series with moments of relative calm, in which the player is called upon to solve small puzzles. In total, it takes between three and four hours to complete everything, which can be increased if you want to collect collectibles or try the challenge again at higher difficulty levels. Playstation 4 trophies DOOM VFR has a total of fifteen trophies, none of which are of the Platinum type. The Gold One can be obtained by completing the game on all available difficulties, while the Silver One can be obtained by collecting the collectibles present in the adventure. The other thirteen are therefore all Bronze and concern various aspects of DOOM VFR such as the collection of weapons and ammunition, teleportation and killing enemies with telefrag. How I kill you the demon DOOM VFR's control system is compatible with all the alternatives PlayStation VR has to offer. The dynamics put in place by id Software make movement via teleportation their central pivot, adding the so-called telefrag to the fights: by teleporting into the body of a demon that has suffered enough damage, it is possible to blow it up into a thousand pieces. A dynamic that lends itself perfectly to the bloody universe of DOOM, while winking at the limitations imposed on the use of the two Move controllers, with which free movement is not provided. The strafe system in the four main directions is a candidate as a useful aid for movements, but if you want free movement you have to turn to an Aim Controller or the normal DualShock 4. Both solutions defend themselves well, but are not exempt from defects: in the first case as regards the optimization of the interface and the visual, while in the second one loses a bit in terms of identification, making DOOM VFR more similar to a non-virtual reality game. As is the case elsewhere, if you use the standard controller, aiming is entrusted to head movements, leaving body control to the stick and buttons: beyond the alternative between teleportation and free movement, the options to reduce motion sickness concern mainly the rotation of the view, also free or in jerks of a configurable number of degrees. The latterAnother alternative is missing with the Moves, through which you can only turn one hundred and eighty degrees, making it most likely the most uncomfortable solution for playing DOOM VFR. Even in the case of id Software's shooter, the final choice is up to the player, who can choose the configuration capable of guaranteeing the best comfort depending on the control peripherals at his disposal. Although we cannot count on particular alternatives such as those offered by Resident Evil 7, we must say that we have not had motion sickness problems. However, what does not change between the control systems is the level of graphic detail, properly measured by id Software to guarantee a rendering that remains of very good quality even through the inevitable degradation of the PlayStation VR image. The result can count on a truly excellent level of detail, at the highest levels compared to what has been seen so far on the Sony branded helmet.", "date": "2017-12-04", "grade": "7.5"}