{"name": "Enigmi nella giungla con la recensione di Faraway 2: Jungle Escape", "ref": "https://multiplayer.it/recensioni/191996-faraway-2-jungle-escape-enigmi-nella-giungla-con-la-recensione-di-faraway-2-jungle-escape.html", "text": "In recent years we have witnessed a return to the limelight of the adventure genre declined as a composite puzzle, which draws inspiration from certain classics of the past such as Myst. The basic characteristics include a subjective view and pleasant, unusual, almost dreamlike and in some ways metaphysical settings, which induce a sense of identification due to the poorly defined outlines of the protagonist, who to all intents and purposes becomes the player, and of estrangement , escape from reality. The Witness is perhaps the most illustrious representative of this new wave, but several interesting proposals are also arriving from the mobile sector, where to tell the truth, the genre has continued to grow with a certain constancy, starting from the re-editions of Myst up to The Room, to the recent Returner 77 and finally to this Faraway 2: Jungle Escape, which fully incorporates the basic characteristics of this particular genre. This second chapter is essentially a ~more of the same~ compared to the first, which shifts the setting into a mystical jungle thus marking a clear break from the desert atmospheres of the progenitor, but fully resuming the mechanics and some fundamental solutions for regarding the structure of the puzzles. Given the goodness of the starting material, one could not ask for better: Faraway 2 maintains the dreamy and mysterious spirit of the first chapter intact and varies just enough in the setting and in some details of the gameplay to instill new interest even in those who have already dealt with the first part, proposing another good dose of puzzles to be solved with the same hermetic and reflective style already appreciated previously. Faraway 2: Jungle Escape takes us to solve mysterious puzzles in the heart of the jungle The Silent Riddler It has become almost a habit to find yourself in strange settings, without written instructions and with only a few logical clues to put together to arrive at the solution of bizarre but rigorous puzzles. And yet, the charm of these games remains intact, from Myst to The Witness, as the settings and the style of the puzzle design change, there is always a renewed interest in moving forward, enigma after enigma, even just for the sake of discovering what is hidden after the next portal, bridge or passage. This, of course, if the mechanics of the game work and Faraway 2: Jungle Escape works. It adopts a style that derives directly from the first chapter and which in turn has been seen in other similar productions, focused on the activation of mechanisms, the composition of figures or the projection of light rays but there is a fair variety of different situations. The solution is almost always quite accessible, alternating deductive and inductive processes but making it possible to understand how to move forward with the elements placed on the screen, which is essential in a game that proceeds without a ~guide~ or explicit suggestions (unless you resort to advice, of course). For experts in the genre it will probably be too simple, but this is a title more aimed at relaxation than intense reflection up to the headache of a real puzzle, and the progression is fluid and painless, so much so that the game ends in a few hours, however the journey is always pleasant also thanks to the simple but evocative graphic style adopted. Note also the fairly fair monetization system: the title is only apparently free-to-play, in truth to unlock all the levels it is necessary to pay the in-app purchase of 3.49 euros (currently discounted), otherwise in the free version you only get up to half, or 9 out of 18 levels, barring any later additions.", "date": "2017-12-01", "grade": "8.0"}