{"name": "Tutta la verit su Xenoblade Chronicles 2 nella nostra recensione", "ref": "https://multiplayer.it/recensioni/191882-xenoblade-chronicles-2-tutta-la-verita-su-xenoblade-chronicles-2-nella-nostra-recensione.html", "text": "Xenoblade Chronicles was the title that relaunched the Japanese RPG genre when, seven years ago, it was struggling to have its say in a market that sought innovation at all costs or that perched on top of the mountain of tradition: the director of Xenogears and XenoSaga had chosen an intermediate approach and, in doing so, had succeeded in a titanic enterprise, squeezing the Wii hardware to the last drop. Two years ago he tried it again with Xenoblade Chronicles X on another Nintendo console, Wii U, performing another minor technical miracle while experimenting with new gameplay philosophies. The extraordinarily controversial Xenoblade Chronicles X demonstrated the versatility of Japanese developer Monolith Soft, representing one of the high points achieved by the unforgettable console with the GamePad. Considering this track record, the excitement surrounding the announcement and anticipation for Xenoblade Chronicles 2 could only be stellar. We want to get straight to the point: Xenoblade Chronicles 2 is a JRPG masterpiece that rounds off Nintendo's triumphal 2017. And just to be clear, if you haven't played the previous two Xenoblade Chronicles, you can easily start with this one. The skies of Alrest We've seen a lot of open world titles in recent years, but sometimes we forget that there's always a ~first time~ for everyone and that this Xenoblade Chronicles 2, which for many players will be the third Xenoblade, will be the first. The ratings we give to games are cold numbers that desperately try to translate the sensations we experienced while playing, which is even more true when dealing with emotionally demanding titles such as some RPGs can be and, in particular, those written by the brilliant Tetsuya Takahashi: the director of Xeno is someone who goes down hard, a screenwriter who kidnaps the player and doesn't let go for hours. The first time we went up to the Plains of Gaur in the first Xenoblade Chronicles, seeking revenge after one of the most intense prologues we have ever played in a JRPG, we were left in awe: before our eyes a majestic scenery opened up, incredible mostly because it somehow ran on a relatively powerful console like the Wii. That's when we realized how special Xenoblade Chronicles was. Maybe that's why, six years, two Xenoblade Chronicles and dozens of open worlds later, the landscapes of Xenoblade Chronicles 2 haven't had the same shocking effect. Mind you, Monolith Soft's new JRPG is set in an inspired and structurally awe-inspiring world - just imagine the aforementioned Plains of Gaur... but with Bionis's head bobbing on the horizon! - and on more than one occasion it leaves you speechless for its complexity and richness of details, between atmospheric effects and day/night cycles that alter the scenario, the incredible soundtrack of a Yasunori Mitsuda in great shape and a quantity of creatures who roams here and there with more or less hostile intentions. Quite simply, this is the open world we've come to expect from Monolith Soft by now. Blessed are those who play their first Xenoblade Chronicles, in fact! For them it will be easier to forgive even the technical slips: many textures in low resolution, some uncertainty in the frame rate, an annoying aliasing. It is the price to pay for a gargantuan title that runs beautifully even in the portable version, at the expense of a lower resolution which returns a significantly dirtier image. But if it is true that new players will be the ones to be absolutely enchanted, it must be emphasized that the world of Alrest reserves many surprises for everyone. After setting one game on and inside the corpses of two giants and another on a mysterious planet that looked like an intergalactic version of the Lost Island, Takahashi decided to divide the open world of Xenoblade Chronicles 2 into a series of gigantic territories living, Titans sailing in a sea of clouds which, in turn, surrounds a gigantic tree called Elysium. Tales of Aegis Rex is a scavenger, a young man who lives on the back of a tiny old titan and makes a living by diving into the cloud sea for scrap and precious artifacts. His skill attracts the attention of a mysterious group who offer him a great deal, but when Rex touches the strange sword hidden at the bottom of an ancient shipwreck, he inadvertently becomes the Driver of Pyra, a legendary Gladius that everyone wants for obscure reasons. In the world of Xenoblade Chronicles 2, in fact, there are people who can resonate with the nucleic crystals and materialize the Gladius within them, living beings with powersextraordinary. What are the Gladius, how do they exist and what is their link with the world of Alrest are just some of the many mysteries that Rex will have to unravel during his mission: to accompany Pyra to Elysium and find out if the ancestral home of humanity is still habitable, now that the Titans are slowly dying out. Xenoblade Chronicles 2 is a story by Takahashi, so expect profusion of twists, overturned expectations, millennial secrets and a mythology that borders on religious iconography to once again explain the meaning of life and the senselessness of racism. To the great meanings Xenoblade Chronicles 2 comes to us with a little shortness of breath, passing through a whole series of misadventures that make the plot so unpredictable, but also a bit too diluted especially in the central section of the plot. When he finally picks up the leitmotif, Takahashi goes mad and runs like a train to the epic conclusion of the story. The characterization of the characters is generally sublime, although falling into some clichs, such as that of the masked villain or the naive and altruistic hero, compensated however by an extraordinarily varied and engaging cast of supporting actors. In recent months there has been controversy over the average childish character design that clashes with the skimpy costumes of some characters, Pyra in primis. We want to reassure you that the girls in question, however undressed, are anything but trivial sensual forms: Takahashi has always taken care, with the help of his wife Soraya Saga, to outline above all the heroines of his games, from Elhaim to Xenogears to Shion from XenoSaga, passing through Fiora, Melia and Elsa in previous Xenoblades. This story is also no exception. Pyra is an extremely complex character, to whom it is impossible not to get attached, but the same can also be said for Nia or, on the male front, for the corpulent Vandham and the tender Tora, a Nopon who cannot become a Ductor and who therefore he built an artificial Gladius of his own. I'm only sorry that the English dubbing struggles to do justice to the cast: the western localization has once again favored the British accent, but the acting sometimes clashes with the context and the lip synchronization leaves a lot to be desired. In this sense, we cannot help but advise you to download the free package which implements the original Japanese audio: the expressiveness of the Japanese voice actors is, as always, incredibly exciting and embellishes the most spectacular cinematics in which Xenoblade Chronicles 2 practically becomes an anime, between special shots shouted at the top of their voice, hilarious gags and frenetic fights that take your breath away. Inspector Gladius We are happy to be able to say that Monolith Soft has capitalized on the criticisms received for the structuring of the secondary missions in the previous two Xenoblade Chronicles, since those that now appear as we continue in the main ~campaign~, if we want to call it that, seemed to us much more dynamic and articulated than in the past. For the avoidance of doubt, sooner or later you always have to eliminate some enemies or collect objects, but to support these tasks there is often a solid narrative that sometimes takes unpredictable turns, extending the simple tasks in a sensible and interesting way. The fast travel system allows a great deal of freedom to maneuver and the new mission listing menu is clear and intuitive, even indicating the times of day when some of them can be completed, as well as their location on the intricate map of Alrest. Between missions in which you have to cook assorted dishes for a Nopon who wants to learn to sing to find her son and surprising family reunions, inscriptions to be translated to locate a treasure and traitorous mercenaries, there is something for everyone. Sometimes the secondary missions are intertwined with another mechanic directly linked to the Gladius, namely that of field skills. Gladius, in fact, have abilities that allow us to interact with the environment. Some of them are activated automatically and allow us to extract a greater number of resources in the appropriate collection points, while others must be combined in order to open otherwise unreachable chests or unlock alternative routes. The system is interesting and works, but unfortunately it is sometimes a bit cumbersome due to an unfortunate conjunction of mechanics which forces the frequent opening of the menus. Field skills only work if we have equipped the corresponding Gladius and the latter do not learn them in the traditional way, for example by accumulating experience points: in fact, one must carry out actions paparticular and disparate, such as using an attack multiple times or consuming a certain dish, so it becomes quite complicated to keep track of all the Gladius and the corresponding skills already unlocked or that we have yet to unlock. Furthermore, most Gladiuses are obtained completely randomly by ~opening~ the nucleic crystals: the better the quality of the crystal, the greater the chances of obtaining a powerful unique Gladius, but the more often generic Gladiuses materialize that combine into completely random weapons, elemental properties and skills in the field. In short, it may happen that we reach a certain point in the game, after many hours, without having yet unlocked a certain skill on the field which precludes us from opening some chests. Fortunately, this element of the gameplay does not affect the natural progression of the main story in the slightest, linked above all to the mandatory Gladius, such as Dromarch or Pyra, which play a fundamental role in the narrative. The Gladius ~gacha~ system may therefore appear controversial, but it fits perfectly with the open world structure of Xenoblade Chronicles 2: apart from the fact that some side missions reward with unique Gladius, the search for new core crystals stimulates the player to explore every corner of Alrest, while the secondary missions, due to the way they are structured, encourage you to take alternative routes and discover locations that the main plot might not even touch. Life is a tutorial What has been described up to now would not have worked properly if there hadn't been an excellent combat system to support an adventure that can easily exceed a hundred hours of play if you aim to complete every single aspect. Again, we can't help but praise the work done by the Monolith Soft team and once again reassure readers who, like us, when looking at the promotional films published in recent months, feared the slower pace and cadence of battles. The truth is that, yes, the first few fights will seem much slower than in Xenoblade Chronicles and Xenoblade Chronicles X, if only because you won't have to constantly move the cursor over the various special attacks, mapped directly to the A, B, X and Y: three for the weapon and one for the attack of the equipped Gladius. Each weapon has four special attacks in total, but a maximum of three can be set. Do they seem few to you? Wait a few hours. Xenoblade Chronicles 2 slowly scans the progression and continues to pour out new mechanics even after the thirty hours of play. We have to admit that initially it seemed like a questionable approach but then, once we learned every dynamic of the combat system, we completely changed our minds. Explaining each mechanic in a few words is almost impossible, but this is precisely the point: Xenoblade Chronicles 2 slowly instructs the player and waits for him to have satisfactorily assimilated certain mechanisms before adding others. So at the beginning you will end up with a Rex capable of launching slow automatic attacks that charge the special moves of his sword and that of Pyra. Slowly, you'll learn to link the powers of the Gladius in groups, then seal the enemy's abilities and chain the effects of weakening, throwing and knockdown. At that point, the game will teach you how to unleash devastating sequential attacks and switch weapons / Gladius on the fly, while spending the points you earn fighting to unlock our heroes' abilities that can simply increase a stat or grant the ability to link special attacks without having to wait for a reload time. Without even realizing it, you will find yourself fighting together with three Gladius per character - four, in the peculiar case of Rex! - and to continuously switch between them to take advantage of every attack, weakness or elemental combination. The character you are controlling will chain three ax strikes, switch Gladius and unleash three katanas, then trigger an elemental combo by activating another party member's Gladius with the back button and switch Gladius again to weaken and knock down the opponent in a that the last attack that his Gladius will perform, changed again within a few seconds, will deal more damage to the completion of a simple on-screen quick time event. And this is just one example of how hectic a deep and rewarding combat system that requires a certain timing and a fair amount of strategy can become, especially if you want to defeat the unique monsters and super bosses that infest Alrest. We can say that Xenoblade Chronicles 2 is the perfect one", "date": "2017-11-30", "grade": "9.4"}