{"name": "La recensione di Black Mirror", "ref": "https://multiplayer.it/recensioni/191888-black-mirror-la-recensione-di-black-mirror.html", "text": "The point-and-click genre is now on the verge of extinction, after having given us masterpieces that perhaps the new generations know only by name. There are various Deponias, it is true, and occasionally some indies. Some want to see the modern heirs in Telltale Games' graphic adventures, and they're at least partially right. Black Mirror (no, the Sky TV series has nothing to do with it), developed by King Art Games, or the guys from Raven and The Book of Unwritten Tales, and published by THQ Nordic, will take care of remedying the shortage. If you remember a title of the same name released in 2003 on PC, forget it. Black Mirror is a reboot, a new beginning. It inherits part of the mechanics of its predecessor, and its atmospheres, but requires no prior knowledge of any kind. And it's a real shame that as a first start it doesn't lay other solid foundations than the plot, nor a satisfactory technical sector. Part Crimson Peak, part Lovecraft If you've seen Guillermo del Toro's Crimson Peak or read any of Lovecraft's short stories, Black Mirror will quickly find you at home. A not too hospitable house, captivated by the tentacles of restlessness and madness. The atmosphere is in fact that of the best gothic/horror stories, seasoned with expert incursions into the paranormal and into psychoanalysis. David Gordon, the protagonist, is forced to carry on his shoulders an ancient curse that weighs on his house. And the return to the family home, lost in the Scottish mountains, is certainly not the best road to recovery. The narrative sector of Black Mirror is the backbone of the entire production, which allowed us to promote it with a discreet vote, despite the obvious defects we will tell you about. We don't want to anticipate anything, nor spoil the pleasure of discovery, but it is important to underline the goodness of a direction that proves to be intelligent, capable of managing the complex and tense rhythms of the narrative. It's 1926, and David Gordon is returning home. A house he has never seen before, never lived in, but still remembers. He remembers restless episodes, traumas that saw him as the protagonist. His father disappeared a few weeks earlier, and for legal reasons our hero is forced to attend the family reunion. That something is wrong in the Gordon house is clear right away. This can be sensed from the mansion invaded by shadows even in broad daylight, from late night arrivals, from the few terrified words of the servants. From the butler who invites you to stay in your room until dawn, because ~there is something much more dangerous around than a pendulum clock that chimes at will~. In fact, it seems that something, or someone, is wandering among the woods, the rocks, and the house. We have the task of revealing the mystery, collecting clues, linking documents, questioning those present, exploring the surroundings, one chapter after another. David Gordon's story is compelling, tense, dark, focused on the dangers of the outside world but also on those that come from within, from visions and nightmares. If you love graphic adventures, it will be difficult not to get caught up in the title. And if he doesn't catch you, it's likely that the many problems that afflict him will give you a hand. Playstation 4 trophies Black Mirror will delight trophy hunters: there are just 22 targets, but above all in gold and silver, and there is even platinum. Above all, it seems that only one of them is missing during the adventure, but easily recoverable in the first moments of a new game. All others will simply require you to complete the story, one event at a time. The demons are scary, but the technical problems are no different If Black Mirror belongs to the vein of graphic adventures, the gameplay is almost perfectly adapted to modern times, from the management of the character in the third person to the presence of interactive cutscenes, which sometimes even offer skimpy QTE sessions. Inventory management and interaction with on-screen objects are those of current adventure games, but at the same time everything has the flavor of times gone by: this clever balance permeates Black Mirror with added value, especially for nostalgics. For example, the riddles and puzzles proposed along the way are ~old school~, particularly satisfying to solve, and on more than one occasion they will keep us stuck for quite a while. But there is no lack of a basic system of choices and crossroads to act as a counterpart, even if most of the time so elementary (and sometimes superficial) that it counts for very little. Our task is to explore the family home and its surroundings room by room, interact with characters and objects, survive our visions, and shed light on the curse of the Gordons and the end of our father.Unfortunately Black Mirror is penalized by a myriad of factors that make progression much more frustrating and boring than it should be. Let's start with the subtitles in Italian: for once they exist, the synchronization problems with the English audio are evident. The character says and thinks something speaking aloud, and the subtitles freeze at best, unable to keep up with him, stopping at the first sentence. Or for some reason they start to completely misrepresent his words. Even more frequent are completely wrong translations, the most peculiar of which is ~Vattene~ for ~Go back~. When examining an object or the inventory we must therefore not ~exit~ or ~go back~, but leave. Rude, these Scots. Framing and camera handling aren't much nicer. One of the analog controls the view, partially fixed within each environment, even if the observation point is fixed as in the first Alone in the Dark. The other is used instead for the movement of the character. This, at least, in theory: then the camera starts to freeze, to move too fast or too slow, to get stuck somewhere making us lose sight of David. Whose movements, it must be said, are not that much better. At times it seems that the protagonist moves on a wet floor, while at best its controls are woody, unresponsive, awkward. To top it all off there are also the showy and evident slowdowns and drops in frame rates, both in open and closed environments; and the loads between one room and another are simply absurd, practically every ten steps you have to load every single corner of the Gordon villa from scratch. The tension should come from the story, not from the technical sector.", "date": "2017-11-29", "grade": "6.8"}