{"name": "Orrore cammina con me: la recensione di Resident Evil: Revelations 1 e 2", "ref": "https://multiplayer.it/recensioni/191893-resident-evil-revelations-orrore-cammina-con-me-la-recensione-di-resident-evil-revelations-1-e-2.html", "text": "Resident Evil has had a complicated relationship with gaming progress, at least for several years. After the revolution of the fourth chapter, the formula began to show some cracks already in the fifth, to then sink into the sixth in search of a new identity that was slow to arrive. In fact, the characteristic elements of the series did not seem to be able to be reproposed without running into anachronistic defects or adapted without distorting the foundations, placing the franchise in a sort of dead end. The solution adopted by Capcom, clumsy and uncertain only at first glance, proved to be ingenious: breaking down the experience into different strands, applying different degrees of classicism and innovation to the various solutions. In this way, while the main series has restarted with a total re-foundation thanks to Resident Evil 7, the original spirit has been instilled in a smaller production but which represents in a more genuine way the continuation of the classic survival horror style, with Resident Evil: Revelations (not to mention the tout court revival of the old chapters with the various remakes, to complete the picture of the operation). The almost experimental nature of the first Revelations is also revealed by the fact that it was initially proposed on Nintendo 3DS, as if to test the ground on such a particular and less expensive platform in terms of production costs; but the game proved to be so good that it made the leap towards home consoles with a high-definition revival and then a real sequel designed specifically for them, definitively launching Revelations as a real sub-series capable of carry on the Resident Evil tradition on a more classic front and close to the original lore, thus representing an evolution anchored to the origins and freeing the main series from any ties to the past, effectively offering two different and complementary experiences in the same universe horror. Waiting to see what the future holds for this series, given that there is still no trace of news on new Revelations, we welcome the arrival of the two chapters on Switch with great pleasure. In the breadth of genres and brands in the Switch catalogue, Resident Evil: Revelations was needed Revelations: Volume One Let's start with the first Resident Evil: Revelations, which we particularly liked in its original version on Nintendo 3DS, also due to the impact of such a game on the ~old~ Nintendo portable, and which we also greatly appreciated in the conversion for home consoles , including the latest re-release on current generation consoles, although the title was starting to feel a bit tired. The strength of the first Revelations is above all its link with the roots of the series: although the concessions to the pure third-person shooter are now inevitable after the turning point of the fourth chapter and the difficult revival of the classic mechanics, the game still manages to maintain a good balance between pure action and survival elements without disdaining the use of some puzzles with a traditional flavor. The action is still preponderant, but being faced with keys to find, emblems to insert in special holes and other puzzles of the kind gives the feeling of a return home, for those looking for a bit of a Resident Evil atmosphere. vintage. The decision to set most of the events on a huge ship is then particularly apt, allowing you to propose narrow and claustrophobic settings and at the same time also justifying the strange alternation between Victorian scenarios in full Spencer Villa style and science fiction laboratories. A lot of fanservice is also grafted into all this which always has its good effect on the large base of fans, with the return of historical figures and the connection to the classic canon, recounting the events that took place between the fourth and the fifth chapter. The effect on Switch remains unchanged: Revelations is clearly a minor production from a technological point of view, but which also finds the right place for this perfectly for a continuation faithful to the tradition of the Resident Evil series, crystallized in a sort of gigantic, wonderful B -horror movies. On the Nintendo console, the game suffers from a certain inconsistency in frame-rate but has an almost perfect reproduction of the graphics sector seen on PlayStation 4 and Xbox One, with excellent image quality in both docked and portable versions. Revelations: Volume Two A little more strange and complex is the situation of Revelations 2, for whose basic characteristics we refer you to the original review. The game was proposed as an episodic mini-series, following the approach of pfirst chapter but diluted here in releases cadenced over time and this did not do any good for the compactness of the experience, which alternates very intense and fun phases with others that are somewhat hair-tight. The source material was perhaps weaker than that used for the first chapter: the iconic power of Chris and Jill has few equals, and although the new Claire is undoubtedly charming and Barry always a buddy, the impact of the two is certainly less in the mythology of Resident Evil, also in terms of the background they carry with them. Overall, however, it is probably the Barry-Natalia pairing that emerges with greater strength, also thanks to the particular gameplay dynamics it brings with it. The fact of being able to exploit the sensitive abilities of the (apparently) defenseless little girl by alternating them with the brute strength of the old warrior is a variation on the theme that is certainly more interesting than the one proposed by Claire and Moira, who however have a more developed narrative substrate on their side, as victims of a sinister and mysterious experiment to be understood. There are truly memorable moments in Revelations 2, especially in those phases in which situations and themes already successfully tested by the series are faced: the siege in the fishing village, the references to the ~Villa~, the progressive unveiling of the story as a sort of dark fairy tale and certain boss fights are worth the entire trip around the island of mysteries, although this is too long overall. The new introductions work particularly well: the different characteristics of the characters and levels lead to a greater alternation of approaches between stealth phases and furious shootings, while a certain drop in pace on the puzzle front is counterbalanced by a more rigorous survival approach, which requires great economy in resource management as well as constant attention to the condition of the companion, as well as an interesting hint of crafting in the construction and evolution of the arsenal. The implementation of split-screen co-op is also a particularly welcome addition, especially in the context of Switch thanks to its always-on ~on-the-fly~ multiplayer. The portable horror Nintendo Switch is not a console like the others and its hybrid nature also transforms the possibilities of using Resident Evil Revelations, giving new energy to both games. Technically these are excellent conversions, characterized by an image quality in general perfectly in line with what was seen on PlayStation 4 and Xbox One but which offer a bit of a side in terms of frame-rate, much more fluctuating even regardless of the 30 fps lock imposed in the second chapter. Some pop-in problems in particular in Revelations 2 and a minor fluidity in the wider and more open spaces represent the out of tune notes, together with really very long loadings especially in the second chapter. Once the defects have been made clear, it must be said that both games also take on particular prominence in the Switch game catalog, still quite sparing of survival horror, and are also perfectly adapted to the particularities of the console, as visible in the control system and in multiplayer implementations. The use of motion sensing with the Joy-Con detached is in fact surprisingly valid, especially for aiming, while the exploitation of local multiplayer ~on the fly~, a real Switch trademark, gives greater depth to both the Raids present in both chapters, and to the cooperative campaign of Revelations 2. As for the latter, the possibility of switching at any time to the cooperative multiplayer in split screen or returning in an instant to the single player makes the option much more usable and opens up new gameplay perspectives for survival horror. Portability is obviously the other characterizing element of this Switch version, and although it is not a particularly sought-after virtue in a game that makes identification its main weapon to unleash fear, the possibility of carrying around the complete experience of two Resident Evil Revelations with all the attached DLC is very interesting. As a small but nice extra, the Switch versions also contain a couple of minigames to unlock: the first is a sort of very basic shooting gallery, accessible from the first Revelations through the Raid Mode options screen; the second, ~Ghosts n' Homunculi~, is a little more complicated to find but definitely more interesting as it is obviously a digression on the Ghouls n' Ghosts theme, you can find the instructions to unlock it in the video below. We also recall that both Revelations, as well as the editions ureleased on the other consoles, they are entirely dubbed in Italian.", "date": "2017-11-29", "grade": "8.0"}