{"name": "Il MMORPG in tasca nella Recensione di Lineage 2: Revolution", "ref": "https://multiplayer.it/recensioni/191690-lineage-2-revolution-il-mmorpg-in-tasca-nella-recensione-di-lineage-2-revolution.html", "text": "There is a relationship of complicated correspondence between the MMO and mobile gaming, which has led to never completely satisfactory results in the search for a synthesis between the characteristics of one and the other. The need to frequently return to these games, the time investment required and the social features are all elements that could be perfectly associated with mobile use, conversely the dimensions of the technological structure on which they are based and the often heavy and complex interface there clearly move away from the standards of the video game in portability, therefore finding a meeting point between the two videogame visions is not easy at all. Lineage 2: Revolution is one of the titles closest to this goal that we have seen in recent years and the work carried out by Netmarble deserves consideration if only for this. To tell the truth, the game is already quite well known, counting two chapters still very popular on PC and has become a real mass phenomenon from South Korea to the large Asian market up to the West, in particular with its transition to full speed free-to-play already happened several years ago. The spin-off Lineage 2: Revolution on mobile platforms therefore represents a far-reaching operation, which is clearly visible in the production values put in place by the publisher, which are reflected in an impressive technical sector. From the beginning, the typical Asian characterization of the MMORPG emerges clearly, with the classic stereotypes of pseudo-medieval fantasy filtered by the new vision of the genre between beefy warriors, charming dark elves a bit emo and sexy scantily clad elves who participate in one of the most classics that can be found in the ambit. All background and perfectly canonical elements for an online role-playing game, whose mechanics on the other hand are based on other characteristics that we find here all in their place: constant progression, conquest of loot and participation by the community (the latter well known, at least for now). All this under a truly impressive graphic system, one of the most advanced seen so far on mobile devices. Asian-style online RPG is in your pocket with Lineage 2: Revolution Quest-o-matic The character selection allows you to choose between human, elf, dark elf and dwarf, and sub-classes such as warrior, ranger and wizard with other variations that emerge later, for a total of combinations actually rather limited compared to what is possible do in other similar products. From here on the development is classic, with main and secondary quests to be carried out that range in different areas but usually concern a quick exploration of environments and the elimination of threats / rescuing prisoners / recovery of objects and various other typical situations of the MMORPGs. There are no particular variations on the theme, with an always linear trend interspersed with numerous fights in which to show off the numerous special skills that the characters learn and evolve along the way, taking part in PvE missions or PvP fights. By default the game is set to auto-play, which simply means that it plays itself: not only the combat, but also the movement to NPCs and places of interest is fully automated in this way, leaving us only the task of pressing the button to read the dialogues and possibly manage the inventory and equipment (however largely automated, the latter too). It's something that leaves you a little stunned but it seems to represent a sort of evolution of the recent trend of the mobile market with clickers and idle games, in this case at least applied to a playful structure of a certain thickness. The option can be removed by resetting in this way the usual mechanics with virtual pad and keys to press: the problem is that the controls are often so uncomfortable that we still want to return to the auto-quest, although this may seem an unnatural solution . On the other hand, it must be said that the game does a really good job of reproposing on portable devices all the typical complexity of the interfaces, menus and options that are usually found in this genre of games. The downside is that a gaming system designed to work best with a mouse and keyboard obviously doesn't adapt perfectly to the touch screen and also on smaller screens such as smartphones the interface can become a veritable hell of icons. windows and tiny writing.", "date": "2017-11-24", "grade": "7.0"}