{"name": "La recensione di Battlerite", "ref": "https://multiplayer.it/recensioni/191366-battlerite-la-recensione-di-battlerite.html", "text": "Battlerite is not a freshly launched title, but one of those that, after a run-in period at a premium price (it cost 19.99), was launched as free-to-play (a bit like what Bethesda is doing with Quake Champions or Epic with Fortnite). Evidently Stunlock Studios don't want him to end up like Bloodline Champions, their previous product, which never really got off the ground. Those who foresee a failure in the style of Evolve do not fear, because in this case the operation seems to have been fully successful: within a few weeks Battlerite saw the number of downloads multiply and shot to the top of the ranking of the most played titles on Steam ( at the time of writing this article it is in twelfth position with almost thirty thousand users on the servers). The basics of combat The above premise was a must to give a first indication of Battlerite: it is currently a very played title and by downloading it you don't risk finding yourself on deserted servers that involve waiting for long minutes before being able to play a game. Now it remains to be seen whether it is really worth dedicating time to it. Battlerite is not difficult to describe, since it is basically an improved version of Bloodline Champions, which is a battle arena between heroes in which players clash in 2v2 or 3v3 matches. A co-op mode against the CPU was also introduced with the 1.01 update, but it's still experimental (and not very exciting, in our opinion). At the beginning you have to choose which of the available heroes to take into battle: currently there are twenty-one, but new ones will be added soon. Of course, each hero has its own particular skills, but in general we can divide them into three large groups: melee fighters, ranged fighters and support heroes. In terms of background, they are all quite poor, as well as from the point of view of design, which relies on a well-tested and insipid characterization. Evidently Stunlock Studios did not feel it necessary to take too much care of the overall insignificant narrative aspect; to compensate is the fact that each of them has nine skills linked to as many keys. The control system is based on the classic WASD scheme, with the mouse used to aim and to execute basic attacks. In short, nothing that hasn't already been seen elsewhere, but here everything works really great. Figuring out how to use the various characters isn't difficult, but mastering them is another matter. For this reason, there are several single player training modes available, such as the tutorial or matches against the CPU, which allow you to develop a certain dexterity and not make a fool of yourself online... at least not a blatant fool. The game system is completely focused on the players' skills, so you have to take into account having to train quite a bit before obtaining acceptable results. Fight Battlerite's fights are frenetic and fought with spells, shields, special techniques to charge, stealth skills and more; the goal is always and only one: to consume the energy bar of the opponents before they eliminate us. The only variant to this formula requires destroying the other team's guardian, although it must be said that the gameplay remains similar and always made up of very fast matches. The arenas in which you fight are very small and all structured in the same way: they develop symmetrically around a central section where a sphere appears from time to time which, when destroyed, assigns bonuses. In some there are traps, in others there are more or less obstacles to block the field of vision, but don't expect maps that require more than a handful of seconds to be fully explored. The entire focus is on clashes. And it is precisely around them that the most intelligent solutions have been adopted, especially those concerning progression: instead of building them around the growth of the characters, however present and important, they have focused on the choice of certain skills at the beginning of each round , skills accessible to all, which defuse the risk of seeing matches go down the drain after a few seconds due to the imbalance of forces on the pitch. Also interesting is the use of mounts, which serve to speed up the action and which disappear when one of the other skills is used (but can be recalled at any time). Imbalances and matchmaking Unfortunately, and here comes Battlerite's first big problem, imbalances have not been avoided in other fields. For example, playing a little you notice that many of the characters are not chosen by anyone, a sign that they are somehow disadvantaged compared toothers. In particular, tanks are snubbed by most, because the greater amount of energy does not compensate for the slowness and ineffectiveness of some of their skills. This means that the selection choices, already not many, are immediately narrowed down, unless you want to incur the wrath of teammates who will accuse us of wanting to make them lose (know that the Battlerite community is pretty toxic). Other imbalances are caused by matchmaking, which often pits novices against veterans. Obviously the former not only end up not enjoying themselves, but also risk losing interest in the game due to the frustration of being slaughtered by players who by now know their trusted hero inside out and know how to best manage his skills. The already reported increase in players on the servers has improved the situation a bit, but it would be appropriate to fix the matchmaking properly, so as to completely avoid eventualities such as those described. At the level of microtransactions we have the possibility to unlock all the heroes by paying (in this case it is not a fault, since we are talking about a free-to-play) or to buy currency with which to access the usual prize boxes, which contain cosmetic items , mounts or experience multipliers and which can also be obtained in good quantities by playing. In general we can say that there are no pay-to-win mechanics, although obviously some of the unlockable heroes are among the best. They can also be obtained by playing, but consider that they cost between 2,000 and 4,000 Gold (the currency of the game) and that you generally win between 18 and 20 gold per game (something more if you consider the objectives to be achieved). In short, maybe you play a little first and then, if you get caught, pay for the All Champions Pack, which unlocks all heroes at once (even future ones). This way you will guarantee yourself even more fun and will repay the developers for their efforts.", "date": "2017-11-17", "grade": "8.3"}