{"name": "La recensione di Injustice 2 su PC", "ref": "https://multiplayer.it/recensioni/191374-injustice-2-la-recensione-di-injustice-2-su-pc.html", "text": "Not even ten days after the start of the beta, Injustice 2 also arrives on PC. The Windows version of the latest fighting game by NetherRealm Studios was naturally in the air, we just had to understand how it would be proposed: a standard edition a few months after its release on consoles, with the same contents and the Season Pass from buy separately, or directly a solution already inclusive of all the DLCs to be published later? Warner Bros. preferred the first option: it may be a bit sorry for the extra packages, integrated only in the Ultimate Edition, but in the end we are talking about a still fresh and rampant title, equipped not only with a spectacular single player sector and substantial, but also a very interesting and well implemented online component. But let's proceed in order. As you no doubt know, if you've read our review of the console version, Injustice 2 takes us back to the alternate DC universe where Superman lost his mind following the killing of Lois Lane by the Joker, deciding to use his fist of iron and to establish a totalitarian regime for the control of the whole world. Opposing this vision are Batman and a handful of other heroes, which leads to an epic confrontation between two opposing factions and the arrest of Kal El. However, a new threat is approaching Earth: the evil Brainiac and his robotic troops they want to take over the planet, and it will take all the help they can get to stop them. Super fucks The plot of Injustice 2 actually starts from afar, specifically from the planet Krypton, which in the storyline created for the occasion was destroyed precisely because of Brainiac. The young Kara El manages to escape thanks to the sacrifice of her mother and in space she sees the ship that will bring her cousin to safety, but once on Earth the confrontation with other heroes and villains will make her understand Superman's totalitarian drift and the reasons why stand against him. The campaign tells this story in an effective and engaging way, taking turns in command of different characters before the final confrontation with the interactive brain, while allowing many liberties in staging balanced fights between figures who in reality possess very different levels of strength. Apart from this, the final result boasts an indisputable quality and impeccable direction, elements supported in the local version by an excellently made dubbing, with the usual Marco Balzarotti in the role of the Bat Man and a cast that covers the various roles very well. In terms of single player content, the offer of Injustice 2 is in any case very rich: in addition to the campaign there is a traditional arcade mode with different endings for each character, but above all the Multiverse mode, composed of a series of challenges within alternate realities, with a sequence of increasingly complex clashes, to be completed by submitting more often to particular modifiers and unlocking with each victory parts of equipment to be assigned to your hero to enhance him in various ways and modify his I wait. Then there is the multiplayer component, both locally and online, with normal or ranked matches that can count on a quick and effective matchmaking: during our tests we did not encounter any problems of any kind, with prompt and precise reactions thanks also to the sixty constant frames per second that the experience must guarantee to avoid any problems in terms of latency and synchronization between users. Heroes and anti-heroes The Injustice 2 roster boasts a large number of new entries compared to the first chapter, fifteen, including Supergirl, Black Canary, Blue Beetle, Doctor Fate, Robin, Firestorm and Swamp Thing. Once again the choice of characters has been very well thought out and there are in fact no clones: each hero or villain boasts a unique style, strengths and weaknesses that must be assimilated and used to the fullest during fights, through the execution of devastating combos, interactions with the scenery (the ones that allow you to break through a wall and fall into a different area of the map are very spectacular), really exciting special and super moves, which can only be performed when the appropriate indicator is full. Thus it happens that Batman tie his opponent to a balloon that is dragged into the skies by the Batwing and then hit by machine guns and missiles before crashing to the ground, or that Superman throws such powerful punches at his enemy on duty that he literally flies for kilometers, or even that Cyborg throws the opponent on Apokolips to make him inflict heavy damage from Darkseid's troops. Each movement has a precise strategic value, references to the mechanics of Morsuch Kombat are evident (see the role of the uppercut or the flying ~dummy kick~) but at the same time NetherRealm Studios has managed to give the experience a precise and concrete personality, a harbinger of great satisfaction when you manage to master a specific character and to become competitive, perhaps even in a multiplayer environment. The PC version Injustice 2 boasts excellent graphics, with highly detailed polygonal models and a rich set of animations, as well as a cutscene system that engages transparently during gameplay to show, for example, supers running at thirty frames per second instead of sixty. There are of course more successful characters than others, for example Wonder Woman's look is perhaps not what we would have preferred, but in general the developers have maintained a coherent and faithful style to the paper counterparts. The scenarios also deserve applause, very varied and equipped with interactable elements that can be used against the opponent, as well as in almost all cases the walls that can be broken down so that the action moves to another area. The quality of the effects, especially particles, and the shaders fielded by NetherRealm Studios make the graphics of the game rather complex to manage, and this is why on PC the real 4K at 60 frames per second are the exclusive prerogative of the GTX 1080 Ti , where on the test configuration we achieved that kind of constant fluidity at 1440p without problems, with all values maxed out. Curiously, the possibility of activating a dynamic system that changes the resolution on the fly does not seem to work at its best, so for the moment we must remain concrete and perhaps also rely on the integrated benchmark to get an idea of the performance we can aspire to. In any case, the fine adjustments are many and include the quality of the textures, the type of antialiasing (available only FXAA and TAA), the quality of the anisotropic filter, the bloom, the dynamic blurs, the lighting and the shadows (these last rendered with PCF or MSM technology), the goodness of the reflections on the screen and of the ambient occlusion, the dispersion on secondary surfaces, the density of the particles and their management, assigned to the GPU or to the CPU.", "date": "2017-11-17", "grade": "8.7"}