{"name": "Si torna ad Alola nella recensione di Pokmon Ultrasole e Ultraluna", "ref": "https://multiplayer.it/recensioni/191163-pokemon-ultrasole-si-torna-ad-alola-nella-recensione-di-pokemon-ultrasole-e-ultraluna.html", "text": "Fans of pocket monsters at this point should be quite familiar with the concept of ~third version~: Pokmon Emerald, for example, came out a year after Pokmon Ruby and Pokmon Sapphire, acting as a cross between the two original editions with some new content, especially secondary, and more pokmon to catch. The third version would be practically the definitive one, designed for those who missed the previous appointment. However, the tradition suffered a setback in the fifth generation: after Pokmon Platinum, Game Freak stopped developing these so-called third versions. Pokmon Black 2 and White 2, in fact, were real sequels, while the following generations, on Nintendo 3DS, have remained orphaned of a definitive version, at least until today. In this sense, Pokmon Ultra Sun and Ultra Moon represent a kind of anomaly: yes, they are third versions, but they come out in two formats. When you judge the third version of a Pokmon, you have to make a series of evaluations more complicated than usual, but the main question remains the same: have you played the previous version yet? Crisis on Infinite Alola For an in-depth examination of Pokmon Sun and Moon, we invite you to re-read our review published last year: as we said above, Pokmon Ultra Sun and Ultra Moon is not a sequel, but a third version in dual format of the two titles that represented the seventh generation of pokemon. In purely narrative terms, this means that you will start your adventure in the Alola archipelago all over again and you will have to face the various tests that will determine whether or not you are a true pokmon trainer, meeting the characters we already met a year ago along the way. including Hau, Lillie, and the various Kahunas. For many players this could already be a determining factor at the time of purchase, because Ultra Sun and Ultra Moon are a continuous succession of dj vu. Fortunately, Game Freak has cleverly exploited the idea of parallel worlds introduced in Sun and Moon. Pokmon Ultra Sun and Ultra Moon, in fact, take place in an alternative universe and therefore the story at certain times develops slightly differently, guaranteeing a minimum of variety even for those who have already played at least one of the two original versions. In reality, the changes made to the narrative plot are based on a somewhat unfortunate compromise. In most cases, in fact, Game Freak has simply shortened the kinematics and the game phases that in Sun and Moon went a little too long: on the one hand, this strategy has streamlined the progression, so as not to bore those who have already passed for Sun and Moon, but on the other hand it excessively diminished the characterization of some supporting actors. The introduction, for example, lasts much less than the very long Pokmon Sun and Moon tutorial. At certain times, however, the detours get quite interesting, thanks also to the addition of a new test and, above all, a completely different epilogue. At the end of the original story, Ultra Sun and Ultra Moon take a drift of their own, introducing the nostalgic menace of Team Rainbow Rocket and the mystery of the legendary pokmon Necrozma. Unfortunately it must be said that the new storyline seemed to us much less interesting than the trailers had made it appear: the unpublished appendix is very short and essentially consists of a series of continuous struggles that leads to the new ending. Obviously this is a completely new narrative content for those who have never played Pokmon Sun and Moon, while those who have already visited Alola will probably have the impression that Game Freak has made a somewhat hasty cut and sew job to justify the sense of this third version. The 3D effect Not received. Ultrathis and Ultrathat In terms of content, Pokmon Ultra Sun and Ultra Moon represent a decisive step forward compared to their standard counterparts especially in terms of ~post game~: with this term we mean the activities accessible once the story of the game is completed, or those that prolong the experience and represent the juice of the gameplay especially if you decide to capture each pokmon and see, much more simply, all that Alola has to offer. However, Game Freak has altered not only the structure of the story, but also the arrangement and variety of little monsters scattered around the islands. Basically, Ultra Sun and Ultra Moon offer about a hundred more pokmon, compared to Sun and Moon, which perfectionists will be able to trade through the usual Global Trade System in an attempt to complete their PokDex. The latter once again assumes the appearance of Rotom and is the protagonist of a new feature, called Roto'n'roll, which essentially unlocks a series of temporary bonuses along the lines of the Power Passes or the O-Powers that appeared in previous generations. Despite these additions, the PokDex remains more or less the same as always and those who have already completed it in Sun and Moon, perhaps after playing X and Y or Alpha Ruby and Omega Sapphire, may feel less stimuli than in the past. In reality, Pokmon Ultra Sun and Ultra Moon introduce some completely new monsters to the Pokmon list, designed specifically for this version, but they are very few and mostly fall into the Ultra Beasts category. Around these mysterious beings Game Freak is building an entire mythology, so much so that in this version it is even possible to visit their worlds - albeit limited to very restricted areas - by crossing the Ultra Wormholes riding Solgaleo or Lunaala: it is a kind of mini-game that also allows you to find and possibly capture practically all the legendary pokmon that appeared in previous generations of Pokmon, albeit divided by version. The problem is that, at this point, those who passionately follow the franchise, at least in its incarnations for Nintendo 3DS, the legendaries may have captured or traded them all long ago. The secondary contents, such as the Ultra Wormholes, make Ultra Sun and Ultra Moon two particularly attractive titles if you haven't played Pokmon for some years, reconfirming our impression that the new version of the seventh generation titles has been designed to bring the new generations closer to the brand, rather than to draw the attention of those who have already spent dozens of hours on Sun and Moon. However, this does not mean that for Pokmon super fans there is little to do or in any case not enough to justify the purchase, especially if they are part of that group of trainers who loves to train pokmon, fight against other players and always find new ways and originals to customize monster teams. The addition of the fun Surf Mantine minigame allows you to accumulate a greater number of Fight Points to invest in the purchase of items or in learning new moves, while a greater diffusion of Chansey and objects that increase the experience points received at the end of the battle , combined with a special power of Rotom, facilitates the growth of monsters to maximum levels. The more experienced players will be able to take advantage of the various facilities together with the Pok Resort to train their perfect pokmon, or dedicate themselves to the new Battle Agency which allows you to fight by renting certain pokmon but which, frankly, seemed to us a rather sterile addition. Perhaps less relevant, but still worthy of mention, is the new mini-game Fotoclub and the search for stickers that allow you to add some dominant pokmon to your team.", "date": "2017-11-14", "grade": "8.4"}