{"name": "La recensione di The Sims 4 per PlayStation 4 e Xbox One", "ref": "https://multiplayer.it/recensioni/191192-the-sims-4-la-recensione-di-the-sims-4-per-playstation-4-e-xbox-one.html", "text": "It's no crime to admit it out loud: The Sims is better on PC. It's more fun, has more comfortable controls, an intuitive interface and allows all players to insert tons of custom material in addition to the canonical expansions. Yet The Sims franchise has an important history on consoles, a past that unfolds on both portable and fixed platforms, and each episode added some small new element to make up for the shortcomings compared to the PC reference chapter. In particular, in the older releases, those for PlayStation 2, there was a rudimentary career mode that prompted our Simmer to leave Mother's House to move to other homes and achieve objectives for each different location; all of this was obviously accompanied by a free Live and Build mode which, however, was heavily neutered on consoles at the time. The idea of adding something different every time like a story mode, third person control of the Sim or minigames and popularity counter (The Urbz) made the experience equally fun but above all different from the PC one. Often these changes are made to increase the longevity of a title, but The Sims has never suffered from this problem: it was not necessary to increase the quantity of hours of play but the quality and above all make them attractive to those who had already spent a lot of them on PC . This is the fundamental problem of The Sims 4, not carving out its own identity compared to the PC counterpart which is obviously better from practically all points of view; here, it should be said, the goal is not to judge the goodness of the game itself, which we have done in the past and with which we have always been largely satisfied, but to focus exclusively on the work done for the console. Visible limits The Sims 4 was a chapter that brought about great discord in the fanbase of the franchise: after a very full-bodied The Sims 3, getting used to an airy and clean interface like that of The Sims 4 was not easy, just as it was not easy to accept at launch the lack of Pools and Toddler in favor of a game that would run on virtually any PC. The latest chapter of the simulator has had the opportunity to redo itself in the following years, offering a flexible add-on model suitable for everyone's wallets, undoubtedly surpassing The Sims 3. The console version also includes expansions but not all those available for PC: only City Life is included among the expansion packs and the game packs are also few (only two, Eat Out and Vampires) while the stuff packs are five in total (Luxury Parties, Dream Outdoors, Perfect Kitchen, Gardens romantic and Vintage Glamour). Before the console version manages to catch up with the PC chapter it will probably take some time ... not that this is a problem, after all, at the release The Sims 4 ~vanilla~ had much less content while this one for the console adds all the free updates available so far (swimming pools, ghosts, half-height walls to name the most important), but knowing that they are available for the PC counterpart and not for the console is a bit annoying. This is why there is no common cloud between the PC and console versions and there is also no online sharing of material between users: the Community Gallery is an extremely strong point of The Sims 4 on PC while for the console version it is, together with the command interface, the strongest castration of the title. Obviously you can share the experience with other players but only in the classic formulas provided by Xbox One and PlayStation 4, mainly snapshots, streaming and integration with social networks. Playstation 4 trophies Playstation trophies are 51 in total, and only 6 are secret. To complete them players will have to commit to fulfilling the aspirations of their Simmers and help them climb to the professional pinnacle of the careers featured in the game. Some are particularly demanding and will require long and patient hours of gameplay, a plus that will certainly please trophy hunters even if, it must be said, The Sims is one of those titles that lends itself to being played even after having ~platinized~ it Step back The biggest problem of having re-proposed The Sims 4 as it is even on the console is felt, as we said earlier, almost more in the command interface than in the absence of ad hoc features: if on the one hand it is possible to replace the lack of a story mode with earning PlayStation Trophies and Xbox Achievements everyone will have to contend with the game's woody control system. The characteristic changes of the old console chapters were in fact aexcellent expedient not only to fill the inevitable gaps with the PC version, but above all they simplified the mechanics and controls. The upheaval operated with The Sims 4 has always been aimed at making the gaming experience more fluid, intuitive and natural and for this reason the console porting seems like a big step backwards: any action, from navigating a menu to issuing a command , always seems to be twice as cumbersome on consoles. The CAS (Create a Sim) is perhaps the one that gives the least problems even if every time you want to select an object you have to press X or Circle to enter/exit the respective submenu instead of simply selecting the desired element with the pointer. Live mode also suffers from this cumbersomeness but only in the command interface, because by observing the action on the screen we notice that the Simmers seem to move as casually as they do on PC. As you could imagine, the game mode that suffers the most from the cumbersome rigidity of the commands is Build because, it is clear, the convenience of a keyboard with quick commands assigned to each key and the fluidity of a mouse cannot be emulated by backbones and analogs of a pad. You can easily get used to it... but only if you don't have a PC experience behind you to regret. The loading of the first boot is a little long, while all the others are kept within an acceptable time limit. The performance of the game in terms of graphics is excellent where we have never encountered problems; however, it is necessary to specify that the PlayStation 4 version provided for the review was tested on a Pro, where in any case the power of the machine did not provide extra graphic customization options in the menu item relating to the video part, which in fact are not present at all. In short, The Sims 4 is an excellent game, perhaps the best that has ever been created for the series but on consoles it can't win its moment of glory, at least for now. Paradoxically, although this version doesn't envy anything compared to its PC counterpart except some expansions, it totally lacks charisma compared to much more obsolete episodes such as Bustin' Out and The Urbz, titles that have seized the opportunity to do something different from their limits . We are talking about a port that follows the PC reference chapter without adding unique features for the occasion, thus leaving room only for the limits: and just a few days after the release of Dogs and Cats (perhaps the most awaited expansion pack in the community ) dealing with the Sims 4 console dampens the excitement a bit.", "date": "2017-11-14", "grade": "7.7"}