{"name": "Sono matti questi mattoncini - La recensione di LEGO Marvel Super Heroes 2", "ref": "https://multiplayer.it/recensioni/191214-lego-marvel-super-heroes-2-sono-matti-questi-mattoncini-la-recensione-di-lego-marvel-super-heroes-2.html", "text": "Four years after the excellent debut on the new generation platforms, TT Games and Warner Bros. try to repeat the resounding success of LEGO Marvel Super Heroes with a sequel even richer in characters and settings, supported by the traditional brick-built humor. In this case, the story sees Kang the Conqueror, an evil time traveler, transforming the city of Manhattan into a sort of temporal patchwork that unites, through a series of portals, scenarios such as Wakanda, K'un-Lun, Asgard, Attilan, Lemuria , Sakaar, Hala, the New York noir of the past, the New York of the future but also ancient Egypt, the Far West and medieval England. The creation of the villain has a name, Chronopolis, and the many heroes of the Marvel universe will have to work together to bring things back to normal, thanks to some crystals from Knowhere and the magic of Doctor Strange; all with a view to a campaign consisting of twenty levels, full of collectibles, customizations and extra missions as usual. Awesome mix The incipit of LEGO Marvel Super Heroes 2 is clever and successful, given that it fields the Guardians of the Galaxy, accompanied by the inevitable ~Come and get your love~ by Redbone, in their formation of the second film, therefore with Groot in version reduced. After a mission on Xandar completed by the various Star-Lords, Drax, Gamora and Rocket Raccoon, the scene shifts to planet Earth, where Kang arrives on his huge spaceship. The time paradox takes place before the Avengers and the other heroes can do anything, finding themselves in the situation of having to repair the damage caused by the evil invader and to fight against the usual villains, further fueled by the prospect of dividing up the new kingdom. TT Games confirms that it wants to play it safe by reiterating the usual gameplay mechanisms, with well-matched teams of characters in which each figure has specific abilities necessary for solving certain puzzles or for defeating the many bosses that we will find along the way, some literally enormous (see fiery Surtur or celestial Eson). The major innovations are actually numerical, thanks to a truly boundless cast and an abundance of locations, although structurally the offer does not correspond to a real open world, but to the traditional hub (represented in this case by the city of Manhattan) from which to access the various scenarios after a short loading, in which we will be able to enjoy an episode of the controversial podcast by J. Jonah Jameson. Invest in the brick TT Games has been making games in the LEGO series for over ten years, and the feeling is that the team is much more comfortable creating parodies of already known stories (see the recent LEGO Star Wars: The Force Awakens ) rather than writing new ones. Unfortunately LEGO Marvel Super Heroes 2 somewhat confirms the negative trend inaugurated by LEGO Marvel's Avengers, managing to elicit a few smiles only on rare occasions and thus losing a fundamental element in terms of experience, which has little else to count on for revive the enthusiasm of users. The elimination of the game over a few years ago has in fact reset the degree of challenge instead of fixing the many distortions of a combat system that is confirmed as chaotic, slippery and unable to make the most of the impacts. The exploratory phase itself inside the hub, when you follow the inevitable celestial bricks towards the next destination, is very boring and lacking in ideas. What's left? The puzzles, some of which are tantalizing and fun, also brought into play during the boss fights, although the formula ~break everything you see and then mount the usual device~ has also remained unchanged. Of course, there is no shortage of collectibles and extra challenges, but this is material that only fans of the series (or those who are fasting from it, therefore finding it relatively fresh) will be able to really appreciate. Playstation 4 trophies The forty-six Trophies of LEGO Marvel Super Heroes 2 are obtained by completing the twenty levels of the campaign and completing a series of specific challenges and actions, such as forming teams that include two versions of Groot and two different Captain Americas. There is no shortage of achievements related to exploration and puzzle solving, such as those obtained by freeing the many Stan Lee imprisoned within the scenario. Heroes, heroes, heroes In short, the experience of LEGO Marvel Super Heroes 2 is weakened by heavily recycled structural and gameplay solutions, by a combat system that shows no signs of improving and even by the lack of effective humor, confirming the fact that reworking scenescelebrating is one thing while inventing something new is another story. Literally. The game certainly has an excellently made Italian dubbing on its side, a feature that should be absolutely appreciated also for the extension of the cast, but even here it is impossible not to notice a couple of big flaws: in the first place, it doesn't make sense that a character like Peter Quill has such an elderly voice, net of a good interpretation, and being the first figure to appear in the game, the initial impact with the localization is not the best; secondly, it often happens that the volume levels of the voices are very different, a problem that afflicts a large number of productions and that we have always wondered exactly what it depends on. As far as the graphics are concerned, unfortunately the situation here too is not the best: the effects are valid and the many superheroes are well characterized, with a decent set of animations, but the frame rate unjustifiably wobbles on some occasions and the management of the lights of Chronopolis really leaves a lot to be desired. Finally a problem with the controls: the flying characters can go up or down both by acting on the right analog stick and on the X and Triangle buttons, but the first action also corresponds to the change of view and this translates into episodes of great frustration when maybe we're walking around the scenery looking for hidden objects.", "date": "2017-11-14", "grade": "7.0"}