{"name": "Contadini ovunque nella recensione di Farming Simulator: Nintendo Switch Edition", "ref": "https://multiplayer.it/recensioni/191072-farming-simulator-nintendo-switch-edition-contadini-ovunque-nella-recensione-di-farming-simulator-nintendo-switch-edition.html", "text": "Farming Simulator isn't quite your typical Nintendo-style product, but as we'll see that's a good thing. Assuming that it is possible to replicate this style by someone other than Nintendo, a simulation of this type would perhaps have been unthinkable on a console from the Kyoto house until a few years ago, but Switch has now accustomed us to deviating from the rule and welcoming diversity as a nice strong point in its lineup. And there is so much different in this game, if you come from a Super Mario Odyssey, Splatoon 2 or Zelda session: Giants Software's style is something extremely far from the typical trappings of Japanese productions, not to mention of the Nintendo style. The first impact, if you don't have some experience in the now long and famous series of agricultural simulations, can be unsettling, with the large play area at your complete disposal and a long series of technical details, menus, actions in precise sequence to carry on to try to grow your own farm. It's easy to get lost in the fields without knowing exactly what to do, and on the one hand it could even be a good thing if the whole Farming Simulator: Switch Edition sandbox didn't seem so inanimate. In fact, we need to change perspective to understand how it works: in fact, it is a tractor-friendly world, whereby each interactable element takes on meaning only in terms of what it allows you to do while driving one of the many agricultural vehicles made available in the game. It is easy to see how the reproduction of the aesthetics and mechanics of the 250 vehicles present is in fact the main core around which the game was built, therefore it is there that the essence of Farming Simulator must be sought, even beyond all those complex management mechanics of the company which are present and represent a large part of the general structure. In short, a fundamental discriminant is created: if you are interested in driving tractors, threshers, harvesters and so on then you are in the right place, if you are looking for a more romantic vision of rural life you will probably have to turn to different titles. It's an obvious thing for those familiar with the series, but a fundamental distinction to remember for Switch users who have never dealt with this simulation. Country boy There is therefore no story, nor any particular sense of progression in narrative terms. Farming Simulator is a ~bare bone~ simulator, one of those that have been rampant on PC for years, proposing every sector of human knowledge on the screen. However, this by Giants is one of the most complete and in-depth productions seen on the market, and this is why it has conquered such a large slice of users, placing itself at the top of the PC sales charts for years now. The Nintendo Switch Edition is based on the 2017 edition, proposing it again without particular modifications beyond the necessary adaptations in terms of controls and interface, and therefore placing itself on a parallel track that detaches it from the ~old~ 2017 version. new game it is possible to choose one of the two settings between the North American and European countryside, the gender of the protagonist (the 2017 edition introduced female peasants for the first time) and then we are ready to go. It should be noted that the game has a tutorial system detached from the game experience: these are still present even in some early stages of the career, but to obtain all the in-depth information on each facet of agricultural work it is necessary to use the ~Tutorials~ section of the main menu. This is a rather valid solution because it avoids the dilution of the experience into a long introductory phase for those who already know more or less precisely what to do and at the same time allows you to deepen each phase in a more exhaustive way, with the possibility of going back to learning precisely each mechanic through the appropriate menu. For this reason, however, it is strongly recommended to resort to the Tutorial for all those who have never had anything to do with Farming Simulator before, to mitigate the unsettling initial effect a bit. For the rest, the game does not set limits or main objectives: everyone is free to follow the path they want to grow their business, between managing the fields, raising animals, cutting wood or all these things together. The rural life Listing and explaining in detail all the Farming Simulator mechanics would make little sense here, in fact it is a question of dedicating oneself to numerous aspects of farm management, with an enormous amount of different actions to carry out. The life of the fields is impegnative and this game can give a vision, albeit obviously sweetened: at all times there is something to do between plowing, sowing, harvesting and managing raw materials in various ways, choosing the products to focus on to get the maximum profit. The heart of the game lies in the use of vehicles, which as previously reported are numerous and perfectly reproduced from real models. Every single aspect can be managed manually, with the possibility of investing long minutes or even hours (real, of course) on individual uses such as threshing or the transport and transformation of wood, hay, wood chips or chaff, or you can simply start the business and outsource various aspects of the job to workers who can be hired at the push of a button. Obviously all this has an influence on the general balance sheet of the company, therefore we must try not to exaggerate and manage the economic resources strategically, sometimes even agreeing to work on behalf of third parties until the possible purchase of further fields to expand one's business. Although every single job is rather repetitive in itself, therefore, the quantity of possible activities and the fact that they interconnect with each other in complex production paths make the game action extremely varied, as long as you don't set yourself up to carry out a one job for too long. Honestly, spending 30 real minutes picking potatoes can easily be boring, but the possibility of being replaced by a worker at any time and thus having the opportunity to devote yourself to something else greatly mitigates the heaviness of the game. Another good idea to reduce time and immediately allow for a broader and more stratified management of activities is the possibility of renting any vehicle and tool and buying raw materials directly, which frees us from the expectations of having to accumulate large amounts of money in order to perform certain activities. Clearly, all this complicates the management of the company budget, but it is something that we must always keep in mind in Farming Simulator. I love you o pious ox The ~reduction~ of Farming Simulator 2017 in this Switch Edition did not hit the graphics system too hard (already quite simple by itself) but we are certainly not at the levels of the more advanced versions on PC. It is evident that the utmost care is once again placed in the reproduction of the vehicle models, which are also excellently represented here, but the surrounding scenario has something bleak about it. With effects and texture quality reduced to a minimum, as well as a stable but decidedly not lightning-fast framerate, the Farming Simulator: Nintendo Switch Edition campaign is not exactly the maximum expression of bucolic aesthetics, with the representation of fields, hills and settlements which appears very thin and essentially lifeless (although it is a functional choice to the game mechanics, as mentioned above). In all of this, the best impression probably comes from the use in the portable version, where the breadth of the sandbox on the small screen of Switch still gives a good feeling of open pocket countryside, except to encounter some problems with the interface. The latter suffers from the classic syndrome of complex simulations adapted from PC to console: the amount of menus, windows and texts to manage does not adapt very well to a small screen, complicating viewing and reading in a way that obviously is not found when playing on the TV. Similarly, even the controls are not exactly immediate, requiring a long practice to be learned: given the quantity of possible actions for each vehicle and instrument, it is necessary to resort to combinations of keys and modifiers that activate various contextual sub-menus, for which one often has to resort to reading the instructions on the screen (which fortunately always appear superimposed). Considering the nature of the game, Giants has still done a great job of adapting all the complex aspects of the simulation to consoles.", "date": "2017-11-10", "grade": "7.2"}