{"name": "La recensione di Sonic Forces", "ref": "https://multiplayer.it/recensioni/190991-sonic-forces-la-recensione-di-sonic-forces.html", "text": "October was the month of the return of Super Mario in 3D, November opens with that of the fastest and most irreverent hedgehog on the planet. Accompanied by the release of Sonic Forces: Speed Battle for mobile platforms, Sonic Forces darts like mad on consoles and PC, offering a more mature and less cartoonish title than Sonic Boom. SEGA has thought of Sonic 2017 as a very serious matter, first with the Sonic Mania pack dedicated to nostalgia and then with a real 3D adventure, which aims for the quality of Sonic Adventures. Or at least, it tries. Sonic Forces or Sonic Avengers? What would happen if at the time of the umpteenth, repetitive fight between Doctor Eggman and Sonic, the latter had the worst? But our hero can't lose anyway, right? Instead he loses. Sonic Forces begins where the adventures of the hedgehog (apparently) end: Doctor Eggman this time went heavy on steroids, creating a super-villain so powerful that he slapped and captured Sonic after the first two minutes of the game, leaving us the task of saving him. And this is how the plot of Sonic Forces becomes that of any cinecomic reduced to the bone, which you may like and may not like, but is undeniably trivial at every point. Good guys versus bad guys, save the world or see it destroyed. On our side are all the main heroes of the franchise, of course Tales, Knuckles stand out, but also the lesser known Rouge The Bat, Silver and Vector The Crocodile. From that of the villains Eggman and his army, made up of Chaos, Metal Sonic, Shadow, Zavok (another welcome return) and the beast created by the scientist for the occasion. That's not all: the little justified presence (at least within the game world) of the player's avatar is added to the cast. You can create your own playable character from scratch, customizing it in almost every detail, starting from race and eye color to wearing a motorcycle helmet and yellow slippers. Imagine a wolf, cat, or porcupine dressed like this, and fighting against Eggman's army. Sonic Forces makes your most secret desires come true, allowing you to let your imagination run wild. Too bad it goes a little further. At full speed you risk slipping The Sonics in 3D, with rare exceptions, have always been characterized by a mix of side-scrolling levels (in 2D, maximum 2D and a half) alternating with front-scrolling sessions (true 3D). An interesting and now consolidated formula, but also dangerous in a title in which speed and precision are fundamental aspects. Sonic Forces does not innovate in any respect what we have already come to know, for example, from a Sonic Generations, except that the 2D stages are present in a more limited number than in the past. As always, the player is required to collect as many rings as possible, eliminate the robots along the way, catch the red rings (more or less hidden) and reach the finish line as soon as possible, thus obtaining a high score that can also be shared online. Beyond the repropositions (even of the game levels, as always), Sonic Forces is a pleasant title, moreover accessible to everyone. Suffice it to say that we tried the difficult mode on PlayStation 4, ending up KO a dozen times in all, half of which due to controls suddenly becoming woody or unresponsive. In this sense, the physics of the jumps, especially the lateral ones in the 2D phases, has not improved compared to the past and makes the platform phases too often frustrating (not to mention that they slow down the pace of the game). The gadgets supplied to our hero also seemed unconvincing, and which can only be used by him, including a flamethrower, extendable harpoons, and jetpack-like devices that allow you to reach high points without the support of platforms. None of them manages to vary gameplay that is fundamentally always faithful to itself, nor the few action phases, and very often the special weapons reveal what they really are: a diversion that reminds the player that he is not controlling Sonic, but his puppet. Not even in the boss fights are they exploited adequately, where perhaps more could have shown the meaning of their existence. Playstation 4 trophies Sonic Forces platinum is not an impossible feat for trophy hunters. About twenty hours should be enough to replay the same levels several times, collecting all the collectibles, eliminating a certain number of enemies, and completing all the side missions. A repetitive task, sometimes frustrating, but never really difficult. The look isAll The developers have invested a lot of time in customizing the protagonist's avatar, caring more about the appearance than the play style of a character who is not as fast as Sonic nor can he spin to eliminate enemies. By completing the levels it is possible to unlock an indefinite number of new wearable accessories, as well as new equippable weapons. The problem is that everything is resolved in terms of aesthetics and little else, moreover in a title in which we cannot always decide to use our favorite alter ego. Depending on the levels, in fact, we will necessarily have to go back to wearing the shoes of Modern Sonic or Original Sonic (the little one from the Megadrive Era, in short), in still others we will even control both Modern Sonic and our avatar without name, in a cauldron of different situations but all equally linear, never really convincing. In short, the basic idea of personalizing the adventure is not wrong: but SEGA does not seem to have wanted to dare to the end or adequately take care of the potential of the new character in terms of gameplay.", "date": "2017-11-08", "grade": "7.0"}