{"name": "La Recensione di Se mi ami", "ref": "https://multiplayer.it/recensioni/190707-se-mi-ami-non-morire-la-recensione-di-se-mi-ami-non-morire.html", "text": "A good story comes from several factors, and the way it is told is one of the fundamental elements to take into consideration. In recent years we are witnessing a sort of new experimental wave on the narrative potential of video games, between walking simulators, ~environmental~ and emerging narratives that are based on the concept of exploring the specific characteristics of the medium rather than on the composition of contents of a certain level , and the beauty is that the impact can be devastating. This is the effect of If you love me, don't die, the new title from The Pixel Hunt team built under the guidance of Florent Maurin and inspired by real stories about the tragedy of the civil war in Syria. The name derives from a Syrian phrase which is a sort of warning between lovers: ~take care of yourself, don't you dare die before me~, which perfectly sums up the conditions in which the married couple protagonists of the story find themselves. Leaving aside the now sterile questions on the adherence of this title to the canons of the videogame industry, which by now smack of anachronistic, let's say immediately that it is not a question of a classic videogame to all intents and purposes but of an interactive story, which allows the player to take some choices in the form of advice and indications sent to a virtual interlocutor within a chat, which lead to different decisions and consequences up to one of the 19 different endings foreseen by the developers. The idea of a telematic meta-communication is not completely new (for example Lost Phone comes to mind) but it has rarely been staged with this vividness and the scenography in which the events take place give the story a remarkable impact, but the everything was handled with great skill by the team. Taking inspiration from the stories of Syrian migrants and refugees can be a simple way to give visibility to a project, risking trivializing the topic or marching on it in a hypocritical way, for this reason If you love me, don't die it is even more a successful experiment: because it manages to be both light and incisive, alternating light and ironic dialogues with moments of unheard-of gravity, which can lead to tragic and penetrating drifts. If you love me, don't die is a story of love and war that leaves its mark The most important chat in the world Everything takes place like a whatsapp-style chat between the player, who plays the role of Majd, and his wife Nour who has decided to try to escape from Syria, preceding her husband towards the hope of salvation abroad with the idea of then be able to rejoin on arrival. Of course, migration from a war zone is extremely complicated and the whole story takes on the contours of a sort of adventurous journey across armed countries and borders, with the constant risk of losing communication, or losing one's life. The chat takes place in a kind of ~real~ time made up of moments of intense exchange and then pauses, so as to give the illusion of a real dialogue with a person traveling: it is possible to compress the times by scrolling the game without a solution of continuity but this particular mismatch makes the narration more engaging and in some moments, when Nour finds herself in situations of greatest danger and the pauses in communication become long, it is easy to find yourself truly apprehensive for her, welcoming the notification with a certain relief with the received message that can arrive at any time. Obviously, an enormous amount of unforeseen events and dangers complicate the woman's journey and the fact that these are probable facts, based on the real testimonies of Syrian refugees, cannot fail to make us think - we who live on this other side of the barricade - more directly on various concepts that we now tend to take for granted. However, the beauty of this title is precisely the fact that it lets us enter his world without forcing it: it doesn't have the air of an educational documentary, nor does it rely on easy affectations to tell the drama. Majd and Nour converse amiably, bicker, tease each other with ironic jokes as two close-knit and brilliant spouses would do and it is precisely this realistic characterization of the characters that makes us get in perfect harmony with both. Finding ourselves in the role of the calm and prudent Majd, we make his concern for the fate of the stubborn, adventurous but also generous and fragile Nour our own and the worst eventualities strike us deeply, easily leading us to retrace the entire story to try to change the choices made and reach more positive endings.", "date": "2017-11-01", "grade": "9.0"}