{"name": "La recensione di Nights of Azure 2", "ref": "https://multiplayer.it/recensioni/190576-nights-of-azure-2-la-recensione-di-nights-of-azure-2.html", "text": "Far from being an unforgettable title, Nights of Azure has nevertheless managed to be talked about and to carve out a niche of admirers, thanks to some peculiar characteristics that have distinguished it from many other JRPGs: first of all, the splendid artistic direction, both visual and musical level, but also the delicate love story of the two protagonists. Gust - a company also and above all known for the Atelier and Ar tonelico series - should have adjusted the shot on various critical issues, and in a certain sense it did, but not entirely, and in other respects it took several steps backwards . Nights of Azure 2 comes out in a difficult period for our country (in Japan it has been available since last August, when there was no competition that there is this autumn) and unfortunately it was difficult to find a good reason to recommend the purchase to those who have not become a die-hard fan of the series. The Corpse Bride One of the problems that Nights of Azure had and that Gust clumsily tried to solve in this sequel was the story and, more specifically, the interaction with the cast. The supporting actors of Arnice, in the prequel, were more or less specks that had little influence on the main mission of the protagonist: to save her beloved Lilysse, destined to be sacrificed to appease the wrath of the Lord of the Night, a demonic creature who had brought to her knees an alternative version of our nineteenth century. Nights of Azure 2 is set in an unspecified period but following the events of the first chapter, so much so that Arnice also returns in this episode, albeit very different from how we knew her. Together with her, the new protagonist Aluche is joined by some characters that Gust has characterized very well, such as the assassin Veruschka, the mysterious doctor Camilla and the nice chocolatier Elenor. Aluche intends to find a way to prevent her beloved Liliana from being sacrificed to the Queen of the Moon, a demon who... wait a minute. But it's the same plot as the previous episode! Nights of Azure 2, in fact, does not differ much from the plot of the prequel, proposing almost the same narrative plot with the addition of a kind of sentimental triangle formed by Aluche, Liliana and the combative Ruenheid, a childhood friend of both who, having discovered the machinations of the Curia, decided to join the Order of Lourdes. In this second Nights of Azure, as you can guess, Gust pushed the accelerator hard on the ~yuri~ themes - a Japanese word that expresses the same-sex relationship between women and girls - and in a certain sense he ruined one of the best features of the previous episode: in the first Nights of Azure, the bond between Arnice and Lilysette was implicit and told with a delicacy that leveraged the player's intelligence, but in this episode the developer has set aside every subtlety and the result is that, contrary to as far as one might think, it is not clear what the relationship that unites the three friends is. The decision to implement a thermal spring, in the hub called Hotel Eterna, whose usefulness is basically to show the protagonists in bathing suits, underlines Gust's intentions quite clearly, and it's a shame because Nights of Azure stood out from many Japanese titles precisely because of the original and detached way in which it represented its heroines. Playstation 4 trophies To unlock the platinum trophy you must first earn two gold, seven silver and 42 bronze. You'll need to complete the adventure, acquire every Servan, and max out your bond with every Lily, meaning you'll have to replay the adventure more than once. They serve my desires Even structurally, Nights of Azure 2 is very reminiscent of the previous episode, but Gust has implemented changes to the combat and progression system that made us turn up our noses. Aluche has a limited amount of time to complete each chapter of the story, under penalty of Game Over, and in the minutes available to us we will not have to fit only the main missions, but also the numerous secondary tasks that are unlocked as the adventure continues . They often force us to visit and revisit the same areas, grinding the minions of the Queen of the Moon, and although it is possible to extend the time limit by investing the points earned by Aluche in the appropriate skills or by defeating certain enemies, this practice soon becomes repetitive, also because at some point it becomes impossible to complete every side mission. Some of these improve the affinity between Aluche and her ~Lily~ companions who can join her in battles, unlocking optional skits, new toability and other bonuses: this means that players who want to see every content of Nights of Azure 2 will have to finish the game more than once. Another important change concerns the combat system, as we said, and more specifically the management of Servans. In the first Nights of Azure, Arnice could choose a maximum of four and fight together with them, but in Nights of Azure 2 you will only have to select two, since the last place in the party will be occupied by a Lily. This change goes hand in hand with the emphasis that Gust has placed on the action component, rather than the RPG one, so much so that thanks to the various special attacks and abilities of the Lilys and Servans, the fights resemble those of the games belonging to the genus ~musou~. Even here, however, we encountered many problems. For starters, Servans grant certain abilities that you need to use to solve certain environmental puzzles, and this means that you will often have to switch Servans, wasting precious time. In addition, there is something wrong on a technical level as well. Graphically Nights of Azure 2 is only slightly improved compared to the prequel which, despite being conspicuously the son of the last generation, managed to maintain a rather stable frame rate. This time, however, we encountered frequent cases of stuttering and various drops in frame rate that made the most complicated fights decidedly frustrating. In this sense, not even the level of difficulty came to meet us, particularly badly balanced especially in the final stages of the adventure, both due to some unexplained peaks and due to the incomplete artificial intelligence that controls the Lilies.", "date": "2017-10-31", "grade": "5.8"}