{"name": "La recensione di Assassin's Creed Origins per PC", "ref": "https://multiplayer.it/recensioni/190578-assassins-creed-origins-la-recensione-di-assassins-creed-origins-per-pc.html", "text": "Usually when a new chapter of Assassin's Creed comes out, as soon as possible, people try to immerse themselves up to their heads in the freedom of action that the franchise historically grants, climbing the highest towers of the scenario in order to admire the panorama. It is a sort of instinctive quality control, a ~show me this time what the developers have done~ which derives from the origins of the series, capable of giving breathtaking views from the beginning: the roofs of Acre, Damascus and Jerusalem first, those of Florence and of Renaissance Venice then, passing through Rome, Istanbul, colonial America, the Caribbean, revolutionary Paris and the smoky London of the Victorian era. Well, it will seem strange but during the first hours of Assassin's Creed Origins this need appears nuanced, almost forgotten, and we find ourselves a little lost in front of the unprecedented approach used by Ubisoft Montreal. The combat system has changed, in the philosophy and even in the mapping of the commands; exploration is different, now much more valued and ~adventurous~ in its continuous discoveries; there are many elements that undoubtedly derive from The Witcher 3: Wild Hunt and which make the experience exciting, dense, multifaceted. Thus it happens that the spectacle that was previously sought on the tops of the towers has been brought to the ground, at eye level, which can be found in the daytime landscapes that alternate between gold and blue tones, in the sunbeams that filter through dense vegetation and they are refracted on the surface of the water, in the details chiseled on the floors and columns, but also in the flames that illuminate a freely recallable night phase, along the lines of the latest Metal Gear Solid. In short, are we faced with a title that perfectly embodies Ubisoft's ambitions? No, but it comes close enough and certainly lays the foundations for a bright future, contradicting the predictions of those who two years ago spoke of a franchise inevitably destined to decline. And so, after analyzing the PlayStation 4 and Xbox One versions of Assassin's Creed Origins and having dedicated an in-depth look at the game's performance on Xbox One X, here we are, as usual, talking about the PC version. How I wish I lived in Egypt The Assassin's Creed series undoubtedly has the merit of having stimulated a certain degree of enthusiasm around the tourism linked to the settings of the various chapters, and Origins is no exception, although most of the evocative panoramas visible in the game are the result of a mere reconstruction , however fascinating and elaborate, given that certain places no longer exist or have completely changed their face over the centuries. This does not mean that the show offered by this new production is visually extraordinary, as mentioned an alternation of gold and blue which in fact continues the path begun by the development team with Black Flag and enriches it from every point of view. The water is the same, splendid, that we had appreciated in the role of Edward Kenway, while the huge desert lands that can be explored on horseback recall the adventurous and sometimes unpredictable approach (at least in Patrice Desilets' intentions) of the first Assassin's Creed. Perhaps a wanted homage, which somehow underlines how this episode is back down to earth from a gameplay point of view, ready to surprise us in less canonical and inflated ways than what we had been used to over the years. Curiously there is a bit of Altair also in the fights, as mentioned revolutionized in the approach and in the controls: in clear contrast with the figure of the Assassin as an unstoppable war machine, capable of ringing dozens of killings and leaving in its path a trail of corpses, Assassin's Creed Origins proves to be very concrete in telling us that no, that particular quest requires a higher level of experience and trying to complete it all the same could easily lead us to defeat once faced with tougher, more cunning and better equipped than us. Promises that in the long run lose coherence and are not kept to the end, it is true, but in any case strong symbols of a renewal in deeds, not just in words. In this sense, the new skill tree appears very interesting, but above all the RPG vision that characterizes weapons and armor, no longer side elements but protagonists of a more varied and full-bodied combat system, although at times not very refined. Aspects of the experience that establish a very solid backbone, not free from structural repetitive traits but certainly capable of entertaining for dozens of hours, supported moreover by an engaging and intelligently forward-looking narrative. The PC version Beyond a few declarations in favor of marketing, it is clear and evident how Assassin's Creed Origins gives its best in the Windows environment, provided of course that cutting-edge components are used. To get real 4K with (almost) all the effects maxed out and a stable 60 frames per second you need a GTX 1080 Ti, that's clear, but the incredible abundance of graphics adjustments allows you to enjoy the experience to the fullest even on PC lower-end. In our case, we inaugurated the test with a small check, that is by launching the previous installment of the series, Assassin's Creed Syndicate, with similar settings to compare its performance. The chapter set in London does not boast the richness and atmosphere of Unity, we have already had the opportunity to talk about it, but the computational load appears extremely similar to that of Origins, although the latter uses a much more complex lighting system, capable of stress the GPU when multiple volumetric light sources are refracted on the scenery at the same time. In this sense, the conspicuous difficulty of the game with the cutscenes in real time, which are rendered using substantially improved polygonal models, can be explained, but we imagine this is an aspect on which Ubisoft will be able to intervene with the next updates. As mentioned, the options are many: in addition to the choice of resolution, refresh rate, field of view, vertical synchrony and any frame limiter, a scaler is immediately present that allows you to optimize game performance while without changing the resolution output. In short, those who do not want to identify this or that heavier feature to increase the frame rate can only act on that modifier to obtain the desired results. The fine adjustments are in fact many: we start from the general preset and from the adaptive system (which dynamically changes the resolution to respect the selected frame target) to get to the quality of the antialiasing, from the shadows to the details of the environment, from the textures to tessellation, from the ground to random elements, from fog to water, from reflections to volumetric clouds, passing through the details of the characters and their textures to finally arrive at ambient occlusion and depth of field. Well, how did Assassin's Creed Origins fare on the test setup? By selecting the real 4K and setting all the effects to the maximum, the game ran at 30 frames per second, however suffering from quite evident drops during some situations and, in particular, in the cutscenes. By disabling antialiasing (which obviously does not have this incredible effect in Ultra HD) and bringing the quality of the shadows to ~high~ we instead experienced great stability, also guaranteed by the ~background~ vertical synchrony, activated via the NVIDIA control panel . Assassin's Creed is a title born with 30 frames in mind, but wanting to play it at double the frequency with a GTX 1070? It is of course possible to do this, but to obtain 60 stable frames without uncertainties it is necessary to act on the scaler we spoke about previously, bringing the percentage of the 2160p resolution to 60% or 70%, depending on any overclocking. In short, we are talking about something very close to 1440p, probably the reference resolution used on Xbox One X, but for a doubled frame rate; and this makes us think that this time Ubisoft really did a great job in terms of optimization.", "date": "2017-10-30", "grade": "8.5"}