{"name": "Un sacco di nonogrammi nella recensione di Picross S su Switch", "ref": "https://multiplayer.it/recensioni/190549-picross-s-un-sacco-di-nonogrammi-nella-recensione-di-picross-s-su-switch.html", "text": "It is difficult for a puzzle game lover not to know Picross, given that the Jupiter Corporation series has been hanging out on Nintendo's portable platforms since the Game Boy era. The formula is always the one based on the nonograms, i.e. the grids with the cells to be colored by interpreting the indications provided by the numbers on the side and above: if you correctly solve the puzzle, a hidden image will appear on the structure. As simple to learn as it is rewarding, especially with the more complex puzzles, Picross has experienced a particularly happy period thanks to the encounter with the handhelds of the Kyoto house equipped with a stylus, given that this input method marries optimally with the mechanics of game offered. It is no coincidence that for many fans Picross DS remains the best episode of the series, but also on the 3DS eShop there were seven chapters of the Picross series and they proposed an episodic solution at a (more or less) regular cadence which recalled the publication of magazines such as Enigmistica Week. The leap to Nintendo Switch was therefore awaited by the niche of enthusiasts with particular curiosity, given the substantial differences in the hardware capabilities of the new hybrid system, which could have offered potential to be exploited in an intriguing way. Unfortunately, however, the final result cannot be said to be fully successful. Puzzles for two Picross S arrives on the new Nintendo console once again via digital delivery on the eShop, at the intriguing price of only 7.99: an extremely low figure, probably destined to tease even those who may have never got their hands on a previous episode. The feeling is that the Jupiter Corporation itself wanted to understand this chapter as a sort of introduction to the concept for new players rather than offering content of particular interest to longtime fans. The reason for this assumption is substantially given by the particular structural simplicity of the Picross S offer, which one could even say poor from some points of view: you can only face the normal picross or mega picross, for a total of 300 puzzles which in in reality, as we will see later, however, they are 150. The learning curve is very smooth: in addition to the extensive tutorial capable of taking the novices by the hand explaining all the basic rules, the progression guarantees nonograms initially of reduced size and difficulty, with both then progressively growing from 5x5 up to 20x15 . As if that weren't enough, it is possible to activate a whole series of aids and suggestions in such a way as to simplify the experience, perhaps for the younger ones or for those who do not have particular patience skills. It is clear that in this case the sense of the whole work is somewhat lost, but on the other hand, since they are all optional concessions, one cannot complain too much. More criticizable is the fact that, unlike in the past, now coloring a wrong cell does not determine any time penalty: the result is that now the attempt is no longer hindered in any way, taking away a good chunk of the sense of challenge . What leaves another bitter taste in the mouth is the later discovery of the fact that the Mega Picross, i.e. more complicated variants of the basic formula in which the numbers suggest the cells to be colored in two adjacent rows instead of just one (it is much harder to explain than to understand), offer the same designs already present in normal picross. A choice that increases the feeling that Picross S was made with a certain laziness, in an all too cold and academic way, with the intention of packaging a product that is competent but overall bland and without any particular cue. In this situation, only partial relief is found by the introduction of an unprecedented two-player mode, in which each user holds a Joy-Con trying to collaborate in solving the same single nonogram. The presence of a score counter linked to the number of correctly colored cells gives the whole a balance between competition and collaboration which makes the final result at least pleasant. It should also be noted that it is not possible to interact with the puzzles via touch screen, limiting everything only to the crosses and keys of the controllers. Finally, the aesthetic component, absolutely minimalist but clean and pleasant, goes well with the background music, succeeding in promoting concentration without giving any reason for distraction.", "date": "2017-10-30", "grade": "7.0"}