{"name": "Vincere la paura del buio nella recensione di Yomawari: Midnight Shadows", "ref": "https://multiplayer.it/recensioni/190415-yomawari-midnight-shadows-vincere-la-paura-del-buio-nella-recensione-di-yomawari-midnight-shadows.html", "text": "Last year, just in this period, we published the review of Yomawari: Night Alone, a particular survival horror for PC and PlayStation Vita created by the developer Yu Mizokami in collaboration with Nippon Ichi Software. Imbued with references to oriental mythology, the title based its conceptual framework on the ancestral fear of the dark that one usually feels at an early age, putting us in the shoes of a tiny and defenseless little girl. Well, exactly twelve months later Yomawari: Midnight Shadows restarts from those bases by telling a new story that intertwines the destinies of two other young protagonists, for the first time also on PlayStation 4. Story of a friendship Little Yui has just learned about the world, yet life has already been hard enough for her. First the loss of her father, then that of the little dog Kuro to whom she had become so attached, and now that sense of loneliness knowing that Haru, her best friend, will soon change city and perhaps one day forget her. The specter of loneliness is difficult to accept, but Yui decides to spend one last evening next to her playmate. Together they decide to head to the top of the mountain overlooking the small town, where they plan to see a fireworks display. When the fires are over and the two girls are walking home hand in hand, a sinister voice makes them hesitate about what to do. Yui wants to go and check on her own and suggests Haru hide in a bush to await his return. As it is easy to understand, things will not go the right way at all and the paths of the two girls will separate under mysterious circumstances. The narrative incipit is functional to the renewed game structure that outlines Midnight Shadows compared to its predecessor. Haru will start looking for his missing girlfriend, but in certain stages of the story the player will also take on the role of Yui, in an attempt to guess what is happening and where the girl is actually over. Just as happened in Yomawari: Night Alone, you will have to explore the city map in the middle of the night, armed only with a flashlight, trying to evade the dangerous presences that lurk in the darkness. That sense of incumbency and anguish that we had already experienced is also in this case transmitted by the sound input of the heartbeat - effectively transmitted by the vibration of the DualShock 4 - which can be perceived when a threat lurks nearby. When the entities start chasing the protagonists to kill them, the pulsations become increasingly strong and incessant, further limiting the user's ability to move. Again, you don't have to deal with energy bars or life points: one hit is equivalent to certain death and forces you to restart from the closest checkpoint. Since Yui and Haru are essentially defenseless, the main tool at your disposal provides for careful movement management, entrusted to the stamina indicator that appears at the bottom of the screen. Alternatively, you can decide to turn off the flashlight and take small steps so as not to be identified. The only objects that can be used to gain some advantage are stones or paper airplanes recovered from the ground, which in some cases serve to distract the entities that materialize along the way. If necessary, it is still possible to take refuge in safe places such as bushes, boxes or lockers, waiting for the situation to calm down outside, at least in appearance. Playstation 4 trophies Trophies Box: Yomawari: Midnight Shadows offers 34 Trophies, all secrets with the exception of Platinum. Some are strictly tied to the completion of the story, others are unlocked after repeating certain actions. For example, it keeps track of the number of times you die, the number of times you hide, and so on. Danger lurks where you least expect it Compared to Yomawari: Night Alone, the main novelty of this new adventure concerns the introduction of a series of levels set inside buildings, which alternate seamlessly with the sequences experienced on the street. We soon realize that this contrast has benefited the experience as a whole, guaranteeing a discreet step forward compared to the monolithic sensations that the previous adventure had given us. The presence of two characters and a better contextualization of the situations that occur help to keep the player's interest and curiosity alive for longer. The indoor phases basically involve the escape from the dark presences, but the approaches and actionsto be accomplished turn out to be more varied and well-defined. Despite having doubled in size, the structure of the map has remained substantially unchanged: by continuing one step after another in the research activity, it is possible to identify new paths and one can get a slightly more precise idea of the places they are crossing. Even the appearance of the scenario does not show major variations, still divided between the normal streets of the town and the wooded areas located on the edges of the map. Again it is possible to save the game by reaching one of the small statues scattered throughout the area, which must be activated by investing coins. At the same time, you can teleport from one focal point to another to avoid needlessly retracing the areas that have already been thoroughly explored. Nonetheless, there are some differences also on this side; the number of coins that can be recovered from the ground has increased compared to before, so there is no risk of running out of juice when you get close to a save. At the same time, simple but effective clues have been introduced to direct the player in one direction or another. More specifically, the presence of crows on the road indicates that you are moving to the correct area, while in the indoor phases the same function is performed by the rats. At various moments in the story, the cute little dog Chaco also intervenes, which must be followed to access the subsequent stages of the story. Beyond the changes and improvements made, Yomawari: Midnight Shadows still remains oriented towards ~trial and error~ dynamics. It is often necessary to have the patience to learn the most favorable paths and weigh the most suitable strategy for overcoming each danger, bearing in mind that if a specific threat seems insurmountable it is only because one is not moving towards the correct goal. The silent atmosphere of Night Alone has remained unchanged; the deliberate absence of a soundtrack allows you to enhance ambient noises, which is why it is particularly recommended to play wearing a pair of headphones. The sound of footsteps, the increasingly frenetic heartbeats and the deaf sounds of the creatures are in fact more than enough to provoke emotional reactions in the player. The absence of localization in Italian is also confirmed, although the texts are very basic and do not require in-depth knowledge of the language to be understood.", "date": "2017-10-27", "grade": "7.8"}