{"name": "Un'altra odissea nella recensione di Etrian Odyssey V", "ref": "https://multiplayer.it/recensioni/190430-etrian-odyssey-v-beyond-the-myth-unaltra-odissea-nella-recensione-di-etrian-odyssey-v.html", "text": "Etrian Odyssey is now an almost annual appointment with Nintendo 3DS and its niche of fans who punctually catapult themselves into the labyrinths of a fantasy world that Atlus has scattered with traps, enemies and puzzles. The series made its debut in 2007 on Nintendo DS and landed on Nintendo 3DS in 2013 with Etrian Odyssey IV: between that adventure and the new chapter we played the remakes of the first two episodes, subtitled Untold, and a spin-off crossed with the popular franchise of the Mystery Dungeons. It was therefore time to return to the main iteration, especially now that the attention of developers and users is shifting more and more to the new Nintendo hybrid console. Switch could welcome the future of Etrian Odyssey, a series strongly anchored in the past that with this fifth episode has shown us two things: there is still room for old school RPGs, but Etrian Odyssey is beginning to feel the need for more novelty concrete. More and more sophisticated For the avoidance of doubt, we want to immediately premise that Etrian Odyssey V, in terms of gameplay, is simply the best title in the series. In this version Atlus has absolutely indulged itself, implementing a series of content innovations that make it more complete and multifaceted than ever. We obviously start from the creation of the characters, from five to thirty at the beginning of the game, which also allows us to choose the race of our adventurers: it determines the classes they can interpret and the starting statistics, as well as their growth at each level up. The personalization of our favorites continues with the choice of some aesthetic parameters which include, in addition to the usual illustration, the colors of some details such as hair or eyes, as well as the tone of voice, male or female. The four races differ according to the typical canons of fantasy, therefore the Celestrian elves, for example, being more inclined towards the magical arts, are the only ones who, at the beginning of the game, can be Warlocks or Necromancers. It is important to underline that ~at the beginning of the game~ because, in reality, already in the very first hours, it is possible to change the class of each character. However, this mechanic seemed to us to be a clumsy and poorly reasoned implementation, given that the starting statistics of each race strongly affect the performance of the characters, limiting the choice of a new class to those more suited to the character's race: it is much better to continue with the original class chosen at the beginning, in this sense, and then ~specialize~ it at the appropriate time. This operation substantially modifies each class, leveraging certain characteristics in particular with completely new specific skills. The player is obviously free to build his characters as he prefers, spending the points earned at each level up in the extensive skill trees which include, in addition to those of the class, also those of the race or the brand new Union skills: the latter are like ~super moves~ that don't take turns and that the player can choose only when a special gauge is loaded. The 3D effect As usual, Atlus does not disappoint and implements a particularly accurate stereoscopic effect that makes a good impression thanks to the first person view, making the exploration of the labyrinths much more engaging. Why we are here? Despite the novelties introduced in the game mechanics by some classes such as the Rover or the Necromancer, which allow you to summon familiars that occupy a new row in front of the group, Etrian Odyssey V is played like any other Etrian Odyssey and requires a level of preparation, strategy and ~trial and error~ that can appear brutal to newbies. The enemies in the dungeons are no joke and most of the clashes suggest the use of skills and control spells that usually in role-playing games tend to be used very little. However, Etrian Odyssey V is not just any role-playing game, but an almost ~old school~ adventure in its setting, so much so that the map must be drawn on the lower screen of the Nintendo 3DS, taking notes thanks to a myriad of icons and markers , although a number of options allow you to automate much of the procedure. The labyrinths concocted by Atlus this time are among the most inspired of the series, full of traps, puzzles and FOE (Field On Enemies: the minibosses of Etrian Odyssey who roam freely through the dungeons and who are best avoided if you are not abundantly prepared to a breathtaking battle) that even exploit the environment to corner the player, perhaps trapping or chasing him as he moves from one square to another. An interesting novelty are the minisstories that you come across while wandering through the dungeons: there are much higher numbers than in the past, and they develop based on the composition of the group, the classes in the party and the races that make it up. They guarantee a remarkable variety and surprise the player with unpredictable outcomes which, in one way or another, always give a few more experience points which never hurts. Despite this, Etrian Odyssey V remains an even poorer title than the previous ones on the narrative front, also because it persists in repeatedly describing a world that we cannot explore. If in Etrian Odyssey III we sailed and in the fourth we flew from one region to another, exploring the themed dungeons, in Etrian Odyssey V we go back to the origins of the series and the World Tree, however gigantic and varied in level it is visual and content, it is the only dungeon that the player can face. The reasons for our wanderings are vague and inconsistent: legend tells of a great treasure and we are looking for it. End. Atlus sketches a kind of storyline through side missions and some dialogue, but the core of the experience is party management, character growth and the search for the perfect synergy. For the real scripts there would be the Untolds, but this time we are faced with an even more skimpy narrative than in Etrian Odyssey IV: those looking for a reason to fight hundreds of monsters, without even being able to see their favorites as they exchange hit with the enemies, he will be greatly disappointed.", "date": "2017-10-27", "grade": "8.0"}