{"name": "La recensione di Wolfenstein II: The New Colossus", "ref": "https://multiplayer.it/recensioni/190399-wolfenstein-ii-the-new-colossus-piu-forte-della-morte-la-recensione-di-wolfenstein-ii-the-new-colossus.html", "text": "In the midst of a bitter conflict between proponents of single-player experiences and those who promote ~games as a service~, mostly based on multiplayer and additional content, it makes us think how MachineGames hasn't even considered including an online sector in Wolfenstein II: The New Colossus. Such a feature would have diverted important resources that the development team wanted to focus on story, direction and level design; and after completing the campaign of their latest title, we can only agree with the Swedish studio, capable with this new chapter of creating a real point of reference for shooters with a narrative component. Structurally, the task performed by Jens Matthies and his collaborators is actually quite simple, characterized as it is by a careful alternation between played phases and suggestive cutscenes, some of which are completely out of their mind, even Tarantini-like in the use of ~gore~ , but in all cases damned well written and excellently directed. The end result is very convincing, a The New Order on steroids, even crazier and more ruthless, frenetic and spectacular, enriched in various aspects to also give us a substantial side dish / endgame, as well as the possibility of replaying everything at least once to follow up to the painful choice made in the first episode: will we sacrifice Fergus or Wyatt? Each of the two paths will produce different cutscenes and secondary missions, also providing us with an extra weapon that uses beams of light or balls of fire. Not today William Joseph Blazkowicz does not want to give up: at the end of Wolfenstein: The New Order we wondered if the character had survived the final battle: the answer is of course yes, but not without consequences. The man spends a few months in a coma, and when he wakes up he feels like deja-vu: the Nazi submarine conquered by his team was intercepted by the evil Frau Engel, who sent troops of soldiers on board to track down the rebels. Blazko has no choice, but he's too weak. So he crawls into a wheelchair and from there, gun drawn, he goes back to doing what he does best: killing Nazis. The epilogue of the introductory phase is violent and dramatic, but serves to provide the authors with an expedient to get the protagonist back on his feet, who finds himself wrapped in the mysterious Da'at Yichud armor and capable of fighting again at full capacity... or Almost. In fact, for three quarters of the campaign we will have to accept to see our health bar fill up no more than 50%, whereas the value of the armor can rise up to 200%. Considering the energy management system adopted by the series, which makes use of medkits and components to be found around rather than an automatic reset of the values, it is a solution that will often put us up against the wall, unable to take blows when unprotected. Another reason to embrace the philosophy behind MachineGames' shooter, which asks us to act truly in silence, following the complicated dictates of a ruthless stealth approach made up of waiting, careful planning and stealth killings; or to fight openly, without lurking and indeed moving quickly from one point of the scenario to another. Also because the enemies, while not overly cunning, will always know how to get behind us. It is probably a precise design choice: the authors wanted to communicate the impossibility of feeling truly safe when a Nazi commander sounds the alarm and dozens and dozens of more or less armored soldiers pour into the stage, heavy combat androids or light, robotic dogs of various sizes, drones and whatnot. More of the same? The experience of Wolfenstein II: The New Colossus does not represent a revolution compared to The New Order, but an enrichment also made up of many unpublished facets, especially in terms of secondary missions. On board the base, which can be freely explored, we will be able to get in touch with crew members who will offer us optional activities, some of which are useful for recovering important technological gadgets; but also to use the Enigma codes stolen from the German commanders to try our hand at a small decryption minigame and identify targets to hunt down in what stands as the most substantial and interesting aspect of the endgame, therefore accessible even once the history. The replayability card, which in a purely single player experience represents a very important value, has been used intelligently by MachineGames and is difficult toYou will stop once the campaign is completed, which lasts about twelve hours, perhaps even choosing to take a further complete tour to discover the cutscenes related to the character of Fergus (very enjoyable, we can assure you) or Wyatt. It is precisely in the narrative that this new chapter engages the fifth, moving towards unexplored lands and trying to best represent the dystopian scenario of a world dominated by the Nazis. And the gameplay? In this respect, there are many points of contact with the debut episode, as it was reasonable to expect: the weapons are not many, but they have a very precise characterization that makes them unique, a factor that many shooters take for granted, ending up to deliver us boundless arsenals but in which it is difficult to distinguish one rifle from another, or perhaps you never find yourself short of ammunition. The novelty of the two different weapons to be wielded at the same time has been managed with dignity from the point of view of the interface, albeit with the same underlying cumbersomeness in the selection, but it does not produce who knows what differences in practical terms. Certainly, however, the effectiveness of the single weapon pales in comparison to the damage we can do by firing two rifles at the same time, even when dealing with the toughest enemies. In short, it seems that every choice in The New Colossus has a reason, that nothing has been left to chance, and in this sense, from a certain point in the campaign it is possible to choose a gadget that allows you to approach the missions in a different way: a bodice that it turns into human rams when we run, a constrictor that allows us to crawl through narrow tunnels or a set of stilts that can transform us into mustachioed newbie plumbers. Added to this is the same interesting upgrade system seen in The New Order, based in practice on the completion of specific achievements: headshots, silent kills, kills with explosives, with double weapons and so on, which will change certain characteristics of Blazkowicz and will make it stronger, faster, more effective and more accurate. But, precisely, these are upgrades that we will have to earn in the field. Playstation 4 trophies There are fifty-one Trophies contained in Wolfenstein II: The New Colossus. Much of it is obtained simply by progressing through the campaign and completing certain stages, including completing the story at various difficulty levels, but there are also more particular achievements: eliminate an enemy by throwing an ax at him from thirty meters away, find all collectibles in the various categories, upgrade all weapons or perks, or complete all side missions. Blood and sand When not locked up in the aseptic Nazi bases, the level design of Wolfenstein II: The New Colossus is able to give very suggestive glimpses, which lead to large, intricate environments, capable of alternating the confined spaces of a railway carriage, the floors of a ruined building, the wastelands of an America subjected to blows of atomic bombs, or even landscapes foreign to this world. There are always objects to hide behind, but as mentioned it is rare to be able to take a stand to eliminate all enemies without someone hitting us from a hill, from the side or from behind. Approaching the game in a static way unfortunately translates into a long sequence of trials and errors to overcome this or that problematic sequence, and in the end even the final fight has this type of connotation. One could certainly be more daring on the boss front, which are more numerous than those seen in The New Order but rarely introduce new elements. However, the degree of difficulty is already consistent at the intermediate level, and there is no doubt that you will struggle a lot to overcome certain points, as it should be. If in terms of the cutscenes and the relative direction The New Colossus is literally armored, thanks also to an excellently crafted Italian dubbing and a valuable soundtrack, in terms of graphics it convinces thanks to an excellent level of detail, polygonal models well made and with a valuable effect. The game runs on PlayStation 4 Pro at 1440p, probably adopting a dynamic system that changes the resolution according to the needs to keep the sixty frames per second constant, which we confirm to be very solid.", "date": "2017-10-26", "grade": "8.8"}