{"name": "Cloni in guerra nella recensione di Rogue Trooper Redux", "ref": "https://multiplayer.it/recensioni/189971-rogue-trooper-redux-cloni-in-guerra.html", "text": "Developed by Rebellion - the British studio which in recent years has dedicated itself to the Sniper Elite saga - the original version of Rogue Trooper appeared on PC and PlayStation 2 in 2006. Three years later a not particularly brilliant port was proposed for Wii and by then all traces of it have been lost. More than eleven years after its first incarnation, the title now returns to the scene with Rogue Trooper Redux, a remastered edition already available for PC, PlayStation 4, Nintendo Switch and Xbox One. Will it be worth stepping back into GI soldier's shoes? Let's find out together. From comics to video games As those who have had the opportunity to try the original game will remember, the story of Rogue Trooper Redux is based on the comic of the same name created by Gerry Finley-Day and Dave Gibbons in the early 80s. The narrative context starts from the age-old clash that rages between the Norts and Southers factions for dominance on Nu Earth, a planet that has become arid and inhospitable after the massive use of chemical bombs that have compromised the integrity of the atmosphere, forcing the humans to wear special suits and respirators to be able to move on the surface. With the evolution of the conflict, the Souther faction has begun to create an army of super soldiers created in the laboratory and perfectly capable of fighting in the contaminated territories. The early stages of the game of Rogue Trooper Redux take place during one of the key events that are told in the comic, or the moment in which the GI army is trapped in the Quartz Zone and exterminated by hostile forces. The only survivor of the catastrophe is the soldier Rogue, who is then tasked with tracing those responsible for the massacre. The remastered edition brings a series of technical innovations to adapt - as far as possible - the visual experience and modernize it compared to the original counterpart: for this reason the characters, weapons and vehicles present in the course of the adventure have been remodeled, but they are the interlude sequences have also been restored with the addition of dynamic lighting and new special effects, as well as the polygonal structures of objects and buildings have been revised. Logically, the difference compared to the Rogue Trooper for PlayStation 2 is perceived, nevertheless the graphic restyling has not been able to solve those evident lacks of visual and conceptual characterization that afflict the production on an aesthetic level and beyond. A supersoldier and his biochips Although it is a third-person shooter of a classic setting with obvious construction deficiencies, the old Rogue Trooper did not fail to propose some interesting gimmicks from a playful point of view. Also in Rogue Trooper Redux the distinctive element in terms of interaction is entrusted to the biochips implanted in the skull of each clone. Curiously, when a GI soldier falls in battle, this electronic data can be extracted from his body and used as tactical support for an ally through three special slots available on the troops' helmet, rifle and backpack. And since Rogue's companions will drop in the early stages of the game, all you have to do is extract these materials from the body to install them in your equipment. We therefore have Gunnar's biochip available inside the rifle, with which it is possible to take advantage of an assisted aiming system and a sniper scope to hit the most distant targets with surgical precision. At the same time it is possible to transform the weapon into a sentry cannon: all you have to do is place the turret on the ground and activate it to distract enemies or receive effective cover fire. Alternatively, there is the option of the silencer, which theoretically should favor the stealthy approach in cleaning up the maps. During our game, this last option was the least exploited, thanks to the fact that the mechanics do not at all stimulate us to lean towards a weighted strategy; while striving to be precise, it is almost mathematical to be discovered by some patrol present in the vicinity, even from a considerable distance. Furthermore, the complete absence of indicators that allow us to estimate the degree of general alertness is certainly not helpful in this sense: as you may have guessed, leveling the rifle and throwing yourself forward ignorantly turns out to be the only sensible solution from to adopt. Then we have Bagman's biochip; placed in the backpack, it allows you to build objects and upgrades by recovering the wreckage from the corpses of fallen enemies, turrets or small mechanical remains that are scattered around the maps. By accessing a special menu you can invest these resources andalways keep your equipment up to date. Finally, with Helm's biochip, Rogue is able to bypass the electronic defenses or to create diversions using a hologram of the protagonist or by calling the attention of the guards from behind the covers. Being an outdated game, the campaign is predictably structured in single closed missions of short duration, which involve moving from an entry point to an exit point and mangle anyone who tries to distract the protagonist from the purpose of his mission. Playstation 4 trophies The Rogue Trooper Redux Trophies are mainly linked to the completion of the thirteen missions that make up the single-player campaign. The remaining objectives are for the online Siege and Progressive modes. However, the Platinum Trophy can be obtained without much effort. Shortcomings beyond the graphics One of the main flaws of Rogue Trooper Redux - further worsened by the test of time - is linked to the structure and variety of levels. In fact, the title remains guilty of a flat and uninteresting design, even in the presence of a technical update which, as far as possible, tries to make everything a little more appreciable. The problem of the game is upstream: the maps ooze old age and this is because already in 2006 the title of Rebellion certainly did not prove to be among the most advanced and avant-garde products available on the square. The lack of charisma shown by the characters is the result of the too weak characterization of the universe to which reference is made, to the point of making even those few dialogues or those fleeting cutscenes that alternate between one assignment and another almost completely superfluous . The effects of time also had their weight as regards the management of the roofing. In Rogue Trooper Redux it is too cumbersome to move fluidly from one wall to another or shoot with acceptable results while remaining sheltered from enemy fire. It is also worth extending the reasoning to the characterization of the enemies, far too limited for a title that returns to the market in 2017. Furthermore, as an alternative to the single-player mode, the two online multiplayer cooperative modes have been confirmed. In these sessions you have to face some side missions unrelated to the main adventure and placed chronologically before the events that took place in the Quartz Zone. By opting for Siege you have to defend your position and resist the progressive incursions of the Norts, while by selecting the Progressive mode you have the task of defeating the enemies and then reaching a safe point before extraction.", "date": "2017-10-17", "grade": "6.0"}