{"name": "Megaton Rainfall", "ref": "https://multiplayer.it/recensioni/189904-megaton-rainfall-una-recensione-da-supereroi-per-megaton-rainfall.html", "text": "All of us, at one point or another in life, have dreamed of being a superhero. The desire to emulating the exploits of Batman and company is not exclusive to children, but it is a desire also harbored by the most grown-ups who devour films and comics dedicated to the saviors of the Earth. Not having the opportunity to do it in real life, the independent studio Pentadimensional Games has decided to give us the opportunity to become Superman at least in the videogame field with Megaton Rainfall. The opportunity to satisfy the aforementioned desire is rather tempting, considering that the game supports virtual reality to make us immerse ourselves even more in the part: we didn't let it escape, and after wearing our costume we put our heads even the PlayStation VR helmet, to see firsthand what it feels like to be the defender of the weak. The hero we need Megaton Rainfall is set on a planet Earth invaded by a mysterious alien race, landed in our area with anything but peaceful intentions. A situation that seems desperate from the outset and that only the protagonist, son of an (almost) omniscient otherworldly entity, can try to resolve. The first power we get acquainted with is the one that allows us to fly, reaching supersonic speeds that allow us to go around the Earth to reach any point within a few seconds. A necessary aspect, since the alien attack is carried out by devices of mass destruction that appear from city to city, clearing everything in their way. The main objective of each mission is obviously to defeat these devices, but also paying attention to the number of victims related to the battle against the aliens: it is not only the latter who can destroy a building, but also us in case we are not beware of the use of our powers. Our hero is in fact able to fire shots of energy towards the invaders, at the more advanced levels able to dodge or deflect the attack: in this case it may therefore happen that there are human losses due to our responsibility. In addition to being careful how powers are used, one must therefore always keep an eye on the number of victims, because its excessive value decrees the end of the mission. Each battle is evaluated with a score, possibly allowing us to improve ourselves as superheroes by returning to the place to obtain a better evaluation, to then be shared with friends and not in the inevitable ranking. The difficulty naturally increases, so Megaton Rainfall initially offers us simpler situations to deal with, and then introduces more complicated alien devices: from the Independence Day-style mega spaceship to the worm that pierces buildings, from the spaceship capable of to some kind of thin and difficult to hit hammers. Fortunately, our superhero's powers also go hand in hand, thus giving us the opportunity to count on more powerful shots or special abilities such as stopping time for a few moments. Playstation 4 trophies Megaton Rainfall has a total of fourteen Trophies, all of which are of the bronze type. To get them, in addition to completing all the missions, you have to explore the game area properly, reaching the most remote corners of the Earth. Also rewarded missions with no human casualties and those in which an A rating is obtained, as well as the inevitable speedrun of the game in less than two hours. To try. To infinity and beyond Although overused over the years, Buzz Lightyear's phrase fits perfectly on this occasion. In fact, the experience of flying in Megaton Rainfall deserves to be told separately, because otherwise it could only seem like the way that Pentadimensional Games thought up to make us move from one point to another. While we are with our feet on the ground among humans we can take flight, coming to feel the wind and the clouds caressing our face until we go even higher in the atmosphere, distinguishing the round shape of our planet. At that point it is possible to go around the Earth, letting yourself go in various evolutions and dives, or go even further into the solar system, as in one of the interludes that takes us to visit Saturn and its rings: an experience perfectly accompanied by the soundtrack which starts during the flight phases, contributing to the level of appreciation that the player can have of what is therefore an aspect of Megaton Rainfall that is far from marginal. These are naturally the phases in which virtual reality is able to give its best, fascinating even more those with helmets on their heads compared to the normal 2D experience.Considering the aerial evolutions performed by the protagonist, Pentadimensional Games has thought of a series of parameters with which the player can reduce the effect of flight on his stomach, for example by reducing the field of view on some occasions or limiting the ~vibration~ of the view during the explosions. The final result is quite good, even if weaker stomachs will probably end up requiring a break anyway after accumulating a few tens of minutes of play. Closing the discussion related to virtual reality, we must say that moving in battle was more difficult than a normal screen game which on its own is undoubtedly appreciable in all aspects, thus making Megaton Rainfall attractive even if you do not have PlayStation VR . In the latter case it is naturally the definition of the image that gains, allowing the player to better appreciate some details such as the presence of famous places (for example the Colosseum in Rome or the Palm Islands in Dubai) while defending the city on duty .", "date": "2017-10-15", "grade": "8.5"}