{"name": "La vita  un campo da golf nella recensione di Golf Story", "ref": "https://multiplayer.it/recensioni/189770-golf-story-la-vita-e-un-campo-da-golf-nella-recensione-di-golf-story.html", "text": "If you've seen The Legend of Bagger Vance or Caddyshack you might have an idea of the spirit that characterizes Golf Story, the new title from the semi-unknown Sidebar Games for Switch that has quickly climbed the Nintendo eShop charts. For a nation of football enthusiasts it is particularly difficult to find something poetic in the art of throwing a ball into the hole, yet - as often happens with the Anglo-Saxon vision of sport - one can find an extremely romantic, if not downright epic, in this ancient discipline. This is somewhat the point of view with which the subject is treated in the game, and perhaps the Australian origins of the team are reflected in the passion that shines through for golf under the light-hearted tone. The climate remains light as in the classic Camelot productions to which Golf Story clearly refers, but also profoundly self-ironic as it has hardly happened to see in Mario Golf or in most Japanese RPGs, the two genres to which this production refers most . Precisely in this tone, perfectly balanced between the epic role-playing game and the amused representation of a world that revolves entirely around golf, lies the characterizing element of the strange formula of Golf Story, in which every challenge is fought with bat and ball and the battlefield is dotted with nine holes to hit. If this seems ridiculous to you, it's because in fact it is, and the game is the first to highlight it with its world full of funny and bizarre characters, perfectly characterized by well-written and rhythmic dialogues, which unfortunately require a good knowledge of English to be fully appreciated. Epic golf The game opens with a flashback in which the protagonist, a child, finds himself learning the rudiments of golf with his father in front of a large crowd of geese, who apparently have invaded the field, creating quite a stir. Already this first scene is emblematic of the style adopted throughout the game: the dialogues and the events staged are humorous, bordering on the grotesque in some cases, yet the general atmosphere and the musical accompaniment reveal a poetic note under the hilar surface. A moment later we find the protagonist grown up and somewhat lost but suddenly come to a conclusion: go back to where it all began, on the golf course, and show everyone that he is able to keep the promise made to his father and become a professional. It is therefore not a question of saving the world from a metaphysical threat as in most RPGs, but on the other hand there is something deeper than the simple desire to win a trophy and this is the balance we were talking about as a constant element throughout the game, which is revealed between the story based on the desire for revenge and homesickness and the structure that always remains linked to the game of golf. This is also reflected in the progression, set on competing along eight courses of nine holes each, but always presented as a real RPG main quest and setting the races within a sequence of well-connected and justified events from the narrative substrate. Consequently, all the intermediate and smaller challenges scattered throughout the scenarios, always based on the club, ball and holes to hit, are also presented as sub-quests by the colorful characters that make up the supporting cast. As per tradition, the different parts of the main quest, or the different tracks on which to compete, have disparate settings and each one inspired by a particular theme (the starting field, the desert with prehistoric finds, the mountain, the sea coast and so on ). Bugs being fixed We point out that the gamer community has detected a rather wide range of bugs on the game, although only the minor problem of moving the shot emerged during the review. You can find an interesting cataloging of these problems in a specific topic on Reddit, but keep in mind that the incidence of these errors is difficult to evaluate at the moment. In any case, the developers have already reported that they have seen it and are working on a patch that should fix most of the problems as soon as possible. The three-touch system Like Link always carries his sword with him to be able to draw it at any time, the protagonist of Golf Story also always has clubs and balls at his disposal, which he can extract from anywhere on the map to try a few shots. The play areas are packed full of points of interest and things to do, with side quests all geared towards any golfer digressionica more or less possible, therefore it is in the shooting mechanics that the whole core of the gameplay is exhausted. This is based on the well-tried three-touch system, which is the typical Mario Golf one: a first touch starts the cursor, a second establishes the power of the shot and the accuracy is based on the third, all elements to be calculated on the basis of the classic variables of distance, wind and slope and terrain texture. Added to this is the possibility of establishing the point of impact of the club on the ball and a further modifier on accuracy, applying various effects to the trajectory. It's a rather intuitive and fundamentally arcade system, which is ideal for always maintaining a good rhythm considering the amount of launches we find ourselves doing throughout the game. On the other hand, a further enrichment of the mechanics is given by the acquisition of new ~weapons~ and abilities. Completing quests allows you to earn money to buy new equipment, enriching your inventory of clubs with different characteristics and adding accessories that can modify and unlock new skills. There is in fact a role-playing element in the management of the character, which in addition to expanding its ~arsenal~ carries out a real growth with the purchase of experience. Passing from one level to the next allows the distribution of various points on the basic statistics consisting of power, purity, precision, skill and effect, moreover with an interesting system of cross-dependencies whereby the increase of a parameter is reflected in the automatic variation of the others for a logical principle of compensation. As befits a game for Switch, there is also a local multiplayer that allows you to challenge each other by simply playing golf on the maps unlocked during the RPG, but this is a mere side dish to the main subject. A living world We are now accustomed to 2D productions that mimic the classic style of 8 and 16-bit productions, but Golf Story's graphics are based on a style so clean and coherent that it is still remarkable. There is a truly uncommon attention to detail, from the wind that moves the leaves to the animations of every single creature on the screen, capable of making the game world particularly alive. A splendid characterization also contributes to this which gives a specific identity to the characters who meet along the way: in those handfuls of pixels it is possible to perfectly understand the types we are dealing with, both for the movements that identify them and for the 'excellent work done in the writing of the dialogues, marked by an ingenious dynamic use of comic-style balloons. All this makes up for a certain lack of bite that could emerge from a story that obviously shows limits, being limited to this particular golf-based world, making the exploration of the various settings interesting in any case and stimulating interaction with each individual character that appears on the screen. You never know what to expect from Golf Story's NPCs, as the dialogues are rarely banal and each little sprite seems to have a life of its own and a very specific character. It is really a pity that a localization in Italian has not been carried out, also because the jargon expressions and the slang used in various cases can make the texts difficult to understand for those who do not have a good command of English. This excellent picture is completed by an audio sector that always proves to be up to par with well-finished sound effects and good music that manages to discreetly accompany the action without ever being intrusive or repetitive.", "date": "2017-10-12", "grade": "8.8"}