{"name": "NBA 2K6 - Recensione", "ref": "https://multiplayer.it/recensioni/nba-2k6-recensione-2.html", "text": "Jaw no longer drops. Unfortunately NBA 2K6 fails to give particular emotions to the most savvy players. That is to all those who have already had the good fortune to appreciate the Xbox or PlayStation2 version, or simply any chapter of this historic series. The Xbox 360 version is exactly the ~old-gen~ counterpart, with some smattering of effects and with reworked polygonal models, but it's essentially the exact same title. Not only that, the gameplay has remained intact over time and is practically the same as the first chapter released six years ago. Which isn't necessarily a bad thing, after all Pro Evolution Soccer is still itself, albeit with some adjustments or modifications. However, over the years NBA 2K has been able to amaze us not so much by improving its gameplay, deep and fun, but for example by supporting network play with Live on Xbox. The first thing we would have expected from the 360 version is a substantial and tangible graphic improvement, which is the only factor that can really be improved compared to the old versions. Well, this expectation was partially disappointed, especially considering that in Italy the game comes out six months after its launch. The graphics engine of the game, excluding the work done on the players, is certainly not a monster, and, apart from the polygonal audience and some nice effects, it fails to amaze. Let's start with the least important thing: the public. Each spectator is fully polygonal and reacts to the game action whether they are watching, standing up, shouting, waving or just sitting and watching. The graphic engine of the game, excluding the work done on the players, is certainly not a monster, and, apart from the polygonal audience and some nice effects, it fails to amaze Jaw no longer drops. It is a pity that Visual Concepts has well thought of inserting countless cut scenes during the game in which all the construction defects are noticed such as for example the necessary polygonal scarcity due to create thousands of people or the washed-out textures. In short, a pleasant side dish which, however, had to remain so, and which when thrown in the face of the player only makes it very funny. The stars of the NBA are obviously made better, especially the garments that have a realistic effect of movement and the sweat that sparkles on their foreheads. With close scrutiny through the fantastic replays that have always characterized the series, it is possible to notice an infinite number of polygonal interpenetrations and strange animations, such as the eye sockets that rotate excessively and make Kobe Bryant look like Linda Blair in ~ The Exorcist~. It is also possible to look closely at the models of the players, slightly improved compared to the Xbox counterpart but which certainly do not cry out for a miracle. A nice background blur effect has been inserted during these replays which highlights the action being shown in slow motion. The amount of aliasing on the screen is also negatively surprising, like a true old gen. In a quick comparison with Electronic Arts' NBA Live 06, the graphics look like they're from a previous generation of games. The choice of colors is just as unfortunate: the tones are too saturated and unrealistic, making the game look like a good comic instead of a real game, and the players are cardboard ~silhouettes~ cut out and applied to the background. The series of Electronic Arts has put the arrow for overtaking therefore, Visual Concepts is warned. In any case, their title is even better in terms of game fluidity and framerate. The audio sector is instead the most convincing one, with an amazing commentary in full Yankee style. The commentator shouts, gets excited and calls everyone by name. Even the effects, now classic samples, are realistic and well digitized, while the general sound tone is the good old Hip-Hop. The public is also lively and makes itself felt depending on the situation. The power of Live on 360. The game modes are numerous and of a different nature. It starts with the classic season of 29 days up to a maximum of 82 rounds, passing through ~association~ which is practically a more managerial version of the championship, then street ball, the evergreen tournaments, training and ~the situation~ which sees us thrown into the fray of a game that has already begun which must be won at all costs. Obviously, 24/7 could not be missing, now a fixed option in the NBA series, in which we will find ourselves creating a player and a team from scratch. After shaping our character, a real adventure will begin: playing in suburban pitches, contacting managers, joining a team, training. A real RPG in a sports key, very deep and engaging. But the real godsend is the Live of 360, where it is possible to play a quick game, a classified one or set the parameters to our liking, for example by modifying the ranking of the wanted opponent. The lag depends on the connection, tested with a 4MB line it did not give any problems whatsoever, always resulting fluid and fast. Gameplay changes. A pleasant innovation has been made to the management of shots and defense, it is the use of the right analog stick. It can be used instead of the classic keys just like in the brand new Rockstar table tennis. One controller instead of all the buttons in practice. During the attack phases it is possible to execute hooks or shots in elevation simply by directing the stick in a different way. Defense management has also changed. If before we could only count on the good old ~steal the ball~ button, now we can make our player's arms and hands move in space in 360 degrees: right, left, down, or jump up to try to block. Some may still prefer the classic use of the keys, which thanks to the force of habit will perhaps be more immediate. The artificial intelligence of the CPU is decent, already at the normal level the challenge level is quite high and the computer will rarely fail. Blocks or steals will become more likely as the difficulty increases. The only drawback, it seems that the routine has not been optimized to manage a game at a narrow disadvantage that is about to end: if, for example, we are ahead by 3 points with ten seconds to go, the opponent will not look for a shot from distance but inexplicable area penetrations. In short, what is missing is the ability to know how to interpret a result and know how to manage it in the best possible way. Comment NBA 2K6 for Xbox 360 builds on the solid gameplay of the series that has been proven for years. The introduction of the right analog stick is great, opening up new controls in a basketball game. However, the complete package is a ~more of the same~ with little appeal, mainly due to the very obvious graphic defects and the fact that it is very little ~next gen~, especially when compared with the rival NBA Live from Electronic Arts. Ultimately a title to keep an eye on if you are approaching the series for the first time or if you are a true basketball fan and require roosters and teams updated this year. In all other cases, it would probably be best to wait for NBA 2K7. Pros Deep and challenging 24/7 mode Right analog stick usage Proven game mechanics Cons Almost unchanged from the first game Graphics compartment Some AI behaviors NBA 2K6 goals. The objectives are in total 5 per 1000 points available, divided as follows: Get a triple double with any player of any team, 250 points. Score 50 points in one game, 150 points. Score 140 points with any team, 200 points. Make 15 3-point field goals in one game, 150 points. Get 20 rebounds with any player, 250 points. The American developers Visual Concepts have always given a lot of trouble to the competitors (and former colleagues) of Electronic Arts. This glorious studio formerly owned by SEGA, then sold for 24 million dollars to Take2 in January 2005, has dominated the sports game scene since the first chapter of NBA 2K released on the legendary Dreamcast. Until then, NBA Live dominated every PlayStation of all true stars and stripes basketball lovers. The 2K Games sports franchises, including the NHL, NCAA and Baseball have been the pinnacle of playability and innovation in their genre for as long as they have existed. They have always known how to surprise positively. With Dreamcast thanks to the massive use of polygons and excellent animations, on Xbox thanks to online play on Live, but on Xbox360 will they still be able to excite us as they have accustomed us to do over the years?", "date": "2006-06-09", "grade": null}