{"name": "Danza di velocit: la recensione di Forza Motorsport 7", "ref": "https://multiplayer.it/recensioni/189340-forza-motorsport-7-danza-di-velocita-la-recensione-di-forza-motorsport-7.html", "text": "After the report of the first hours, here we are finally grappling with the review of Forza Motorsport 7. There has been a lot of talk about why Microsoft has decided to launch an exclusive of this magnitude a month after the debut of Xbox One X instead of making a publication at the same time, and in fact it is an exciting topic: the Turn 10 title is perfect for demonstrating the technical capabilities of the new console, but in this way it will already be widely ~gutted~ at the appointment on November 7th. It was probably the rush to compete with much more substantial line-ups on the first party front, or the desire not to exclude standard Xbox One owners in any way, who in fact will be able to enjoy a visually majestic product, never so evocative and spectacular . Whatever the reasons behind this choice, the numbers of this new episode speak very clearly: over seven hundred cars, thirty-two scenarios, a particularly long-lasting career mode, a multiplayer with great potential and a large set of challenges, which will be further enriched in the coming weeks. following day one. Is this the best Forza Motorsport ever? Strength and courage It only takes a few minutes to understand the value of the experience offered by Forza Motorsport 7. It is an episode that in many ways consolidates the excellent work done by Turn 10 over the years, especially with the sixth chapter, but at the same time boasts a great personality, which manifests itself above all in the rendering of the weight of the cars on the track, in the feedback produced by the traction and by any sliding on the asphalt, in the general sensation of solidity of a driving model of absolute reference as far as the simcade genre is concerned. The balance found by the developers in this sense is almost perfect, the cars are fun to drive but are ready to punish us if we take the reactions lightly, punctually emphasized by adverse conditions. In circuits where the weather is variable, in particular, the incidence of rain is perfectly represented, gradually creating puddles of water which substantially affect road holding, inevitably lengthening braking and preventing us from giving complete release to the engine, especially if we find ourselves driving a powerful and tendentially nervous car. There are effective differences between one car model and another, not only between one category and another, but beyond a couple of exceptions among the heavier vehicles, a sense of pleasantness of the gameplay remains constant, also given by the punctuality of reactions. The approach to driving is also widely adjustable, with optional aids that cover the entire spectrum of possibilities: from the steering wheel to trajectories, from the brakes to the gearbox, from electronic assistance to wear, the latter available in three different presets (only cosmetic damage, tire and fuel consumption or complete simulation, with mechanical failures that dramatically affect our ability to complete the race). In all cases, the inevitable ~rewind~ function can be useful, which by pressing the Y button allows you to turn back time and perhaps avoid a huge mistake at the end of a long and demanding race, defusing any episodes of frustration. The improvement of performance passes through the experience on the tracks, which leads to imagining specific setups, to be set, saved and shared by modifying the values relating to tire pressure, the length of the gears, the alignment of the wheels, the anti-roll bars and stiffness of the suspension. We weren't convinced by the concept of homologation with regard to upgrades in career mode: designed to make upgrades more balanced with a view to multiplayer races, the system builds a cage that is not very intuitive and rather limiting for those who, for example, were used to buy a small car and assemble components that transform it into a little monster, competing in the higher categories. Precisely the latter are now more rigid and prevent easy space, forcing cumbersome removal and verification procedures that lead to obtaining little appreciable advantages. The result is that all the tuning substrate is set aside in favor of the automatic solutions proposed by default, which is a pity. The carreer The Forza Motorsport 7 main menu gives you access to the Forza Driver's Cup, split-screen or online multiplayer, Free Play or Rivals mode, with the ability to view a whole series of unlockables: Premine, the relative Modifications, the Driver's Equipment and the Garage where the cars in our possession are kept. Some items, as anticipated, are still disabled and will be activated shortly: these are the Forzathon challenges, the interesting online Leagues, the Auction House and the Marketplace, with their inevitable implications in terms of monetization. In any case, the career represents the fulcrum of the Turn 10 production, with six different championships (Seeker, Breakout, Evolution, Domination, Masters and Forza) to be unlocked as we level up, each with an increasing number of cups sign of the most absolute variety. In fact, one passes with great ease from sports coupes to muscle cars, from rally cars to hatchbacks, from trucks to Porsches, drawing from one's own collection of cars from time to time or buying new ones to be able to participate in the events. Tournaments usually consist of five or six races in sequence, but each league also includes individual, sometimes crazy challenges (see the street bowling races on the Top Gear circuit). It is not necessary to successfully complete all the cups of each championship to be able to access the next one - as mentioned, the question depends on the points collected - but as a guideline, at least half of the tests must be completed. The difficulty rises as you access the more advanced leagues, but in this sense our advice is to immediately put your hand to the default settings to obtain a more consistent challenge. Playing with the Drivatar's ability on ~medium~ it is in fact all too easy to overtake everyone within the first two corners and spend the rest of the race outdistancing the pursuers, therefore it is appropriate to raise the indicator by a couple of notches, obtaining much faster opponents and enjoying higher rewards at the end of the events. Curiously, the deactivation of driving aids does not produce differences in the credits obtained. The contour The Forza Driver's Cup will keep you busy for dozens of hours, there is no doubt about it, and will receive further endgame-style content through a substantial 50 GB update that will be released on day one. However, the side dish is not missing, net of the options that are not yet active. The already known Rivals mode, for example, offers a sequence of speed challenges based on the leaderboard, in which we will therefore face the ghost of the user who achieved the time immediately lower than ours on certain tracks. A well done lap will be enough to bring home the result and then dedicate yourself to the next rival, climbing the world rankings as our performance on the track improves. Online multiplayer, currently only available in the form of playlists, is already quite populated and competitive: during our tests it was easy to find sessions full of even fairly experienced users, although the phenomenon of ramming generally leads us to prefer games with collisions disabled. in which everyone is free to make time without worrying about any incorrect manoeuvres. We have encountered some strange latency issues in some cases, but there is no doubt that the online sector of Forza Motorsport 7 has great potential, which we imagine will be expressed above all through the Leagues. We will have to wait for the official launch and the population of the servers to test the robustness of the infrastructure, but for the moment the multiplayer of the game offers exactly what we expected. Prize Boxes and Changes Obtaining new cars is the main objective in Forza Motorsport 7, it is no coincidence that in addition to experience points and credits there is an indicator relating to the level of collecting, which rises as we unlock new cars, especially if they are rare. The achievement of each new level of experience is rewarded with a quantity of credits, a large discount on the purchase of a car or new suits for the avatar, but they are clearly the first ones that interest us the most, as they are essential to obtain certain models and move between upgrades and customizations with a certain ease. Credits are awarded for every victory, but Mods allow you to multiply them consistently and thus accelerate your progression in the game. These are cards contained in the Prize Boxes, which can be equipped three at a time and are limited in the number of uses, which apply specific modifiers to the races or imply challenges to be completed during the event: the execution of a certain amount of quality overtaking, the use of a single view among the five available, the deactivation of certain aids and so on. Fulfilled these conditions, the final prizes can even double or triple, ifwell it should be specified that the whole system remains optional: it is possible to obtain the same virtual money without the Modifications, only more slowly. The Reward Boxes, which can be purchased starting from 20,000 credits, up to a maximum of 300,000 for those with guaranteed rare content, are however indispensable for those who decide to face the experience in this way, and it will be necessary to understand how Turn 10 and Microsoft will aim to monetize such aspect. Xbox One goals Forza Motorsport 7's sixty-two Achievements follow the player's progression, unlocking achievements as they work their way through the game's rich career mode. Likewise, the abundance of the garage and items for customization are rewarded, as well as the partial or total completion of the various championships. Finally, there are also the Objectives linked to the online sector, based on numerical goals or specific actions. Visual impact Forza Motorsport 7 will have the task of showcasing the technical capabilities of Xbox One X, but as mentioned also on Xbox One S the game performs excellently, managing to offer a greater level of detail than the previous episodes of the series while maintaining an absolutely stable frame rate of sixty frames per second, which does not show the side of uncertainties even when there are twenty-four cars on the screen and it is pouring. The dynamic lighting manages to give a great personality to the tracks, making them protagonists of the action like the cars and generating truly evocative landscapes, especially when using an HDR-enabled television. The Dubai circuit, the only truly new one for the series, acts as an amazing forerunner to a rich and multifaceted selection of locations, which thanks to the dynamism of the weather conditions and the lights guarantees ever-changing sensations. From the splendid architecture of Prague to the atmosphere of Silverstone, from the unpredictability of Laguna Seca to the open spaces of Yas Marina, from the narrow courses of Rio to the sunny Alps, there is not a single track stingy on emotions. Similarly, the many cars available boast a surprising level of detail, with advanced polygonal models for the Forzavista mode but a rendering that always remains excellent even on the track. Viewed on a 4K screen, the game shows some jaggies in contrasting areas - nothing tragic, but it's one of the aspects that will be improved on Xbox One X, probably together with loading. In our opinion, the sound accompaniment, effective and spot on, would have benefited substantially from a narration in Italian, more than anything else for a question of prestige, but it is also true that in this way the authenticity of the vocal testimonies of some famous pilots. The right edition of Forza Motorsport 7 The physical version of Forza Motorsport 7 can be purchased in both a standard edition (62.99 euros) and Ultimate (96.92 euros). The second can count on some bonuses such as the Day One Car Pack, the Car Pass and the VIP Membership. It is clearly possible to buy the game also in digital version, with the Play Anywhere solution, on the Microsoft store in the three standard, Deluxe and Ultimate editions. For those looking for a racing wheel to play Forza Motorsport 7 there are obviously a large number of options. The Logitech G920 Driving Force, which can be used on both Xbox One and PC, is currently available at 223 euros instead of 409. Other options are the Thrustmaster TMX (176 euros), the Thrustmaster TX Racing Wheel Ferrari 458 (265 euros instead of 399) and the expensive Fanatec CSL Elite (619 euros).", "date": "2017-10-03", "grade": "9.0"}