{"name": "Superficiale", "ref": "https://multiplayer.it/recensioni/189179-flat-pack-superficiale-ma-in-senso-buono-la-recensione-di-flat-pack.html", "text": "That Nitrome is one of the few software houses in the mobile sector to know how to masterfully combine extreme prolificacy with an admirable variety and quality of its titles is now well known: from today, timeliness can also be ascribed to these qualities, given that the company British is one of the first to come out on the App Store with a product that can take advantage of the new augmented reality libraries made available by Apple. For iPhone and iPad owners, the Flat Pack here is therefore able to offer a spectacular function to play through the rear camera of the device, but all the others can still console themselves thanks to the excellent gameplay of the latest addition to Nitrome . 3x2 size Flat Pack is one of those classic titles much easier to play than to explain, but a good starting point to understand what the Nitrome product is about is its analogy with the famous Fez as regards the particular mix between 2D and 3D . The protagonist - a bizarre pink ~thing~ with a propeller on his head - therefore moves on a two-dimensional plane, which however is placed on polygonal structures in the shape of a parallelepiped: when you reach the edge of the side on which you are moving, the figure performs a rotation on the same axis, allowing you to continue on another facade. The interesting fact is that these changes in the scenario also affect gravity, which adapts to the sense assumed by the playing surface and which therefore becomes a fundamental variable to be taken into consideration in order to get to the end. The main objective of each level is to collect all the luminous orbs scattered around, in order to unlock the exit and thus move on to the next scheme: an extremely simple basic structure, which however the developers have been able to make the most of thanks to a careful work of level design. Hence, in Flat Pack, advancing in the stages goes hand in hand with the progressive introduction of many gameplay elements - small or large - which help to keep the action always fresh and interesting: all in all, we go from things trivial as new enemies or obstacles to overcome up to solutions that radically change the way of interpreting the levels, such as walls that move independently or explosives to be detonated in the correct order to open the right path to take to reach the finish line. All aspects that contribute to making Flat Pack a title with a unique flavor, which moreover has the further great merit of being able to wisely dose the level of challenge, making it the right one without falling into excessively bizarre. Wanting to nitpick, one could say that, unlike many similar titles, Flat Pack does not make use of great tricks to invite the user to retrace his steps and face the already completed internships again, a choice that inevitably ends at the expense of longevity. However, it is a venial sin that is even easier to forgive if we consider how little the title makes its free-to-play nature weigh, which is manifested only in some advertisements that are not very invasive. From a graphic point of view, Flat Pack will not be remembered as the most beautiful Nitrome product ever (also thanks to a so-so artistic direction), but it still manages to amaze thanks to the augmented reality mode, currently only available on iOS: by selecting it, the rear camera of the device is activated, and it is sufficient to direct it towards the floor to see the shift level projected onto it, with the user being able to move at will to observe it from all angles while continuing to act on the touchscreen to control the hero. A decidedly more spectacular solution than really comfortable to play, but which we undoubtedly recommend to try to those who have the possibility.", "date": "2017-09-29", "grade": "8.5"}