{"name": "Sotto il cielo di Metroid - la recensione di Morphite", "ref": "https://multiplayer.it/recensioni/189132-morphite-sotto-il-cielo-di-metroid-la-recensione-di-morphite.html", "text": "Myrah Kale, a woman who grew up aboard a space station, decides one day to travel to discover the universe and its secrets; in particular what concerns the morphite, a mysterious energetic substance that is somehow linked to the history of her family. Accompanied by a little robot that looks like a cat, Myrah therefore climbs aboard her ship and begins to follow the tracks that will bring her closer and closer to the truth, exploring new planets and scanning their flora and fauna to collect the credits necessary for the purchase of fuel and the inevitable upgrades. Told in this way, the idea behind Morphite seems to clearly recall the gameplay of No Man's Sky, although in reality it takes a few minutes to grasp all the differences between the title produced by Crescent Moon Games and the one created by Hello Games. In this case there are not in fact infinite spaces to probe nor entire randomly generated ecosystems, but a simple (albeit vast) spatial map to visit without the possibility of controlling the ship (except for the turrets, but only in the event of a collision with hostile units). The presence of puzzles and platforms, as well as even boss fights, actually makes the game closer to the Metroid Prime formula; and it's probably no coincidence that the protagonist is a woman in the We're Five Games and Blowfish Studios adventure too. Where no man has gone before Don't be fooled: Morphite is available on the App Store at a price of 8.99 euros, but it's the same game that simultaneously landed on PC, PlayStation 4, Xbox One and - soon - Nintendo Switch. In short, we are talking about a premium, wide-ranging production, far from the general conception of mobile games, especially those that use the freemium format. The departure inevitably proceeds a little slow, given that certain mechanisms must be assimilated, but after a few planets the gameplay reveals all its facets and the charm of the upgrades pushes you to make frequent changes of course to carry out extra scans and get the money needed to upgrade various components of the ship or Myrah's armor. Once a destination has been selected, you descend to the surface aboard a capsule and then you are free to explore the scenery, interacting with electronic devices, bridges and rocks that you can blow up with a few grenades, naturally paying attention to hostile creatures and any traps along the way. I walk. The fifteen planets that fall within the narrative path obviously reserve more surprises and details, while in many cases the worlds that we decide to explore for the pure sake of doing so appear poor and dull, but in principle the developers have been able to give the experience a discreet variety and a stylistic coherence which, hand in hand with the suggestive soundtrack, is able to create a great atmosphere. Space opera There is no doubt that Morphite is, in the end, a simple and somewhat linear product, but the way in which all the elements of the gameplay have been put together suggests a wider and more detailed structure than it actually is. reality, involves and excites. Which is obviously not a problem, quite the contrary. Even in the face of scenarios that gradually become wider, it is difficult to get lost and there is always the possibility of recalling the capsule to return to the spacecraft, although sometimes the checkpoint system appears nebulous and can even play tricks. Speaking of defects, unfortunately the touch control system is not always precise and it is necessary to take some measures before tackling a platform section, even more so if the possible fall can be fatal. The two buttons on the right side of the screen are used to operate the tool we have equipped (whether it be the gun, the scanner or anything else) and precisely to jump, while the movement and the view are managed via invisible virtual analog sticks and repositionable. It does not seem to be possible to activate automatic fire (or at least there would be an option, but at the moment it has no effect) and this inevitably makes the fights cumbersome, hand in hand with a collision detection that is not always punctual. From the point of view of graphics and sound, however, there is little to complain about: the minimalistic polygonal style works and gives the design a certain personality, while maintaining the fluidity always very high, while the audio sector boasts dialogues spoken in English, good effects and, as already mentioned, excellent music.", "date": "2017-09-28", "grade": "8.2"}