{"name": "La recensione di Stellaris: Synthetic Dawn Story Pack", "ref": "https://multiplayer.it/recensioni/189037-stellaris-synthetic-dawn-story-pack-la-recensione-di-stellaris-synthetic-dawn-story-pack.html", "text": "With Stellaris, a very high-level strategic 4X released more than a year ago, Paradox has managed to perfectly balance commercial needs and product support, releasing free content with great regularity (we have reached the 1.8 update), accompanying them with valuable DLC medium/high. After the exceptional Utopia, which revolutionized many aspects of the base game, rekindling the interest of even the disappointed ones, the new DLC is more in line with the previous ones (the Leviathans Story Pack and the Plantoids Species Pack), i.e. it offers more targeted, introducing three new races linked by a common feature: they are all robotic in nature. This is an unprecedented in the Stellaris universe, given that until now the empires were all populated by creatures of an organic nature. The three new races The three new races introduced by the Synthetic Dawn Story Pack are very different from each other, both in appearance and in objectives. The Determined Exterminators are children of an aggressive and warlike civilization, which wants to destroy all organic creatures in the universe. The primary source of inspiration for these nice children of a machine with easy bolts are certainly the Dhaleks, whose references are clear right from the name. In honor of their socially problematic nature, Determined Exterminators do not dominate organic races, but exterminate them as soon as they conquer them. Do you think that by using them you lose access to all options related to diplomacy. In general it is the poorest race of the three, interesting if you let yourself be fascinated by its background, but too tied to combat (which is not Stellaris' strong point). Let's say it's fine as a secondary choice, after having explored the potential of the game with one of the other races. The Rogue Servitors, on the other hand, are a much more interesting race, whose philosophy seems to have come straight out of an Asimov book. As the name suggests, these are robots born to serve organic creatures, which, however, have taken over as they have developed. Although they are dominant, they have not killed their former masters (at least not all), who indeed continue to serve in some way, creating a splendid paradox that manifests itself with great force in the gameplay: they feel they are the protectors of the dominated races, to which they bind their morale. In what sense? To be happy, Rogue Servitors must serve and protect organic creatures. The more the latter are numerous, the more their morale grows. Of the three, it is certainly the most interesting race, both in terms of mechanics and narrative, because it imposes a more balanced approach to the game, in which one is always torn between the need to grow the machines and that of accumulating organic creatures. Making them carry out indiscriminate massacres leads to seeing them morally collapse. Finally there are the Driven Assimilators, practically the Cyber men of Dr. Who mixed with the Borg of Star Trek, who tend to assimilate organic civilizations, transforming them into cyborgs and integrating them into their neural network. Diplomacy and sympathy In general, the three robotic races are not much loved by the organic ones, whose reactions are a good part of the beauty of the whole experience and determine most of the narrative turns. Without revealing too much, let's say that while with the Driven Assimilators the diplomatic relations have more traditional forms, the other two races are very hated, despite the hatred manifests itself at different intensities (as already mentioned, the Determined Exterminators cannot have diplomatic relations with the other species, so they just fight). If desired, there is also a fourth option: to create a customized robotic race, more malleable in relations with organics, but which at the same time offers much more traditional gameplay. Let's say that it is a compromise choice, which however makes the DLC lose a bit of its charm, also based on references to science fiction classics, moreover lacking many of the customization possibilities of organic races. Obviously the three robotic races have specific technologies, events and path of ascension, which personalize them making them unique, but which certainly do not revolutionize the gameplay, which remained in line with what was seen in the base game and in the previous DLCs. In the middle of the game, unfortunately, there is a bit of a lack of some more specific content. In particular we think of the absence of unique advanced units for the three races. Something more, from this point of view, could be done, in order to characterize them in a better and more complete way. Of course, it must be said that the offer is much richer than the one we had with the Leviathan story pack, a sign that at least the criticisms received at the time were taken into account. In short, the Synthetic DawnStory Pack is a good DLC and nothing more. Sure Stellaris fans will like it, but for others we don't think it's a big incentive to get back into the game.", "date": "2017-09-26", "grade": "7.5"}