{"name": "Dinosauri e topastri nella recensione di Total War: Warhammer II", "ref": "https://multiplayer.it/recensioni/188992-total-war-warhammer-ii-dinosauri-e-topastri-nella-recensione-di-total-war-warhammer-ii.html", "text": "For years the Warhammer license has been abused, offering gamers mediocre and easily forgettable titles, with rare exceptions. Lately, however, there has been a turnaround, with some productions capable of rising to real pearls of the genre to which they belong with Total War: Warhammer certainly making them the standard-bearer. The first chapter of the trilogy, released last year, marked an important step for Creative Assembly which, for the first time ever, found itself having to manage not only entire humanoid armies but also monsters with the strangest features, spells and even a fantasy game world that fans are very attached to. Incredible therefore how, despite all these difficulties, the experience gained with the various historical Total War games was still sufficient to package a complete and particularly satisfying product, the first of a series of packages that will accompany us at least until 2019. Today has arrived It's time to go into more detail about Total War: Warhammer II, a direct sequel to the chapter seen last year that expands the old world bringing four new races and new continents as a dowry, as well as renewed mechanics and some minor tweaks to the gameplay. Let's shine our shoes The new setting takes us directly to the lands of Ulthuan and Lustria where lush forests await us and valiant armies prepare for an imminent global battle. The maelstrom of winds of magic has been unleashed, and Skaven, High Elves, Dark Elves and Lizardmen, each with different intents and purposes, plan to take it over. It goes without saying that in this circumstance the old pacts will fail and the war will come alive. It is an incipit with no particular appeal to tell the truth, but it is the perfect basis for immediately introducing the most important mechanics of this Total War: Warhammer 2. Unlike the first chapter, or perhaps it would be better to say in addition, now the victory conditions of the campaign will not only focus on the total control of the territory but also on the management of the vortex precisely, an element that alters the rhythms of the game forcing the player to continue sorties, preventing him from entrenching himself in a specific area waiting to recover forces and troops enough to launch a determined assault. The attack and the disturbing actions therefore become very important given that to get to control the vortex it will be necessary to go through five specific rituals, in a race towards the goal where all the opponents compete at the same time. In the upper part of the interface, a progress bar appears which grows and fills up by accumulating the resources of the rituals, which can be obtained in various ways. There are specific buildings to be built that give you a fixed income but there are areas and camps that can provide you with a large amount in a short time, objectives of primary importance to achieve final victory. It will therefore be very important to plan with due care which regions to conquer first, in an attempt to grab the precious rewards of the rituals. The artificial intelligence has evolved properly and new routines have been inserted just to put a spoke in the player's wheels. At the beginning of each ritual the forces of Chaos will awaken trying to interrupt it, forcing you, once again, to defend your territories equally. It is a further level of depth compared to what we tasted in the first chapter that satisfies us and which, even if it channels the player towards a less free way of playing, also draws a campaign that is easier to follow and even more suitable for novices. Starting to follow the series from this second chapter is in fact absolutely possible given that the plot supports itself independently and the new races, with all their pros and cons, are a novelty both for those arriving on the servers for the first time and for the veterans. Eight new faces We were particularly gratified by the difficulty curve of Total War: Warhammer II as it is malleable and adaptable to every need. You can start with any race and hero by choosing from the canonical levels of difficulty, then deciding to rely on the tutorial or let experience guide you, with eight initial heroes able to further vary the pitfalls based on the different areas of departure on the game map. The title deftly guides you through all the novelties and the campaign is studded with side missions to complete, objectives to pursue and requirements to fulfill. You feel transported throughout the expansion journey and never find yourself lost or left alone to make your own decisions, which is an incredibly good thing for a game like this. Finalmbody we can also say we are happy with the amount of content added by Creative Assembly which completely justify the full price at which this second chapter is sold. The races are completely different from anything you've played in Total War: Warhammer to date and the map is truly immense, even larger than the Old World. The models of each individual soldier were then built from scratch and the amount of work hidden behind the Lizardmen is enormous if we think of the effort required to model and animate Stegadons, Bastiladonts and all the other enormous beasts of the menagerie. All armies were then properly diversified with their own mechanics and unique special abilities, as we had already described in our previous preview. There isn't much to say instead about the actual gameplay during the battles, which has remained substantially unchanged, finished with slight modifications and balances to the behavioral routines of the artificial intelligence but very little else. Jurassic Park One thing we particularly liked about this new chapter is the variety of races placed near your starting point. In the first Total War: Warhammer, entire turns were spent fighting the neighboring rival faction, thus obtaining clashes that were all very similar to each other. This time, perhaps going a little against logic but improving the final result, there are many more races that control the various territories, offering greater variety both in terms of visuals and in terms of alliances to make. Unfortunately on diplomacy the title still shows its side, with rather insistent requests about senseless peace treaties and sudden acts of war, a marginal problem but inherited from the first chapter and not yet resolved here. Another sore point, unfortunately, is the absence of naval combat if not with automatic resolution, a feature loudly requested by fans but which unfortunately failed to arrive in time for this chapter. Then small tweaks have been added to the map, with ruins to explore in pure RPG style with lots of decisions to make and rewards based on our choices and there is also a more accurate management of the end of the turn with suggestions on all the things that still possible to complete before giving the green light to our opponents led by artificial intelligence. It is now possible to colonize any camp without having to limit yourself to those perfect for your faction, obviously suffering malus in case of inhospitable territories, and there are really many other small changes and tweaks in this second chapter, too many to tell you about each of them individually. Let's just say you'll be happy with it, and the feeling of inflated DLC is far, far away. Optimal! There is also good news regarding the general optimization of the game. The graphics have remained almost unchanged, with the exception of the forests made more luxuriant, but the loadings, now faster, and the general stability have been optimized. On a mid-range PC equipped with the SLI 780, the game is played without any slowdowns by keeping all settings at high with 60 fps and a resolution of 1080p. From here you can easily go up to have a better quality with superior components, working on the many advanced settings: from the volumetric fog to the quality of the textures, obviously passing from the anti-aliasing and reflection filters. The only regret is that no better work has been done on spells and special effects in general which still have that fake flavor that was already felt in the first chapter. From fireballs to lightning storms, everything is not very credible on the battlefield, including the clouds of arrows that rain down on the units, which have always been very unattractive to see when instead they could be that small tax useful for production to achieve excellence even from a visual point of view. Last note, finally, for the support, which as always will be gigantic and continuous in the months to come, with a huge campaign arriving in the near future which will unite the worlds of the two chapters, all the races and the different mechanics, for a unique and truly complete experience for a game based on the Warhammer universe. In the meantime, you can decide to throw yourself into multiplayer online matches, or to face a cooperative campaign between the owners of this second chapter: a division of the servers that we have not fully appreciated.", "date": "2017-09-25", "grade": "8.8"}