{"name": "Una recensione avventurosa per Champions and Challengers - Adventure Time", "ref": "https://multiplayer.it/recensioni/188933-champions-and-challengers-adventure-time-una-recensione-avventurosa-per-champions-and-challengers-adventure-time.html", "text": "Ten years after its birth, the Adventure Time animated series continues to have a large following and to churn out various video game tie-ins, even in the mobile sector. Champions and Challengers - Adventure Time is therefore only the latest title in a long list, created by YesGnome for iOS and Android devices, characterized by the now essential freemium format. In this case, the solution adopted by the developers is however very ~soft~: the game can be downloaded for free from the App Store or Google Play and includes an action energy indicator which limits the amount of challenges that can be played without pauses, but at the same time the indicator recharges very quickly and it is therefore rare to find yourself in the situation of having to wait a few minutes to be able to continue playing. From a structural point of view, the story confronts us with the classic path made up of twelve increasingly complex levels, each divided into a series of stages in which we will have to face a set of opponents based on a turn-based combat system that draws clearly to the RPG genre. From ours we will have a total of seventy characters, most of which naturally to be unlocked through the use of in-game currency or real money, but also to be upgraded in various ways using the crates and gems that the system releases with relative frequency. In short, having made up our team, we will have to resist increasingly numerous ~waves~ and make the most of the energy indicators in order to inflict as much damage as possible. Samples of sympathy There is no doubt that the strength of Champions and Challengers - Adventure Time lies in the charm of its characters, the same as in the television series, and that therefore the production by YesGnome aims to involve fans of the cartoon in particular. The turn-based gameplay, relatively simple and immediate, takes a bit of effort to get into gear but then reveals all its facets, thus making converts even among those who don't know Finn, Jake and their friends in the slightest. It is useless to deny the systematic repetitiveness of the action: the fights are basically always the same, as are the dynamics that characterize them, and what changes is only the degree of difficulty or possibly an enrichment of the repertoire of moves at our disposal. However, as mentioned, from the second level onwards it is possible to observe a progressive increase in thickness as certain mechanisms are understood: both our characters and the opponents attack when their fatigue bar is full, which allows block shots in time and avoid unnecessary damage; at the same time, however, the bar at the bottom of the screen earns points and allows you to unleash devastating super moves, stun your opponents or recharge the health of one of the party members. Using all these resources in the best way becomes essential to be able to access the more advanced stages of the campaign, although at a certain point it becomes practically obligatory to replay the levels already completed, perhaps at a higher degree of difficulty, to obtain the experience necessary to be able to be competitive. In short, the formula is rather simple and devoid of acute notes, it becomes pleasant as soon as the challenge becomes more consistent and can count on a very well-designed technical sector, both in terms of interface and character design.", "date": "2017-09-23", "grade": "7.0"}