{"name": "Tourist Trophy", "ref": "https://multiplayer.it/recensioni/tourist-trophy.html", "text": "Digital Horses First of all, it should be specified and emphasized that Tourist Trophy is the son of Gran Turismo: the game carries with it all the baggage of menus, sound effects, graphic devices and game modes present in GT and slightly modifies the gaming experience to adapt it on two wheels. On the game ~table~, which represents your access menu to the various Career modes, you can access the licenses, always four and made up of ten tests each, with tests that, in addition to including braking and cornering driving , will put the player to the test with some slaloms that closely resemble the real motorcycle license practice test. The real difference with GT, in terms of game structure, concerns the fact that by competing in special stages and championships you won't win money but directly bikes to use. The game is deprived of all elements related to the presence of money: from participation in races to earn what is missing to the purchase of the coveted racing car, up to the buying and selling of cars, whether new or used. In event mode, the selection interface is divided according to the manufacturer of the vehicle: it will be enough to select a specific manufacturer and a specific model to participate in a head-to-head race where the bike itself will be up for grabs, everything that will be necessary to winning it will mean reaching the opponent, overtaking him and standing in front of him for at least ten seconds. This type of game mechanic (you race against a specific bike, win that bike), also greatly facilitates the completion of special cups, which in the manner of Gran Turismo, have entry barriers that can vary from engine size to specific type of motion. Both during the events and in the championships, in addition to obtaining the motorcycles as a prize, it will be possible to unlock a whole series of motorcycle suits and accessories to create your own motorcycle look: all the various ~pieces~ are the perfect re-proposition of elements of really existing clothing coming from the most famous manufacturers in the world of motorcyclist clothing (arai, spidi, nolan,...). bars of soap If on the side of the tracks present in the game, Tourist Trophy once again draws heavily from its brother Gran Turismo, what changes substantially concerns the driving model. Before delving into the concepts related to actual motorcycle riding, it should be said that the Tourist Trophy vehicle fleet is considerably smaller than that of GT, both for reasons relating to the actual lower number of motorcycle manufacturers and as regards the exclusion of the whole category of motocross and enduro bikes. The game allows you to use practically all the most famous motorcycles (road and track) for twenty years now, integrating significant differences in handling that reflect - as far as we can go too far to talk about motorcycles released in 1985 - quite faithfully those that are the mechanics of using a real bike. The absolutely most important elements to be able to learn to ride along the tracks can be expressed in two factors: the feeling with your bike (and here we are talking about response to commands, braking times, cornering behavior, acceleration, .. .) and the understanding of the trajectories. Starting from this last element, the trajectories represent an even more important factor compared to GT: by understanding when to enter the bend, with what speed and the exact moment in which to reopen the gas, you can easily aim for victory, otherwise you will often beaten by opponents; speed out of corners, having a 150kg racing car under you, will often be the turning point in a race. The bikes differ drastically from each other: depending on whether you have more or less engine capacity, the bike will be more or less manageable, more or less heavy and therefore to be managed differently as regards trajectories and braking distance. The bikes will be modifiable as regards a whole series of technical parameters such as the lean angle allowed or the classic timing for inserting the gears, however the section dedicated to tuning your vehicle is entirely missing, reducing the recommended (and practicable) modifications ) on the bike to the sole choice of the muffler. Although the guide follows reality quite faithfully, the game partially ignores some important unknowns during the race such as for example the different grip on the curbs, the dirt on the track or the actual deterioration of the tyres; the biggest mistake (which pushes it to the brink of an arcade driving game) however TT commits when going off the track: motorcycling is a highly condDriven by human error, by the skill of the drivers and by their courage in terms of overtaking at the limit, this generates off the track, crashes and so on. All of this is impossible to find in this game: going off the track due to a trajectory error is underestimated, treated as a kicked shot into an empty net, a non-drastic and absolutely remediable error, and it is in this perspective that the player who makes a mistake and falls finds himself standing in the middle of the track in less than half a second and, more often than not, even with a discreet advantage over his opponent, if with this he was in a hard-fought head-to-head. This element, although inserted to avoid obvious frustrations, turns out to distort the races themselves, and it's a shame if you think about the care taken by the developers in every other aspect of the game. Graphically, Tourist Trophy has no rivals, it uses the same graphics engine as Gran Turismo and exploits it to the best of its abilities, also lightened by the presence of up to 4 motorcycles on the track (often duly spaced from each other). Tracks, menus and music are a direct porting of what has already been seen and heard in the recent GT4, the same thing for the management system for photographs and replays which also offer in this two-wheeled version the possibility of creating hoc using particular photographic cuts and image color management filters. The animations of the pilots amaze for their truthfulness, both in the fall phase and in the race (the one that allows the player to look back in search of opponents is splendid). The detail of the bikes does not disappoint, each model is absolutely recognizable by the most attentive fan, both in terms of shape, colours, stickers and so on. The review should probably be read from two different points of view: those who have played GT and are preparing to get their hands on TT or those who are simply passionate about motorcycles and hope to complete this passion with something more ~homemade~. In the first case, although the game represents a good start, TT is nothing more than a spin-off of GT, with many (perhaps too many) reused things and some important omissions in favor of lowering the difficulty. In the second case, instead, buy with your eyes closed, the world of motorcycles has never been so well cared for and in-depth and closing your eyes on some questionable defects, you can only be absolutely satisfied by the folds, the chicanes and the realistic driving sensation. The vote wants to be a middle ground between the two cases, Polyphony has an excellent card on hand to be exploited in the future, the ps3 pad promises to be perfect. Pro: It's the Gran Turismo of motorbikes. Graphically excellent. Realistic rendering of driving. Cons: Too many elements ~imported~ from Gran Turismo. Some aspects of driving are more arcade-like than simulation. The no-money structure makes the game much easier. One of the software houses that has made the fortunes of Sony and Playstation in recent years is certainly Polyphony, which with five Gran Turismos under its belt (if you also count the pseudo-demo ~Prologue~), has carved out a special place for itself in the hearts of all driving and video game enthusiasts around the world. With millions of copies sold behind them in Poliphony they have thus decided in this term of the generation to slightly change direction, always keeping in the world of engines but substantially halving the wheels involved. The Tourist Trophy can probably be defined as an end-of-season experiment, or rather a dive into the void with the safety net just below. Obviously, to find out the reasons for these definitions, you just have to keep reading, and see if the Japanese have the right handlebar in hand to make inroads even among motorcycle lovers.", "date": "2006-06-08", "grade": null}