{"name": "La recensione di One Piece: Unlimited World Red Deluxe Edition", "ref": "https://multiplayer.it/recensioni/188409-one-piece-unlimited-world-red-deluxe-edition-la-recensione-di-one-piece-unlimited-world-red-deluxe-edition.html", "text": "Like other successful manga, One Piece has recorded a large number of titles for almost all consoles in circulation in recent years. Unlike series such as Dragon Ball and Naruto, however, the bizarre crew of Eiichiro Oda has the merit of truth on its side: presenting not only fights, but in addition the exploration of original worlds and dwelling on the introspection of the protagonists, video games of the series can also be very different from each other. There is room for mousou, with the Pirate Warriors trilogy, for the Burning Blood-style fighting game, and for that more heterogeneous collector called Unlimited World Red Deluxe. An already old container for today's rhythms, which appeared for the first time in 2013, and which Bandai Namco has decided to rejuvenate on the occasion of the launch on PlayStation 4 and PC, soon on Nintendo Switch. Mission accomplished? Count Dracula is ready to set sail Variety is one of the strengths of Unlimited World Red as an action RPG, both in terms of game environments and the customization of gameplay aspects. At the base of the title there is a conspicuous exploration factor which strengthens the idea of ~adventure~: the player is required to reach one island after another, examining it in every nook and cranny, sometimes reconstructing its city centers, and eliminating enemies present until the boss fight. Fauna and flora change from island to island, most of the time according to rather questionable criteria. For example, one passes from the desert to the snow-capped mountains, from city ruins to the forest, with disarming ease. The intent is to offer experiences that at least always seem different. The same strategy is adopted for the enemies: marauders, marine soldiers and Caesar's henchmen will fight together, simultaneously spawning in certain areas, for no apparent reason, hiding the simple fact that in movements and attacks they are always the same type of varied enemy endlessly. In the combat phases, Unlimited World Red draws, with a great simplification, on that gold mine of the Pirate Warriors combat system. A few simple basic attacks, divided between light and heavy, will allow you to get the better of every enemy. Furthermore, each defeated opponent will allow you to load energy points, useful for performing devastating combinations accompanied by special scenic cutscenes. There are several modes at the base of the battles against the bosses of the islands, which are also rather repetitive and at times more frustrating than ingenious. A few keys to press in sequence in almost QTE mode, dodge after dodge performed in record time with the pressure of the circle key, and offensive sessions in which you can beat her up (before time runs out), will allow you to take home the victory, even against the most dangerous enemy. To make the management of the crew and the fights more technical, different skills take over for each character (about fifteen in all), the possibility of carrying only three companions with you during the exploratory phases, and the battle phrases. The latter, by pressing the R1 command, will be able, depending on the case, to invite your supporters to heal you, help you counterattack, change your fighting technique and much more. But they should be used in moderation, otherwise you risk being literally without a voice and not being able to use them for a while. Playstation 4 trophies To get the Unlimited World Red platinum trophy you will have to dedicate yourself to the title for at least sixty hours. The actions to be performed are not complex and almost all focus on cumulative actions, which will take you away a lot of time. They range from bringing each character to the maximum level, to catching a certain number of insects and fish, to the actual crafting of objects and consumables. Arm yourself with patience and the platinum will be yours! Between mini-games and clashes with friends If combat and exploration aren't enough to satiate your thirst for adventure, the title still has a few tricks up its sleeve to enrich the offer. The RPG mechanics are also felt in what we could define as city logistics: numerous non-playing characters will ask us to restore an inn here, there to open a pharmacy, still others will have a desperate need for that particular insect that lives on the back of the village, or a rare fish. It is here that, net and fishing rod in hand, you will experience an unlikely Animal Crossing: One Piece Edition. Items are linked to specific mini-games, an interesting addition to the base but which, like so many other aspects, has not been investigated adequately. To fish you will have toexecute the commands on the screen as quickly as possible, in a sequence of keys that will gradually test your precision and your nerves. Easier to catch various insects and small animals, since once the net is equipped you will simply have to run after them and catch them before they run away. The wording Deluxe also isn't juxtaposed with the title just for the term's sake. Unlimited World Red returns to the new platforms in 1080 p and 60 FPS, enriched by all the DLC released individually during 2014 (there are over 50!), with many costumes and outfits with which to customize the appearance of the members of Luffy's crew. An unprecedented local cooperative multiplayer mode has also been added exclusively on Nintendo Switch: with a second controller in hand you can take to the arena in the company of a friend and eliminate enemy after enemy as if there were no tomorrow. This is certainly not the triumph of originality, but the philosophy behind the title is clear: ~the more there is, the better~.", "date": "2017-09-12", "grade": "7.2"}