{"name": "Torniamo in campo con Pro Evolution Soccer 2018", "ref": "https://multiplayer.it/recensioni/188376-pro-evolution-soccer-2018-pes-2018-torniamo-in-campo-con-pro-evolution-soccer-2018.html", "text": "How the Pro Evolution Soccer series ended up chasing the competition after years of being the queen of football simulations has been talked about far and wide. In the meantime, we have left behind a video game generation, with the entry into the current one which according to Konami has symbolized a real rebirth for football. A renewal process that lasted for years, the fruits of which could be appreciated in alternating phases up to an edition like last year's, with which the Japanese publisher brought Pro Evolution Soccer back in the right direction. Summer 2018 brought with it an online beta, organized to try not to run into the same mistakes of the past, with the hope therefore of guaranteeing with Pro Evolution Soccer 2018 that leap in quality that in all respects could bring the simulation to par with FIFA. We already got some ideas about it with the demo that arrived last week, but with the official release date of Pro Evolution Soccer 2018 approaching, now is the time to take stock. Before doing so, just like a year ago, we must specify that during the processing it was not possible for us to evaluate the effects of the beta on the online sector, given that the game servers are still closed. In the same way, the patch already announced by Konami for day one is still missing, within which all the transfers and some unspecified improvements to the game should arrive. However, you can count on the fact that we will return to talk about both topics, which have become a raw nerve in the Pro Evolution Soccer series in recent years. The beauty of football Having archived the big problems of two years ago, Pro Evolution Soccer 2017 represented an excellent starting point for the 2018 edition. Not a small aspect, especially if we see it as an opportunity to guarantee continuity of growth to the simulation gameplay , taking advantage of it to file some defects that willy-nilly this series has been carrying around for some time. We therefore trust that Konami will no longer mess things up like that of Pro Evolution Soccer 2016, moving on to what Pro Evolution Soccer 2018 has to offer us at present. Remaining on the subject of game dynamics, Real Touch+ stands out this year, an evolution of the technology already presented a year ago to improve the players' handling of the ball. The ~plus~ introduced by Pro Evolution Soccer 2018 is represented by a further step forward in the control phase, thanks to which we can see our players taming the ball with different parts of the body, even in a dirty way as happens in reality. At the same time, once in possession the players show that they have a greater awareness of their opponents, in some cases automatically covering the ball to prevent it from being lost. This allows those who have the controller in hand to study new ways to dribble, also in this case the flagship of the game: being able to jump an opponent is not so much a question of how many keys you are good at pressing to fake and counter feints, but the result of a wise use of changes of direction and accelerations, capable of giving extreme satisfaction once the defender is left behind. The same kind of satisfaction you get in setting up a choral action to pierce the opposing defence, always able to position himself to prevent us from going to the net by dribbling everyone like Maradona. Scoring a goal after putting together a network of passes, a change of play or even a simple one-two at the right time offers a unique satisfaction, thanks to which Pro Evolution Soccer 2018 really manages to allow you to taste football in its true essence . An excellent artificial intelligence contributes to this, already the flagship of last year's edition. The developers also listened to players' prayers when it came to set pieces, removing direction lines that simply couldn't be seen. The serving mode is now similar to that of FIFA, thus leaving it up to the player's training and ability to ~see~ where the ball will go to decide the outcome of a direct free kick on the net or a dangerous corner kick. Playstation 4 trophies Pro Evolution Soccer 2018 brings with it fifty Trophies. In addition to the usual Platinum, we find two of the Gold type, ten Silver and thirty-seven Bronze. The prizes are linked to the various modes of the game, to which you will therefore have to dedicate yourself if you intend to complete the collection dedicated to this title. There is no shortage of real feats, such as the one that asks us to recover a match in which we are losing 0-3 All roses and flowers? If, as already mentioned cThere are cases where Pro Evolution Soccer 2018 lets us savor the beauty of football, there are others where the simulation fails to rise to the desired point. Let's start with the referees, certainly improved compared to the mess of the 2016 edition but perhaps less convincing than a year ago: our impression is that it is above all the tackles that put them in difficulty, making them give up the whistle in situations where this would be sacrosanct. In fact, on more than one occasion we have seen a defender intervene on the support foot of our attacker engaged in shooting, thus preventing him from completing the action. There is also a problem in switching players with the L1 button, with which you often end up controlling an unwanted player: fortunately it is possible to remedy using the right analog stick, even if in the most agitated situations the use of L1 would still be useful . Another historically exposed nerve is that of the goalkeepers, who have also improved during the last few editions: the work done by Konami is overall good, leading the extreme defenders to make exciting saves even in counter-time, thanks to the inclusion of new animations. However, there are situations in which their intelligence fails, for example allowing us to sensationally win the ball with a slide to go into goal undisturbed. This happened even on the higher difficulty levels. We also point out the persistence of some impressions we had during the demo, mainly linked to the tracks - rare but not yet completely eradicated - and to the cumbersomeness of some movements, almost as if the developers had resorted to this ploy to limit the game speed , arrived in a perfect state anyway. Off the field Not having the myClub mode available due to the servers still offline, we immersed ourselves in the other Pro Evolution Soccer 2018 modes, starting with the fun ~novelty~ of casual matches. Once the team generation criteria have been established, the players can try to steal the precious pieces from the opponent through a series of exchange rounds, also using the latter to protect their pupils from the intervention of others. The Master League has remained almost unchanged with the addition of some minor elements, while for the same reasons mentioned above it was not possible for us to touch the definitive version of the online cooperative mode, which we recall will allow you to play two-on-two matches or three against three. In selecting modes and options, you can also appreciate the work done by Konami on the user interface, long the subject of prayers from fans who got lost in the game's menus. The result is certainly positive, with the gem being the photos of the players' real counterparts that appear to us when we define our training. The same photos also appear during matches, thanks to the addition of a superimposed graphic dedicated to match statistics. The chapter dedicated to licenses still remains critical, in which Pro Evolution Soccer 2018 does not make any particular progress. Juventus, which disappeared a year ago, remains PM Black White, just as to find Real Madrid you need to go looking for the MD White team. Even if the Serie A license is absent, we Italians still cannot complain, given that only Arsenal and Liverpool are licensed in the Premier League, while in Spain the situation changes slightly with Atletico Madrid, Barcelona and Valencia. The German championship is totally missing, with the exception of Leipzig, Schalke 04 and Borussia Dortmund. Instead, there is no problem with the French Ligue 1 and the Dutch Eredivisie, while the lion's share from the point of view of licenses remain South American leagues and teams, with Argentina and Brazil in the lead. The licensed competitions remain the same: Champions League, Europa League and AFC Champions League. Even if graphics and sounds refer to the magic of cup Tuesdays and Wednesdays, it must be said that the Champions League license loses its ~power~ precisely because of the fake names introduced for unlicensed teams. Not just Barcelona The technical sector of Pro Evolution Soccer 2018 shines with a light of its own, capable of giving a truly effective glance. The Camp Nou has now been turned inside out by Konami, which has faithfully reproduced it within the game in every aspect. However, we find other teams with their own stadium, thanks to the exclusive agreements made by Konami for the transposition in the videogame field. The total number of stadiums present within the game is unfortunately always small: the aforementioned field played by Messi and company joinsno Signal Iduna Park, Wanda Metropolitano, San Siro and a few others, especially as regards Europe. Reverse speech for the appearance of the players, made with cutting-edge facial scanning techniques in the case of teams like Barcelona, but still able to defend themselves very well even for ~normal~ ones. As per tradition, Konami has also dedicated itself to less famous footballers, to the delight of those who don't always want to play with the usual suspects. The physics of the ball has been promoted, heavy at the right point to give the degree of satisfaction needed in shooting from a distance, or in directing a pass to the other side of the field. The commentary in Italian was once again entrusted to Fabio Caressa and Luca Marchegiani, improved in the exchanges even if there are still moments in which the name of a player or a team is pronounced with a different emphasis from the rest of the sentence . The soundtrack is good, composed of songs of various genres including those of Clean Bandit, Linkin Park, Coldplay, Bruno Mars and others.", "date": "2017-09-11", "grade": "8.4"}