{"name": "Il lancio lungo di Madden NFL 18", "ref": "https://multiplayer.it/recensioni/188292-madden-18-il-lancio-lungo-di-madden-nfl-18.html", "text": "Working on an annual franchise is never easy. And if it's a sports game, things can get incredibly complicated. In fact, at the release of each edition, the accusation of having published a team update without particular novelties hangs over the heads of the developers, which forces the insiders to invent something that can justify the expense from year to year: sometimes they succeed, others less, ranging for their gimmicks from new elements in the game dynamics to the available modes. The new Madden NFL 18 does it all, bringing with it elements concerning more than a single aspect while giving a wink to FIFA 17. The new chapter of the almost thirty-year-old American football simulation follows in the footsteps of the football one, approaching it for more than one reason. Are you curious to know how and why? All you have to do is keep reading! Nice to see you, Devin Like FIFA 17 with its Journey, Madden NFL 18 also brings with it a story mode, inserted by the developers to tell the exploits of a football promise. The person in question is Devin Wade, a young sport phenomenon who left the fields for three long years, before trying his luck together with his inseparable friend and teammate Colt Cruise by participating in the Scouting Combine which is held every year in Indianapolis. After the brief introduction dedicated to the childhood of the two, Longshot (this is the name of the mode) takes us straight before the eyes of the NFL team observers, focusing on some aspects of the friendship between Devin and Colt which will naturally continue to be the background to the game. whole plot. Just like the story of Alex Hunter in FIFA 17, Longshot is an appointment destined to last even in the coming years, bringing the story of Devin Wade to completion from time to time, also taking advantage of it to introduce the game to newbies. American football is in fact as fascinating as it is complicated, at least in the eyes of most of us Europeans, which is why using Longshot as an entry point into Madden NFL 18 doesn't have to seem so weird. Especially since at times Devin is subjected to real tactical lessons, which the player can take advantage of to increase his knowledge of this sport. In reality, much of what happens in Longshot has little to do with the action on the field, relegating the latter to only a few moments. In fact, from a narrative point of view, Longshot goes further than The Journey of FIFA 17, approaching the videogame style of Telltale Games with the amount of dialogues and the presence of multiple (and difficult) choices. All driven by the hands of the developers of Madden NFL 18, of course, but put together in a way that allows you to enjoy the handful of water bottles it takes to complete Longshot, before you can devote yourself to the ~real~ game. By the way, like FIFA 17, Madden NFL 18 also says goodbye to the old Ignite Engine, opening the doors to Frostbite: with a mode like Longshot on the way, it couldn't have been otherwise. Playstation 4 trophies Madden NFL 18 brings with it forty-one Trophies, of which one is platinum, three gold, twelve silver and twenty-five bronze. Their typology ranges from all the modes offered by the game, obviously including the new Longshot to be completed according to particular parameters to receive your reward. Collecting them all will keep you busy for quite a while, even considering the need to win with each of the thirty-two NFL teams to earn one of the gold-type Trophies. A Madden for everyone Succeeding within Madden NFL 18 requires a good deal of commitment, especially if you are approaching this series for the first time. Continuing on their journey for the benefit of newbies, the guys from EA Sports have introduced styles of play that influence what is seen on the field. The classic simulation is obviously part of the three alternatives, which complement each other with the arcade and competitive styles. In the arcade, realism gives way to entertainment, promising games with high-sounding scores and games that border on the impossible. The competitive style is instead linked to the online game, a cross between the two previous ones, however oriented towards simulation. Depending on your tastes, you can choose one of these three ways, while in common to all there is the new passing mode called Target Passing, which can be activated alongside the traditional one using the appropriate key combination after the snap. From a theoretical point of view, Target Passing allows our quarterback - and therefore us - to have greater control over the direction of the ball, offering the possibility of sewing passestoday that otherwise with the use of the traditional method it would not have been possible to achieve. In practice, however, there is a problem related to the short time you have available to aim and fine-tune the throw: needless to tell you, the sack is just around the corner. Returning to the available modes, the Franchise seasons remain more or less similar with the possibility of improving one's team with parameters earned thanks to experience in the field, while an interesting novelty also concerns Ultimate Team. If the card collection has remained unchanged in its basic essence, the introduction of MUT Squads is able to capture the interest even of those who have never gone crazy for the Ultimate Team. It is a cooperative mode that can be played up to three against three online, where each of the players takes on a key role as head coach, offensive coordinator and defense coordinator. The choice of roles thus divides the respective responsibilities, before taking the field and controlling one's players. The formation of the team draws from the squads that the participants possess, thus guaranteeing potentially infinite variability. Guaranteed show From a graphic point of view, the area where the introduction of the Frostbite engine stands out the most is in the Longshot mode. In this case the use of technology combined with the use of real actors ensures that the characters are perfectly animated, hand in hand with the care of the places where Devin and Colt take their steps to enter the NFL world. Once on the field, the differences are less noticeable, but this should not be interpreted in a negative sense: already last year Madden NFL guaranteed a considerable level of entertainment, improved in 2017 especially as regards the presentation phase of the match. Starting the game, more efficient collision management is noted, although there are cases where players do strange things on the field: in a year of transition from Ignite to Frostbite like this, they are certainly forgivable. Confirmed Brandon Gaudin and Charles Davis at the commentary, on which it will be necessary to work further to smooth out some inaccuracies with respect to what happens in the field. Soundtrack of normal level, lower than what is normally heard in a FIFA. Finally, we point out some loading too many, inherited from the last edition despite the change of engine.", "date": "2017-09-08", "grade": "8.8"}