{"name": "Sparc  lo sport del cyberspazio", "ref": "https://multiplayer.it/recensioni/188255-sparc-sparc-e-lo-sport-del-cyberspazio.html", "text": "For those who grew up on bread and Tron, the dream of virtual reality had a very specific symbology. Worlds in computer graphics made of wireframes, gaudy cyberpunk onesie bordering on the tacky, crazy races on digital motorcycles and lethal sports in which you throw a puck in an attempt to eliminate your opponent's avatar. After debuting in the VR market with Eve: Valkyrie, CCP Games tries to recreate that imaginary with Sparc, on the one hand a visceral competitive sport designed specifically for virtual reality, on the other one of the most successful attempts to shape the world of Tron. Space Paranoids Unlike Eve: Valkyrie, which combines online deathmatches with side missions and a minimum of story, Sparc arrives on PlayStation VR in an extremely essential form. Except for a tutorial and a series of small challenges that serve as training, the only real mode of the game is represented by one-on-one online matches. Put on the visor and challenged the Moves, each of the two challengers faces off in a sport that is an amalgam of different disciplines. Each player has a ball of his own color that he can grab and throw: in the offensive phase the goal is to try to hit the opponent to earn a point, perhaps by displacing him with spin shots or by bouncing the ball off the walls of the room; in the defensive phase, on the other hand, you have to move your body to dodge incoming blows, or alternatively you can repel them with a shield. In the Sparc rules you can find some dodgeball, some squash, some air hockey, a lot of Tron's disc battles. Essentially, it's Pong in VR. Yet CCP Games' virtual sport manages to have its own personality thanks to many small mechanics that are only possible in a video game: the shield shatters every time it is used, regenerating itself only by throwing and catching its ball; the player's gloves have similar protection on the knuckles, allowing the ball to be punched back; the sphere can then grow larger and faster, making it more difficult to dodge. In an attempt to make their press releases cooler, CCP Games uses the term ~v-Sport~ (virtual sport), but the idea that Sparc could be the link between traditional sports and multiplayer video games is not so crazy . Whether you do physical activity or not, a game session at Sparc is quite tiring, after an hour you find yourself soaked in sweat and you feel fatigue in the muscles of your arms and legs. And it's a great feeling. Using the microphone integrated with PlayStation VR it is possible to communicate by voice with other players in the same room, but there is really no need, since the tracking of one's body stimulates interaction with others even through simple gestures. You wave, punch your opponent to start the match, while clapping and bowing at the end of the match. There is also room for braggarts, among those who feel a bit like Bruce Lee and provoke their opponent with their hand and those who instead dance the macarena between one blow and another. The feeling of presence is very strong, and to make the experience even more ~personal~, there is not even an editor that allows you to modify your avatar both in terms of colors and clothing, changing your hairstyle, mask, overalls and gloves. Considering the focus on online matches, however, we expected a greater number of options related to the competitive sphere, perhaps with the possibility of changing the rules of a game, attending other challenges as a spectator, launching into two-on-two matches, increasing one's ranking online or organize small tournaments with your friends. Furthermore, each room contains only one field, an ingenuity that forces those who are not playing to wait their turn in line rather than challenge each other. However, part of Sparc's problems stem not from the game's shortcomings, but from the limitations of PlayStation VR. The precise calibration of the viewer and the Moves is essential if you don't want to have a big handicap against your opponent: otherwise it would be like playing tennis with a crooked racket. When everything works correctly, Sony's headset does a decent job of tracking body movements, but it's a safe assumption that such a physical and competitive experience will be even more rewarding when it arrives on HTC Vive and Oculus. Maybe, hopefully, with the ability to play cross platform exactly like EVE: Valkyrie.", "date": "2017-09-07", "grade": "8.0"}