{"name": "Nelleternit anche su console con Pillars of Eternity: Complete Edition", "ref": "https://multiplayer.it/recensioni/188195-pillars-of-eternity-complete-edition-nelleternita-anche-su-console-con-pillars-of-eternity-complete-edition.html", "text": "It's been a long time since we've set foot on the wastes of Eora, admired the pre-rendered maps of that world and waded into its endless sea of dialogue but doing it again has the same charm. And this is a charm that arises from the very nature of the video game set there: Pillars of Eternity, a spiritual successor to those Baldur's Gate and Planescape Torment that have forever marked role-playing games, but developed in an era where similar games they seemed forgotten by now, and to whose success their rebirth is largely due. We are not here today however to discuss the importance of Obsidian's work, that is established; if you are reading these lines it is in fact due to the launch of Pillars of Eternity: Complete Edition, a beautiful re-edition containing all the DLCs and improvements made, and designed for the current generation of consoles. We therefore temporarily abandoned the mouse to pick up the pad, with the intention of finding out if after passing to other shores the game remained a classic. Here is the report of our ~new~ adventure. A vast world and so much to read Pillars of Eternity we have already reviewed it, and we were thrilled. There's little more to say, along with Divinity: Original Sin was one of the most significant steps forward for old-fashioned Western RPGs of the last decade, despite being a title vastly more tied to the past than Larian's revolutionary baby. Therefore it is useless to describe in detail once again all the characteristics of the game, we will limit ourselves to brushing up on everything by emphasizing the most striking features of the system. In practice, the highest element of Obsidian's work is the narrative: we are talking about a completely new world, detached from well-known fantasy mythologies such as those of Dungeons and Dragons, World of Darkness or Numenera; the team created the universe from the ground up and filled it with memorable characters, well-constructed storylines and skillfully written dialogues that alone can greatly enhance the value of the experience. What really needs to be specified is ~how~ verbose this product is, since it starts from rather trivial events to develop in unexpected ways, and almost immediately gives the protagonist the ability to interact with spirits, which translates into the practical chance of catch clips of past events by getting close to certain characters (and other goodies that we have no intention of revealing to you). The direct consequence, of course, is a monstrous mass of text written between memories, dialogues and various interactions, carried forward by a structure that at times recalls gamebooks, and allows the player to resolve events with various actions depending on his or his statistics. his companions. In general, it turns out to be a brilliant gimmick, which makes everything more varied and usable compared to other equally verbose titles, even if it is not enough to facilitate the approach of players who are not inclined to read. Yes, in short, if reading mountains of text is not your thing, keep well away from Pillars; the platform doesn't matter. Radial menus, radial menus everywhere As for the rest of the gameplay, there have been no changes: we are still faced with a real-time system but which can be blocked with a tactical pause during fights. Everything is decided by the rolls of the dice (suitably ~facilitated~ based on the difficulty selected) which follow the rules of the title, rather similar to those of the Advanced Edition of Dungeons & Dragons at the base of the classics of the genre mentioned at the beginning of the article. These are mechanics clearly built around the mouse and keyboard, which are enforced here through the use (not to mention the abuse) of radial menus. In short, whether it is a question of going to the inventory, developing one's own character or deciding which skills to use in combat, you will always have to go through the radial menus: it was the only sensible solution to make such a complex title intuitive and full of statistics, the we know, but for obvious reasons everything feels a bit slower and woodier than the PC version. The interface, for the record, hasn't changed one iota outside of these menus, and maintains colors and small print that don't really go great with the distance of a TV. Overall, however, the port lets itself be played with grace and maintains the very useful option to speed up the action of the original game, practically essential to give some rhythm to certain prolonged exploratory phases. On the other hand, the technical sector is less good, which has not undergone almost any improvement: graphically the title is practically identical - not that it is a bad thing, given the beautyof certain wallpapers, but it wasn't incredible at launch - the uploads are longish, and we happened to see some annoying bugs in action, proving that even after all this time it hasn't been done a perfect cleaning job. In contrast, at least, there are all the contents of ~The White March~, an expansion of the game in two parts, and the awareness that we are still dealing with one of the best role-playing games out there.", "date": "2017-09-06", "grade": "8.5"}