{"name": "Absolver", "ref": "https://multiplayer.it/recensioni/187905-absolver-ego-te-absolver.html", "text": "Absolver is a unique game in more ways than one. Technically it is an online fighting game, but the definition does not make well what its true contents are. More specifically it is a strange hybrid between an MMO and a martial arts simulator, in which there is no shortage of echoes of other genres. The player plays an aspiring Absolver, who must defeat a series of bosses scattered throughout the ruins of Adal's empire in order to gain access to the central tower, where he can face the final boss. Between saying and doing, that is, before the final acquittal, there are countless clashes, against opponents led by the CPU and, if desired, humans. Adal's empire is a single, large map divided into two macro zones, each with its own characteristics. Visiting one, you find yourself wandering through a port, then in a collapsed neighborhood that surrounds an immense arena. Going to the other side you travel into wilder terrain, to arrive at a temple nestled in a swamp and an outpost made of old wooden houses. The game world is not very vast and, once you know it, it takes very little to go from one place to another. However it is very nice to see, thanks to a simple graphic style, but refined in detail. Exploration is slowed down by the need to find loot, usually well hidden and, above all, by the fights, which are very frequent. Just get close to an opponent and start a fight. There are also some friendly characters around, but they are very few and their only goal is to give us some information. If you want you can collaborate with other human beings, but you need to find someone who is willing to play as a team. If you want to fight with other players without being disturbed, it is still easier to go to one of the altars scattered around the maps and select one of the available modes. The combat system The heart of Absolver is its combat system, extremely technical and customizable. At the start of the game you are asked to select one of the available styles, then you are entrusted to the tutorial which explains the rudiments. There are few moves to learn, the basics seem clear, but direct experience will teach us that there is much more. Absolver is a damn difficult game, as well as rewarding. When you fight you have to take many factors into account and you can't limit yourself to attacking your opponents head on. We must also learn to parry, perhaps at the right time to reveal the opponent; to dodge, taking care not to consume the entire stamina bar; to absorb the blows, so as to learn the techniques that are suffered (it is possible to do it even just by observing, but it takes more time); to decide the fighting position, which varies the moves used; and to pace the attacks, so as to be more effective in using the combos. With the acquisition of new techniques, better equipment (which is not necessarily the one with the highest values, since too much weight worn negatively affects various factors, such as agility and damage) and experience points, it is possible grow the character, both in characteristics (strength, agility, stamina and others), and in versatility. Based on the initially chosen fighting style, you can create customized combos, taking advantage of the acquired moves. The richness of detail from this point of view is truly incredible and when you fully understand the system you spend a lot of time in the so-called Combat Deck modifying the moves assigned to the four fighting poses to suit your style and to create more long, effective and lethal. You only truly become a master when you have completely mastered the system. At that point the fights between peers become real choreographically spectacular ballets, which fascinate as if you were in front of a martial arts film. Of course, as you may have understood, it is not an accessible system and it really does nothing to be so, to the point that even clashes against generic enemies can be fatal if tackled lightly. As already mentioned, Absolver offers several online modes. It can be played in PvE cooperative mode, i.e. against opponents moved by the CPU, or you can take part in one-on-one or between multiple players. Solitary players don't worry because you can also play offline, perhaps to refine yourself before going online. Unfortunately, the cooperative mode suffers a bit from lag problems and the chaotic nature of the clashes between too many characters, which we will discuss in the next paragraph. Lag and chaos All beautiful, then? Not really, because Absolver has some probslems that do not allow him to achieve excellence. One is purely technical in nature: lag. It didn't show up very often, but more frequently than it should and in some cases it completely ruined fights (as long as you're running around the map you don't even notice it). For the record, we report that by carrying out a brief online investigation we discovered that for some players the problem was much more pronounced than ours (for some Absolver was even unplayable online), while others have never registered it (or have not case). However, there are problems, given that the developers have also confirmed them by opening a dedicated thread on Steam. Hopefully they fix it with a patch. Another problem, more structural, concerns the fights against multiple opponents, which in some cases become really chaotic. Not bad when we have them all in front of us and it's us who make some mistakes, but when, for example, we find ourselves attacked from behind by an enemy who was hidden, or who has suddenly reappeared after being beaten by someone else, we are seized by the irrepressible impulse to throw the controller on the ground. For the rest, except for a few other minor flaws, such as a certain imbalance between armed and unarmed combatants in one-on-one (compensable with training and a little luck) and some secondary bugs (a few too many interpenetrations, the character who ends up in areas that should be inaccessible and so on), we can only recommend Absolver, certainly for now one of the most original and intriguing gaming experiences of this 2017.", "date": "2017-09-04", "grade": "8.0"}