{"name": "War Wings", "ref": "https://multiplayer.it/recensioni/187714-war-wings-war-wings-falcio-a-meta.html", "text": "The Second World War setting has been making a comeback for some time, see also Call of Duty: WWII, and Miniclip has seen fit to take advantage of it in the mobile sector to entrust Mobilefish Studio with the creation of a multiplayer-based aerial shooter for devices iOS and Android. War Wings will therefore see us control a real-life aircraft, selected from a large list to be unlocked gradually, to face intense four-against-four online battles. A short tutorial introduces us to the controls, in truth very similar to those of any arcade flight simulator seen so far: on the left side of the screen there is a virtual stick that allows you to move the plane, while on the right side there are two icons to increase or decrease speed, open fire and reload machine guns. There are two views available, which can be switched by touching the options screen with a touch: the default one, in third person, and the first person view from the cockpit, spectacular but a little too complex and difficult to read, especially at first. However, the introductory phase does not stop at the fights, also illustrating some aspects of the game structure, in particular the wide progression which, based on the credits earned in battle (or those obtained through in-app purchases), allows you to upgrade own fleet and to access new and more powerful models. The wings of Freedom The fundamental elements of a production like War Wings are obviously the accessibility of the experience and an impeccable functioning of the online infrastructure. Luckily Miniclip has taken care of both aspects very well, giving us a well-organized main menu and making matchmaking really quick and effective, thanks also to a consistent user base, certainly formed during the soft launch phase. Once in the game, there are some gimmicks that make things easier in the attack phase (see the aiming system, which zooms and semi-automatically locks targets within range), but the opponents also enjoy the same advantage and therefore escape their bursts will not be easy: you will have to use the controls relating to the speed of the plane intelligently, perform evolutions and loops, to then change trajectory as quickly as possible and return fire. The resistance of each aircraft allows a minimum leeway, in the sense that you have to be exposed to attacks for a few seconds before exploding and wait for the next respawn, but in this sense, unfortunately, the ~pay to win~ factor also comes into play: the users who pay with real money can access advanced aircraft faster and therefore gain a substantial advantage during matches. Fortunately, this is an aspect of the experience that only emerges after a few hours, and that doesn't affect the enjoyment of a title that, in addition to deathmatches, also offers fun missions that increase its duration and variety. On the technical front, then, everything has been done in the best possible way: the flight is fluid, the speed rendering is good, the aircraft are fairly detailed and the scenarios, even with their limitations, offer a good level of detail.", "date": "2017-08-26", "grade": "8.0"}