{"name": "Cities: Skylines arriva finalmente anche su PlayStation 4", "ref": "https://multiplayer.it/recensioni/187167-cities-skylines-cities-skylines-arriva-finalmente-anche-su-playstation-4.html", "text": "Paradox has focused a lot on its productions in the last period. Over the years, the Nordic company has grown incredibly and although it has specialized in 4x titles, there has been no lack of exclusive and undoubtedly entertaining intellectual properties such as Magicka, for example, but also some strategic ones have been able to impose themselves on the market, resulting even better than the counterparts offered by the giants of the 'entertainment. In fact, it is no coincidence that the good Sim City has been forced to give way to Cities: Skylines, first on PC, then on Xbox One and now also on PlayStation 4. In short, if you own the Sony console and feel orphaned by a nice old-fashioned management today is a day in which we can happily celebrate as this lack will finally be filled. To tell the truth there isn't much else to tell that hasn't already been brought to your attention with the reviews, but since the platform is completely new and many may therefore have missed the previous articles, we provide you with a mega summary of what we you can expect from this new edition. Dear mayors, it's time to dust off the keys to the city! There was a big green lawn We really couldn't wait for a management system of this size to arrive on PlayStation 4 as well. Certainly, the genre will not be one of the most profitable or most appealing, but there is no doubt that giving life to your own town, meticulously planning the expenditure of resources and services and seeing one's concrete and asphalt creature grow and evolve always gives great satisfaction. Especially when things go right. Cities: Skylines PlayStation 4 Edition essentially leaves nothing behind, as regards the mechanics, of what was seen on the PC and arrives on our televisions without any discounts. We will initially be able to choose the size of the map and the number of resources present in it, deciding whether to increase or decrease the number of woods, water and even choose the morphology of the land at a minimum. It will also be possible to cheat right away thanks to the tricks that can be activated with a simple click that will allow you to build in total freedom without having to pay too much attention to your wallet, an option that could make you turn up your nose at the first but which allows anyone to enter the game and have instant fun, without the stress of taxes and financing to apply for. Cities: Skylines represents a notable achievement for city builders, who have left behind some overly complicated elements in favor of a decidedly simpler but no less rewarding type of game. In pure sandbox mode you can choose which type of roads to build without any limitations and then dedicate some specific areas to the buildings that citizens will have to erect. There are basically three categories available and include simple homes, commercial buildings and the industrial area. You will therefore never have to go and select a single type of house, a process that is very suitable for the control system with the pad, which allows you to be precise enough without going crazy in an attempt to select a tiny piece of land among the dozens of buildings already erected. Electricity and water are obviously to be taken into consideration, complete with pipes and high voltage wires to be stretched intelligently so as not to disappoint the population. In fact, it will be the happiness of your little inhabitants that will give you access to the most precious structures and the best services, in a sort of continuous escalation that will quickly transform your village into a teeming metropolis. It's not difficult to get good results on Cities and the interface is always quite clear and immediate, thus allowing you to also focus on the design of your city, something that is often overshadowed in management software of this type. The sunset behind the skyline Cities: Skylines, even on consoles, is particularly beautiful to look at. It's not just the lights and the sunsets that make our skyline spectacular, but the lion's share of the scene is always accompanied by highly accurate animations, which allow us to admire the evolution of the small houses that transform and change from small suburban houses to much more towering skyscrapers. In short, we feel driven to expand more and more, to see what can be created and what level of development can be reached. The dozens of statistics in the menus therefore become tools for in-depth analysis but what happens on the screen is often enough to make us understand immediately how we are proceeding. Yet every now and then you have to enter the menus, if only to select the types of roads to create or the decorations to be placed on the edge of the roadway. Tantalus Media yesis involved in the creation of this version, as it was for the Xbox One, has done an excellent job, using backbones and the directional cross to allow fast use, without ever making the process of selecting objects tedious. Having played Cities: Skylines on PC for a long time at the time of its release, however, gave us some advantages during the creation of our first city and putting us in the shoes of a type of audience that approaches production on PlayStation 4 for the first time not perhaps we would have disdained a slightly more in-depth tutorial, a clearer explanation of the miserable tooltips that appear on the screen. It's easy to build, that's for sure, but it's also true that the first steps are taken more thanks to intuition and instinct than according to a precise logic or plan. This problem arises above all not so much in the planning of habitable areas as in the distribution and coverage of services, whether they relate to waste disposal or water quality. Police, firefighters and hospitals, on the other hand, are more immediate to understand, with areas of expertise that are much clearer and easier to read. Just like its Xbox One counterpart, the PlayStation 4 Edition also comes without some important DLCs, being able to rely solely on After Dark but leaving aside Snowfall and Natural Disaster, as well as mod support which on PC represents a point very important favor. instead signaling the return of fast forward time, a very important feature removed for no specific reason from the Xbox One version.", "date": "2017-08-15", "grade": "8.5"}