{"name": "Agents of Mayhem: una cafonata di classe", "ref": "https://multiplayer.it/recensioni/187145-agents-of-mayhem-agents-of-mayhem-una-cafonata-di-classe.html", "text": "It will be the wave of almost forced do-gooders that we have been going through in recent years, or the simple desire to create products that can be appreciated by any generation without any controversy whatsoever, but ~the brothel~ has largely disappeared from video games. You got it right, the brothel: the mess, the chaos, the pure and mindless devastation. There are many titles on the market where spectacularity and excess are part of the formula, of course, but you hardly see them anymore where everything revolves exclusively around that. And in all honesty it's a shame, because if on the one hand it's nice to see the medium evolve, expand and experiment with a myriad of genres and hybridizations, on the other hand there's no need to completely abandon those games designed simply to make you turn off the brain and combine disasters, also because precisely because of their crude nature they can be developed in a myriad of interesting ways. Volition must have guessed it, or the noisy drift of its products after the third Saints Row, culminating in the production of the video game we are talking about today: Agents of Mayhem, could not be explained. In fact, having abandoned any desire to challenge the common open worlds on their own field, the titles of the house have focused entirely on action and insanity, while maintaining a certain general concreteness of the universe and characters. However, Agents of Mayhem is not only their new project... it represents the litmus test to see if the house - after the disaster of THQ - has really found its way. A not so fresh IP Don't be fooled by the name: Agents of Mayhem is not a new intellectual property, but a game closely related to the Saints Row series, whose universe derives directly from one of the endings of the Gat Out of Hell expansion. Characters and situations partly coincide, as is the crude and foul-mouthed humor with which the brand has conquered many of its fans; therefore expect double entendres, rivers of curses, almost cartoonish ultra-violence and a general lack of brakes during the campaign. Instead, what you shouldn't expect is a narrative focused on gangs and neighborhood crime like that of the first chapters of the saga: with this product, Volition kicked the past of the Saints, focusing everything on humor and characters. The end result is pleasant, because the game doesn't hold back and makes use (not to say abuse) of racial stereotypes, funny jokes and memorable characters; yet we are a cut below the mixture of metafiction and gaming parody of the fourth Saints Row, which even managed to hide part of its flaws by dint of absurdities and brilliant gimmicks. Agents, put simply, tries to be a caricatured version of a 90s action movie, with comic book leads and Saints references thrown into the mix: entertaining from start to finish, but not as memorable as its predecessor. The plot, however, is less solid also due to the absence of a single customizable hero, replaced by a myriad of playable characters that represent the core of the experience. This title is in fact completely built around the Mayhem, an organization committed to saving the world from the evil forces of LEGION, and populated by nothing short of ~eccentric~ fighters that you can unlock and use as you like from mission to mission. Army of crazies Clearly the choice to put the player in the shoes of an entire organization has revolutionized the structure of Saints Row, even if in Volition they have been careful not to abandon it completely. Agents of Mayhem in fact takes place in an open and fully explorable map - the Korean city of Seoul - which, just like the virtual world of the fourth chapter, is rather concentrated and focuses on a large number of missions rather than on the extension . At the same time, however, the Asian metropolis represents little more than a container for the Mayhem's tasks, so in the end the game is a shooter placed inside a large hub rather than a real open world (the total absence of minigames does not only underlines this choice of the development team). Now of the end, therefore, the variety lies all in the shootouts and the aforementioned protagonists, who fortunately do their dirty work. In fact, you will leave with a not particularly charismatic group of heroes, made up of a vain actor/stuntman, a rude beast with a beard armed with a rifle and an agile exotic fighter with a passion for drones, yet it won't be long before missions designed to replenish the ranks of your organization with far more memorable warriors. We go to an Indian virologistfrom incredibly skilled with a bow to a Russian mutant with a freeze cannon, passing through a brilliant Italian model and a crude gatling-wielding alcoholic; In short, Volition did their best to create a colorful and valid cast, aware that it would represent the heart of their video game. The skills available to each character, then, are at least as varied as those who use them, and represent the skeleton around which all the gameplay was built. Tricks of the trade Basically, each hero has unique powers, as well as having variable mobility and a specific weapon. All normal, except that the title allows you to select three of these fighters before each mission, and to replace one another at any time during the battle (with a short recharge time to be respected once the replacement has taken place) . To be clear, it is the same trick used by the Orochi Warriors, but taken to the nth degree due to the aforementioned skills and the ~specializations~ of each hero. There are tanks, warriors capable of inflicting negative status on enemies, and offensive monsters whose only talent is devastation (try Daisy, you won't regret it), in a package that has twelve main choices plus two linked to pre-orders. The gameplay change is such that you could repeat the same battle a handful of times and calmly slaughter everyone in a completely different way with each reboot, and Volition have even made it even worse by making Gremlin technologies available to the Mayhems: buildable tools in the headquarters and equippable that allow you to make even more noise during firefights with a mixture of orbital lasers, improbable explosives and defensive barriers. To this uncoordinated equation we must then add a whole series of other factors, because the development team has certainly not wasted as regards the customization of the experience. Each protagonist, in fact, has an active ability and a powerful Mayhem Ability that is charged by killing, but these can be modified with gadgets found in the missions. The effects are many, and can transform blinding throwing knives into a magnetic force field to attract enemies, or allow a grenade to activate temporary shields of power directly proportional to the number of opponents hit. If we also count the LEGION technologies - projects that can be combined with the gadgets just described, which however offer further passive bonuses - the power-up crystals scattered around the map, and the statistics that can be modified by leveling up, you can be sure of finding your perfect balance before of the end of the game. The PlayStation 4 version If on our PC configuration the title travels without any problems, the same cannot be said of the PlayStation 4 version (base, on Pro the situation is very different), plagued by a dancer frame rate. It's hard to hold the 30 frames steady when the screen fills with explosions, and believe us when we tell you that this is not an uncommon occurrence in this game. However, the system is structured cleverly enough to still allow you to enjoy the shootings without too many problems, but it is clear that the experience is partly reduced by this situation, therefore we consider the version for the Sony platform inferior to the one we tested. Lots of stuff This mass is also found in the classic content, despite the not exaggerated size of the Seoul map. We repeat, it is mostly a hub, inserted to give developers the possibility of inserting cars, driving missions and races between the roofs, and players the chance to slaughter poor innocents at random; inside, however, you will find a myriad of primary and secondary missions - the primaries number around fifty - dedicated respectively to the Mayhem and the improbable gallery of bad guys LEGION. It is certainly not a revolutionary structure, and it must be said that after a few hours the locations tend to repeat themselves (the hideouts, in particular, will quickly bore you); yet the game manages to remain fresh and satisfying for a long time, either for the validity of the usable heroes, or for the interesting system dedicated to the difficulty, which allows you to activate increasingly pissed enemies and at maximum levels leads to having to fight against troops of elites equipped with shields and armor (some heroes have permanent damage bonuses designed specifically to counter these types of defenses). Less well global defense, a series of maps where you can send inactive heroes to get contracts - internal achievements that can also be downloaded online - due to missionis in lairs too repetitive, but it's still hard to fault the option's presence. Even the Mayhem headquarters, the Ark, contains additional virtual missions and a gallery with hidden information of the protagonists to be unlocked by dint of achieved objectives. In a nutshell: Agents of Mayhem is a game designed for completionists, who will take forever to unlock all the unlockables, push their agents to the limit and get every possible gem placed on the map of Seoul. Outside of the repetitiveness of certain maps, however, the only real weakness of the game lies in the unfortunately disappointing technical sector. In fact, everything runs smoothly on a computer thanks to the scalability of the engine, but graphically we are certainly not in front of a splendid product (although the cartoon style helps cushion the blow and makes everything look rather clean) and there are bugs. It happened to us - albeit rarely - to have to restart checkpoints due to blocked objectives or enemies mysteriously disappeared, or to observe inexplicable graphic phenomena on the streets of the Korean city. They are trifles that do not break the game, but are annoying nonetheless and belong to an unequivocally quite crude product in many respects. The shooting itself is far from finished: the aiming aids are monstrously marked and everything is concentrated on movement (certain enemy attacks are even indicated by colored areas, like MMORPGs) and on the devastation caused by skills, despite the fact that they are not lacking heroes who specialize in precision strikes. Furthermore, the absence of a cooperative mode is inexplicable: we realize that it would have ~broken~ the game without appeal, but it would have been nothing short of hilarious, increasing the chaos of the action dramatically. Who knows if it will ever come in the future.", "date": "2017-08-15", "grade": "8.0"}