{"name": "Rogue Wizards", "ref": "https://multiplayer.it/recensioni/187055-rogue-wizards-rogue-wizards-la-magia-e-gratuita.html", "text": "When we talk about RPGs in the mobile sector, several high-value productions come to mind, but also an approach to the freemium model strongly oriented towards monetization. In fact, it usually happens that games belonging to this vein turn out to be very spectacular and enjoyable during the first few hours, only to then suddenly change their degree of difficulty to push the user to make purchases that can give him enough strength to go on, keeping up with to increasingly shrewd and resistant adversaries. Well, Rogue Wizards represents the proverbial exception that proves the rule: if the PC version of the title developed by Spellbind Studios is sold on Steam at the price of 14.99 euros, the download is free on the App Store and there are no particularly limiting mechanisms. This means, as you may have understood, that it is possible to explore the dungeons randomly generated by the system more or less indefinitely, acquiring ever more valuable loot, more powerful weapons and new equipment during our expeditions. The character that is created at the beginning of the game (but there are a total of three slots available) will find himself completing a short tutorial and then will be projected into a large hub where he can upgrade, buy or sell items, enhance his spells and so on. Street. Once ready, he can open the map and choose a destination for his next adventure. Dragons and dungeons The first thing that strikes you about Rogue Wizards is undoubtedly the excellent graphics, which boast not only a pleasant and successful design for the characters, represented in a cartoonish style, but also guessed and surprising solutions for the representation of the scenarios, which ~ appear~ from below as we move from one ~box~ to another. The exploratory phase is clearly free from constraints and we are allowed to open chests (having the right amount of keys, however), break trunks, collect objects and open doors that lead to corridors or other rooms. However, when an enemy appears, you switch to a turn-based system that significantly influences the outcome of the clashes: cutting or bludgeoning weapons allow you to hit the opponent only from an adjacent square, therefore it may be necessary to skip a turn because the enemy positions himself nearby during his move and it is thus possible to hit him first. +3 Otherwise, you can use ranged weapons or spells, such as the fireball of the first levels: endowed with devastating power, it makes a clean sweep of the monsters that we may encounter along the way, but the shots available are few and you must therefore collect new ones or buy them in the shop so as not to run out. Each dungeon has multiple levels of depth, which also imply a progressively greater degree of challenge, but don't expect the monsters to be particularly brilliant in their attack and movement patterns. After completing the exploration we will be able to use a portal to return to the starting hub, restock, upgrade the upgradeable, manage the equipment and embark on a new adventure. Structurally, Rogue Wizards therefore presents itself as a rather simple product, but there is great depth in the gameplay, the campaign is really long and, as mentioned, the freemium model does not set limiting conditions: you can play for free without any particular problems, provided being able to stand up to hordes of fairly cunning enemies.", "date": "2017-08-11", "grade": "8.5"}