{"name": "Lawbreakers  il nuovo contendente nell'arena degli sparatutto", "ref": "https://multiplayer.it/recensioni/186956-lawbreakers-lawbreakers-e-il-nuovo-contendente-nellarena-degli-sparatutto.html", "text": "Fusion of genres. It is only thanks to this ploy that arena shooters, in great fashion in the 90s, have been able to reinvent themselves and become attractive again for an audience that was veering towards other shores and genres. Competitive shooters have therefore undergone a critical evolution in recent years inspired by MOBAs, with an emphasis on charismatic characters and strong characterization of the same. We are certainly not talking about a mere aesthetic work as much as a real massive diversification obtained through particular weapons, skills and final moves with devastating power. If we analyze the latest competitive titles it is easy to see how the target audience goes hand in hand with the power of the final skills. In short, an ultimate capable of obliterating an entire team makes the game much more spectacular to watch and we all know that easy kills attract the casual audience, a rule that Overwatch has exploited in an excellent way but which had already been traced in the past by devastating rewards for the Call of Duty killstreaks and, more generally, from a gameplay that basically guaranteed some kills. Lawbreakers, the new work of the good Cliff Bleszinsky, instead takes a step back trying to get away from the chaos generated by randomness, proposing a more meritocratic game system, with less powerful skills and ultimately more directed towards the speed of movement and the ability in the aim. The result? A title aimed at a distinctly hardcore audience but not for this reason to be underestimated. No story, the important thing is to kill yourself Overwatch has made the background of its characters one of its greatest strengths. The stories told by the Blizzard designers have undoubtedly hit the mark and this has allowed the title to enter the hearts of many fans and supporters, people who are not necessarily passionate about gaming but who have become attached to their virtual alter egos for the most disparate reasons. Lawbreakers is not, and will never be, able to reach that level, due to a much more anonymous character design but also due to the absence of a solid background story capable of capturing the attention of non-gamers. Lawbreakers is pure essence, it's a game that has decided to shake off all the sequins by showing only its old school shooter structure. And this is fine if you want to carve out a small slice of the market, a little less so if the goal is to become one of the reference points for the genre. Cliff Bleszinsky has always considered himself one of the smartest designers in this area with Gears and Unreal ready to fully endorse this idea but the weight of the two productions remains really light years away from the first effort of Boss Key Productions. From a ~naked~ title like Lawbreakers one would expect a unique gameplay, able to hit and keep glued to the screen and instead, after a bit of practice, one finds oneself wandering easily through good-sized maps, but without playing nothing really new. Let's be clearer: in Lawbreakers there is certainly no shortage of novelties, but they do not have a strong enough impact on the gameplay to quickly distance it from what is already on the market. Uniqueness The world of Lawbreakers has been devastated by a sudden catastrophe, which has brought about an alteration of gravity in some specific areas. The game maps take advantage of this idea to offer even more dynamic clashes, where enemies can essentially target you at three hundred and sixty degrees. Many of the nine classes present can take advantage of some shots to continue to remain suspended in the air but there is also another novelty, underestimated by most, which allows you to shoot blindly backwards to give yourself a further push. Of course, rockets can do amazing rocket jumps, but even simple machine guns increase your speed in zero gravity. Unfortunately this mechanic is much less effective in normal areas, where shooting backwards without looking almost never brings the desired results, completely lacking in effectiveness. Leaving these special areas, however, Lawbreakers behaves like any other arena shooter, placing itself halfway between the speed of Quake Champions and the more staid movements of Overwatch. It is a title, as we said at the beginning, which in any case makes the player's skill its main weapon and, if aiming is very important, the true level of difficulty is perceived when it is necessary to combine jumps and sprints with headshots, the only way to excel and dominate any type of match. Boss Key Productions then thought well of removing the trinity of components from the matchesstands for tanks, healers, and assassins, proposing hybrid classes with specific strengths and weaknesses but not closely related to each other and all devoted mainly to aggression. In fact, the frenzy of the game does not allow the only healer currently available to be so fundamental, despite the absence of automatic life regeneration, so much so that it is more important to know by heart the location of the medikits scattered throughout the corridors and stations of health hidden in the play areas. Depending on the modalities, these stations can be abused to completely restore one's energy after each fight, which makes the defenders' task much easier, especially when this advantage is accompanied by barriers and shields that can be erected using the basic skills of many of the characters featured on the roster. Staying on the subject of weapons and skills, we discover a raw nerve for the production that relies on concepts already seen in other titles without trying to propose something really new. Lawbreakers shuffles the cards on the table as regards the weapons equipped by the various fighters but the way they shoot, their functioning and even the recoil and rate of fire do not bring significant news, while maintaining a very high quality gunplay. At least try! It's not easy to create a competitive shooter and invent new game modes from scratch and Lawbreakers does just the bare minimum to revamp the classic capture the flag and zones of control. The results are modes not very dissimilar from the standards of the genre but which offer some interesting gimmicks, while still leaving Team Deathmatch to do the bulk of the work. The matchmaking isn't perfect at the moment (nor too fast) but things will gradually improve as players arrive on the servers. The biggest problem at the moment is the really small community and far from the numbers probably expected from Boss Key. The entry price of thirty euros is probably an incentive to stay away from the title, with Overwatch dominating the scene with its over twenty-five million players and Paladins which has raided the rest of the community thanks to the free to play model. Lawbreakers will therefore struggle to stand out and the release period is certainly not the best with many, many, valuable shooters arriving in the coming months. From Destiny 2 through Star Wars Battlefront II and Wolfenstein but also Quake Champions and Call of Duty WW II, just to name the strongest, they will surely distract fans risking leaving the Lawbreakers servers semi-deserted, even though they do not represent direct competition for the type of gameplay offered. However, the fluidity of the title remains excellent even on low-end PCs, as well as the stability of the servers, with the possibility of freely jumping from one region to another, choosing from time to time the one with the best ping. It will therefore be the support for the title in the coming months by Cliffy B and his team that will make the difference, but also from this point of view the desire not to give a competitive look through official tournaments or not to involve the proplayers directly seems more missteps than forward-looking ideas. Let's just hope Boss Key isn't presumptuous.", "date": "2017-08-09", "grade": "7.8"}