{"name": "CastleStorm VR arriva su PlayStation 4", "ref": "https://multiplayer.it/recensioni/186865-castlestorm-vr-castlestorm-vr-arriva-su-playstation-4.html", "text": "If the name Castlestorm tells you anything it's because from 2013 to today this game has been released on practically every platform on the market. After starting on Xbox 360, it also landed on PC, PlayStation 3, PlayStation Vita and Wii U in the same year, to then complete the tour on mobile in the form of CastleStorm: Free to Siege. With the current generation of consoles then came the inevitable remaster, enriched with new content compared to the basic version and called CastleStorm: Definitive Edition. This latest version has now been used by the development team - that Zen Studios most famous for Pinball FX pinball machines - as the basis for bringing CastleStorm to the only place it was missing at this point: virtual reality. After appearing a year ago on Oculus Rift and Gear VR, CastleStorm VR now faces the general public with its version for PlayStation VR. Put on the helmet with us, and let's find out what awaits us. Three in one CastleStorm's setting is fantasy-like, seasoned with a good dose of irony that pervades all aspects of the game. In the campaign mode we immediately get to know the old King Edgar, ruler of the Southern Kingdom once at war with the Vikings, instead located in the north. After witnessing so many battles, the Goddess of Peace wept and her tears turned into two magical gems, now guarded by both territories. The gems have given a long life to their respective rulers, but above all the ability to defend themselves effectively against any enemies, thus establishing a peace that has lasted for a long time. An attack by some wolves from the north rings an alarm bell in the Southern Kingdom, which thus turns to its fearless protector Sir Gareth to face what appears to be a new war on the way. Without revealing anything else about the plot, let's move on to CastleStorm's game structure, characterized by a mix that was quite original at the time of its release and which is still pleasant to discover today. Especially if you've never had anything to do with anything like this. Apart from some detours made during the campaign, the main objective in CastleStorm is to destroy the opponent's castle, making use of three components to do so. The main one is the ballista placed at the entrance of our manor, through which we can shoot arrows in the direction of the enemies who on the opposite side try to carry out the assault. This is not its only use, given that with the help of other types of projectiles, some of which are even bizarre (such as the explosive apple or the sheep with digestion problems), we can cause damage to the opponent's castle to thus be able to win the battle we are in. From this point of view, CastleStorm therefore clearly resembles Angry Birds and derivatives. Instead, CastleStorm draws from the tower defense genre the possibility of bringing some units trained in the castle onto the battlefield, to ensure that they defend it by going at the same time to attack the opponent's one. Archers, swordsmen and company can be sent into battle by spending the resources available in the castle: once in the field, they deal with the enemies present automatically. The third and final component offers some spells to help us in defense, including the possibility of summoning powerful heroes behind enemy lines: the first we know is Sir Gareth, useful with his sword to resolve the most complicated situations. However, one must be careful with the use made of the heroes, because they are available for a limited period and their activation prevents the control of the ballista. We'll talk about how all this can be handled in VR shortly: first let's look at the different modes that CastleStorm VR can enjoy. The aforementioned campaign invites players to repeat levels for better achievements and rewards, but the game has several solutions to offer in both single and multiplayer. The CPU can in fact keep us busy through the skirmish mode, or through the inevitable survival mode, where you can face waves of enemies both in command of your own castle and in the role of a single hero. Via the Internet, however, it is possible to try your hand at the classic one-on-one, with the possibility of also taking part in two different cooperative modes. The main problem we have encountered in this area is that the number of players present online currently does not seem very high, but it must be considered that CastleStorm VR has just come out in a period which is traditionally a holiday one. In any case, even if we removed the multiplayer component altogether, they would remain coenough to keep us busy for a long time. Playstation 4 trophies CastleStorm VR features a total of fifteen Trophies, with one being Gold, one Silver and thirteen Bronze. To get them all you have to get busy in the campaign mode, since the most important is linked to obtaining all the rating stars between the various levels that make it up. By completing the story you also automatically get the secondary Trophy, while the other Trophies concern killings and various businesses. To me the eyes With the transition from one type of platform to another, even before arriving on virtual reality CastleStorm had to deal with the need to redesign the game interface every time. Not exactly a simple undertaking, considering the amount of options through which we can control ballista, troops and hero. The transition to virtual reality does not upset what has already been seen on consoles: the work done by Zen Studios for CastleStorm VR is appreciable above all for the possibility of keeping all the elements under control in a simpler way than in the past. As before, the controller is obviously used to perform the actions available to us, with the novelty of being able to use the movement of the head to look at the part of the screen that interests us. Everything appears immediately in view, therefore, without the need to scroll the view to the right or left to get to the area of the battlefield that we want to see. If the use of the helmet works in the game, a little more could have been done for the castle editor, also present in CastleStorm VR: the presence of a large number of details combined with menus with too small buttons pushes the player to opt for the default castles. For the animated sequences of the campaign mode, the use of a virtual cinema was adopted as an expedient, where with a lot of drink and popcorn at your side it is possible to watch the dialogues (in English with Italian subtitles) between the protagonists of CastleStorm.", "date": "2017-08-07", "grade": "7.8"}