{"name": "Retroshifter", "ref": "https://multiplayer.it/recensioni/186856-retroshifter-retroshifter-una-corsa-negli-anni-80.html", "text": "The genre of endless runners has now said it all, whether it's the third person variants or the horizontal scrolling ones. However, ways remain open on the front of experimentation: not only for graphics and sound, but for the gameplay itself, which can be enriched with innovative solutions and guessed variations. Well, that's exactly what Retroshifter is trying to do, the new title from Murdercloud Studios, currently available on iOS terminals and coming soon to Android ones. It is a horizontal scrolling endless, therefore along the lines of Monster Dash, characterized however by retro graphics, in pixel art style, which recalls the atmospheres of the 80s in concert with an electronic soundtrack. The protagonist of the game is precisely a Retroshifter, a person with special abilities fleeing the pitfalls of a dystopian future. During his run, the character will have to avoid a series of obstacles of four different shades, so in addition to making him jump forward and up, or slide, we will also have the task of quickly changing the color of his ~glove~ because the The impact with the barriers does not damage him, causing one of the hearts that represent his life energy to disappear. Between flashes of blue The mechanisms that characterize the gameplay of Retroshifter are basically simple: the character automatically runs to the right, with consequent scrolling of the scenario, and you need to act on the touch screen to successfully pass a series of increasingly dense energy barriers. The starting shade is electric blue, which means that during the early stages of the game you don't have to worry about changing the color of the device that the protagonist is carrying. There are high, medium and low barriers: to overcome them you have to jump up (swipe up with your finger), a long jump (slide forward with your finger) or slide ( swipe down). The variable that comes into play after a few laps is that of the colours, four, which can be selected at the bottom left. Overcoming a blue barrier while keeping the green color active is like hitting a wall in the face and will therefore result in the loss of a heart, therefore the more you go on and the more it is necessary to have a certain coordination. The experience helps us from this point of view, practically resetting the progression and decreasing the speed every time we have passed a certain checkpoint (only nominal: at each game over we will start all over again), which means that things they don't immediately become unmanageable like in the various Temple Runs. The problem is that, however, the touch controls often turn out to be less precise and reactive than what would be needed during the advanced stages, giving rise to bitter defeats because they derive from a defect in the game and not from our fault: let's hope that the developers fix the matter with an update. A second limitation of Retroshifter obviously lies in the systematic repetitiveness of the action, but unfortunately there comes the fact that the genre is really inflated and it is difficult to refresh it, even if it puts in place some good ideas. Of course, the rich achievement system and the permanent upgrades that can be purchased with the coins earned during each stint, even possibly by watching advertising trailers, help a lot. Finally, the technical sector is excellent: the pixel art graphics are very pleasant, and in the same way the music accompanies the action in a convincing way.", "date": "2017-08-05", "grade": "7.0"}