{"name": "Sonic Origins Plus", "ref": "https://multiplayer.it/recensioni/sonic-origins-plus-recensione.html", "text": "At least one ~new~ title dedicated to Sonic on an annual basis: will we perhaps be the ones to complain about this new SEGA habit? Certainly the writer will not complain, given that his first ever video game was precisely Sonic The Hedgehog for Sega Megadrive. All right, then the case of Sonic Origins Plus makes history in itself. You may recall that exactly one year ago, in June 2022, the review of Sonic Origins, signed by the good Tommaso Pugliese, was published on Multiplayer.it. Why then are we still here? The answer is simple: the developers, but above all the publisher, thought it well that if you made thirty you could make it thirty-one. Here then is yet another course ready to enrich the already abundant meal of the original remaster, and Sonic Origins Plus is ready for its debut. Same cost as last time, a good forty euros; but more content to justify it, this must be said. Between titles taken from the past and inserted to make up the number through more prudent choices, capable of modifying the playful approach to the general package (a new character, some noteworthy interventions), the important thing is however to be able to return to darting at one thousand kilometers per hour over meadows, robot factories and underwater temples in the company of the well-known SEGA mascot. In this short but dense review of Sonic Origins Plus we explain what has changed since last year, so that you can decide whether or not to repeat the purchase. The contents: ~plus of this~ could not be done Sonic Origins Plus now allows you to play as Amy Rose This is not the place to talk to you all over again about what Sonic Origins is or isn't in its matrix: Tommaso has already thought about it, and at the most we will also report our opinion in the following paragraph. If you are here, however, it is because you will be curious to know what has changed in the transition from Sonic Origins (2022) to Sonic Origins Plus (2023, out these days). The fundamental innovations - which are not the only ones, but certainly constitute the most noteworthy ones - are two: the introduction of Amy Rose as a playable character and the addition of a good number of secondary games (the latter, however, not remastered like the entire collection). You probably already have a vague knowledge of Amy Rose, the female and pink alter ego of the protagonist. First introduced in Sonic CD, where she was kidnapped by Doctor Robotnik/Eggman, she never received much attention within the main series; however certainly not the same reserved for real supporting actors such as Tales and Knuckles. Here, the great novelty of Sonic Origins Plus - the tone may seem ironic, but we assure you that it is not - consists in being able to play all the main and remastered titles with Amy. On the start screen of each chapter, as you know, it is possible to select the playable character (or ~the playable characters~, if you prefer to opt for interchangeable pairs). Now among the choices there is also Amy, who runs like Sonic, but replaces her lethal spin with the use of a yellow hammer. Proof of the fact that the era in which the rosy girl needed to be saved from the blue hedgehog has now ended. The other novelty, for its part, is much more substantial. In fact it is not even one, because it consists of the introduction of twelve other playable titles, taken in weight from the Game Gear. Unlike the main offering, these historical games (some of them more minor than others) are available within the museum via emulation. For the sake of completeness, know that you will find waiting for you: Dr. Robotnik's Mean Bean Machine, Sonic Blast, Sonic Chaos, Sonic Drift, Sonic Drift 2, Sonic Labyrinth, Sonic Spinball, Sonic The Hedgehog (8-bit version), Sonic The Hedgehog 2 (8-bit version), Sonic Triple Trouble, Tails Adventure and Tails' Skypatrol. Now, a few more precautions could have been taken from the point of view of the emulation, between minimal slowdowns and some strange ~echo~ effect in the sounds, but overall it is a welcome addition, which brings the remaster package towards the peak of absolute completeness. Sonic Origins Plus perhaps proves that ~plus of this~ could not be done. A full-bodied and well-groomed remaster If you want to try something different, Sonic Origins Plus also offers 12 Game Gear titles All those who have already thoroughly explored last summer's Sonic Origins may be perplexed at the sight of Sonic Origins Plus: all in all, to be interested, it must entice the idea of playing as Amy or in any case they must like at least a handful of titles from the Game Gear era. However, we must remember that these additions are grafted onan already particularly solid basis: that of a full-bodied and well-finished remaster, which since the last year has nevertheless remained the best opportunity to enjoy Sonic's adventures (main and secondary) in high definition on all current generation consoles. that Sonic Origins Plus mainly offers the revised, corrected and updated version of Sonic the Hedgehog, Sonic the Hedgehog 2, Sonic 3 & Knuckles and Sonic CD, now all usable in HD and widescreen, with meticulous and obsessive updating of both pixel art and game controls, also perfect for analog stick users and not just d-pad loyalists. To realize the changes compared to the nineties, it would be better to start the first Sonic the Hedgehog in sequence and then the same version contained in the remaster, a real feast for the eyes. But in general the package is also excellent for those who intend to jump from one version to another, from modern challenge levels to those of the past, embodied respectively by the Anniversary mode (infinite lives, greater flexibility in many situations) and Classic mode (limited lives , game over, no compromises). Using Knuckles to complete levels in Sonic Origins Plus allows you to experiment with different moves from Sonic The presence of the museum contributes to enriching the whole, with the possibility of unlocking a whole series of goodies for historical fans through the coins accumulated - from the booklets of the various editions to the images of the packaging, passing through the soundtracks -, and above all of the mode challenge, which in itself constitutes a separate game (in fact it was also sold separately last summer). It is basically about facing a series of specific challenges calibrated to precise sections of equally precise levels. There are challenges for the first Sonic the Hedgehog, as for the following chapters; they generally require you to eliminate a certain number of little monsters or to perform particularly complex actions with increasing difficulty. The score is assigned on the basis of the time taken and the rings collected. A very latest novelty, and then we have really concluded, consists in the possibility of using Knuckles as a playable character also in Sonic CD (in the last edition it was not possible). Of course, we still remain skeptical about the need to launch the Plus version after such a short time, even in the face of all the additions mentioned - with the aggravating circumstance that after all we are dealing with the same package as last year. All right, there are 12 other Game Gear games, but they've been pushed in without benefiting from the update of all the others.", "date": "2023-06-21", "grade": "8.0"}