{"name": "I proiettili a salve di Ghost in the Shell: Stand Alone Complex - First Assault Online", "ref": "https://multiplayer.it/recensioni/186633-ghost-in-the-shell-stand-alone-complex-first-assault-online-i-proiettili-a-salve-di-ghost-in-the-shell-stand-alone-complex-first-assault-online.html", "text": "If you have the license of an evocative series like that of Ghost in the Shell: Stand Alone Complex, a 2002 anime set in an alternative universe to that of Masamune Shirow's original manga, while sharing the same cast, you can really do many things with it . The obvious choice these days has been to turn it into a generic free-to-play online shooter with no art or part, plus full of micro transactions, easily confusing with other exponents of the genre, like Combat Arms, as if wearing a thermo-optical suit. But let's go in order. Section 9 We are in 2030, humanity is under the constant threat of criminals who exploit new technologies to carry out their crimes. This is why Section 9 was born, a team made up of elite agents who mainly deal with crimes related to cyberterrorism. In Ghost in the Shell: Stand Alone Complex - First Assault Online this translates into two teams shooting at each other to achieve various different objectives depending on the selected game mode: in that deathmatch you have to reach a certain quota of opponents killed before of the enemy team; in that demolition it is necessary to place bombs in some critical points, or to prevent it from being done; in assault you have to conquer control points and so on. Hi, I'm Ghost in the Shell, can you see? The core of the game, however, is in character customization, which is also the aspect that aims to get players to spend some real money. In the title of Neople the characters, all belonging to the cast of the anime, must first be unlocked, then they can be upgraded with cybernetic grafts. Each of them has weapons that, apart from the basic one, must be unlocked or purchased. Each weapon can be improved with the addition of various accessories, also to be unlocked or purchased, and can be modified in appearance by applying new skins. The characters themselves have different uniforms which, apart from the basic one, must be purchased. Yes, everything in Ghost in the Shell: Stand Alone Complex - First Assault Online has a price, be it in GP, the coin you acquire by playing, or in real money. To say that the weight of microtransactions is indifferent would be deceiving you: it is true that you can play even without spending money, but a paying player acquires advantages in terms of equipment which, especially at high levels, make themselves felt. The discord update The last big update of Ghost in the Shell: Stand Alone Complex - First Assault Online, the one that brought the game towards the final version, has unleashed the ire of many longtime players. The reason is that the weapons, previously freely assignable, have been tied to the different agents. This means that those who have perhaps spent time, effort and often money on a certain type of equipment have found themselves unable to use it as they wanted. Imagine having a favorite character and no longer being able to give him the weapon you've made him grow with over the months. Unfortunately, the update has not been discussed or anticipated, except from a post published four days before the release, and Nexon has been careful not to reimburse players to give them the opportunity to spend the acquired resources in another way. A beautiful disaster, there is little to discuss, which has mainly affected longtime players, those who have kept the title alive. Generic Shooter 2.0 Theoretically Ghost in the Shell: Stand Alone Complex - First Assault Online is designed for team play: each character has his own weapons and skills that make him unique. For example Motoko Kusanagi, the protagonist of the series, has her iconic thermo-optical suit, which allows her to become almost invisible for a few moments, and mainly handles light weapons, while Batou, her friend and colleague, wields heavier weapons and can fire missiles. Don't worry, even speaking of skills you won't find anything different from the competition: there is the character who places turrets, there is the one who has a shield, there are search drones, and so on. The only peculiarity of Neople's title are the SkillSyncs, i.e. advanced skills that can be used on or together with the other team members. This, theoretically, should favor collaboration between the players, which however is held back by some determining factors. The first and fundamental is the design of the maps: they are very small and it takes a few seconds to reach the battle areas starting from the spawn points. Modes such as the assault one, in which team play should theoretically be central, are penalized in particular, which instead become the scene of shootersunbridled ories in which it is difficult to apply the slightest tactics. After all, First Assault Online is not designed to give prestige to the player's skill. The model followed is evidently that of Call of Duty: the characters are slow targets that go down in a few hits; usually whoever fires first and has the most powerful weapon wins. In short, even from this point of view we are faced with a generic shooter that cannot be more generic, truly suitable for all palates. You play with it, maybe even have fun, but you're never really satisfied. Two memory holes In addition to being bland overall, First Assault Online has two major flaws: the matchmaking and the respawn system. Theoretically matchmaking should pair players of similar level, but in the dozens of games we've played to write this review, it's almost never succeeded and we've often found ourselves on servers full of battleships of a much higher level than ours. My name is Motoko Kusanagi and I become invisible The problem, of course, is that new players become cannon fodder this way, because in a title so focused on boosting through purchases, high-level players have advantages that low-level players can hardly compensate for with skill. also because if the former have reached certain levels it is assumed that they know the game well. Another problem is the management of respawn points in modes such as team deathmatch: Neople's title brought to mind the first exponents of online shooters, whose map design didn't include safe areas or didn't put us under cover for get back into the game. Yes, we are often made to reappear in areas where there are enemies, without a minimum time of immortality to allow us to get back into action. The result you can imagine for yourself. When you get killed like this two or three times in a row, it's really frustrating. From a technical point of view, the game is without infamy and without praise, a bit like everything else: the models are good, but the maps are anonymous. Even the effects don't stand out for quality, despite some good moments (for example when heads are popped). For the rest we are faced with a production in line with that of other free-to-play games, which is perhaps the biggest flaw for a game that bears the name of Ghost in the Shell.", "date": "2017-07-31", "grade": "5.0"}