{"name": "Dopo Locoroco anche Patapon arriva su PlayStation 4", "ref": "https://multiplayer.it/recensioni/186642-patapon-remastered-dopo-locoroco-anche-patapon-arriva-su-playstation-4.html", "text": "It is curious to see two games capable of filling our days on the PlayStation Portable return almost simultaneously, after more than ten years. Locoroco and Patapon in fact have different points of contact, starting from an essential graphic style in two dimensions, passing through a simple but captivating gameplay to finally arrive at catchy and really delicious tunes to embroider the soundtrack. The similarities are not a simple case given that most of the Locoroco developers also worked on Patapon but the titles still manage to have two well-divided souls, original in their own way and exponents of different genres. If one is a puzzle/platformer where intelligence is a fundamental requirement, the good old Patapon is instead the most original rhythm game of the last decade, endowed with such a charisma as to make it unforgettable for all those who have been through it even just a few hours together. The arrival of this Remastered is therefore a very welcome surprise and after all these years, the time seems ripe to make the intellectual property known even to new players, who most likely had not yet been captivated by passion at the time of the PSP. Pata Pata Pata Pon It wouldn't take much to write this review: the title arrives on PlayStation 4 without substantial changes other than a better resolution and the game mechanics have remained exactly the same. The game deserves, buy it with your eyes closed and enjoy. After all this time, however, the public has certainly changed and it is not said that everyone is aware of what, on balance, is the rhythm game par excellence on a portable console, better as a basic idea even than all the other excellent competitors seen on Nintendo 3DS that make music and rhythm their core components. Patapon is special because it puts the player in command of a tribe of likeable characters: brave explorers and fighters in search of happiness. When you decide to embark on an adventure, you not only take the responsibility of finding out what's at the end of the tunnel but you put the fate of every single Patapon on your shoulders. The title, even today, is in fact extremely punitive and playing it lightly means losing important pieces of one's army, it means being stuck in an infinite cycle of ~farming~ and of levels that are all the same. Patapon is a rhythm game that shouldn't be taken lightly, which can be difficult and sometimes even frustrating, even more than its two sequels, excluded from this re-edition quite inexplicably. However, don't be afraid, Patapon tries to accompany you without too many traumas, gradually getting used to the various rhythms and explaining all the game mechanics in detail during the first levels. You will start by learning the basics of hunting, you will soon understand the melodies to make the army move and you will discover firsthand that charging a huge dinosaur head down is perhaps not exactly the best strategy. There's a fine balance to all of this, a balance that could have been tweaked to avoid a few small moments of frustration, but which overall is still one of the game's defining points. Playstation 4 trophies By completing the Patapon campaign it will not be difficult to be able to obtain platinum. Many trophies are tied to passing the various levels and very few require more complex actions. However, a lot of ~farming~ will be necessary, especially to create Ultra Rarepon Mogyoon and Ultra Rarepon Barsala. Pon Pon Pata Pon The game system is simple: each button corresponds to a specific sound, to be tapped in sequence to impart the various actions. There are combinations that order attacks, retreats and even simple movement and everything must be rhythmic with a regular cadence, marked by the edges of the screen that light up in time. Ringing combinations in series will then make our little Patapon enter a warlike frenzy that will increase the effects of each action, taking less damage for example or activating special attack skills. The simplicity of this control system is deepened by the formations of soldiers that you will decide to use, being able to choose between different types with very specific strengths and weaknesses. Patapon will drag you along for about thirty levels but each of these stages does not end simply with its completion. In fact, we will have to retrace our steps over and over again, in the hope of finding that specific loot that we need to create new soldiers or raise the necessary funds to improve the army. In addition to the rhythmic part, the Japan Studio title also puts on the plate a whole strategic management of theown Patapon that can be equipped with over one hundred different weapons, modifying their statistics and consequently their effectiveness on the battlefield. Each soldier can then be created with different power levels, simply by combining the rarest materials together and if you want an extremely high-performance army, get ready to spend dozens and dozens of hours on the title, with the risk of losing everything as soon as one of the game's huge bosses will swallow your troops. Permadeath weighs a ton in this case and the morale hit after a defeat could be reason enough to turn the tables and screw the whole thing. However, the gameplay captivates and from time to time you will learn that every mistake can be avoided, that a picture can be completed perfectly, simply by learning the enemy attack patterns and the correct timing of the musical combinations. Chaka Chaka Pata Pon Patapon's remastering work is certainly not one for howls of jubilation and joy. The title has not been revisited in any way nor, as we said earlier, the imbalances due to the extreme grind already present in the PlayStation Portable version have been fixed. The only finishing work is related to the resolution, brought to 1080p for the occasion, but without real benefits for the game, anchored to simple and minimalist graphics where visual quality is the least of the elements to take into consideration to evaluate it the overall quality. We would have preferred then, rather than this simple remaster, a collector including all three chapters, perhaps sold for a few euros more but including the entire series. The first chapter remains a pleasant game to play but also loses something of its original beauty by moving away from the idea of portability and quick play which in any case distinguish its essence. On the other hand, the sound sector is good, with appreciable music and good sound effects, even if they too lack any improvement.", "date": "2017-07-31", "grade": "7.5"}