{"name": "Il Castello di Osaka vi attende in NiOh: Onore Sprezzante", "ref": "https://multiplayer.it/recensioni/186631-nioh-onore-sprezzante-il-castello-di-osaka-vi-attende-in-nioh-onore-sprezzante.html", "text": "Not even three months ago we told you about how Team Ninja had been able to package a first additional content that had something miraculous about it, especially if inserted within a stagnant market: made up of short titles, insignificant DLCs and sold at a absurd prices. Already at its release, NiOh, had distinguished itself in being a title with a dizzyingly high amount of content. The first fifteen to twenty hours of the game turned into a continuous discovery of mechanics and new possibilities until it became a hybrid between a Dark Souls-like action RPG and a Diablo-style hunt for ever better loot. This second content, perhaps shorter than the first in purely content terms, surprises for a series of choices and changes that inaugurate a new step forward for Team Ninja, the fruits of which we will be able to see in the third and final act and above all in a very obvious NiOh 2. Contemptuous Honor brings with it all the strengths, but also the defects of the original title together with the incredible amount of measures taken by the developers over the months. It is not a perfect DLC, but for those who have not yet tired of going around feudal Japan to kill Yokai, know that the carnage will not be long in coming. How good the smell of Osaka in the morning Just as Dragon of the North added a whole new region a couple of months ago, Defiant Honor follows in the same footsteps. We do not find a completely new region to tell the truth, but a portion that includes the Osaka Castle (the largest fortress in Japan at the time) and its immediate surroundings. Our task is to support the siege of the castle and conquer the defense which is headed by the legendary Sanada Yukimura. It goes without saying that the narrative aspects are certainly not the strong point of NiOh, even if we would be unfair if we did not tell you that the purely ~spoken~ moments of this Contemptuous Honor are perhaps among the best directorial and stylistically things of the title. The new portion of the region includes three distinct areas: the castle (or rather a part of the fortress built to defend it), a temple and a snowy mountain. As per tradition, the Ninja Team started from the construction of these three locations and then used them, shredded them and modified them several times in the series of missions that make up the DLC. This choice, appreciated by some and hated by others, represents one of the most particular choices of a title that chooses not to follow the now inflated path of the classic open world, but enjoys changing the structure of the mission areas from mission to mission. As little as just three maps may seem, one of the best things about Defiant Honor is the way in which the team has evolved from a level design point of view, which so far (apart from a few inventive peaks) certainly did not represent the tip of diamond of the title, especially when compared to the work of From Software. On the contrary, the maps of Contemptuous Honor prove to be a huge step forward, changing in extension and structure even within a single mission. This is how the first task, that of approaching the fortress, translates into a field strewn with corpses and demons, characterized by a very long trench and a series of shelters necessary to move around the battlefield. If you forget to calculate the times well or to hide, a shower of arrows will leave no way out even for the mightiest of samurai. From this first part which, absurdly, recalls the structure of the descent to the Ringed City of Dark Souls 3, we move on to a rural area managed by ninjas and (damned) ninja dogs, who guard the staircase that leads to the clash with the first of the bosses of Defiant Honor. The Castle map, in turn, if it is true that it begins as one of the classic caves already seen in the base game, soon turns into an infinite series of alleys which, if explored well, will allow you to put together a magnificent amount of shortcuts and consequent long sighs of relief. The snowy temple, on the contrary, approaches the other maps dedicated to secondary clashes and some bosses. This series of new elements are clearly combined with all the classic choices of additional content, made up of new enemies, weapons, armor, a brand new set and, above all, a totally new weapon category. Where Drago del Nord added the fearsome Odachi to the katana, Disdainful Honor brings the classes to six with the addition of the tonfa, an interesting weapon especially if combined with a Katana or a Kusarigama, capable of breaking the guard with fast but also exhaust the enemy with rather heavy lunges (praise the different grips that the Team Ninja posted in NiOh). In short, contemptuous honor is a great way for Team Ninja to experiment where they had not yet dared, presenting us with a future that could not be more rosy than this. Playstation 4 trophies The thirteen trophies (all bronze) of Contemptuous Honor will confront you with the need to complete missions with specific sets or to face bosses only with a specific weapon. You cannot miss the objective that will ask you to complete the missions in the new difficulty available, the most difficult task that can be asked of you. At least that's what Team Ninja believes! but not all the booty that glitters is gold In the face of this series of absolutely positive elements, it is clear that the amount of work required to generate such important content in such a short time turns into a recycling of assets which, although useful in some situations, risk smelling like they have already been seen. Aside from the (very few) main assignments, the rest of Defiant Honor is filled with old boss fights or little variations on the theme. If it is true that probably no action RPG DLC can count on almost a dozen bosses, it is also true that more than half of these have already been addressed, albeit with some modifications. We don't want to spoil the pleasure of discovering them for yourself and verifying how the new spirits are among the most choreographic that the game has given us, but know that you will see the same name up to three times and this risks tiring a lot. It could be said that, especially a mission that can be considered a real survival against a series of bosses, was designed by Team Ninja to make it easier to accumulate a series of items without the need to redo an entire mission, but the feeling of already seen it is sometimes nauseating. A separate discussion for PvP which still remains absurdly unbalanced today, because it is based on a game system designed for cooperation, rather than for one-on-one confrontation. Just the difficulty is one of the biggest question marks. We ourselves were forced to ask for help to tackle the entirety of the content due to a required base level of 180, which forced us to give up at some point and take advantage of a different account with much more accumulated experience. It is true that, unlike the Dark Souls DLCs, those of NiOh can only be tackled at the end of the campaign and this partly justifies the exorbitant request in terms of statistics.", "date": "2017-07-31", "grade": "8.0"}