{"name": "Pokmon Scarlatto e Pokmon Violetto", "ref": "https://multiplayer.it/recensioni/pokemon-scarlatto-pokemon-violetto-recensione.html", "text": "A necessary evolution, which can no longer be postponed. This is the immovable starting point for any analysis of Pokmon Scarlet and Pokmon Violet. Too often, in fact, a nostalgic feeling seems to prevail: it would be meaningless, they say, to try to change, Game Freak should simply go back to the old formula. To the good old JRPG in two dimensions. We too let ourselves go to this reassuring thought, we admit it, but before getting to the heart of this review we must take note of a fundamental fact: we were tired of the dear old two-dimensional JRPG. Tired of the usual gym challenge, tired of random encounters, tired of progression on tracks. We still are, only it's easier to look back when present things don't go as we hoped. And it is from here that we feel like starting to get to the heart of the review of Pokmon Scarlet and Pokmon Violetto. Yes, because this ninth generation was born precisely from this feeling of tiredness. It represents the most convinced and drastic attempt by The Pokmon Company to take a million dollar brand and revolutionize it. Not with a new gimmick or a new name to the old challenges. No, the Pokmon games have been taken and turned inside out, in spite of the dizzying numbers of each new chapter. It is an operation that requires courage and, given the results, perhaps even a little recklessness. But we have gone on too long: make yourself comfortable, because there are many things to say. pokemon open world Exploration in Paldea in Pokmon Scarlet and Violet is completely open world Pokmon Scarlet and Pokmon Violet are the first chapters of the truly open world series. We are not faced with the shyness of Pokmon Sword and Shield, who used the Wild Lands as a simple diversion from an extremely linear progression. Nor do we have a replica of the vast Pokmon Legends Arceus maps, which could only be accessed via an area load. Here everything is interconnected: from north to south, from east to west, every single city, cave and path can be explored seamlessly. Pokmon Centers are also now outdoors, along with the Pokmon Market and the TM Machine to create technical machines using materials collected after each battle against wild Pokmon. There is one big exception: Mesapolis. The city where the Academy is based forces us to load the map each time, even if we don't access it via the traditional entrances: in these cases the game blocks us and takes us back to a ~lawful~ entry point, partially breaking that sense of extreme freedom that is reached once all the upgrades of Koraidon (or Miraidon, in Violet) have been obtained. Just the cover pokmon represent the preferred means of transport of our avatar. In one fell swoop they take the place of running shoes, skates, bicycles and even the Hidden Machines of older generations. Their abilities, which can be unlocked progressively, follow what could be done in the past with tools and HMs: riding, jumping, surfing, gliding and climbing gradually allow you to reach different areas of the map, access rare items and generally make them faster navigation. Beyond the discussions on the design of these living taxis, there is no doubt that their presence gives an unprecedented sense of freedom, fluid and almost without limits. We had criticized the level design of the recent Pokmon maps, but it must be said that Game Freak is also slowly learning to manage the three dimensions. If in Pokmon Legends: Arceus a certain verticality was already noticed, here it explodes in a riot of peaks to climb, with more or less visible ravines where there is almost always an object to collect. Even the (few) caves begin to have a more complex structure, with galleries, elevated areas and a general arrangement of larger boulders that conceal this or that point of interest. The character design of Pokmon Scarlet and Violet is still very good There is still a lack of awareness such as to allow the creation of multiple exits on secret areas or the implementation of environmental puzzles but, after the timid steps forward highlighted in the review of the DLC The Snowy Lands of the Crown, we are pleased to see that we are going with conviction in the right direction even in the more traditional vein of the series. That's good. We weren't convinced however by the way in which a certain type of collectible was managed, really too casual in its arrangement and not even the judgment on the flat areas is too positive. The low density of the flora, combined with the recycling of elements that are almost always the same (trees, but also towers and ruins), makes the general morphology asomewhat monotonous, and consequently less interesting to explore: the view, even from the highest peaks, is never truly breathtaking. But on the other hand, to paraphrase the lesson of one of the Academy's professors, we must always be ready to make new experiences, even if they might disappoint us. One story, three roads One of the possible avatars of Pokmon Scarlet and Violet In this context of general structural renewal, the beginning of the journey to Paldea confirms how Game Freak has decided to say goodbye to some of the typical clichs of the series. Not all, mind you, but the way the adventure starts follows unforeseen stages, which make the tutorial phase and the choice between one of the three starters lighter. These yes, as usual, present in the usual configuration: fire, grass and water. We anticipate that we will not go into detail about the events narrated, not even those that we could tell you: we do not believe a detailed synopsis is necessary. It is enough for you to know that our protagonist is a new student of the Orange Academy (or Grapes, if you have the Violet version) and that all the facts told will be somehow connected to the school lessons and, to a greater extent, to his extracurricular activities . As is now known there are three paths to take: that of Champions, with 8 gyms to challenge to obtain the Champion rank; the Legendary Path, where you can face the fearsome Dominant Pokmon that rage in the region; and Avenue of Stardust, which leads us to challenge the ~bad guys~ of Team Star who cause problems at school. Some effects of Pokmon Scarlet and Violet are nice With the exception of the path of the Champions, more linked to the struggles and challenges of our rival, the other two paths have shown that they have a precise narrative direction, with a few twists, an acceleration of cardio palmar in the last few hours and even the attempt to deal with difficult issues such as bullying and mourning. Unfortunately, the result is not extraordinary: the psychological deepening of the trauma is absent and everything is cloaked in an aura of inhuman positivity, even in moments of potential emotional involvement. The twists and turns, then, are all rather telephoned. The intention to delve into the characters during the missions is not bad, with a sometimes even original characterization of some supporting characters, including gym leaders. The efforts to give depth to the narrative, however, collide with one of the most obvious and heavy problems of the production: a very superficial world construction. Editors and Picnic Pokmon Scarlet and Pokmon Violetto focus heavily on some ancillary features: personalization and picnics. On the customization front, the avatar editor is finally worthy of the name, with a series of options to have a face that is truly different from that of other players. The clothing is more limited, given that you can only act on the accessories: trousers, t-shirt and sweatshirt are linked to the school uniform, present only in 4 seasonal variations. The picnics, on the other hand, collect old functions from the series, such as Pok Me & Te to interact with pokmon; the creation of poffins, which flows here into the preparation of sandwiches, even with friends; and finally the pokmon retirement, with eggs that are born simply by spending time in this feature. A divided world One of the trainer types in Pokmon Scarlet and Violet With worldbuilding we mean, by definition, the process that leads to the creation of an imaginary world and all its characterizing aspects. This must be reflected not only in the plot, but also in the way the individual elements interact with each other and with the story itself. Let's take an example to clarify the concept, going into detail about Pokmon Scarlet (the version we tested): let's say we learn from a character that there is a Pokmon exceptional in strength and violence that is raging in an area of the map. We would expect his presence to be creating problems for the local population, human and pokmon, and that this discomfort is manifested in the dialogues with some NPCs. Here, in Pokmon Scarlet and Violet there is no trace of all this, quite the contrary. NPCs with more than one line of text can be counted on the fingers of one hand in each area, and interactions are mostly generic and uninteresting. There is the courier who would like to give you a delivery, or the sixty-year-old student who envies your youth; in the luckiest cases a yellow balloon signals the presence of a possible exchange of goods or pokmon. Nothing else. Not a reference to the current situation, not a hint of the current crisis or the lore of the region. Accordingly to the resolution of this or that crisis is not posIt is possible to expect a reaction, let alone a reward. You don't need to be a great JRPG expert: the step backwards will be evident to anyone who has played any title in the series, even more after the implementation of even a diary of missions in Pokmon Legends: Arceus. Which has simply been eliminated here because, well, there are no sidequests. The three paths are totalizing for the experience, but in fact they result in a juxtaposition of three stories that struggle to communicate with each other: the freedom that we wanted to deliver to the player means that each element proceeds on parallel tracks, in a path that at the same time it is guided by the level of the opposing pokmon, which remains fixed regardless of our choices. Even the coaches along the way don't challenge us as soon as they meet our gaze, but if for some reason we don't face them when we're at a similar level their presence becomes practically useless. The Pokmon Scarlet and Violet shops are all outdoors The challenge does not scale as we win medals or face Dominant Pokmon, and in fact the level of the Pokmon in each area shows us an obligatory path that clashes with the claimed independence of the whole experience. Not even following the lessons punctuates any path, with the result that you will soon end up forgetting their existence (not that it is a great loss, except for a couple of subjects). This basic contradiction will disappear only at the end of the three paths, when we will be truly free to go anywhere without any constraints: a bit late, since at that point there won't be many things to do. world contributes another limitation compared to the chapters of the past: Pokmon Scarlet and Pokmon Violet are the Pokmon games with the least explorable buildings ever. Want to disturb someone at their home? You can't, it's closed. Want to buy a sandwich? Choose from this list. Are you going to do an activity with a professor inside the Academy? A text screen will tell you what's going on. For TV series fans we could say that these chapters are the triumph of the Vanzina brothers' great lesson: ~What do we do if we can't afford to stage an event? Simple, 'o dimo~. Crystal gameplay The Teracristal phenomenon in Pokmon Scarlet and Violet A real shame because there would be a lot of potential and the gameplay also works as well as few times in the last decade. The capture and combat mechanics are the turn-based ones known to all, but the surprise is that the gimmick of this generation is really well balanced, at least offline. The Teracrystal phenomenon, as the ability of Pokmon to change teracrystal and become a sort of living crystal is called, was a revelation: it not only increases the strategic possibilities of teams by giving the possibility of increasing the power of moves of a certain type or reducing the damage of the shots by changing the type of the pokmon that uses it, but it is only one of the arrows to our bow, without becoming indispensable. Unlike Dynamax, for example, in some clashes it may be convenient not to use it to maintain the ability to resist a certain attack. In competition, the effective impact of the case remains to be evaluated, given that there seems to be no limit to the modifications of the therapies, but for now the sensations are good. Building a team for real tournaments, then, is really simple. Minds and caps, to change the nature and individual values of a pokmon, are sold for a handful of pokyen and skill patches are also very easy to find. The pokmon pension for having eggs has been removed and now the mechanics have moved to picnics, where sandwiches give bonuses similar to Pokmon XY's O Powers for the production of eggs, in fact, and even for the hunt for chromatic (or shiny , if you prefer). Pokmon Scarlet and Violet starters are very nice In short, the simplification started a few years ago has reached its peak here, with the consequence that now those who want to try PvP tournaments have very few excuses for not doing it with conviction. open servers. The structure largely remains that seen in Sword and Shield, with raids to be faced with three other players and online matches. A password system also remains for interacting with friends, while the cooperative mode now allows four to move around the world, to capture pokmon, explore or have a picnic. The stability of the system will have to be verified over time, but given the performance in single we expect significant performance drops. Technical sector: on the verge of the chasms", "date": "2022-11-17", "grade": "7.4"}