{"name": "Splatoon 2", "ref": "https://multiplayer.it/recensioni/186136-splatoon-2-splatoon-2-il-seguito-perfetto.html", "text": "Splatoon was an important title: Nintendo before that moment had never given the impression of wanting to set foot in the world of competitive shooters, leaving the burden of this demanding first time to a young internal team, at least as regards the rather conservative habits of Japanese working culture, and proposing a personal formula, very different from the standards of the genre. No blood or guts in plain sight, better than battles between strange humanoid squid equipped with inventive paint-shooting weapons. The occasion was also to experiment with the so-called ~live games~, evolving titles that change and are enriched with content over the months, a pact with users that Nintendo has maintained and which has contributed to making the product a small phenomenon, at home but not only. Splatoon was an important title, we said, but released on the wrong console: the resounding failure of Wii U certainly didn't do justice to a brilliant formula, which now has a second great chance of establishing itself on a wider and heterogeneous audience. After Mario Kart 8 Deluxe and ARMS, the last element of a terrific triptych for all multiplayer lovers is about to land on Switch. Squid barrel The offer of Splatoon 2 does not differ too much from that of its predecessor, at least in appearance. From the central lobby, a colorful futuristic square full of shops and characters, you can access all the game modes. Single player, multiplayer and, for the first time, also coop. However, the variety of options should not deceive: it is good to immediately make it clear that, although the outline has been fleshed out, the competitive experience remains absolutely the prized piece of an experience that focuses entirely on the exciting four-on-four challenges. In Friendly Match you always play with the rules of Melee Mollusca, therefore with three minutes to smear the surface of the stage, trying to pass your color on to the opponent's and using the weapons in your possession for the dual purpose of painting the ground and blow up the four clams of the enemy team. It's a very simple formula but the speed of the action and the captivating mix of situations that are created make it a drug from which it is very, very complex to break away. Among other things, the simple outline designed by Nintendo, made up of experience points to accumulate and levels to climb, gradually gives access to an arsenal that relies on a main weapon, a super secondary that can be activated by filling the appropriate indicator and a grenade. With money you can redo your wardrobe, improving your style (and Splatoon is a very stylish universe, just look at any screenshot) but also getting valuable bonuses. Nothing new, but well structured in such a way as to give a sense of progression and gratify the user. Among other things, the idea of replacing bullets with paint has opened up a range of possibilities: pistols, rifles, machine guns and precision weapons alternate with rollers, brushes and buckets. In this sequel, the arsenal was further expanded: new guns (from paint?) alternate with those already known, which in turn have been refined. The Repolper Duplo is perhaps the most interesting of the novelties, a double pistol perfect for close quarters combat which, when used, replaces the jump with a dodge that makes you truly unpredictable. It may not seem like much at the first test, but you realize how lethal it is as soon as you face an opponent capable of making the most of it. Also interesting is the change made to the Roller class, which now when used in jump no longer sprays the paint horizontally but vertically, making it more versatile. All the variety offered by about thirty weapons, between main and variants, is useful in Melee Mollusca mode but becomes even more decisive when facing the Pro Matches. Once you reach level 10, in fact, you access the second option of the competitive menu, with three several games with objectives that follow those of the previous chapter. In Mobile Tower you have to escort a cube along a checkpoint path; Bazookarp asks you to conquer a bizarre carp-shaped weapon, then transport it to a point near the opponent's respawn; Finally, Zona Splat is a variant of Territories that asks you to focus on certain areas of the map. In Partita Pro things get more complex and team play is decisive, with the further complication of having to keep an eye on your rank since once you reach level B- you can access League matches, to face with a friend or directly forming a team of four and dealing with the best and most organizedte teams in circulation, always on the usual turn-over of maps and starting from the previous mode. Speaking of the internships, the new ones largely take up the open and articulated design of the past. A return, Torri Cittadine, will give a small touch of familiarity to those who are already experienced but the others are unpublished and in principle all really well conceived and made. The geometric and more guided spaces of Porto Polpo alternate with the frenzy of the Centro Polisportivo, but in general each map has its own uniqueness and needs to be memorized in the best possible way to avoid bad impressions. Appetizer and dessert What is positively striking about Splatoon 2 is the alchemy it manages to create: having to color the map and ~splat~ the opponents at the same time allows a series of approaches and choices at every moment of the game, but above all the very fast pace and formula which is not punitive in any moment of the clash, even when playing in a team that is not very gifted, they give a sense of satisfaction and constant fun. The same refined balances that have always been found in Mario Kart and have recently convinced the ARMS, albeit limited, are present here in all their strength; no longer surprising, but it is good to remember. Before and after the main course of Splatoon 2, or competitive multiplayer, there are the aforementioned single player modes and the brand new Salmon Run. The solo adventure of the original had been criticized for the lack of depth, it was roughly an articulated tutorial but nothing that could go further in terms of stimuli and complexity of the solutions adopted. In this sequel, the story would seem the same at first, with the levels of the first world rather boring and devoted to teaching us the basic mechanics, in reality things gradually become more encouraging until they blossom completely from the third world onwards. Let me be clear, miracles shouldn't be expected and in principle Nintendo does better, but detaching from the stress of the competition from time to time in favor of something more relaxing helps, this time there is no shortage of variety and the bosses are always spectacular. If you've always dreamed of fighting against a huge samurai octopus that moves on a tiny monocycle, you've found your match. Salmon Run, on the other hand, mimics the classic Horde mode: a team of up to four elements must eliminate three waves of opponents, including ~regular~ soldier fish and bosses with special powers who, once defeated, leave golden spheres on the ground that go transported to a suitable container. At the end of the three mini combat sessions, if you have survived, you sum up, gain experience points and so on. All very nice and at times quite challenging, also because the enemies abound in imagination and the dynamic stages help make the clashes unpredictable, but this slice of the offer is all in all thin and will hardly entertain for more than a few hours. It will not be, just to understand, what the Zombie mode is for Call of Duty, rather the icing on an already very rich cake. A coat of colour Net of a splendid multiplayer component and a richer outline than in the original, Splatoon 2 is a title that follows the work done by Nintendo on several of its franchises. Even from a technical point of view. The glance is very close to that of the first chapter and in some cases, such as the shops where you can buy clothing and weapons, there seems to be a strong recycling of assets. In reality there has been a leap forward and you can see it during the first few games. The graphics, already very colorful at the time, are now more refined and precise, just look at how the paint is distributed on the surfaces and the spectacularity of the explosions or splashes of color to verify how much Nintendo Switch has also done the visual component well. Among other things, the fluidity is granite in all situations apart from when you are in the square that serves as a lobby, at 1080p when you connect the Nintendo Switch to the TV and 720p in portable mode. The controls pose the dilemma of whether or not to activate the motion control to aim, a solution that might seem more uncomfortable and unusual at first but is instead very practical in the long run. In any case, the answer is immediate and after a few matches you get carried away with a movement and aiming system that is not entirely conventional but really well studied. The same cannot be said for the management of the pre-game lobbies: you cannot exit and they are a bit poor in options, for example they do not allow you to change weapons except when creating private rooms, even if it must be said that the extended schedules (and the consequent boredom) are a classic plague ofand review sessions, when there are few players online, while the problem shouldn't arise in game shops. Also because a sales success is expected.", "date": "2017-07-18", "grade": "9.0"}