{"name": "Unturned divora tutti", "ref": "https://multiplayer.it/recensioni/185983-unturned-unturned-divora-tutti.html", "text": "Unturned is DayZ's farce. That is, it is DayZ that has mated brutally with Minecraft. It was released in Early Access when the Bohemia Interactive title permanently occupied the top positions of the Steam top 10. It almost felt like a joke rather than a real game, yet it managed to cross the final release line before its main inspiration and is currently far above it in terms of daily active users. DayZ is an undead game, Unturned is alive and well and fighting with us. Downloaded by more than thirty million people (it's free-to-play), it has become one of Steam's most profitable products, despite the gentle nature of its microtransactions (no pay-to-win). At first glance it is difficult to understand why it is so successful, but by playing with it a bit and delving into its gestation, its strengths emerge clearly compared to its direct competitors: great support from the developer, who has not been wrong so far a blow, and a terrifying technical side, which however allowed the addition of supplementary content at great speed. Yes, since the graphics are cubed and hyper-stylized, creating objects galore didn't prove to be a problem. Probably by adding all the 3D objects of Unturned you do not get the polygons that make up a single character of an average triple A. It doesn't matter, because what would be a colossal flaw for other titles, has turned out to be a turning point for a free game that thrives on its community. If you want we can add the great voluntary contribution given by modders (currently the Steam Workshop contains thousands of additional contents), enticed and favored by being able to realize their ideas in lightning times, and you will understand why an apparently qualityless title is among the products most prominent in the PC scene. MinecraZ As already mentioned, Unturned is a survival. Let's say better: it's the shameless copy of Dayz. But we had already said this. So by starting a game you find yourself alone on the chosen map and you have to perform all those typical actions of the genre: you start by looking for an urban agglomeration or a site of any kind, then you dedicate yourself to exploring the area by looking for material good for helping us in the only goal we have: to survive. The zombie apocalypse has brought the world to shambles. Above all, he filled it with drooling creatures who consider us to be Florentine itinerants. Fortunately, Unturned's zombies are particularly stupid: they stay still and, using a minimum of brain (and the stealth system), evading them isn't that difficult. In fact, they're far too dazed and their complete lack of activity, apart from zombie sounds, makes the game world dull. Jokes apart from a few movement patterns, even very simple ones, wouldn't hurt him. Obviously when they spot us they come alive and become very dangerous, also because they are unusually fast. In these cases you have only two options: escape or fight. To choose the second you must necessarily be armed. Stopping a zombie horde with your fists isn't easy. Guess what? Weapons are found in homes, but for the best you have to venture as far as military infrastructure, usually the most protected areas. Up to here, graphics aside, Unturned seems to be the survival type ... don't worry, even going forward it remains so. By collecting objects and learning how to take advantage of the various tools available around, it is possible to build a bit of everything: weapons, armor, a base and so on. You can even build an aircraft that allows you to fly freely around the maps, at least until you are shot down or run out of fuel. There are literally hundreds of items in Unturned to collect and use for crafting. This is certainly the best part of the game, the one that is less affected by the conceptual debt with the other survival games. The real danger is not zombies! Unturned is playable in single player (you choose a map and try to survive as long as possible), but it is at its best in multiplayer. That is, it should give its best, but as always happens in these cases, being able to enter such a well-established community is the most difficult part of the ~gameplay~. Unfortunately we are talking about a title with already three years on the back. What does it mean? It means that many have downloaded it, tried it, played it and maybe abandoned it. Those who have remained are the most passionate players: those who know every aspect of the game inside out and who, above all, have now joined together. If you've ever read about other survival games you should have already understood what happens regularly on the servers: the novice comesspotted and ruthlessly slaughtered by veteran players armed to the teeth, who enjoy killing him for the sake of it (they certainly don't need his items). In the worst cases he is given some time to thrive but, when he believes he has succeeded in something, i.e. when he has collected a lot of material and has built an apparently solid base, a punitive expedition arrives immediately and remits him. in line). Unfortunately there are also many cheaters around, so hiding is often not possible and the gaming experience becomes frustrating. It looks like virtual bullying, and indeed it is, but there's nothing you can do about it. The only advice we can give you is to play in single player until you have internalized all the game mechanics, perhaps by selecting the ~Easy~ mode to make the zombies less annoying (there is also a tutorial to learn the basics if you want) . So, after much practice, you can venture to go online. Of course, the one outlined is not exactly a scenario that makes you want to play, but it is better to be prepared before wasting time. Accepting all these compromises, Unturned ends up being one of the best zombie-themed survival games out there, at least it's the most complete one. Indeed, let's say better, it is one of the few to have been completed. Do you think that titles such as the aforementioned Dayz, but also H1Z1, Rust and others were launched before him and are still not finished. After all, don't expect anything original, because Unturned is highly derivative in every aspect, both in the fundamental and in the advanced mechanics. Above all, it is free and the absence of pay-to-win microtransactions that saves it. Here, maybe it's a little bit to make it a masterpiece, but it's enough to at least take a ride.", "date": "2017-07-17", "grade": "6.5"}