{"name": "Final Fantasy XII e i cieli di Ivalice", "ref": "https://multiplayer.it/recensioni/185818-final-fantasy-xii-the-zodiac-age-final-fantasy-xii-e-i-cieli-di-ivalice.html", "text": "The remastered editions of old hits are for commercial operations companies that focus heavily on the nostalgia factor, while for many enthusiasts they can prove to be an opportunity to relive certain emotions, or to try them for the first time in case they weren't able or wanted to play a title at the time of its release. In the case of Final Fantasy XII, there is also an opportunity to rediscover a product that is too underrated. As we wrote in previous articles and also in the special relating to the history and anecdotes related to its development, the twelfth installment of the Square Enix series was critically acclaimed but little considered by the historical fans of the saga when it was released in 2006 on PlayStation 2. Too different from those who preceded it, already distant from the traditional formula, but also different from those who followed it, from the new approach more directed towards action and ~modern~ for the times. Who today are perhaps more mature to appreciate a work that is reproposed to us on the basis of the International Zodiac Job System edition, unpublished in the West, and therefore full of new features and options, including support for trophies, sharing features, autosave and short loading times. The consequences of the war In Final Fantasy XII: The Zodiac Age, the world of Ivalice is in turmoil. In fact, the story begins in the city of Rabanastre, the multi-ethnic capital of the kingdom of Dalmasca, where the wedding of Princess Ashe and Prince Rasler is being celebrated: when the invasion of the Archadia empire begins, the prince is killed, the king is treacherously assassinated, apparently by the captain of the guards, after signing the surrender, and Ashe disappears into thin air. Two years later, Rabanastre has changed: hunger and poverty reign everywhere, and many orphans like the game's protagonist, Vaan, are forced to be pickpockets to survive. But like all young people in the world, he too hasn't lost hope and dreams, together with his lifelong friend Penelo, of becoming a pirate to sail the skies aboard an airship of his own. One day, due to a series of fortuitous coincidences, the two friends meet two real professional thieves, the charming Balthier and the seductive Fran, with whom at a certain point they find themselves having to face a long and difficult journey that will lead them to live a risky adventure fraught with dangers for the future of their world. The story of Final Fantasy XII: The Zodiac Age is therefore quite complex, capable as it is of mixing imaginative topics with other current and ~serious~ topics, such as the drama of war, the consequences on the civilian population, but also political intrigues , supernatural beings and conspiracies in a script that, despite losing a few shots at a certain point, manages to interest the player. Playstation 4 trophies The game offers 41 Trophies divided into 26 bronze, 10 silver, 4 gold and 1 platinum. To obtain them, you must satisfy requests such as, for example, defeating particular bosses, completing the bestiary, unlocking all the characters' abilities or passing a certain number of encounters in Challenge mode, up to Platinum which is obtained by taking all the others. The art of combat Having abandoned the ~fixed~ camera and random turn-based combat, Final Fantasy XII: The Zodiac Age almost completely detaches itself from the previous episodes and those that followed it by marrying a game mechanic very similar to that of an MMORPG. The general approach is unique, with the player being able to explore the macro-areas into which each visitable location is divided, with the enemies clearly visible on the screen and therefore sometimes avoidable. The title uses a fairly complex real-time combat system called Active Dimension Battle, built around a series of situations and tactics that can be configured through Gambits. If this system is active, the three party members chosen to fight attack the enemies automatically (otherwise the gamer can directly choose which actions to make them perform through the classic drop-down menu), and a colored line will connect the character to his target. with the type of spell or attack he is about to use identified by sight. Gambit management is therefore one of the most important aspects of the game, given that the fate of battles, especially the more difficult ones, depend on the ~correct~ configuration of the principles that regulate the reactions of the various characters during the battle. The Gambit consists of a series of parameters that the player acquires in different ways during the adventure and which he can then set by establishing real behavioral priorities for each individual character depending on the eventsyou. Under a particular condition, an action follows, for which a sort of command string can be set in which, for example, a character is asked that if an ~ally has HP at 30%~, then he must cure him with a ~Great Potion ~ or a healing magic. In the same way it can be established that if the ~Enemy that attacks the leader~, is in turn hit with an ~attack~, and so on, until multiple combinations are created. But in order to act in a certain way and use weapons, magic and objects, or even to be able to invoke the Espers (which this time can be used directly, like the rest of the guests in the party), the protagonists must obviously improve their statistics. In this episode you level up by accumulating experience points, but this time the increase is not only linked to the parameters of the six heroes, but also to their License Points. These, obtained in battle, are then spent on a sort of chessboard where you can unlock from time to time the possibility of equipping certain objects or accessories, of holding certain weapons, special techniques (Apotheosis) and of casting precise spells. Since as previously written, this remastered edition of Final Fantasy XII is based on the version known as the International Zodiac Job System, which never arrived from us, there are twelve license boards, which each correspond to a zodiac sign and a profession, from 'Archer to Black or White Magician, from Knight to Samurai, and so on. The new zodiac chessboards allow you to build characters according to precise dynamics, customizing every single element of the party to the maximum to make it unique compared to the others. All for the benefit of a certain balance of gameplay to which some changes made by the developers contribute to make the experience less frustrating than it once was. In this sense, the possibility of moving quickly within the scenarios has been added, even during the fights, by pressing the L1 backbone, a choice that we appreciated since in this way we can cut dead times without losing plot parts and fights at the same time more difficult, and an intermediate automatic save system between the different maps, in order to simplify navigation and avoid having to restart the player from a too distant save point in case of premature death. To further enhance the offer, however, there is a Challenge mode that offers the most prepared fans the opportunity to face up to one hundred fights in succession by testing their skills in organizing and managing the party adequately. Return to Ivalice Moving on to analyze the technological part, in judging we must take into account the fact that the title is a remastered edition, and not a real remake, of a game originally released on PlayStation 2. For this reason, one should not and should not expect miracles of sorts in terms of graphics, even if, let's say it right away, perhaps Square Enix could have done a little more to improve it. In short, the title, although aesthetically pleasing, cannot compete with current productions, although it has aged in an acceptable way. On balance, Final Fantasy XII: The Zodiac Age takes up a product that amazed at the time for the vast inspired settings, by the same admission of Hideo Minaba, artistic director of the game, to medieval Mediterranean architecture and some elements of Arab culture. Panoramas that today, in higher resolution and with a slight make-up, are still pleasant to look at, despite the fact that they betray a certainly not stratospheric polygonal count. Thanks to 1080p and the use of more defined, albeit flat, textures, the image is in fact brighter and sharper, pleasant to look at, also thanks to the style adopted by the developers to recreate the world of Ivalice, characterized by pastel colors with warm tones , as well as a good lighting system and a decent use of antialising. However, characters and enemies are better, which all in all, also thanks to the aforementioned inspired artistic direction, manage to take us into a vast and multifaceted universe. All of this, by eye, seems to run at 30 frames per second, with good fluidity and without particular problems. As far as the audio sector is concerned, we have a soundtrack remade starting from the original songs re-performed by the composer Hitoshi Sakimoto with a live orchestra, for an excellent result that enhances each single track even more in our view. However, it is possible to choose between the original songs and those rearranged in 7.1 surround. In the same way it is possible to select at will the good dubbing in Japanese or the equally good one in English.", "date": "2017-07-10", "grade": "8.5"}