{"name": "Dead by Daylight arriva finalmente su console", "ref": "https://multiplayer.it/recensioni/185684-dead-by-daylight-dead-by-daylight-arriva-finalmente-su-console.html", "text": "Asymmetric multiplayer games have not had much luck up to now and the reasons for these failures are to be found in the most disparate reasons. Evolve, a title that featured a giant monster hunted by four hunters, had fantastic gameplay with a brilliant idea behind it, all nullified by a policy of DLC and additional content that literally made your skin crawl. However, the lesson was used for (almost) all the development teams that arrived later, given that several titles that were at least enjoyable and with a good community behind them came out. One of the last in order of appearance was Dead by Daylight, a game with very different atmospheres from those seen in Evolve and capable of completely overturning the concept proposed by the Turtle Rock guys. The opportunity to return to talking about Dead by Daylight this time is provided by its arrival on consoles, also in physical version thanks to Digital Bros - Halifax, a fairly hasty and surprise launch, however capable of bringing the tension it is capable of the production to an even wider audience. So we put on our worst mask and set out to butcher tender innocents. Look under my mask The arrival of Dead by Daylight on consoles is rather reckless in our view and the work done is certainly neither the best nor the most cared for. We immediately notice from the menus that the choice not to adapt the selection system to the pad but to leave it assigned to the movement of the stick is merely a solution adopted out of laziness rather than for convenience. Going through the few menus becomes so tedious, especially in the inventory section, where you spend more time moving the pointer from one area to another than you are actually choosing what to equip. We are also rather perplexed by the decision not to include all the DLC released on PC in this version, proposing an edition poor in content and essentially lacking in variety. We also want to take off another pebble in the shoe and immediately criticize the textures, the lighting system and the general quality of the models, made decidedly poorer than their PC counterpart and, despite this, a dancer frame rate is also required to accompany them and inaccurate hitboxes, which most of the time will ruin the hottest moments of the action. If a patch to fix frame rate problems is desirable, and even a little bit in the connectivity between players, we will hardly see relevant technical improvements. If you still have to choose which version to buy, simply contact the steam version. That's all for what concerns the bad news and like any self-respecting horror film we immediately revealed the monsters that will then accompany you throughout the adventure, even if you don't know exactly when they will strike. But perhaps some of you have never touched the title and intrigued by the abundance of splatter scenes seen in the trailers have decided to investigate the matter further. So is it worth giving this Dead by Daylight port a chance if you've never had anything to do with it before? Trophies and Achievements Being able to platinum / mill Dead by Daylight is a rather difficult undertaking overall since it will require dozens and dozens of hours of gameplay. In addition to the simpler trophies that you will be able to unlock simply by playing with a little more consistency, there are a whole series of objectives to be achieved that complicate things terribly and that will require you to have a close group of friends, or at least excellent communication. to be completed. Only the most devoted will succeed in the enterprise. A story that should have ended better Take the best horror movie villains you can think of, starting with Jason Voorhes and going all the way up to Leatherface, and stuff them into a game where all they have to do is slaughter and sacrifice a handful of four fearful humans to the dark gods. Dead by Daylight offers a good starting point, obviously inspired by these cinematic characters but offering us some unpublished versions in order not to collide with expensive copyrights. The player will thus be able to choose whether to take the side of the solitary assassin, choosing from the six available, or to impersonate one of the fugitives, also equipped with some particular ability. The aim of the game for humans is to turn on five energy generators through very simple QTEs in a limited map, open one of the two final gates and escape from the area before the monster makes a slaughter. Easier said than done, of course, and forget about winning against an experienced player if noyou will not communicate at least a minimum with the other preys. So if you intend to play solo, think carefully about buying the title since it is precisely in a group that the Behavior production manages to give its best. The experience improves significantly if played in four and since the fugitives cannot face the monster in any way, much less defeat it, different and interesting tactics will have to be used to succeed in the enterprise. Of course, escape and the possibility of hiding in the tall grass or in the lockers remain valid options at first but by playing some organized games you can attract the executioners simply by making noise on purpose distracting them from their main objectives or by engaging in Scooby Doo-like escapes by exploiting windows and obstacles where enemies cannot pass. In short, the experience, even on consoles, is still solid and fun, net of the problems mentioned above. Do not look back! To give a little additional depth to the gameplay, essentially two elements take care of it: the growth of the various characters and two distinct views between fugitives and assassins. By completing each game you will receive different currencies that can be spent on acquiring new skills and items. You will thus be able to find medkits to heal your wounds, better weapons, consumables to improve your performance and even offers to sacrifice to have a better chance of landing on one map rather than another. The creation of these skill branches is completely random so you don't know exactly what you'll find in front of each level up, an unusual formula but one that we frankly appreciated. It is interesting Behavior's choice to offer a third-person view to fugitives, who can thus have better control of the surrounding area and instead restrict the assassins' field of vision with a first-person view that often confuses and disorients, a tool effective to make hunting more adrenaline-pumping and stimulating. From this point of view, the sound is excellent with the heartbeats increasing in intensity as the enemy approaches, raising the bar of tension to incredible levels. Unfortunately it is the controls on the pad that are not entirely convincing, and it is not unusual to bump into edges or protrusions causing the various animations to lose fluidity, sufficient but certainly not particularly exciting. Even the settings have ups and downs. They are undoubtedly evocative and recall the best horror films but many of the elements inside them are poorly cared for, clearly detaching from the vegetation which instead defends itself more than dignifiedly.", "date": "2017-07-06", "grade": "6.8"}