{"name": "Iron Warriors: T72 Tank Command - Recensione", "ref": "https://multiplayer.it/recensioni/iron-warriors-t72-tank-command-recensione.html", "text": "Can you pass me that gas can? After a few minutes (let's say a few hours... but we'll talk about it again in the hardware box that we strongly suggest you go and read) configuring the various aspects of the game (the internal menu is very simple to master, but there is also a more complete and complex, accessible from Windows, which allows you to change many parameters, in order to activate advanced functions or deactivate effects that could make the graphics unfluid), we launched it and we began to learn the rudiments of the perfect tankman by trying out the single missions ( which also serve as tutorials). soon you will have to face the need to manage very complex scenarios, in which the enemy will seem to have a clear advantage Can you pass me that gas can? Those used to standard control interfaces will initially be taken aback since, to get to the heart of the action, it will be necessary to study all the keys necessary to control the different functions of the wagons. Thus, for example, to start one of the steel babies that will be entrusted to us, we will have to, in order: start the engine, accelerate, put into first gear (we are talking about gears) and remove the handbrake. We will also have to choose which part of the vehicle to check, since each sector will be governed individually. We could in fact be: the drivers, so as to control the movements of the vehicle; the artillerymen, so as to maneuver the cannon (each of the three tanks has a different viewfinder with different indicators); the machine gunners, so as to control the machine guns; or the commanders of the vehicle, so as to give orders to the support troops. Don't worry, the very good AI allows you to rely quite easily on the automatic management of the various aspects, in case we find ourselves having some urgent priorities or in case we decide not to take care of one or more sectors. Campaigns and engines The fulcrum of the game is certainly the long single player campaign in which you can put into practice all the concepts learned in the tutorials and by reading the manual. At the beginning of each mission there will be the inevitable briefing in which the scenario and the different objectives will be described. Once you enter the action, you cannot help but be fascinated by the goodness of the work done. By proceeding and practicing with the many things to do and manage (for example the type and quantity of ammunition) you can understand the depth of everything. Soon you have to face the need to manage very complex scenarios, in which the enemy will seem to have a clear advantage, having to work to reverse situations that appear desperate. The overall slowness of the action allows you to manage everything better (don't expect, however, to be able to do it by exploiting the luck factor, because you would be wiped out mercilessly) and soon you become real masters in giving orders to the troops maneuvering, at the same time, our metal beast. The management of weapons is very well done, in which many factors must be taken into account and in which practice is the only means that makes perfect (at the beginning the smooths will be wasted). Campaigns and engines Graphically, Iron Warriors features an incredibly scalable engine, capable of running on even very old computers and not equipped with the latest generation graphics cards. Tested on a Radeon 9200 we were able to make it run very smoothly (obviously cutting many effects) obtaining, however, a good visual result made up of non-detailed textures and simplified and functional three-dimensional models. By increasing the detail (by changing the computer, of course), a good visual result was obtained, in which all the most recent special effects were implemented, with an always very high fluidity. However, don't expect miracles: everything smells of functionality and there is no room for excessive visual lyricism. It's probably for the best, since too many frills would have clashed with the seriousness of the product. The complete thematic encyclopaedia enclosed deserves a separate mention: a pleasant extra often present in this genre of games (enthusiasts really like reading technical sheets and getting to know curiosities). Speaking of multiplayer, it must be said that you can play in LAN and that's it. A little bit and, without ifs and buts, much more could have been done, from this point of view. Hardware boxes The minimum system requirements needed to run Iron Warriors are a 1 GHz Pentium III or Athlon, 256 MB of RAM and a video card from GeForce 2 upwards (amazingly, GeForce MX 2 and 4 and Radeon 7500 are also supported ). Obviously, to activate all the various effects present, so as to enjoy the good graphic rendering, it will be necessary to have at least a Pentium IV or an Athlon XP with 2.8 GHz, 512 MB of RAM and a video card from the generation of GeForce FX and Radeon 9xxx. Having said this, we cannot fail to point out how the game has presented many instability problems and graphic bugs on three different PCs (one armed with a Radeon 9200, one with a GeForce FX 5900XT and the last with a GeForce 7800GT) resulting, in some cases, even unplayable (how can we not mention the half black screen that accompanied us for a couple of missions?). It must be said that the minor problems occurred on the Radeon chipset, while on the other two we were able to start the game, but only after much tweaking and without obtaining, in any case, completely clean and bug-free executions (buildings that disappear upon suddenly, indicators of objectives that do not appear or that disappear without wanting to appear again, thus preventing us from completing the missions, plus many other bugs that we are not mentioning for the sake of decency). Obviously we hope that the problems listed above will be solved with one or more patches, but in the meantime we can only remove 5 points from the overall judgment by advising less experienced players to wait for the release of the various patches before deciding whether to buy it. Final comment Iron Warriors is a game dedicated to a specific slice of players who long to get their hands on a complex but not heavy simulator, which allows them to feel ~inside the medium~. The possibility of lightening the simulation through the settings could also attract other players who, however, should take into account some factors. First, they should consider the ~easy~ version of the game as a way up to the ~harder~ one. If you decide to play only in the simplified mode, you lose a lot of what the product has to offer. Secondly, if you are not willing to waste a few hours to understand all the mechanisms of the game, forget it ... For the rest, I am sorry to report the large amount of bugs present which often prevented us from playing at our best. We refer you to the hardware box to find out more, hoping for the prompt release of a repair patch. Pros Great simulation Fairly new war scenario Fun, once you master all the controls Cons Buggy If you don't like simulations, forget it Multiplayer mode doesn't exist The hard life of simulator enthusiasts The video game market does not exist (and has never existed) as a single and well-definable entity. In reality, it has always been a set of various more or less large markets characterized, above all, by individual reference targets. Alongside the mammoth (voracious, noisy and often insipid) square of the majors, there are smaller squares in which different palates are satisfied by the needs that often clash with those of the casual gamer. In one of these secluded, damp and dark places, simulation enthusiasts are looking for complex products that are able to reproduce ~reality~ in an ever more accurate and satisfying way. Do not think that this is a negligible and insignificant market; of course, it won't make the large numbers of the mass market, but it can still count on a large number of enthusiasts who manage to ~keep alive~ solid and active communities, well-disposed and, above all, very demanding. Iron Warriors T-72 Tank Command (from now on Iron Warriors) aims to satisfy an audience that loves pure simulation, faithfully reconstructing three different armored vehicles (the T-34, the T-55 and, of course, the T-72) employed in the Balkan war of 1991. However, trying above all to capture the taste of some neophytes, it allows to modify many parameters concerning the level of realism of the simulation which, if brought to a minimum, make the product very simple to manage (but also, frankly, much less satisfying).", "date": "2006-06-02", "grade": null}