{"name": "Hunting Simulator", "ref": "https://multiplayer.it/recensioni/185634-hunting-simulator-a-caccia-con-hunting-simulator.html", "text": "Of course, among the many simulators available in the world of video games, hunting cannot be missing, an activity which, when played on the screen, becomes a sort of sniper stealth game in which instead of the Nazis or the usual alien we find deer, foxes, cougars and bears. A few years ago there was also one where you could hunt dinosaurs. Hunting Simulator by BigBen Interactive fits into this tradition and does so by focusing more on content than on technical implementation, the result is a product with ups and downs, but if you like it and it leads you to shoot less at real animals, so much the better. On the hunt for variety From the content point of view, the Hunting Simulator offer is absolutely worthy of respect, a lot of different rifles, divided by type of prey, many ecosystems in which to hunt, a series of missions that lead the player to challenge each other with more complex, dozens of gadgets ranging from binoculars to infrared viewers, from weathervane dust to lures, passing through goodies such as artificial urine, essential for attracting some particularly difficult prey. Everything is unlocked as you progress, so as not to immediately crowd the player with dozens of options. Also from the point of view of the game mechanics there are some details that honor that ~Simulator~ of the title, such as evaluating the score based on the point of impact of the bullet in the prey, rewarding precise shots. To make things more interesting, there may be secondary missions in which you will be asked to eliminate other animals in addition to your goal, perhaps by aiming at certain parts of the body. If desired, it is possible to choose between several hunters, both male and female, but unfortunately this turns out to be only an aesthetic choice, given that there are no statistics relating to aiming, the ability to see the prey or the silence of the movement. Basically the game is based on the more or less constant repetition of the search area, find the prey and at the same time identify the ideal position to make a perfect shot. Many times we will have only one chance to make it, missing the shot in fact means scaring all the animals in the area and having to start from scratch, unless you are using the bow. Player movement tends to be very slow, which makes perfect sense for a hunting simulator, as it tends to be a walking, not a running activity, but this might annoy those looking for some action . The problem is that those who might appreciate the staid rhythm instead are driven out by some very important defects. If desired, there is also a multiplayer mode both competitive and cooperative, but the basic concept remains the same, only the prey to hunt increases. Playstation 4 trophies Hunting Simulator trophies are obviously related to the trophies you will collect in your hunting career. In most cases it will be enough for you to simply follow the single player campaign to take them home, however some particularly valuable prey will be particularly difficult to put in the game bag. The trophy that involves killing two birds with a single shot or the one in which you have to eliminate a prey without relying on the tracks could prove particularly difficult. We shoot zero Despite the amount of variables involved, Hunting Simulator shows its true nature after a few games. The ecosystems are undoubtedly many, but uninspired, full of pop-ups, with trees that are all the same and boring to explore. Everything feels rough and a bit sketchy, especially the handling of shadows, despite the use of Unreal Engine 4. The lack of jumping also forces players to have to go around even the smallest of twigs and looking for a high position it happens to find yourself faced with inexplicably insurmountable slopes. The behavior of the animals, for a simulator, is decidedly mediocre, we never see them drinking, hunting or interacting, they move in space as if they were ducks in a shooting gallery and their senses are easily deceived once you understand their range of motion. action, without having to use most of the gadgets available or the direction of the wind. Ballistics is quite elementary and only when shooting from a very long distance will it be necessary to calculate a parabolic shot, the rifles differ only in noise. The most absurd aspect, however, concerns the technical rendering of what should be perfect shots: when you press the trigger at the right moment, in fact, we were ~gratified~ by a slow-motion scene in which the shot starts from the barrel and slowly travels towards the prey , a por' as in Sniper Elite. The problem is that in most cases we see the shot that touches the ground a few meters from the lens and the animal that collapses dying anyway. From the point of view of game design we find the idea of inserting signals to clearly show the tracks left by the animals absurd, but only a generic indicator on the map for those killed to claim. The result is either you remember exactly where that rabbit was or you'll have to walk around for fifteen minutes to find it, especially in tall grass.", "date": "2017-07-04", "grade": "6.5"}