{"name": "Ultimate Epic Battle Simulator  un fallimento su vasta scala", "ref": "https://multiplayer.it/recensioni/185489-ultimate-epic-battle-simulator-ultimate-epic-battle-simulator-e-un-fallimento-su-vasta-scala.html", "text": "Imagine an immense battlefield on which two armies are about to face off: on one side thousands of Santa Clauses, on the other skeletons armed with swords and shields. The face-off is epic. No one seems to fear confrontation. The units advance proudly and orderly ending up colliding with a bang. It's chaos: dozens of dads fall to the ground, as many skeletons fall to the ground and... that's it, because they can't do anything else. At the end of the battle, the skeletons won. What used to be a luxuriant mantle of green grass is now a suffocating agglomeration of synthetic red jackets worn over the corpses of fat soldiers. Evil has won and next Christmas children will only receive swords as a gift. War between packs We imagine that many of you have asked yourself some questions while reading the previous paragraph. For example, since we're talking about a video game, some may have wondered what our role was on the battlefield. What army did we lead? Have we routed the troops? What tactical decisions were we able to make? Others will have started from further away and will have looked for footholds to understand the narrative assumptions, i.e. the reason why Santa Clauses had to fight against skeletons. Still others may have been intrigued by the lack of detail about the battlefield itself. In short, your starting point will certainly have been to consider Ultimate Epic Battle Simulator a kind of strategy, perhaps very simplified. Unfortunately you have fallen into a terrible misunderstanding and the answers to your questions are all terribly negative. Ultimate Epic Battle Simulator is almost a joke born as a phenomenon thanks to some youtubers who, after discovering it on Steam, made videos for us, giving it some popularity for a few days. In fact, to make a video of it, the Brilliant Game Studios title is fine: you choose the troops, set their quantity, place them casually on the battlefield and watch how they behave, directing their movements through the terrifying interface. Each unit, whether melee or ranged, has its own stats that determine the outcome of battles. The game editor allows you to customize them in various ways and that's all; apart from being able to move the camera to frame the action however you want, even taking the point of view of one of the units to fight directly. But don't expect anything engaging: the animations are bad and fighting just means pressing a key repeatedly hoping to hold out as long as possible. Direct control is such a poorly done feature that after a while you pretend it doesn't exist: the shots of the soldiers have no weight and, often, they don't even collide with the bodies of the enemies. It takes five minutes to realize that direct control has been added more as a sop than as a feature aimed at differentiating the gameplay a little. Not even taking a powerful unit like Chuck Norris (yes, he's there too, even if with the slightly mangled name) you can't fix the situation. Big army In short, the impressions we had while playing it a few months ago have turned into certainties, also because Ultimate Epic Battle Simulator has changed very little since then: it has gained units, it has become more stable, it has been slightly optimized and... that's it. The rest has remained the same: from the dull mechanics, to the unnatural behavior of the units. In fact, seeing an alleged battle simulator produce such mechanical, flat and anticlimactic clashes was the biggest disappointment, also because theoretically only this should do. Instead the developers focused on adding stuff and completely forgot about the simulation. Sure, watching large armies can be entertaining, especially if you can organize a decent battle, but it only holds up for a few minutes. Having exhausted the pleasure of making exotic troops collide in improbable scenarios, the interest quickly fades. If the picture doesn't seem disastrous enough to you, let's add another note: to make the most of the ~game~ you need a very powerful computer. In fact, Brilliant Game Studios makes a big splash about how it managed to leverage the Unity engine to handle battles between so many units. Too bad most PCs can't handle more than a few thousand on screen at the same time. In general, just go beyond two tens of thousands and Ultimate Epic Battle Simulator turns into a slideshow on most systems. Yet the troops are ugly to look at, much more than those found in the various Total War, forvia the lack of detail and clunky animations. Even the battlefields seem hastily made using low-quality resources. What will you ever have to brag about...", "date": "2017-06-30", "grade": "4.0"}