{"name": "Roguebook: recensione di un rogue-lite a base di carte", "ref": "https://multiplayer.it/recensioni/roguebook-recensione.html", "text": "The indie world offers us (once again) a card-themed rogue-lite. Let's talk about Roguebook, a new title from the authors of Faeria, another strategic card game focused on multiplayer. Roguebook, on the other hand, remains faithful to the single player and offers us a mix of well-known but well-mixed elements. So here is our Roguebook review. The book of fairy tales Roguebook: Exploration is based on tiles Like many rogue-like / lite, Roguebook does not offer a particularly elaborate narrative component. Our protagonists have been trapped by magic inside a book and, moving between the pages, they must escape its control. The context serves more than anything to give a structure to the game, which revolves around the idea of being inside a book. To move around each ~page~ (that is, the map of each chapter) we will have to use our brush, with limited uses, capable of making the boxes that surround us visible. By defeating enemies, we will obtain some units of ink, i.e. disposable objects with various effects (reveal a straight line, reveal a single square, boost the brush once...). Each map, from the beginning, shows us some points of interest (the boss, fights with enemies, treasures to upgrade characters, money...), so as to give us a direction in which to continue using our brush and our ink. Even being very lucky and using each object with maximum precision, it is impossible to explore every box of the maps, so we will always have to think about which points of interest to prioritize. By revealing boxes we will also be able to find extra hidden objects and prizes. Roguebook is based, like any rogue-lite, on luck, but the exploratory structure is free enough to allow us to decide in a slightly more strategic way how to approach our battles. Unlike Slay the Spire (probably the most famous game of the genre in recent years, from which Roguebook takes great inspiration), Roguebook does not force us to go through a specific number of encounters/events in order to reach the boss, but allows us to choose how much to explore. It is therefore always a question of a profit/risk ratio: is it better to try one more fight to get money (necessary to get new cards) or is it better not to risk losing more life points and face the boss with healthy characters? Rogue-lites tend to sometimes give us little control over the situation and, in case of bad luck, it's very possible to lose a run and feel ~cheated~. Let me be clear, this possibility is not lacking in Roguebook, but free exploration helps to make each event (also) a consequence of our choices, allowing us, for example, to heal ourselves when we need to, instead of only when we find a resting place. This formula is in our opinion better. Cards in hand The Roguebook shop is always accessible Of course, the focus of Roguebook gameplay is not exploration, but card battles. At the beginning of each game we will only have a handful of attack and defense cards in our deck, but we will be able to obtain new ones through a shop (always accessible) or through a series of chests that we will find on the map. Once the chest is opened, we will be presented with three cards and, by spending money, we will be able to get one. The cards, similarly to Slay the Spire, allow not only to attack or defend, but also to inflict altered status on enemies, enhance one's characters or even summon allies capable of attacking or using special abilities at our pleasure. As mentioned, in Roguebook we have ~characters~, in the plural. There are four of them (two starting, two to be unlocked by playing) and for each game we will have to choose two. Each of them has a unique deck, based on different effects. The human warrior is the most classic class, balanced in both defense and attack, often capable of executing multiple strikes. Then we have a toad, with more life points and a propensity for defense and powerful (and expensive) attacks. Then there is a rat, which has the Rage mechanic: taking damage loads a bar and when it is full it allows you to use an enhanced version of the card. Finally, there is an old turtle with very little health and the ability to fully heal once per battle. Each character has its own style and each possible pair can combine their effects in a different way. Roguebook encounters evolve similar to Slay the Spire There are also treasures that activate bonuses related to heroes, and gems that can be set in cards to give them additional effects. This customization is much cooler than a classic ~+1level to the card~: we have more control over the final effect and more customizations are possible. Speaking precisely of the clashes, they develop almost identically to Slay the Spire. On our turn we have a limited amount of energy and each card has a cost to use. We can see the intent of the enemy and, in the event of an attack, the exact amount of damage it will inflict on us. Progression and level of challenge Roguebook hosts events that donate prizes Initially, Roguebook is simpler than Slay the Spire, also because it adds more ~layers~ to the gameplay. By our third or fourth playthrough (a full run easily takes 90-120 minutes) we've defeated the final boss for the first time - at which point the ~real~ Roguebook is unlocked though. In fact, the game offers a series of modifiers (most of which can be unlocked by playing) that allow you to change the game in various ways, activating bonuses and maluses that change the cards on the table (we had to use this expression at least once, sorry ). Activating more modifiers increases the level of challenge and thus obtains a greater amount of ~book pages~. This is Roguebook's most important currency and accumulates between games. Pages can be spent to activate ultimate boosts, which make subsequent runs easier. We are talking about skills such as more life to characters, more chances of obtaining rare cards, but also new events that will appear on the map. Furthermore, depending on the performance, both in case of victory and defeat, we will be awarded a series of experience points which will level up the characters we have used. In this way we will unlock other cards and other treasures. Roguebook therefore offers a great sense of progression, so that even defeats feel worthwhile. The cost of upgrades does not increase as you play (unlike Rogue Legacy, for example), so even the less skilled can safely advance slowly, accumulating pages and becoming powerful even without winning every game. Roguebook offers a pleasant cartoon graphic style The cartoon graphic style of Roguebook is pleasant, literally fairytale. The creatures that inhabit it are varied, as are the environments. It certainly does not reach the unique and sumptuous style of Hades and does not exploit the strange trait of Slay the Spire, but perhaps this will be more pleasant in the eyes of many. In musical terms, the accompaniments are appropriate to the game and fade into the background as we focus on our next move. Finally, we point out that Roguebook offers the translation of the texts into Italian, with the rare dialogues in English.", "date": "2021-07-12", "grade": "8.0"}