{"name": "Rush for Berlin - Recensione", "ref": "https://multiplayer.it/recensioni/rush-for-berlin-recensione.html", "text": "<strong>Rush for Berlin</strong> is the perfect choice for you. one of the games that don't make you regret the money spent on the latest video card The explosion of the bridge that isolates our American soldiers is spectacular: Nazi reinforcements will arrive shortly Free dogs and pigs S.W.I.N.E., released in 2001, was Stormregion's debut title. To pay homage to its players on the occasion of last Christmas, the software house decided to make the full version downloadable for free on December 20, 2005. In the following two weeks, over one hundred thousand enthusiasts took advantage of this unmissable opportunity. For those interested, we refer to this BitTorrent link. All on Germany The single player section is made up of four campaigns, structured in turn by a series of scenarios that retrace the historical course in a not completely realistic perspective. In fact, to keep the interest of the players high, it was decided to ~revisit~ some battles; and so, while the impetuous descent of the Red Army up to the conquest of Berlin takes place approximately as in reality, the Allied, German and French campaigns are of a very different tenor. Just think, for example, that at the helm of the Americans you will still find yourself bogged down near the Reno river on the threshold of 1946. Moving on to the actual gameplay, let's analyze here a real-time three-dimensional strategy game, where the player, starting with a battalion, must complete primary objectives (there are also optional ones, which allow access to some special units) to continue in subsequent missions. As in Ground Control, RfB's muse, the collection of resources is missing, and the only element to deal with is time, given that certain maps must be completed within the established deadlines. [C] Many details are purely aesthetic, but give the game an exceptional atmosphere A blast furnace in the Caucasus, among the crucial points for the Third Reich's attack on the Soviet Union [/C] Strategy in power From the moment in which the strategic aspect greatly prevails over the managerial one, it is clear how even the single unit can be fundamental in the outcome of a battle. Each move must therefore be studied carefully, and to help the player in the task it was decided to allow the action to be frozen. Anyone who has played one of the two Panzers knows that in those titles there was a figure, that of the officer, whose safety had to be preserved to avoid the failure of the mission. In Rush for Berlin these champions continue to exist, but this time they are distinguished from the rest of the units by particular and very useful powers (see the Russian marshal's double vodka ration!) and without which winning does not become impossible, but it is certainly much more complicated. ~The atmosphere at the Maracan&agrave; is on fire...~ You also have to move the carts carefully, otherwise you risk traffic jams like this one Computer postponed to September The war scenarios are among the most diverse and range from the snowy Russian plains to the uninhabited villages of the Black Forest, passing through the cities left in ruins by the fleeing Germans and through mountain passes dotted with trenches. These are not purely aesthetic distinctions, because depending on the terrain and altitude, the troops receive modifiers that can prove vital. The interaction with the environment is remarkable and it is possible to occupy bunkers, turrets and anything else to provide extra points of attack and defense for the troops. The most important cities have also been made recognizable by characteristic elements that make the game even more fascinating. Unfortunately, what is historically an Achilles heel of Stormregion titles, is to counterbalance things, namely the poor artificial intelligence. There are moments, basically during the execution of the scripts, in which one gets the impression of having to deal with difficult enemies; in reality the feeling is that, when it comes to fighting head on (this happens above all in skirmish mode) the computer-controlled soldiers let themselves be shot too easily, barely exploiting the shelter points made available by the map. Some missions take place at dusk, others at night. The refuge of the Russian partisans is delightful Suggestive views abound at every corner, like this splendid waterfall Show of strength In the usual style, Stormregion has also included a gem in the demo version of Rush for Berlin. In the map available, which sees the Germans grappling with a counteroffensive of the Red Army, there is an obligsecret project which, if completed, gives access to the Panzerkampfwagen Maus, one of the special units. Owners of the full game will be able to include this scenario by simply copying it to the root directory, thus expanding the axis campaign. From us a sincere compliment for the choice of excellent taste. Excellent audio and video departments From a technical point of view Rush for Berlin uses an updated edition of the Gepard engine, the same one used for Panzers. The engine is certainly effective and, although it is not very scalable, it gets along well even with systems that are not exactly avant-garde. Touches of class can be seen almost everywhere: as you approach with the camera, you will even discover the high voltage wires swinging in the wind, not to mention the splendid animations of soldiers and armored vehicles, or the extraordinary creation of water, where the third version of Pixel Shaders allows you to recreate breathtaking landscapes, as evidenced by the screenshots accompanying the review. Among the defects we point out once again the limited output zoom and the presence of some bugs (the release provided to us is 1.00) which prevent, in certain maps, from activating some special effects, otherwise many polygons will disappear. Finally, we recommend a good amount of RAM to avoid continuous access to the hard disk in the most agitated phases. The audio department achieves considerable marks: in particular we appreciated the sound effects - those with an advanced speaker system will greatly enjoy listening to the explosions - even if music and speech (the game designers confirmed the line of the original language , depending on the faction) could be repetitive in the long run. The home screen is well made and made in the style of the twenties One of the FMV scenes that tell the story of World War II from different points of view Concluding reflections The absence of the now obligatory scenario editor is regrettable, and decreases the longevity of a game that finds one of its strengths in the multiplayer mode. A maximum of six players can be challenged at a time using the local network or the servers made available by Gamespy; there is also the direct IP. In conclusion, Rush for Berlin, continuing in the successful line already undertaken by the programmers, hits some goals while missing others. Naturally the graphic aspect and the refinement of war tactics make it the best of the saga, but they are not enough elements to unleash the enthusiasm of which the first Panzers was capable. The explosions are both visually and aurally rewarding An Axis controlled bridge; let's try to conquer it with air reinforcements Final comment Rush for Berlin is an excellently made game, whose beautiful graphics will certainly manage to captivate the attention of many players. Unfortunately the repetitiveness of the proposed themes, combined with other flaws of no small importance (such as the poor AI and the low longevity) make it advisable only to fans of the genre. For everyone else it is a choice that - perhaps - may not be spot on. Pros Technical realization Strategic depth Variety of scenarios Cons Poor AI Lack of an editor Almost no originality Different name, same substance Rush for Berlin is the fourth title from the Hungarian developer Stormregion: curiously we are not facing, as might have been expected, the third and final episode of the Codename Panzers saga (thanks to which the programmers have achieved popularity) but the name change must not mislead, from the moment in which - as easily understood - the main theme of the game is once again the Second World War, this time analyzed in the final stages, that is to say during the cross-attack that the Soviet Union and the Atlantic coalition launched on the Third Reich. With such an inflated argument, the line between a well-made game (which we have always been used to in the Stormregion) and a classic is very thin. We immediately anticipate that Rush for Berlin fails in its attempt to write an indelible page in the annals, even if it is, in the end, very pleasant.", "date": "2006-06-02", "grade": null}