{"name": "Get Even: il labirinto dei ricordi", "ref": "https://multiplayer.it/recensioni/183485-get-even-get-even-il-labirinto-dei-ricordi.html", "text": "The password for Get Even? ~Unusual~. Seriously, we're talking about a game that in some ways is half a miracle: a minor project by the Polish studio The Farm 51, known for Painkiller: Hell and Damnation (and little else), which managed to get noticed and published by a large company like Bandai Namco despite being anything but a commercial game. Not only that, the Japanese giant has continued to support the developers even in a difficult moment of creative block, managing to bring the job to fruition with the help of an expert producer and some additional resources. However, Get Even is not an atypical videogame only for the events that led to its birth: it is a product far from the first-person titles we are used to, which ranges between various genres and tries to offer the player an experience full of tension and strong emotions, relying on a ramified narrative and painstaking study of sound. We have played it thoroughly these days, after trying it at various events, to understand if the young software house had actually managed to create something memorable. The answer can be found as usual below, but it is significantly more complex than a simple ~yes or no~. Red and black The beginning of Get Even sees you in the role of Cole Black, a rough ex-mercenary engaged in the rescue of an unspecified victim of a kidnapping. On paper it's your typical movie hero mission: neutralize the mercenaries, save the girl, reap the glory... but something goes wrong. Cole wakes up immediately after the accident, with no memory and in a place he doesn't recognize. The place where he is is a madhouse, and the only voice to guide him between the claustrophobic corridors and the crumbling walls of the buildings is that of a mysterious doctor who says his name is Red. Except that our ~guide~ also claims that Black's presence in that horrible place is intentional, and that it's all part of a specific ~treatment~ whose ultimate goal is to make him regain his memory. You don't have to know more of the premise, apart from the fact that Red's plans coincide with the use of a highly advanced viewer called Pandora - capable of reviving memories as if it were a simulation in virtual reality - and that these will bring the player to get lost in a very complex tangle of events, with more than a few surprises waiting for him. The narrative of Get Even, indeed, is not an impeccable example of a script: it has ups and downs, and many of its twists and turns are extremely predictable (also because there are scattered clues to understand what is happening). The epilogue, however, is very satisfying, and the slow and staid progress of the events is sufficiently strengthened by the environmental narrative and the careful search for clues not to tire. All in all, Farm 51 nailed the plot, and the impact they failed to get from the dialogues they pulled out of the sound, as Get Even boasts an absolutely outstanding sound design. The multifaceted composer responsible for the music of the game, Oliver Deriviere, has in fact taken care of the music and effects in a manic way, coming to blend them with the events with impressive naturalness. Sound clues populate all levels, while the music gradually becomes more oppressive as you get closer to an important event: most of the emotions that the game manages to stimulate in the player come from this element, and there is very little to criticize (perhaps just a few moments a little too extravagant). I don't want to use that gun If it is true that both story and sound are top of the range, however, the same cannot be said of two other equally important factors: gameplay and technical sector. As previously mentioned, in fact, Get Even is a hybrid title, which combines exploration and investigation with shootings of various types. You'll spend the vast majority of the game walking around, solving (pretty basic) puzzles, and using the various functions of your cellphone, which contains a scanner, map, ultraviolet light, and infrared viewer, but it all breaks down the moment you need to make use of pistols, due to mechanics that are anything but filed. In fact, in firefights the artificial intelligence often proves atrocious, and when it does not move in foolish ways it crashes into the obstacles of the maps or stops in cover waiting for death. Not only that, the feeling of the weapons is bad, unstable, with enemies that fall apart after a couple of shots, and can sometimes kill you just as quickly without warning. A real shame, because the team at least tried to make it very original, with the introduction of the Angle Gun -a curious weapon capable of bending sideways and firing accurately from any cover - and additional mechanics related to the Pandora viewer that can be used in the final stages of the adventure. Without quality mechanical bases, however, this originality is not enough. To be honest, the clashes would also be largely avoidable, so much so that the game tries to push towards the peaceful approach (some events change based on the violence of your actions and moral choices made during the advancement). Yet the stealth phases aren't much better, partly due to the positioning of the enemies and partly due to the annoying need to constantly switch from the map - where you can see the opponents' vision cones - to the scanner to ~shape~ some covers and passages often essential to move undisturbed. The path of the mind Not always very generous checkpoints only make certain sections even more irritating, despite a rather permissive general difficulty, and it is undoubtedly a serious problem when in a videogame that tries to overcome the typical conception of the ~walking simulator~ the worst parts are precisely those in which is played. From a team that has already worked on shooters we certainly expected a little more skill in this area. The last element that partially ruins the experience is the technical one, because the PlayStation 4 version we tested unfortunately gave us very little satisfaction. We specify: graphically Get Even is not bad, thanks to real locations recreated through precise scans and realistic three-dimensional models that sometimes make a damn impression. Textures aren't particularly detailed though, the polygon count is far from impressive, and on consoles the game struggles abominably to maintain a stable frame-rate. Especially in the final phase, then, we noticed heavy drops (with some short freezes that worried us a lot), as well as a handful of naive bugs that sometimes forced us to restart from the last checkpoint. In the PC version we tested in the past the problems were certainly minor, but the visual impact of the game does not justify these kind of hiccups on consoles. We close with the longevity: Get Even is not a particularly long-lasting experience, although there is a certain emphasis on collecting clues and it is possible to replay the various stages to discover various secrets significant to the story (related to the changes we were talking about earlier). You will finish it in five or six hours at the most, but this is the right duration to avoid the experience being stale. The title's low price justifies the time needed to complete it.", "date": "2017-06-21", "grade": "7.5"}