{"name": "Ghost Recon Wildlands - Fallen Ghosts", "ref": "https://multiplayer.it/recensioni/184966-tom-clancys-ghost-recon-wildlands-fallen-ghosts-ghost-recon-wildlands-fallen-ghosts-gli-ultimi-fantasmi.html", "text": "Having archived the ~caciarone~ atmospheres of Narco Road and its variations on the theme of gameplay, with solo rather than group action, Tom Clancy's Ghost Recon Wildlands returns to the original system with Fallen Ghosts, the second and last expansion of the Ubisoft title . The setting is again that of Bolivia, but the events take place after the conclusion of the original campaign: the formidable El Sueno and his organization have been defeated, but as often happens, the elimination of a regime leads to the birth of a new one. dictatorship. And so the Unidad forces effectively handed over the Bolivian territories to a group called ~Los Extranjeros~, if possible even more ruthless and cruel than the Santa Blanca. Its members have taken control of the cities, enslaved many of their inhabitants and imposed their will with unspeakable violence, even discovering the location of the CIA agents present in the country. The Ghost team must therefore return to the place and try their hand again with the progression that characterized the campaign of the base game, completing a series of missions to eliminate three lieutenants and finally reach their implacable commander, Colonel Juan Ignacio Merlo. Return to Bolivia While not having disdained the intention to change the cards on the table with Narco Road, net of missions that weren't always well done and an approach that perhaps distanced itself too much from the typical mechanisms of Ghost Recon Wildlands, it is clear from the first minutes how Fallen Ghosts has hit the mark, delivering fans of the Ubisoft title a solid and coherent, as well as quite demanding, package. It is possible to try your hand at the new story even without having completed the original campaign, given that a special profile is created and you already start at level 30, with all skills upgraded to the maximum and a new tree introduced specifically for the expansion. with level cap raised to 35. Using the experience points earned on the field it will in this case be possible to improve the capabilities of the drone, which will become able to attack enemies directly or at least stun them, unlock the explosive bolt for the new crossbow (an instrument silent but also disruptive if desired) and finally further improve the capabilities of the Ghosts. All things that we will definitely need, given the absolutely not to be underestimated degree of challenge of the missions of this DLC: welcomed by anti-aircraft fire during our helicopter return to Bolivia, we will first have to free a CIA agent held prisoner by Los Extranjeros and then coordinate with him the various operations, which once again include main and secondary events. Playstation 4 trophies There are seven Trophies included in Fallen Ghosts and it is not very complicated to obtain them, given that you have to eliminate the various types of enemies that make up the ranks of Los Extranjeros, kill ten camouflaged soldiers with a knife, complete all the missions and so on. A new challenge In Fallen Ghosts we will often find ourselves facing very complicated situations, in which we have to clean up an area invaded by enemies or resist for a certain period of time, while waves of hostile soldiers try to kill us. It is possible to use the synchronized strike to clear the areas from a distance according to the strategic approach, but a little too simplistic, which characterized the campaign of the base game; counting, however, on a fully powered drone and therefore equipped with infinite autonomy and a wide range of action. However, when there is a need to barricade oneself and resist, this technique cannot be implemented and one finds himself trying the missions over and over again, perhaps scattering the map with mines and hoping that civilians do not trigger them by passing by and ruining our painstaking planning work. To make things more difficult, some new types of enemies take care of it in particular: the enhanced snipers, who can send us to the ground even with a single successful shot; soldiers equipped with advanced camouflage, literally invisible except with thermal imaging and immune to synchroblast; enemies equipped with jammers, which disturb the drone signal but not only; and finally the armored, wrapped in heavy armor that makes them virtually invulnerable, except for the head. Dealing with these categories of opponents, especially all together, is not pleasant at all but it stands as the ideal crowning glory of the Ghost Recon Wildlands experience: a final challenge worthy of the name.", "date": "2017-06-19", "grade": "8.0"}