{"name": "Gas a martello con MotoGP 17", "ref": "https://multiplayer.it/recensioni/184822-motogp-17-gas-a-martello-con-motogp-17.html", "text": "MotoGP 17 presents itself with a very difficult task to complete: on the one hand it is the chapter of the return to origins after last year's yellow hangover which saw the undisputed protagonist Valentino Rossi, while on the other it is a title that bridge to an epochal passage for Milestone ever closer to divesting its current proprietary graphics engine to switch to the more versatile and performing Unreal Engine 4. Two extremely delicate and thorny aspects, which could discourage players even before taking the pad in hand. Yet the guys from the Milanese software house exude passion for two wheels and their latest work is a clear demonstration of it. Without touching the peaks of the series, we anticipate that MotoGP 17 has not left us disappointed at all. Self manager The real novelty of MotoGP 17 is the arrival of the managerial career which allows us to lead a team in the world championship while at the same time covering the role of official rider and owner of the stable, thus managing every aspect concerning the activity even off the track. But let's go in order. Once the team has been founded, we will proceed to register for the Moto3 championship by tackling the pre-season in fervent market sessions to put together the best possible group with the - few - credits available. Once the bikes and sponsors have been chosen, it's the turn of the two riders: as mentioned, the player will also play the role of rider within his team, but it remains to choose a teammate from a handful of promising prospects in which to invest for the future seasons. Hence the first more managerial aspect of the mode that will see us constantly keep an eye on the performance of our box mate who, being always controlled by artificial intelligence, will gradually improve thanks to training and the development of the bike. It is indeed a role-playing production: at the end of each race, each driver improves attributes such as braking, acceleration control, cornering ability and body position, which make control of the vehicles easier and more natural as the seasons go by and improve the performance of our drivers. In this sense, the freedom is very wide thanks to the possibility of investing the credits earned at each race thanks to sponsors and placements in various aspects by the team such as the Research and Development department to directly improve the bike by developing new solutions for the engine, frame , suspensions and brakes, up to the track engineers, engine engineers, telemetrists who help set up the bike during the race weekend. Then there are a large variety of figures who deal with marketing, community management, PR, but also cooks and athletic trainers who help riders improve performance on and off the track with a system of investments and weekly revenues that will have to be managed best to avoid being broke. The season is made up of the 18 official races scheduled this year, and it is a pity that the winter tests and the various sessions scheduled in the season are completely missing which would have been a very welcome addition in terms of realism to allow us to have a few weeks in more in which to work on improvements to the bike. Between one race and another we will have to divide ourselves into a series of extra activities, such as a photographic session for the sponsor from which to earn extra credits, staff refresher courses, autograph sessions to consolidate our precious bond with the fans, or workouts in the gym that reward us with bonus experience points. Playstation 4 trophies MotoGp 17 offers 36 trophies, of which 16 bronze, 15 silver and 4 gold as well as the ever-present platinum. Without too many surprises, to get them all it will be necessary to excel in all modes by climbing the rankings up to the conquest of the MotoGP world championship, both in a pilot and managerial career, as well as completing a good number of online races. Ups and downs In short, MotoGP 17 amazed us with a truly articulated and multifaceted mode that will certainly satisfy the management goals of the most passionate, offering an experience and a game structure that is certainly more satisfying than a simple racing career. The goal is not only to climb the rankings to the sound of won world championships to dominate the premier class, the Moto GP, but also to keep our teams active and successful in the minor championships by hiring riders, mechanics and staff to get the best results. While manager mode adds a nice amount of depth to the usual rider career, MotoGP 17 feels heavily.I detach it from last year's chapter in terms of content and variety of game modes. Milestone's latest title therefore lacks that overwhelming amount of content and variety to which Valentino Rossi had accustomed us: The Game which alternated rally and flat track training sessions with two wheels, with the season culminating with the Monza rally and the team Endurach. In addition to the career mode, which sees the addition of the Red Bull MotoGP Rookies Cup which last year was a separate DLC, it is possible to organize entire championships or single Grands Prix of different categories, ranging from the MotoGP classes up to the old 125cc and 250cc two-stroke, passing through the 500cc 2 and 4-stroke and of course the Moto2 and Moto3 categories of the current championship. It's a pity that there is no historical event mode like last year's which, despite being entirely focused on the champion from Tavullia, represented an excellent diversion between one race and another. As usual, thanks to the agreements between the Italian software house and Dorna, everything is completely licensed and faithful to reality, from the riders to the bike liveries, complete with trackside sponsors and official nomenclature of the grand prix for the delight of any enthusiast of motorcycling. For individual Grands Prix, various options can be determined such as the number of laps, the type of session (single race or with free practice and qualifying), the weather (clear, cloudy, rain), damage, disciplinary flags, consumption tires and so on, to the advantage of personalizing the experience. Similarly, it is possible to intervene on the bike by modifying the physics to have different degrees of difficulty in controlling the vehicle. Options are the same as last year, with Pro Physics disabling brake assist, joint brakes, assisted steering and automatic transmission, drastically changing the driving experience. Riding a powerful MotoGP bike requires great precision in interpreting the curves and managing the throttle since they tail violently, rear up and run wild if you don't choke the accelerator and brakes carefully. MotoGP eSport Championship MotoGp 17 also marks the debut of the official eSport championship organized by Dorna with the support of Milestone. Between now and the end of the MotoGP season, players will be called to challenge each other in five online competitions with the aim of qualifying for the final which will take place in November directly from the Valencia circuit in conjunction with the last championship race. The event will obviously be broadcast live by Dorna Sports' television partners. Specifically, the MotoGP eSport Championship will be exclusive to PlayStation 4 players and will be divided into 7 online events, each of which will take place on a specific track under the command of a specific rider. The 16 fastest players will then be invited to the live event in Valencia, and will have the chance to battle to take home a flaming BMW M240i. Waiting to see how the competition unfolds, that of a giant like Dorna remains an important signal for eSport in general which increasingly attracts the big sports brands to invest in the virtual counterparts of their competitions. Under the helmet New year, same refrain: the aspect that most shows the side in the entire Milestone production remains the graphics engine which has undergone a series of improvements and refinements, but which is still not fully convincing. In the year in which Milestone switched to Unreal Engine 4 with MXGP 3, MotoGP is forced to wait another season bringing with it all the pros and cons of the case. A pro for the Milanese software house is certainly that he has worked on an engine that he knows inside out, reaching this year the coveted goal of 60 frames per second stable in all conditions, bringing a substantial gain in fluidity in setting the trajectory. The glance is also cleaner and more refined, with motorcycle and rider models dominating thanks to meticulous textures that reproduce every detail, from the logos on the overalls to the design of the helmets. The outline always suffers, from the bare and square grandstands of the circuit to the few elements on the edge of the track, things that, it is clear, also take a back seat when you are speeding along the straight at more than 345 km/h approaching the braking point of the San Donato on the Mugello hills. It is more difficult to postpone the pre- and post-race, which sees each grand prix introduced by a skit that is always the same in the desolate team pits, followed by the closed park in which the award ceremony and the podium party are still missing. The animations ofthe riders on the bike have been further improved by mirroring the riding style of the most famous riders, recognizable by their attitude on the circuit. Similarly, a step forward has also been made in the behavior of the riders on the track, now more precise in their trajectories especially when overtaking, but there is still a certain willingness to leave the position without hindering us with too much conviction. Let's suppose that the cause of this behavior is the absolute will of the development team to avoid any kind of contact between the player and the pilots controlled by the artificial intelligence due to a rose water collision system that manages doors and impacts in completely unsatisfactory way. Sometimes we end up on the ground for nothing, other times it will be us who literally make our opponents fly off the bike, easily conquering the position and making them sink to the bottom of the standings, especially in the most agitated phases such as the start. In the same way, the trajectories on the track are rather free given that there is no real management system for the rubberized asphalt with the consequence that the grip is good at any point on the road surface, losing itself completely once the lateral white line has been passed . The audio test was positive, with Milestone who for MotoGP 17 decided to resample all the bikes on the track and take advantage of a digital reconstruction system that makes the scream of the engines much more alive and vibrant than in the past, especially when the bends follow one another and gear changes are close together. The soundtrack does not hit the mark, while we find the usual Guido Meda carrying out his task with great enthusiasm in the pre-race.", "date": "2017-06-15", "grade": "7.7"}