{"name": "Tornare a Vvardenfell con The Elder Scrolls Online", "ref": "https://multiplayer.it/recensioni/184208-the-elder-scrolls-online-morrowind-tornare-a-vvanderfell-con-the-elder-scrolls-online.html", "text": "After reviewing it first in the PC version and then in the PlayStation 4 version, we had lost sight of The Elder Scrolls Online a bit. In the meantime, the developer ZeniMax Online - we remind you that Bethesda is only the publisher - has employed some stratagems to save his MMORPG set in the universe of The Elder Scrolls from the end that all games of the same genre ultimately do, apart from a certain tronista and an unsuspected Japanese competitor. The first was to remove the monthly subscription, more or less at the same time as the console launch which gave the experiment greater visibility. Subsequently, The Elder Scrolls Online has been updated and improved on several occasions, conquering a niche of enthusiasts who may not have found the sensations experienced in the original adventures, but who may have met new friends and lived equally unforgettable experiences. After all we are talking about a multiplayer title, but the contradiction of The Elder Scrolls Online has always been there, an experience that struggles to find a meeting point between the atmospheres of the originals and the somewhat alienating drift of MMORPGs. Morrowind, the first ~expansion~, focuses on nostalgia and on the single player experience, addressing right from the title to those fans who have never forgotten Vvardenfell and its inhabitants. A Warden among us We mentioned a significant detail when we wrote that we had lost sight of The Elder Scrolls Online: in fact, we approached the Morrowind expansion just as the guys at ZeniMax Online would have liked, who developed it with sheep returning to the fold and to new players attracted by the branding or subtitle reminiscent of The Elder Scrolls III. Once the expansion is installed and the client is launched, in fact, you can start playing Morrowind right away. While many MMORPGs force players to reach a certain level before entering the territories of expansions - this is the case of World of Warcraft and Final Fantasy XIV, for example - The Elder Scrolls Online maintains a diametrically opposite setting thanks to the One Tamriel system implemented some time ago. This feature basically scales the difficulty of PvE around the level of the player who faces it, so it is possible to undertake any mission in any area and in any order you prefer, knowing that the rewards and challenges will always be up to you. One Tamriel has incredibly benefited the adventurous spirit of The Elder Scrolls which in its online derivation had remained buried under the patina of a generic ~theme park~ type MMORPG. Therefore, fasting with updates and various balances, we began our adventure in Morrowind right from Seyda Neen, the small port where it all began in 2002. Obviously we started a new character, choosing the class added by the expansion, i.e. the Warden: this is a hybrid character who does not particularly excel in any role (tank, attacker or healer) but who can still play them all thanks to his three distinct and separate skill branches. Animal Companion allows you to attack targets with animals that the Warden can summon, even if not all the spells seemed particularly effective to us and the final one, Feral Guardian, suffers from the age-old problem of The Elder Scrolls Online pets: it is unreliable. Green Balance is the branch dedicated to healing spells that use nature as a choreography; finally, Winter's Embrace uses frost as a weapon and as protection, making the Warden even more dangerous. We had fun playing the class during the campaign: it seemed extremely versatile for the solo experience and a little less on the few occasions we played together with the others, but maybe that's right since it's for the It is precisely a classy all-rounder. In terms of complexity and dynamism, however, we expected something more, but the fault is also the combat system of The Elder Scrolls Online which has changed little or nothing compared to the past. If you didn't like it before, the Warden won't change your mind. An underexpanded expansion The campaign designed by the ZeniMax Online guys made us go up and down a Vvardenfell which, we recall, isn't exactly the one explored in The Elder Scrolls III: The Elder Scrolls Online expansion is set around seven hundred years earlier, so the hardcore fans of the series will find some small but tasty differences. The city of Vivec, for example, is still under construction, and in fact Vivec himself will be the one to entrust us with an important task: to find out who ista slowly draining his godlike powers. It is a mission that does not spare twists and puts the spotlight on one of the strengths of the game, namely the dialogues - albeit a little too long-winded - and the screenplay. The missions are almost always interesting and conducted through fully voiced eccentric characters, but the most important thing is that the main questlines, despite taking place in different places, often end up intertwining and describing even better the setting and the delicate power games in which she is entangled. Those who do not speak English well will find it difficult to follow the threads of the speeches, of course, and no Italian translation is foreseen. Unfortunately, however, the campaign does not last very long, and is completed in about twenty hours, especially if you spend little time exploring (which is very wrong given that the peculiar setting of The Elder Scrolls Online actually encourages you to scour every corner in search of less visible missions or hidden Skyshards). The problem with this expansion is that within a few hours you realize that it has very little ~expansion~ in it, if only if you are used to the concept of expansion as many other MMORPGs have presented it to us over the years. Once the campaign is complete, in fact, you can go and explore the other regions of Tamriel in search of missions, dungeons and other activities, perhaps moving towards an endgame made up of raids, mega bosses and other group challenges as usual. Alternatively, Morrowind implements a new form of fast-paced PvP that counters the more complex one that takes place in Cyrodiil. In the new Battlegrounds, three teams of four players each compete; all in all, the idea is interesting and allows you to play quick games when you have little time to devote to the rest, but ZeniMax Online absolutely needs to take a look at the balance because the better equipped players literally make meatballs for everyone else, making the very frustrating experience. PvP in the Battlegrounds in a certain sense once again expresses the problem that The Elder Scrolls Online has always had, and that is to seek a compromise between the way we now idealize the franchise and what its online incarnation actually is. A real dilemma that, we suspect, will put into crisis especially those players Morrowind tries to address using this subtitle: crossing the threshold of Vvardenfell after so many years, in the new graphic design of The Elder Scrolls Online, could be a magical moment, but the The spell will inevitably break as they find themselves surrounded by bouncing players, all convinced they are the only heroes Tamriel needs. +60", "date": "2017-06-09", "grade": "7.0"}