{"name": "Old Man's Journey", "ref": "https://multiplayer.it/recensioni/184107-old-mans-journey-old-mans-journey-o-il-viaggio-di-un-vecchio-demiurgo.html", "text": "There is a moment in life when you feel the need to embark on a journey, and that moment does not mean that you arrive at a stage where you have the physical capabilities to face it, but this is precisely the beauty of it. When a certain letter is delivered to the old man from Old Man's Journey, the ordinary bearded hero does not hesitate for a moment: he takes his backpack and stick and sets out on a long journey that leads him to cross mountains, plains, cities and hills to reach his goal , without caring too much about the physical condition or the means of transport chosen (in this case, the feet). A bit like in A True Story by Lynch, in which the old Straight crosses Iowa aboard a lawn tractor at the crazy speed of 8 kilometers per hour, the protagonist of Old Man's Journey does not pose many problems by setting off and the world around proves to reward his determination. If physical prowess does not put him in a position to climb mountains and cross impervious obstacles, then the surrounding scenery will bend to his will, allowing him an easy passage towards the mysterious finish line, as if to respect the inexorable gait of his steps, timidly acting as part. There is a pervasive hermeticism to this game and a sort of latent sense of ineluctability which clashes charmingly with the bright and colorful depiction of the beautiful scenery. What is written in the letter received from the old man? Why embark on the journey? Why, above all, is his path so important as to move mountains in order not to be interrupted? One would think that these questions are too prosaic to find a clear answer in this story, all we can do is comply with the old man's wishes and accompany him on his journey, which becomes a life path and memory with a powerful symbolic charge. The old demiurge Each screen of Old Man's Journey is a small work of art, designed with a light touch and dreamy style, always staging new settings in the path of the old. Each one is, in fact, also a single level of the game, which offers puzzles to be solved in every beautiful glimpse of the journey: the aim is to make the protagonist reach a specific goal, modifying the conformation of the environment, lowering hills, creating new ones and trying to align the plane where the old man is located with the place to reach, according to the fundamental principle of finding the shortest way between two points. It is not always that simple, however: continuing through the levels, the puzzles become more stratified, and although the form of interaction remains substantially the same, i.e. touching and dragging elements of the scenario to change its structure, further objectives gradually emerge to be completed, such as moving vehicles, getting trains to their destination, moving sheep, clearing the way for other characters or objects around the screen. The basic mechanics therefore remain the same but the effects of this vary and become more complex and multifaceted. Some glitches in the screen tap registration system can break the idyll, making solving puzzles a bit frustrating when you can't get things to go exactly as they should, however these are minor flaws. Once the various puzzles have been completed within a screen, the old man often lingers by observing some characters or elements of the scenario, starting memories that essentially tell his story through cutscenes and reveal the life of the protagonist piece by piece and the mystery underlying his journey. These are moments that are also simple but full of meaning, enriched by this particular graphic style that mixes almost impressionist solutions in the use of colors and lights with a naive trait that is perfectly associated with the general atmosphere of the game.", "date": "2017-06-08", "grade": "8.8"}