{"name": "Corse senza futuro con Formula Fusion", "ref": "https://multiplayer.it/recensioni/184115-formula-fusion-corse-senza-futuro-con-formula-fusion.html", "text": "The futuristic racing game Formula Fusion is the brainchild of some former developers of Psygnosis / Studio Liverpool, the team definitively closed by Sony in 2014 to which we owe titles such as Armor Geddon, Benefactor, The Killing Game Show and the WipeOut series. More than two years ago it became the subject of a successful Kickstarter campaign, which bodes well for its future. In short, the optimism surrounding the project was great, the names involved had (and have) an excellent pedigree, the genre had been lying abandoned for years and there was a great demand for something new. What could go wrong? Hard to say exactly, but the final version of Formula Fusion is far from the title that many hoped for. In reality, there has certainly been a determining factor, and it is also the one that helps to understand why the game seems to be closed in a hurry: the low sales of the Early Access launch. We are talking about less than ten thousand copies. Our theory is that the lack of success first crippled it, then scuttled it, forcing the developers to close it permanently without making all the refinements that were planned. For this many aspects seem simply unfinished, in some cases even crude. Not a beautiful presentation, is it? But let's go in order. The difficulty of learning Formula Fusion tutorial, where are you? You don't actually exist. It's a big problem? No, after all we are talking about a classic racing game, so once you understand how the controls are configured and what the different functions are, you can play without problems. Having said this, however, it is clear that the lack of any video or text that explains the basics of the game makes the start slower than it should and immediately brings to mind that sense of incompleteness we were talking about above. Was it really that complicated to explain how the vehicle configurations and different modes work? Going out on the track and experimenting a bit, we understand that each vehicle (five in total, customizable with various skins) has three different styles of equipment, that we have a health bar and a shield bar, which can be restored by collecting bonuses the shield or use one of the weapons available (two for each configuration), which accumulates the turbo while running and so on. However, having overcome the initial hurdle, one gets the impression of being faced with a large WipeOut clone: the vehicles are well modeled, the tracks, although few (there are only eight, albeit with some variations) have an interesting design, the there is a sense of speed and the first races of the career mode run smoothly. Unfortunately, looks can be deceiving and the more you play, the more you realize that there isn't a single aspect of Formula Fusion as polished as it should be. Take for example the vehicle configurations, some of which are almost completely useless in most situations (hitting a running opponent is a feat worthy of a sniper), or the races themselves, few in number and often lacking in bite due to a very cunning artificial intelligence since the lower class races, which however maintains a standard behavior for the entire game. To be honest, it is the gameplay as a whole that does not offer memorable moments, being in a certain sense uniform from the first to the last races. It is sadly evident that there are no alternative modes to the few implemented (six in total). It will seem paradoxical to you as a statement, but one of the defects of Formula Fusion is that you just run: melees between vehicles are rare, the few comparisons are boring and most of the modes are reduced to running practically alone for entire minutes. The career itself, nothing more than a sum of races with medals and points to accumulate, tires after a while and is not revived by the use of higher class vehicles. The competition In short, if you've read this far you'll have understood that Formula Fusion has many lame aspects, which could be vastly better with a little extra work. To condemn it definitively, however, comes another determining factor: competition. Unfortunately comparing the R8 title with the various Redouts, Fast RMXs and the WipeOut remaster means hurting them a lot, because they all offer more, both quantitatively and qualitatively. If desired, also Grip, different in style and still in Early Access, appears more complete, which is saying something. In short, the most accredited Wipeout clone turned out to be the worst of the bunch. Unfortunately, there is not even online to save him. Theoretically it shouldn't be bad to compete against other players scattered all over the world, a pity that currently being able to play multiplayer is a real feat, due to the very few playersthe. In this case, it is not the fault of the developers, but take this into account anyway. From a technical point of view, the R8 has instead done a good job, with well-characterized futuristic tracks and excellent colors. As already mentioned, the sense of speed is really high and with the latest patch the fluidity problems that afflicted it have also been resolved. Probably the technical side is the one that has seen the most improvements with the launch of the final version, given that the various betas that have followed were not exceptional from this point of view. The soundtrack, on the other hand, made up of adrenaline-pumping and very rhythmic songs, remains decent, but strictly functional to the action. It's a racing game, so we didn't expect much else.", "date": "2017-06-07", "grade": "5.0"}