{"name": "The Town of Light: Il buio dentro", "ref": "https://multiplayer.it/recensioni/184029-the-town-of-light-the-town-of-light-il-buio-dentro.html", "text": "We talked abundantly about The Town of Light, the first videogame work of the LKA.it studio during the PC review. What on balance has proved to be an introspective experience capable of making you think but also of leaving a bad taste in your mouth, finally arrives on consoles and we who have had the opportunity to play it on PlayStation 4 are ready to tell you ours on this edition . The story of the game is set in the former psychiatric hospital of Volterra in 2012, a place that really existed, founded in 1887 and remained active until the entry into force of law n. 180 in 1978, the so-called Basaglia Law which led to the closure of asylums and a new regulation of compulsory medical treatment. Playstation 4 trophies The Town of Light offers 21 Trophies divided into 1 bronze, 12 silver, 7 gold and 1 platinum. To get them, just progress in the adventure, unlocking the individual chapters or collecting all the clues regarding Rene. Lost memories The hospital had ~grown~ so much over the years that it became the ~home~ of more than five thousand internees, treated as in a prison regime where the nurses were called ~guards~ and had the role of custody and surveillance, even violent to many testimonials from former patients and staff members. Certainly history has told us that asylums were in the vast majority of cases places of suffering and degradation, where the annihilation of the person was often achieved rather than his cure. And within which was literally ~buried~ even those who perhaps were not mad, but were considered unwelcome for political reasons or for a particular social conduct. And there, left to disappear, in silence, forgotten by everyone, at a certain point even by himself, by his own ego, buried by loneliness, by beatings, by the annulment of his personality, by sedatives, by electroshocks: a real, terrifying horror , which really makes you shiver, perhaps not immediately, at first glance, but after a few moments of reflection. The Town of Light is not a horror game after all and it doesn't want to be, nor an adventure in the broadest sense of the term, but rather a journey into memories, which becomes a metaphor for an entire system. It is no coincidence that the fulcrum of the game remains the ~simple~ exploration seasoned with some puzzles. The title does not want to ~scare~ the gamer with deformed creatures born from some genetic experiment gone wrong or with supernatural beings. Indeed, to be honest in some ways it doesn't even want to terrify, at least in the most common sense of the term, but rather to create a certain discomfort in him and make him reflect on ~heavy~ issues and situations. Also because the world is full of monsters far worse than fantastic zombies or mutants, and they are real like that part of doctors and nurses who, as mentioned before, instead of alleviating the suffering of the sick, ended up exacerbating it with inhuman treatments, more similar therapies to torture and violent acts. Light and dark A series of experiences that the user relives with a good degree of immersion, also given the lack of a game interface, through the eyes of the protagonist, Rene, who in turn ~sees~ situations that occurred in the past, some of which decidedly disturbing, when the pavilion of the asylum in which the adventure is set was an anthill of people. Those walls, so silent today, seem to have kept the echo of the suffering they hosted. In fact, it is enough to know how to search among the rubbish, the rusty beds, the shelves, to find original documents compiled when the former psychiatric hospital was still active. There are also medical instruments, x-rays hanging on a wall and sinister anatomical tables. What happened in these places, what horrors did the unfortunate internees experience and what does our character have to do with these events? To find out, you need to immerse yourself in the twisted world of The Town of Light and let yourself be enveloped by its atmospheres. In this sense, the setting is perfectly fitting and already by itself capable of creating discomfort for the players (and sometimes even pissing them off by witnessing certain scenes!): it seems to be in Silent Hill, with the cracked walls, the semi-destroyed walls in different points, collapsed roof parts, rust and dirt everywhere and scenarios that sometimes deform before the eyes of the observer. A wheelchair in a corner, bed bases abandoned and piled up like iron skeletons and a widespread squalor that not only bears witness to the destructive work of time, but is also the expression of a rotten humanity that has lived in those rooms . Inner limbo In short, it seems to be in a sort of terrifying, credible limbo where to expiate or get to the bottom of somethingto. And this despite the fact that the graphics are not very good. From this point of view The Town of Light on PlayStation 4 looks like a game from the past generation of consoles (and in some cases even from the previous one!), albeit with a better lighting system. The textures range from discreet to flat, and there are some technical defects, especially in the exteriors, such as the sudden appearance of some fragment of bush or plant, and so on. On the other hand, the non-interactive sequences made with drawings that serve to tell some situations are beautiful. In any case, in the face of some technical shortcomings and a not excellent graphic sector, the game still manages to return a good global vision, thanks to an apt setting as written above, and the wise use of lights, shadows and objects, with the dark corridors and broken window panes, from which the dying daylight seeps through the grilles. The audio component is much better, with an excellent dubbing in Italian and a good general recitation of the narrative voice, a soundtrack that does its duty well, emphasizing the key moments of the adventure, without however ever being invasive or out of context, and the effects sounds, whose function is decisive in making the adventure more credible and therefore the gamer's journey in this disturbed and disturbing world more engaging.", "date": "2017-06-06", "grade": "8.0"}