{"name": "WipEout Omega Collection", "ref": "https://multiplayer.it/recensioni/184021-wipeout-omega-collection-wipeout-omega-collection-una-remaster-al-quadrato.html", "text": "Six months after our test at the PlayStation Experience, here we are to review WipEout Omega Collection, the remastered collection that marks the debut on PlayStation 4 for the series created by Psygnosis back in 1995. A franchise of great importance, capable of giving life to a real sub-genre, that of futuristic racers, which still today makes converts (who said Redout?) and boasts a large number of enthusiasts. The ingredients at the base of this type of product are high speed, the need to memorize every detail of the tracks and to become familiar with the various types of spacecraft available, but also the shrewdness of avoiding opponents' blows and scoring ours when it matters most, with the finish line now in sight. Like riding a bicycle WipEout Omega collection includes three different titles, accessible individually from the main menu after selecting the ~campaign~ item: WipEout 2048, WipEout HD and the WipEout HD Fury expansion, placed in this order for a matter of narrative chronology which, however, does not connects with the years of the related publications, which took place respectively in 2012 on PlayStation Vita and in 2008 and 2009 on PlayStation 3. Get back to the guide of the various Feisar, Auricom, Qirex, Piranha etc. it does not prove to be a problem for those who are already familiar with the series, especially since the first leagues have been made immediate and easily accessible even by those who have no experience with WipEout. The controls are essential and reactive, fully customizable: by default X allows you to accelerate, the triggers to activate the left and right air brakes, the Square button to use the equipped weapon, the Circle button to assimilate its energy to restore some of the ~health~ of the vehicle, the Triangle button alternates between the three available views (first person, third person close up and third person distant), the R1 backbone allows you to look over your shoulder and finally the L1 backbone reverses the ship's course to strike the pilots behind us, where necessary. Lots of stuff As mentioned, in WipEout the memorization of the tracks is a fundamental factor, especially in the final stages of the three campaigns, which count a total of nineteen increasingly complex tournaments, each consisting of various types of event: traditional races, time attack, zone mode (an endurance race in which the speed increases more and more), combat (whoever scores the most points from hits against opponents wins), eliminator and more. An intelligent ~rewards~ system regulates the progressive release of new events based on the medals won, which means that we will not be able to immediately access the latest competitions but we will have to sweat them, literally, by doing well in previous tournaments. However, all types of events are present in the Racebox, the free mode which from the initial screen allows you to try your hand at a personalized race by selecting the style of gameplay and the circuit. Finally, there is a space dedicated to multiplayer, available both locally for two players via split-screen and online for up to eight participants. The game isn't out yet and therefore the amount of open rooms during our tests was very limited, however we managed to try our hand at some fun tournaments together with some French journalists and we can say that this aspect of the experience has been very well implemented. The basic setting derives from WipEout HD but is also applied to the WipEout 2048 nacelles and tracks, allowing us to adjust a large number of parameters and to appreciate a solid netcode, which in our case never gave any latency problems or disconnections . Playstation 4 trophies The thirty-five WipEout Omega Collection Trophies wink at the ~completitionists~, users who will have the tenacity and ability to dissect the remaster in all its contents. In fact, there are achievements linked to the simple completion of the various campaigns, others that are obtained by snatching gold medals in every single event, still others that depend on the degree of experience that we manage to achieve during our career as pilots of the future. Ready for the challenge? Touch of class The heart of WipEout Omega Collection, as mentioned, lies in a mix of elements that have been reproposed constantly over the years and do not seem to show age. The interesting thing is that the remastering work carried out for this collection is substantially intertwined with its own enjoyment, given the importance that the tracks, their design and the drivability of the ship have in the economy of the gameplaylla, which is naturally enhanced by the rock-solid sixty frames per second of this edition. Tested on PlayStation 4 Pro, with HDR support and dynamic 4K, the game differs markedly from the original versions, boasting a much higher definition, absolutely sharper textures and a doubling of fluidity compared to what was seen on PlayStation Vita . One is shocked to think that many of the tracks in this package come from PSP episodes: the glance of the Omega Collection is not that of a latest generation racer, especially in terms of effects, but the developers were damn good to reshape the scenarios and hide any angularities, bringing convincing polygonal models to the screen, the result of a careful finishing work. In this sense, the proverbial icing on the cake is represented by the Photo Mode, which allows you to take and share images in the race by selecting, as has become tradition, the angle of view, the depth of field, the presence or absence of motion blur and all a number of other parameters. In terms of interface, the solutions adopted by WipEout 2048 are much more beautiful to look at and the general look of the game reveals its most recent origins, but the package is visually enjoyable in its entirety, strong, however, with respectable numbers thanks to the twenty-six tracks and the forty-six unlockable ships. Added to this is a revisited soundtrack, signed by artists such as the Prodigy, the Chemical Brothers, DJ Kentaro and Swedish House Mafia, which manages to accompany the action in a masterful way and recreate the typical WipEout atmosphere.", "date": "2017-06-05", "grade": "8.5"}