{"name": "Among Us VR: la recensione dell'iconico deduttivo in realt virtuale", "ref": "https://multiplayer.it/recensioni/among-us-vr-recensione.html", "text": "Social deduction is a category of board games that has always had some success. From Secret Hitler to Obscurio to titles that exploit third-party intellectual property such as Battlestar Galactica, playing a game where the aim is to track down the imposter of the group is damn fun. With Among Us, in 2018 the developer Innersloth translated this simple board game mechanics into a video game, creating a simple but exhilarating product. However, what made this title truly iconic was the strange combination of the global pandemic and fame on Twitch. From then on, Among Us became a real phenomenon, so much so that many VR Chat players created mods that could transport its colorful green beans from 2D to virtual reality. Four years after its main release, Among Us VR officially arrives on Meta Quest, Oculus Rift and Rift S and Steam VR, thanks to the collaboration between the original development studio and Shell Games, the team behind Until You Fall and the splendid I Expect You to Die. Will the transposition into virtual reality have managed to match the classic experience? Find out in our review of Among Us VR, tested on Meta Quest 2. Mechanics and game group Among Us VR rules are identical to the 2D game Let's start by reviewing the game rules of Among Us VR, the same as the 2D version. The game begins by gathering the players in a spaceship cafeteria. Each participant plays a highly stylized astronaut, choosing a color and different objects that will characterize him. The game is playable from a minimum of 4 to a maximum of 10 participants and, depending on the number of players in the lobby, there will be one or two secret imposters. In fact, at the beginning of each game, the game randomly assigns roles to the players: one or more saboteurs are hiding among the astronauts, but the task of each individual crew member is secret. Only in the case of two imposters can they mutually know who their accomplice is. Astronauts survive and win by completing various tasks in areas of the spaceship, collaborating and identifying hidden imposters by deduction; the imposters instead win the game by decimating the rest of the crew. To do this, they have different tools at their disposal: they can kill a crew member with their bare hands or they can sabotage different areas of the map. Imposters cannot perform astronaut duties but can deactivate sabotages, as well as hide in air vents to prey on their victims. Finally, there is the role of the ghost, or the dead player: this remains for the rest of the game, witnessing what the rest of the crew is up to and clearly losing the possibility of communicating with them. The game is essentially all here. The game begins, roles are assigned and everyone tries to complete their tasks. Anyone who finds a body can report it and instantly call an emergency meeting, or use the button in the center of the cafeteria. Before continuing the review, let's make an important point at this point, which defines the point of view of the entire Among Us VR evaluation. All games that put a strong interaction component at the center of the experience, just like those of social deduction, have one big Achilles' heel: played with the wrong group, they become unsustainable. However, this is not a problem of the game itself and, although it happened to us to participate in really unpleasant sessions during our test, it cannot and must not, in our opinion, be an element liable to negative judgement. First of all because voice chat can be deactivated and lobbies can be searched for text logs only, solving the problem of annoying players, but losing a truly characteristic element of the gaming experience. Secondly, because the improper use that some users make of the game cannot be attributed to the developers and anyone who does not behave correctly can always be reported. If you don't have enough friends in your contacts and you don't know who to play with, on the developer's page you can find the link to the official Discord server, to which you can connect to find other players. VR experience The gestures of the astronauts in Among Us VR are hilarious So what is it like to play a game of Among Us VR? Given the premise of the right playgroup, in our opinion it is a lot of fun, much more than the 2D version. Proximity voice chat really makes a difference and becomes an integral part of the gaming experience. The other crew members will hear your voice, and you will hear theirs, but onlyif you are close. This makes the immersion even stronger, becoming exhilarating added to the gestures of the astronauts. In fact, the avatars do not have expressions, but the players can use the pads of their viewers to move their hands, using gestures to point and the thumbs up / towards. Seeing an astronaut defend himself from accusations by gesturing convulsively with those little hands, we admit it, is always a great laugh. But the proximity chat also becomes useful for gameplay purposes: for example, by paying attention, you may perhaps hear the imposter hiding around the corner breathing. It happened to us while we were placidly completing a task: when you hear heavy breathing behind you and you're not the imposter, it's not a good sign! VR makes everything more immersive, even emergency meetings Scattered around the ship are the different tasks that you have to accomplish if you play as the astronaut. It is a series of nice mini-games that make the astronauts' work fun and which, again thanks to the immensity of virtual reality, are sometimes even distracting. We have often become very busy with our tasks, so much so that we don't remember who we were next to or the sequence of events. The cleverness of Shell Games has been to focus on small mini-games that require a certain type of attention: some are precision games, others ask you to complete numerical or symbol sequences, still others bring reflexes or memory into play. All activities that absorb the player, who in that moment loses some awareness of the surroundings, also because he is unable to turn around while completing a task. While they are all distracted, the impostors have free rein and can set up their strategies, making use of some tools at their disposal as already mentioned. Technical aspect and comfort This is what the Among Us VR map looks like From a technical point of view, Among Us VR is very linear and clean. The game is stable, as are the online lobbies, and the controls are pleasant and responsive. It must be said that it was really difficult to be able to go wrong from this point of view, given the graphic minimalism of the title. The game implements several accessibility solutions, such as the ability to play with only one hand. The solutions to mitigate virtual reality malaise are also different, with an interesting choice concerning movement. In addition to the snap or soft snap functions (in VR jargon it is the movement with which the view is turned without moving the head), and the manual adjustment of the different movement speeds, Among Us VR opts for the tunneling system. This is a gimmick to increase player comfort, which consists in narrowing the portion of the view: when you move, a gray grid appears on the screen that covers the peripheral parts of the frame, leaving only the front portion of the view visible. The alternative used to reduce motion sickness in VR games is teleportation, and the choice between this and tunneling should always be made according to the type of game. Although the writer prefers the teleportation system, the choice of tunneling for Among Us VR is in fact the most correct one because it is less confusing.", "date": "2022-11-13", "grade": "8.0"}