{"name": "Pesce fuor d'acqua", "ref": "https://multiplayer.it/recensioni/183745-pokemon-magikarp-jump-pesce-fuor-dacqua.html", "text": "While Pokmon GO continues its path studded with dizzying numbers, Nintendo's operation to conquer the mobile market continues with a new title linked to the universe of pocket monsters, dedicated to none other than Magikarp. The choice is already rather against the trend, considering the scarce popularity of the creature in question as a fighter, but it reveals the spirit of the underlying project, all centered on the exploitation of the ~cult~ that was born around this poor fish out of water, for the which lately - and not surprisingly - a sort of song has also been dedicated, spread by Nintendo on its official channels. With the Magikarp game, The Pokmon Company wanted to experiment a little with the more simplistic and light-hearted aspects of smartphone games, putting together an interactive pastime rather than a real video game. In all of this, one thing is very clear to Nintendo, as it has always specified since the dawn of its adventure in the mobile sector: real video games are on consoles, while on smartphones and tablets there is only space for hybrid experiences, marginal compared to the commitment required by the classic productions of the Kyoto house, exactly as the executives have reiterated on several occasions. Except that with Magikarp Jump they have perhaps exaggerated in wanting to simplify things, proposing in this case a very simple Pokmon-themed divertissement that exploits elements and iconography of the series to stage little more than a ~tapping game~ with limited possibilities for further study and longevity . The elementary story of the trainer specialized in Magikarp, entirely focused on the growth and training of the competition fish, can be successfully addressed to very young people, and perhaps this is precisely the key to better appreciate what the game has to offer . Magikarp in the limelight The aim of the game is to train ever more powerful Magikarp to lead them to win the various challenges that stand in the way of progressive difficulty, starting from fishing for a specimen and passing through training, various customizations and real competitions. It is only a pale reflection of the typical complexity of Pokmon mechanics, with the need to keep an eye only on the creature's jumping power to be increased through constant feeding and training. The latter can be expanded and varied by unlocking further exercises, but from the player's point of view it changes little, since it is only a matter of pressing on the screen at the right moment to feed the beast or simply start an animation that performs by itself. There is very little strategy in all this, limiting itself above all to the initial choice of the creature drawn (by spending diamonds it is possible to make several attempts to find a Magikarp with higher base values) and to the spending of coins and training points to upgrade as much as possible our champion. Competitions are held over a single jump and are won by the Magikarp that reaches the highest, simply requires the start and takes into account the overall power numerical value achieved by the creature, which increases based on nutrition and training. Some tactical element is provided by the possibility of buying items capable of recharging energy and training points, things that in the more advanced leagues must be taken into consideration, slightly complicating the game action, which in general remains however rather linear. Great emphasis is obviously given to the whole outline of collectibles which probably represents the real engine for the continuation of the game, including objects to modify and enrich the Magikarp water park, aesthetic elements to characterize the creature and Pokmon companions to add in the background to make cheer and upgrade some parameters in the race. Here obviously the in-game currencies and the possibility of buying bonus packages with micro-transactions come into play, and even if it is not exactly a question of forcing, the question should probably be kept an eye on being a title that seems to be aimed above all at children. as well as the general look reveals.", "date": "2017-05-30", "grade": "6.0"}