{"name": "Full Spectrum Warrior", "ref": "https://multiplayer.it/recensioni/full-spectrum-warrior-3.html", "text": "Being the ~homemade~ version of a military action-strategy simulator developed directly for the US Army, Full Spectrum Warrior bases a large part of its gameplay on the planning of more or less effective tactics and on strategies aimed at achieving the primary objective rather than on the immediacy and ~shoot and kill~ characteristic of other similar titles, even if to be honest this game mechanism is, as we will see later, put to the test by some imperfections in the concept itself. However, to partially facilitate the gamer's task and therefore not force him to repeat too long sequences after a possible departure, Pandemic Studios has introduced a valid mission check-point system that intelligently breaks the levels. In this way, what could have immediately proved to be a big problem was eliminated given the intrinsic level of difficulty of the game which, at least in the first few games, will often lead you to die almost immediately at the beginning of each mission. Eight men divided into two teams called respectively Alpha and Bravo, will have to face different objectives in a highly hostile environment, to get to the bottom of which it will be essential to plan the actions to be carried out as a group in the best possible way. Too bad, however, that part of this phase is undermined at the origin by the scarcity of the paraphernalia in our possession and by an AI of our companions that is not excellent. The set of weapons at our disposal is in fact limited to an assault rifle, a grenade launcher, hand grenades and smoke bombs, which effectively forces the player to be able to count on very few strategies in the attack phase, thus limiting the key element of this type of game, and that is the planning of the action studied and cared for in every little aspect in relation to the mission. The men under our control, unlike our adversaries, are a little slow on the uptake and consequently slow in carrying out the tasks assigned to them. Sometimes they tend to waste too much time in getting ready before opening fire, thus putting themselves in a position to be easy targets for enemy snipers and reducing the reaction capacity of the entire team. Longevity is unfortunately another Achilles heel of this title. In fact, it is not particularly high even if the programmers have specifically inserted for this Ps2 version three additional missions that can be played once the main mode has been overcome. Fortunately, there is an option for online play in the game that allows you to play the main mode cooperatively over the web by entrusting the two teams to the control of two players. Full Spectrum Warrior appears quite convincing instead as regards the aesthetic and sound aspects. The graphic engine is valid and manages, without obvious slowdowns or problems of excessive fluidity even in the most complicated situations, except in some sporadic cases, to show us detailed and credible scenarios and characters. The textures, in fact, are well cared for and the color palette is as close as possible to the real one of desert and similar environments, all enhanced by light effects which, while not reaching those of the Xbox , they are still able to give the levels an absolutely realistic atmosphere. The audio sector, as anticipated, is no different. In fact, it can count on well-made music and well-finished sound effects up to an excellently dubbed speech. Conversely, some perplexity leaves the physics of the game. Technically it's not bad, but it appears a little limited especially if we take into account the fact that the interaction with some elements of the various areas is incomplete, as it is almost impossible, for example, to deform or damage certain objects as if they were made of a special material... Therefore, a grenade thrown against a window will simply blacken the wall, or a rifle shot aimed at a bin will only leave a hole, without any dents... Comment Full Spectrum Warrior certainly cannot be defined as the state of the art of war simulators for this console generation. However, despite some flaws, the Pandemic Studios title partially surprised us positively for the good degree of realism it can offer during the various game sessions. Sure, there are better ones around, but we believe that all in all this game isn't that bad and that, with some inevitable improvements, a possible next episode for Ps2 can make the gaming experience of every game more attractive, complete and fun. enthusiast of the genre. Pros: Good simulation level. Graphics and sound ok. Cons: Physics and AI to be reviewed. Littlelong-lived. Limited number of weapons. The genre of games based on military actions carried out by specialized departments of really existing armed forces has definitely been used quite recently by programmers from various software houses, even on consoles. After having depopulated almost exclusively on PCs, in fact, we are almost witnessing a real boom in the sector also on our beloved ~gaming machines~. Developed by Pandemic Studios, FSW is therefore the umpteenth title of the genre which aims to simulate, more or less realistically, the behavior of a group of soldiers chosen in some war mission, in this case in the difficult task of carrying peace in a country at war with the fictitious name of Zekisthan. The initial impact with the game immediately gives the idea of the good degree of realism that will await us later. In fact, the gamer is forced to carry out an extremely accurate and difficult training phase, but necessary to take over, or try to do so, the control of his men through the multiple game commands. Compared to typical products of the genre, in fact, Full Spectrum Warrior stands out for a so-called ~atypical~ control system, a little difficult at the beginning, but quite functional once mastered. The control over the men takes place indirectly, through a cursor of the type used in strategy games, through which the arrival point of the troops is decided and then one passes to the next order. While the one on one's character takes place in a ~classic~ way.", "date": "2006-06-01", "grade": null}