{"name": "1 e lode", "ref": "https://multiplayer.it/recensioni/183632-lode-runner-1-1-e-lode.html", "text": "With an identity card that establishes the beauty of its birth 33 years ago, Lode Runner can certainly be considered a classic, even if not one of those that take the headlines in the history books or that hover in the most vivid memories of gamers scattered all over the world. It is no coincidence that the original Brderbund product has not generated large numbers of noteworthy sequels and remakes, nor has its peculiar gameplay been subject to numerous raids by clones who wanted to exploit its appeal: and if from one on the one hand this may appear as an injustice towards a game that was certainly innovative for its time, on the other it makes this Nexon recovery operation even more fascinating, precisely because it relates to a title that is in some ways forgotten. So let's find out if the present Lode Runner 1 manages to bring back the personality of the source despite its look undoubtedly oriented towards modern tastes. Lode Runner 1 captures the essence of the original with a style suitable for the mobile landscape Gold, robots and bricks Lode Runner 1 does not pretend to give a narrative depth to the action on the screen, and therefore puts the player again in the role of an anonymous little man busy collecting all the gold scattered throughout the approximately 300 levels that make up the adventure. The mechanics are exactly identical to those of the original, with the nuggets of each stage that must be collected in order to open the door that gives access to the next scheme: the user's task is hindered by the robots that activate as soon as the first one is reached piece of shiny metal, and who relentlessly chase the protagonist to the exit. What until now might look like the picture of a fast and frenetic platformer definitely fades to more puzzle hues when you consider the peculiar main ability of the on-screen hero, capable of shooting laser beams downwards that destroy the tiles in his immediate vicinity: an operation that serves both to make him quickly reach the platforms below, and to trap the automatons chasing him. The entire playful plot of Lode Runner 1 develops around these simple bases, enriched by a whole series of collateral elements that are illustrated to the player as the campaign progresses and highlighted by a level design that does its best to always keep the attention alive. In reality, perhaps something more could have been done with regard to the challenge rate, which is really very mild especially in the early stages: the first twenty stages of Lode Runner 1 struggle to go beyond the confines of the tutorial, but even later the Nexon product is not one of those destined to keep the most hardcore gamers awake at night, on the contrary. If you manage to overcome an undoubtedly very boring first phase, the title does not skimp on showing its potential, proving to be an effective remake in expertly proposing a gameplay that still today denotes respectable quality. Precisely in this regard, the developers have been good in not getting carried away by inappropriate changes to the original formula, limiting themselves to modernizing only the ancillary aspects. We start with the contents offered by the main menu, which allow you to try your hand at a championship, to face the game in classic mode, to try out the schemes created by other users or to create one yourself using a simple editor. A package worthy of note, especially if we consider the fact - far from obvious - that Lode Runner 1 is available for download for free without however being smart with in-app purchases, invasive advertising or bottlenecks of any kind. Even from a technical point of view, the work performed by Nexon stands at certainly discrete levels: graphically, the game avoids the overused pixel art, preferring a simple, clean and colorful style that performs its task diligently, while the control system it uses a virtual pad for movements and two keys for the direction of the shot. Our test highlighted a bit of ~slippery~ feedback and input sizes that could cause some slight embarrassment on smaller screens, but nothing that seriously compromises the pleasure of the title.", "date": "2017-05-26", "grade": "8.0"}