{"name": "Samurai Warriors: Spirit of Sanada", "ref": "https://multiplayer.it/recensioni/183584-samurai-warriors-spirit-of-sanada-piccoli-samurai-crescono.html", "text": "Confirmed for Europe a few months ago, Samurai Warriors: Spirit of Sanada arrives about a year after Samurai Warriors 4: Empires, positioning itself as a sort of spin-off for the series produced by Koei Tecmo. This time the attention is in fact completely directed to the Sanada family, represented in the game first by Masayuki and then by his two sons, Nobuyuki and the more famous Yukimura, who we often and willingly find in the roster of musou set in feudal Japan. The reference period covers about fifty years, from 1561 to 1615, and the game structure presents some interesting new features: first of all, it is possible to manage the village from which our troops set off from time to time towards battle, interacting with various NPC, completing small quests and playing an increasing number of minigames; secondly, the missions are characterized by mixed objectives, therefore it is not necessary simply to clean up the areas of the map from the enemy presence, but also to defend allies, escort superiors or eliminate specific objectives. There are also some stealth-type facets, although calling them this way makes you smile a little: these are sequences in which we will have to try to hide our presence from handfuls of guards, however easily identifiable on the radar, by following certain paths when they move for their round. The funny thing? We won't have to deal with any ~normal~ enemies along the way, let alone secrecy. Odds Samurai Warriors: Spirit of Sanada tries to put new things on the table, but the focus remains the same The way of the samurai warrior The expedient implemented by Samurai Warriors: Spirit of Sanada undoubtedly makes the narrative aspect of the experience richer, with a concrete deepening of the ties of the Sanada family and of the events that led to its rise over the years, of battle to battle. Watching Yukimura grow from a young boy to a skilled and determined warrior makes for quite poignant moments in certain stages of the story. However, the fact that all the texts are only in English represents a major limitation for a pleasant use of the enormous amount of dialogues between the various characters, which thus become cloying and which you will tend to skip. The obligation remains to contact certain non-player characters in order to access the new missions, but the map in this sense provides concrete help and it is difficult to get stuck in the village for more than a few minutes, perhaps dedicating yourself to a fishing trip, honing your skills at the training ground, turning to the blacksmith to upgrade your weapons or tracing the history of the house in the library. Places and activities that are revealed when we proceed for some time within the campaign, characterized by a good duration (it takes about thirty hours to complete it) but without any real new elements compared to the tradition of the series. In fact, the objectives and the rules to be followed to avoid (frustrating) game overs change, but the mechanisms are always the same: a single man against hundreds and hundreds of enemies, rather repetitive combos and special moves that are activated as needed, more for deal with the practices of a trivial challenge (at least at the normal level) than for concrete reasons. Playstation 4 trophies The fifty-one unlockable Trophies in Samurai Warriors: Spirit of Sanada often revolve around the completion of specific small actions, such as the use of certain characters within the village, the acquisition of a certain number of accessories, trying the various minigames and the completion of quests related to some NPCs. The rest of the achievements are obtained by viewing specific cutscenes, therefore through real progress in history. The usual musou? It is the plot, especially in the advanced stages, with its highly dramatic situations, that holds the ground in Samurai Warriors: Spirit of Sanada, which perhaps makes this latest Omega Force production even more niche than the traditional musou. There are some precautions that emphasize the importance of certain elements, such as the care for the equipment or the unlocking of ~stratagems~, real diversionary maneuvers that can be called up on the battlefield when the situation requires it. Furthermore, the day / night cycle influences the dynamics of the clashes, leading the enemy troops to infiltrate and attack in the shadows, just as the possibility of using alternative and decidedly peculiar mounts is nice. However, the fulcrum remains the same as always, the alternation of combos and specials, possibly seasoned by the passage from acharacter to another, while increasingly stringent victory and defeat conditions force us to plan our actions with a minimum of criterion, without attacking head-on but waiting for the usual indications on the areas of the map that need to be reached and cleaned up. Without any online mode, the game unfortunately disappoints from the point of view of technical realization: on PlayStation 4 Pro it presents an inexplicably dancer frame rate during the exploration of the village, to then bring literally thousands of soldiers simultaneously onto the screen without apparent effort, at the clearly clear of a limited polygonal complexity and, above all, of scenarios that also in this case are empty, dull, devoid of detail, personality and interactive elements.", "date": "2017-05-25", "grade": "7.0"}