{"name": "Atari 50: The Anniversary Celebration", "ref": "https://multiplayer.it/recensioni/atari-50-the-anniversary-celebration-recensione.html", "text": "Atari turned 50 and it is right to celebrate it. Either because it's a historic brand, or because it's also 50 years of the video game industry, unfortunately forgotten or ignored by most. What better way to remember that tumultuous experience, which went through ups and downs, reaching up to the stars, and then touching the innermost depths of hell within a very few years, if not a beautiful historically contextualized collection? At the helm of the project is Digital Eclipse, a studio specializing in the recovery of past glories, which has worked, among others, on the Street Fighter 30th Anniversary Collection, The Disney Afternoon Collection, the SNK 40th Anniversary Collection and the very recent Teenage Mutant Ninja Turtles : The Cowabunga Collection, proving to have an edge over the competition, for the demonstrated ability to enhance the individual games, as well as the context in which they were dropped when they were originally published. This is undoubtedly their best work, as we will see in the review of Atari 50: The Anniversary Celebration: the school book we would like if we were to study the history of Atari and the beginnings of the video game industry as a whole. The why of a new collection Ray Kassar, the man with whom Atari first reached the stars and then sank to hell The strong point of the whole experience is that it works regardless of the individual games selected, because they are all impeccably contextualized on five interactive timelines, dedicated to the different historical passages experienced by the company up to the 90s. Thus we begin with the Origins of the Arcade, which tells of the birth of Atari, founded in 1972 by Nolan Bushnell and Ted Dabney, with references also to Syzygy, their previous company (abandoned because the name was already registered). The path follows the evolution of the division that dealt with coin ops (token games) until 1984. Then we talk about the arrival of the Atari VCS, the first home console with successful cartridges (Channel F, we haven't forgotten you ). Naturally we face the crisis, the change at the top between Bushnell and Ray Kassar after the purchase of the company by Warner Bros., the arrival of Jack Tramiel who made the company focus on computers and the launch of the latest consoles, the Atari Lynx and the Atari Jaguar, both very unfortunate. Everything is presented in an extremely dynamic form, with in-depth texts, video interviews with the protagonists of the time, original information material reproduced in high definition and the games themselves, which can be recalled from the timelines. In this way not only is learning the history of the company pleasant, but it is also possible to realize the evolution of the medium in those years, which is well summed up by the parable of Atari itself, with the focus passing from the arcade to the home market and with the latter has become gradually more difficult to conquer, both due to the arrival of the competition and some errors of evaluation, probably impossible to avoid. After all, the video game industry did not exist before Atari, so what we now call mistakes were actually the result of executives forced to proceed by arm in a world of uncertain borders, in a market that still could not fully understand its scope . In the mid-80s, if Nintendo managed to have success in the United States with the NES, reviving the console market, it was precisely because Atari had been there first with all its problems, from which Yamauchi and his team left to manage their platform. But that, as they say, is another story. The timelines of Atari 50: The Anniversary Celebration are done very well Atari 50: The Anniversary Celebration's way of exposing Atari's story is probably one of the best possible, as far as the world of video games is concerned, because it allows you to access the beating heart of its object, which is video games themselves. It is also interesting that the tones of the story are not hagiographic and that some conflicts are reported as they were told by the chronicles of the time, without too many softening. For example, on the presidency of Kassar and the conflict of cultures he created in the company, Al Alcorn, former vice president of Atari for research and development, is quoted, who was never tender with the executive wanted by Warner Bros.: ~When he entered At Warners, Ray Kassar had... a marketing department that knew nothing about games. They didn't play games. The marketing department told the techs what to do, and basically turned Atari into an obsolete, old, calcified, filthy rich company .~ Games The presence of Atari gamesJaguar makes the harvest especially tasty In addition to the timelines, Atari 50: The Anniversary Celebration gives you direct access to the vast library of games that are part of the collection, including some nice surprises. Atari's previous collections, especially the Atari Vault, had focused on the company's heyday, then on the coin ops of the 1970s and early 1980s and the Atari 2600 game library, with some escapes to the Atari 5200. A very different story was made here. Obviously the classics are not lacking, from the ubiquitous Pong, passing through Asteroids, Breakout and Crystal Castles, just to name a few. Obviously, these are titles that must be known, at least for personal culture, above all if one wants to pose as experts in the sector (they are still very playable, don't worry). However, alongside the more well-known names, Digital Eclipse has done a great job trying to give a truly all-round picture of Atari's history, also proposing less famous titles, but indicative in their own way, such as I, Robot, Canyon Bomber, Liberator or Major Havoc, just to name a few, also picking up games from off-the-beaten-path systems such as the Atari Lynx, the Atari 800 and the Atari Jaguar. Unpublished games hold surprises So here in the collection there are also particular games, often never reproposed to the public such as Atari Karts, a nice clone of Mario Kart, Missile Command 3D, an unsuccessful attempt to bring the gameplay of Missile Command into three dimensions, the masterpiece Tempest 2000 by Jeff Minter, the very strange Ninja Golf for Atari 7800, in which after having shot the ball you have to fight with rival ninjas to be able to execute the next shot, Basketball Brawl, in which basketball and street brawls mix in a harmonious, almost poetic and many more. They are not all masterpieces, of course, but it is precisely the choice of having included titles of all kinds, aiming more to give an overview of the time than to present the usual games known to all, which makes the operation particularly valid. It should be noted that each game is presented with an attractive card showing the platform for which it was made, the year of publication and some general information. Also noteworthy is the presence of prototypes of games never published, such as that of Millipede for Atari 5200, or that of Saboteur for Atari 2600 (made by Howard Scott Warshaw, the same as the infamous E.T.), or even that of the crazy and visionary arcade Akka Arrh . Each Atari 50: The Anniversary Celebration game comes with its own card and original artwork The seven unpublished games deserve a separate note, i.e. made exclusively for the Atari 50: The Anniversary Celebration, which we want to mention one by one. Of course, these are very simple titles, aiming more to give you something more to try, but they are a remarkable addition nonetheless. We start with Haunted Houses, which attempts to bring the gameplay of what is considered the father of survival horror into 3D and is characterized by a very simple graphic design and immediate gameplay. We then move on to Neo Breakout, a modern reinterpretation of Breakout with redone graphics and different game modes. Quadratank is instead a tank fighting game designed for multiple players. Also in this case the gameplay is really direct and characterized by an immediacy typical of many games of the time. Swordquest AirWorld for the Atari 2600 is the final installment in the Swordquest series that never hit the market. Considering that the other Swordquests are also in the collection, it's a really nice gift for curiosities lovers and for old people who want to conclude that story, considered by some to be an open wound. Some of the titles present are interesting curiosities Touch Me is instead a clone of Simon. The original was a device that actually came on the market in 1979, which is being presented here for the first time in virtual form. It is to be considered above all as a historical document, which accounts for the various paths attempted by Atari throughout its history. VCTR-SCTR is, in our opinion, the best title among the new proposals, because it mixes the gameplay of the games made with the Atari vector engine (Asteroids, Lunar Lander, Tempest and others) for a dynamic and paradoxically very fresh and enjoyable. Finally, Yar's Revenge Enhanced is a new edition of the aforementioned Warshaw's masterpiece, with redone graphics and the ability to view the original graphics at any time. The translation into Italian Unfortunately the Italian translation of the Atari 50: The Anniversary Celebrationit has errors like this The Italian translation, unfortunately not positive, deserves a separate note. It is not a text problem, but errors that make it unreliable. For example, in the Italian text the foundation of Atari is traced back to 1982, instead of 1972. This is an apparently minor error, moreover compensated by the fact that on the timeline that specific paragraph is positioned on the correct year, but it is nonetheless serious enough for such a work, so much so that we preferred the English language, in which these inaccuracies do not exist. We hope that the translation will be checked and updated with the necessary corrections.", "date": "2022-11-11", "grade": "8.8"}