{"name": "Il senso di Nintendo per i remake", "ref": "https://multiplayer.it/recensioni/183141-fire-emblem-echoes-shadows-of-valentia-il-senso-di-nintendo-per-i-remake.html", "text": "In the beginning Intelligent Systems created Fire Emblem. The NES library was featureless and deserted and darkness covered the abyss and the spirit of Nintendo hovered over the waters. On the fourth day, Intelligent Systems said, ~Let the triangle of weapons be done!~ And the triangle of weapons was. Nintendo saw the weapon triangle as a good thing and separated Fire Emblem from other Japanese RPGs. Although very banal, the fantasy Chinese morra concocted by the Japanese developer soon became a kind of philosophy, so much so that the triangle was taken up in a more modern key in the other Intelligent Systems franchise, Advance Wars. And 1992's Fire Emblem Gaiden - which looked more like a traditional JRPG, at a time when the series still had neither a definite shape, nor a weapon triangle - was slowly forgotten. Considered something of a ~black sheep~ due to its nature as a spin-off, it was surprisingly revived last year when Intelligent Systems decided to bridge the gap between Fire Emblem Fates and the upcoming unsubtitled Fire Emblem for Switch with a remake . A wise move? Find out in the next lines. Fire Emblem Echoes is a game changer for the Intelligent Systems series for both good and bad The 3D effect Intelligent Systems does not disappoint this time either and implements an excellent stereoscopic effect that especially embellishes the explorations of cities and undergrounds. The optical illusion returns an engaging depth and affects little or nothing the frame rate in the fights. Once upon a time in Valentia Anyone who has played Fire Emblem Fates or Fire Emblem: Awakening knows what to expect technically on a Nintendo 3DS, but Intelligent Systems have gone a step further by working on the Fire Emblem Fates engine to fill it with detail, especially during the fights. The polygonal models are beautifully animated and full of detail, clashing in the battlefields to the rhythm of excellent music by Takeru Kanazaki and Yasuhisa Baba. And we're not sure if this was the hardest part of the development. Let's face it: Intelligent Systems probably had to churn out another Fire Emblem in a short time, at a time when Nintendo still has to push its latest handheld a bit before handing over the baton to the new hybrid console. Despite this, Fire Emblem Echoes has that vintage charm that still has its say today. The plot revolves around two childhood friends, Alm and Celica, who find themselves fighting a war bigger than them: Valentia is a continent ravaged by tyrants and rulers who bring the people to their knees with their intrigues of power. Alm joins the Liberators, rebels determined to weaken the enemy at the cost of their lives, while Celica, hunted without her knowing, decides to look for Mila, the goddess who seems to have turned her back on the innocents who worshiped her. Their paths cross and collide, proceeding in parallel: in the game, the narrative translates into a peculiar choice for the Fire Emblem series when the player finds himself controlling two separate armies, moving them on a map reminiscent of those of strategic JRPGs like Tactics Ogre or Final Fantasy Tactics, full of enemies to fight and places to explore. Once a certain goal has been achieved, one chapter closes and another begins, but the plot is much more sober than those to which the latest Fire Emblems have accustomed us: forget about alternative lives or time travel; the story in Echoes is less convulsive and, perhaps, purer. Above all, some supporting characters feel the weight of its simplicity relegated to specks with a few jokes without too much importance, while the characterization is concentrated above all on Alm, Celica and some other more important characters, thanks also to the dialogues written in Italian and completely dubbed in English by the first to the last word. Between the clichs of Japanese animation and the predictability of some twists from other times, there is no place for the slightly too gratuitous fanservice that had weighed on the casts of the latest Fire Emblem. It looks like a balancing contest in which each weight compensates for the other pan of the scale and this applies not only to the story, but also and above all to the gameplay. The old and the new Fire Emblem Gaiden originally winked at the JRPGs of the time such as Dragon Quest or Final Fantasy and Fire Emblem Echoes respects its hybrid nature, but this means alienating players accustomed to the linearity of previous Fire Emblems, a succession of missions interspersed with more management in which the operational bases, the characters and their relationships were developed. There are no units in Fire Emblem Echoesto ~mate~ and children to generate, there are no foundations to build and services to upgrade; even the class advancement system has been revised and specific objects are no longer needed but only the statues of the goddess Mila where it is possible to enhance our heroes, making them stronger and more competitive in view of the upcoming battles. Most of Mila's statues are kept in the dungeons, areas that can be accessed from the world map and in which the game drastically changes aspect, shooting Alm or Celica from behind and in third person as in an action adventure or an old JRPG school. The change of perspective, for a Fire Emblem fan, is almost a shock, also due to the somewhat clumsy control system that characterizes these sessions. Despite this, the dungeons are one of the features that convinced us the most and that we hope to find again in the future: in these sessions you explore the labyrinth in search of treasures and secret passages and from time to time you fight the enemies hidden in the 'shadow, perhaps attacking them before the fight to gain a small advantage. The fights, in these cases, are quite fast: they take place in simple and tiny maps, against few opponents. Although they are resolved in a few minutes, we must admit that in the final chapters of the game, when the dungeons become more intricate and the enemies more aggressive, their frequency sometimes becomes annoying. In this sense, Fire Emblem Echoes is somewhat reminiscent of another cornerstone of the genre and that is Persona by Atlus or, perhaps it makes the idea better, Shin Megami Tensei. In fact, we are not sure that we appreciated the ~fatigue~ indicator: it increases with each action and decreases the capabilities of the individual units, forcing us to feed them with food collected on our travels. Obviously the ~fatigue~ adds an extra strategic component, but negligible at the beginning of the game and extremely annoying in the most difficult moments. The dungeons, however, are only one side of the coin. The other is the cities that the player can explore to a limited extent, examining some key places firsthand to collect useful items or converse with the inhabitants: interactions can unlock new characters or side missions, as well as reward us and improve our equipment. Indeed, Fire Emblem Echoes deviates from its predecessors in another sense as well. Here, weapons and magical tomes are not consumed. Each unit has a specific weapon that can be used indefinitely, however it is possible to equip some special weapons - respecting compatibility, of course, since an archer will certainly not be able to wield a sword - which increase the various parameters and also give bonuses such as attacks special or passive abilities after a certain number of uses. It therefore becomes categorical to rotate the equipment found to expand the skills of each unit and prepare it for any eventuality. Not the triangle! We have pressed our hand since the introduction on the speech of the triangle of weapons because it is its resounding absence, after years spent learning that spears trump swords, swords over axes and axes over spears, that undermines the most important aspect of the gameplay of Fire Emblem Echoes: the strategic one. The problem, however, is more intricate than it seems and relies on a cause and effect relationship that will make Fire Emblem veterans turn up their noses. By removing the triangle, each fight inevitably revolves around other factors such as the stats of individual units or their positioning on the map. In this sense, Fire Emblem Echoes is faithful to Fire Emblem Gaiden: the Japanese developer has reproduced the various maps almost slavishly which, unfortunately, have never shone in terms of design and originality. To be honest, the maps in Fire Emblem Echoes are too similar and repeat more or less the same dynamics, testing the player with bottlenecks, structures to get around and rooms to sneak into. The complexity of the maps faced in Fire Emblem Fates - especially in Conquest and Revelation - is a distant memory. There is very little interactive and the terrains that give exceptional bonuses, exponentially increasing values such as defense or dodging, are the masters. The clashes therefore revolve around the ~control~ of these areas, not so much the positioning of the units in and of itself, especially in the presence of magicians or archers. Now that weapons no longer wear out, mages draw on their life points to cast their spells: thanks to priests and their healing spells, their participation in battle offers an overwhelming advantage. Since there is no power relationship between weapons and magic, in short, it is the numbers and brute force that win the engagements and when the outcome of each battle is decided above all by the critical hits, one realizes that there is something wrong in the strategic system of this Fire Emblem. While remaining faithful to the original gameplay of Fire Emblem Gaiden, Intelligent Systems should have compensated for its naiveties with a better overall balance. Yes, there was a little tweaking here and there in the growth rates of some characters, but it wasn't enough. Fire Emblem Echoes, at times, and especially in the smaller maps that define random encounters on the map or in the dungeons, is more reminiscent of the mobile system spin-off Fire Emblem Heroes than its more prestigious representatives for Nintendo 3DS or Game Boy Advance . On the other hand, even if it may seem a controversial reflection, we must admit that we appreciated this return to yesteryear immediacy. Free of pair fights, support units, proximity boosters and so on, Fire Emblem Echoes is a title that can be played immediately and with pleasure: there are not many values to take into consideration, juggling equipment and skills is very simple. You choose a unit, move it, attack. End. Die-hard fans of the series may find these oversimplifications daunting, but the compromises elaborated by Intelligent Systems - such as multiple difficulty levels and Mila's wheel that allows you to reset the last few turns - suggest a clear desire to address the new generations more than the old ones. Only time will tell if it is a short parenthesis or if this is the future of Fire Emblem.", "date": "2017-05-16", "grade": "7.8"}