{"name": "Piccole sorelle crescono", "ref": "https://multiplayer.it/recensioni/182978-giana-sisters-twisted-dreams-directors-cut-piccole-sorelle-crescono.html", "text": "We have already promoted Giana Sisters: Twisted Dreams at the time of its release on PC, and almost five years later we find ourselves even today reiterating the good things said on that occasion about the production of Black Forest Games. The occasion is particularly propitious: the game is being re-proposed these days as a free title within the Xbox Live Games with Gold program, which provides the opportunity to go back to talking about the Director's Cut, or rather the complete experience of this particular platformer with puzzle features. Giana Sisters is a particular game starting from its own story, inextricably linked to a sort of original ~scandal~ which nonetheless helped to build its myth. At the time of its release on the Commodore 64, The Great Giana Sisters represented a clone of Super Mario Bros. as was evident right from the deliberately parodic title, which represented a considerable affront also given the difference in weight between a Nintendo in its prime glory of the 80s and the small Time Warp Production. The ~tribute~ did not fail to attract attention, also because the game began to enjoy a considerable following, given the desire for Mario that gripped home computer users. Although it was never clear what actually happened, the mere threat of legal action from Nintendo prompted the small team to withdraw The Great Giana Sisters from the market, thus increasing its notoriety and making it definitively a cult. So, all this marginally concerns Giana Sisters: Twisted Dreams, which plays on the myth of the original paying homage to it nostalgically (for example with the excellent modern remake of the historic main theme by Chris Hlsbeck) but represents a completely new project with elements strongly original and characterizing, a game to all intents and purposes new and also decidedly valid. A Director's Cut that further improves the already excellent level of Giana Sisters: Twisted Dreams The double face of Giana The story is always the same, and sees the young Giana launch herself into the rescue of her sister kidnapped by a dragon, for reasons that remain largely unknown but to be discovered along the way (or maybe not). Not bad: the important thing is to have a pretext to get on the road, and with a girl like this protagonist the journey can only be eventful. In a total reinterpretation of the old transformation (which originally worked very similar to Mario's mushroom power-up), Giana's split personality has become the main mechanic on which the entire level design and puzzle structure also revolves . Being a teenager in the throes of hormones and youthful rebellions, the girl is able to transform herself from a quiet girl into a wild punk, but what matters most is that this transformation is accompanied by a simultaneous modification of the whole surrounding environment, which in the opposite way to Giana's personality, it goes from an infernal nightmare to a fairy-tale world. Beyond the aesthetic variations that this entails (moreover very pleasant, given the dynamic animation effects of the transformation) the mechanics of the two parallel dimensions allows you to act on the levels by opening passages, transforming enemies and revealing new elements of the scenario and bonuses, because although the general structure of the two versions of the world remains almost the same, there are always some sections that change: transforming the texture of some platforms, changing the movement of others, opening doors and bridges, for example. All this requires a continuous and rhythmic transition from one dimension to another to move forward, an action well supported by a responsive control system as befits an old-school platformer, which allows you to use Giana's special powers (a transformation into a ball of fire that knocks down walls and enemies providing a momentary acceleration and an aerial spin that allows you to glide) in a precise manner. On the other hand, the correctness of the performance is a necessary requirement to advance in the game, both for the average high level of the challenge, and because the collection of diamonds and various collectible elements scattered throughout the levels, in addition to the amount of deaths recorded during these influence the final rewards at the end of the stages with which it is possible to unlock the boss fights and therefore advance in the story. Xbox One goals 17 unlockable achievements are not many to cover the standard 1000 points, which translates into some particularly rich achievements. Most achievements are achieved by completing the story, but some are only awarded to those who perform paparticularly selective, which guarantee the richest booty. The complete experience Giana Sisters: Twisted Dreams - Director's Cut combines the original game and the subsequent expansion Rise of the Owlvelord in a single solution, which adds another world to the basic three and which was also reviewed at the time of its launch on pc. The total package represents a significant amount of hours of gameplay that easily exceeds 12-15 hours considering the need to fully explore the levels, and for a title of this genre it is a great result. However, the Director's Cut doesn't just deliver the full experience of the Giana Sisters adventures, it also features some more profound changes. Compared to the previous console versions, on PlayStation 4 and Xbox One the game is presented in 1080p and at 60 frames per second, thus enhancing the considerable detail of the scenarios and the speed and fluidity of the action, also supported by a general improvement in response to controls. A great balancing work has been carried out to make the difficulty more scalable, introducing a ~Normal~ level which in fact also modifies the level design to make it more affordable and less frustrating, reducing obstacles and improving the location of bonuses and checkpoints. The interface now allows you to see more clearly the collectibles collected in the levels and a simple tutorial has been inserted that introduces the basic controls in a more gradual and clear way. Unfortunately nothing has been done to insert a minimum of narrative substratum to the action, but in a platform with a classic spirit like this it is also right. Probably listening to some complaints received on the first version, the developers have increased the variety of enemies, especially in the more advanced levels, and a selector has been introduced that allows you to choose from the beginning which world to access, thus allowing you to immediately explore even those more advanced, although it is decidedly better to respect the pre-established order and enter this tough adventure step by step.", "date": "2017-05-10", "grade": "8.3"}