{"name": "Libera nos a Talos", "ref": "https://multiplayer.it/recensioni/182977-prey-libera-nos-a-talos.html", "text": "The release of the first Prey dates back to 2006, and you probably already know this. What is less known is the fact that in one way or another the first traces of the series (if we can call it that) date back over twenty years. The news regarding Prey in fact start from 1995, the year in which 3D Realms conceived the very first version, to then pass the baton to Human Head Studios in the early 2000s, the team to which we owe the game as we later knew it. An eleven-year gestation, exactly as long as there are those that separate the first Prey from the second, which in reality is not the second. For a certain period, in reality, Prey 2 was actually still in development at Human Head Studios, but this was before the change of course wanted by Bethesda. Let's skip to last year's E3, when the Maryland publisher announced the official reboot of the franchise, calling the Arkane Studios guys home on the crest of the wave thanks to the excellent Dishonored. In the meantime, between a test here and there and the demo published a month ago, we had several opportunities to get to know the 2017 Prey, which has finally arrived to make a clean sweep of all the work done previously, including the Prey released in 2006: it was worth it worth it? Let's find out together! BioShock, System Shock, Dishonored and more: Prey draws from many but shines with its own light! A race gone bad The setting of the new Prey is now known to most, but for the benefit of those who have lived on the moon so far, let's do a little review anyway. In 1963 John F. Kennedy manages to escape the Dallas attack which in real history cost him his life, thus giving rise to an alternative version of the Space Race capable of having repercussions until 2032, the year in which the story narrated takes place. Talos I is a research station located near the Moon, where human activity decades ago attracted the attention of the Typhons, an alien race endowed with extraordinary powers. Acquired by the TranStar Corporation, the former Talos I space station is now the place where the so-called Neuromods are developed, implants capable of modifying the structure of the human brain to allow people to absorb the powers of the Typhons, or in any case to obtain that go beyond those of an able-bodied living being. In this situation begins the adventure of Morgan Yu, a researcher recruited by his brother Alex to go to work aboard Talos I: during a series of initial tests something goes wrong and one of the people involved is attacked by a Typhon out of control. Thus begins a real invasion, which will leave Morgan grappling with the alien threat inside the station, but above all with many questions to find an answer. As per practice, Morgan knows in fact much more than one might initially imagine but at the same time he is struck by an amnesia that does not make him remember anything: the robotic operator January, programmed by Morgan himself, will guide him towards the truth, while Alex will still try to provide his own version of events. Based on the choice made at the beginning of the game, Morgan can be a man or a woman, but this changes practically nothing except in the possibility for those who have the controller in hand to feel more at ease in the role of the protagonist. A feeling of identification that underlies the success of Prey, a title in which nothing is literally as it seems: both in the room where you are, for the reasons we will see, and in the plot developed by Arkane Studios. Chris Avellone's participation in writing the screenplay is just the icing on the cake of a Talos I to be savored to the last drop, following the main story with compelling interest but also letting oneself be carried away by the many secondary missions, destined to reveal so much about the research but also on Morgan himself. The different endings available will reflect our actions, inviting us to rediscover Prey even after completing the first game. Considering the game dynamics, which we are about to see, it becomes difficult to quantify a duration, even if you will hardly reach the twenty hours. In Talos I there are many things to do and many ways to do them, and everything - even the duration - adapts to the style of the player. Was that cup there before? Prey draws liberally from many other works, videogames and otherwise, carefully selecting the aspects to produce something that enjoys a charm of its own. It does nothing to hide it, because it is not written anywhere that being a derivative title must necessarily be a defect. Starting from a beginning that is somewhat reminiscent of the film Edge of Tomorrow (or the manga All you need is kill, from which it iso), as well as the first specimen of Typhon which, not surprisingly, is called Mimic: a little arachnid monster, capable of transforming itself into any object in its vicinity. If you see a cup, jar, or even a medkit in a room, it can sometimes be wise to shoot it to make sure it's not a Mimic who has decided to ambush us, especially targeting the player's coronary arteries. It is above all thanks to these little friends that the first hours of Prey instill in the player's mind a very high sense of paranoia, also increased by the fact that for most of the beginning Morgan is in possession of only one wrench to face the Typhons. For their part, the aliens obviously do everything to increase our fear, starting from an aspect that closely resembles the stuff nightmares are made of: black and menacing shadows, in some cases humanoids like the Spectre, right up to to the Nightmare, a kind of Nemesis from Resident Evil 3 who will continue to hunt us down during most of the adventure. The main weapon with which Morgan is equipped, the GLOO Cannon, says a lot about the real possibilities that he can have in a one-on-one confrontation with an alien: it is in fact a cannon that shoots an extremely sticky glue, thanks to which it is It is possible to block or slow the Typhons, depending on their size. Its nature allows it to be useful even when we don't face enemies, to build a ladder towards otherwise unreachable positions or to put down fires, embracing the variety that permeates all Prey game situations. One of the main advantages of Arkane Studios' effort is in fact to be found in the design of the levels, which opens up a series of alternatives to achieve a set goal. Just to give an example, to open a safe you can take advantage of your hacking skills (obtained through Neuromod), or go in search of the combination among the many notes and documents that can be found around. Even with Typhons, as you may have guessed, the approaches can be different: taking them face-on almost never turns out to be a good idea, which instead is the study of the surrounding environment, to find points in the rooms of Talos I that can help us do out the alien menace. Returning to the early hours of Prey, the game unexpectedly approaches the dynamics of a survival horror, also thanks to the absence of an exaggerated amount of ammunition and the presence of a not exactly huge inventory, in which to find space to also fit hard drives crackers and banana peels. Playstation 4 trophies By playing Prey you will have the opportunity to unlock a total of 49 Trophies. The Platinum type is joined by 3 Gold, 7 Silver and 38 Bronze. Completing the Arkane Studios effort 100% presents itself as a particularly demanding challenge, given that among the various objectives there is also that of completing the entire game without using Neuromod. Another trophy, on the other hand, asks us to complete the adventure first by acquiring only Typhon powers and then by acquiring only human skills. The other trophies are generally linked to the various situations that we find ourselves facing on Talos I, browsing through the many computer workstations found in the station or using skills and objects in a certain way. The three Rs of the future Even if, as already mentioned, the sense of paranoia that Prey pays us homage does not go away so easily, after a few hours of play things change in favor of a greater threat from Morgan himself, destined to pass from the role of prey to that of predator. The various Neuromods, especially the alien ones, provide the protagonist with a growing series of weapons with which to face the Typhons, among which we point out the ability to unleash psychic waves and to blend in like the Mimics. However, all this will come at a price, because by losing his human identity Morgan will end up looking more and more like the creatures he fights with, to the point of confusing even the protective turrets that could come back to haunt him. The Neuromods themselves can be built through the craft system, based on a perfect waste cycle that leads from their collection to reuse, passing through their reduction to various types of material. By collecting the banana peels mentioned above, for example, it is possible to use one of the many recyclers present on Talos I to generate organic material, which can be introduced into another machine called a fabricator to create a brand new medikit. As you may have understood by now, many of the aspects that make up Prey fit perfectly together, but there are some that suffer more than others. The moment you start shooting, you surrenderI realize that the shooter dynamics are quite linked, to the point of even being frustrating in some situations. For example, especially when we face enemies, the GLOO Cannon almost never seems to shoot where we really want, even creating in the case of Mimic a precious cover for the enemy. We do not exclude that this could be the result of a precise choice by Arkane Studios, which as we have already said wants to push us to exploit the surrounding environment to overcome difficulties, rather than face them as we would in a Call of Duty. However, the thing improves when you begin to upgrade weapons, for example by providing them with a greater range. Some problems also in backtracking, linked to the free exploration of Talos I by the player: passing from one part of the station to another, one faces loading times that are long enough to break the tension created in the player up to that moment . Aside from that, you can still forget about getting bored while going from one point to another, because suddenly you may find a Typhon in front of you even in an area that you have recently cleared. Lonely men Morgan Yu's adventure takes place almost completely alone, limiting contacts with other people to very few moments. There is therefore no possibility of witnessing who knows what was said, because the player in Prey is guided only by the many noises that a structure like Talos I is able to produce, together with its guests. The delightfully retro-futuristic soundtrack helps to do the rest, adapting with excellent dynamism to the various situations presented by the game. The dubbing in Italian is well made, present together with the translation of all the texts in our language to allow everyone to properly savor the depth of Prey's narrative system. In graphic terms, Talos I perhaps lacks places that trigger a real ~wow effect~, even if there are moments like those outside the station that can still remain impressed. The transition from being built by Russia in the 1960s to the structure we can admire in 2035 is documented by a number of places that differ in aesthetics, ranging from retro to futuristic. We leave to personal taste the choice of resorting to a style of the characters similar to that seen in Dishonored: as far as we are concerned, we did not mind, even if in the ~historical~ context in which Corvo and Emily moved, the trait seemed to make it better. The artificial intelligence of the enemies is smart enough to keep the player constantly on their toes, in fear of being suddenly hunted by a group of Typhons. Considering that even at a normal level only two well-aimed blows can be enough to meet death, one must always keep one's eyes peeled. As you know, the multiplayer component is absent in Prey: given the amount of things to do and see, there is no need to make a drama of it, especially if we consider that the time to devote to a possible multiplayer mode could have jeopardized the quality of the single one. And that would have been a shame.", "date": "2017-05-10", "grade": "8.8"}