{"name": "Controcampo 2006 - Recensione", "ref": "https://multiplayer.it/recensioni/controcampo-2006-recensione.html", "text": "During an original press event set in the familiar Mediaset studios, the ~star~ of the television program of the same name, in the persons of Sandro Piccinini, Graziano Cesari and Eleonora Pedron (and with the participation of the author Ettore Rognoni and Fabrizio Vagliasindi, strategic consultant by Leader) presented the product and its salient features. Product whose main prerogative is to keep intact the usual assumptions of PC Calcio and football management in general, to which are added a quantity of synergies with various media, and in particular the Controcampo website, the newspaper of the same name and the same transmission on digital terrestrial. In our role as president and manager of a football club, it is possible to deal with the usual problems of athletic training and the buying and selling of players, through to the hiring of assistant coaches, doctors and technical directors... without forgetting of course the squad selection and formation setup. As for the distinctive features of Controcampo, we can start by including the full motion video tutorial, interpreted by Piccinini and Pedron or the comments on the replays following the match, by Graziano Cesari. At the end of each match, in the spirit of an episode of Controcampo, we will also have to answer Piccinini's questions, both closed and open questions (the answers to which will appear in a special virtual edition of the newspaper). [C] The initial screen with the introductory movie and the tutorial by Piccinini&amp;Pedron At the end of each match Piccinini will make us; a question... Whose answer will end up in the future. on a (dull) front page of Controcampo. [/C] An apparently consistent customization work, albeit completely accessory and with exclusively aesthetic purposes. Furthermore, one cannot fail to notice how many of these ~aggregate~ elements communicate a certain feeling of ~superficiality~. For example, the films of the interpreters are few and grainy, with an audio quality that can be decidedly improved, and integrate with the interface in an approximate way. Graziano Cesari's ~moviola~ includes very few recorded phrases, which are often repeated several times for a single game and on the occasion of very different actions. In general, after watching the first time, the entire section becomes negligible. Likewise, Piccinini's ~interview~ is reduced to the more than classic cross-type question present in all editions of PC Calcio, simply proposed in a different graphic context. Finally, the open-ended question and the consequent ~front page~ of Controcampo constitute an even more superfluous addition, both for the poor graphics of the latter and for the (zero) impact on the game itself. However, there is feedback on the gameplay front in this partnership between Gaelco and Leader/Mediaset, especially if we consider the close relationship with the other media involved in the project. To begin with, by visiting the TV program's website, it is possible to try a quiz game - obviously in a football context - through which to win codes to be used in the video game to obtain various advantages, from a higher budget to better performance for the players . Similarly, following the broadcast on digital terrestrial it is possible to interact with the remote control, answering questions that will give away further codes, while the paper newspaper will publish others every week. The game itself isn't particularly difficult even for a novice, while this system of codes - which are timed and therefore have their own expiration date - was designed above all as a means of adding variety to the online competition (as well as obviously public loyalty technique to the Controcampo product in all its forms). [C] A pleasant detail are the photos of all the players in the league. Compared to PC Calcio 2005, the interface is much more modern. significantly improved and is; It is possible at any time to monitor the mood of the fans, of the club and of the club. and so; Street. The prince of all derbies... [/C] Final comment Controcampo 2006 is an initiative with innovative intentions, perhaps the first example in Europe of a video game able to benefit from a television format beyond the simple license and which at least opens the way for future projects. The idea of combining the game with a television quiz show, the site and the newspaper is certainly commendable, but a real approach to the game mechanics would have been more desirable, rather than the simple release of codes for circumstantial use. Likewise, the ~exposition~ of the well-known faces of the show is morea red herring, that a starting point for elements of real added value compared to the classic PC Calcio and the not exciting technical realization does not help sugar the pill. All in all, a production that lives up to its budget price, but the advice is to check your expectations before buying it.Pros Playable and immediate Synergies with the TV programme, the site and the newspaper It's still PC Calcio... Cons ...but certainly not Championship Manager! the codes are more of a ~cheat~ than a real addition to the game Disappointing cinematics and speech Developed by Leader in collaboration with Gaelco, Controcampo 2006 is a football management game based on the many years of experience of PC Calcio, a now famous name in Italy that has populated our newsstands for years. In fact, as the veterans of the series will certainly recognize, Controcampo shares every aspect of the game mechanics with the previous editions of the Spanish managerial game and in particular with the 2006 version, of which it has the same interface. However, what distinguishes it is not only an obvious change of name, but a whole series of additions and modifications to the basic formula which aim to personalize this new Italian edition, transforming it into a product with unprecedented multimedia appendices. Let's see what the result was. [C] The logo of the game Compared to PC Calcio, the only difference in the managerial phase is the management phase. the fact of having Piccinini as assistant... Training selection [/C]", "date": "2006-05-29", "grade": null}