{"name": "Rotolando verso la cima", "ref": "https://multiplayer.it/recensioni/182873-tumbleseed-rotolando-verso-la-cima.html", "text": "We are now accustomed to using the two analog sticks in such standardized ways as to be surprised if someone proposes a different interpretation, even more if it is a solution as original as the one offered by Tumbleseed. After the twin-stick shooters, here is a type of game that requires perfect coordination between the two controls but which is also completely original, even if the idea seems to have been taken from an old arcade. Ice Cold Beer, we read, was an old Taito arcade released in 1983, an almost entirely mechanical machine that proposed a strange mix between a ~micro-guide~ and a pachinko, in which you found yourself moving a tilting bar with two joysticks by sliding a metal sphere on it, trying to avoid the holes in the background to arrive intact at the finish line. This is the structure taken in full by the developers of Tumbleseed, but greatly enriched by various new features and elements of variation. It involves transporting a seed from the village down to the top of a mountain, rolling it on this bar (a sort of climbing plant in this case, to stay on topic), which can be tilted to the right or to the left with the coordinated use of the two sticks. The principle is the universal one of the level, whereby the seed rolls with variable speed due to the effect of gravity depending on the difference in level created, or remains in a precarious balance if the bar is kept straight. The difficult thing is being able to avoid the obstacles and especially the holes of variable size that soon begin to appear everywhere on the scene, due to a sort of infestation that threatens the very existence of natural life on the mountain. Precisely to eradicate this plague on the small and harmless seed protagonist is required to reach, in this complicated way, the summit of the mountain and save the plant world. Tumbleseed is the epic journey of a rolling seed to the top of the world Rolling north The basis therefore concerns the constant upward progression of this seed balanced on the vine, above a scenario that flows vertically and changes connotations depending on the area of the mountain on which we find ourselves, but the composition of the levels is procedural, therefore the The gaming experience changes with each game while the scenarios are divided into some main types. Beyond the amount of holes to avoid and enemies that crowd the screen, the difficulty lies in the need to handle the rod with extreme precision to make the seed go exactly where we want it, and it's not a simple thing even after hours of play . To further explore the game mechanics there are other elements to take into consideration: various characters will entrust quests to the protagonist (albeit very simple, given the scarcity of possible interactions) and the possibility of changing the appearance and characteristics of the suit introduces numerous additional variables to the basic action. Dealing with a seed, its main feature is that you can plant something, as long as you have crystals to invest, and the latter are collected around the levels. Passing over certain fertile areas, different results are obtained depending on the configuration of the seed, with the possibility of growing a tree that serves as a checkpoint, obtaining new hearts that allow you to continue after being hit or fallen into a hole, collect new crystals or grow thorns around the protagonist. Different types of seed determine ~plants~ with different effects, therefore it becomes essential to alternate between the various configurations in order to dose the effects and follow your own strategy to go as far as possible. Further types of seed and upgrades can be purchased in the villages, or conquered on the field, each time choosing the one that best suits your style among various options. It is clear how all this makes the structure of the game much deeper and more complex, beyond the commitment required by indirect control of the sphere. A moving picture The brilliant intuition (although derivative, apparently) comes out of Benedict Fritz, but it was then the collaboration with Greg Wohlwend that instilled in Tumbleseed that particular identity that comes from a very defined and cohesive artistic vision. Being the author of Ridiculous Fishing and Threes, the experience and the particular touch were certainly not lacking in the development of this game and the results are visible already at first glance. The line is clean, the figures are built with a precise design and with marked outlines like the color contrasts. Theeverything creates an effect similar to a naive painting with a very marked and unmistakable style, embellished by many animated elements and by an audio accompaniment perfectly calibrated on the particular subject. The aesthetic aspect is so accurate that it does not represent a simple tinsel in Tumbleseed, but contributes in a fundamental way to building the particular identity of the game and pushes you to go back to it even just to see the variations that characterize the different areas of the mountain to explore. As for the Switch version, a special mention goes to the excellent use of Rumble HD, which returns a perfect vibration in response to the rolling of the suit, which helps to further immerse you in the action. The mechanics favor the procedural construction of the levels, which increases the variety of situations and replayability, also enriched by the presence of daily challenges that provide additional possibilities to the standard adventure, which is in any case already quite demanding on its own. The average difficulty level is actually high, so much so that the game often becomes frustrating also due to a control system that has a very minimal margin of error, yet it is difficult to detach yourself from this game and its particular aspect is certainly one of reasons.", "date": "2017-05-06", "grade": "8.0"}