{"name": "Di padre in figlio", "ref": "https://multiplayer.it/recensioni/182804-father-and-son-di-padre-in-figlio.html", "text": "The title immediately recalls the verses of Cat Stevens, but the father/son relationship illustrated in Father and Son is something different from the list of paternal advice and considerations set to music by the famous song. Here is the story of a difficult relationship that intertwines with various other stories whose connection is, curiously, the National Archaeological Museum of Naples, which is also the body that promoted the development of the game in question. It is a graphic adventure represented on a two-dimensional plane and composed of splendid screens that reproduce glimpses of Naples and the Museum, traveling through time and space to compose a short and strange story, but still able to leave something as more heartfelt stories can do. The protagonist is Michael, a boy who has recently lost his father from whom he has been separated for a long time precisely because of the latter's commitment to managing the MANN. The desire to discover the secrets of a job that for so long has absorbed every aspect of his father's life, effectively depriving him of his figure, pushes the boy to visit Naples and the Museum, discovering unexpected secrets in what becomes a journey of investigation of parental relationships, love, death, history and art, also ranging for various historical periods ranging from ancient Egypt, passing through Pompeii about to be destroyed and the Bourbon Kingdom up to the contemporary era . In all of this, moments of investigation and exploration alternate with contemplative phases, in a balanced balance between the desire to tell an intimate story but with universal values and the educational impulses of what is in all respects the first video game officially created by a museum . More than a graphic adventure in the strict sense, it is therefore a form of digital narrative, but the player is still required to play an important active part in the story. From the National Archaeological Museum of Naples comes a fascinating adventure on feelings, history and art Choices in history The interaction is very simple and requires moving to the right or left on the two-dimensional plane, with the possibility of interacting with elements of the scenario or conversing with some characters. The game therefore develops entirely on the narrative, on the desire to explore the various areas and discover the objects to interact with which often allow you to obtain interesting historical information related to works of art and archaeological discoveries. Father and Son sometimes betrays an educational software nature, which is right and understandable considering that it is a video game essentially focused on the National Archaeological Museum of Naples and made to promote this institution in an innovative and original way. However, a really interesting story and a graphic adventure have been built around this idea which, although elementary in its structure, is not lacking in depth. The most distinctive elements of this experience are represented by the time travel that allows you to give ample breadth to the game world, and by the possibility of making choices - especially as regards the answers in the dialogues - which can influence the continuation of the story and lead to endings. different, which leads to playing the adventure several times, thus balancing its brevity (it ends in about an hour of play). The great charm of Father and Son also derives from its excellent aesthetics, entirely based on an original classical soundtrack and hand-drawn drawings with a beautiful brushstroke effect which is based on contrasts including strong clear colors which present a reproduction of Naples and the Museum halfway between realism in the arrangement of the objects and their main characteristics and dreamy, a style appropriate to the vision of the city and of the large building by the protagonist, suspended in a sort of dreamlike and reflective journey.", "date": "2017-05-04", "grade": "8.5"}