{"name": "Inarrestabile Chuck Norris", "ref": "https://multiplayer.it/recensioni/182591-nonstop-chuck-norris-inarrestabile-chuck-norris.html", "text": "A game where the protagonist does nothing but hit enemies continuously, without ever stopping and continuing to gradually increase his strength seems to have been tailored for Chuck Norris, and Flaregames must have thought of this immediately after publishing the good Nonstop Knight. Of course there was a little atmosphere and setting to be reviewed, but the base seemed to be written on purpose to lead a little hands and solve problems with kicks turned, putting street criminals back in their place 24/7. That's right, the busy knight has turned into a super deformed version of the great Chuck, while the enemies and fantasy settings have taken on a much more urban look, while not giving up the underlying comic style, but the substance has remained practically unchanged . Everything was then spiced up by the Chuck Norris myth, with all the internet drifts of memes and ~facts~ that we all know very well by now, for a final result that also demonstrates remarkable coherence, despite the fact that the premises are completely insane. In practice, it is an ~idle game~ that mixes elements from scrolling fighting games, RPGs and clickers, in which the protagonist patrols the streets by moving automatically and leaving the player to manage the blows to be launched against the enemies, in addition to managing of the character in all his role-playing digressions, which represent a fundamental aspect of the gaming experience. In short, it is a real reskin of Nonstop Knight, which conceals the same identical structure of the predecessor under the new aspect, with some simple adaptations to the new context but a soul substantially shared by the two games. Nonstop Chuck Norris is a simple game, but controlling so many characters is always a thrill Chuck Norris Facts The fact that the character moves by himself may seem like an absurd limitation to the player's interaction, and at first the impression is also confirmed by the lack of involvement in the action, but as soon as you start leveling up things get better complicate and timing and tactics begin to emerge as necessary elements. In addition to launching attacks, the player must also decide which special ability to use and at what moment, taking into account the recharge times of each technique and obviously the impact this can have in any given situation. Once the expected number of enemies have been defeated, the level ends and you move on to the next, with the possibility of facing bosses at regular intervals. The mechanics are simple and the difficulty level rises very gradually but at more advanced levels it also requires a fair amount of effort, which is accompanied by an ability to manage the character optimally. The elimination of the various punks and rogues who infest the streets allows you to earn money which can be invested in the purchase of new equipment, including elements of ~armor~ (clothes and headgear in a decidedly colorful style) and weapons, obviously in keeping with the historical background of Chuck Norris, all things that can be further improved with purchases of upgrades. Advancement by experience levels guarantees the unlocking of new special techniques that are of fundamental importance as the game progresses and there are also the classic phrases taken from the famous ~Chuck Norris Facts~ that emerge with the acquisition of new rewards. It is precisely the constant evolution of the protagonist that is the soul of the game: Chuck continues to disseminate punches and kicks regardless of the player's action, putting the criminals back in their place even if we are not controlling him, which always keeps the progression active. to which the inevitable microtransactions are also linked, since it is a free-to-play. Beyond the actual action, therefore, the constant growth of power is the spring that triggers interest, and if this power is associated with the figure of Chuck Norris the mix becomes explosive.", "date": "2017-04-28", "grade": "6.7"}