{"name": "The Regiment - Recensione", "ref": "https://multiplayer.it/recensioni/the-regiment-recensione.html", "text": "Good you become, just restart So even the tutorial is now home to endless sessions where you can repeat each gesture infinite times, like precise war machines. Old and dated, they could at least spare us the CPU bugs, which starts the timer when you're not in the line of fire or doesn't notice in time that you've already checked all the targets. It doesn't matter, we still wholeheartedly recommend it to you to learn the terrible double-tap technique, i.e. the neutralization of a target with two bullets fired at the torso. As for the rest you will have to deal with the actions in the absence of light and the use of grenades. For the record, we cannot forget that this Killing House is a faithful reproduction of the original, in which the real members of the S.A.S. train, thanks to the collaboration of former instructor Rhett Butler. So, after the training, spit on the instructor's boots and get ready for the first real mission. It travels back to the distant 1980s when the Iranian embassy based in London was taken hostage by a group of terrorists, so take your responsibility, this is where history is lived. The sunset of diplomacy Each of the four scenarios, between the British Parliament and a subway network, is made up of three missions, for a total of twelve maps. Do they seem few to you? Indeed they are but Konami has thought of everything. Why allow yourself to save when in reality this is certainly not possible? An acceptable concept except that it undermines the fun factor by reducing it to a minimum. We are not exaggerating and now you will understand why: each mission must be completed within 3-5 minutes, completing all the objectives without the slightest flaw and with an evaluation at least equal to that of Corporal, the same one that forced you in the tutorial to repeat your curtain dozens of times. Unfortunately this mechanism only generates frustration and boredom, deadly boredom. Repeating the same carnage only to find that your pointer does not detect the target or that a teammate got himself killed while looking in the air is not engaging and does not give you any satisfaction. The nice thing is that the game doesn't stop if the conditions for the success of the mission fail, but you'll have to wait for the end and find out that no, we don't know why you aren't Corporals yet. Maybe that time it took you a second too long to handcuff a terrorist, or when you couldn't make your way down the corridor because the rest of the team was piling up against the walls. Hard to say, try again and it will get better. Perhaps. The sunset of diplomacy With this in mind we come to the brutality of guerrilla warfare. An interesting aspect of The Regiment, which allows it to distance itself from the Tom Clancy saga, is the frenetic and bloody action component. I report from the official site a sentence that galvanized me before discovering the harsh reality of the Konami title: ~No boring mission planning is necessary, because in the real world when the S.A.S. comes into action, the negotiations are over!~. So don't expect long sections sitting at a table to study the map, here the doors are shot down and you enter shooting like a cowboy. Each soldier is equipped with a gas mask, secondary weapon lighting and a night vision goggles, come rain or shine you won't have to worry as the timer ticks down. And the blood as well. Before starting the action, however, it is possible to choose whether to play in arcade or simulation mode; in the first you will be able to handle a few shots, also being able to count on the indicators, while in the second you will not know how many shots are left in the magazine and a well fired bullet can knock you down forever. Again, given the technical difficulties of the game, you're only likely to repeat each map a dozen more times, but at least you're free to choose. don't expect long sections sitting at a table to study the map, doors are shot down here The sunset of diplomacy Although the S.A.S. run from room to room this isn't an old school FPS as we say and teamwork counts a lot for the success of the action. Unfortunately, the range of available commands is very limited and ranges from the breakthrough request to the breakthrough request with a grenade, basically. However, the rest of the team acts in full autonomy, with a good self-management ability, often saving you from a not very noble end. In some scenarios you will also find yourself cooperating with multiple autonomous teams and this greatly increases the sense of belonging to your team. Yesbut only on the surface, since any action other than shooting anyone still standing in the room is entirely superfluous. The enemies are in fact devoid of an A.I. believable and this is the worst that can be said for a tactical FPS. In fact, what is the point of wasting so much time organizing cover or making sure you can defuse the bombs by clearing the field when often the enemies don't even shoot at you? There are scenes where while you are shooting some terrorists inside a room some of them keep harassing the hostages. ~Um, sorry we are from the S.A.S. Nothing? All right then let's have a look in the living room~. The sunset of diplomacy The same goes for the more daring who adopt true guerrilla tactics such as appearing from a low wall and disappearing immediately behind. Nothing more and nothing less, not even a system to understand if they are still alive without having to go over the body every time and see if the handcuff icon appears. It's fine to want to add frenetic action for people with a cool head, but so much precision in the means of warfare is useless if we have to behave like bloodthirsty people to finish in good time so as to get a good grade. Some balance is missing between the pretensions of realism and the gameplay, due to the atrocious gaps affecting the behavior of the enemies. Sadly, the worst is yet to come. Where have we met before? An FPS should make use of a graphic engine that is at least in step with the times, on the contrary, considering the large number of games of the same genre, it is their duty to try at least to propose innovative graphic effects. A title that aspires to simulation could thus gain considerable depth, while instead The Regiment appears a hasty conversion of the console counterpart, with an old scalable Unreal Engine that could be seen around a few years ago. Not only does it suffer from frequent dips in frame-rate but it is notable for some of the ugliest animations seen in some FPS recently. The enemies are rigid and carelessly modeled, often reproduced in series and unconvincing in clothing, which, like any other element, suffers from boring and flat textures. Not even the S.A.S. they save themselves from a range of mediocre and fake movements, further impoverishing a graphic sector that suffers from the now dated calculation of lights and shadows. Very few elements of the surrounding scenery can be reduced to pieces and do not imagine objects flying everywhere, because physics is applied only where strictly necessary, as in the case of doors. Where have we met before? The voices dubbed in Italian are just enough but supported by a discreet sound sector, which makes good use of Dolby, even if at this point it certainly cannot save the defects that afflict The Regiment. There is little to say, Konami has made use of the precious collaboration offered by the S.A.S., appreciable during the videos, where the missions are introduced to us by an ex-veteran such as John MacAleese. On paper there were the conditions for a great game, but not even the PC version improves the fate of a title that on Playstation 2 amplifies every flaw. On the contrary, the suspicion is growing that in passing from the console to the personal computer Konami has opted for a quick and cheap conversion. You could at least have fun with the multiplayer mode, which puts you alongside some friends with whom you can share the tasks along the different maps, but it is just worth a possible re-proposition at a budget price. Final comment The Regiment misses. Hurried in the realization, it suffers from many shortcomings in the AI that make the attempt to make strategic what ends up being an FPS with a strong arcade component, frustrating to the point of exhaustion and repetitive. The idea of forcing the player to retry each mission until they reach a high rating is just crazy, because it doesn't add any real challenge factor. The different bugs only diminish the charm of a nice idea, intelligent in choosing to focus on the use of the S.A.S. British, which Konami was also able to enjoy as a privileged source of information. The situation becomes even grayer if we take into consideration the graphics sector, to say the least antiquated and lacking in style. It remains an excellent cooperative game system which, however, is not worth a title sold at full price. We sincerely hope that it is only a first attempt made by Konami and that it soon learns from its mistakes, as it forced us to do with the maps of The Regiment.Pro The S.A.S. is a fascinating and unexplored team Fun in multiplayer mode... Cons ...frustrating and repetitive when played alone Pathetic AI Technically belongs to an older erata God save the Queen or the S.A.S. We owe Captain David Stirling the idea of developing an elite corps that would later evolve into the S.A.S.. It formally exists since 1 July 1941 and is now made up of three regiments. One of these is stationed in England, ready to intervene 24 hours a day in case of a terrorist emergency. Although the episode of the Iranian embassy is perhaps the most famous, there are still many emblematic missions that have seen the use of British special troops, from the Faulkner Islands to the Gulf War. The S.A.S. is one of the most advanced special corps in the world and its secrecy is made even more famous by the only possible answer for each of its members who should end up in the hands of the enemy: ~I'm sorry I can't answer that question sir/ma 'am.~ And to think that there are those who complain about the tertiary sector. Cross-platform The PC version is a rough conversion of the console one and makes only minimal use of the improvements offered by commercially available graphics cards. On the other hand The Regiment runs on the second generation console like a first generation game. And if anyone hadn't noticed, we're at the dawn of the third. There is no substantial difference between the two; deduct half a point from the global if you choose to play at Sony. Good you become, just restart Konami must have thought that Rainbow Six Lockdown left an unfillable void that only the Kuju team could heal. Commendable attempt, in particular for the happy choice to represent an obscure and not very thorough team like the S.A.S., however shipwrecked against the wall of bugs and mediocre realization. It's a real shame, because The Regiment isn't all to be thrown away, but when a product is developed without love it ends up below the threshold of 6. However, some lovers of the genre might like a tactical title in these lean months and for this reason we entered the Killing House to document the hard life of the English special soldier. Usually the tutorial should gently guide us in learning the basics but this is the hardest and most frustrating training seen so far. The first part is mastering the art of managing spaces from a position of dominance, which allows you to keep tabs on every visible inch of the room. Nothing to complain, indeed I am supported by the enthusiasm of the beginner and in fact I look pathetic. After a few attempts, we probationary soldiers also pass the mission but it is precisely here that Konami's ruthless law is learned: it is not enough to be Recruits or Privates, it is necessary to complete each test with the Rank of Corporal.", "date": "2006-05-26", "grade": null}