{"name": "Tactics Ogre: Reborn", "ref": "https://multiplayer.it/recensioni/tactics-ogre-reborn-recensione.html", "text": "How do you further improve a title that was itself already a kind of remake? Square Enix had the solution at hand, the most banal of all. It was enough to take Tactics Ogre: Let Us Cling Together for PSP, which was released in 2010, throw a ~smooth~ filter over it, and re-propose it at a budget price, the game was already a masterpiece. And that's partly what the Final Fantasy publisher has done. The PSP version of Tactics Ogre, as we said above, was already a remake of the original, released for the SNES in 1995, so it would have been easy to go down the road of the low-key remaster that is so trendy lately. Instead, it was preferred to give less room for technical improvement to focus on gameplay, building on the feedback of players who have loved Tactics Ogre for years and have been clamoring for its return. Our review of Tactics Ogre: Reborn will explain why you should definitely play - or replay - one of the best turn-based strategy games to ever grace our favorite hobby. Story, graphics and music Tactics Ogre: Reborn, multiple choices change the story The series created by Yasumi Matsuno when he was in Quest, and before he went to work on Final Fantasy Tactics for Square Enix, has always been a bit schizophrenic: it changes its name from one episode to another, going from Ogre Battle to Tactics Ogre in based on gameplay, and has only three main episodes and two spin-offs. And perhaps it is precisely for this reason that you don't need to have played the other titles to understand the story of Tactics Ogre: Reborn, which is perfectly autonomous and contained. It's also totally in English: the lexicon used is refined but fluent, however you could have problems if you don't know the language, above all because there is so much, really so much to read and the plot isn't exactly that light. Inspired by the Yugoslav wars of the early 90s, Matsuno wrote an extremely political story, made up of intrigues, plots, alliances and betrayals that revolves around the character of Denam Pavel who, together with his sister Catiua and childhood friend Vyce, fights in the Rebellion to retake the kingdom of Valeria from the invading Galgastani. Those who have played Final Fantasy Tactics will notice quite a few similarities in the solemn and fatalistic spirit of the narrative, which makes perfect sense given that the two strategic RPGs share the same authorship. In Tactics Ogre, however, the supernatural element has a more contained role for much of the campaign: we are aware that the comparison has become a bit trivial by now, but Tactics Ogre is truly Game of Thrones of Japanese RPGs. The twists are wasted; no one is ever safe and the story continually questions the survival of any character, including the protagonists. The player is called upon to make numerous choices that establish Denam's alignment and radically transform the campaign: the missions, cutscenes, endings change and some characters may even decide to abandon the protagonist's army. Tactics Ogre: Reborn, a detail of the game map This system makes Tactics Ogre: Reborn an extremely replayable RPG, with an adult and compelling narrative, accompanied by the sumptuous soundtrack - now orchestrated - by Hitoshi Sakimoto and Masaharu Iwata, the same composers who would later also grace Final Fantasy Tactics. And in fact the music is very similar, there is little to do. Among other things, this new version implements an unprecedented dubbing in English or Japanese which improves the involvement in general, although not all the actors are always on the spot. The main image of Tactics Ogre: Reborn In short, the narrative is very faithful to the original, and we had the impression that Square Enix has not changed one iota compared to the PSP edition, but this means that Tactics Ogre: Reborn still lacks in the characterization of a perhaps too large cast. The writing seems to favor above all the three protagonists Denam, Catiua and Vyce, while the supporting actors, who are really many, are outlined more summarily, especially the slightly too stereotyped antagonists. It must be said that it is also a bit difficult to see the beautiful illustrations by Hiroshi Minagawa and Akihiko Yoshida in the 2D sprites, and perhaps this is the weakest aspect of this remastered version. Despite being characterized by an old school pixelart, we might have preferred a revision of the sprites, which are lacking in details and animations. Square Enix has instead concentrated on effects and lighting, limiting itself to applying a filter that ends up significantly graining the image on large panelssize. The result isn't unpleasant at all, but the smudges catch the eye, especially in the gap between the 2D sprites and the isometric scenarios. We haven't had the opportunity to test the Nintendo Switch version of the game, but experience - Triangle Strategy and the various Disgaea, to say - teaches us that games like this perform much better in portability, so make your own considerations. Improving a masterpiece Tactics Ogre: Reborn, the class system ensures a huge variety of strategies If we were to list all the improvements that Square Enix has made to the base of Tactics Ogre: Let Us Cling Together this review would become an unreadable brick. There are many, many, and all wonderfully effective, but perhaps it's better to start from the basics, in respect of those who have never had the good fortune to play Tactics Ogre. It is a turn-based strategy, and so far it should be clear, with a setting very similar to the recent Triangle Strategy or the better known Final Fantasy Tactics: between one interlude of the story and the next you have to manage your own army, made up of the protagonists and from generic mercenaries that we can recruit, and the battles take place in checkerboard maps where we will have to deploy a certain number of units. On the battlefield, the order of actions is defined by individual speeds, and is always visible. Action and movement are independent: in a unit's turn we can choose whether to move or act in the order we prefer, always respecting the limits imposed by the characteristics of the character. Characteristics - such as the weapons you can wield or the spells you can cast - that depend on a robust class system: in this Reborn version there are no longer individual class levels, so changing a character's class does not incur any penalty and you don't have to start from the minimum level. Tactics Ogre: Reborn, the interface has been redesigned and streamlined Already this change affects the gameplay and the smoothness of the experience in a substantial way. It means that we can change the configuration of our favorite team to try new strategies without any effort, and it's just one of the many improvements that Square Enix has made to the game formula with the clear intention of making it more accessible and intuitive. The screens have been redesigned and partially reorganized, in order to facilitate any choice or modification in terms of weapons, equipment, accessories, spells and skills. The experience has been streamlined overall with a number of nifty implementations, such as the ability to save several squads in convenient slots for quick selection when deploying, or the training mode, which totally replaces the random battles in the map and allows to ~train~ our units much faster, perhaps drawing on the configurations of artificial intelligence that can play for us, relieving us of the tedious grind that characterizes this genre. Tactics Ogre: Reborn, the effects are now in high resolution We also appreciated the addition of secondary objectives, completely optional assignments that change from mission to mission and guarantee extra experience points or very useful consumables such as the new Charms, which can bestow entire levels on individual characters or increase their stats. The idea would seem to have been to provide players with all the possible elements to have fun right away, even if the learning curve of the game systems and the various features remains quite steep, despite the excellent tutorials. Tactics Ogre: Reborn is an extremely dense game of mechanics, objects, skills and parameters that must be taken into account during the games, especially in the advanced stages of the campaign. Square Enix has made changes that make absolutely sense - for example, each skill now consumes the same universal resource, Magic Points - and introduced new mechanics such as cards, which appear completely randomly on the board and grant permanent benefits or disadvantages: their presence alone changes the way we approach combat, making us decide whether to move units to collect cards or not, even knowing that enemies could appropriate them. Tactics Ogre: Reborn, the game is completely in English In this sense, the artificial intelligence has been revised and corrected compared to the PSP version. The enemies generally appeared to us more alert and aware of the circumstances, with a clear tendency to take the best cards on the battlefield and to target the weakest units of our company. At the sameThus, Square Enix has also significantly improved the artificial intelligence of NPC allies, who now show much less suicidal tendencies than in the past: those who have played Let Us Cling Together will remember with horror the rescue or escort missions, in which it was necessary to protect units fragile who had the habit of going to meet enemies instead of running away. The NPCs in question now heal themselves, look for the best ways to keep away from enemies or reach the player's party, and generally stay alive more easily. In the worst case scenario, you can always resort to the Chariot Tarot, a feature that allows you to rewind the rounds of the game within a certain limit - which however increases as you continue in the adventure - to change an unfortunate move that you may have regretted and try a new tactic. Tactics Ogre: Reborn, elemental resistances play a key role These changes might suggest a misconception that the game has become easier. Instead, Square Enix has brought an all-round balance not only to heroic units, classes and various skills, but also to certain more subtle game dynamics. The Party Level is one of them: it is the maximum level that each unit can reach up to that point in the story, and which therefore prevents the characters from being improved too much through Charms or training and then overcoming the missions by brute force. The other interesting difficulty tweak is permadeath, which now kicks in if you don't revive a defeated character within three turns. Even the most controversial choices - such as the removal of the Rogues from the playable classes - take on more defined outlines in the long run, in a delicate balancing act that only those who have played the previous version will be able to truly understand. Tactics Ogre: Let Us Cling Together was a long and demanding title, but never frustrating, which only sinned in balancing some missions that were too long or repetitive in the final stages of the campaign. The Reborn version would seem to have been designed to meet the needs of old fans, who perhaps want to try some new strategy without getting entangled in a frenzied grind of levels, and of the new ones, who in this way will approach the story in a more relaxed way and to the gameplay of this wonderful series.", "date": "2022-11-10", "grade": "9.0"}