{"name": "Syberia III", "ref": "https://multiplayer.it/recensioni/182483-syberia-3-controlli-da-brividi.html", "text": "When Syberia III was announced, many wondered what sense it made to follow up on a mini-series that was accomplished both in terms of plot and artistically. Benoit Sokal, the cartoonist author of the character and artistic director of the series, had been quite clear on the matter and after the second adventure starring the lawyer Kate Walker, who was inextricably linked to the first, he had dedicated himself to Paradise and Sinking Island, two graphic adventures of good quality but not very successful. Perhaps it is precisely in the difficulties encountered in post-Syberia to make ends meet that one finds the justification for a sequel that tries everything to be appreciated, but often manages to make itself hated. Will Syberia III be on the levels of the previous two episodes? Find out in our review! Kate Walker Syberia III opens with a knocked out Kate Walker in the snow being rescued by the youkol tribe. The lawyer, already the protagonist of Hans Voralberg's dream journey (narrated in the first two episodes), is on the verge of death and is taken to a clinic where, when she regains consciousness, she finds herself a prisoner of some shady figures whose aims are not clear. Some places are really well described From here begins his journey for freedom first, then to help the youkol with the migration of snow ostriches (then he will also become something else, but we don't want to anticipate anything). If we considered Syberia III only from a narrative point of view, we would only have to agree that we are dealing with an excellent title. Sokal has not lost his ability to describe fascinating and richly characterized worlds (for example the youkol market is a small masterpiece) and has directed the entire title with great skill, despite some drops in the quality of the script, particularly with some characters secondary, and despite the obvious technical limitations, the latter children of a production certainly not triple A. Kate Walker is still a credible and fascinating character, tormented but strong and capable of getting away with using her intelligence even in the most complicated situations. Even when we consider the puzzles Syberia III defends itself quite well. Some accuse the game of being too easy, but in truth the difficulty seemed to us in line with that of the first two episodes, which have certainly not become famous for being insurmountable. Like any self-respecting graphic adventure there are items to collect and use with other items. There are also numerous mechanical puzzles: for example in one circumstance you have to align a key with a lock by turning wheels, while in another you have to manipulate locks to filter water from a river. In short, a good story, not difficult but interesting puzzles and a fascinating protagonist, what more could a fan of the genre want? Unfortunately we have described the best of Syberia III so far, which is marred by a problematic overall implementation. Interface and control systems Syberia III often seems to not know what it wants to be. It was probably designed as a classic point and click adventure, but the need to make it playable with a controller has led to the creation of a Frankenstein interface that leaves you hate from the beginning until the end of the adventure (it took us a little longer twelve hours to complete it). Hello, I'm an irritating interface Microids recommends using a controller, but even that isn't a completely satisfactory solution. But let's try to explain ourselves. The player directly controls Kate Walker with the WASD keys (or left analog stick). The lawyer's movements are relative to the camera that frames the action and change accordingly. So far, nothing dramatic, even if in smaller rooms there is always the risk of getting confused, especially when the camera decides to throw tantrums, perhaps slowing down the shot change. However, the whole system becomes extremely cumbersome when it is discovered that Kate can only see the interactive objects in front of her and that, if there is more than one, you have to select them with small movements or with rotation of the shot. The latter doesn't always give the desired result, so don't rely too much on it. But let's say more: not happy with this boulder, the developers have added icons to perform the various actions which further reduce the intuitiveness of what is being done and make some situations a little confused. Unfortunately even after having mastered the interface, its weight is felt, because some actions are better done with the controller, while others with the mouse and keyboard (for example the management of mechanical puzzles). The result is that we haveor played in a schizophrenic way, alternating between the two depending on the situation. The Syberia series The Syberia series consists of two more episodes, the first released in 2002, while the second in 2004. Unlike Syberia III, which tells a self-contained story, the first two were intertwined and had to be played in sequence to be fully enjoyed. These were two classic graphic adventures, Sierra or LucasArts style, characterized by beautiful scenarios hand-drawn by Benoit Sokal. Retrieve them if you can. Finishing Kate was about to make a mess Syberia III has other glaring problems, particularly in the refinements. For example, the lip sync is only with the French dub and not with the English one (Italian is only in the subtitles), the optimization is not great (it seems that Denuvo is to blame for the slowdowns, but we can't confirm it), some scenes are not well framed and some situations are not synchronized as they should be. In what sense? Well, if I talk to a given character about something, then Kate shouldn't have to wonder where she is if other characters recommend she go there and talk (and this is just one example). Those listed in this paragraph are small problems, perhaps irrelevant for many, but if we put them all together and add them to the tragic interface, they give a decidedly negative impression. It is true that the narrative side, enriched by the magnificent soundtrack composed by Inon Zur, which deserves to be heard even outside the game, helps to overlook it and that one is still involved to the point of wanting to get to the end regardless, but it is not an excuse for everything else. In short, it is really impossible not to notice that during development something did not go as it should. Of course, it would be a real shame if the good things that Syberia III has to offer were overshadowed by everything else. After all, we are still talking about a dream trip.", "date": "2017-04-25", "grade": "6.5"}