{"name": "Little Nightmares", "ref": "https://multiplayer.it/recensioni/182366-little-nightmares-la-fuga-di-six.html", "text": "Presented at GamesCom 2016, Little Nightmares was immediately appreciated for the particular atmosphere that transpired from the first trailers. Although going to place itself on a path already successfully beaten by other illustrious exponents - among which we remember the excellent Inside released last year - the new title created by Tarsier Studios seemed to have all the credentials to attract the attention of fans and offer again a very specific reading of the puzzle-platform genre, inspired by incessant dangers, profusion of environmental puzzles and a deliberately implicit narrative component on which to hinge the gaming experience. Although it is a young reality, the Swedish team has had the opportunity to gain experience by supporting the creation of high-level titles such as LittleBigPlanet and Tearaway Unfolded. With the birth of Little Nightmares, however, a decisive turn towards much darker themes was made, which in part draw inspiration from the fairy tale collections of the Grimm brothers and from the stories of the British author Roald Dahl. The playful structure is supported by the uncertain role of the young protagonist and by her evident condition of inferiority in the presence of a cynical and openly hostile world. The result is a marked sense of duty that embraces the entire duration of the adventure, while stimulating the player's intuitiveness both in terms of interaction and in terms of narrative understanding. Little Nightmares brings back childhood fears and does it with a very personal style Silence, anguish and a lighter to overcome fear The small and seemingly helpless protagonist of Little Nightmares is called Six. We meet her wrapped in half-light, in a bizarre yellow raincoat that protects her from head to toe. One can only try to imagine its features, under the large hood that conceals its identity. Barefoot and supported by slender legs, Six must try to make her way in a place that doesn't seem to promise anything good at first glance. The game does not tell us about it explicitly, but we find ourselves inside ~Le Fauci~, a mysterious and equally disturbing vessel that appears every year from the bottom of the abyss, in always different places, to host fat individuals clearly afflicted by an overflowing greed . The depths of the structure are also home to numerous children, evidently left at the mercy of a cruel fate. But Six is different from the others. She's hungry, weak as a little girl can be in the face of a hostile world, yet she can rely on a not indifferent gift: wit. Precisely on these premises the tortuous journey of the player is established, a path fraught with dangers and obstacles to overcome, where the only objective that appears immediately evident is escape. One of the distinctive features of Little Nightmares, and probably also the most noteworthy one, is undoubtedly constituted by the artistic direction. The work offers very particular and evocative glimpses, emphasizing the constant play of contrasts made possible by the modulation of light. Although these are scenarios with very dark hues, on more than one occasion the lighting is reduced to a minimum or is completely absent, to the point of forcing the little girl to use a lighter in order not to lose her bearings. But during the progression the audio sector also plays a fundamental role. Yes, because although the soundtrack has been reduced to the bone, an excellent job has been done on the sounds that surround the structure, allowing the user to listen to the environment in front of him, so as to be able to understand clues and inevitable dangers . As mentioned, the story is entrusted entirely to the events represented in real time on the screen, without the filters deriving from the dialogues or lines of text. In essence, one should not expect explanations or verbose interactions with other characters. As we had clarified at the time of Inside, also in this case the level of understanding of the mythology of reference proves to be difficult in the absence of slightly more limited indications. The result is a story which, albeit fascinating, ends up leaving room for wide questions, both in the premises - namely the origin of Six and his imprisonment - but above all in the convulsive and unexpected final outcomes. Run away fools! The first step towards freedom necessarily passes from the resolution of the puzzles that follow each other, without interruption, for the entire arc of the gaming experience. In each sector it is necessary to identify the path that leads to the following area and to do this it is necessary to get hold of certain objects, activate or deactivate levers and buttonsanti, open padlocks and so on. By moving the right analog stick at will, you can get a more extensive overview of the surrounding environment and sometimes it is also possible to identify those elements essential to the continuation of the mission. The continuous changes of pace are guaranteed by the moments in which it becomes essential to flee or vice versa to hide. During her attempt to abandon the vessel, Six must in fact deal with some disturbing and deformed individuals, who will not think twice about capturing her, thus ending the game. Precisely in these situations the sense of anxiety we mentioned in the introductory paragraph finds full expression. And it is precisely on this side that the sound factor finds fertile ground: the alarm noises indicate to the player that something is not going the right way, suggesting him to find a hiding place as soon as possible or to lift his heels and head elsewhere before it is late. The intrinsic weakness of Six's movements often leads to mistakes. It takes very little to be overwhelmed by the hostile environment, therefore on several occasions a trial and error approach will be necessary, in order to understand which is the most effective strategy to proceed. From this point of view we have encountered sporadic problems related to the control system. The movements sometimes turn out to be excessively clumsy and imprecise and, although very often this depends on the characteristics of the protagonist, on other occasions the difficulties also arise due to the shots, which are not always effective in conveying the exact depth of objects, platforms and ravines to be crossed . Another problem, however common to other titles in the same category, concerns longevity. Although the developers have never made a secret of it, the duration of Little Nightmares is far too narrow compared to the subdivision of the game areas. In fact, the adventure develops over five levels, for an overall experience that varies between four and five hours.", "date": "2017-04-21", "grade": "8.0"}