{"name": "Enigmi di carta", "ref": "https://multiplayer.it/recensioni/182320-kami-2-enigmi-di-carta.html", "text": "~Less is more~ said Ludwig Mies van der Rohe, stripping the architecture of heavy frills and revealing the elegance of simple and clear-cut shapes, combining functionality and elegance in a way that until a few years before the Modern Movement and the Bauhaus it seemed practically impossible. If there is a video game genre that can say that it has taken something from such an innovative and liberating spirit, it is certainly the puzzle game, or the electronic game which under various aspects can be defined as such par excellence, being the application of classic principles such as puzzles to the interactive digital medium. Being a type of game in itself based on brain teasing, the risk of overloading the experience with a cumbersome superstructure is always present, and the intelligence of the developers lies in trying to stage a concept that is witty but not brainy, therefore a simple idea but capable of proposing a renewable and engaging challenge. A decidedly complicated request to satisfy, which is why we often find ourselves relying on already tested veins in order to minimize the risks. Sometimes, however, there are also those who dare and manage to come up with original and well thought out concepts, and in this case it is also normal to exploit the good idea to carry on a real series. This is what happened with Kami, who with the second chapter limits himself to re-proposing new contents on the same basis as the progenitor, a solution which, honestly, by virtue of the latter's qualities, does not cause any scandal at all. The structure is therefore the same as before, filled with new levels and some additional options in order to enrich the excellent base offered by the first Kami and make the gaming experience as complete as possible, all available practically for free, given that the microtransactions present are limited to the possibility of buying aid but are absolutely not invasive. Let's go back to coloring and folding sheets in Kami 2, looking for the simplest solution Colors and folds The aim of the game is extremely simple: it involves coloring a sort of sheet of paper in a single colour, making the figures present initially disappear through the chromatic associations until reaching a single background colour, within a number of moves default. In short, it is the classic game case easier to prove than to explain, and watching the short video above can be more explicit and significant than any written description. The seemingly simple idea hides a complex mechanic, which requires a lot of study on the different levels before reaching the objectives within the maximum amount of maneuvers allowed. Don't be fooled by the extreme simplicity of the first levels: the learning curve is less sweet than it might seem, given that the first challenging puzzles begin to appear relatively early and in some cases suddenly. It is true that there is an underlying mechanic that tends to flatten the game to a specific modus operandi, but advancing through the worlds there are still some really demanding challenges, while the possibility of building your own levels and sharing them with other users makes the amount of challenges potentially limitless. Similarly, if in the first phase it is possible to complete the puzzles even simply by trying to change the colors at random, it soon becomes clear that a certain strategy is needed, a studied approach to the composition of the drawings and colors to be able to understand which parts to color first and with which shades and the solution is hardly obvious in the more advanced levels. The zen simplicity of the game structure is reflected in the splendid aesthetics used by State of Play, with its relaxing representation in folded paper style and pencil colors and animations that recall origami, an atmosphere also underlined by the discreet audio accompaniment.", "date": "2017-04-21", "grade": "8.0"}