{"name": "Skies of Chaos", "ref": "https://multiplayer.it/recensioni/skies-of-chaos-recensione.html", "text": "Netflix is serious about iOS and Android, by now it is clear: the gaming division of the streaming platform has entered into agreements with a large number of very capable development teams for the creation of premium games, free of microtransactions and free-to-play mechanisms that affect the balance of the experience. Of course, to download the titles produced by the American giant it is necessary to be a subscriber, but the value guaranteed by mobile games such as the one signed by the small but talented Broxcorp studio, which basically reinterprets decades of shooter tradition, is indisputable. What are we talking about? We explain it to you in the Skies of Chaos review. Gameplay: A classic yet modern shoot'em-up Skies of Chaos, the many colors of the first scenario We have seen plenty of vertical scrolling shoot'em-ups on mobile devices, both original productions (not always brilliant) and reissues of great classics, sometimes belonging to the bullet hell sub-genre. However, Skies of Chaos is something different, a project that starts from those solid foundations to reinterpret the traditional mechanisms of the trend and therefore propose some small but interesting innovations. First of all, the setting is that of a world populated by anthropomorphic animals, which recalls quite clearly the atmospheres of titles such as Tail Concerto. There is an invading army that threatens to destroy everything and a small fleet, remotely coordinated by an expert rabbit, is determined to stop it in the most classic of one-on-a-thousand. The touch control system allows you to fly our airplane by holding your finger in the lower part of the screen, although the initial settings must be adjusted to maximize sensitivity and thus allow us not to have to reposition the hand while moving, ending up hindering visibility of the various elements. The plane fires with all the weapons equipped as long as we touch the display, a choice that we don't fully agree with (everything could have been automated, amen) but which in the end works well, also thanks to the ~launches~ that it is possible to do this by drawing rapid trajectories on the touch screen to quickly change position as needed. Skies of Chaos, a rather difficult boss The precision of the controls is excellent and allows you to wriggle out of even rather complicated situations, when hundreds of bullets arrive against our aircraft, in a clear reference to the aforementioned bullet hell, and you have to dodge them to prevent the energy bar from empties, resulting in a game over that cannot be remedied: it will be necessary to start the level all over again. This last intuition prevents the Skies of Chaos experience from running out within a couple of hours, since that the fifty levels of the campaign present a degree of challenge that increases progressively and are dotted with boss fights that also become quite demanding, sometimes asking us to retrace our steps and replay the missions already completed to collect stars and upgrades necessary to continue. Structure and technique Skies of Chaos, our plane against a huge killing machine In short, we are faced with a full-bodied and well-balanced title, thanks also to the absence of microtransactions and free-to-play dynamics that affect these specific aspects from the perspective of monetization. Far from it: thickness is added through a very interesting system of upgrades, which includes new planes, side pods of various kinds, bombs, shields and perks, all of which can be improved using the resources collected up to that moment. Skies of Chaos however would not be the It's an excellent shoot'em-up that's without its technical accomplishment: a colorful pixel art feast like we've rarely seen in the mobile shooter genre, with some amusing cutscenes tying together a plot that nonetheless holds its own and sees increasingly goofy characters engage, while a biting soundtrack accompanies the on-screen action.", "date": "2022-11-09", "grade": "8.5"}