{"name": "The Sexy Brutale", "ref": "https://multiplayer.it/recensioni/182178-the-sexy-brutale-benvenuti-alla-festa.html", "text": "The beauty of a thriller is to get to the end of the story to discover the identity of the culprit and shed light on the dynamics of the crime that took place... but what happens when we already know who will be the victim and who will be the murderer? The Sexy Brutale tries to answer this question by dyeing the puzzle game genre yellow and overturning the very nature of an investigative story while maintaining all its distinctive elements. The game comes to life thanks to the efforts of the guys at Tequila Works (in collaboration with Cavalier Game Studios) and given the efforts made for the expected RiME, due out next month, The Sexy Brutale was a really unexpected surprise happy. The Sexy Brutale is a brilliant and unexpected puzzle game, details in the review I enjoy it to death ~A little party never kill nobody~ sings the beautiful Fergie in the soundtrack of The Great Gatsby by Baz Luhrmann, but the guests of the Marquis would have something to object to. In fact, the game takes place over the course of a single day within the walls of a vast mansion and the casino attached to the property, the Sexy Brutale. All the guests have been invited by the Marquis, owner of the sumptuous residence, for a masquerade ball but something has gone terribly wrong: the servants have the sole objective of massacring all the guests of the party and the masks that the guests are wearing seem to be in somehow cursed. We have to play the role of Lafcadio Boone, a priest who is assigned a very important mission: to save the guests of the casino. The arduous undertaking will be entrusted to us by the Bloody Girl, a strange presence wrapped in blood and who will deliver us, right during the tutorial, an enchanted pocket watch, an indispensable object for gameplay purposes. In fact, to avoid the various crimes we will have to explore the environments in order to learn all the concepts necessary to solve the dynamics of the murder we are investigating and to do so we will have to go back in time, thanks to the clock. Rewinding time is a necessary operation that we will have to do several times because the whole game takes place in real time and to investigate in depth we will first have to visit a room, then eavesdrop on a conversation in another area of the casino and so on, without never let ourselves be seen by guests or servants. Like all the guests, Lafcadio Boone also wears a mask and near a door beyond which there is another character, it will begin to glow red to warn us that we cannot cross the threshold, so it is better to focus our attention elsewhere. To investigate Boone can move in three different ways: exploring an empty room collecting objects, spying in a room through a lock or hiding in a wardrobe and finally using his hearing to see, thanks to sonar graphics, who is moving in the vicinity. As we save the guests we will acquire the special powers of their masks and the more we will have the more freely we will be able to move around the map: from experience we have found it almost more complex to go in search of the right guest to save (since there is a precise order) rather that solving a single murder and this because keeping track of all the events over the course of 12 hours of the day is complex and puts even the most trained memory to the test. Fortunately, in the map menu, at the bottom of the screen, there is a timeline that we can scroll through and for each hour we will be shown the position of guests and servants that we have encountered in the mansion during the succession of our games. The rest of the menu consists of the mission summary, the number of collected collectibles and a list of tutorials and game and environment descriptions. Missing perfection The strengths of The Sexy Brutale are essentially two: the dynamics of the gameplay and the artistic sector. Graphic adventure and puzzle game are two correct definitions for this title but for the entire duration of the game there is never a moment in which one prevails over the other, because there is always an excellent balance of both: you can never get to the bottom of the enigma without carefully visiting the scenarios (unless you are as witty as hawks kissed by luck) just as it is not good to linger in exploration unless you have a very specific purpose. In any case, the dynamics preserve the investigative charm typical of a thriller story and make it effective and never banal despite knowing immediately the fate of the guests. What is then striking is the total synergy between all the events: in fact, during the hours we will hear sounds, such as a shot,a breaking glass or the tolling of a bell, and each noise corresponds to an event that has happened and will happen every time we rewind time, as if the mansion whispered its secrets to us every time. A sensation conveyed beautifully by the audio sector, studied very well and absolutely to try in dolby surround. The second strong point is the splendid artistic sector from all points of view, from the musical theme of the casino to the cartoonish characterization of each individual character. Don't be fooled by the style though because the game has that pinch of grotesque that you wouldn't expect seeing the artistic choices made, a style that can be guessed right in the first room where we will start the game since among the many famous paintings hanging on the Sexy Brutale the first we will see will be ~Saturn devouring his children~ by Goya. We'd like to end the review here and tell you not to wait any longer to buy this title but... there are buts. The version we tested (console, Xbox One) presents numerous problems in the game's response times: in front of a door, for example, the character takes a while to enter the room or peep through the lock, a delay of a few seconds but still annoying especially during particularly excited moments in which we will have the seconds counted. A problem that shouldn't occur in the PC version but still present for that console and which, moreover, for a small game like The Sexy Brutale (with a very variable duration but which can be summarized in about 8 hours) shouldn't even happen; the rest is really pretty, from the light effects to the animations. Last note, even if we don't feel like calling this a defect, is the lack of the Italian language: fortunately, despite the retro and decadent setting, the language used is only written and very understandable furthermore, with the exception of very few dialogues, the time with which these remain on the screen is long enough to read everything in detail.", "date": "2017-04-15", "grade": "8.5"}