{"name": "La legge dei vaganti", "ref": "https://multiplayer.it/recensioni/181994-the-walking-dead-a-new-frontier-episode-3-la-legge-dei-vaganti.html", "text": "On the occasion of the review of the first two episodes of this third season of The Walking Dead, we said goodbye with an important hope: that the first two chapters could represent the incipit of a new Telltale-branded series that lived up to expectations. It is true that repeating the success achieved with the first, unforgettable season could not be particularly simple, but we cannot hide that A New Frontier actually seemed to have taken the right path: a tortuous path that could certainly make us forget the missteps made with the second series. And instead, apparently, the two abundant months elapsed between the debut with the double episode and this third chapter were not enough for the developer to pack an episode capable of confirming the crescendo of the experience. Above the Law, this is the title of the third chapter, in fact marks a setback in our opinion, almost on the border of a sensational U-turn. Let it be clear that we do not want and cannot go into too much detail because, exactly as we did with the previous review to which we refer you for all the details on the gameplay, we do not want to risk spoilers in any way, but we will necessarily have to make some mention of the contents in the course of this quick review. The third episode of The Walking Dead: A New Frontier marks an abrupt change of course Previously on The Walking Dead As always happens with Telltale's episodic titles, the chapter opens with a quick summary of what happened in the past and picks up exactly where it left off. Javier and Kate are on their knees in front of the entrance to the stronghold of the mysterious and ruthless group of the New Frontier and their eyes are wide open for an old acquaintance who appears in front of their faces once the large metal gate is opened. From here begins a slow episode, at times even cumbersome which, unfortunately, is occupied for most of its time by dialogues. Let it be clear that these are always very interesting chats and discussions that do everything to involve the player and oblige him to respond sometimes with inelegant, disturbing and sometimes all too caustic sentences, but it is still a question of choosing one of the four that the game offers us, evaluating the one that appears to us more appropriate and better suited to the attitude we want to pursue. More than ever in this chapter, in fact, the consequences of having a very sharp tongue seemed very evident to us and often the outcomes of the conversations seemed obvious to us, sometimes even phoned. And it's a shame given that we will take at least two thirds of the entire episode to respond to the conversations set up by old acquaintances and a couple of new meetings around which a large part of the plot of Above the Law will revolve. The more lively gameplay, the one in which the pad is used not only to choose the preferred answer, is also present in this episode but in a form that is far too limited to be worthy of note. And so alongside the usual and inevitable quick time events, we will find ourselves wandering freely with the character on the screen in a single piece of gameplay. Far too little for a title that, at least on paper, should carry on the graphic adventure concept and, in particular with The Walking Dead, should aim to overcome what has been built in the past and perhaps even to innovate considering how long the rebirth of the genre is anchored in a style of play that is starting to smell old. Basically the only big problem of this third episode is all here: for more than half of its duration we will be entangled in dialogues which, however interesting and with rather tantalizing implications in view of the continuation of the series, are still very simple dialogues. For the remaining time we will have to deal with the usual action moment to try to stem the advance of the walkers and with a single more relaxing exploratory section, which will take us up to the inevitable end-of-episode cliffhanger. All in just 80 minutes of gameplay. It is true that in this third season Telltale is trying to do a little more in terms of replayability by introducing, since the recent series based on Batman, some alternative scenes that can only be faced by making certain choices, forcing the player to retrace his steps to try other options in case you want to see all that a chapter has to offer, but by now we are reaching the paradox of a title that borders on the border of an interactive film, lasting even less than a feature film. Nothing negative to say on the frontrecitative also thanks to the renewed graphics engine that continues to give that extra push to a project otherwise very much in line with the developer's archetypes. The dubbing and more generally all the audio effects are also excellent. Among other things, this episode also seemed very well optimized and completely free from bugs or other problems.", "date": "2017-04-11", "grade": "7.0"}