{"name": "David Jaffe e la sua idea di sparatutto", "ref": "https://multiplayer.it/recensioni/181945-drawn-to-death-david-jaffe-e-la-sua-idea-di-sparatutto.html", "text": "When Drawn to Death was first revealed during the 2014 PlayStation Meeting, hopes of seeing an original production that could bring something new to the market were quite high. The unique style of the project certainly did a large part of the work and the element that most made the players' antennae stand up was the presence, at the reins of the project, of that David Jaffe, already father of God of War and Twitsted Metal. Last week the day of its debut on the Playstation Network finally arrived, with a formula that had already proved successful on other occasions. In fact, connecting Drawn to Death to Rocket League is almost immediate given that both productions have been distributed free of charge for Plus subscribers, both cost around 20 euros and one of their main components is the possibility of playing two against two in very tense online challenges. Unfortunately, after only a few days of launch, it seems clear to us that things for Drawn to Death will not go according to plan and how success will struggle to arrive. There are many problems with this production that drown out the positive sides and today, with our review, we explain what didn't work. Drawn to Death's unique style is also one of its weaknesses Draw me this#!** The language of Drawn to Death is foul-mouthed, vulgar and over the top, so much so that the title is absolutely not recommended for a young audience. On the other hand we find ourselves playing inside a notebook of a teenage ~punkettaro~, an overly creative student who prefers to scribble on a notepad rather than follow the lessons. The boy is talented, however, in packs so much so that some of the six characters present are some of the most original that we have seen in recent months. NinJaw is a humanoid shark in a miniskirt who shoots explosive sharks and nimbly wields an anchor, Diabla Tijuana is a Mexican demon capable of using his tail as a whip and then there's Alan, a killer bear armed with a chainsaw and so on for a very varied and attractive roster even if not very numerous. The various characters are characterized in an excellent way also as regards the skills, extremely different from each other and, above all, with strengths and weaknesses that can be countered by another specific character. Online matches thus become a sort of lottery, hoping that matchmaking does not place us against our nemesis, or the price to pay will be an uphill battle from the very first moments. Speaking of matchmaking we have to report big initial problems, which however seem to have been fixed with the most recent patches, unfortunately too late to prevent the community's initial enthusiasm from bursting like a soap bubble. The sensation is that of a title that has failed to win the hearts of shooter lovers and which is now found with a rather small number of players on the servers. However, the problems do not derive only from wicked server management but also from an aesthetic sector which, although original, fails to make the action clearly read. Once you enter the game arenas you are confused by the particular style of Drawn to Death which vaguely recalls a mix between Mad World and the works of Eiichiro Oda, the author of One Piece. The main problem lies in the numerous ink lines dashed on any texture, unable to highlight the targets, a serious problem for a shooter that makes speed of action one of its strengths. The eye is distracted causing it to lose sight of the target and the extreme mobility of the characters, armed with teleporters, double salts and even invisibility complicates matters further. The aforementioned Mad World, which also used a black and white color scheme, was much more readable and, consequently, enjoyable although the action on the screen was never lacking. Arena shooter Drawn to Death's game system is quite classic and knowing the maps already means having a clear advantage over your opponents. In fact, like any self-respecting arena shooter, in Drawn to Death it is essential to know where the most powerful weapons are, where to recover power ups and even the bonuses for recharging energy or the vomit bar, essential for launching moves special. Unfortunately, a few games are enough to realize that the imbalance of weapons, characters and powers is evident and that the developers of The Bartlet Jones Supernatural Detective Agency will have to work hard on this problem in order not to see all their work in vain. Drawn to Death then comes with an extremely pres micro transaction systemsaints which mainly affects cosmetic changes such as skins and taunts, but also on the choice of weapons. Almost all of the twenty available guns must be unlocked, using special keys that you can get by leveling up the characters or completing the related quests. A system that obviously rewards those who want to shell out money to get everything immediately. To get each weapon by playing without opening your wallet, well over ten hours are required, not counting the challenges of the sphinx to unlock the latest more powerful paraphernalia. The title, as you will have understood, has few points in favor and many elements that require a little adjustment or that really struggle to be tolerated. One of the ones that bothered us the most, however, is the impossibility of choosing which mode to participate in, whether it's simple warm-up matches or classified matches. The number of players is chosen randomly depending on availability and we find ourselves catapulted into matches where team deathmatches and free-for-all are the ultimate aspiration of originality. Of course, there is also a mode where the goal is to kill the opponent to steal his heart and then bring him back to a mobile control point (a mix between capture the flag and kill confirmed basically) but it's really little stuff compared to that that could have been invented for a title with such a particular style. Once again, unfortunately we just have to point out the lack of any protection from leavers or for players who move away from the controller, with the only good relative idea concerning the respawn, now having the possibility to choose at what moment and in which point in the arena to be launched to start warfare again. Too little, however, to keep a limping production alive.", "date": "2017-04-10", "grade": "6.5"}