{"name": "Uno show mai cos bello", "ref": "https://multiplayer.it/recensioni/181874-mlb-the-show-17-uno-show-mai-cosi-bello.html", "text": "The relationship between Italy and baseball is rather strange, although perfectly understandable in a nation where other sports are struggling to find space in terms of popularity beyond football. The national team of our country can in fact count on an excellent palmares especially as regards the European championships, won ten times, as well as a respectable placement close to the top ten in the world ranking of the World Baseball Softball Confederation. As far as our market is concerned, the release of a game like MLB The Show 17 therefore doesn't have the same importance as a FIFA, which is the case in America, where the season of the most popular baseball league in the world has just begun. With the farewell of EA Sports matured several years ago, the San Diego Studio simulation is currently the only way forward for those who want to experience all the charm of MLB on their television screen. The group of insiders is a guarantee, given the considerable experience accumulated since the days when the team, which is now part of Sony's Worldwide Studios, was known as 989 Studios. Also this year, obviously, MLB The Show 17 arrives exclusively on PlayStation 4, instead marking the abandonment of the series on PlayStation 3. After breaking the ice we just have to take the pad in hand, to find out if Sony has done home run again. MLB The Show 17 is the baseball game that every baseball fan should buy! We are the story The composition of the main modes of MLB The Show 17 remains practically unchanged from last year, with the inevitable Road to the Show opening the list. This is the ~story~ mode that MLB The Show 17 offers to its players, calling them to take on the role of a promising young baseball starting from Minor League Baseball up to the Major with positive performances. Within this mode, the main novelty of this year is called Pave your Path, the result of the inevitable influence of the NBA 2K series towards all other sports titles. However, don't expect a plot like the one set up by EA Sports for FIFA with Alex Hunter's career, given that after creating our player in MLB The Show 17 we will immediately be immersed in his first experience. Between one game and another there is the possibility of attending interlude scenes, presented as a kind of documentary in which the narrator presents the case related to the need for our player to communicate with other staff members and take decisions. The second modality of MLB The Show 17 is naturally Franchise, also of the classic type: in fact, one must take control of one of the MLB teams, accompanying it through the years while also paying attention to all management aspects. The novelties of Franchise are intended to speed up the gaming experience through two proposals: the first is entitled Quick Manage and allows you to approach the game in a managerial way, managing the various situations from above and then eventually descending to the diamond in case things were to get worse. Considering that a single MLB season has 162 games, the novelty called Critical Situation is also particularly welcome: if you have played Madden NFL 17 you will certainly know its Play the Moments, that is to say a particular possibility of facing only the most important throughout the season. If activated, the Critical Situation option will, for example, let us play only if there is a last inning to close to win, or in a particularly hot batting situation with points to take home. The third and final part of the main modes of MLB The Show 17 is Diamond Dynasty, a sort of FIFA Ultimate Team in which you have to build your own team by collecting cards dedicated to your needs. For longtime MLB fans, it's also a time to reminisce about the old days, with a few legends among the players you can employ on your team. Ranked seasons, events and ad hoc game types like Battle Royale and Conquest promise to give Diamond Dynasty fans hours and hours of gameplay, before diving into a Home Run Derby or moving on to Retro mode. The latter is a newcomer dedicated to the old baseball games of the 90s, in a kind of nostalgia operation that on the cover of MLB The Show 17 brings a myth like Ken Griffey Jr. The graphical interface is presented to us in the same style of the old 16-bit consoles, while the models of the players and the field remain the current ones. The game dynamics have also been simplified, reduced to the use of a single pairof keys. Overall, the Retro mode is not particularly memorable, but we imagine it could be useful for some less serious local multiplayer games. Playstation 4 trophies MLB The Show 17 has a total of thirty-two Trophies, divided between six of the Gold type, five of Silver and twenty of Bronze, in addition to the only Platinum. The awarded actions naturally concern all the various modalities proposed by the game, with lots of particular situations linked for example to a strikeout in bat followed by a home run in the following round. Let's go to the plate As well as the news regarding the game modes, even those related to the gameplay of MLB The Show 17 rest a few more bricks on the excellent construction set up up to a year ago. Once in the heart of the action, the experience offered by the simulation of San Diego Studio is proposed to the highest levels, allowing even players who know less baseball to access the dynamics of pitching and batting. In fact, for each of the two phases there are different options, linked to different execution difficulties to allow everyone to better calibrate the type of baseball that they intend to experience with MLB The Show 17. The renewed physics of the ball offers the possibility to see more varied types of jokes than in the past, solving in pairs with a new set of animations some problems that made players appear too woody on some occasions. Overall, the gaming experience of MLB The Show 17 certainly comes out improved compared to the already excellent one a year ago, also thanks to more adequate support from artificial intelligence in the defensive phase. However, it must be said that it still happens to see some balls that are inexplicably not caught, while from the point of view of physics the management of the rebounds is still fully convincing. In technical terms, having the ability to focus only on PlayStation 4 seems to have benefited the overall quality of the graphics rendering of MLB The Show 17, historically lower than that of other sports titles. The various stages have been reproduced with maniacal care, the same placed in the effects that various slips and dives have on the cleaning of the diamond. The rendering of the weather effects is also excellent, in particular with the management of the light: in some cases the views from above seem to show a televised match, instead of a video game. Instead, lights and shadows regarding the player models: in numerical terms MLB The Show 17 presents a higher number of facial scans than that of its predecessor, but some fan favorites are still missing here and there. The acquisition of the MLB Network license has allowed San Diego Studio to give a boost also on the presentation package, with graphic and sound elements coming directly from the league's broadcast. The commentary (entirely in English like the rest of the game) was entrusted to the regular Matt Vasgersian, accompanied by new inputs of Harold Reynolds and Dan Plesac from MLB Network. For us Italians it becomes perhaps a little difficult to apply ourselves on the level of commentary in another language while we are concentrated on throwing curveballs or trying to hit them successfully, but some repetitions in the pronounced sentences also catch the attention of one ear a little inattentive.", "date": "2017-04-07", "grade": "9.0"}