{"name": "Sifu", "ref": "https://multiplayer.it/recensioni/sifu-recensione-nintendo-switch.html", "text": "With a nice gap compared to the other versions, Sifu's martial arts also conquer Nintendo Switch. In the past, the portable console par excellence has not proved too effective in providing complex and technically demanding gaming experiences, but its ~mobile~ dimension has nevertheless made it an interesting choice to take into consideration when purchase of a new product. In this review of Sifu for Nintendo Switch we see how this conversion fares. A brief smattering Sifu: A Story of Revenge We will not dwell too much on the narrative and structural aspect of the game, since it remains absolutely unchanged compared to the already released versions, which we have extensively discussed in Sifu's review. Suffice it to say that Sifu is a video game focused on the revenge of a young student against the murderers of his martial arts master. Starting from the age of twenty, the game puts us in front of different areas, one for each member of the gang of criminals that we will have to fight, within which we should make our way with beatings and cinematic quotes. Each time we are defeated, a point will be added to our death counter. When you return to life, the result of this counter is added to your age. Consequently, the more times we fall to the opponent's hand, the less chance we will have of reaching the end of the adventure. If we don't calculate the ~times~ well, we would be forced to give up and start the framework over or retry the previous levels again to do better, with only some elements permanently unlocked. But, as we know, experience tempers, which will make us more prepared, more prudent, more effective each time. The problems of a conversion Sifu: The game looks good, but not great The conversions of games released some time ago for consoles and even very performing PCs always tend to scare a little, especially if the titles are of very good quality. Consequently, a Nintendo Switch version of Sifu, a game that seems very simple technically, but which hides a complexity that should not be underestimated, has a lot to prove. As much as we hoped to try Sloclap's work in a new key, we met, in spite of ourselves, a game visually reduced to the bone. Sifu's style, characterized by few polygons expertly exploited thanks to details and the lighting system, is inevitably revised and corrected here to run effectively on the Nintendo console. The result, however, is mixed. If from the television it leaves the time it finds, also considering that it is the mode it shares with the other platforms, in mobility the technical backwardness of Switch still shows its side, proposing an interesting and mostly ~modern~ overall shot. but which, also due to the style and very low resolution, reminded us in some places (especially during the interlude scenes) of the times of PSP action games. As much as the nostalgia effect tears a melancholy smile, there is no doubt that the compromises are perhaps a little too high for an outdated hardware to digest such a game. We would have glossed over more on the question of whether the game ran at least in a granite way, but evident drops in frames are not uncommon. Luckily, they mostly show up during room-to-room transitions, especially when filled with enemies, but to avoid taking hits and misses there's always that momentum that pushes you back to settle the game, which is very little. compelling in a title that wants to be lightning fast and responsive. At least, the uploads are quite fast, considering the standard of other conversions for the Nintendo Switch. Further critical issues that we have encountered is the management of the commands and the response time. The game (when it does) runs at thirty frames per second. Which is already not advisable for such a technical and precise experience. If we add that, depending on whether played on the TV or in portability, the Joy-Con return a slightly different response time (that millisecond that makes the difference), it is difficult to find the desire to switch from one mode to another and, thus, the entire philosophy behind Nintendo Switch collapses under the weight of Sifu. Among these evils, however, the qualitative goodness of the product is most emphasized, which, however, manages to keep glued to the screen, despite the thousand problems that afflict it in this unfortunate role.", "date": "2022-11-09", "grade": "5.5"}