{"name": "Seconda Guerra Mondiale Hardcore", "ref": "https://multiplayer.it/recensioni/181791-day-of-infamy-seconda-guerra-mondiale-hardcore.html", "text": "In recent years (not too much actually), there has been a certain dissatisfaction with what are the playful proposals of the traditional industry in various genres. In particular, the world of online shooters has seen the birth of real alternative factions, which contest the casual drift of titles such as the various Call of Duty, the Battlefield and Overwatch series, to make known names among the many possible ones. These titles would be guilty of favoring incompetent players with ad hoc designed mechanics and with the integration into the gameplay of what were once considered real cheats (think of Overwatch's super). Obviously the industry has its reasons for favoring a more relaxed approach to online gaming (a frustrated player runs away immediately and never comes back), but it is also true that those who prefer a more competitive approach, focused on ~skill~, of the player, may be disappointed by some proposals. Fortunately, the malaise has not remained a forum complaint, but has often turned into real video games, sometimes of enormous success. Day of Infamy, the new class-based team shooter from New World Interactive, a team coming from the modder scene to which we owe Insurgency (almost three and a half million copies sold on Steam), is aimed at those who want to return to an experience of game essentially based on skill, in which killing means knowledge of one's means and maps and not pressing a button when a little light shines announcing the availability of the end of the world attack. In short, you have to use your brain. We have reviewed the online shooter Day of Infamy: find out if we liked it The way to realism Day of Infamy is proposed as an essential shooter since its setting: the Second World War. If we had to indicate a title that resembles it among those still active on the market, the choice would inevitably fall on Red Orchestra 2 (with Valve's Day of Defeat we would go further back in the years). In reality, the gameplay offers significant differences, but conceptually the two titles are very similar. Like the Tripwire title, Day of Infamy also offers weapons that are realistic, both in appearance and in use (the ballistics of each weapon are reproduced with great accuracy), a fairly steep learning curve and likely shootings, which vary depending on the role you have chosen to play. Those who, machine gun in hand, run in an open field thinking they can carry out a massacre are experiencing bad moments... Looking closely, the similarity with Red Orchestra 2, which in any case remains more realistic, is also one of the problems of Day of Infamy, seen that those who are already playing the other will have less motivation to try this one, but it is more a question of market positioning than of the quality of the game, which really makes the most of the means at its disposal. Like Insurgency, Day of Infamy was developed using Valve's Source Engine. The limits of the engine are now all visible, but New World Interactive has still done an excellent job in the composition of the maps, which are rich in detail and well structured, despite the obvious technical deficiencies that give it a poor aspect anyway. The settings of the various maps are typical of games on the Second World War: villages devastated by bombing, countryside occupied by the Nazis, the ever-present Normandy beaches and so on. Which ones to play depends on the server settings, which still allow you to vote for the next map at the end of each match. On the other hand, some character skins are ugly, decidedly not very refined. The soundtrack deserves a separate mention, really rich in sounds of all kinds, which make Day of Infamy one of the best titles in terms of audio reconstruction of the historic conflict. There are specific sounds for each weapon and each faction variant; the footsteps are convincing and tie in perfectly with the ambient sounds. In short, having a decent audio system greatly increases the involvement in the game and, above all, allows you to better understand where the enemies are coming from. Gameplay There are three selectable factions in Day of Infamy: the Americans, the Nazis and the Commonwealth forces. Perhaps more could have been added, as the competition did, including the Soviets and other more exotic militaries, but one can be satisfied. Choosing the faction, you have to select one of the available classes. Given the realistic approach to the genre, don't expect floating medipacks, baseball-thrown supplies, or other similar jokes. Likelihood is everything. As we said, walking around without paying attention to cover and without looking aroundor, it means certain death. A well-aimed shotgun blast is enough to kill. In fact, one of the problems with Day of Infamy is that if you don't find the right team, you can't enjoy the game. Especially during the first few games, when you don't know the mechanics well (the tutorials help but are not decisive), entering the wrong server can lead to a bad impression of the game. It's not nice to be few who approach the battlefield in a more reasoned way, perhaps finding themselves with teammates who get killed like idiots consuming all the lives available to the team, because they are victims of the Call of Duty player syndrome (attacking from alone with their heads down regardless of the numerical advantage of the adversary). For example, it's rare to see the Officer/Radioman combo put to good use. These are two particular units, with convergent characteristics: if, for example, the Officer wants to call in an artillery attack, he needs a Radioman. However, if whoever selects these units (there can be only one Officier per team), is completely disinterested in team play, the penalty for all the others is clear. For the rest it must be said that the action is completely focused on the player's skills: there are no sights of any kind, apart from those on the rifles, jumping around is not much use and each class imposes a different approach to the action. Let's say that finding good coverage always pays off, as does choosing a class and deepening it in such a way as to fully understand its strengths and weaknesses. A final note should be spent on the cooperative mode, which pits players against enemies led by the CPU. Unfortunately we were able to play very little, since it is not very busy. From what we've seen however, it doesn't offer much more than similar modes seen in other titles and is basically a distraction from the core experience offered by the game, which is the one liveable on multiplayer servers. Modes, maps and the like Without listing modality by modality, and map by map, here is a gallery dedicated to numbers enthusiasts, who will find all the answers to fundamental questions such as: how many modes there are, how many maps there are, how many co-op modes there are, and so on. +7", "date": "2017-04-05", "grade": "8.0"}