{"name": "Scatena la dinastia!", "ref": "https://multiplayer.it/recensioni/181725-dynasty-warriors-unleashed-scatena-la-dinastia.html", "text": "Announced a few months ago, Dynasty Warriors: Unleashed has landed a few days ago on the App Store and Google Play, in the form of a freemium action RPG that refers in all respects to the Koei Tecmo series. Inspired by the characters, settings and plot of the eighth chapter of the franchise, the mobile game produced by Nexon offers a solid single player campaign consisting of sixty missions and some side modes that include arenas and skirmishes, to be unlocked as you progress in the history. However, the key element is represented by the gameplay, which surprisingly manages to adapt the touch controls, the small interface and the need to offer fairly short stages in order to obtain an experience actually close to that of real musou , with the same feeling and the same traditional rules. Apart from one: having selected a character, our goal will not be to free the various areas of the map from the presence of hostile units, but simply to kill hundreds and hundreds of enemies until the bosses appear, and then defeat them too. Dynasty Warriors: Unleashed hits the target first time, delivering a true mobile musou experience A musou durou In the face of a simpler structure than the musou for PC and console, Dynasty Warriors: Unleashed focuses on some features capable of making the battles varied and interesting at the very least. In fact, the character we control is not the only warrior at our disposal, given that at any moment we can replace him with one of the two support units, perhaps because we are low on energy or, more likely, to take advantage of the special moves of the leaders in one devastating combo. The first missions don't really encourage an approach of this type, on the contrary, just throw yourself headlong into the action and hold down the attack button to mow down crowds of enemies without major problems, remaining truly admired in front of an engine that manages to manage without particular problems such a large quantity of polygonal models at the same time, net of small-sized maps. Moving forward or selecting a higher degree of challenge (there are three), however, fortunately things change and become less trivial, also to the advantage of fun. There is also a section dedicated to reselling or upgrading loot, with an auto-equip function to make things easier. In all cases, the layout of the controls proves to be effective and well thought out, thanks to the precise virtual analog stick on the left side of the screen, invisible and repositionable automatically, and to the buttons on the right side which are used to launch the standard attack combo and the various specials, as spectacular as they are effective. There is even an ~auto~ key which assigns control of our character to the CPU, even with two different approaches, one conservative and one which instead gives up the special moves without getting too many problems. In short, the system developed by Nexon works great and is supported by excellently made graphics and sound, which do not give up on the definition of textures as happened in some episodes for portable consoles, even without pushing particularly on detail and the animations of the protagonists. Finally, the freemium model adopted works through the traditional ~action energy~, which is consumed as we face the missions but recharges fairly quickly, especially at the beginning, without therefore forcing us to wait long between games the other one.", "date": "2017-04-04", "grade": "8.0"}