{"name": "Il ritorno degli Yo-Kai", "ref": "https://multiplayer.it/recensioni/181608-yo-kai-watch-2-spiritossi-il-ritorno-degli-yo-kai.html", "text": "One year after the first chapter, we find ourselves again talking about the Yo-Kai Watch phenomenon, a multimedia franchise that is literally making a mess among younger Japanese boys. In fact, in the land of the rising sun, the spirits have collected the heavy legacy left by Pokmon and have been able to conquer millions of people not only through TV series, films, video games and smartphone apps, but also with tons of merchandising of all kinds, from to toys arriving at the faithful reproduction of the device that gives its name to the series. Compared to Pikachu and his companions, however, the propagation of the phenomenon in the West is taking place a few years late, and here on April 7th Yo-Kai Watch 2 will be available in our local shops in its Pulpanime and Spiritossi versions, already released years ago at home and for some months also overseas. After a solid and fun first chapter, will Level-5 have managed to take another step forward? Yo-Kai Watch 2 Polpanime and Spiritossi arrive in Italy with lots of news From the begining The narrative structure of Yo-Kai Watch 2 is the daughter of the history of the franchise itself, which made its debut as a video game at home and only later, thanks to the animated series, did it enter the hearts of millions of Japanese fans. The anime was therefore the perfect vehicle to introduce yo-kai to the general public and make them become a viral phenomenon, thus putting Level-5 in the difficult position of having to develop a second chapter of the video game that they knew would be played by a number decidedly greater than players who at the time of the first chapter did not yet know the brand. It was then necessary to implement a sort of reset of events and which clich best suits the need if not a beautiful and reassuring loss of memory? So here is the young Nate, the main protagonist of the series, shortly after the end of the events of the first chapter finds himself the protagonist of an unfortunate episode where he is robbed of all his memories and his Yo-Kai Watch, thus remaining completely in the dark of the fantasy world with which he had come into contact. We will find ourselves in a sort of dj vu and after having been to the park to catch some insects with his trusty net, Nate will enter a shop where in exchange for almost all his parents' pocket money he will buy his Yo-Kai Watch, attracted by the object but without realizing its true potential. Not much time passes and on the way home he decides to spend the last few coins in a machine which, just like in the first episode, will introduce us to Whisper, the butler ghost who is inseparable from Nate. It will then be the Jibanyan's turn and with him all the memories will return thanks to a full-bodied tutorial that reintroduces us to the game mechanics and the use of the Yo-Kai Watch, but also to the fascinating game universe that mixes the Japanese spiritual tradition with more concrete life of the metropolis of Japan today. Yo-Kai Watch 2 is therefore freely approachable not only by those who have not played the first chapter, but also by those who do not know the reference universe at all, proving to be an excellent starting point for learning about the hundreds of yo- existing kai and become passionate about the adventures of young Nate. For veterans however, this introduction will not be particularly tedious given that on balance it is about an hour of introductory game at the end of which we will find ourselves again with our special watch on the wrist, ready to experience a new adventure. Between present and past Once we have found our device and started hunting for yo-kai, a long and full-bodied adventure opens up before our eyes, made up of a succession of primary and secondary missions seasoned with many extra activities that substantially lengthen the longevity of this second chapter. In this sense, Level-5 has managed to find the right formula by making Yo-Kai Watch 2 a larger, vaster and richer title than the previous one in every respect starting from the two hundred new yo-kai, as well as the possibility of making friends with some bosses addressed in the first chapter. Furthermore, the game map has had a significant increase in terms of surface area, so much so as to require the inclusion of a public transport system to allow us to move more easily from one location to another. Traveling on the punctual Japanese buses and trains will be the subject of a specific quest, but once you visit specific places for the first time we will unlock fast travel thanks to the Mirapo magic mirrors. In addition to the more modern and urbanized part, Yo-Kai Watch 2 also offers the city of Harrisville, a typical rural Japanese villageif surrounded by greenery and cultivated fields. In this bucolic scenario lives Nate's grandmother, who will have a fundamental importance in the events that we will face along the adventure. Without going into too much detail, we will have the opportunity to travel through time and return to the past thanks to special mirrors called Miradox that catapult us into the sixties where we will come into possession of the Yo-Kai Watch Model Zero, the prototype of the most modern device used by Nate which, however, allows two important introductions to the combat system. On the one hand, the M-Skill ability is unlocked which allows you to use the Soultimate differently by concentrating it on a single Yo-Kai who in this way launches a very powerful attack which however also consumes the energy bars of the two teammates lined up next to he. It is a risky skill as it risks leaving you without energy for a few rounds, but on more than one occasion it has proved to be decisive for ending the fight prematurely and avoiding defeat. The second in translation is the Poke which, using the 3DS stylus, allows us to poke both our teammates and the opponents: in the first case we will use it to give some panache to our yo-kai who don't want to know about it. fight, while in the second case we will discover its weak points by increasing the effectiveness of the attacks. Furthermore, the Target function has been introduced which allows you to throw food at yo-kai and keep track of their tastes in a simple and intuitive way, unlike what happened in the first chapter. Friend zone Another feature that this second chapter of Yo-Kai Watch has symbolically ~inherited~ from Pokmon is the double guise with which it is presented in shops: the two distinct versions Fleshy Souls and Spirit Bones differ mainly in five exclusive Yo-kai in each and for setting up the multiplayer experience, which is different in the two titles. For the rest, the two versions are completely similar, both for the characters, for the story and the boss fights and, obviously, for the game mechanics not very different from those of the first chapter. In the upper right corner of the screen is the all-important yo-kai proximity indicator that allows us to locate their hiding place and start chasing them with the Nintendo 3DS stylus to track them down and engage them in battle. In fact, remember that yo-kai, unlike Pokmon, cannot be controlled and captured, but are mischievous and fickle entities who become our friends. This translates into a not always satisfactory relationship with our team of yo-kai who, once deployed on the battlefield, can easily decide to sit idle and let a few more turns pass before starting to attack the opponent. The attacks reflect the characteristics of each one, with some yo-kai in charge of doing damage, others to defend and still others to direct cures to teammates or debilitation to opponents, but everything always happens automatically without the player having the possibility to intervene in deciding attacks. At the end of a battle, there is a chance that the defeated yo-kai will ask you to become friends and join your team, a possibility that increases if you feed it during the battle with its favorite food among the many available in shops and streets of Valdoro. As you will have understood, despite the introduction of the M-Skills and the Poke we told you about a little above, the combat system and the mechanics at the base of the yo-kai collection remain unchanged, with the strategy of the battles being reduced to choice of team formation, limiting its depth compared to other titles of the same genre. However, after the dozens of hours spent in the company of Yo-Kai Watch 2 we do not feel like saying that this is necessarily a defect, but rather a feature of the game system to take note of and draw your own conclusions based on personal tastes. This is a more simplistic approach, but no less effective; however, if you did not like the first chapter, the M-Skills and the Poke will not be enough to make you retrace your steps. Secondly, and here we move a more objective criticism, the routine that leads to the enlistment of the sprites remains rather tedious, inevitably making the more collector soul of the title lose its charm, especially in the face of the introduction of more than two hundred new yo-kai. Extralife In addition to the new locations, the game world is filled with secondary activities useful for catching your breath between one quest and another by obtaining rewards and special items. Going around the city you can find riddles to solvekings, secret passages and mysterious gates to access a sort of parallel world with many small rooms to complete. In this sense, the objectives change according to the mission: in some cases it is enough to reach the exit, while in others you have to kill a certain number of enemies or a dangerous boss. Also interesting is the Blasters Mode which reverses the perspective and allows us to take on the role of a yo-kai engaged in a series of action fights against other yo-kai; this mode is best played in a cooperative where up to four players start from a different point on the map making their way through the enemies until they reunite with their companions during the battle with the final boss. In this case the level of challenge is quite interesting and requires a certain amount of strategy at least in the choice of yo-kai to have a team that is as balanced as possible. On the multiplayer front, however, the scenario becomes competitive and the version of Yo-Kai Watch 2 that we purchased comes into play: Spiritossi or Pulpanime in fact divides the players into two opposing sides who compete to decree the best donut shop in town, enriching the end game with a new challenge that will see us engaged in dueling against other players to earn points for their team. Furthermore, and this is a very welcome novelty, it is possible to exchange medals to complete your collection. Finally, from a technical point of view, this second chapter has also highlighted the very high level reached by Level-5 with its productions: the map is large and full of details, the clean graphics and the textures give a cartoon style of big impact. Everything is then embellished by the interlude scenes taken directly from the anime, complete with Italian dubbing.", "date": "2017-03-31", "grade": "8.8"}