{"name": "A caccia di demoni", "ref": "https://multiplayer.it/recensioni/181290-touhou-genso-wanderer-a-caccia-di-demoni.html", "text": "NIS America has decided to bring another extremely niche title to the West, belonging to the dungeon crawler genre with many JRPG elements which in recent years has lived a sort of second life thanks to the many new exponents. Touhou Genso Wanderer pigeons into the broader Touhou Project, a set of titles born as a scrolling shooter that over the years has found new exponents inspired by the series but of a different genre. However, Touhou Genso Wanderer keeps intact some elements related to the titles of the main series, such as the setting of the story always set in the Gensokyo region, a fantastic place where humans and demons have lived together for centuries. Touhou Genso Wanderer brings the series into the dungeon crawler genre with strong JRPG influences Back to town The protagonist of Touhou Genso Wanderer is Reimu Hakurei a pretty shaman who has the task of protecting the Great Barrier of Gensokyo by facing and defeating the powerful demons who constantly try to bring it down. Everything changes when one day the protagonist discovers that her friend Rinnosuke Morichika, due to a dark force, has transformed into a threat to the entire village. Reimu discovers that his friend wants to replicate the entire population of Gensokyo and lashes out at him in an attempt to make him return to his senses, but due to his great power he is forced to flee. This is how we find ourselves in an unknown place with the task of returning to the city as soon as possible to defeat our friend before he can do any damage to our fellow citizens. Although the incipit and the characterization of the game world are interesting, the story set up by the Aqua Style developers turns out to be rather inconsistent, unable to give the right depth to the various characters who often lose themselves in long-winded and completely marginal dialogues. A real shame, because in terms of gameplay mechanics and game structure Touhou Genso Wanderer shows several positive things. After a long tutorial, our return journey begins which will take us to the various places of Gensokyo through the climbing of numerous dungeons, each of which hides a seal necessary to move on to the next. On each occasion we will find many enemies waiting for us as well as numerous objects and collectibles to collect and use at the right times. The movements are the classics in eight directions, while as regards the combat, in addition to the inevitable life points, the Tummy bar is of great importance which indicates the level of satiety of the protagonist and once it runs out it leads to the progressive decrease of life points until they lose consciousness. It is therefore important to explore every nook and cranny of the dungeons to find as many items as possible and make sure you never run out of potions and drinks. Playstation 4 trophies Touhou Genso Wanderer provides 43 trophies of which 4 gold, 8 silver and 30 bronze. Some are hidden because they are related to the main story, others require many hours of play to accumulate experience points and find collectibles. A step at a time The combat system is the most interesting element of Touhou Genso Wanderer thanks above all to the great variety of enemies and teammates who have unique attacks and abilities. Once an enemy has been sighted on the map, he will approach us by attacking us with physical or magical attacks, to which we could respond with the use of white weapons or with the skill of our protagonist which, however, requires special cards to be activated which can be found in the dungeons or in any case purchasable at stores. By defeating the enemies we will be rewarded with money and experience points to which are added the particular ~P Items~, which allow you to recharge the Danmaku Bar, in order to use the iconic projectiles by choosing between four different types of attacks which, however, require a considerable amount of energy to be activated. This is why it is good to carefully weigh each attack and avoid the risk of running out of steam right in the face of the most insidious and dangerous enemies. In this sense, the level of challenge is quite high and the game over is always lurking, with all the consequences - and frustrations - of the case: the developers have gone down hard and every death forces you to return to the starting dungeon, with all the characters to base level, and do it all over again. Furthermore, the impossibility of retracing one's steps by tackling the previous dungeons again precludes any possibility of ~grinding~ forcing the player to always explore every nook and cranny of the scenarios and to defeat every enemy to develop their skills to the maximum and earn experience points.", "date": "2017-03-23", "grade": "6.8"}