{"name": "Kona", "ref": "https://multiplayer.it/recensioni/181247-kona-fa-un-freddo-kona.html", "text": "When we got to try Kona about a year ago, we were hooked. Since its beta, the title created by the independent Parables team has in fact shown that it knows how to make the most of the attraction offered by a setting like that of the wildest Canada, captivating the player with its exploratory component shrouded in mystery. A more than valid reason to pin on the calendar the release date set for March 17, 2017, the day in which Kona abandoned the Early Access phase to arrive on PC, but not only. At the same time, Kona was in fact also released on PlayStation 4 and Xbox One: the console version - specifically the one for the Sony-branded machine - was the one we tried to write the review you are reading. Will first impressions be confirmed? Other than spring, in Kona Canada it's still very full winter! Where is everybody? The place that forms the backdrop to the events told by Kona is Atamipek Lake, an imaginary area of Canada located in northern Quebec. We are in 1970 and a community of Cree natives lives in these parts, which came into conflict with the wealthy industrialist W. Hamilton, owner of a copper mine in the region. It is precisely the tycoon who calls into question the protagonist of the game, Carl Faulbert, a war veteran who recycled himself as a private investigator once he returned to his homeland. Hamilton asks our character to investigate a series of vandalism against one of his properties, making an appointment at the local general store to make arrangements and begin the search for the culprits. The client's wallet convinces Carl to climb north without asking too many questions, but shortly before arriving at the meeting place the investigator has an accident and ends up off the road, losing consciousness. Once awake, Carl begins to realize that he is the only human being in the area, while the blizzard - extraordinary even for such a ~Nordic~ place - continues unabated. As if that weren't enough, once he reaches the general store Carl actually finds Hamilton waiting for him, but in the form of a corpse: the investigator decides not to back down, continuing for the sake of truth to try to understand what happened at Atamipek Lake. Without revealing anything else, we limit ourselves to saying that the events related to Hamilton will end up intertwining with those of the local inhabitants, up to the inevitable supernatural component at the base of everything that happened. The plot actually does not shine particularly in terms of originality, and it is also for this reason that Kona manages to give its best during the early stages of the game. Finding ourselves forced to explore in solitude an environment where the presence of a mystery continues to breathe down our necks while the inches of snow accumulate is an experience bordering on distressing, fueled by an omniscient narrator who, if necessary, has no problems joke about Carl's whereabouts. The narrative component therefore plays a fundamental role in Kona, incorrectly labeled as a horror: beyond the macabre elements that make up the plot, the main source of stress is dictated by the feeling of being alone in the middle of nowhere, an aspect in which the Parabole branded project manages to reach excellent levels. Playstation 4 trophies Kona has a total of thirty-six Trophies, of which one is Platinum, five gold, twelve silver and eighteen bronze. Many of them are related to the completion of the main storyline of the game, but the list also includes some details belonging to minor aspects. Given the absence of free roaming and the inability to save to different files, fans of one hundred percent completion at all costs should keep their eyes peeled when going around from the very first game. Beware of the cold At this point some might see Kona as a walking simulator, and it is undeniable that the game has drawn inspiration from titles such as Firewatch, The Stanley Parable and others. However, the experience offered by the title of Parables cannot be seen as a simple ~walk~, if we consider its survival elements. In fact, the harsh climate of Atamipek Lake forces Carl to always warm up properly before going around in the open air; to do this, he must collect matches and pieces of wood scattered around the area, then relying on the braziers present in the houses to bring the body heat indicator back to the right levels. There is also a stress factor, linked to elements of the plot and to particular game phases: in this case, if the indicator drops too much, you don't die, but the precision and movements of our virtual alter ego are severely limited. The third and last parameter from tto take into consideration concerns the level of health of the protagonist, and there is little to say about this. Unless he decides to deliberately go around freezing, it should be specified that Kona is quite generous in terms of resources. The choice of the developers was therefore to offer a less frustrating experience in terms of survival, but we would not have minded at all to find a more demanding challenge in this sense too. A few more headaches come from the puzzles around: nothing unsolvable, mind you, but at least on a couple of occasions we are asked to sharpen our eyesight and brain so as not to get stuck. In this regard, we also point out some backtracking in search of missing objects, favored by the fact that Kona prefers to help us very little in finding the way forward in general. A hint from the narrator or a note in Carl's diary may in fact be the only way out: a choice that in the light of what has been said for the survival part we welcome with pleasure, but which we imagine for someone could be a source of frustration. In Kona there is also space for some action phases, including the final one, but unfortunately it is the latter that defines all the limits of Parable's effort. Without revealing anything, we can say that the epilogue leaves a bitter taste in the mouth for more than one reason, making it impossible to return to Atamipek Lake in what would have been a welcome free roaming mode that would have been useful for discovering any secondary parts of the plot not revealed during the main phase of the adventure. Lights and shadows on Atamipek Lake In technical terms, as we have already said Kona offers a spectacular representation of the wildest Canada. From the physics of snowflakes and gusts of wind to the sound effects related to atmospheric events, everything contributes to defining the sense of loneliness and desolation that permeates the first stages of movement around the map. Unfortunately, however, it is precisely when we move that some flaws emerge. The PlayStation 4 version that we tested, for example, repeatedly showed uncertainties in terms of frames per second on the PlayStation 4 Pro in our possession, compared to a graphic detail that certainly does not justify them. Secondly, while moving by car or snowmobile you often end up incurring uploads linked to the area in which you find yourself: not very long, but still annoying and not very suitable for an experience that would like to make involvement one of the its strengths. The soundtrack adapts quite well to the various game situations and presents some well-made songs, even if perhaps a few more variations would have helped to break the repetitiveness of the music in the long run.", "date": "2017-03-23", "grade": "6.5"}