{"name": "Un carro armato per amica", "ref": "https://multiplayer.it/recensioni/181277-blaster-master-zero-un-carro-armato-per-amica.html", "text": "We are now used to seeing 2D as a sort of alternative trend in the current market, a stylish way to stand out in a landscape dominated by mega-productions, but for those who started playing video games in the 80s the situation is a bit different. There is a real need for bitmaps, for a way of constructing digital reality according to the principles of two-dimensional drawing applied to a canvas of pixels, a need that is only partially satisfied by the nostalgic operations that more and more often - and cleverly growing - they are proposed to us. It often happens that this taste is too filtered through a modern aesthetic, with ~artsy~ drifts that end up characterizing excessively a title on the stylistic front that has little else to say beyond its form, or applied to games that have very little they have to do with the original spirit of 8-bit, but sometimes we are faced with something that goes beyond the simple homage and looks like a real period title proposed today. Blaster Master Zero falls into this category, re-proposing the same original concept and applying some mostly aesthetic adjustments, which does not clutter the screen and does not weigh down the action with useless frills required by the average depth of today's productions, presenting itself as a pure and simple action. It appears in all respects as an ideal sequel to that bizarre game released in 1988 and remained largely neglected by the public, an ideal vision of what Blaster Master could have been with a little more computational power than its own but with the same 8-bit spirit. Not a modernized reinterpretation, but a technical evolution in the wake of the original, a real philologically correct recovery operation of a series that needed to be brought to light. Blaster Master Zero is an action of the same shape as the 8-bit ones The lair of the white frog That Blaster Master Zero is faithful to the original is already clearly visible from the story, which appears as a simple pretext to give life to the action but without even trying to be logical or acceptable according to today's narrative canons: in an unspecified future, the young and brilliant scientist Jason finds himself chasing his frog friend, who has fallen into a sort of hole. This turns out to be a sort of interdimensional passage that transports Jason into an alternate world, populated by beasts, military technologies and hostile mutants. Fortunately, our hero almost immediately finds a strange tank called Sophia III with which he immediately establishes a profitable relationship based on destruction and survival, within a strange adventure that leads Jason, in search of Fred (the name of the aforementioned very rare frog), to also meet a mysterious girl to gradually discover the mystery of that bizarre world that surrounds him. In essence, it is a revival of the original story and formula, but Blaster Master Zero is something more and different than a simple remake, which is why we can speak of a sort of reboot for the series. An atypical restart operation, however, because if it is true that the work carried out in terms of content is remarkable by Inti Creates, now considered gurus of classic 2D graphics, there is no intention of updating the original concept nor its appearance, beyond an evident enrichment of the color palette, animations and details on the screen which, however, manage to never be intrusive and maintain a perfect balance between the classic style of gameplay and what we are facing on the screen . It is an operation that recalls other brilliant solutions on the retro theme such as Shovel Knight, for example: it takes a while to get into the right perspective, but once you get caught up in the rhythm and its multifaceted mechanics, everything appears to be perfectly its place. Two games in one Blaster Master Zero is essentially an ante litteram metroidvania, considering that it is almost contemporary with the two titles that, mixed together, founded this sort of hybrid genre. As appropriate, it is therefore a question of moving within vast maps with different and interconnected settings, characterized by areas with different dangers and environmental elements and the possibility of backtracking to explore them in depth. By progressing in the game and in particular by defeating the numerous bosses that are located throughout the levels, new weapons and abilities are unlocked both for Jason and for the Sophia III tank, which also allow you to reach new previously inaccessible areas of the map, such astextbook of the perfect metroidvania style. The element that most characterizes the structure of Blaster Master Zero is the presence of two different perspectives that trigger rather different styles of play, with the possibility of controlling Sophia III or Jason directly on foot. In the first case, the game looks like a classic multidirectional scrolling action platformer, with platforms to jump on and enemies to shoot at, controlling the tank and moving the cannon in five possible directions. At any time it is possible to let Jason out, who in the sections dedicated mainly to the tank is very vulnerable but can access narrow passages or enter some doors and openings that only he can access. Once inside these areas, the game changes perspective and shows us the protagonist from a close-up shot and from above, with the challenge that becomes calibrated on Jason's abilities and his large arsenal, which can only be used in these sections. There is also a simple cooperative multiplayer mode, in which the second player controls a scope and fires assisting the protagonist. Between platformer, shooter and adventure The dynamics of the game vary significantly in the phases with a top-down view, abandoning the platform characteristics and becoming a sort of shooter with adventure elements that focuses on exploration, the solution of elementary puzzles and the elimination of assorted threats with the use of appropriate weapons. It is above all in these sections of the game that we meet the bosses, usually linked to the release of some additional skill or new weapon, therefore these are particularly intense moments, which require the good old approach to period action with quick reflexes and careful study of the enemy's attack patterns and weaknesses. This continuous alternation between platform/shooter game phases and shooter-adventure sections probably represents the greatest strength of Blaster Master Zero, which manages in this way to propose situations that are always rather new or in any case to maintain a high pace of play and an interest which is renewed and pushes to the maximum exploration of the maps. The latter is then maximized by the Metroid-style setting, with the need to exploit the conquered power-ups to open up new possibilities, also pushing for some backtracking and a more reasoned approach to the map. Considering the classical spirit, the balance is all too accessible for the ~hardcore~, especially when one begins to be able to count on advanced weapons and skills, but this has positive effects on the fluidity of the experience, with the drive to continue always supported by a good variety of settings, although everything is obviously represented in a stylized way, in line with the rigorous 8-bit vision that characterizes graphics and sound. A few notes on the controls: despite being perfectly responsive, the short stroke and low resistance of the Joy-Con analogs can be a problem when trying to aim precisely, given the presence of only 8 recognized directions, while the digital cross of Switch , composed of separate keys, unfortunately it is not really a viable solution.", "date": "2017-03-23", "grade": "8.3"}