{"name": "Rocky Balboa - Recensione", "ref": "https://multiplayer.it/recensioni/rocky-balboa-recensione.html", "text": "Fly Now skirt This mode is quite interesting, except for the pre-setting of the fights at the level of options and scenarios. But in the end it is also understandable given that they try to recreate, down to the details, the matches from the films. Other than this mode the game offers little else in terms of choice. We have a mode called ~Exhibition~, which is nothing but a sort of repetition of the first one but with the additional option of being able to select and modify all the parameters as you like (but couldn't you simply add it to the previous one? -Ed) , including the possibility of being able to impersonate all the other boxers in free or objective fights (round continued until the first knockout, 3 rounds of 1 minute each, etc). And a ~Fast Lane~ mode, a kind of ~immediate match~, in which the gamer is only required to choose how many minutes to play before being immediately catapulted into the ring. Little. The good multiplayer mode comes to the rescue of a low longevity which, given the nature of the title, could prove to be one of the main reasons for buying this title. Challenging a friend with another PsP and wi-re copy of the game can be very fun, and certainly more balanced in terms of playability, we will soon see why. Once in the ring and into the action, Rocky Balboa shows a fluctuating technical realization. A fairly difficult boxer control system that causes the athletes not to respond promptly to the commands given to them is countered by a good variety of moves and actions that can be performed with them, and a fairly good overall clearly arcade gameplay. In addition to the canonical series of hooks, direct and feints typical of each themed production, in fact, during the fights it may happen that the characters reach ~altered states~ in particular situations that will multiply the strength and speed of the blows inflicted by a certain amount of time of time. The eyes of the Tiger Represented with the now highly inflated motion blur effect, the video sequences during the execution of our combos against the opponent are very beautiful to look at, as well as effective. Certainly much more than the system that regulates the phases following a knock-out. Once hit hard and landed on the ground, getting up can become very difficult and often you find yourself losing matches even with the energy bar at its maximum due to the controls. In fact, to recover energy and get up, instead of repeatedly pressing a key as would have been more logical to do, the programmers had the unfortunate idea of implementing a hellish mechanism that involves the use of the analog stick to balance a sort of horizon so that it becomes fixed on a red line. The problem is that this operation is practically very difficult to perform, as the stick is very sensitive and in fact positioning the bar in ten seconds or less is a titanic undertaking. What appears to be well done in this title is undoubtedly the graphics sector. Sure, the PsP can offer better visuals, but overall Rocky Balboa looks good to our eyes. The boxer models move fluidly, are quite detailed and very similar to their respective cinematic counterparts, except for a ~Big Jim~ effect (i.e. similar to a plastic puppet - Ed.) and a body that is too similar between athlete and athlete, so like the scenarios that make the idea of a boxing match quite good, even though they are not full of details. And the outline, with many situations drawn verbatim from the entire saga of the ~Italian stallion~, including the last film. Too bad for the loading times, far too many for such a title. And the sound? Nothing to complain about here: thanks to the splendid original soundtracks, to an involved and boisterous audience, the atmosphere of the boxing event is perfectly rendered. Commentary (in English, but with Italian subtitles) included. Conclusions Rocky Balboa is an unsuccessful attempt to bring an arcade boxing game to PSP, as an alternative to EA's more simulative Fight Night. Technically speaking, the graphics, audio and in general the level of presentation of the product are not bad at all, but the imperfect and in some points difficult control of the characters, and the resulting gameplay, undermine the Ubisoft title. Yet, despite all this, the discreet multiplayer sector, and above all the possibility of controlling a cinema myth like Rocky Balboa, could paradoxically make this title attractive. Therefore a piece of advice: whether or not you are a fan of the film, try it before you buyor. Pros: Good graphics and great soundtrack. Rocky Balboa. Cons: Not long-lived. Difficult control system that directly affects the gameplay. Long loading times. He was just a simple suburban bully. But that didn't stop Rocky Balboa.~ With this striking phrase, Ubisoft also launches in Italy its title dedicated to one of the most beloved characters in the history of cinema, the Italian-American boxer Rocky Balboa, who in 1976 broke the box office all over the world with the first film dedicated to him. Accompanied by the splendid music of Survivor (remember the legendary Eye of the Tiger or Burning heart?), James Brown, Kenny Loggins & Gladys Knight, as well as that jewel of a song which is Gonna Fly Now, the exploits of the ~Italian stallion~ played by the great Sylvester Stallone have made a generation of young people dream all over the world, convinced by the very concept expressed by the film that any dream can be pursued by anyone, with a lot of will, sacrifice and commitment. Ubisoft's Rocky Balboa for PSP faithfully recreates the atmosphere of the entire saga, which just recently ended with the last film. And it doesn't just do it from an aesthetic or thematic point of view. But also as a concept, a game system. In fact, excluding the dialogues, the dramatic moments, the juice, the main pivot of Rocky's films remain the exhausting workouts to which the boxer undergoes and the fights to achieve his goal. Well, that's how it is in the video game too. In fact, everything revolves around these two key elements, so much so that there is no ~Career~ mode, often the only one capable of reviving such titles from an otherwise limited longevity for obvious reasons. In ~Mickey's corner~ (the historic coach), in fact, the player will have to train the Italian stallion to improve his characteristics by learning how to best move in the ring and take advantage of the various types of attack and defense, while in the ~Historical Fights~ mode , which is then the main one of the game, can face the boxers faced by Rocky in all his films in a series of exciting fights in the ring, from Apollo Creed to Ivan Drago, up to Mason Dixon, just to name a couple of names, and unlock, victory after victory, new content.", "date": "2007-03-07", "grade": null}