{"name": "Sonic Frontiers: la recensione della sua migliore avventura in 3D?", "ref": "https://multiplayer.it/recensioni/sonic-frontiers-recensione.html", "text": "Despite the improvements seen over time, we never expected to find ourselves in front of a game like this. Sonic Frontiers review is also this: the story of an incredible comeback, impossible to predict. We know that the most cheeky fans of the Sega mascot had never stopped believing in this sequel, thanks to an unconditional love and the luck of never having tried the work in progress versions that SEGA has allowed us to play in the last six months. Technically disastrous, with confusing gameplay and approximate commands, Sonic Frontiers seemed to have no escape. A further disappointment for fans of the blue hedgehog and yet another lost opportunity for the Japanese publisher, perhaps the worst in many years since Sonic Frontiers is the game that arrives in the wake of the incredible success of the two films with Jim Carrey. Think also of the trauma of the youngest who, galvanized by the cinema, would have found themselves faced with a terribly poor product. But perhaps Sonic Team's Japanese perceive time differently, otherwise it wouldn't explain how they managed to do in six months what one would usually expect in double, if not triple, time. Of momentum! Sonic Frontiers: if the idea of running like crazy jumping and bouncing everywhere appeals to you, you won't find better Sonic Frontiers is great, yes. There are still technical problems and various ingenuity, but nothing manages to damage a gameplay that represents the first completely successful attempt to translate the series, from its two-dimensional nature to a 3D with all the options. The two Sonic Adventures on the Dreamcast, the first with a polygonal engine, were good attempts, but also a draft from which SEGA then inexplicably departed, producing an endless series of games, sometimes decent, sometimes much worse. In the last twenty years, in our opinion, the only Sonic worthy of the character's indisputable fame was the wonderful Sonic Rush for Nintendo DS, year 2005, which took its original gameplay to extremes by returning to pure two-dimensionality. But this new game is different, it's the Mario 64 Sonic that fans have been waiting for since the days of the Sega Saturn; the revolution of a concept that seemed impossible to replicate in a more modern and captivating form. It's all about movement. Here Sonic does not have the usual limits of his videogame form, instead he can exaggerate exactly as we have seen him do many times in cartoons and comics. After all, this is the Sonic as we imagined it, children, in 1991: free to run in every direction, to launch itself on parabolic ridges to dart through an imposing waterfall, using pinball machine buffers and tracks suspended in the void placed there only to enhance his characteristics as an invincible, and very fast, hero. The same result was achieved in combat: Sonic's moves gradually become more devastating and spectacular, in a forced automatism, but which leaves various tactical choices to the player. Furthermore, most of the enemies have unique and contextual mechanics that will allow Sonic to perform maneuvers of a spectacularity never seen in a platformer. The possibility of parrying and counterattacking is unexpected, just as the lack of the most iconic move of the blue hedgehog is surprising: its spherical shape which we will now only see in the air and in some particular sections. Unique enemies Sonic Frontiers: It won't be full of details, but it's made to run at 60 frames per second (on current generation consoles) To be damaged, the Sumo mega robot will be pushed towards the electric fence that it will create to defend itself, while Arachno, once crippled, will launch us fifty meters into the sky, in a free fall where you avoid its missiles and gain speed until you hit it hard and unprecedented speeds. Fortress, on the other hand, is a giant of the skies, huge like a character in Shadow of the Colossus, and once annoyed he will begin to carpet bomb the surrounding area, in the meantime trying to get away; if we want to continue the fight, we will have to chase him until, perhaps due to the effort, rails will be generated from his tail on which we will be able to jump and, in a darting grind, avoid electric shocks and bullets until we reach his body to kick off to the longest possible combo. Combos that at some point may include a backflip to gain distance and five energy balls to throw at the target, or a Sonic so fast that he multiplies and punches and kicks the enemy from all directions. And we have not yet told you about the bosses who will be waiting for us at the end of the four (plus one) thematic areas present, where we will see and play the best version of Super Sonic ever, grappling with fights that will leave fans of Dragonball and Devil May Cry speechless. Don't expect anything particularly technical in terms of gameplay, but the experience is by no means obvious and the octane is too high not to stun with pleasure. Usually all this is accompanied by music of a certain caliber, between nineties techno rides and demetalled in growl with an all-Japanese epicness. Cyberspace yes, metaverse no Sonic Frontiers: Who Asked for Giant Bosses? The exploration, on the other hand, is much quieter, with tones clearly inspired by the masterpiece Breath of The Wild (honoured by a familiar sound effect) from which the peculiar segmentation of the gameplay is also taken. Here the sanctuaries of the Nintendo game have been transformed into the so-called levels in cyberspace, i.e. an actually excellent excuse to insert old-style, therefore also linear, stages into Sonic Frontiers, in which to do the best possible time, collect the five red coins and reach the finish line with a sufficient number of rings will allow us to earn fundamental keys to get our hands on the chaos emeralds and continue in the game. The cyberspace levels are the most nostalgic part of Sonic Frontiers, but the typical Sonic experience can be found in every inch of the five open worlds that SEGA has made available to us, where there is enough space to run at five hundred kilometers per hour without ever stopping, and sufficient density to provide alternative and more guided routes always within reach. In practice, if you are running towards a distant direction, it will be in your interest to take advantage of these paths made up of buffers, turbos, rails and much more, to make the journey even faster and collect the objects usually positioned at the end, these too essential to continue in the game. Hypnotic speed Sonic Frontiers: the combat system is as simple as it is effective and spectacular, but remember to parry! These paths are always exaggerated, they throw us in the air with dizzying loops, they catapult Sonic towards vertical walls on which to run and bounce in time towards one, two, three flying enemies that will allow us to reach the next rail which will descend like a missile towards the void , to climb abruptly towards the slopes of a mountain on which we will set foot in a mad rush towards the next objective, a new mini logical challenge to face, an enemy of twenty meters never seen before to defeat. Too bad that of these elements, only the most important will continue to be visible from a distance, while the others will appear rather abruptly, and ugly, a few meters away from Sonic. The game isn't bad at all to look at even if it feels a little dated in some aspects, but this pop-in effect is just too pronounced; perhaps it would have been just as clumsy, if not confusing, to have the sky always full of loopholes and tortuous rails, but at least they could have made their appearance sweeter, even introducing it into the lore of the game which is characterized by iridescence and virtual interference. How do you say? If you can't hide a game problem, turn it into a feature! Or at least do it on PlayStation 5, the console on which we tested Sonic Frontiers and where the game will also drop a few frames from time to time, but travels at crazy speeds: by increasing Sonic's skills at a certain point we struggled to go straight as far as it was responsive and snappy with the turbo active. Turbo which is used with the right trigger, lasts a long time, recharges in an instant and which you will probably keep active almost always. On PS5, like on Xbox Series X, the game features two graphics options: a redundant 4K upscale mode and a hypnotic and granite sixty frames per second. Robot actors Sonic Frontiers: there is also the fishing minigame, which is perhaps too simple The plot would be perfect for such a game: you can understand it even if you don't give a damn and each dialogue lasts no more than two minutes, each unplayed sequence even less. In Frontiers, Robotnik will once again try to get rid of Sonic and both find themselves in this parallel universe where the hedgehog's friends are imprisoned as holograms, and the ancient inhabitants fought an unspeakable war that seems to have brought them to extinction. The only ones left to plow the lands of Sonic Frontiers are these biomechanical machines on a war footing, the sweet koco that it will be good to collect around, and an enigmatic hologram girl who is helping Robotnik, but without too much conviction. The least successful aspect, at this juncture, is the quality of the animationsduring the dialogues that appear slow, robotic and decidedly below the standard of a modern video game. This detail also damages the timing of the jokes. The rhythm of the porcupine Sonic Frontiers: Each enemy offers unique combat sequences The Sonic Team has finally found the square, albeit twenty years late. Sonic Frontiers is simply fun, and he knows well that to make a fairly classic open world digested today, the only solution is to multiply its speed by ten. The game map will fill up with tokens, but in twenty hours there are very few times we've opened it to figure out what to do next. This is because in Sonic Frontiers you just need to run to get into the flow, into the rhythm. Everything usually starts by taking a ramp at one hundred kilometers per hour: after having done the acrobat to reach the end of the short platform section suspended in the sky, you get an indispensable tool to talk to the cast of the game thus sending the plot forward. Landings usually take place near other important elements such as a medium-sized boss who, once defeated, will give Sonic a gear with which to enter cyberspace and collect the keys necessary for the chaos diamond. It's all linked together so well that you end up playing for hours without realizing it. However, the merit also goes to the super pleasant difficulty: Sonic Frontiers is a title in which the player's skill is always necessary, but the punishment in case of an error is never really harsh. Furthermore, there is so much abundance of solutions and necessary objects that once again the answer is to run, in any direction, to find everything you need in your pocket. There will also be moments in which to recover orientation will be necessary to understand which new goal to launch headlong towards, and above all how to achieve it. Give us back the colors! Sonic Frontiers: RoboTails reporting Sonic Frontiers would even be exceptional if it were more refined, if it didn't hide some somewhat arranged passages, if the levels in cyberspace were less fluctuating, if its narrated sequences had more soul, but above all if there weren't platforms that sprout from a meter away from our blue hero. The Sonic Team has really put all of its history into this game, including its weaknesses which, however, have surprisingly become less harsh. The idea of setting this adventure in a more realistic-looking world is also not bad, but can we tell you the truth? If we try to imagine a thirty square kilometer Green Hill Zone, built like one of the islands in Sonic Frontiers, our heads spin and our hearts go into a Sonic Boom: that would be perfection! The atmosphere created in this game is very interesting, but we would have preferred a carnival of lights, colors and screams of pleasure to these dark rails and suffused buffers. Inside Sonic Frontiers there would have been a cooler, more arrogant Sonic, or even a sweet and round Sonic from the dawn, while we have to settle for a super strong and unstoppable, but also half-depressive Sonic.", "date": "2022-11-07", "grade": "8.0"}