{"name": "Supercampione del mondo?", "ref": "https://multiplayer.it/recensioni/180883-mario-sports-superstars-supercampione-del-mondo.html", "text": "That Nintendo is a master when it comes to gameplay layering is well known. Virtually all the main titles of the house boast simple mechanics only on the surface, which hide a rare depth under a colorful cartoon graphics or intuitive systems for anyone (regardless of age). With an important brand such as Mario's available, therefore, it is natural that the house has attempted to expand the views of the Italian plumber beyond the pure platform, even going so far as to produce ~atypical~ sports titles of more than worthy quality . Yet among these curious experiments of unforgettable masterpieces there have never been any, plausibly due to the absence of simulative elements, or in any case the marked push towards all possible audiences to which the good Mario has no way of escaping. Faced with this problematic condition, Nintendo has seen fit to implement the most logical of plans: to bring together its sports titles in a single game - complete with new dedicated contents - and therefore create a collection capable of satisfying every type of player. At the reins, the same Camelot Studios to which we owe the primary games from which the collection is composed; yet this seemingly infallible strategy has not been entirely successful... Will Mario Sports Superstars live up to the sports titles churned out so far by Nintendo? We are very sporty As mentioned in the introduction, Mario Sports Superstars is not a collection of minigames, but of five complete sports games, which refer to titles already seen on Nintendo consoles. The player can choose between soccer, tennis, golf, horse riding and baseball, with a total of 18 selectable characters in each sport (two must be unlocked). Athletes obviously have variable characteristics, and where a Wario will boast greater power, a Waluigi will be more precise and technical, with the necessary variations based on each discipline. The statistics of the ~captains~, however, are the least: predictably, each game boasts a complex gameplay, perfectly able to stand on its own feet despite some substantial modifications (perhaps intended to adapt it to a portable console, or simply for a matter of of hardware power). It's when you go about picking the disciplines one by one that you notice the care that went into their creation, after all. After passing an initial tutorial (unavoidable, and moreover incomplete in many cases, with the need to go and read the internal guides to learn advanced maneuvers), you can for example discover football, a variant of what we saw in Mario Strikers but with eleven players per team and the ability to launch boosted shots once you have enough ball possession. Even more complex than Baseball and Tennis, with the former requiring perfect timing for the serve and allowing for numerous spins (as well as requiring a minimum of strategy in managing the bases), and the latter which to all intents and purposes seems be a 1 to 1 transposition of the remarkable mechanics of Mario Tennis Open. Golf and horse racing close the package: the first is in turn a sort of translation of Mario Golf: World Tour, extremely similar to that game even at an interface level; the second however is a novelty, and sees you compete in a sort of strange variant with the horses of Mario Kart, where the tactic and the ability to keep up with your opponents (the steeds get tired as they accelerate, and being in a group allows you to keep energy and to sprint more) are much more important than simple cornering ability. Star player or home run? In short, a bomb on paper, yet the Nintendo game begins to creak when you go to analyze it a little more deeply. Football and golf are complex, for example, but the first is less responsive, fast and successful than the more contained but adrenaline-pumping Strikers, while the second, impeccable from the point of view of pure gameplay, has only four courses with nine holes each , which certainly don't make you cry for a miracle. Even tennis has very few courts, and although it has been reproduced with great fidelity compared to the original game, it's only really fun in multiplayer, because the artificial intelligence of the opponents on Nintendo 3DS gives very little satisfaction even on high difficulties. To be honest, it is paradoxically the novelty of horse racing that is the most curated in terms of content: it offers, just think, the possibility of taking care of and pampering your horse (personalizing it with various objects) between one competition and another, however suffering precisely in prince mode, because it's a bit slow and boring compared to other sports. For baseball, preevidently, it is once again the contents and modalities that are unsatisfactory, while the game system is of the highest quality. On the other hand, the multiplayer that we have just brought up seems to be the real focus of Mario Sports Superstars. The game uses a points system for online matches that closely resembles the one seen in Mario Kart 8, but divided for each individual discipline. The currency earned at each game should instead be used to purchase envelopes of stickers dedicated to a virtual album, which really represents a small sop, and only underlines the competitive nature of this collection. Even here, however, there are some problems: locally the disciplines can be tackled in groups, while online practically all are exclusively 1 on 1. That's not all, however, because the characters can be upgraded to ~Superstar~ using amiibo cards, and in this version they boast very high stats that can only be obtained that way. Little imbalances, mind you - considering that the powerful ~Star~ versions of the characters are normally unlockable - but it could undoubtedly have been avoided. Nothing to complain about when it comes to the technical sector: this is undoubtedly a graphically excellent game in the library of the Nintendo portable; colorful, fluid and really nice to see in action.", "date": "2017-03-13", "grade": "7.0"}