{"name": "Metroid Prime Hunters", "ref": "https://multiplayer.it/recensioni/metroid-prime-hunters_a.html", "text": "The strength of DS The game structure of Metroid Prime Hunters is therefore divided into two distinct parts. As for the single player mode, the developers of NST did not want to modify the excellent work done by Retro Studios by faithfully tracing practically all the characteristics of the Gamecube chapters. And so also in Metroid Prime Hunters we find ourselves going through vast levels populated by hostile creatures to be eliminated with a good variety of different weapons. The view is obviously in first person from the eyes of Samus, also in this case the absolute protagonist. By pressing a button positioned on the touch screen, it is possible to switch to scan mode, to examine most of the objects and artefacts scattered in the settings; in addition to a didactic and didactic function, the scan is also linked to the resolution of the puzzles present in the game. Obviously, as per tradition, Samus can transform herself into a sphere, so as to be able to reach otherwise inaccessible areas. The plot sees the heroine engaged in the search for eight objects, called octoliths, linked to a mysterious and very ancient alien civilization; to be able to bring them all together means to have the keys to attain the ultimate power. A goal that has appealed to the most daring and cruel bounty hunters in the galaxy, ready to do anything to achieve the result; Samus' job is to stop these bad guys, gather the octolites and, if this is not possible, destroy them. Compared to the episodes for GC, in Hunters the protagonist doesn't have to regain her faculties nor get new suits, already having all the skills she needs from the beginning; in fact, on DS the upgrades are linked to new weapons, gradually available during the adventure, and with which it is possible to open doors that would otherwise be closed. The levels, divided into planets, are a handful and require several visits before being fully explored; there is also a lot of backtracking therefore, just so as not to betray the origins. From a graphic point of view, the work done by the programmers is excellent, at times incredible considering the potential of the DS in the 3D field; certainly the definition is linked to the reduced size of the screen, and in the distance objects and enemies appear a bit muddy, but the richness of detail and the amount of polygons on the screen cannot fail to surprise. We are certainly a step above Nintendo 64, especially for the high frame rate which has some uncertainty only in the heaviest situations. The art direction is very good, in line with the series and with settings that touch space stations, ancient ruins, frozen planets or covered in incandescent lava. Everything perfect then? Almost, because unfortunately the level design is not exactly at the top, excessively linear and occasionally characterized by uninspired passages, between sequences of corridors and rooms that are similar to each other and not particularly intriguing to visit. The presence of only two end-of-level bosses is also disappointing, which occur during the adventure with some variations which, however, are not enough to renew the player's interest; to help digest the morsel there are fortunately the clashes with the various hunters, quite varied and excellent for giving greater variety to the action. Online! The second important section of Metroid Prime Hunters is linked to multiplayer, especially in an online key via the tested Wi-Fi Connection. In reality, the richness and care given to this mode clearly make it the main one, as well as the one on which the programmers have spent the most time. Up to 4 players can challenge each other, using not only Samus but being able to take control of any of the hunters defeated in the adventure mode; each of them has different characteristics, strengths and weaknesses, thus increasing the depth of the experience exponentially. With a rather questionable choice, Nintendo has decided to make only the deathmatch mode (called total battle) available for challenges against ~unknown~ players. To access all the others it is in fact mandatory to deal with users on your friends or rivals list and then (in most cases) to enter the long numeric codes associated with them. Once this obstacle has been overcome, however, we are faced with seven variations on the theme, which touch on practically all the classic game modes of online shooters such as the equivalents of king of the hill, capture the flag, last man standing and so on. It is also possible to add bots if there are not enough human opponents, and to send voice messages to the other participantsto the session while staying in the lobby. The fluidity of the action is excellent, absolutely lag-free and which confirms the goodness of the infrastructure on which the Wi-Fi Connection is based. The overall picture of Metroid Prime Hunters would therefore, summing up to this point, be extremely positive. Unfortunately there is a factor that we have not yet dealt with, deliberately leaving it at the end of this article, namely the control system. Let's face it right away: being able to become familiar with your digital alter ego takes a lot of time and just as much patience. The two different usable schemes both suffer from significant defects; one, which binds all movements to the keys and the control pad (such as Goldeneye) is far too slow and imprecise to make sense, especially in multiplayer. The second, which uses the stylus to control the gaze, is potentially very effective but far from immediate; as if that weren't enough, the position he forces to assume quickly leads to suffering from severe hand cramps, which force him to stop playing often and willingly. However, the decision to abandon the lock-on, linked to the additional complexity that this would have brought at the interface level, turns out to be a double-edged sword, requiring precision and coordination often hindered by the control system itself. Summing up, from this point of view it probably wouldn't have been possible to do better, but without a doubt it is an element that will push away more than a few less patient players. Comment The wait has been long, but Metroid Prime Hunters has finally hit store shelves. A masterpiece? No. NST's fatigue is instead an excellent game, technically capable of making the DS reach hitherto unexplored peaks, equipped with an adventure mode that is only discreet and an excellent multiplayer section instead. But the lack of immediacy of the control system represents a limit that only the most tenacious will be able to overcome successfully, paying for this goal with a series of hand cramps that are difficult to forget. The fact is that Metroid Prime Hunters is a game that is really difficult to speak badly about, but which finds all its flaws and limitations in the interface of the hardware it runs on. Perhaps the DS simply isn't exactly made for this kind of game... Pros Technically great Multiplayer rich like no other on DS Extremely rewarding Cons Difficult to digest control system Adventure mode can be improved Some limitations in online matches The leap from two to three dimensions has put many established series in the 2D world in crisis, which have struggled to find themselves and restore the original feeling with the advent of the polygon. In the short list of names that have survived brilliantly without making us regret the good old days, there is undoubtedly the Metroid franchise. In fact, despite the great hesitation in front of the first chapter entrusted to an external and moreover American team, Metroid Prime for Gamecube finally proved to be one of the best games available for the Nintendo home console, also giving life to a sequel that confirmed the talent by Retro Studios. Therefore, the enthusiasm in front of the announcement of a completely new episode for DS, entitled Metroid Prime: Hunters and entrusted to NST, was understandable, even more so after its online multiplayer features had been confirmed. After a long wait, the game is now finally in European stores. The result? Find out with us...", "date": "2006-05-23", "grade": null}