{"name": "Vorrei essere F-Zero", "ref": "https://multiplayer.it/recensioni/180659-fast-rmx-vorrei-essere-f-zero.html", "text": "It was the end of 2015 when we found ourselves appreciating the work of the German Shin'en Multimedia with Fast Racing Neo, a futuristic arcade racing game clearly inspired by F-Zero and which in fact represented one of the best non-first party Wii U exclusives of the last years. Certainly the relationship between the Munich-based team and Nintendo has always been particularly close, and the confirmation lies in the fact that Fast RMX is part of the group of games available at the launch of Switch, albeit distributed only digitally through the eShop all attractive price of 19.99. As can be guessed from the title, however, this is not a new episode of the series in the absolute sense, but rather a revised and corrected version of the original for Wii U with numerous ad hoc additions of sure interest, starting with new contents intended to expand the thickness of the offer. In fact, if a rather small number of tracks and vehicles could be criticized for Fast Racing Neo, in this case things are decidedly different: in addition to all the contents of the predecessor, the 8 tracks of the DLC Neo Future Pack are also present on Switch, to which are finally added another 6 unpublished and 5 shuttles, for a total therefore of 30 tracks and 15 vehicles. Not bad really. Fast RMX is a brilliant arcade racing game that has established itself as one of the best launch titles for the Switch Captain Falcon Fast RMX therefore follows the mechanics proposed in the previous release, a completely understandable choice given the goodness of the original product: exactly as with Fast Racing Neo, we are therefore talking about a game in which there are no weapons (and therefore far from the ~WipeOut~ formula ), but which on the contrary requires total and absolute attention to the guide element. The distinctive feature of the Shin'en Multimedia product is certainly linked to the incredible speed at which the spacecraft travel, capable of putting a strain on the reflexes and attention of players who are by now unaccustomed to this kind of proposal: Fast RMX from the start obliges keep your eyes wide open, because a moment of inattention is enough to find yourself literally thrown off the track. And that speed is the main tool through which to achieve victory is evident within the game economy studied by the Teutonic team, a priority to be pursued even on the condition of possibly sacrificing something in driving cleanliness: whether to touch the barriers in fact, trackside does not involve excessive penalties, on the contrary, not making the most of the opportunities to make the speedometer of your vehicle splash can undoubtedly compromise the final result. And these opportunities are many, because each Fast RMX track is dotted with colored stripes, blue or orange, which must necessarily be crossed with the ~phase~ of the shuttle of the same color in order to obtain a further temporary boost: switch from one color to another it is an instantaneous operation linked to the simple pressing of a button, but mastering this mechanic is an absolute imperative in order to be able to enter the order of ideas required by the game as soon as possible. Also because getting the wrong color association results in the opposite effect, that is a sudden braking. In addition to this element, there is the possibility of collecting spheres with which to fill the boost bar, to be activated at will during the race. The result is therefore a game with a brutal rhythm, challenging but never unfair towards the player: mistakes are paid for but commitment and perseverance always pay off, and reaching the first position always offers great rewards. The structure of the main mode lends itself perfectly to the portable hybrid nature of the new Nintendo console thanks to the division into micro tournaments consisting of three races each: each victory unlocks new competitions and shuttles, thus providing constant stimuli to continue. The track design is remarkable, which, despite some missteps, manages to guarantee spectacular and fun routes to tackle, which often develop vertically, in a sort of hypnotic roller coaster of the future. All supported by a more than pleasant technical component, which finds its greatest virtue in the rocky and constant 60 images per second: compared to the Wii U version, on Switch the programmers managed to reach 1080p (obviously in the docked version), but polygonal complexity and effects remained virtually identical. Let me be clear, Fast RMX is absolutely not an ugly game to look at, but it is undoubtedly not able to offer particular technical refinements. Faster than light If, reviewing Fast Racing Neo, we had talked about a game that was sometimes frustrating due to the high level of imp difficultyost and due to the consequent need to memorize the routes to get the better of the most demanding championships, Fast RMX takes a few steps back from this point of view, making the situation less extreme, thus collecting the feedback of a part of the user. Above all, this translates into a reduction in the time required to return to the track after an accident, and more generally in a slight limitation of the opponents' skills. The result is therefore undoubtedly a less selective product, but inevitably also less rewarding for lovers of the challenges of the past: if with the episode on Wii U even the most experienced had to sweat the proverbial seven shirts, on Switch instead will find to conclude the main mode with greater fluency. And at this point there is nothing left to do but switch to multiplayer or to Hero Mode, with the latter unlocked from the beginning, after the first cup, unlike in the previous version . This is a mode that brings the Shin'en Multimedia product closer to F-Zero, representing a sort of homage to the Nintendo masterpiece: in this case, in fact, the boost bar also becomes that of the shield, therefore to be used with great care and to be restored by passing over the colored stripes. All this while racing at the maximum speed offered by the game, in a sort of visual trip to face with your eyes glued to the screen. The multiplayer, on the other hand, expands in its options by exploiting the distinctive features of the console: in addition to the classic online game for up to 8 players (which we hope will be more populated than the Wii U edition), you can play in split screen for up to 4 using the Joy-Con or the Pro Controller, in an exquisitely vintage atmosphere that recalls what happened in living rooms challenging one's friends more than a few years ago, and up to 8 locally with each user equipped with a console and copy of the game. On the other hand, the absence of the Time Attack is surprising, evidently excluded due to lack of time but which will be fished out with future updates, as confirmed by the same team via Twitter. Finally, the support for the elegant vibration technology, the HD Rumble, offered by the Switch pads, deserves to be mentioned, actually able to return an interesting feedback with more facets than the ~standard~ solutions.", "date": "2017-03-07", "grade": "8.5"}