{"name": "Tagliuzziamoci a vicenda", "ref": "https://multiplayer.it/recensioni/180662-snipperclips-diamoci-un-taglio-tagliuzziamoci-a-vicenda.html", "text": "It was one of the first titles announced for Nintendo Switch in the famous presentation of January 13, 2017, when a slightly more precise vision of the new Nintendo console emerged, and amidst the noise generated by a revelation of the Snipperclips genre obviously it didn't really emerge as the main element of the event. However, the SFB Games game immediately appeared as an interesting title, especially as an ideal representative of the first batch of digital games which, probably, will have to progressively cover an important part of the play offer on the new console. On the other hand, the developers are quite experts in simple but high-impact games: previously known as ~The Super Flash Bros~, they made themselves known on the famous Flash game portal Newgrounds and then also moved to the mobile sector, where they reached a certain success especially with the adventure Detective Grimoire. Nintendo has shown, as usual, that it knows how to choose the support elements well, and has found in the team the know-how necessary to put together a small title but with great potential, strongly focused on cooperative multiplayer and easy to assimilate, able to be learned and played even in rather short sessions, ~on the go~, as the Switch philosophy dictates. Snipperclips fulfills this role perfectly, presenting itself as one of the most interesting games in the launch lineup especially for testing the possibilities of multiplayer anywhere and with anyone which represents one of the main features of Switch, thus becoming a bit surprisingly one of the most sensible purchases from to be done by those who have just bought the new Nintendo console (obviously after The Legend of Zelda: Breath of the Wild). From a small unassuming project, Snipperclips becomes one of the best launch titles for the Switch Let's cut it It is a question of completing various objectives within fixed two-dimensional screens, in which the two bizarre protagonists of the story move. They are two paper tabs that can move sideways, jump, crouch, rotate and cut each other, so that they take on different shapes. When one character overlaps the other and presses the key, the portion of paper corresponding to the intersection between the two figures is cut away, and the partner (or rival) therefore finds himself with a different shape, except being able to ~expand~ again ~ up to the original silhouette by pressing the appropriate key. Explained in words, this seems cumbersome, but it really is enough to watch a video of the game to understand how nice and intuitive this dynamic is, which allows a free and creative approach to solving the various puzzles. After an initial phase in which you will not fail to cut each other for the pure pleasure of doing it and look at the nice expressions that the characters take on, you immediately understand the depth of this mechanic: the various forms that it is possible to assume are necessary to achieve the objectives placed by the various levels, whether it is taking pre-established shapes, building ramps, puncturing balloons, collecting and transporting objects or moving elements of the scenery, it is up to you to decide which is the best solution to adopt in each situation. The beauty of Snipperclips is that there are no precise indications on what the objectives are and how one should go about achieving them, leaving the player a freedom that is never distracting, only stimulating. A few simple arrows in the background highlight the sensitive elements of the scenario and provide a vague indication of how to start, but all the rest is left to the imagination of the players and their ability to collaborate, in case the game is played in multiplayer, or manage the two characters in case you are single. Different solutions to various problems The standard mode places the two characters in different situations, in which they must work together to achieve a goal, which is revealed after a few seconds and requires different approaches and paths. The openness of the game also lies in the fact that players are not forced to a unique solution for each problem, leaving instead the freedom to choose which idea to adopt for each situation. Usually the title provides a vague indication of the meaning of the level, some synthetic graphic instructions arranged on the scenario reveal the new mechanics and then a key is pressed and something happens, while everything else is left to the discretion of the players who will have to exchange ideas and decide how to advance in a process that stimulates lateral thinking and more creative puzzle solving. Then there are two other ways that widen iThe multi-player multiplayer, and although they are less structured than the main one, they represent excellent alternatives, especially if you have the possibility of facing them in four. The Extra mode allows you to try your hand at three different disciplines in competitive multiplayer, namely basketball, air hockey and ~dojo~, a sort of direct confrontation to the last shred, while the Party mode introduces a new series of puzzles to be solved with the collaboration of four players at the same time, thus making the solution of the various game situations even more complex. It is clear how Snipperclips is a game designed mainly to be enjoyed in multiplayer, so much so that it loses much of its charm if faced alone, with alternating control of both characters. Strange worlds There is a remarkable coherence in the aesthetics of Snipperclips, which combines the scenarios with the characters, passing through the audio sector, between catchy tunes and themed sound effects. The aspect is obviously minimalist, as befits an indie puzzle game based entirely on a two-dimensional setting, but its characterization is perfect and remains on excellent levels within the various settings of the three different worlds in which the game situations. The small perspective effects that play on the two-dimensionality of the characters and the nice animations of these represent further touches of class that combine to create a very specific identity for this title and support the already original basic concept in itself. Each single level offers something new that enriches the gaming experience, introducing some new idea that integrates into the mechanics of changing shapes in a logical way, although there are obviously repetitions, with some elements recurring in different forms. The clarity of the graphics and the simplicity of the elements make Snipperclips a perfect game to use with Switch in the portable version, perhaps reaching the maximum expression in the multiplayer configuration with ~table~ kickstand and the various JoyCon distributed for a prt--porter multiplayer that perfectly represents the potential of the new Nintendo console. The problem that emerges may be the longevity: three worlds divided into 15 levels do not require a lot of time to be completed, unless there are any future expansions, and also the multiplayer solutions are not very many, however if you compare everything to the low price, however, a more than honest offer.", "date": "2017-03-07", "grade": "8.5"}