{"name": "Elogio dell'impossibile", "ref": "https://multiplayer.it/recensioni/180602-nier-automata-elogio-dellimpossibile.html", "text": "The video game has always been the medium where the concept of authorship is more difficult to apply. There are too many elements that make up a single title, enormous - at least in productions of a certain level - the teams involved in its development ... the direct consequence is therefore a general flattening of the creative imprint in favor of a vision of together dictated by the canons of a genre or by multiple intuitions; in practice, the annulment of the individual in favor of the group. In this multifaceted industry, therefore, there are very few designers capable of conveying their essence in projects: people with such a mix of energy and charisma that they have achieved a sort of symbiotic relationship with their products. However, if some are on everyone's lips after years of success, in the dark meanders of the Rising Sun every now and then a brilliant mind appears which in our parts is completely ignored - either because of the excessive attachment to an alien culture compared to ours, or because it finds itself translating its characteristics into games that are not exactly attractive for an increasingly hungry market like the western one. And it is precisely among these unknown eminences that Yoko Taro has emerged, an individual who during her career has had brilliant intuitions, and found the courage to flatly ignore both the need to be ~politically correct~ and that of putting in place attractive stories for whoever; all managing to conquer only a small but passionate handful of fans. Now, the motivation is easy to say: the games directed so far by Yoko Taro are in all respects ugly. Going around this harsh truth would be senseless, when it is a very significant element to understand the importance of the game we are going to deal with today. Because ours was part of the Cavia, a studio that has always been rather behind at both a technical and design level, and has churned out memorable video games almost only for one factor: the stories (written by Taro himself). Among these, the first and third Drakengard served to create a complex background, but their devastation by critics has relegated them to semi-unknown niche projects outside of Japanese territory. NieR, on the other hand, followed a different fate: a spin off of the first Drakengard - with narrative elements so powerful that they could stand on their own - it has become a cult title for some players, brutally underestimated because it is full of flaws but adored for its incredibly dramatic and brilliant plot, for some very clever gimmicks and for a soundtrack among the best ever created. So do you understand why his sequel, NieR: Automata, has sparked enormous expectations among those who have followed Taro's works for years? Completely unexpected at the announcement, this is the first game that sees the author's mad mind supported by a decent amount of funding from Square Enix, and by a well-known and capable team like Platinum Games. In short, if when he was with Cavia he pulled an incredible outsider like the first NieR out of the hat, what could he have done with these bases? NieR: Automata is an imperfect title, but also crazy, very brave and unpredictable Dolls at war Many writers draw inspiration from their negative emotions. Often, freed from the editorial yoke, they manage to give their best by making them explode in the texts and creating plots of rare cruelty. However, giving Yoko Taro carte blanche means taking the next step, it means ~looking into the heart of the abyss~. We're talking about a man who has always given a damn about what can and cannot be done at a narrative level in a video game, someone who has included pedophiles, cannibals, hermaphrodites in his stories before doing so would unleash the sword attacks of the MOIGE and respectable, and for which a ~good ending~ can easily coincide with the apocalypse. Automata therefore, as you can well imagine, does not go lightly either as regards the foundations on which its history rests, or on the events that untie the skein. This is a terrifyingly dark game, at levels that make dear George R.R. Martin is a schoolboy, and exactly like his predecessors he focuses heavily on the so-called ~shock factor~ which is always a certainty in Taro's stories. Don't be fooled by the light-hearted humor of certain scenes, by some absurd characters and by a generally positive attitude in the first phase. NieR: Automata will hit you in the stomach with a rare hardness, and sometimes it will even be able to do it in the optional stories of the side missions: a feature also present in the first NieR that demonstrates the willingness of Yoko and her team to outline a complex world and believable, not simpfeel free to ignore it in favor of a strong storyline. Yet the story is not the most exceptional element of Automata, although it is - it must be repeated - memorable and full of heart attack moments. In all honesty, the narrative of the first NieR and its characters were perhaps better in some ways, but that adventure did not possess a quality that Automata flaunts with indescribable force: a structure of the campaign somewhere between the ravings of a madman and electrocutions of an absolute genius, who transforms what was supposed to be a common JRPG action into something epochal. Many roads, no way out Wanting to avoid spoilers, we will give you a single tip: do not limit yourself to the first run of NieR: Automata. Completing the game the first time will lead you to an unsatisfactory ending plagued by numerous narrative holes, which will not allow you to grasp its real value. It will be a rather clear screen to clarify it once the so-called ~route A~ has been completed, but you will be able to fully understand the story of the game only after completing the campaign three times, with a concept of ~repetition~ very different from the usual. We will stop here, because what Platinum and Taro have come up with to avoid boring the player and keep the experience excellent in all games is sensational at times, and spoiling the surprise for you would be truly criminal. What you need to know, however, is that the underlying gameplay will not remain the same from campaign to campaign, and indeed you will see it continually readapt in unexpected ways, for an adventure that is never the same despite the more than 30 hours of duration (one easily bypasses over forty if you complete all side quests and hunt for all weapons). And the beauty is that the basic mechanics alone would still be enough to make the game fun, because they are very well thought out. After all, NieR: Automata is an action JRPG with sudden perspective changes that allow it to seamlessly insert platform phases into the missions, 2D fights reminiscent of those of fighting games, and Danmaku phases (basically sections very close to Japanese scrolling shooters, with hundreds of projectiles on screen). At the basis of the fights, the mastery of the Platinums in the action genre is all noticeable, not so much thanks to the combinations available to the protagonist, Yorha 2B, as for the finesse of the dodge: a sort of skid that can be controlled to the millimeter that marries beautifully with the need to avoid the many projectiles launched by the robotic opponents of the game. Each fight, thanks to the fluidity of that defensive maneuver and the speed of the attacks (simple, but nonetheless combinable in several ways thanks to variable maneuvers and the possibility of changing weapons equipped instantly), is spectacular and adrenaline-pumping, and this despite the the most characteristic element of all is that of support, i.e. the Pod. Technomagic For its part, the Pod is a floating robot that accompanies the protagonists during the adventure, whose primary function seems - at least initially - to be that of a basic weapon from a distance. In reality, however, the steel parallelepiped is very close to the Grimoire Weiss of the first NieR in terms of utility, since by purchasing (or acquiring through some quests) maneuvers dedicated to him it allows you to use moves that closely resemble the magic of the predecessor. Moreover, these are complex powers that can be adapted to various situations, and they start from an always useful laser to arrive at continuous attacks from short distances, carpet bombing, and a mixture of support powers and protective barriers. The role-playing element of the game also revolves around the pod, or rather the personalization of the chips. Purchased in the shop, enhanced through fusion (there is a sort of dedicated craft in the main camp) or found on the bodies of enemies, these components allow you to enhance attack and defense in various ways, to customize (or even completely eliminate) the interface, or to gain various support bonuses such as regeneration or mobility improvements. The presence of three configurations, that wasn't enough, also guarantees the use of different strategies, perhaps more markedly defensive, and goes well with the existence of two additional pods with replaceable attacks and spells scattered throughout the game (finding them is optional, so it's time to look them up.) Just as icing on the already very sweet cake, once all three pods are controlled it becomes possible to use enhanced versions of the powers - just hold down the dedicated button until the charge is complete - truly devastating. But let's go back to the elements for a moment~alternatives~, because the combat system is functional, but it is certainly not the only strong point of the mechanics. As mentioned, Automata has many elements from Danmaku, which usually open and intersperse certain missions, or are used for real bosses. you will find yourself in a game within a game very often during the adventure, perhaps aboard powerful mechs equipped with energy blades and machine guns (they can also use alternative types of shots, based on the equipped pod) or in other forms that we do not want to reveal. these sections are also well done, to the point of recalling at times arcade titles from the good old days, although they are clearly not always impeccable and perfectly calculated. Indeed, the maximum is given by the title during the bosses, which as in the first NieR are extremely scenic and original... with some small reservations. Machine heart Obviously we don't mean that the boss battles in Automata are unsatisfying, far from it. They are adrenaline-pumping, excessive and spectacular as per the Platinum tradition. However, in the first NieR, plausibly also due to the more limiting mechanics, they were more tactical and difficult, while in Automata - by virtue of the very high power of the Yorhas and the effectiveness of both the Pods and the usable maneuvers - they appear at times all too easy to overcome, more of a visual spectacle than a real challenge for the reflexes. The situation obviously changes when you decide to play the game on hard difficulty, and the automatic difficulty is deactivated in favor of a manual aiming closer to that of the predecessor; however the feeling of chaos remains, with some bumps in the level of the enemies (the final difficulty is not recommended, unless you are a cybernetic monster with unreachable reflexes). Only the obligation to recover one's body after death contributes to improving things, under penalty of possible loss of the equipped chips, but it is still a minor penalty (playing online you will even find the bodies of other players, with the possibility to get bonuses from their recovery), completely counterbalanced by the possibility of using him as a temporary ally if revived. Having said that, we are still talking about a title infinitely superior in every purely mechanical aspect to the Drakengard, its predecessor, or any JRPG action when it comes to the combat system, to the point that it can be mistaken at times for a pure stylish action at Platinum. But you avoid making such a mistake. Japan's craziest software house has in fact clearly demonstrated a strong love for the original with this sequel, creating a title that offers the speed and spectacularity for which it is known, but which in its soul is nothing more than a revised and corrected version of NieR. On the other hand, Automata is more classic in form than it might seem, and alternates between fulminant sections of exploration phases of its open map, or the possible completion of numerous rather basic secondary quests, enriched (as we have said in the past) by Taro's humor or from some far more dramatic and enjoyable subplots than you might think. For the record, even in Automata we are witnessing the ~trolling~ phenomenon for which the Guinea Pigs were known to many players. The first NieR was a title with strong critical tones of the video game industry (Japanese and otherwise), which sometimes stupidly ruined its own structure in order to underline the absurdity of certain formulas; Automata maintains this basic irony, but does it with much more grace and intelligence, limiting itself to irritating the player for short periods of time or to some angry jokes from 2B's adventure companion, Yorha 9S. A very small preview to make you understand the situation better: you could run for a long time between the maps to complete some secondary ones in the initial stages, only to find yourself with a comfortable teleportation to each save point after one of the main quests. From Taro expect this and more. Playstation 4 trophies NieR: Automata has 48 trophies, and it's a really hard title to platinum, considering that it requires not only to find all the endings (there are 5 main ones, and several other rather absurd ~minor~ ones), but also all the weapons in the game , and to upgrade both these and the pods to the maximum. In short, it would take several hours of mad and desperate research to complete the list, were it not for Yoko Taro, who has seen fit to insert the possibility in the game to buy trophies (with the internal currency, not with microtransactions) once the ~true~ ending. Avoid reading conspiracies in this choice, it is nothing more than his way of making the player understand the inconsistency of the concept of trophy.", "date": "2017-03-06", "grade": "9.0"}