{"name": "SiN Episodio 1: Emergence - Recensione", "ref": "https://multiplayer.it/recensioni/sin-episodio-1-emergence-recensione.html", "text": "Little of everything Emergence begins with Blade tied to an operating table watched by Alexis and another character. At Sintek they are quite vindictive and have decided to inject him into a liquid of an unidentified nature (whose properties, which are barely understood here, will be discovered in the next few episodes). When our hero is saved by a beautiful colleague (also with a tendency to work in very uncomfortable low-rise pants... what the developers wouldn't do to show us the thongs of their virtual heroines) we will finally be able to take control of him. After a short escape and an equally short journey by car, we will arrive near the Sintek headquarters (a yellow skyscraper with dubious architectural taste) and we will have to begin our march towards its top, in search of an antidote and of the truth (this everyone is looking for it... too bad it's difficult to get it with only 20$).[C] Genetically modified monsters also in Sin... Who builds palaces like this; older, usually has severe sexual problems. Did you know? One of Blade's visions... from the series: ~we didn't know when to make her undress~... [/C] Classic FPS is a definition that fits Emergence perfectly. It almost seems that Ritual have deliberately snubbed all the innovations of the genre in recent years (not even too many in reality) and have chosen to rely on a sedimented and rather monolithic gameplay (there was much more variety in the first SiN ...). Describing the game structure is not difficult: you advance, shoot, shoot, shoot and advance. The puzzles (if we want to call in this way a couple of buttons to press and barrels to destroy) are few, of no importance and do not affect the pace of the action which is quite high. From the point of view of the arsenal we are in a bad way, given that only three weapons can be wielded and all of them can be defined as ~classic~: Blade's pistol (a true icon of the brand together with Alexis's buttocks), a shotgun and a machine gun. All three are quite well made and equipped with secondary fire but, frankly, much more could have been done given that the competition is very fierce. Even speaking of enemies, we are not very good as far as variety is concerned: there are Sintek men (armed in various ways or equipped with jetpacks), Sintek's special teams, a couple of monsters and a couple of drones, plus two bosses. Tell us what happens to you We have left aside what we consider the most important aspect of the Sin Episodes project, above all by virtue of its distribution structure: the narration. Both at the level of fabula and at the level of the plot, we are not in good shape at all. This first episode takes advantage of some of the most abused clichs by video game writers (and not only), inserting genetic experiments conducted on humans into the cauldron, monsters that escape the creators' control (and that look terribly like those already seen in Far Cry... which already they weren't exactly original), a fatal and ruthless woman who wants to subvert the world order and so on and so forth. The feuilletons, by their very nature, were structured in such a way as to excite the reader thanks to an obvious narrative plot full of insights (to find out more, just read some of Umberto Eco's essays) which presented no real surprises but which left the , at the end of each episode, situations that would entice the reader to buy the next episode to find out ~how it ends~. It is the same principle that regulates telenovelas or telefilms. The episodic nature of this Emergence should respond to the same rules. Therefore, it was primary on the part of the developers to pay obsessive attention to structuring the plot of the story in order to leave in the player, at the end of the adventure, that sense of incompleteness that generates the will to know what will happen in the episode following. Tell us what happens to you The goal, unfortunately, has not been completely achieved and the narration is perhaps the most neglected element of the entire production. How can you expect a player to become attached to an aseptic and not very present character like Blade's colleague, so as to participate in an emotionally active way in the final twist (which we don't tell you, obviously)? To know what, should we look forward to the second episode? Emergence is tangible proof that the world of videogames should equip itself not only with good graphics and good programmers, but also with good screenwriters, in order to avoid plots that are so ~buggy~ and difficult to excite, with many mistakes in terms of tempo and pace. Source and stuttering Purttoo the flaws don't end there. In some rare cases we found it quite annoying to see enemies appear out of nowhere in front of our eyes. A spawn like this is unpleasant, especially since the enemies are mostly human and we don't believe they have teleporters. From a technical point of view, Ritual have exploited Valve's Source graphics engine very well, creating a well-characterized setting, both indoors and outdoors. The now ~indispensable~ physics is also present which, however, in this case, is marginal in terms of gameplay, but adds that extra touch of spectacularity that never hurts. Good textures and excellent models of virtual actors (both friends and enemies). The only flaw is the acting which, unlike what happened in Half-Life 2, here seems much more wooden and unnatural. From an audio point of view, the excellent title track and the presence of the plague that afflicts the Source should be noted: stuttering (small clicks due, apparently, to loading the different audio files). We were forced to lower the audio quality, to limit the phenomenon and thus be able to play decently. Hardware boxes The requirements to run Emergence are quite low: a 1 GHz processor, 256 MB of ram and a DirectX 7 compatible graphics card. Obviously these features are not enough to play it at its best. Bring the processor up to 3 GHz, the ram up to 1 GB and equip yourself with a DirectX 9 compatible graphics card to go more relaxed. Tested on a 3.4 GHz P4 equipped with 2 GB of ram and a GeForce 7800 GT graphics card with 256 MB of onboard ram, the game was very fluid at maximum details, even if the audio quality had to be lowered to compensate for severe stuttering problems. Final comment Mah. SiN Episode 1: Emergence is a short (but it was known) and partially successful title that lacks precisely where it should have concentrated its focus more: the narrative. For the rest it is a very classic FPS with too many structural defects but, substantially, quite solid. Without infamy and without praise. Pros Excellent from a technical point of view Vintage shootings but always fun It's cheap Cons Little overall variety Very trivial and not at all interesting story What reason can drive us to wait for the second episode? The videogame feuilleton Are video games discovering the charm of the feuilleton? One would say yes, given the latest developments in the sector with Steam as the master in the foundation of serial video games. This SiN Episode 1 Emergence is the first in a series of linked episodes (nine apparently) that will form a kind of videogame ~serial~ with a broader scope. Each episode will cost $20 plus tax (if purchased on Valve's platform) but can also be purchased in stores for a similar price. The scope of the novelty is there for all to see (for better or for worse), it only remains to verify whether the good is superior to the bad or vice versa. The first SiN, released at the same time as the first Half-Life (strange fate) was a well-made FPS... if it weren't for the huge amount of bugs that afflicted it and that decreed its commercial ~death~ (at the time finding the patch was slightly more complicated than now). However, his qualities have allowed him to create a group of fans who have never stopped hoping for a sequel that would redeem the first chapter. Well, the wait is over, and finally we can go back to wearing the shoes of the very gymnastic Blade who, over the years, has gained an even more forced appearance but has lost all his oratorical verve (forget the catchphrases with attached swear words... our hero is the victim of total silence). Yes, come on, I know you want to know if she's there too... but of course she is! Could they get rid of one of the trashiest characters in the history of video games? Let's talk about Alexis Sinclair... a scientist used to making fleeting (and prophetic) appearances and conducting her studies wearing fetish clothes that cover everything needed to avoid classifying the game as ~for adults~ (almost nothing, therefore... but let's not say it to the ESRB which lately has the wild rating).", "date": "2006-05-22", "grade": null}