{"name": "Gli incubi del turno di notte", "ref": "https://multiplayer.it/recensioni/180141-uncanny-valley-gli-incubi-del-turno-di-notte.html", "text": "There is always something fascinating and terrifying about the night shift, at least for those who have never actually done it. Net of the physiologically devastating consequences of such a form of work, the idea of staying awake while the world sleeps suggests the fact of visiting a parallel world, overturned, dominated by a great dark stillness that smacks of freedom and reflection. Or it can show a different side of the world, tearing the veil of sunlit conformity and bringing out disturbing shadows, capable of haunting and sowing the seed of doubt about the real nature of life and everything. The latter, unfortunately for the protagonist Tom, is the declination taken from the night shift staged in Uncanny Valley, which shows the other possible face of the world experienced by ~people of the night~, far more disturbing than the romantic vision sung by Jovanotti in the 90s, apparently. Tom seems to have some problems even regardless of the new job undertaken, to be honest, since for some time he has been haunted by nightmares in which he is being chased by mysterious shadow creatures with luminous eyes, which seem decidedly ill-intentioned. Given the situation, perhaps the choice of being a night watchman at a large mysterious company lost in the middle of the forest could be at least questionable for his sanity, but we are not here to question the choices made by people to make ends meet, d ' other side. Uncanny Valley is an adventure with survival horror elements that tells the story of Tom, a night watchman of a big company and a man with a dark past, staging his night watch sessions at the mysterious technological complex and his slow descent towards a nightmare with supernatural elements. The horror of Uncanny Valley is revealed gradually and for this too it is particularly disturbing Xbox One goals Uncanny Valley contains only 12 unlockable achievements, all of them quite rich by sharing the loot of the standard 1000 points. Given the structure of the game, all achievements are related to progression in the story and reaching particular conditions. For some it is necessary to return to the game after the first run, but this on the other hand is also required to complete the story. Point, click and run The game is shot from the side and takes place on a single two-dimensional plane, in a crushed perspective in line with the minimalist style adopted by the developers. For the rest, the mechanics are the classic point-and-click adventure ones, with direct control of the character and the possibility of interacting with various sensitive objects in the scenario. It is clear that the puzzles are not exactly the focal point of the Uncanny Valley experience, which is mainly focused on the narrative, even if staged in a rather atypical way. Beyond the meager dialogues, the story is lived through the dreams and visions of the protagonist, while a substratum of stories intersected with the main one is obtained from the emails and documents that can be read around the large factory where Tom works , in an example of ~environmental~ narration reminiscent of Gone Home or Stasis, to stay within the horror genre. The game is structured in such a way as to require to be concluded several times, and following different paths, to get to know every aspect, reveal the many mysteries surrounding Tom and reach more explicit endings, but to investigate thoroughly it is also necessary to act outside from the imposed schemes and perform actions that go beyond the orders given to the protagonist and his skills. As seen in The Stanley Parable, Uncanny Valley challenges the player to try new paths and discover secrets that are not placed comfortably along a set path. On the other hand, no limits are placed on the player's actions, with the rhythm imparted exclusively by the work shift schedule at the end of which Tom falls asleep, and the exploration session inevitably ends with the start of a new session assorted nightmares. We therefore find ourselves exploiting the waking hours trying to carry out our investigations into the mysteries of the employer company and the nightmares that plague the protagonist, choosing from time to time where to go and what to do in a non-linear structure. The actions taken have direct consequences in the continuation of the adventure and can indelibly affect the ending, also for this reason it is necessary to relive the entire journey several times to see what can be changed compared to what was done previously. A very valid idea which however tends to be a bit scattered, precisely because of this lack of indications and logical connectionsand that they can indicate the way to go, making the progression from day to day and from game to game a little uncertain. Creepy minimalism You might think that retro-style pixel art doesn't associate well with horror, but it's a graphic that can be well suited to the genre, as Uncanny Valley also demonstrates. Certainly it is a question of generating tension and unease rather than real fear, also given the somewhat revealing framing chosen by the developers, but the directorial choices, the austere and inscrutable look of the scenarios and structures and the level of detail of the interiors manage to create an almost perfect atmosphere. Moreover, these are not new solutions: the 2D pixel with a lateral shot applied to horror has already found confirmation in similar titles such as Home and Lone Survivor with excellent results, and Uncanny Valley continues in that groove also strong in a good coherence of the stroke and an audio accompaniment that manages to amplify the sense of general unease. Perhaps it lacks a bit of character, considering the quantity of titles with a similar style that are now found in the indie world, but this does not mean that during the games you are faced with truly picturesque glimpses and graphic solutions endowed with a certain class . What Uncanny Valley succeeds very well in is creating a climate of continuous instability, with the protagonist who seems to walk on a tightrope between the banal normality of a boring job and an endless nightmare, which can suddenly reveal itself simply by taking a wrong turn or leaking out at times from small details that indicate a slow and progressive emergence of an alternative and terrible reality. Those who love subtle and tense horror can fully appreciate this game, as a sort of homage to Lynchian, enigmatic approach to the nightmare underlying Tom's story. It is in the way the narrative ties into the structure of the game that the project shows cracks: it is not pleasant to grope over and over again along largely identical paths, desperately looking for a discrepancy and for a new event that can open an unprecedented path in an almost casual way.", "date": "2017-02-21", "grade": "6.8"}