{"name": "forma.8", "ref": "https://multiplayer.it/recensioni/180090-forma8-la-solitudine-dei-numeri-8.html", "text": "Metroidvanias are probably one of the most interesting challenges for any development studio: a well-codified genre, with well-known rules and mechanics which on the one hand risk giving the game a feeling of being seen and revised, but on the other can highlight a particularly inspired game design. And it is precisely this second case that occurs with Forma.8, a long-awaited work by Mixed Bag Games that combines style and substance in a product that makes minimalism its main feature. On the other hand, the Italian software house had already demonstrated that appreciate style with Futuridium. Forma.8 arrives after years of gestation and it was definitely worth it Form and substance Forma.8 tells the story of a small probe, from which the game takes its name, which after arriving on an alien planet and having lost contact with its ~colleagues~ will have to complete a very dangerous mission on its own: recover an energy source mysterious for reasons that we will discover in the course of the adventure. Unfortunately our little round friend doesn't have who knows what special powers to make it; indeed, at first it can only flutter around, but as the metroidvania tradition dictates, over time it will equip itself with the tools necessary to overcome any adversity and even face those enemies that previously seemed unbeatable. The problem, or rather the challenge of Forma.8 is that there is no introduction, written text or explanation, everything is entrusted to the player's wit and spirit of observation. Above all, his ability to guess the visual or audio clues that will suggest the solution of the puzzles or how to kill the various bosses will be crucial. Fortunately, we will be able to count on a map that will show us at any time in which area we are and where there are any connections with other sections. Forma.8 is therefore a game that focuses heavily on the fascinating power of the unknown and on our desire to challenge ourselves to understand what lies beyond that portal or how to eliminate that robot that shoots lasers from its eyes and seems unbeatable and does leaning on a top-level artistic vision. Eye candy The work done by Mixed Bag on the visual and sound level is absolutely excellent and places Forma.8 among the best Italian indie productions, probably also among the most interesting ones of this year. The music underlines every moment of the game with square waves of electronic music with a vaguely retro touch, the perfect soundtrack when you have to explore an unknown planet or face a mechanical spider the size of a building. On each screen, the eye is satisfied by the precision of the vector lines, vaguely inspired by Google's Material Design and mixed with a pinch of Limbo and Another World, which define narrow corridors and huge caves, moments of minimalism that alternate with vaguely Aztec architecture or Inca, ancestral memories of ancient cultures that have disappeared, all obviously at 60 frames per second and even at 4K on PlayStation 4 Pro. Then there are moments in which the only thing to do is let go of the pad to stop for a moment to contemplate a spectacular panorama, promptly enhanced by the musical commentary. Particularly successful is the visual code that also distinguishes the various game areas, clearly identifiable based on the setting, threats and colors. For example, the lower part of the vast playing area is filled with magma, so it will have the predominant color orange, lava columns and other nice finds that could lead us to a horrible death. The creatures we will face will always be more or less the same, but the environment will identify their special abilities, a bit as if the ecosystem had influenced their development. Those that live in fire will explode once they die, others will leave purple globes for a few seconds not to be touched for any reason, some will try to get close to hit us, others will keep their distance to target us with bullets. Under water, however, we will find jellyfish who can't wait to give us an electrifying welcome. Playstation 4 trophies Like any self-respecting metroidvania, Forma.8 is full of achievements related to exploration. Finding all the artifacts, unlocking all the bonus powers and some hidden goodies that we don't reveal to you will undoubtedly prove to be a task that can take you quite a bit of time. As for the other objectives, they're pretty much all related to completing the game and eliminating the main bosses, so they shouldn't be a problem. The fascination of the unknown But how are we going to handle all this if we are so helpless? Fortunately, this is not the case, in fact after a short time we will be able to have twofundamental skills, which over time can also be enhanced: a sort of short-range shock wave that spreads 360  and the possibility of leaving time bombs behind us. The union of these two powers will allow us to create projectiles to be used on most occasions, although we will always have to take into account the inertia of the probe which prevents too abrupt maneuvers. But that's not all since during the exploration we will find other special powers that will help us not only to overcome previously unreachable sections, as is the tradition in the metroidvania, but also to get out of the way of other thorny situations. However, we prefer to leave the taste of discovery to you because a large part of the beauty of Forma.8 lies precisely in getting lost in the tangle of its huge map, where everything seems to make no sense until the experience itself begins to guide us imperceptibly. Overall it seemed to us that the difficulty of Forma.8 was calibrated to the right level of challenge. There are moments that are quite hardcore, such as the timed challenges to get collectibles or the moment in which you have to probe a boss to understand how to kill him, but overall there is nothing that cannot be tackled with a minimum of experience, wit observation and desire to get involved. And if you are a PlayStation Vita owner, know that MixedBag has seen fit to insert Cross Play, so you can play it as you prefer.", "date": "2017-02-20", "grade": "9.0"}