{"name": "Il riscatto del Signor Yamada", "ref": "https://multiplayer.it/recensioni/180019-dandy-dungeon-legend-of-brave-yamada-il-riscatto-del-signor-yamada.html", "text": "This is just a brief review of a small mobile video game, but we recommend that you spend a few minutes on this piece to at least get acquainted with Dandy Dungeon, because it deserves wider spaces. We are used to seeing minestrones and copycats raging in the gigantic mobile market, new Special Programs and similar reshuffles from the ~sixty-fourth~ era (in the Commodore sense), offered at meager prices or completely free but which can be worth even less. Don't make the mistake of cataloging this game among those products, because you would be quite off track. Here we find the rigor of Japanese development and the original freshness of independent production seen in the titles of Daisuke ~Pixel~ Amaya, but even more than this the desecrating spirit of indie outside the box, and the demented humor applied to elements of social criticism and the gaming industry. It is a game that makes the ~meta~ its backbone, staging the story of Mr. Yamada, a normal thirty-six-year-old Japanese ~salary man~, who decides to make a change in his life by programming a video game. And this is exactly what we users have to play, who on the one hand find ourselves following the vicissitudes of Yamada's ~normal~ life, grappling with various funny characters and on the other we take an active part in the video game that the protagonist is building, gradually trying out the new introductions and ideas of the aspiring game designer and simultaneously making the story evolve by completing the levels of this strange roguelike-style RPG, with Yamada obviously the protagonist. It is therefore all a sort of meta-video game, in which a normal employee finds his redemption in the adventurous deeds of the videogame Yamada that he shapes himself night after night on the computer, thus transforming himself into a hero and trying to conquer the beautiful Maria, new neighbor of apartment as well as princess of the digital world. The irresistible double life of Mr. Yamada: humble employee at night and fearless hero at night Dandy adventurer At this point it is clear that the narrative structure and the particular setting are the main elements of Dandy Dungeon, but let's also see what exactly the game consists of. It can be ascribed to the roguelike RPG genre, even if the cut is somewhat original: it is a question of completing the various dungeons that Yamada develops by tracing a trajectory within the levels in order to cross each single box, collecting treasures and fighting against enemies present automatically, with the possibility of using objects to recharge energy or provide further bonuses. Augments applied to your character, weapons and equipment are carried over as you progress through the game, although each playthrough restarts progression from the beginning, in classic roguelike style, so evolution remains constant. The mechanics are pleasant even if obviously very simple and are well suited to short and immediate games, although the real engine of the whole matter is represented by Yamada's story, with the main push to complete the levels provided by seeing how the story evolves and how the protagonist's exploits within the RPG are reflected in the protagonist's ~real~ life evolutions. This is therefore the distinctive element of Dandy Dungeon compared to the enormous mass of similar titles present on the mobile market: a unique character, which beyond the habituation given by the usual progression of the character between the levels binds us to Yamada's story with a kind of affection for this funny and romantic big boy looking for thrills, adventure and of course love. As for the free-to-play structure, there is a stamina system that decreases as the game progresses in addition to the energy that is lost in clashes with enemies. In both cases it is possible to use objects that are conquered (rarely) on the battlefield or that can be bought with real money, but we point out the presence of some in-app purchases that are practically essential to be able to fully enjoy the game, such as the Duck that completely eliminates the problem of stamina and fixed-term sessions.", "date": "2017-02-17", "grade": "8.7"}