{"name": "Di nuovo sull'isola", "ref": "https://multiplayer.it/recensioni/179982-dear-esther-landmark-edition-di-nuovo-sullisola.html", "text": "Entering a person's room for the first time, the gaze embraces it in its entirety and draws general judgments based on a series of expectations that can be expected or disregarded. The impression given by the room is automatically transformed into a judgment on the person occupying it, a judgment in turn based on the more or less superficial knowledge one has of this individual. However, if we had some time to stop, i.e. to go around the room observing the signs left by those who live in it, signs that can be objects or simple ways of doing something to which we normally do not attach any weight, but which in reality do have weight , then we would also discover something else: a series of facts, small or large, which would better define the person and, at the same time, would blur that image that we had mentally built by observing it only superficially. We would learn about small foibles, microscopic stories or great passions and we would have diachronic access to times and spaces that are not ours, in the indefinability of visible and invisible connections that regulate the life of each of us. Don't be deceived: the room is not giving us the complete knowledge of who lives in it, which in itself is a possessive perversion, but it is giving us splinters of a much larger sculpture. Faced with them we can admit our cognitive limits, abandoning the old prejudices, or we can develop new and more oppressive ones, once again deluding ourselves that we have understood. We have reviewed Dear Esther: Landmark Edition, find out if it is worth returning to the island Limits and openings Dear Esther is a room. We can look at it superficially, limiting ourselves to noticing the fact that we are just walking and that the story it tells is difficult to decipher, or we can slow down and start looking around serenely, suppressing the childish desire for someone to lead us by the hand and abandon ourselves to the interpretations aroused by the oneiric associations and artistic suggestions that compose it. After all we are talking about the walking simulator par excellence, the one that defined the genre in its essence and in its absences (of mechanics, of apparent challenge, of easy rewards). Where the traditional video game is obsessed with providing easy interpretations of what it says, interpretations that reassure the player, taking away the anguish of understanding, but at the same time curbing his reflexive thrust, the pure walking simulator tries to mirror the ambiguity of life and the human condition, continually describing himself in his impossibility of providing a comforting key to understanding the facts. Honestly, it is absurd to continue reading reviews of titles belonging to the genre that underline their slowness and lack of things to do: would anyone ever criticize a flight simulator because there are planes flying? Despite appearances, developing a walking simulator isn't easy, because in addition to knowing what to put in it, you also have to understand what not to put in it and, above all, accept it for what it is. Try making one and you'll find yourself constantly battling with the sibylline terror of not being able to say as much as you want to, making mistake after mistake to try to force a certain interpretation. The new edition of Dear Esther Dear Esther: Landmark Edition is simply the remastered edition of Dear Esther for Xbox One and PlayStation 4, with some additions to justify the whole operation. The experience is that of then, with the protagonist who offers us fragments of his life, that is, he reads some letters addressed to a certain Esther, while crossing one of the Hebrides Islands, now abandoned. There are no puzzles to solve or enemies to face, but it doesn't matter, because, as we wrote at the time of the release of the original PC version ~if you let yourself be carried away and get into the right spirit, Dear Esther becomes an all-encompassing experience Soon you are invaded by the same loneliness that drags the protagonist to his destiny (it's tiring to tell a similar title without mentioning the plot, sorry if there's a preview), you admire the environment in which he is forced to live and leave savor the sense of emptiness and emptiness due to the deafening abandonment that surrounds it.~ In addition to a non-invasive but visible graphical overhaul, the Landmark Edition offers a precious extra, which deserves a mention: the developer's commentary. The author Dan Pinchbeck (game director), Robert Briscoe (art director) and Jessica Curry (musician) do an excellent job of explaining what they wanted to achieve with Dear Esther, explaining the reasons for some choices without ever being trivial. Listen itheir comments (or reading them, since subtitles can also be activated) is enlightening if you are also passionate about the expressive side of video games. Where usually the authors' comments only scratch the surface of their work, the above trio goes deeper and ends up writing, at least ideally, a real game design essay, without ever overlapping the interpretation of the gameplay of the players. For example, we discover that Curry has chosen to scatter the music, so as not to make it omnipresent, so as not to overly constrain the emotions of the players, allowing them silence to reflect on what they have seen and read; or Briscoe tells us about the impressionist approach he had in the composition of the scenes, with the player invited to observe in detail what appears confused and undefined at first glance. In short, it is an interesting addition, which alone justifies a new use and which will make fans of the original happy. The PC version The PC edition of Dear Esther: Landmark Edition deserves a separate mention, because, as announced, it was given as a gift to those who already own Dear Esther (you will automatically find it in the Steam library). Furthermore, the original was still kept in the library (but is no longer purchasable).", "date": "2017-02-16", "grade": "9.0"}