{"name": "Il Ragnarok  finalmente giunto", "ref": "https://multiplayer.it/recensioni/179959-for-honor-il-ragnarok-e-finalmente-giunto.html", "text": "With For Honor it was love at first sight. You know, one of those visceral loves that take your stomach, that keep making you think about how nice it could be to spend whole afternoons together, maybe even nights, united and inseparable. And to think that before arriving at the fateful yes we had many appointments together, we met in Los Angeles for a fleeting look, we met in Germany at Gamescom to get to know each other better and then we were together for two very long weekends during which For Honor has revealed itself in every part, without filters. No tricks to embellish trailers to convince us to buy and no presentations with great pomp to praise peculiarities that I would not have found once we got to the altar. It was a beautiful, clean story and with each meeting the love grew more and more. On Valentine's Day we finally held hands and declared our eternal love, revealing our deepest secrets to each other. In recent years, he has kept some things hidden from us and only after spending almost thirty hours together we finally had the complete picture of the situation. Thirty hours in less than two days are not a few but between the stories of his past and some online skirmishes time has literally flown by. Yet it seems only to have scratched the surface. For Honor is not a one-time title, it is not a title that you can take, play for a few hours and put it aside on the shelf: it is a title to devote all your time to, with maximum dedication and a spirit of sacrifice. A multiplayer game that does not accept betrayals. For Honor is a unique title of its kind, capable of giving great satisfaction In the obsidian legion broken bones at breakneck speed For Honor has a single player campaign, but it also allows you to play it in co-op with a friend if you wish. The campaign in question lasts almost six hours at a normal level, but it can easily occupy you for at least double the time if you decide to try your hand in realistic mode (that is, without any type of interface and without checkpoints) recovering every extra. The collectibles do not have a mere completion purpose but are used to unlock ornaments, steel and styles for your emblems to then show off online, more than enough reason to complete the main storyline. Without this stimulus, the eighteen levels that make up the story of For Honor are still quite useful because they work exactly like a huge introductory tutorial, while never going into the particularities of each specific class and almost always letting the player take an interest in the advanced mechanics. You can then start playing the campaign immediately, swinging your greatsword left and right as you mow down legions of wimpy AI-controlled soldiers, receiving satisfaction and gratification for the slaughter in return. You will walk mighty on the walls of the castles, among the snow-capped mountains populated by Viking tribes and you will observe from the top of the Japanese pagodas the world that burns at your feet. The For Honor campaign offers exciting moments and sensations of omnipotence, entertaining the player and making him learn the basics of the combat system in a different way than usual. To connect all the dots we then think about a plot that can be followed pleasantly, a story that despises the weak and presses the bold and the wolves, laying the foundations for what will then await you online. Six hours of skirmishes, violent clashes, blood, broken bones and beheadings. Fun and enjoyable but without that flash that would have made everything unmissable. There is a lack of cohesion between one level and another and some situations are proposed too often revealing excessive repetitiveness, attenuated by some level design choices that try to offer a little variety to the production. We'll be racing at breakneck speed on horses avoiding obstacles, there will be sections where you shoot a ballista and even moments where you stand up to continuous waves of soldiers horde-style but nothing really memorable. Even from the point of view of spectacularity we are far from what Crytek offered with Ryse, which despite not having an excellent campaign managed to exude more spectacularity. Ubisoft almost seems to have been afraid to overdo it, presenting an unrealistic world where samurai, knights and Vikings clash against each other but then taking their foot off the accelerator at times when something more could be dared. Perhaps it is the fault of the not very cinematic shots that fail to enhance the key moments or of the few enemies on the screen compared to what is offered by the competition, but the missions are overi still have that bitter aftertaste for a wasted opportunity, aware that with little more effort we would have had a true masterpiece in our hands. A pity because the foundations for doing well were all really there and don't get us wrong, we didn't expect who knows what opus magnum from a title based mainly on online, but productions such as Mortal Kombat and Titanfall 2 have shown that even in competitive games you can offer a highly satisfying single-player experience, which For Honor unfortunately fails to achieve for very little. A unique combat system If the campaign is rambling and intermittently repetitive, with just enough artificial intelligence, what is it that made us so much fun playing it? The answer is very simple and is to be found in the framework of the gameplay offered by For Honor. The combat system created for the occasion is incredible and offers a level of depth of a real fighting game. It starts from a rather simple game base with the ability to launch light and heavy attacks in combination towards three different directions. You can decide to throw side slash from right or left or drop your blade from above. To parry a blow automatically, instead, just put yourself in the guard position and move the left analog stick in the direction of the attack: immediate and effective. Hence a ballet of feints and tricks, a game of cunning to become unpredictable and overwhelm your opponent by trying to get past his guard and mortally wound him. A few hits are usually enough to knock out an enemy, just a couple of combinations of heavy attacks to see the target fall to the ground in a pool of blood. Only with this system, simplified and inherited from other medieval simulators such as Mount & Blade and Chivalry for example, fun is guaranteed and a very large audience is reached. Anyone can train in an attempt to become proficient with the basic techniques, even going so far as to win most online duels after a few hours of practice. However, For Honor certainly does not stop here and to the three directions it then adds the possibility of breaking the parry and grappling: both are used to break the enemy's guard and avoid the tedious turtle tactics. While the guard break leaves the enemy open for a free hit, grapples are essential to gain an advantage on the battlefield and, why not, use scenario objects to cause additional damage or badly finish the opponent. It is possible to push people onto the spikes that emerge from the stockades, throw them into bonfires or even boil them by pushing them into geysers, but also eliminate them instantly by tumbling them into the cliffs or ditches surrounding the arenas. It thus becomes very important while moving to always pay attention to where you are fighting, preferably leaning your back against a wall and staying away from any dangers, an element that dramatically amplifies the need to study the game maps and which is difficult to find in other games like that. Positioning is also essential to emerge victorious from complex outnumbered duels where only the Revenge mode (a status that gives you a short-lived immunity and unlimited energy) can save you from an obvious defeat. Without boring you too much with the technical details (which we will then elaborate on with a dedicated special) know that For Honor adds other levels of depth thanks to dodging, unstoppable attacks, poisonous attacks, bleeding, active counterattacks, feints and dozens of other small dedicated goodies. Unfortunately, there is no real tutorial explaining all these techniques to the players in particular, a rather obvious lack for a game of this kind. The two short tutorials present, including the advanced one, will in fact only give you a general smattering and all you have to do is throw yourself into the arena with a bot equipped with excellent artificial intelligence and experiment with techniques and special moves independently. Thus you will learn at your expense that stamina is of fundamental importance to emerge victorious from clashes and that everything revolves around your ability to manage fatigue well. Many elements that together make For Honor one of the best-conceived bladed games ever seen on consoles and which, without overdoing it, we could even compare to the old Bushido Blade. With everything For Honor's combat system has to offer, it's time to finally jump online and test it out on real-life players. An awkward and not very intuitive interface welcomes you, with some really game menusincomprehensible. For Honor makes clashes between knights, Vikings and samurai the fulcrum of multiplayer but it is not explained why the game makes you choose a faction on trust even before explaining the mechanics of war between factions, then preventing you from changing the choice except at a cost to lose all the prizes of the current season. Quirks aside, every time you fight in any mode you can spend the points earned on the tactical map and, at the end of each round, the faction with the most points will win the territory by repelling the opposing ones. At the end of the season, which lasts instead of a few weeks, you will receive rewards based on the territories that your faction controls and the maps will change their appearance by paying homage to the winners. If the structure described up to now works, the actual usefulness of the single player leaves some doubts, who will feel like a drop of water in the open sea, having very little influence on the general economy for the conquest of territories. Indeed, the war between the factions has cross platform functionality and involves Playstation 4 and Xbox One players, as well as PC players, who however cannot actively clash with each other in battle. Also strange is the choice of allowing points to be spent exclusively between one fight and another, consequently delaying the start of a new game, and not instead as would have been expected in a separate menu via the main menu. Many small inaccuracies that perhaps denote little experience in the field of competitive online games on the part of the development team. The soul of the warrior Regardless of which faction you belong to, all twelve For Honor multiplayer characters will be at your disposal for combat. We have already offered you a broad overview of the fighters who make up the ranks of Knights, Vikings and Samurai but the Shugoki is added to the nine classes already seen, a huge samurai armed with a two-handed mace and insensitive to blows, the agile Valkyrie equipped with a shield and spear and the hulking Lawbringer who sports a halberd and wears plate cuirass, has quickly become our all-time favorite class. At the moment there are small imbalances between the various fighters but nothing dangerously worrying or that cannot be fixed with some short-term patches. What matters is the variety and the enormous difference in characterization that the twelve classes present have, a commendable work that allows anyone to find a character that fits their style of play. There are slow warriors capable of generating an incredible amount of damage such as the Raider or the Nobushi, agile and fast characters who make dodging their strong point but also hyper-defensive fighters armed with a shield and capable of parrying even from all three directions simultaneously and then counterattack with brutality. Each class, in addition to unique and specific move sets, has activation skills to be used in battle that vary from simple passive upgrades to real weapons to be used in the crucial moments of the clashes and which are often able to turn the tide . At the end of each match it is then possible to come into possession of extra equipment for the warriors to wear and which change the basic statistics by enhancing one parameter and weakening another. There is the risk that as the weeks go by, those who have played the most will find themselves having builds available that allow them to prevail over the novices, an element that will have to be kept under close observation because it could weigh heavily on the community and on the fun. We didn't really like the fact of being able to buy credits from the shop since with these it will be possible to open boxes and find increasingly powerful objects or further enhance those already in your possession through a simple crafting system, a feature useful only to Ubisoft for scrape together some extra money but senseless for the purposes of competitive gaming, even harmful in some ways. We would have been satisfied with the cosmetic changes already present, numerous and wonderful to see. Fortunately, the competitive modes par excellence, i.e. two-on-two duels and one-on-one brawls, will have the equipment bonuses disabled, so as to let only and exclusively the skill be rewarded. With the arrival of the classified modes then, absent at the moment but already announced, we hope that the issue will be resolved definitively, leaving any imbalances there only in the more caciarone four-on-four modes and less suited to the technicalities of combat. Perhaps a few more modalities would have been welcome but,", "date": "2017-02-15", "grade": "8.3"}