{"name": "Ogni gesto conta", "ref": "https://multiplayer.it/recensioni/179901-lords-of-the-fallen-ogni-gesto-conta.html", "text": "It was not easy to face the joyful war machine represented by From Software and its Souls, however Lords of the Fallen tried it a couple of years ago, bringing home some valuable results but in any case lower than expected. The creature of Tomasz Gop, who then abandoned the franchise and will therefore not take care of taking care of the sequel, started off very well and put a series of interesting concepts on the table, however getting lost along the way and conceding a little too much in terms of depth. challenge and duration. While waiting for news regarding the aforementioned second chapter, CI Games has seen fit to bring the brand to iOS and Android devices, transforming the action RPG gameplay of the original experience into a gestural fighting game along the lines of Infinity Blade. In reality even more dry and essential: the mobile reduction of Lords of the Fallen leaves out any semblance of a plot to catapult us into a sequence of fights that take place within different scenarios, gradually filled with more tough and dangerous opponents. Three characters are available to us, to be unlocked during the early stages of the adventure: Harkyn, an imposing armored knight who wields a two-handed broadsword; Yetka, a swift and deadly warrior who uses a pair of daggers to best her enemies; and finally Kaslo, a thug who fights with a war hammer and a large shield. All have an arsenal that you can modify and enrich in various ways, either by collecting new weapons and items as you complete missions or by purchasing them by spending in-game currency. In this sense, the idea of implementing an automatic function of fusion of the same tools, which in this way produces a more effective object, is nice. The mobile version of Lords of the Fallen is a good looking fighting game but with some major flaws Dodge, parry, strike Just like in Infinity Blade, to start a duel in Lords of the Fallen just touch your opponent and get ready to counter his attacks. If we parry a blow three times in a row (watch out: the parries are limited and depend on our equipment) or we do as many dodges, the enemy is stunned and we can take advantage of this to damage him by drawing slashes on the screen which are then actually performed by our character, although we immediately notice a certain degree of slowness in the response to inputs. Wanting to think about the question by bringing into play the effective speed of the warrior we are using, like a characterizing value, the accounts still don't add up: without the necessary reactivity, even the simple combo system present in the game (right, left, right and things like that) becomes useless, and the appearance of some basic quick time events (for example the one in which you have to quickly press an icon to give power to the blow) only exasperates a situation that after a while begins to become quite frustrating . Let's be clear: the system works from a purely strategic point of view, the shots are successful (although not in the desired quantity, as many are not correctly understood) and after a few missions the challenge begins to get interesting, however the lack of execution in real time and a particular emphasis on impacts can only debase the experience. Added to this is the disarming presence of in-app purchases for those who are not satisfied with normal progression and want a little help, an element which, however, should absolutely have no place in a premium game worth 9.99 euros. We do not exclude that the developers could improve the responsiveness of the touch controls through updates, but for the moment the situation is this and it cannot depend on the slowness of the terminal used, an iPhone 7. Too bad, because the productive value of the mobile version of Lords of the There is no doubt about Fallen: the characters are very detailed and well animated, but above all the enemies are numerous, differentiated and surrounded by fairly evocative scenarios, while the musical accompaniment is essential but significant.", "date": "2017-02-15", "grade": "7.0"}