{"name": "Bella ciao", "ref": "https://multiplayer.it/recensioni/179826-sniper-elite-4-bella-ciao.html", "text": "Archived the African campaign of the third chapter, Rebellion has seen fit to switch to the Italian scenario for Sniper Elite 4, sending the special agent Karl Fairburne to investigate some locations in southern and central Italy to recover the plans of a devastating guided missile that the Nazis devised and that threatens to turn the tide of World War II. The places we will visit in the game have fictitious names but are based on really existing countries, characterized by suggestive panoramas that are emphasized especially during the dialogue sequences that precede each of the eight missions that make up the single player campaign. During these sequences we will be able to interact with certain characters in order to highlight secondary objectives on the map capable of making the experience more complex, multifaceted and even lasting: proceeding straight on at the normal difficulty level it is in fact possible to complete the story within six hours or even less, but by dedicating yourself to the side quests and increasing the level of the challenge, things will go much longer. Sniper Elite 4 represents another step forward for the Rebellion series, but we expected more Something old, something new Tough, determined and infallible, Karl Fairburne finds himself in Sniper Elite 4 having to deal with a very difficult situation, which sees on one side the allies and their not always idyllic relationship with the partisans, on the other the Italian troops and Nazis who control the territory. The novelties compared to the previous episode are put on display right from the start, although they are not in any way revolutionary mechanisms compared to the traditional gameplay of the series. In this case, it is now possible to climb certain surfaces and carry out silent eliminations from a handhold with the knife, while the internal combustion engines have disappeared which allowed, once turned on, to be able to fire with the sniper rifle by masking its noise to avoid alerting the enemies. The developers have rather focused in an even more convinced way on the element of freedom of action, in the sense of being able to choose the approach we prefer in terms of completing the missions, an aspect introduced precisely with Sniper Elite III: they are almost entirely the invisible walls and level design errors that afflicted past experiences have disappeared, the scenarios have been made even larger and equipped with different paths, each with different locations and pitfalls waiting for us. Wanting to fight while remaining hidden, striking from a great distance, we will necessarily have to play by waiting: within each area there is some event that creates a great racket, whether it is planes flying cyclically at low altitude or of a cannon that fires at targets, and by making it coincide with the sound of the shot we will be able to eliminate the targets without triggering the alarm, provided of course that the victims are not too close to each other. Before taking up the rifle, however, it will be better to use binoculars and mark all the soldiers, vehicles and any flammable objects present on the scene, so as to be able to check their position at any time and quickly implement the best strategy to neutralize or exploit them. Action or planning? If at first the tactical and reflexive approach seems interesting, you will soon opt for something more lively, approaching the guards and perhaps exploiting their patrol route to isolate them, lure them next to a bush with a whistle or by throwing a stone, to then take them out through a spectacular melee finisher, also emphasized by the now inevitable X-ray killcams. All aspects concerning the medium and short distance combat system, in general, have been substantially improved, thus placing largely a remedy for the shortcomings of Sniper Elite III: you can lurk and expose yourself to open fire, physical elimination as mentioned works well and on more than one occasion these resources prove to be essential to be able to continue in the missions without getting stuck. Of course, once again sniping remains, inevitably, the technique to be preferred and the shots scored by holding your breath (a technique that allows you to stabilize the viewfinder and have a certain prediction of the point we are going to impact) will be valued so much ruthless as spectacular through the aforementioned X-ray killcams, which show the devastation caused by our bullets on the bones, muscles and internal organs of the unfortunate people who decide to cross our path. It remains, at least on the normal difficulty levelle, a certain imbalance regarding the abundance of bullets and resources to be found around (in crates or rummaging through corpses), as well as above all the irrelevance of grenades and various explosives that can be placed around, and which we will end up very seldom use. A similar argument can also be made for the possibility of loading the bodies of killed enemies on one's shoulders in order to hide them from view: the connotation of the maps rarely makes this practice useful, and more generally the system of frequent checkpoints (assisted, however, by the presence of manual saves) confirms the anything but frustrating or punitive nature of the Rebellion title, which from this point of view winks at even the most unscrupulous of ~trial and error~ approaches. Of course, it must be emphasized that the artificial intelligence is calibrated to match the stealth dynamics of the game: never expect to deal with peaks, although coming under enemy fire is almost always fatal (just suffer two bursts to run into the game over and energy does not restore automatically, you have to resort to bandages or medical kits) and in various situations the ability of hostile troops to organize themselves, change positions and approach our last position is surprising. Similarly, the state of full-blown alert or alarm does not imply having irreparably ruined the course of a mission: for the enemies to go back to their business, it will be enough to get away, hide and wait a few minutes. The multiplayer modes Sniper Elite 4 confirms the validity of the online sector that we had appreciated in the previous episode, offering not only two cooperative modes (campaign missions and wave survival), but also six different competitive modes: the traditional deathmatch alone or in teams, the 'interesting ~King of Distance~ (in which the distances of the various kills are added up for the score) also alone or in teams, the ~Control~ territorial mode (in which you have to conquer and control resources to collect points) and finally the variant of the deathmatch ~No crossing~, in which the two teams cannot make contact due to an area of the map that is impassable. We had the opportunity to try the online offer in its entirety, appreciating its undoubted potential as well as the unexpected dynamism of the situations: we are talking about clashes between snipers in which, however, simply staying in position does not pay, given that the opponents will see the reflection of our viewfinder from a distance and they will be able to spot us. The solidity of the infrastructure is also good, given that during our tests there were no problems due to lag or excessive waiting times for matchmaking. Playstation 4 trophies Sniper Elite 4 allows you to unlock sixty-three Trophies, including platinum. To obtain them you have to complete the eight chapters of the campaign, upgrade your weapons to the maximum by climbing in rank, score an increasing number of kills, dedicate yourself with conviction to secondary objectives and eliminate enemies in different ways. The beautiful country If the African lands of the third chapter did not lend themselves very well to the enhancement of the settings, the exact opposite applies to the Italian locations of Sniper Elite 4: our country boasts an extraordinary artistic and architectural heritage, which unfortunately the Rebellion title only manages to exploit partly. In order to make a scenario truly memorable, it is necessary to ensure that the player can ~live~ it fully, which Ubisoft has always done very well with the Assassin's Creed franchise, allowing us not only to see a mere postcard in the background but to explore, interact, climb it, access the most significant buildings. It therefore happens that the best things are seen only in the static phases of the missions, with some evocative panoramas, while the rest is peppered with fairly generic assets, this time net of a great attention to the textures, all well defined and without blunders. Some elements, however, are still terribly ~old-gen~, in particular the modeling of the characters and their hair: Fairburne, for example, has a too generic look and a plastic hairstyle. Broadly speaking, this series still lacks something to compete with triple-A productions, and Sniper Elite 4 doesn't do enough to fill the gap. On PlayStation 4 Pro the game runs with an unlocked frame rate, but the moments of greatest fluidity correspond only to the briefing phases, where with the arrival of some enemy on the screen we invariably move towards thirty frames per second. The support for HDR is clearly visible and increases the chroma spectrum substantiallytic, especially towards dark shades, which we were able to appreciate all the more using an OLED TV. Finally, as regards the audio sector, the music does its job well and the main theme rearranged ~Italian style~ is very suggestive, while the dubbing is well made, with Roberto Draghetti reliable and convincing here too, a pity only for some broken audio level during some dialogues and for a bug that currently prevents you from turning off the subtitles.", "date": "2017-02-13", "grade": "7.3"}