{"name": "Una lumaca per amica", "ref": "https://multiplayer.it/recensioni/179567-snailboy-rise-of-hermitron-una-lumaca-per-amica.html", "text": "The present here Snailboy: Rise of Hermitron is the second chapter of a series that began with Snailboy: An Epic Adventure, a 2013 title that also marked the market debut of the independent development team Thoopid. At the time, many agreed in rewarding a decidedly particular gameplay, but there was no shortage of criticism regarding some macroscopic defects that also affected the quality of the game action. Snailboy: Rise of Hermitron therefore arrives with very clear ideas, basically proposing the same formula purged, however, of all the negativities that had conditioned the prequel: let's go and see if this time things went in the right direction. Snailboy: Rise of Hermitron gets things right, but it's not a title for everyone Invertebrates to the rescue If in the first episode the setting was that of a lush garden, here the action moves to the depths of the sea, with the protagonist called to face the evil crab Hermitron and to stop his intentions of conquering the coral reef. It certainly cannot be said that the strength of Snailboy: Rise of Hermitron is in the plot, nor in a character design that oscillates between the ugly and the disturbing, but fortunately the Thoopid product has many other arrows in its bow. In a substantially identical way to the prequel, the game offers a platform-like gameplay but with a much more reflective setting than the average, which can already be understood from the peculiar control system on which the entire experience is based. To move Snailboy on the two-dimensional plane it is therefore necessary to press a finger on the character and drag it to make a leap in the opposite direction with an intensity proportional to the distance traced on the touch screen. Mechanisms similar to those made famous by Angry Birds and the like, which here are accompanied by taps on the sides of the screen that allow the protagonist to take small steps forward and a maintained pressure on the display that allows him to float after a jump. It is evident from similar premises that the 25 levels of Snailboy: Rise of Hermitron do not consist of an adrenaline rush towards the finish line (moreover unlikely given the nature of the hero on duty) but rather in a patient search for the best way to reach the end of the stage avoiding obstacles and enemies and raking in as many bonuses as possible. Adding a further layer of challenge is the four optional objectives available for each scheme, which respectively require you to find a specific object, discover the hidden area, collect all the collectibles and get to the bottom without losing a single life. Furthermore, although it is a free to play, Snailboy: Rise of Hermitron does not push too hard on the front of in-app purchases: there are therefore two types of virtual currencies - coins and pearls - which are used respectively to buy potions and upgrades and to cancel the harmful effects of a possible game over, but you can proceed in the adventure without having to use it in a mandatory way. The main problem of the Thoopid product lies precisely in its peculiar style of play, which can appear as reasoned and reflective as simply cumbersome and boring depending on the user's inclination: certainly the developers have not racked their brains to find a compromise that could avoid such polarization (it would have been enough to adopt a different control system), thus precluding the possibility of reaching a wider audience. Finally, another critical aspect of Snailboy: Rise of Hermitron is the purely technical one: the product has clean and detailed 2D graphics but not too dissimilar from that of the prequel, and this is not a compliment considering that we are talking about a title released for four years does...", "date": "2017-02-06", "grade": "7.9"}