{"name": "Next-gen Ninja", "ref": "https://multiplayer.it/recensioni/179498-naruto-shippuden-ultimate-ninja-storm-4-road-to-boruto-next-gen-ninja.html", "text": "Being a DLC that tells events immediately following those narrated by Naruto Shippuden: Ultimate Ninja Storm 4, the review contains some spoilers on the plot. One of the great strengths of the Ultimate Ninja Storm series is that it has managed to convey the dynamism and spectacularity of the clashes between ninjas in textures and polygons that we have come to know first on the pages of the Naruto manga and then in the anime. It seems trivial, but in the last seven years the CyberConnect2 team has succeeded where many would have failed: taking a brand loved by millions of fans all over the world and re-proposing it in a videogame sauce without distorting, or worse trivializing, rivalries, situations and characters perfectly developed by master Masashi Kishimoto. In this sense, the series has always slavishly followed the original work by proposing the most iconic clashes and key events in Naruto's history, so as to avoid everything that Kishimoto himself did not consider part of the official Naruto universe. such as most of the films that have arrived in Japanese theaters in recent years. With Naruto Shippuden: Ultimate Ninja Storm 4 we relived first hand the last events of the manga with the bloody Fourth Ninja War, but the epilogue projected us slightly further following the film The Last: Naruto The Movie. Now, to close the circle, CyberConnect 2 and Bandai Namco have decided to take leave of the blond ninja of the Leaf Village with one last DLC entirely focused on the young son of the seventh Hokage, entitled Road to Boruto. CyberConnect2 ends the Naruto Shippuden: Ultimate Ninja Storm series with the Road to Boruto expansion Rasengan! For those unfamiliar with the events that affected the Naruto saga, Road to Boruto represents the videogame debut of the new course of the narrative universe created by Masashi Kishimoto. The master mangaka has in fact completed the story of Naruto with the conclusion of the narrative arc of the Fourth Ninja War, which was followed by the two films The Last: Naruto The Movie and Boruto: Naruto The Movie to lead the way to the adventures later of the ninja of the Leaf Village. Similarly, with the closure of Naruto came the news from Bandai Namco of the discontinuation of the Ultimate Ninja Storm series, with the developers who seized the opportunity to take leave of their audience with an expansion that also went to represent a sort of link between what Naruto has been so far and the future to come. The Road to Boruto expansion - which necessarily requires the original title - therefore takes up the events of the film Boruto: Naruto the Movie putting us in the shoes of the young ninja son of Naruto committed to facing the training that will take him together with his teammates Sarada and Mitsuki to take the Chunin Selection Exam. All normal, until a new pair of very powerful enemies belonging to the Otsutsuki Clan enter the scene and from there a series of fights and changes of location will start which will see Sasuke, Naruto and Boruto engaged to save fate again of the Leaf Village and the whole world. If on the one hand, as we said at the beginning, following the manga to the letter was one of the great strengths of the Ultimate Ninja Storm series, when dealing with a feature film of just over ninety minutes the situation becomes more complex , inevitably limiting the raw material from which the developers could draw. The fights are not many, the roster used is inevitably limited, but there is no shortage of epic moments and exciting clashes. In fact, the stylistic figure remains that of Naruto Shippuden: Ultimate Ninja Storm 4 with dynamic, fluid and spectacular fights, enhanced by first-rate animations, explosions and particles that fully convey the power of the most devastating blows and jutsu. Playstation 4 trophies Road to Boruto offers three trophies - one gold and two silver - linked to the completion of all primary and secondary missions. The latter to be completed will still require a good number of hours of play. Like father Like Son The play structure of Road to Boruto is a hybrid halfway between the Story and Adventure modes of Ultimate Ninja Storm 4: we could roam freely within the Leaf Village in Boruto's shoes, interacting with non-player characters to proceed with the story events or activate side quests. The Konoha that we have explored presented itself rather rich in locations and passers-by, scattered with shops in which to shopshort of ramen to obtain upgrades and equipment to use in battle, but the Bandai emporium is not missing for the occasion, stocked with many new collectibles. Among the missions of the main story, extensive use is always made of intermission scenes and substantial dialogues to introduce the various fights, but new solutions also appear such as the multiple-choice test for the Chunin selection exam or the race to capture the flags scattered throughout the Village which add variety to the formula by slyly proposing some situations present in the film. Indeed, Road to Boruto consists of an expansion whose main missions can be completed in just over a couple of hours, including cutscenes and interlude dialogues. In this sense, however, the secondary missions come to the rescue, of an inevitably inferior narrative caliber but capable of fulfilling the task of filler by proposing a plethora of tasks that give substance to the counting of the hours of play. The only trick of Boruto's training at the virtual reality center managed by Shikamaru allows you to have access to dozens of fights against the most iconic characters in Kishimoto's universe, allowing us to test our skills with really tough opponents and get familiar with the new personages. Road to Boruto in addition to the new mode also includes the characters of Mitsuki and Mecha Naruto, those who were the pre-order bonuses of UNS4 (Boruto, Sarada and Kakashi's sixth Hokage costume), Naruto in Hokage version and the three costumes of Sasuke , adult Gaara and Sakura, as well as new jutsu and new locations, but there are still some characters missing to complete the roster. In the light of our test and due to the very nature of the game, Road to Boruto stands as a valid swan song for the Ultimate Ninja Storm series: the price is undoubtedly high, but on the other hand the quality of the contents they offer is undeniable perfectly the events narrated in the feature film dedicated to Boruto and manage to offer several hours of extra play thanks to the various side missions.", "date": "2017-02-03", "grade": null}