{"name": "Tra alti e bassi", "ref": "https://multiplayer.it/recensioni/179412-call-of-duty-infinite-warfare-sabotage-tra-alti-e-bassi.html", "text": "Call of Duty: Infinite Warfare has been one of the most talked about chapters of recent years. Launched under a rain of negative feedback, it has gained strength from a fanbase determined never to give up the series and sales, after the initial collapse, seem to be back on track, snatching first place in many countries. In short, at Christmas Call of Duty still goes off like hotcakes and what better time than January to bring the first of the four additional contents expected for this season to the market? From a content point of view, the production value relies on the solid canons now dictated in past years: four new maps for multiplayer and a new area for zombies, a game mode that is still highly appreciated and widely played by all users, even the most hardcore. Let's discover together the first DLC of Call of Duty: Infinite Warfare The maps The first of the four maps presented in Sabotage is Dominion, the inevitable remake of one of the most popular settings in Modern Warfare 2. The old Afghan changes its face to adapt to a futuristic style that does not suit it, for a result that is all in all forgettable. The old concept of the map was designed to give life to interesting long-distance battles but this reinterpretation distorts the original idea due to the powers guaranteed to the soldiers with the new game mechanics and exoskeletons. Faster movement, gigantic leaps and a marked possibility of closing the distances have completely changed the strategies making Dominion a map for medium-range engagements. Certainly some of the historic sniping spots remain, but they are easily circumvented and the center of the location, with spaceships and wreckage strewn everywhere, offers a great deal of cover to hide behind. In the same way as the exteriors, the indoor areas are also uninteresting and lacking in detail, making Dominion the weakest point of the entire package. Noir on the other hand is instead a real pleasure for the eyes but it is also particularly pleasant to play. The incessant rain, which however does not alter the vision of the fast close-range clashes, the Brooklyn bridge that stands out in the distance and the wall runs on the animated futuristic billboards paint a picture in which it is wonderful to war inside. Noir is one of the best designed and most successful maps of Sabotage and could also win if compared directly with the locations proposed in the basic version of Infinite Warfare. From a mere gameplay point of view, Noir tries to break the mold and the usual offer with three main routes proposed by the Call of Dutyw maps is forgotten here, presenting a construction that is no longer linear and therefore rather unpredictable. There are dozens of opportunities to surprise opponents from behind, hitting them from the sides or waiting for them behind the blind curves of the many corridors. At the center of the playing area is the usual very hot focal point, a hotbed of deadly clashes that accompany the entire duration of the match. Another map with a winning construction even if with a more classic flavor is Renaissance. The map takes Venice as its setting and the desire to simulate Ezio Auditore and climb the buildings like in any Assassin's Creed is really high. Unfortunately, the limited climbing ability of our RIGS brings us back down to earth, which however allows us to observe the care taken in the construction of the dozens of shops and restaurants that line the warmer areas with some particularly well-kept interiors, capable of giving an excellent glance. Renaissance is a small map between canals, and narrow lanes offer little opportunity for maneuvering again favoring players with the best reflexes, especially in public matchmaking where team strategy takes a back seat. Neon, the fourth and final map of Sabotage has several points in favor but also several against. First of all, the idea is not particularly original and the virtual simulation of a firefight has already been proposed in many other shooters, even in previous Call of Duty chapters. The hit targets, instead of dying, dematerialize before your eyes in an explosion of colored polygons but also the setting that surrounds you provides a very dangerous sense of dj vu. The idea of re-digitizing cars after their explosion is a nice touch of class but it really can't save an idea that tastes so much like recycling. There are few winning ideas as far as level design is concerned, a situation that excessively flattens the combat experience for a simple final comment: forgettable. Make way for the zombies Is becomingit is now customary to talk about the extra content for the zombie mode as the real highlight of the DLC. Sabotage is no less and if in fact the multiplayer maps get by between ups and downs, Rave in the Redwood returns to raise the value of the package again, also thanks to that 90s drift full of quotations that those years like so much he really lived them. Probably for the young Call of Duty audience running at breakneck speed in a reinterpretation of Crystal Lake will not be the best but for those who have a few more years on their shoulders the easter eggs present and the atmosphere they breathe are particularly exciting. The story sees the return of Willard Wyler, who this time will catapult Ike Barinholtz, Jay Pharoah, Sasheer Zamata and Seth Green in a terrifying slasher movie. The mode is incredibly exciting and the generous size of the map has allowed the developers to increase the variety of situations offered in the game. Thus we pass from the starting hut to a dark lake and then move on to tree houses and dangerous mines. In addition to the zombies dressed up for the occasion, you will find sasquatch and a new super enemy to face, as well as new ways to eliminate certain brain-eaters. From the point of view of gameplay, perhaps more substantial innovations are lacking for a solid but not overwhelming global experience. The farewell of David Husselhoff, who accompanied us in Spaceland, is sad but director Kevin Smith appears in his place, who will try in his own way to keep the bar of tension high. The atmosphere that reigns in Rave in the Redwoods therefore remains the strong point of the new location, thanks also to the very successful music inserted, and this despite the usual power ups and the possibility of taking drugs to enhance our four protagonists. The Call of Duty DLCs serve only to maintain the community on the servers and to refresh the offer, for a strategy that is repeated year after year in a substantially identical way. A discreet package as a whole therefore but which certainly will not make you change your mind about the production nor will it push you to buy the base game to try it.", "date": "2017-02-01", "grade": null}