{"name": "Gestire la palla", "ref": "https://multiplayer.it/recensioni/179354-pro-basketball-manager-2017-gestire-la-palla.html", "text": "Another year has gone by and Umix and Cyanide are back to offer the market the most famous, also because it is almost unique, managerial series dedicated to the world of basketball. We are talking about the Pro Basketball Managers, who have reached their third incarnation, the 2017 one. Matches are now more detailed, but nothing to tear your hair out of It is a title that is aimed at a very small market niche, but in any case lacking in products of depth, therefore theoretically receptive to novelties, also given the certainly not prohibitive price at which the product is sold (we are talking about only 19. 99). In short, it is an effort that enthusiasts can afford to make, even on an annual basis... as long as they are given a valid product. The first edition, the 2015 one, left a bad taste in the mouth of many because, despite the undoubted managerial qualities, it was plagued by bugs and stability problems. The 2016 edition had greatly improved the situation but, as we will discover, it was not a good school for the 2017 edition. The game itself has remained substantially unchanged, with the same menus and the same options. The goal is always to take and manage a team from one of the many basketball leagues around the world (the roster is updated to the current season). Having made our selection, we will be able to decide which events to participate in, how to use the various members of the team, assigning them individual roles and choosing general tactics. We will also be able to get them to train, going to intervene individually where there are problems with form. Pro Basketball Manager 2017 is essentially made up of tables Nothing is really missing, from the management of the stadiums, with the possibility of intervening on the prices of the various seats, to the scheduling of matches, passing through the players' market, gradually up to the editor that allows you to modify the roster so as to always keep up to date the roses to the real situation. Among the novelties, the new 3D engine for meetings stands out, which makes them more pleasant to follow (to be honest, it's not exactly exceptional, but given the genre, you can be satisfied) and the complete revision of scouting and recruiting, with more reactions reports from players and more detailed reports on the observed. In short, everything seems beautiful up to now and one could even overlook the graphic poverty of the menus, which are anonymous tables with questionable color choices, and the background music, often simply inappropriate. After all, who cares about these aspects when it comes to a similar title? What the managerial player wants is that players on the field can be told to change tactics according to the progress of the match, or to establish the goals, or even to replace players and so on. All this in Pro Basketball Manager 2017 can actually be done, except that some non-overlookable defects start to appear quickly, ruining many of the positive impressions that were made. Is Pro Basketball Manager 2017 better than 2016 edition? We reviewed it to find out Bugs, bugs and more bugs The big problem with Pro Basketball Manager 2017 is its performance: which seems incredible given that it's a game made mostly of texts and tables. Yet not only is the initial load a pain, but navigating through the menus is also plagued by a noticeable delay between inputs and the appearance of the longed-for screen callback. Some news are interesting Arrived at the third edition of the game, something more was expected from Umix Studios also from this point of view. Mind you that no one will ever ask a manager to be what he can't and shouldn't; therefore to offer who knows what graphic delicacies or triple A finishes. The minimum wage, however, is right to expect it, that is, avoid harmful expectations due to disproportionate loading times and, above all, try to create a title that is as stable as possible. Here, the second big problem of Pro Basketball Manager 2017 is the presence of many, too many bugs. Here too we want to be clear: we are not talking about small glitches, which can also be present in such a title, but about blocking bugs, which in some cases forced us to restart Steam to go back to playing and which manifest themselves at random moments. The Umix Studios series has always been very lacking from this point of view and, to be honest, the 2017 edition is not the worst (the 2015 one was a nightmare). The game is plagued by too many bugs But it's also the third and compared to the previous chapter it's definitely worse, probably due to the new 3D engine, the only real significant innovation from a technical point of view. The rest remained more or less the same, segno that much of the code has been recycled. Honestly, we can't complain too much about this either, because management is a genre that revels in the annual iterations a lot: provided, however, that decisive steps forward are made. Steps that Pro Basketball Manager 2017 does not. A few examples are enough to make us understand: the editor was buggy and buggy remained and in some circumstances it was really frustrating to use; the game has memory problems that crash it after about two hours and the 3D engine, while doing little of relevance, often crashes the game. Before writing, we did an online search to understand if these problems happened only to us, or if they are widespread. Unfortunately they are frequent and therefore we feel obliged to warn you, penalizing the final judgment. It must be said that the developers are updating the title with good regularity, but it should also be added that sales have not gone very well and that, therefore, they could soon abandon it.", "date": "2017-01-31", "grade": "5.5"}