{"name": "Chi ci vive in quella casa?", "ref": "https://multiplayer.it/recensioni/179105-resident-evil-7-biohazard-chi-ci-vive-in-quella-casa.html", "text": "If you have read the review of Resident Evil 7 biohazard for PlayStation 4, at this point you will have more than an idea about what the key elements of the adventure are, and in general what they are, in terms of mechanics and otherwise only, strengths and weaknesses of the awaited return of the series. It is therefore clear that precisely that article remains the point of reference for all those who possibly want to deepen certain aspects of the game in terms of playability or longevity, given that in this sense, if we exclude some technical characteristics such as support for the PlayStation VR viewer, the two versions are identical. In this review, therefore, in addition to offering a second point of view on the game, we will focus on what are the possible peculiar aspects of the Xbox One edition. Resident Evil 7 biohazard takes the series back to the origins of survival horror At the roots of fear: old and new meeting A few years after its last appearance as the main series, Resident Evil has changed a lot: what we have experienced in many hours of play is in fact a different experience compared to what the saga had accustomed us to, even if in some ways, like we will see shortly, remains ideally similar to that of its historical chapters. From a stylistic point of view it is undeniable that Resident Evil 7 biohazard almost seems like a reboot, not only because it deviates in part from the traditional themes and stories (but don't worry, the links are there), but also because, while maintaining a conceptual level several of the classic elements of the gameplay of the series, radically changes the setting, passing from the typical view of a third person adventure to the first one, to create an experience where the subjective view, but also the scenography, equipped with a certain evocative power, they are at least as important as carefully planning one's movements from one dark corner of the house to another, or solving puzzles. The scenery of Louisiana, with its large swampy areas and the gigantic tangle of canals that transform the foggy areas into isolated areas where reality seems suspended in time and space, is in this sense perfect for the purpose, and seems to come out of one of the Brothers Grimm's dark fairy tales. Resident Evil 7 biohazard indeed has a dark and gloomy setting, made up of dense palm and cypress forests populated by unhealthy creatures and deformed monsters instead of the traditional figures of wolves, witches and trolls, and domestic areas where terrible bloody events occur . The perfect environment to stage a story starring an ordinary man, Ethan Winters, who in search of his missing wife finds himself catapulted into a waking nightmare, forced to fight step by step to try to survive in a scenario which pays homage to films such as the Texas Chainsaw Massacre, Wrong Turn and, in a couple of ideas, to American Horror Story: Roanoke. A story perhaps not very original, therefore, and which for this very reason exploits some of the typical clichs of dozens of genre films, but which nonetheless works at the service of the playability and staging of a story capable of restoring an atmosphere and a involvement like few others. The gamer thus finds himself in a desperate situation with no way out, forced to approach each phase in a different way, even hiding and fleeing when needed, also given the presence of enemies who cannot always be killed, at least in a conventional way. Plus a heavy feeling of extreme loneliness and constant danger well amplified even by details such as the few healing items, the scarcity of bullets and the need to optimize the resources in one's possession to survive. Which then, if you think about it for a moment, are just some of those aspects that characterized the first chapters of the saga in terms of concept, as we wrote before. After all, when Shinji Mikami ~invented~ the first Resident Evil, he started from these assumptions: as we told you in an old article on the subject, the game designer gave shape to ~his~ personal world of terror, where fear would be always been behind the dark corner of a corridor or the dirty glass of the windows of a room, and the gameplay would have placed a certain emphasis on the concept of survival through game elements such as the few means with which to defend oneself from enemies, the inventory from limited spaces to manage, puzzles to solve or the use of notes scattered here and there as an additional ~ingredient~ to the canonical narration that took place via dialogues or cutscenes. All elements that, coincidentally, are present in this Resident Evil 7 biohazard, and which make it equal to the first chapters even in its ~diversity~. As further confirmation of what we have just described, there is also the return of an old element of the series, the trunk, which brings with it as a consequence a strategic management of resources and objects to carry around, with the need to have to make more trips in case you find yourself in a tight spot with the spaces available. And that of the rescue system with pre-established checkpoints, this time however exploitable through the use of recorders instead of traditional typewriters. Xbox One goals Resident Evil 7 biohazard offers 37 Objectives for a total of 1000 points. To get them you have to complete certain challenges, such as completing the game in the three difficulty levels provided, or by collecting a specific object or resisting the attacks of a family member. In the swamps of Louisiana To adequately support everything we have described to you up to now is the RE Engine and, consequently, a well-made technical sector, which rests its foundations on a sound sector worthy of a cinematographic film and on well-defined graphics. From this point of view, Resident Evil 7 biohazard on Xbox One should adopt a dynamic resolution which, depending on the complexity or otherwise of the scene, would change the resolution ~on the fly~ up to a maximum peak of 1080p. A detail which, in fact, we cannot confirm 100% since we have not been able to ~measure~ it and which cannot be seen with the naked eye, and which we therefore report only for completeness of information. However, the frame rate is quite stable at 60 and the uploads are close to zero. We write ~enough~ because in a couple of circumstances, we actually noticed a slight drop in performance. Trivial stuff and, we repeat, sporadic, which we point out for the record, and which therefore could have been random, with the title remaining absolutely enjoyable and qualitatively beautiful. The light and shadow effects are in fact the best we have seen in recent months, with a series of light/dark effects that make the scenarios in which the user is forced more credible and therefore terrifying most of the time to move around being careful not to make too much noise and not to attract the unwanted attention of some threat. The various environments, both domestic and external, are cared for down to the smallest detail and particulars such as the dirty dishes of one does not quite understand what, the worn and rotten wood of the furniture, the mould, the filth in every corner, even outdoors, contribute greatly to instilling a sense of unease and overwhelming disgust. Perhaps some textures seen up close betray a certain underlying simplicity in their structure, but if on the one hand these do not show particularly high detail, on the other they are appreciated for their great variety, and therefore on balance there is nothing which could affect the general quality from an aesthetic point of view. Among other things, the various particle effects that manage the dust and other elements such as the mist typical of wet and marshy areas are well integrated into all this, which do their job well by dampening the background immobility and making it even more ~particular~ the atmosphere. The modeling of the characters is also good, at least for the ~human~ ones, with an appreciable effort in facial acting, and the quality of the animations, as well as the general physics, capable of leaving you speechless for the way it manages in a realistic way even the cuts on the flesh, the gunshot wounds and so on in a dynamic way. In our opinion, the only flaw is the absence of at least some of the classic enemies of the series, which in our opinion would have been a welcome addition from every point of view. To close the technical aspect is obviously the audio. The game is entirely spoken in Italian with a rather apt dubbing acting, like the rest of the music, which is no less, given that it blends well with the environmental and narrative context of the game and helps to increase the degree of involvement with some tracks that are activated in the most dramatic and ~horror~ situations. In the same way, the environmental effects perform their task adequately, accompanying the player in the exploratory phases with a whole series of ad hoc sounds, which sometimes do not fail to arouse a certain amount of anxiety: in fact, the creaking of a door that opens, or the thud of an object dropped in the next room to build tension even without the subsequent appearance of any enemy.", "date": "2017-01-24", "grade": "9.0"}