{"name": "Dragon Quest VIII", "ref": "https://multiplayer.it/recensioni/178456-dragon-quest-viii-lodissea-del-re-maledetto-il-ritorno-del-re.html", "text": "The eighth Dragon Quest is probably the most famous of all and also the one that is particularly dear to most of the old and new fans of the saga started by Enix in 1986. The reasons are many, but the most important, at least as regards us Europeans, is that in 2006 it was the first Dragon Quest to officially arrive on our shelves: at the time it lacked the suffix - which wouldn't have made much sense, given that the first seven had never been localized in our region - and came out with Square Enix brand, a few years after the merger between the two developers. A merger that many feared would distort this or that brand but which, at least in the case of Dragon Quest, served to reinvigorate the brand in the West. Here's another reason why Dragon Quest VIII is so loved: at the time JRPGs were extremely niche in our parts, but Dragon Quest had an incredible trump card, and that is the character design by Akira Toriyama, the author of the hugely popular Dragon Ball. Thus it was that many players approached Japanese RPGs, passing through a series that we now consider the quintessence of the genre. At the dawn of 2017, almost eleven years later, Dragon Quest VIII concludes the re-release of the series for Nintendo portables, landing on Nintendo 3DS with a conversion that won us over today as it did then. If you've never played Dragon Quest VIII, the Nintendo 3DS lets you make up for it in style King Trode's walking court Dragon Quest VIII also remains faithful to the tradition of the series which wants plots that are all in all simple broken down into a myriad of micro-stories that end up crossing each other. Forget the time travel of the recent Dragon Quest VII: in The Odyssey of the Cursed King everything happens in the present, even if the structure is not exactly linear. In fact, the story begins in medias res and follows the vicissitudes of a strange little monster who goes around with a horse, an adventurer and a former bandit. In reality, the monster is none other than King Trode and the horse is his daughter Medea: they have been transformed by Dhoulmagus, a wicked sorcerer who goes around dressed as a jester and who has cast a spell on the entire kingdom. Only one soldier escaped that spell, that is the anonymous protagonist who then set off with his sovereign to break the spell. The group is soon joined by some colorful characters: Yangus, the former bandit, will be with you from the beginning and represents a bit of muscle in the team. Then it will be the turn of Jessica, a young aristocrat who intends to avenge her brother, and Angelo, a womanizing Templar with a gambling habit. They too will join the party to hunt down Dhoulmagus, but it won't be easy at all because first they will have to solve the problems that the evil jester is causing everywhere, as well as find out what his real goal is. The cast is certainly one of the most memorable in the series, thanks also and above all to a script that leverages the relationship between the characters to outline irresistible dialogues and skits, dubbed in English and subtitled in excellent Italian. The Nintendo 3DS version of Dragon Quest VIII adds two characters to the protagonist's entourage who were originally mere extras on PlayStation 2. Red is a former flame of Yangus, a treasure hunter who uses fans as weapons, while Morrie is the master of the monster arena, a quirky, athletic old man who mostly fights with a pair of clawed gloves. It is worth underlining, in this regard, that the introduction of Red and Morrie in the cast is not the only alteration of the original story: in fact, in the Nintendo 3DS version of Dragon Quest VIII, Square Enix has implemented some cutscenes that deepen the plot , at least a couple of new dungeons, various new enemies and bosses, as well as a sidequest that unlocks a whole new ending. Unfortunately, it is also fair to point out some small tweaks that left us a little perplexed: beyond Jessica's new so-called so-called costumes, the developer has well thought of censoring a couple of cutscenes that could have impressed the most little ones. These are alterations that don't spoil the story in any way, let's be clear, but they occur in the advanced stages of the game, when deaths have already been seen in profusion... The warrior photographer To be honest, the news doesn't end there. The introduction of the camera opens the door to the long and fun sidequest of Cameron, a photographer from Porto Prospero who will ask us to capture some details around the world: monsters, characters or points of interest that we will have to photograph to redeem various rewards.Naturally it is possible to take absolutely impromptu photos, modifying them as you like and saving them on the Nintendo 3DS memory card: it is an additional entertainment that does not hurt and demonstrates the care that Cygames and Square Enix have had for this conversion, at least from a content point of view. Despite this, it is the balances and improvements in the so-called quality of life that have allowed us to enjoy The Journey of the Cursed King for the second time without getting bored in the slightest. Dragon Quest VIII was a great JRPG in 2006 but the new version has significantly improved some aspects that today it would have been a bit bold to bring back. Now it is possible to increase the speed of the fights which, moreover, are no longer random: enemies appear in the dungeons and on the world map, so the player can dodge or touch them to trigger the fight. Obviously the monsters that are too weak will flee at our sight, while the stronger ones will chase us until they catch us or we manage to lose them. During fights, the lower screen of the handheld displays the interface and parameters of each character, leaving the upper screen to show the action in its entirety. The lower screen also has the task of constantly showing us the map of the world, cities and dungeons: while in the PlayStation 2 version the maps had to be found in chests, in this conversion they are automatically unlocked as soon as we enter a new area. And that's not all, because now it is possible to accumulate the skill points earned at each level up, so as to be able to carefully plan the growth of our heroes: in Dragon Quest VIII there are no classes or vocations, in fact, and each character can wield various types of weapons. Depending on the points invested in a certain type of weapon, new skills or spells are unlocked. It is a mechanic perhaps a little less imaginative than those seen in Dragon Quest VII or Dragon Quest IX, but it does its duty and, thanks to the possibility of changing weapons during the fight, allows the player to choose whether to expand the skills of a character or specialize them in the use of a particular weapon. In the light of these changes - and the introduction of a very welcome quick save system - the general difficulty level of the adventure seemed slightly lower than in the original version, but Dragon Quest VIII is still a challenging title capable of surprising the player with particularly aggressive enemies that require the use of every skill or spell available. Considering that now the characters fully recharge their Life Points and Magic Points at each level up, it also becomes easier to ~grind~ experience points and boost the team as needed. In short, fighting is more of a pleasure than a duty, thanks also to the fact that the alchemical pot now immediately mixes the selected ingredients, without forcing the player to go around the map and face enemy after enemy waiting for the result. The 3D effect Not received. The quantity and the quality The technical analysis of Dragon Quest VIII is not very simple. Comparing the new version of the game with the 2006 PlayStation 2, the conclusion is obvious: the old edition is noticeably cleaner, net of a slightly more opaque and darker color palette. The game, today as then, is completely three-dimensional and uses the cel shading technique to return a cartoonish graphic that fits perfectly with the style of Akira Toriyama, the historical character designer of the series who created every character or monster we will come across (in case you haven't noticed, Angelo looks strikingly like Trunks from Dragon Ball Z). At first glance, what is missing compared to the PlayStation 2 version are mainly the black ~outlines~ of the polygonal models: the sharpness of the new images, combined with a fair level of aliasing, dirty the final result a bit which, in any case , it's still great, thanks to excellent fluidity, rock-solid frame-rates and increased color vibrancy. Ironically, the conversion doesn't pay the price of the stereoscopic effect (completely absent) but the fact that the developer Cygames has essentially ported to Nintendo 3DS the version for mobile systems made by the infamous TOSE team a few years ago. In short, if the guys from Level-5 had worked on it, i.e. the creators of the original Dragon Quest VIII, as well as Dragon Quest IX on Nintendo DS, we probably would have found a more authentic conversion in our hands, and perhaps the details of the map of the world such as trees, grass and steccats wouldn't have suddenly appeared through an unsightly pop-up effect like they did in Dragon Quest VII. As we said, it's a complicated technical analysis because the Nintendo 3DS edition of Dragon Quest VIII has undeniable shortcomings, and yet it's a little gem that moves easily and storms the player with scenarios rich in detail and colorful opponents without never miss a beat. And all, obviously, on the notes of the soundtrack of the usual and very good Koichi Sugiyama, the historical composer of the series who once again accompanies us with tunes that ooze adventure with every note.", "date": "2017-01-10", "grade": "9.2"}