{"name": "Demoni", "ref": "https://multiplayer.it/recensioni/178313-shin-megami-tensei-iv-apocalypse-demoni-angeli-e-divinita.html", "text": "Playing something like Shin Megami Tensei IV: Apocalypse takes you back in time. There are many justifying factors, but it is one that deserves mention: the epic-sacrilegious horizon towards which the team's narrative ambition is directed has a nostalgic flavor. It had already happened with the first chapter, it happens again: it's crazy, irreverent, dystopian, merciless. Now we will bother a term familiar to fans of Japanese role-playing, the sick adjective, which paints with great relevance the infinite perversions of demonic - and angelic - darkness fielded by Shin Megami Tensei IV: Apocalypse in an even more incisive measure than on the first episode. It is yet another return to the past, to that 100% turn-based JRPG structure that you either love or hate and that Apocalypse accentuates even more than its predecessor, which we already criticized a little bit for its static nature. A continuous spiral, which starts from the bottom to reach the top, beyond the clouds, forcefully questioning religions, creeds, doctrines, fanaticisms and any other term you may associate with the concept of Faith, of any kind. Who will read this review today is by now the niche of the niche but it is also for this that you deserve the deepest esteem, because it is thanks to you that the medium-low budget JRPG genre still exists and with them all the load of maturity of plots otherwise not feasible in a triple A role-playing game. What about the gameplay side we are still stuck in an atavistic legacy, well, that's another matter. Classic, sometimes obvious yet able to excite with a decidedly interesting plot! Party and elements From a purely playful point of view, the formula is the historical one of the Shin Megami Tensei. Spells, weaknesses, creation and conservation of turn icons, elemental resistances and objects: we are always there and at this point we will always remain. Fortunately? In part yes: the solidity of the combat system is supported precisely on the now refined, perfected but at the same time predictable tradition. Back in the balance, torn in praising the merits and at the same time the predictability of a playful flow that those who chew the genre know to exhaustion, with a substantially unchanged structure compared to Shin Megami Tensei IV, just a couple of new features. The summoner remains fixed with a party of up to three demons at the same time, this time it is the partner who plays a fundamental role. If in the original the frequency and effectiveness of the partner were limited, in Apocalypse the team of supporting actors plays an absolutely fundamental role both within the combat and in the evolution of the plot and the deepening of relationships and dialogues. Is it a major addition? And how: having a fifth supporting actor managed by artificial intelligence who performs his action every end of the turn lowers the need to manage the magic points relating to attack and defense spells necessary to complete the battle and consequently the general difficulty. If we add to this the inclusion of health stations along the dungeons with a cost that is anything but prohibitive, you will understand for yourself that the team has opted for a softer approach. The protagonist's thirst for experience has also been calibrated downwards: fewer points are needed to level up, so expect without too much difficulty to reach the maximum level well before the end of the main story. Yes, but it's already been seen It must be said that if you already have other episodes of the saga on your curriculum, it takes very little to get back on track and progress easily on normal difficulty. The challenge factor, between ourselves, we no longer feel entitled to consider it a defect: Japanese role-playing games have never shone for depth outside of combat - keep the pitchforks down, we're only talking in terms of the facets of gameplay - as everything has almost always resulted in more or less linear exploration, fight against enemies and advancement, so not having to spit blood to endlessly repeat trivial actions is welcome. The fact is that it is now difficult to swallow the rather limited ambition of the more conservative Japanese role-playing tradition. We do not hide behind a finger: after grinding a rather discreet list of JRPGs, what Apocalypse puts on the plate is exactly in line with tradition, therefore immediately assimilable and - consequently - with limited flavor already in the medium term. You could come and tell us that there are many historical sagas that are rooted in tradition and in fact it is the truth; however, this does not justify not being able to evolve the structure even one iota compared to Shin Megami Tensei IV. Solid, well-kept, fast: both gameplay and combat system are still there, statuesqueyou in the past with all its load, for better or for worse, of familiarity. As a demonstration of what has been written, the final dungeon is a perfect emblem: without anticipating anything, we can tell you that the team has opted for a difficult-to-read approach as the last dungeon is incredibly long - we are talking about at least 4 hours carried out in maximum fluency - but always the same in terms of aesthetics, level design and soundtrack. There have been many times in which we have asked ourselves the reason for such an insipid choice, even in contrast with the typical acoustic epicness of the final dungeons of the Shin Megami Tensei. 3D effect Against all odds, the stereoscopic effect of Apocalypse is very, very well done. The parallax helps a lot in the immersion of the scenarios and some are truly of very fine workmanship. Well yes, at the swan song of Nintendo 3DS there are still teams passionate about the 3D effect. Stories of divinities What necessarily holds Apocalypse firmly on its feet is the story. Set almost entirely in Tokyo, the settings you will see will mostly have already been seen, the point of view changes: no longer the Mikado samurai in the center but a new group of hunters. The cast is certainly much more sparkling than the first episode, dialogues and ties help create a more relaxed and less dark atmosphere than SMT, but the plot is the main dish. Apocalypse begins at the end of Shin Megami Tensei IV, and it shows: the climax of the second half is very, very satisfying in how many characters and enemies all take the field to give life to an anomalous narrative parenthesis and therefore of great depth, also seen in relation to the marble legacy of the saga, with non-trivial twists that constantly mix the cards on the table and the evergreen characteristic of multiple endings. You understood it: the second half of the game is superior to the first because it is as if the team had opted for an all-in narrative where the center is no longer the gameplay or the combat system, placed in the background, but the plot, that will flow away without presenting too many obstacles, allowing you to fully enjoy it.", "date": "2017-01-08", "grade": "7.5"}