{"name": "Megaman Battle Network 5: Double Team", "ref": "https://multiplayer.it/recensioni/megaman-battle-network-5-double-team.html", "text": "Try again, Megaman! Set in the near future, the Battle Network series has Lan Hikari as its protagonist, a young man who, like most people, owns a PET, a sort of multi-function handheld computer with which it is possible to connect to the virtual network that connects some ' everything, and which forms a sort of electronic dimension parallel to the real world: this is where the Navis ~live~, i.e. the virtual personifications of PETs. Needless to say, Lan's Navi is Megaman.exe, and it's no ordinary Navi: it's actually the virtual incarnation of Lan's deceased brother, and this connection makes the two heroes a virtually invincible pair of Net Battlers. From the first episode to the fifth many things have changed, and Lan has grown together with Megaman: he has defeated several times the WWW criminal association headed by the evil Dr. Wily, has put an end to the evil plans of the Gospel secret society and has faced and stopped several times also the mysterious and very powerful Bass.exe, earning the esteem of professional Net Battlers like his rival Chaud, master of the Navi Protoman.exe. But for our heroes and their friends there is never peace, and this time the new threat to world security will require the joining forces of multiple groups of heroes: which side to take? All this preamble, in addition to explaining at least a little the philosophy of the series, also serves to clarify the identity of this porting: at the beginning of the adventure you will in fact be asked to choose whether you intend to play the Team Colonel or the Team Protoman version of Megaman Battle Network 5. The two adventures don't change much, apart from the presence of slightly different narrative sequences and abilities and characters present in one or the other version, so in essence it will be like playing the corresponding GBA cartridge. In fact, there are very few additions that exploit the potential of the DS, and all in all Capcom has not made a particular effort to make this new episode more attractive to owners of the new Nintendo handheld: the touch screen, for example, is only marginally exploited, allowing a more fast use of the menus using the stylus on the lower screen, from where a polygonal model of Megaman.exe will look at us smiling during the game. Technically, however, the game has remained almost identical to the counterpart for the GBA, except for an introductory cartoon sequence of decent workmanship and the presence of vocalizations here and there during the game. Graphically Double Team is pleasant but certainly spartan, with modestly sized and fairly animated sprites and an isometric view that reveals detailed but not particularly defined settings. One therefore has the impression of playing an average production for GBA, which in any case reveals greater care, especially visual, compared to the previous four episodes of the series. Bingo? The fifth adventure of Megaman.exe does not differ from the previous ones, and presents the same play structure and the same and by now stale mix of action and strategy: the explorations of the virtual world in the role of Megaman.exe will often be interrupted by the canonical random fights, in which the battle system that made the series popular will come into play. The player will be allowed to choose ~chips~ from a ~deck~, a bit like in a card-game, and these can be used in battle against enemies that move in the right half of the screen: the player will have direct control over Megaman , which can be moved to its left half of the screen, and by pressing a button it will be able to hit the opponents with its cannon while, by pressing yet another button, the chips will be activated. Of the latter there are hundreds different from the most abstruse capabilities: you can steal a portion of the enemy area, throw bombs, slash with virtual swords and more. Some chips will also allow you to ~summon~ Megaman.exe's adventure companions and still other chips will allow the Blue Bomber to merge with his allies and temporarily acquire new powers and abilities. However the selection of the chips bends to a strict set of rules, it will be up to the player to prepare a deck of chips effective in every situation and modify it at will to face the toughest clashes. A novelty in the now obsolete structure of the series is represented by the Liberation Missions: in these phases the player will have both Megaman.exe and his allies at his disposal, facing a sort of strategic chess match against the enemies. However, the Liberation Missions are a very infrequent presence and although they try to break the somewhat monotonous rhythm of the random clashes, the result is not entirely convincing: their slowness makes them mostly boringand, so much to make you want to go back to tackling the random fights ever. In short, it's time to change the music. Comment After the half flop of Megaman Battle Network 4, certainly the worst of the series due to the trivial and not very compelling plot, Capcom has developed a new plot full of twists and surprises, which makes the fifth chapter of the series a must-have for true enthusiasts. The problem is that the play structure is now stale: the changes made to the gameplay are minimal and almost invisible, and however pleasant the series is now in need of a significant update. As the first appearance of Megaman.exe on DS, there is little to say: in reality, it is the port of the Game Boy Advance version, and it is certainly not the higher audio quality and some graphic gems that make the dish more attractive for those who maybe he's already used to polygons and bright colors. Those looking for a varied and pleasant DS RPG will surely find something to enjoy, and fans of the series cannot miss the appointment, but casual gamers who have already played the prequels and who, perhaps, have not appreciated them, stay away : Capcom is back to cloning itself in a big way. Pros Perhaps the best episode of the series Good mix of action and strategy Fairly long-lived Cons Too frequent random encounters Really not very original More could have been done on DS Capcom is certainly famous for its ability to massively ~sequel~ its most famous franchises and, let's face it, it's hardly something to be proud of after a decade of copying and pasting programming codes and inventing new suffixes for the next Megaman , Street Fighter, Resident Evil and so on. But we are always there for each new production, with our wallet in hand and a great desire to start playing, perhaps because there are very few software houses that manage to package these sequels like Capcom so well. The Megaman saga also has a truly intricate story, and its robotic protagonist has been embodied in dozens of games for dozens of platforms, and often leaping from genre to genre: platform, shooter, adventure... Megaman was even a footballer and a racer. But probably one of the most successful series with the Blue Bomber was that of RPG born on Game Boy Advance, which generated comics and cartoons thanks to the excellent and well-deserved success, especially due to the original formula and the excellent style that distinguishes it . From the third episode, then, Capcom began to mimic Pokmon, presenting for each new episode of the series two versions with exclusive playful elements to exchange with friends: this port for Nintendo DS is thus a compilation of the two cartridges corresponding to the fifth chapter of the series , Team Colonel and Team Protoman.", "date": "2006-05-03", "grade": null}