{"name": "Warhammer 40.000: Glory in Death", "ref": "https://multiplayer.it/recensioni/warhammer-40000-glory-in-death.html", "text": "War of attrition Developed by Razorback Developments on behalf of THQ Wireless, Glory in Death is presented as a turn-based strategy set in the futuristic part of the Warhammer universe (precisely made up of the Fantasy variants and the 40,000 present here), scenario of the most classic of fights between the forces of good and evil. So here is that four factions -Space Marine, Chaos Space Marine, Orks and Eldar- fight for supremacy in the galaxy, in a storyline in which there is no shortage of plots: the campaign mode offers in fact about 60 missions divided among the aforementioned armies, each with its beautiful part of the plot narrated through the use of discrete fixed screens. As it is easy to imagine, the single player section is the most substantial of the entire package, and not only for the - however considerable - amount of game stages made available. Warhammer 40,000: Glory in Death is characterized by a truly uncommon playful depth for a portable product, an aspect which, as we will see, will prove to be the cross and delight of the Razorback work. The bulky structure of Glory in Death begins to creak under the weight of its complexity already with the in-game tutorial, substantially unable (certainly the task is not the simplest) to clarify the rules that regulate the gameplay phases. Nothing insurmountable, of course, but this and other aspects highlight the fact that the THQ product is aimed almost exclusively at a sectoral user, made up of experts in the genre or connoisseurs of the Warhammer universe. For all the others, the risk of frustration -or more simply, of boredom- is considerable, also thanks to an interface that is not very user friendly: the menus and on-screen indicators are not exactly eloquent, while the bird's eye view combined the relative smallness of the sprites makes it initially difficult to distinguish the various units. Again, the passages from the map for moving to the combat sequences are marked by loading that is far too long, to the point that it soon becomes necessary to completely eliminate the display of the clashes from the options menu. At least it's not a big loss, given the questionable cosmetic quality of the same... 40,000 years and not feel them Although extremely unskilled in showing its playful characteristics to the fullest, Warhammer 40,000: Glory in Death still manages to establish itself as a well-crafted strategic game for anyone with enough will or patience to stand up to it. The game scheme follows more or less the stylistic features of the genre (movement on the map via reticles, bonus/malus depending on the roughness of the terrain, precision of fire inversely proportional to the distance and so on), while offering a huge amount of variables more than similar titles. In particular, the variety of types of troops made available to the various armies is excellent, as well as the cooperation capabilities between them (vehicles can transport soldiers, two teams can join together for greater destructive power, etc.), without forgetting the profound differences that they distinguish the four armies, each with clearly visible strengths and weaknesses. If we combine all this with the more than decent variety of missions and the remarkable artificial intelligence of the enemies, it's easy to understand how Glory in Death would have been a truly top-notch product if it weren't for the serious ~barriers to entry~ it erects towards of the less accustomed. The Razorback title is in fact as - often unnecessarily - complex as it is rich in content: an interesting editor must be added to the single player campaign through which it is possible to build your own army piece by piece and a section for two players via the classic Bluetooth or the hot seats. In short, really a lot of irons in the fire, supported by a cosmetic realization up to par, with graphics capable of carrying out their task without great acuteness or lowness and a monotonous but in any case sufficient sound sector. Comment Warhammer 40,000: Glory in Death is a turn-based strategy game that is certainly complex and profound, but which, precisely because of these characteristics, ultimately proves to be decidedly less accessible and fun than similar products from the Nokia soft library. The Razorback title would have needed considerable streamlining both in the playful structure (sometimes too cumbersome and full of variables) and in the technical sector, annoyingly anti-functional in various respects. What is certain is that anyone looking for a hardcore strategic product faithful to the board game will find bread for their teeth in Glory in Death. Pro Definitely deep and complex Technical realization up to par Good hereQuantity of content Cons Prohibitive for beginners Very slow pace of play Questionable design choices Given its sensitive propensity for strategic titles, the Nokia portable platform certainly could not fail to host a Warhammer product, the historic franchise of the giant Games Workshop, originally born as a board game and then developed -among other things- into a videogame series . Now let's see whether or not this Warhammer 40,000: Glory in Death is able to keep up the heavy name it bears ...", "date": "2006-05-03", "grade": null}