{"name": "A rotta di colli", "ref": "https://multiplayer.it/recensioni/177968-hill-climb-racing-2-a-rotta-di-colli.html", "text": "Released in 2012, Hill Climb Racing was a good debut for the Finnish Fingersoft team: despite a very poor technical component, the game was able to establish itself thanks to its well-calibrated gameplay even if far from original, being part of that large group of racing games physics-based that are inspired by Trials. Since then, a lot of water has passed under the bridge, and similar products have followed one another on the App Store and Google Play at a rapid pace, not infrequently showcasing good qualities such as the recent MMX Hill Climb: let's see, therefore, if this sequel has the numbers to be able to carve out its own space in the midst of so much competition. Hill Climb Racing 2 improves on the prequel in every respect and is a very valid exponent of the genre Bounce car As it is easy to imagine, Hill Climb Racing 2 does not bring great revolutions to a game formula that is now known even to the stones and which as usual requires the user to control a car on two-dimensional paths full of roughness to be tackled by dosing accelerator and brake , also indispensable for managing the rotation of the vehicle in mid-air. It must be said that the Finnish developers have carried out the task perfectly, especially as regards the application of the physical routines and the precision and reactivity of the control system: the vehicles react to the stresses in an obviously exaggerated but coherent way, putting the user in a position to act accordingly on the two virtual keys suitably represented by two pedals, which respond promptly to the inputs. Compared to the first episode, then, Hill Climb Racing 2 presents a technical realization finally worthy of the name, which relies on lively cartoon-style graphics with great attention to detail and on a sound accompaniment suitable for the purpose. Fingersoft has therefore been able to create a sequel with all the trappings, but it was also smart enough to equip its product with features that would help it emerge in the real chaos of similar titles. To begin with, Hill Climb Racing 2 boasts some respectable content: there is an adventure mode that offers four scenarios to be tackled in an endless run style, a cups section that allows you to compete in 11 different competitions divided into several races each and even a part intended for daily and weekly challenges in which to compete in the company of a group of friends. Although the gameplay is anything but innovative, Hill Climb Racing 2 interprets it in an optimal way: the various courses are littered with coins to collect, the stunts performed earn extra points at the end of the round and the three opponents you are confronted against are the avatars of real-life players randomly picked from around the world. Even the customization department has some arrows in its bow, allowing the player to invest the money earned to distribute improvements among the four different parameters (engine, estate, suspension and 4wd) and to modify the look of the driver and the car by choosing between unlocked items. All this unfolds through a well-studied progression model, capable of giving out prizes constantly, thus stimulating the user to continue playing without the repetition of the same events ending up becoming a big problem. Even the age-old question of free to play has been virtuously resolved by the developers of Fingersoft: although there is a dual currency system with relative in-app purchases, the title can be enjoyed without needing to spend money, by watching some advertisements in more and taking into account having to spend a little more time to conquer the most coveted achievements and power-ups.", "date": "2016-12-23", "grade": "8.3"}