{"name": "Per lo Shogun!", "ref": "https://multiplayer.it/recensioni/177740-shadow-tactics-blades-of-the-shogun-per-lo-shogun.html", "text": "It often happens that some genres and sub-genres disappear from the radar for some time, to then forcefully return to the limelight thanks to some highly valuable titles that manage to get general attention. For example, Shadow Tactics: Blades of the Shogun marked the return of the Commandos gameplay, i.e. that strategy declined towards the puzzle/stealth game partly born in the 80s with Airborne Ranger, then codified by Syndicate and made famous by the aforementioned trilogy from the late Pyro Studios. In reality, something similar had also come out in recent years. Valid for all Satellite Reign, considered the spiritual heir of the Bullfrog dilogy, despite the many touches of modernity. The title of the unknown Mimimi Productions, who had already delighted us with the good The Last Tinker: City of Colors, however, does something different: it follows the stylistic features of the genre, disregarding any form of mediation with the modern gamer. It's a radical but functional choice these days: why compromise when it's clear that the average user won't even glance at your work? In short: what's the use of displeasing those who will buy the game to try to satisfy those who won't buy it? There was a ninja, a samurai and The answers to the questions posed at the end of the previous paragraph can be found in the refined mechanics of Shadow Tactics: Blades of the Shogun, explained in the first of the thirteen maps that make up the game's campaign. Incredibly we are faced with a tutorial that does not infect the player, but which has been built with an excellent pedagogical logic: the map is divided into micro areas, each of which introduces a new mechanic to be used to overcome it. Sure, there are very short parchments to read, but you act immediately and directly, without some higher entity blocking the game every three seconds to explain what to do. In the first level we also meet three of the five characters that we will control for the rest of the adventure: Hayato, a ninja highly skilled in the arts of stealth; Mugen, a samurai capable of eliminating anyone with a single swing of his sword; and Takuma, a very skilled sniper who can kill even from tens of meters away. The two missing characters, orphan Yuki, who specializes in setting traps, and Aiko, master of disguise, are introduced in later missions, cleverly centered around them, so that the player can practice their skills. After all, Shadow Tactics: Blades of the Shogun really requires you to learn to read a situation and decide how to act to overcome it, evaluating the resources available. To fail means to lose (the death of a character is enough to fail) or to complicate life enormously due to the reinforcements called by our opponents. We reviewed Shadow Tactics: Blades of the Shogun, the true heir to the Commandos series Some examples But let's take a direct example of gameplay: there are two guards in front of a door, with a third guard patrolling. How to act? We use Mugen to eliminate the two motionless guards, distracting the third with a stone thrown by Hayato, then grabbing the corpses to throw them in the nearby bushes, so as to hide what we have done; or do we wait until they are all in the same area and let Mugen act with his special technique that allows him to eliminate entire groups of enemies in a flash? It should be noted that in the first case, the surviving guard would notice the absence of his two colleagues and would begin to search the area for traces. Remarkable, right? How many stealth games predict such a reaction from artificial intelligence? Another example of a possible situation that can be solved in several ways: there is a guard on patrol around a load: do we kill him by dropping a boulder on his head or, after having studied his path, do we set a trap for Yuki? Observation, reflection and action. All this would not work if the interface of the game hadn't been studied in an impeccable way (the flaws of the camera are discussed in a separate paragraph), in order to manage the characters alone or in groups without problems. In the second case it is very convenient to take advantage of the so-called Shadow mode, which allows you to give orders and then have them executed in due time in sync. What can it be used for? Well, let's make a typical case: we have to eliminate two guards facing each other starting from two different points, but we have to do it at the same time so that one does not see the murder of the other by setting off the alarm (every enemy has its own vision cone, viewable by clicking on it). How to move? We placetwo characters behind them, perhaps crouched in some bush so as to be invisible, then we select the Shadow mode and set the actions to be performed. When we're ready, we kick it off and that's it - dead guards and no alarm. However, a lot of freedom does not mean that Shadow Tactics: Blades of the Shogun is an easy title. Indeed, it is really very difficult, in some situations really punitive, to the point of advising you to evaluate the purchase only if you are prepared for the worst and have the necessary patience to juggle the genre. This translates into missions that can last many hours and that can be replayed several times to try alternative solutions, to experiment with higher difficulty levels or to obtain better scores (medals are awarded at the end of each map based on the results achieved , such as not killing some civilians, or not using bushes). Overall, the game takes more than twenty hours to complete, which is not bad at all, especially since these are hours spent with great quality gameplay. Some problems Unfortunately, Shadow Tactics: Blades of the Shogun has some flaws. The most obvious and annoying is the handling of the camera and the confusion it creates in some situations. Now, Mimimi's game is fully 3D, with the map being able to be rotated or zoomed. Doing so is essential to discover elements of the scenario covered by the standard (however always recallable) shot, which can be useful in various ways. For example, in some cases the presence of a certain path is understood only after having rotated the map. This, taken on its own isn't a big deal, despite the readability annoyance. More serious is the fact that in some cases the interactive elements overlap, leading to gross errors. For example, we might just want to make a character walk from one bush to another and instead find them jumping off a ledge. From a technical point of view Shadow Tactics: Blades of the Shogun is a decent title. The overhead shot helps mask some 3D model issues, which are more noticeable when zoomed in a lot. Nothing tragic, given the genre, but it should still be noted. In general, technically we are dealing with an average production, that is capable of doing its thing and nothing more. Maybe something could have been risked from a stylistic point of view, instead of pursuing a realism of manner. Some dialogues are less convincing, not very suitable for Japan at the beginning of the 1600s, the years in which the game is set. Americanisms are sometimes too obvious and annoying. The story itself has a decent plot (it tells of the seizure of power by a Shogun who wants to bring peace to the archipelago), but the overall writing is poor. On the other hand, the soundtrack is good, with well-chosen songs, even if they have already been heard.", "date": "2016-12-16", "grade": "8.7"}