{"name": "Cavallo goloso", "ref": "https://multiplayer.it/recensioni/177702-my-horse-prince-cavallo-goloso.html", "text": "An action sequence. You will spend a lot of minutes there Usaya is a Japanese development team specializing in crazy titles for mobile systems. However, until My Horse Prince, nothing of them had ever arrived translated into a language understandable even to us Westerners. Let's face it right away: their production is completely over the top. Just to say, it includes a title starring a cat who gets shot from one hollow tree trunk to another (and up to here) to catch a bird, or another starring a school-age girl who has to climb gigantic white radishes while avoiding their hairs. However, My Horse Prince is their absolute masterpiece, the title capable of revolutionizing the mobile world... No, really not. At most it can yield you some erotic nightmare. It's a free-to-play dating simulator starring Umako, a friendly and attractive city girl who moves to the countryside to look for the man of her dreams. We know that the more relaxed rhythms of the outdoors can do wonders for love. The problem is that in the countryside he finds no man, but a horse with a man's face. No, we are not talking about an anthropomorphic creature like Bojack Horseman or any centaur, but a real equine, only with a face that seems to come out of a shojo manga. The explanation as to why she sees it this way is given in a cursory way and is never in depth throughout the game, but consider that the entire narrative has highly surreal tones and is based on absurd situations, so there is little that wonder or tear his clothes, unless you consider more likely a horse frontman of a rock band or surfing champion. However Yuuma, this is the name of the horse, falls madly in love with her, who slowly begins to reciprocate, also becoming her mistress. At a gallop Ever seen a horse with a man's face surfing? All this is told in the most classic visual novel form, i.e. through a series of dialogues between the characters, in truth not very long (forget about spending hours reading as happens in a Grisaia or a Clannad). The chapters are all composed in the same way: they open with a theatrical scene in which the theme is anticipated, they continue with a dialogue sequence, then we move on to the real action, which ends with an artwork and another dialogue. The drawings are very beautiful, in pure anime style (not very original, let's face it), even if the horse itself is decidedly grotesque, especially when it behaves in a romantic way with Umako. Probably this was the desired effect, but this does not dampen the concern. Restlessness that is strengthened by the aforementioned action scenes, which are the core of the gameplay. In each chapter Yuuma has to perform a single task: for example eating carrots, or beating up a bully who threatens Umako, or still training; repeating it many times to accumulate points, so as to fill the affinity bar with the girl at the top of the screen. Performing actions is very easy: icons appear on the screen that you have to touch. That's all? Yes. The problem is that each action consumes part of Yuuma's energy and when tired, he scores fewer points. There are basically two ways to make him recover energy: have Umako answer his questions trying to guess the right answer among the three available, or brush him for hours (literally). And here My Horse Prince expresses all its weaknesses, due in large part to its free-to-play nature. My Horse Prince is about a girl who falls in love with a horse with a human faceReally! Of penises and microtransactions No comment In each chapter Yuuma can only ask a handful of questions to Umako, who in case of an error can try again by starting a commercial (once you have learned them all by heart you are unlikely to be wrong again). The tragedy is that often the answers are arbitrary and make no sense. For example, in the chapter set on the beach, Yuuma asks Umako what she would take with her to a deserted island. The correct answer is ~a pillow~. The reason? Because in this way he will have nothing to defend himself with and he will have to take care of it (romantic). Of course, until the answer has been given, it is not possible to understand why it is the right one. In some cases it can be guessed, but in others it is not. The system is obviously designed to let us see some commercials. The slow accumulation of affinity points is also functional to in-game purchases. There are two ways to speed up the process, both to be paid for with real money: a horseshoe that doubles the points obtained from actions forever and golden carrots that create a state of frenzy in the horse with related bonuses. Golden carrots are conshumable and, once exhausted, must be repurchased. In short, the action phases of My Horse Prince are deliberately long, tedious and repetitive; and the jokes with which the characters occasionally comment on the situation don't help much. The most disturbing element of the game, however, is another. Yuuma is a horse, but he's not animated like a horse. The movements of the neck are more reminiscent of those of a penis. The sensation is reinforced by the fact that the human face placed in that position resembles a glans. It has hair and a mouth, but always a glans is. The double meaning is not only the birth of our sick mind, but a precise choice of the developers, who have created unnatural animations precisely to underline this anatomical assonance. Then, thinking about the rest of their production, the fact that there is a double meaning does not surprise us too much.", "date": "2016-12-16", "grade": "6.0"}