{"name": "Attenti al lupo!", "ref": "https://multiplayer.it/recensioni/177732-werewolves-within-attenti-al-lupo.html", "text": "The advent of virtual reality has so far allowed us to live different types of experiences, while developers try to figure out what could be the best way to make the most of this technology. In a few months we have flown like eagles in Eagle Flight, explored unknown worlds in Robinson: The Journey and fought inside the mechs of Rigs, up to the point of reaching a more human dimension, to sit around a fire and talk to other people. Reduced to the minimum terms, this is in fact what we find ourselves doing in Werewolves Within, an adaptation for virtual reality of the Mafia board game, spotted for the first time in the 80s to then obtain a moderate success all over the world and a nice number of variations. Just one of the latter is at the center of the effort of Red Storm Entertainment, which with Werewolves Within manages to demonstrate how the dreaded virtual reality alienation can actually become a splendid means of undertaking social relationships and possibly making new friends. Don't believe it? Read on! Werewolves Within proves that virtual reality doesn't have to take us to extreme situations She doesn't know who I am ~I suspect one of the werewolves is Helluzzo, so far he's been too quiet without saying a word~, ~Don't judge me just because I'm a quiet person, I already told you I'm a simple villager~, ~I think I'm telling the truth , before playing he said it was his first game.~ The exchange that saw us personally involved during our debut on the Werewolves Within servers perfectly sums up the dynamics of this game, in which all players are called to sit on a series of stools arranged in a circle in the imaginary village of Gallowston. At the beginning of the game everyone gets a role, based on which to set their own behavior: in the case of the inhabitants it is a question of unmasking the werewolves, while for the latter the goal is to make someone else suspect so as to get away with it and win the game. Each game session takes place with a minimum of six and a maximum of eight players overall, and lasts just five minutes: the time to discuss who is what all together, and then proceed with a voting phase at the end of which they are eliminated one or more members of the group. To complicate things a bit, the roles are not clearly distinguished only between werewolves and villagers, since among the latter it is possible to find several subcategories. There is, for example, the Saint, a person who possesses the ability to establish exactly who a werewolf is, but being careful not to be eliminated because this would mean putting victory in the hands of the wolves. Or there is the Disturbed, a somewhat mythomaniac subject whose aim is to get voted on purpose, thus obtaining the elimination to be able to win the game in spite of all the others. Then there are other figures with particular powers, which tell us for example which side of the table there are werewolves on, or which roles are not part of the current game. Information to be shared with the same attention with which it is used, because in such a situation there will surely be someone who lies to pull grist to their mill. Werewolves Within is therefore a game of cat and mouse, in which dialectic is a central element and forces the player to interact as directly as possible with everyone else. In case the rules scare you, fear not: Werewolves Within presents a good series of video tutorials with which to delve into the rules and roles, although we assure you that after two-three games you will already have entered the mechanism to unleash all the fun that this title has to offer. Playstation 4 trophies Werewolves Within features a total of fifteen Trophies, divided between four of the silver type and eleven of the bronze type. Many of them are dedicated to achieving certain objectives in the various roles available in the game, for example eliminating the Saint as a werewolf or winning by getting the votes of others as the Disturbed. Overcome shyness Thinking of playing Werewolves Within without using the microphone is practically impossible, and in fact those who cannot or do not want to speak end up being inexorably kicked out of the game. More introverted people can therefore encounter a small barrier to entry, which can however be overcome after a few warm-up matches. Likewise, the more sensitive subjects could harbor a little resentment at being accused of telling lies: the important thing is to understandthat it's all part of the game, and that behind Werewolves Within is a community of players rarely seen online. Forget the insults of League of Legends, Overwatch or other titles in which there is who wins and who loses, because whoever wears the headset to enter Gallowston does so in the most relaxed way possible. After playing several games we can say that we have only once found a person who tried to ruin the session in progress, immediately revealing his identity as a werewolf and continuing to annoy others; in reality, thanks to the intertwining of lies and suspicions that characterizes Werewolves Within, the game was still fun. The beauty of the Red Storm title is precisely this: you connect together with the others and enter your role, in some cases even not caring about what the final outcome of the match is, so much fun. From a technical point of view Werewolves Within perfectly follows the movements of the player's head, allowing him to look another avatar in the eye when talking to him, but also to try to launch some signal destined to remain secret. As we speak, our character moves his mouth and gestures as if we were around the fire in first person, giving us the opportunity to emphasize some sentences with the use of a series of emoticons that can be activated with the directional cross on the pad. A greater level of involvement could probably have been achieved by also tracking the movements of PlayStation Move, although we must say that after starting the dance it takes very little to feel like a Gallowston character in all respects. Speaking of the medieval village, the developers have done a good job of creating different settings for the meeting to take place in, thus preventing players from feeling they are always in the same place. Surrounded by houses or on top of a tower, in reality it changes little: the essence of Werewolves Within is made up of interaction with others, of words and jokes which, thanks to the short duration of the game, will take you into the classic whirlwind of ~ another and then I stop~ until 4 in the morning. Finally, we point out some technical defects, from matchmaking that is sometimes a little slow to an annoying bug that causes a player to connect to the game without being able to speak. Speaking of matchmaking, inserting a few minigames while waiting could probably have helped to bear it better. PC and PlayStation 4 gamers can meet. Mind the tongue! The first attempts to play Werewolves Within in Italian saw us fail miserably, given the small number of people who own the game in our area. In order to be able to write this review, we corrected this problem by setting the menu and matchmaking language to English, thus finding other Gallowstonians abroad to play with. As far as we're concerned, we see it as an excellent way to train your use of the English language, but when considering the purchase of the game, the possible language barrier is an aspect that must be taken into account. However, we point out that the community entitled Werewolves Within Italy was born on the PlayStation platform, where about thirty people gathered to organize games of this game in our language.", "date": "2016-12-16", "grade": "8.7"}