{"name": "La resa dei conti", "ref": "https://multiplayer.it/recensioni/177623-batman-the-telltale-series-episode-5-city-of-light-la-resa-dei-conti.html", "text": "What you are reading is the review of the fifth and final episode of Batman: The Telltale Series, entitled City of Light. Its purchase can only be made together with the rest of the series, at a price of 22.99 euros. The text contains some plot spoilers. Realm of Shadows, Children of Arkham, New World Order and Guardian of Gotham. These are the names of the four episodes of Batman: The Telltale Series that preceded City of Light, the fifth and final chapter that arrived just in time for the Christmas holidays. A ride that began last August, to immerse ourselves month after month in the story with which the team specializing in adventures reviewed the past of Bruce Wayne and his family under their own lens, shaking it to the foundations with a series of original ideas. Ideas that, as evidenced by the reviews of the various episodes, we have mostly had the opportunity to appreciate, keeping us on tenterhooks to find out what the epilogue of the story that involved some of the most well-known faces of Gotham City would have been. City of Light, needless to say, picks up where we left off in the previous episode, namely with Harvey Dent definitively neutralized after a tough fight, but also with Batman cornered by the Penguin's operations. The former friend is actually only the minor problem, because the band of Children of Arkham led by Lady Arkham continues to plot a surprise heist intended to permanently lower the city of Gotham into the abyss of madness. As we hoped, this last chapter immediately takes us into the middle of the action: in fact, we find Batman engaged in rescuing some hostages in a trap set by the Penguin, the first of the enemies listed above destined to deal with the return of the Dark Knight. A series of events supported by a good pace, interrupted only by some points out of context such as the part concerning Catwoman, leads us to the inevitable showdown with Lady Arkham. In addition to giving Bruce Wayne the opportunity to ask forgiveness for the crimes committed by his family, relying on the player's empathy towards him and poor Alfred, City of Light does not forget the so-called villains, focusing in particular on the figure by Lady Arkham. Of the woman, whose identity has already been revealed to us previously, we are shown the path that led her to feed her mad desire for revenge against the Waynes and the whole of Gotham. From the point of view of the plot, everything ends without particular twists, resulting as we said appreciable to the end, when the time comes to know who will be the villain of Season 2 that at this point we can take for granted. In terms of duration, although it is the epilogue we are in line with the hour and a half of the previous episodes. Bruce Wayne saves goat and cabbage in City of Light, the final episode of Batman: The Telltale Series Everything as always Considering the conservative line adopted by Telltale Games for its series dedicated to Batman, in terms of gameplay we did not expect any particular change from City of Light. And in fact in its dynamics the last chapter does not differ from the previous ones at all, presenting once again an alternation between the phases in which the roles of Bruce Wayne and those of Batman are dressed. If the choice to give the human side of the Dark Knight its central space proved to be right from the start, in the specific case of City of Light we can say that there is less distinction than in the past between the dialogue-oriented sequences and those devoted to the action based on quick time events, involving Bruce more in the latter. Both in the guise of Wayne and in those of Batman we continue to access the detective mode, thanks to which the protagonist manages to reconstruct what happened in a certain place. If you have read the reviews of the previous episodes you will know that this is the aspect that went the least down ever, as the minigame presents itself with elementary puzzles that lead the player to simply connect two dots representing as many clues on the screen. In our opinion, it remains an opportunity that was badly exploited, because it would have taken little to make Batman: The Telltale Series bring that breath of fresh air into the Telltale playground that many fans continue to ask for. At this point, therefore, we confirm that we will have to wait for the third season of The Walking Dead to see if there will finally be any news in this sense. Even for the technical sector what was said in the past continues to apply: on the Xbox One version in our possession the number of frames per second has stammered fearfully on several occasions, fortunately especially at the start of the episodeto then stabilize over time. The rhythm of some action scenes, however, comes out heavily damaged, with cuts to the animations and busted management of the quick time events. Both the dubbing (English only, we remember) and the drawing are good as always. The dark cut of the latter fits perfectly with the figure of Batman, probably resulting in one of the most inspired of the entire videogame production by Telltale Games.", "date": "2016-12-15", "grade": "7.5"}