{"name": "Evoluzione francese", "ref": "https://multiplayer.it/recensioni/177425-euro-truck-simulator-2-vive-la-france-evoluzione-francese.html", "text": "With over three million copies placed on the market, the excellent Euro Truck Simulator 2 by SCS Software has turned from a niche product into a real commercial success, which continues to capture new fans especially during the Steam sales, or when players are willing to ~bet~ even on works that are not exactly in line with their tastes or interests. After all, a truck simulator associated with a (simple) management system dedicated to the world of road transport is not exactly the genre most coveted by the general public; nevertheless, thanks to the enormous passion lavished by the Czech developers, the work managed to conquer its space, triggering a virtuous circle which translated into constant updates, a sensitive process of evolution/maturation of the code and the release of quality expansions. After the interesting Going East! (2013) dedicated to the countries of Eastern Europe and the exceptional Scandinavia, launched about a year and a half ago and capable of giving an important improvement to the technical component of the title, at the end of 2016 it is the turn of Vive la France!, which as the name suggests, it introduces all the charm and variety of transalpine settings. Although France was already present in the base map with some metropolises, such as Paris and Lyon, the new expansion embraces almost the entire French territory, from the Cte d'Azur to Normandy, including a whole series of very interesting innovations that we analyzed during our test. Fasten your seatbelts, because it's time to hit the road again with our multi-ton beasts. Twenty thousand kilometers of roads, 15 cities and all the transalpine charm in the Vive la France expansion! Asphalt tongues When it comes to Euro Truck Simulator 2 the numbers at stake are always impressive, and the Vive la France! is certainly no exception; in fact, there are twenty thousand - you read correctly - the kilometers of French roads and motorways added to the map, the total dimensions of which make any other driving and non-driving title pale. The road network, as always inspired by the real one and therefore able to replicate the specific features of the most characteristic infrastructures and intersections, is accompanied by fifteen new cities, selected from among the best known and most fascinating. These include Nice on the Cte d'Azur, Bordeaux in Aquitaine, the port city of Brest in Brittany, Nantes and Le Mans in the Pays de la Loire, Le Havre in Normandy, Marseille, Montpellier, Toulouse and so on. We are therefore faced with an exhaustive cross-section of the main urban complexes across the Alps, sometimes set in fascinating natural landscapes which for the occasion are also shored up by typical rural villages and villages. Those who know the title well, however, will not be able to escape the small step backwards made with respect to the Scandinavia expansion (or the more recent American Truck Simulator) in the complexity of the settlements, dominated by the industrial context and sometimes limited to a handful of crossroads, where it is possible to see the most famous monuments and buildings. In Nice, for example, forget about being able to admire the fascinating promenade des Anglais (promenade of the English), the promenade that runs along the Bay of Angels tragically leapt to the headlines. Although known for its blue sea, the Nice of Euro Truck Simulator 2 is totally devoid of it, having been reproduced only a portion of the hinterland dominated by the majestic football stadium. Fortunately the houses and the vegetation, characterized by tall palm trees, exactly resemble those of the sunny town nestled in the Maritime Alps. What really matters, however, is the variety of roads to travel, and if for example you know the stretch that takes you from Liguria to Montecarlo, you will find the same landscapes (excluding the coast), where bridges and tunnels alternate in a fascinating scenario mountainous and wooded. In this regard, we also point out the same - and almost asphyxiating - distribution of toll booths for paying tolls; fortunately in Vive la France! the transalpine Telepass has been made accessible, and it is therefore sufficient to pass through the dedicated lanes to pay ~on the fly~ without having to stop, an option that is still available. Of the various cities we explored, we particularly liked Le Havre and Nantes; the first, in addition to offering a truly immense port, can be reached from the south by passing on the magnificent - and splendidly replicated - Normandy bridge, which stands over the Seine at a height of about sixty meters, while the second amazes for the presence of the Loire in the urban fabric; it is no coincidence that Nantes has been nicknamed ~la Venice de l'Oust~ (the Venice of the West) for the many canals thatand they go through it. Although to our liking, the French friends did not appreciate the rendering of the famous ~pont de Chevir~, considered too little majestic compared to the real counterpart, and a similar argument can be made for the city of Rennes, considered by some to be a little anonymous . Net of these shortcomings, which can be recognized mainly by those who know the places, we are in any case before a work of impressive scale whose ~spots~ do not affect the enjoyment of the experience. Special deliveries The playful core of Euro Truck Simulator 2 naturally lies in the transport of goods, and with the new French setting new loads and suppliers have been introduced freely inspired by real brands. If brands aping companies like Ikea and Wallmart were added in Scandinavia and American Truck Simulator, in Vive la France! we find for example the well-known chain of supermarkets and hypermarkets Carrefour, with its plethora of establishments and ad hoc branded trailers. Among the new industries, the most interesting are certainly the five nuclear power plants, whose enormous complexes are faithfully replicated. However, the most interesting elements are the small villages, the villages and the narrow streets immersed in the various natural contexts; in addition to presenting specific graphic details for walls, tunnels, guardrails, signs and other characteristic infrastructures, they offer such an accurate urban planning and design as to make the sparse settlements present in the base map of Euro Truck Simulator 2 obsolete. The vegetation, with some passages surrounded by greenery (from forests to cultivated fields) really suggestive, above all thanks to the delightful lighting effects, one of the strengths of the SCS Software engine which is enhanced by the day-night cycle and the dynamic weather. Overall, therefore, it is a high-quality expansion, which can be further enhanced by the contents produced by the very active modder community. After Vive la France!, which left out Corsica and the southernmost portion of France (the Pyrenean one), we hope that SCS Software will finally put in the pipeline the most desired expansion, that is the one that embraces the Iberian peninsula and above all ours Italy, only touched upon in the base map of Euro Truck Simulator 2 and present with only three cities, Milan, Turin and Verona.", "date": "2016-12-13", "grade": null}