{"name": "Calcio da fermo", "ref": "https://multiplayer.it/recensioni/177442-stick-soccer-2-calcio-da-fermo.html", "text": "Games like Stick Soccer 2 have practically existed since the dawn of gaming on modern touch devices: those who owned the first smartphones will almost certainly remember titles like Flick Kick Football, which required the user to send a ball on goal by simulating a kick with a swipe of your finger across the screen. A formula that evidently hasn't known a crisis yet, given how it has been re-proposed over and over again over the years, and which forms the foundations of this Stick Soccer 2 with the addition of a slightly more elaborate progression model and with the inevitable dynamics typical of free to play. Stick Soccer 2 works as a pleasant pastime, but it's hard to ask for more Goleada forever It is evident from the outset that Stick Soccer 2 has no realistic or simulation ambitions: the user begins by creating his own team by choosing its name, crest and club colors, and then leaves for a world tour that will see him face five different challenges for each country . The first three scenarios of each stage act practically as an appetizer, not only because they are set in a training field but above all because they are the means by which it is possible to earn the goal balls available during the actual matches. In essence, it is necessary to swipe to send the ball into the net as many times as possible to accumulate points, obtaining a maximum of three balls as an evaluation which are equivalent to as many opportunities to score in subsequent matches. In these phases, Stick Soccer 2 shows a good inventiveness and a good ability to shuffle the cards, given that each of these training levels has some differences compared to the previous one: as you continue, in addition to the goal you find yourself in front plastic shapes, billboards, wooden crates and so on, all elements which, moreover, have a playful and not just a scenographic role. In fact, the best scores are obtained by performing combos during a single shot, hitting one or more obstacles before making the ball carom to the back of the net. Stuff for real virtuosos of swiping, who will be able to compare themselves with other players in the context of special online rankings. The last two stages of each stage instead take place in a stadium and in this context the player must take advantage of the goals earned previously, trying to score as much as possible through set pieces proposed randomly as regards the serving position and the disposition of the opponents on the barrier. What should be the lion's share of Stick Soccer 2 actually turns out to be its weakest component, with goalkeepers who never really take it and situations that inevitably become repetitive in a short time. To aggravate the situation, a technical department intervenes that leaves enough to be desired, with decidedly basic graphics, a sound reduced to a minimum and above all a control system that does not give the feeling of always being as precise as it should. Having said that, it is difficult if not impossible to dislike Stick Soccer 2, first of all for the evidently light-hearted attitude of the production (it is no coincidence that the ballets that the players perform to celebrate are one of the best parts ever) and even more so for the efforts made by the developers in providing a little more construct to a playful structure with such narrow premises. The points accumulated during the various events can therefore be spent to purchase card packs which may contain score multipliers to be used at will, customization elements for one's own team and stickers of really existing players to be collected in a special album and which allow to increase the prestige of the team. Finally, credit must be given to the product for not going too heavy with the free to play dynamics: the only real bottleneck is represented by the waiting times for the passage from one stage to another, which can reach up to a maximum of six hours (established by a special roulette) and which can be reset by spending credits that can be purchased with real money.", "date": "2016-12-09", "grade": "7.0"}