{"name": "Il ritorno di Frank", "ref": "https://multiplayer.it/recensioni/177271-dead-rising-4-il-ritorno-di-frank.html", "text": "With what we believe to be a quieter launch than other titles, comes a new Xbox-branded game from the work of Capcom Vancouver. We are talking about Dead Rising 4, which will be available exclusively on Xbox consoles for a year, while the PC version will remain exclusive on the Windows Store for 90 days only, after which the development team will have the opportunity to publish the product on other platforms (Steam , GoG and so on). Before starting to talk about the new chapter, it seems appropriate to make a couple of notes on what was Dead Rising 3, its predecessor, a ~new~ game with a very specific purpose: to demonstrate the capabilities of Xbox One as a launch and involve many new players bringing them closer to the franchise. In practice, Dead Rising 3 carried the ~weight~ of having to guarantee an experience within everyone's reach and at the same time amaze with the enormous amount of zombies on the screen. Despite the extravagance of the weapons and the various bizarre situations in which the player was catapulted, the story introduced a new character and a more ~serious~ approach was attempted with it. Undoubtedly the title succeeded in bringing a breath of fresh air, resulting in extremely fun to play thanks to its vast arsenal of weapons and vehicles on which the player could rely. Dead Rising 4 starts right from the foundations of the third chapter, taking up the foundations that have guaranteed it some success, however trying to add some innovations, unfortunately, introduced not in the best way. Dead Rising 4 mixes new elements already seen ... but not everything works as hoped! Pieces of Zombies! In this new chapter we see the return of the original protagonist of the saga, the very nice Frank West, a reporter on the hunt for the perfect scoop to create the greatest story ever told and, trivially, sell it by making a lot of money to then enjoy his life during the apocalypse. Between hilarious gags and antagonists of dubious sanity, the protagonist will have to investigate the Obscuris, a military body involved with the origin of the zombie epidemic and its recent evolution. Zombitude, as Frank calls it, has in fact evolved by creating new types of Zombies, significantly speeding up the transformation times. The campaign in general consists of only 6 chapters, which can be completed in a few hours of play, characterized by a narrative component that is saved simply by the protagonist's sympathy and ~charisma~. As a side dish to the narrative, the various collectibles scattered throughout the game including mobile phones, newspapers and audiologs, will allow the player to delve into the events of the game's history. During our adventure, we will rely on our Reflex camera equipped with special filters including night vision and spectrum analyzer to find the clues that will help us solve the various cases. Splatter phases where we will slaughter hordes of zombies alternate with investigative phases in which the player is asked to photograph some key elements to progress with the story. Frank's reflex therefore becomes an inseparable companion that we will have to use to analyze the surrounding environment in order to carry out missions or find secrets using the spectrum analyzer. Nice addition of the Selfie function that allows the player to take fun souvenir photos with Frank's beautiful face in evidence of which we can also change the facial expression. Another novelty introduced in this chapter is the presence of stealth sessions, which however remain absolutely inconclusive as they are not developed in a concrete way and are limited to very simple stealth killings. As a consequence, given the nature of the title, it is highly unlikely that the player will end up preferring the stealthy approach to the chaos that can be generated with any of Frank's extravagant weapons. Both the investigative sessions and the stealth ones are poorly integrated with the madness of Dead Rising 4, the former drastically slow down the pace of the game, making us wander for several minutes in the same room looking for clues, the latter however do not guarantee the player any real advantage , or prize, thus resulting superfluous. But not all the news clashes, the new Capcom title, in fact, also introduces a mighty exoskeleton into the saga which greatly enhances our skills allowing us, among other things, to wield heavy weapons such as broadswords or rotating machine guns or even modify and enhance the armor with various objects found in the map that will make us a real living weapon of mass destruction. Using the exoskeleton is truly sublime but sadly, like all things beautifuland, we will end up running out of energy that feeds it very soon; however, due to its power, we believe that players will be encouraged to explore the game map to find more and return to slaughter anything that threatens them. Not just zombies Again, the gameplay is not limited to simply massacring zombies and the exploration component will cover a large part of the experience offered by the game. On the map there are shelters presented as secondary missions, once cleared of all threats the various sellers of the shelter will automatically be unlocked through which it is possible to buy weapons, vehicles, clothes, food and above all maps. These will allow us to highlight the various collectibles on the game map and, much more important, the various schemes that allow us to create combined weapons and vehicles. The scheme system is now well known on Dead Rising: through these it is in fact possible to unlock, as already mentioned, various previously unknown combinations. There are a total of 24 melee weapon schematics, 14 for ranged weapons, seven for thrown weapons, and eight for vehicles. The task of sellers of weapons and vehicles in this sense is precisely to allow us to buy, through credits earned by playing and exploring, the various vehicles or equipment for which we have not yet found the diagrams or for which we do not have the materials we need to produce them. As you may have already guessed, once again three categories of weapons are highlighted, throwing, melee and ranged (firearms). Despite the three categories, it is very likely that you will end up fighting mainly with melee weapons, perhaps due to the longer duration of the weapons or simply the greater sense of personal gratification you receive after hitting a zombie. Unfortunately, even this dynamic is not without flaws, the melee combat system does not include particular combos, limiting everything with the simple and repeated pressing of the X key to hit, Y to repel, and X + Y to perform the special ability of the weapon after killing enough zombies. As for the rest of the exploration, each of the various areas has its own refuge, by completing the various side missions and encounters, the refuges are leveled by unlocking even more elements available from the sellers. Speaking about the level up system of the protagonist: by performing certain actions or massacring zombies, you get experience points and once you complete the bar you level up and earn a skill point. This can be spent on one of five main attribute categories: Combat, Temper, Shooting, and Survivability. The level up is very generous and in a short time you reach relatively high levels, probably thanks to the not really long-lasting campaign. As the title of this article suggests, Dead Rising 4 is not just about zombies. During our adventures in the city, it will not be uncommon to find ~human~ enemies among bandits, Obscuris soldiers and extravagant psychopaths or secondary bosses to defeat. In addition to this, as mentioned before, the zombies have evolved and some have become faster and more resistant, others more intelligent, in short, Capcom Vancouver's effort to vary the clashes and the various approaches to our enemies is commendable especially when considering the genre of game. Vehicles are still part of the game's gameplay, where even a wheelchair can turn into a formidable tool for exterminating zombies. However, the variety of vehicles remains limited to 8 combinations in total with a design and fun factor probably lower than those seen on Dead Rising 3. Moral of all this: the completionists will still have bread for their teeth thanks not only to the various collectibles and blueprints scattered throughout the game world, but also a huge amount of challenges to complete and secrets to discover. Together is better! On Dead Rising 4 makes its debut a new cooperative multiplayer mode consisting of four episodes in total in which players will have to survive day after day, facing various missions depending on the episode in which you are playing. While time has been completely removed from campaign mode, in multiplayer it's still an ~enemy~ to be reckoned with. During a game ~day~, three main missions are proposed to be completed by 9:00PM in the virtual world. In case you fail to complete them in time, the objective fails and the players are forced to return to a safe haven, again, with a time limit after which everything fails and consequently the player does not ~pass~ the game day losing any progress made. In the Chowever, if you manage to complete the three missions by 9:00PM, the game automatically generates new bonus objectives to complete but, first of all, be careful, it is fair to underline that once the time limit has been reached, a refuge will be indicated on the map random and depending on the fate, players may have to move from one side of the map to the other facing entire areas overflowing with zombies. Once you reach a shelter, you move on to the next day in which new objectives are generated and, before starting, the player will have the opportunity to buy weapons, food and various upgrades to better prepare for the imminent zombie massacre. On the other hand, the progression of the character is interesting, which totally incorporates the structure seen in the countryside but not the progress made with the protagonist of the latter. This means that our multiplayer character will have a totally separate progression from the campaign character, but what they will have in common are the various layouts for weapons and vehicles. In fact, some of these are exclusive to the multiplayer mode and are found only in certain episodes or unlockable through particular challenges. Finally, to access the next episode, it will be necessary to first complete a certain number of missions in the previous episodes, but this time too longevity is questionable, although the mode is undoubtedly fun to play, especially if in the company of friends. Technically speaking In closing, it is more necessary than ever to say a few words about Dead Rising 4 on a technical level. Although the amount of zombies on the screen has increased, accompanied by a discreet anti-aliasing filtering and the render certainly has more pixels than in the previous chapter, it almost seems to have taken a step backwards in many respects. The models are poorly defined, medium / low quality shadows and textures, the faces outside of the protagonist comparable to last generation titles. Not to mention the multiple graphic artifacts that make their appearance here and there. The choice of brighter colors compared to the third chapter is not a little out of place and in scenes full of zombies very bright greens, yellows and blues alternate, surrounded by the extreme presence of blood red, without adding details to the clothes which would have contributed in any case to bring a minimum of variety between the various models. Exterminating zombies simply fills the floor with blood, while most of the bodies end up being obliterated in order to probably keep the frame rate stable. In conclusion, between stylistic choices and technical compromises, Capcom proves that it is unable to provide a technical experience in step with the times, proposing a graphically unsatisfying triple A product full of artifacts with a side dish of various bugs.", "date": "2016-12-05", "grade": "7.5"}