{"name": "La bella addormentata nel tablet", "ref": "https://multiplayer.it/recensioni/176754-little-briar-rose-la-bella-addormentata-nel-tablet.html", "text": "Once upon a time, it must be said, an excellent idea to stage a point and click graphic adventure for mobile devices and PC. Little Briar Rose was born in 2014, during the Indie Game Maker Contest of that year, and from there it developed further becoming a real full-fledged title, finally arriving on the App Store and Google Play and about to arrive on PC as well , with launch scheduled for early December. There is an independent Italian team behind this little gem of design, namely Elf Games Works, which has managed to complete that particular ~artsy~ game vision that had emerged during the Contest and had already attracted so much attention to the era. The most characteristic aspect of Little Briar Rose is evident at first glance: the graphics are strongly inspired by the Gothic stained glass technique, whereby the designs are composed of a set of colored and juxtaposed geometric planes, separated by dark lines that they would be to reproduce the metal frame that was used in the structure of the decorated windows, inside the churches of the time. The stroke here appears more precise and sinuous, obviously not having the problem of adapting fragments of physical materials to figurative needs, and in many respects, also given the dreamy fairy-tale theme, suggests more of the subsequent reinterpretation of the stained glass technique that emerged between Art Nouveau and Liberty, but this does not change the evocative force with which the game presents itself among the numerous mobile titles, truly distinguishing itself as a unique title from a stylistic point of view. It is this artistic vision that elevates the whole product in a particular way, because for the rest its structure falls rather precisely within the canons of the graphic adventure, while story and puzzle design, while not reaching peaks of absolute excellence, stand at excellent levels . Little Briar Rose lets us experience a fairy tale in stained glass with an interchangeable protagonist There was many times a prince The story is the classic one of Sleeping Beauty, reproposed in the premises in a rather faithful way to tradition, but the adventures of the prince who will find himself trying to save her are decidedly different from those reported in the original fairy tale. The protagonist must try to free the enchanted forest from the magical brambles that make it impossible to cross, helping the local populations with their problems among gnomes, tritons and fairies. By talking to the various characters, collecting objects and using them in the best possible way, it is possible to solve puzzles and progressively clear the passage towards the castle where the coveted princess lies. If all this may seem very classic, it is because in fact it wants to be, since it is a real tribute to the classic fairy tales of Perrault and the Brothers Grimm, but it cannot be said that Little Briar Rose does not demonstrate a certain personality even in adapting to the standard form of the fable. The dialogues with the characters in some cases are highly ironic and enliven the reading of the texts, while the diversity of the puzzles in some cases is remarkable, with the possibility of dedicating yourself to real mini-games or puzzles that have little to do with the normal course of action. The design of the puzzles is not as elaborate as in classic graphic adventures, with the solution often being rather guided, but a very interesting feature of this game is that in some cases it allows you to make mistakes and suffer the consequences. In fact, within this typical adventure mechanic, Little Briar Rose inserts what could be defined as a roguelike feature, or rather the possibility of losing the protagonist due to wrong choices and seeing him replaced with another. It is not simply a matter of finding a game over by hitting some dead end as happens in the Sierra tradition, to say: in this game it is possible to solve some puzzles in the wrong way, for having left out elements or using the wrong objects, with disastrous consequences for the prince. This is then replaced by another protagonist who inherits all the objects of his predecessor and continues the story trying to do better, in a sort of preservation of the ~actantial~ role of the prince regardless of the character he controls, a decidedly original solution that it also seems to make fun of some of the basic rules of the fairy tale.", "date": "2016-11-23", "grade": "8.3"}