{"name": "Amnesia: Collection", "ref": "https://multiplayer.it/recensioni/176668-amnesia-collection-discesa-nellincubo.html", "text": "Console users hardly hoped for a porting of Amnesia: The Dark Descent, the title of Frictional Games that contributed to the relaunch of the first-person survival horror genre, influencing several productions released subsequently. It seemed paradoxical to play titles like Outlast and Alien: Isolation, which look a lot at the work of the small Swedish house, without having the inspiring model, but the inconsistency is now a thing of the past. It took three years, but Amnesia: Collection finally brings three revised titles to PlayStation 4, including, in addition to the original, the sequel Amnesia: A Machine for Pigs and also the terrifying DLC Justine, a small independent adventure centered on a new character. The entire collection is offered at an advantageous price, with individual titles freely selectable through a practical menu. Follow us in reading to find out if time, remember that six years have passed since the original release, has managed to affect the Amnesia series. All the titles dedicated to Amnesia in one collection for PlayStation 4 Fear of the dark Amnesia: The Dark Descent is clearly the highlight of the collection and the main reason why it will enter user consoles. Spiritual successor to the Penumbra series, which Frictional served to gain experience, brought the horror genre back to atavistic tracks, but also reconnecting to a certain type of classic adventure. Set entirely in the gloomy Prussian manor Brennenburg, the game puts us in the shoes of Daniel, a character who has lost his memory, we will later discover why, committed to reconstructing the pieces of his history and why he is imprisoned in the gloomy castle. Inconvenient truths will surface during the story, full of esoteric nuances and heavily inspired by the works of H.P. Lovecraft, through a very well balanced adventure, able to reconcile stealth phases, exploration, environmental puzzles and a story to be discovered by recovering the inevitable notes scattered around. We will soon discover that the walls of Brannenburg hold terrible secrets, including a number of not indifferent threats in the form of monstrous creatures. To complicate everything contributes the peculiar game formula, focused on the balance between light and darkness. The protagonist suffers from acluophobia, or the fear of the dark, it is therefore necessary to keep a value called sanity at acceptable levels. If Daniel stays too long in the dark, his vision and movements will be compromised by a disturbing series of video artifacts to highlight the character's discomfort. To avert the dreadful consequence it is therefore necessary to stay in the light, and the only way is to rely on an oil lamp, or by lighting the various candles placed in the rooms. In both cases, resources are limited, with lamp oil and candle matches in short supply. Finally there are monsters, deformed creatures, sometimes invisible, that we must scrupulously avoid, being completely helpless to their attacks. Frictional Games introduces them with a surprising delay, leaving the player time to get used to mechanics more related to adventure and exploration, all with a truly exemplary atmosphere, despite the classic horror mold. Let's forget the ~jump scare~ or particularly low blows, the main interest is to accumulate continuous tension through the masterful use of sounds and locations, the result is a title capable of causing anguish like few others, and despite being released six years ago it still manages to keep its strength intact. Finally, the ingenious use of physics to solve particular puzzles, or to overcome seemingly impossible sections, which defines the undisputed talent of the developers, should be commended. Playstation 4 trophies Considering that we are talking about three distinct titles, it will take time to conquer all the Amnesia: Collection Trophies, considering that multiple endings linked to the player's actions are also contemplated, it will take several hours of play to recover all the loot. Worth noting is the sarcasm of Frictional Games, which has included a special Trophy for those who abruptly interrupt a game, sometimes tension plays tricks. Industrial horror Not least is the official expansion of Amnesia, called Justine, which moves the scene to France and seeks new ideas, specifically inspired by the crimes of the ~Countess Dracula~ Elizabeth Bathory, but also the SAW film series. The incipit shares that of the progenitor: we wake up, this time in the role of a woman, completely without memory in the dungeons of a castle littered with gramophones. Through these we find out about ebe guinea pigs in a delusional experiment set up by a sadistic noblewoman called Justine. The aim is to go through three distinct areas of the castle, each of which features a trap specially prepared for as many victims, three men whose fate is in our hands. The only way to continue to the next area is to activate the trap, killing the victim, or finding an alternative way by solving the inevitable environmental puzzles, which still make use of the physics offered by the graphics engine. As if that weren't enough, the prisons also house Justine's aggressive lovers, reduced to dangerous mutilated humanoids to be avoided categorically. It is not possible to save the game, but the permadeath does not weigh too much in this little adventure, since it can be completed in just half an hour and offers high replayability. Depending on the results achieved, we will have a different closure for a truly unhealthy and perverse story, even more frightening than Amnesia: The Dark Descent due to the gory topics covered. Amnesia: A Machine for Pigs closes the trilogy with a chapter set in Victorian-era London. The official sequel is no longer edited by Frictional Games, but by The Chinese Room, authors of Dear Esther and Everyone Gone to the Rapture, and unfortunately it shows. Compared to the original, the scheme is much more simplified, sanity is removed, the lamp does not discharge, the interaction is significantly reduced and everything is organized on a more linear structure. Despite being lower than the first chapter, Amnesia: A Machine for Pigs focuses on a well-told, grotesque, disturbing and allegorical story about the industrial revolution as a symbol of human degradation. There's no shortage of spot-on moments and some scares, but overall it's a product that offers a different experience than the horrors of The Dark Descent and Justine. Unfortunately we have encountered some glitches that force you to reload the chapters or recover an old save. The porting of the three titles to PlayStation 4 is a bit fluctuating: in principle Blitworks has done a good job keeping all the games at 1080p and sixty frames per second, but there are several drops in frame rate, especially in A Machine for Pigs, which boasts a more advanced graphics engine.", "date": "2016-11-22", "grade": "8.5"}