{"name": "Cartoni e proiettili", "ref": "https://multiplayer.it/recensioni/176648-toon-shooters-2-the-freelancers-cartoni-e-proiettili.html", "text": "Four years after the release of the first, fun episode, the independent team Mooff Games has launched a sequel on the App Store and Google Play, Toon Shooters 2: The Freelancers, characterized by the freemium model and the presence of an online cooperative multiplayer for a maximum of five participants. The concept behind the experience is the same: under the command of one of six funny cartoon characters, we will have to face an enemy army with bullets, homing missiles and smart bombs. The game offers a series of in-app purchases, such as the $4.99 premium package that unlocks all six protagonists (otherwise obtainable by gradually collecting in-game currency) and a certain amount of ~continues~, but it is possible to play for free without major problems to try the experience and then decide whether or not to reward the work done by the authors. Work that, let's say it right away, seemed commendable to us. In fact, we are not talking about a revolutionary shooter, especially when compared to the debut chapter, but terribly solid and well made, with a well-implemented enhancement system and a first single player campaign (others will follow) made up of ten stages and as many bosses, as well as the aforementioned online cooperative multiplayer, which allows you to join a game created by other users and work together to complete levels. The only negative note in this sense: choosing the same character creates great confusion, as the system does not distinguish players with different colors except in the writing of their nickname. Toon Shooters 2: The Freelancers is a solid, fun and beautiful to look at shooter Shoot what happens to you Among the strengths of the first Toon Shooters were the solidity of the gameplay, an almost perfect balance of difficulty and a set of precise and responsive touch controls, with a single button on the right side of the screen for the release of missiles, fire automatic and an invisible stick on the left side of the screen for ship movement. In the new episode we find all these aspects, together with an even more coherent and interesting formula, which is not afraid to dare and to introduce surprising variations on the theme. Thus it happens that the scrolling of the stages suddenly accelerates, or that the zoom changes by increasing or decreasing the size of the spacecraft, or that an unexpected mini-boss arrives halfway through. The aforementioned autofire allows you to manage your character in an agile way, avoiding bullets that come from everywhere and trying to preserve vital energy while waiting for a recharge. However, you should never miss the main weapon upgrades and smart bombs, which instantly clear the screen of opponents. Among the strengths of the game we must necessarily mention the bosses, all very well designed and equipped with unique attack and movement routines; however, no progress has been made from the point of view of the yield of the impacts, still too inconsistent, so much so that often and willingly we do not realize that we have suffered damage if we do not look at the health bar. Nothing to say on the other hand about the technical realization, improved substantially compared to the debut: the design of the characters, the basic enemies and the bosses appears more mature and convincing, just as there has been a much greater effort regarding the composition more complex and detailed scenarios. Online multiplayer suffers from some uncertainty based on the quality of the connection of the participants, but the experience is confirmed as pleasant and the drop-in / drop-out system allows you to have fun in company even for a few minutes.", "date": "2016-11-21", "grade": "8.5"}