{"name": "Polarium Advance", "ref": "https://multiplayer.it/recensioni/polarium-advance.html", "text": "Black and white The mechanics behind Polarium is, like that of many other puzzle games, as difficult to explain as it is easy to assimilate once in contact with the game. Every time you start a game you will find yourself in front of a table, of variable dimensions, dotted with black and white squares. Your task will be to eliminate all the boxes on the screen, creating horizontal rows that are all made up of tiles of the same color: you can give each one the same shade, but white rows alternating with black ones will also work, the important thing is that all the boxes that make up a certain horizontal line are equal. To do this you will have to draw an imaginary line which, once activated, will invert the color of all the boxes over which you have passed it. The difficulty of completing the various paintings lies in the fact that you will have only one line available to ensure that the tiles get the right color, a single, long trajectory that must not invade those boxes that are already of the desired shade. After a few simple test stages, things will immediately start to get more complex, until you reach very high levels of difficulty. To complicate things, there will also be special types of boxes over which you will not be able to pass your trajectory, or others that have the function of supporting the entire stage and which, once eliminated, will make all the above ones collapse, which will form new lines. The classic motto ~easy to play, hard to master~ fits perfectly with Polarium, which is a puzzle game with a simple structure but with great depth and truly ingenious and exciting puzzles, which manage to stimulate the player's logic like few others others. DS versus GBA As initially said, Polarium was designed in relation to the functionalities of the DS, to the potential of the Touch Screen. So how was it possible to transfer it to GBA without making the game more cumbersome? Simply eliminating those game modes that required the stylus to be fully appreciated. In the DS version of Polarium there was a classic type of game, a la Tetris, which on the GBA has disappeared. In this mode, new boxes were constantly arriving in the game table, and our task was to eliminate as many lines as possible, always with the usual procedure, but without the restriction of a single trajectory. You could therefore invert the colors of the tiles to your liking, without any limits, which would be impossible to do quickly without the Touch Screen. If with the stylus it was enough to touch a box to make it change tone, with the GBA you have to move the cursor over it, an obviously more cumbersome and slow process that would have jeopardized a mode that makes speed one of its basic components. Fortunately the beauty of Polarium has not been lost, because the real Polarium resides elsewhere. Even in the DS cartridge, in fact, the true merits of the game came to the surface with the mode also present on the GBA, the one that requires reflection and the application of logic, not instinct. The developers therefore thought of enhancing it to the maximum, tripling the paintings of the DS version, which have now become as many as 365, one a day for a year. There's also an editor that allows you to manually create your own stages and a mode where you have to clear a certain number of levels within a limited amount of time. The multiplayer of the DS version has obviously disappeared, because it was based on the classic type of game, a la Tetris. The GBA version is therefore better as regards the main mode of Polarium, but does not have the more traditional one which, although inferior, was still useful to prolong the experience of the game as it proposed randomly generated puzzles. Saying which version is the best is therefore a difficult task, but certainly the potential of Polarium and its unique concept come out more on GBA, despite the longevity being lower than the DS counterpart. Neither the price, reduced for both versions (about 30 euros), nor the audiovisual sector, minimalist on both GBA and DS, help to resolve the issue. Polarium boasts a very unique game mechanic, different from other puzzle games. If in the other titles of the genre tension and speed are fundamental components of the gaming experience, in Polarium the logic and reflection emerge, necessary to complete the many puzzles (as many as 365). To its disadvantage, it must be said that once the many paintings have been completed, it no longer offers much to the player, as there is no 'random' mode to Tetris, present instead in Polarium DS. Between the two versions, although it is difficult to decide which is the better, we recommend this GBA, because it manages better than the other to highlight the many advantages of Polarium, it represents a purer experience, while the one for DS is a way of halfway between the main features of Polarium and the classic ones of puzzle games. Pros Intelligent like few other titles of the genre Costs 30 euros 365 paintings of pure genius... Cons ... which end soon Extremely minimalist audiovisual sector There is neither multiplayer nor a random mode Polarium, a puzzle game created by Mitchell in collaboration with Nintendo, was one of the launch titles for the Nintendo DS. Like many of the games that accompany the arrival on the shelves of the respective consoles, Polarium had the aim of showing everyone, in a simple and intuitive way, the potential of the Nintendo DS and its Touch Screen. The game, as well as some of its modes, was designed around the peculiar characteristics of the Nintendo portable: therefore, the announcement of a version for Game Boy Advance was not a little surprising.", "date": "2006-04-28", "grade": null}