{"name": "Guerre galagattiche", "ref": "https://multiplayer.it/recensioni/176176-galaga-wars-guerre-galagattiche.html", "text": "Few things in video games have the iconic power of classic 2D shooters, able to condense the basic elements of this particular medium within them and make us return in an instant to the foundations of videogame entertainment, managing to prove to be always current and always decidedly challenging . The immediacy that distinguishes this genre makes it particularly suitable for porting to mobile platforms, and in fact there have been several conversions taken from classic shooters brought to smartphones and tablets, from Raiden to Gradius, from Darius to more recent series such as Deathsmiles , shooters and ~bullet hell~ seem to have taken root on portable devices, only that they can hardly reach the notoriety of other titles on these platforms. It is probably precisely the degree of difficulty that makes them niche products, more suitable for those who have a rather solid experience with video games than for the casual player looking for immediate fun that is not too frustrating. On the other hand, the adaptation of the controls to the touch screen does not always manage to do justice to this type of title, and a minimum handicap on this front, corresponding even to a few millimeter inaccuracies, can be fatal to the hell of bullets and spaceships crowding the screen. On this front, Galaga Wars performs quite well, with a control system that seems calibrated precisely to be used with one hand and this certainly works in its favor, demonstrating how Bandai Namco has taken the adaptation with a certain seriousness of his old classic for mobile platforms although the adoption of the free-to-play model carries with it intrinsic defects, just as the simplification of the gameplay could lead someone to break away sooner than expected. In this case, the game forces you to always restart from the beginning to destroy your spaceship unless you pay with play money (coins that you collect in-game) to continue, or you can watch an advertisement. Very often, therefore, we find ourselves having to watch advertisements in order to continue or obtain further bonuses, while the purchase of new spaceships is strictly linked to the spending of real money, therefore Galaga Wars proves to be a game decidedly based on microtransactions. Galaga returns with a mobile adaptation capable of attracting the nostalgic but also the newbies The new generation The mechanics of Galaga Wars follows that of the original, being a shooter arranged vertically with the protagonist spaceship facing waves of insectoid enemies who attack by moving in agile fast formations. The idea is therefore to understand the attack pattern of the group of enemies and arrange yourself in an area of the screen capable of hitting all the enemies without letting even one escape, possibly without getting hit, in order to obtain a power-up. The latter allow you to enhance the attack of the spaceship or release special shots, but these elements are activated automatically as soon as the bonus is collected and have a limited effect over time, so their use cannot be regulated strategically. At the end of the series of waves, the level changes to a new scenario but essentially the game mechanics repeat itself continuously, occasionally broken by the appearance of a boss who can represent a considerable challenge, also thanks to the ~bullet hell~ suggestions that they often emerge in these situations, with myriads of enemy projectiles to dodge while trying to hit the enemy's weak points. The spaceship is controlled by simply dragging a finger across the screen, with automatic fire always active, while taking your finger off the game automatically pauses, demonstrating how everything is designed to be used comfortably with a single finger, on screens not too wide. It is a good intuitive solution, even if in the most demanding moments we tend to regret the classic control scheme, but in general the system convinces, also given the intrinsic difficulties in using games of the genre on a touch screen. The technical realization of Galaga Wars is also pleasant, with a simple but clean and coherent reinterpretation of the classic style, including insect-shaped ships, space scenarios and assorted light effects to make everything spectacular.", "date": "2016-11-09", "grade": "7.8"}