{"name": "Fratelli del metallo e del loot", "ref": "https://multiplayer.it/recensioni/176063-super-dungeon-bros-fratelli-del-metallo-e-del-loot.html", "text": "The dungeon crawler-style action RPG with an insistence on cooperative multiplayer is a particularly explored genre, especially by indie teams, probably able to provide a rather safe ground on which to experiment, given the now consolidated foundations of the canon on which one can take risks to improvise something while remaining protected by a solid play structure. So also Super Dungeon Bros limits itself to inventing on a sedimented canvas, composed of the classic rules of the simple and carefree action RPG dungeon crawler, staging the battles of four warriors with different but substantially corresponding appearances and characteristics grappling with various dungeons infested with various types of enemies, in search of treasures and special rewards. The story makes practically no sense and in fact it is not even mentioned: the game starts directly from the action, because in the world of Super Dungeon Bros that is ultimately what counts. In any case, these are the adventures of these four reckless people halfway between classic fantasy and demented metal imaginary grappling with numerous dungeons to clean up to save the kingdom of Rkheim from dark forces, to become ~Rock legends~ , or something like that. Axl, Lars, Freddie and Ozzie are distinguished from each other by color, by the weapons used and by the characteristics of the ~personality~ described but in essence very little changes from one to the other, beyond the ~nice~ phrases repeated in various circumstances during the gameplay and that underline how one should be the mad one, one the strongman, one the Latin lover and the other the evil genius. All obviously side elements of little interest in a game like this, where what matters is choosing your soldier and immediately throwing him into the fray, but these are still details that contribute to building the particular identity of the game. Metal and fantasy always go particularly well together, as demonstrated by Super Dungeon Bros Take your hands Even the combat system is all based on the essence of action, thus presenting itself with a few fundamental rules so as not to overload the player with different variables and possibilities, who finds himself having to hit myriads of enemies in the space of a few seconds. We therefore find ourselves paying more attention to hammering on the keys than to tactical approaches and creative interpretations of the battle, although the aforementioned general rules of the action RPG dungeon crawler intervene here to build at least a basic scaffolding for the combat system, which it therefore results in a structured minimum even within the most frenetic chaos. There are two main classes of weapons, melee and ranged ones, and within these two large families we find different types of objects to choose from, each with its own characteristics even if the main reference is always the same: ~ melee~ and ~ranged~, no particular subtleties beyond this initial subdivision are recorded. The attacks are divided into fast and heavy, each of which with its own points for and against, although even in this case the game never goes very subtle in managing the differences and beyond a few particular types of enemies a assorted alternation between the two types of attack, without studying too much, can make us emerge victorious from the most furious scrums. On the other hand, dodging is decidedly important, the management of which must be well assimilated to ensure survival, given that enemy attacks cannot practically be parried and must therefore be avoided with the correct timing (suggested by an indicator that shows the imminence of the 'attack), just as it is also essential to avoid the numerous traps scattered throughout the levels. Instead, the management of the special ability is rather bizarre, which allows a particularly powerful attack but which can only be recharged by purchasing it from the merchant who appears in various points within the dungeons, which makes its correct dosage rather complicated. Traps and brothers The levels of Super Dungeon Bros are generated in a procedural way, which guarantees variety of experiences but which always carries the risk of excessive simplicity in level design. On this front, however, the game manages to maintain good standards: despite the random creation of the elements of the scenario, the levels are in any case well constructed and equipped with traps and varied game situations able to keep the interest high in the exploration of the various settings, which to tell the truth are not many. The ability to flip switches and pick up and throw itemstti (as well as battlemates) paves the way for various rather fun gameplay solutions that have value both in the combat system and in the solution of the puzzles scattered throughout the dungeons. Obviously the maximum fun is achieved by playing Super Dungeon Bros in four players, which is feasible both through online and local multiplayer, and also the arrangement of enemies, bosses and mechanisms within the levels is affected by this clear trend towards multiplayer. It must be said that at the moment there are several problems in completing online matches, probably due to a certain lack of users or some technical problem that could be solved in the short term, but if there is the possibility of make up for with local multiplayer, the choice is highly recommended. The action itself is very confusing, also given the high point of view, the small size of the characters and the animations that are not always perfectly decipherable, but in the event that there are four of you to fill the screen this almost becomes an advantage , between improvised cooperation, desperate hunt for loot and the possibility of launching your companions around the scenario to activate mechanisms, reach distant areas or simply have a laugh. In addition to the standard progression within the various dungeons, the game also offers special online challenges that are renewed on a daily or daily basis, thus proving to be always quite lively. Xbox One goals Super Dungeon Bros contains 27 unlockable achievements for the usual total of 1000 points to collect while wandering the dungeons. A part of these is connected to the normal progression in the levels and the defeat of the bosses but a large part derives from various cumulative performances that require a certain application in the game, both in single and above all in multiplayer, therefore the bulk of the loot comes in the long term. Flamboyant dungeons The graphic and musical characterization is one of the strengths of the React Games production, considering that thanks to its bright colors, the over the top style and the continuous references to metal of which the soundtrack is also composed, Super Dungeon Bros manages to stand out in the considerable amount of similar titles on the market, especially as regards the PC front. It is clear that we are dealing with a limited budget production and it would be unfair to make direct comparisons with titles such as Diablo or even Torchlight, both on the technical front and in terms of depth of structure and content, but taking it as a light and unpretentious game, one must recognize that the team has tried to build something particular. Therefore, aesthetics is not the problem of the game, even if greater clarity in the action could have come from a little more care in the animations and in the response to the controls. The random generation of dungeons is in itself already a manifesto of intent, with the direct consequence of obviously not being able to count on painstaking care in developing them, nor on an extreme variety of game solutions and scenario elements involved, but on this front, as mentioned above, the title amazes positively by proposing a rather constant flow of different situations in a continuous alternation of fights and traps to avoid. Unfortunately, the same variety is not found with regard to the enemies, who are established along classic categories in the usual basic cataloging between long-range or short-range attackers. They represent a challenge above all because of the quantity, since they always attack in very massive groups, probably also to compensate for the poor elaboration of the attack and defense patterns. The growth and management of the character also remain at a very superficial level, i.e. the RPG elements, which are not particularly developed, to underline the fact that Super Dungeon Bros should be taken simply as an action to be played in multiplayer, a situation in which the maximum emerges exploitable potential.", "date": "2016-11-06", "grade": "6.5"}