{"name": "Quasi dieci anni e non sentirli!", "ref": "https://multiplayer.it/recensioni/175962-call-of-duty-modern-warfare-remastered-quasi-dieci-anni-e-non-sentirli.html", "text": "Sometimes they come back. And they do it with a lot of style. About twenty days ago, with a rehearsal of the entire campaign of the remastered version of Call of Duty: Modern Warfare, we had already highlighted a work that went far beyond the simple porting of the game to current consoles. Although the operation seemed more like a sneaky technique to keep the fans of the past close, the care placed in the graphic update of the title was more than adequate. Now, with the release of the complete package, the addition of the multiplayer component test and, willy-nilly, that Infinite Warfare which should represent the new iteration, we are ready to pull the strings of this latest work at Activision. Call of Duty: Modern Warfare returns with a restored version that almost makes you cry out for a miracle! But how beautiful is war in the present It would be useless to go back to talking about what the narrative arc of Modern Warfare is. In light of past years and the test of a few weeks ago, what is important is to contextualize the title. In a panorama in which first-person shooters are fought aboard mechs, with exoskeletons that offer double jumps and wall runs or, on the contrary, you return to living them in the trenches of the First World War, Modern Warfare stops today. The intention is to give us the most vivid and spectacular reproduction of war operations which, unfortunately, we have heard more and more about in recent years. Where our imagination does not reach, it is therefore Infinity Ward who gives us a clearly fictional point of view of the brutality and fascination that war causes in all of us. The campaign unfolds over twenty missions and is divided into acts. The variety of settings and situations that we will find ourselves in front of, undoubtedly makes it one of the most deserving of the panorama of first person shooters. It is no coincidence that, even today after a decade, Modern Warfare is considered a pillar of the genre, and the campaign is an integral part of this attractiveness. Despite a heavy script of events and a series of situations that focus more on cinematic spectacularization than on the purely gameplay-related experience, one cannot fail to be enchanted by the incredible scenic capacity of the story that we are called to live. Infinity Ward was able to mark a firm, indelible and lasting point in the history of the genre. Reliving it all these years later is not only a pleasure, but also a way, both for newbies and the old guard, to fully understand the contribution made back in 2007. That multiplayer that changed everything Being a complete game, even the multiplayer of Modern Warfare undergoes a complete restyling, without any trick if not some purely technical, thus proposing the original experience that has characterized one of the most popular Call of Duty in history. After spending several hours on Infinite Warfare, characterized by fast and frantic gameplay, returning to a ten-year-old game multiplayer is undoubtedly curious. You immediately notice many different concepts and how many things have changed in conceiving a competitive multiplayer mode. Initially, one is easily blown away by the elementary movement system combined with an extremely low time to kill, in which a simple burst from an assault rifle is capable of taking out an enemy. The clashes are much less fought, almost elementary, and surviving becomes more a question of not being discovered and often changing your position regardless of the class or weapons you are using. However, apart from a little initial discouragement, also driven by a slight nostalgia factor, we are beginning to see the many small details of the multiplayer that has enthralled millions of players all over the world. From slower and quieter matches, we move on to intense ~search and destroy~ clashes or hard-fought matches in domination mode, all linked to a gameplay that certainly feels the years, but which despite everything is still very pleasant today. Thanks probably go to the good design of the maps which guarantee game arenas that are still fun to play today, also enhanced by the remastering which only makes them even more enjoyable. On the latter, however, there is a lot to say, the weapons and the models of the characters are very well made, as are the various urban scenarios that make the clashes in these environments very pleasant. On the other hand, the quality of the foliage and grass is disappointing, especially when viewed from a distance, probably the victim of unsatisfactory anti-aliasing filtering. However, there is no doubt that the presence of the foliage is drastatistically increased compared to the original version, making the maps really pleasant to see despite the various technicalities mentioned above. The equipment customization system remains unchanged, each weapon will have its own slots dedicated to sights and various accessories in order to adapt perfectly to the player's style of play, even the amount of skins available has remained unchanged compared to its predecessor. On an aesthetic level, however, there are new emblems, absent in the original version of the game, which will be unlocked by completing certain challenges or by completing a prestige. Call Of Duty Modern Warfare Remastered includes ten launch maps, the remaining six are scheduled for the end of December 2016. In conclusion of this paragraph dedicated to multiplayer, we still want to underline that the title, despite Call of Duty boasting an immense catchment area, risks to be reserved for the elite of players who have specifically purchased the Legacy edition of Infinite Warfare and, furthermore, considering the absolutely contrasting gameplay and not in step with the times (especially if we consider that Modern Warfare Remastered is not sold separately) there is wondering, in the long run, which game will players prefer and what will be the fate of this remastered version. Playstation 4 trophies The search for the coveted trophies will require you to conquer a total of 50 awards before having the hard-earned Platinum in exchange. Divided into 34 bronze, 15 silver and 1 gold, you will be called to complete the campaign on all available difficulties and to perform particular actions in battle. All in all a rather simple and painless collection. A clean up of some weight Speaking of the purely technical aspect, as mentioned initially and also repeated with regard to the multiplayer component, this remastered marks a significant peak in the panorama of revisions. In a generation made up of low-level conversions and commercial operations aimed only at making the most of a single brand, one finds oneself smiling at the production value of Modern Warfare. Almost everything (the missions aboard the AC130 remained unchanged) has undergone an almost total revision. The polygonal models of the characters do not disfigure in the face of many of the current productions, as well as the various settings and particle effects relating to explosions and atmospheric agents. The only elements that are perhaps slightly affected by the weight of the years can be found in the models of the weapons, not always perfect especially when compared with the rest of the environment; and in a lighting system necessarily out of step with the times. We are talking about one of those elements that in the last decade has made real leaps and bounds in the realistic reproduction of dynamic light and shading. This would have required not only a revision but a creation from scratch in order not to look bad in the face of the current titles. Call of Duty: Modern Warfare Remastered is therefore a pleasure for the eyes and ears, also thanks to a very decent audio sector, another element that is certainly not approachable to the peaks reached by Dice with Battlefront and the more recent Battlefield 1, but which disfigures in front of the average of recently published titles.", "date": "2016-11-04", "grade": "8.8"}