{"name": "LEGO Harry Potter Collection", "ref": "https://multiplayer.it/recensioni/175800-lego-harry-potter-collection-una-conversione-da-babbani.html", "text": "The choice of TT Games is curious: instead of developing a brand new game inspired by Fantastic Beasts and where to find them, the new film set in the Harry Potter universe which will be released in theaters in a few days with the good Eddie Redmayne in the role of the clumsy Newt Scamander, the British software has preferred to remaster in a single compilation the two titles released more than five years ago (LEGO Harry Potter: Years 1-4 and LEGO Harry Potter: Years 5-7) for older generation platforms. Well, thinking back on it, at a time when everything is being remastered, it isn't even that curious as a choice: the little wizard born from J.K. Rowling's fairy pen is still very popular today, as well as LEGO, and the combination of the two could only become an excellent recipe to recycle at Christmas and with a new film at the cinema. However, several years have passed, and in the meantime the guys at TT Games have reinvented themselves several times: in short, Harry has grown up in the meantime, got married, had children and even a sequel at the theater. Will the LEGO tie-in have aged just as well? LEGO Harry Potter Collection left us with a bitter taste: ten points less to TT Games! You are a wizard, Harry! LEGO Harry Potter Collection combines in a single solution LEGO Harry Potter: Years 1-4 and Lego Harry Potter: Years 5-7, the two games released months apart from each other to follow the cinematic - and literary misadventures - of the young British wizard, albeit transformed into a parody based on LEGO bricks and sign language. The two LEGO Harry Potters, in fact, date back to before TT Games began dubbing its games with original audio from the films (take LEGO Lord of the Rings, for example) or with completely unedited jokes as in the case of LEGO Marvel Super Heroes. This means that the cutscenes that pick up the story between levels will feature mostly gestural humor in which the minifigs representing our heroes will moan and grunt, often ridiculing the reference material. blatant. It is also always a parody and the result is often hilarious, especially when it comes to making fun of the cruellest enemies such as Voldemort or Professor Umbridge. Despite this, it must be admitted that we missed the dialogue kinematics, mostly because the silent ones give a strongly retro feeling and because we are quite sure that players who have not seen and re-watched the original films may struggle to understand the parody. Having said that, the TT Games title is especially aimed at Harry Potter fans also because it often mentions the novels and all those small details that have not found a place in the film adaptations. In short, for lovers of the saga, the LEGO Harry Potter Collection is a real gem and, today as then, probably the best video game tie-in dedicated to the creation of JK Rowling. However, it is also a LEGO title, which means that not everyone might like its mechanics Playstation 4 trophies The LEGO Harry Potter Collection trophies are essentially the same as the PlayStation 3 versions of Years 1-4 and Years 5-7: those who have played the other LEGO tie-ins know that getting your hands on Platinum is not particularly difficult, since it is enough complete campaigns, unlock all characters and find every collectible. Dirty half-porting! The problem with LEGO games is that they either love each other or hate each other. Understanding that haters are probably hard-hearted  how can anyone hate something so hilarious? - it is right to keep in mind that, beyond the reference material and the subjects transformed into LEGO, these are still titles designed also and above all for the little ones. Traveller's Tales are video games with a simple and immediate gameplay, which strongly focus on the collecting side of the players: the campaigns are completed rather quickly, then the levels are replayed to find every hidden brick or bonus. LEGO Harry Potter does not escape this rule, of course, given that all in all it was one of the pillars on which the British developer perfected his formula: the explorable Hogwarts castle was one of the first steps towards the open world scenarios we have later seen with Middle-earth or New York. However, the LEGO Harry Potter stages are much more fragmented, divided into rooms separated by loads which in this conversion seemed decidedly shorter than the original. However, we are talking about two titles in one fell swoop that retrace Harry's first seven years in the world of magic, therefore levels to playthere are plenty of them: the gist of the gameplay is the same as always, you have to explore the settings by defeating the enemies that block your way and destroying everything interactive to collect as many bricks as possible. The bricks accumulated can then be spent on collectibles, bonuses and power ups that will help us collect even more. Once a level has been completed and the new characters have been unlocked, it can be replayed in free mode with any combination of minifigs: each character has skills that allow him to solve various puzzles, accessing sections that perhaps were previously out of our reach. Often these skills correspond to some of the most famous spells and as the game progresses Harry learns new formulas with which to challenge some opponents to a duel or overcome certain puzzles. Unfortunately, LEGO Harry Potter puzzles aren't always the most convincing, mostly from an execution point of view, and we're sorry that TT Games hasn't tweaked the brick coupling dynamics that make some puzzles really frustrating. In general, in fact, the British developer limited himself to slavishly copying the code without retouching it even a little, except for the remastering work which in any case fails to prevent the gap years between Harry's two adventures and the more recent LEGO tie-ins such as the excellent LEGO Star Wars: The Force Awakens. TT Games games are unfortunately notorious for the presence of bugs that sometimes even manage to ~break~ the gameplay forcing a reset, and we are sorry to have found that some of the historical glitches of LEGO Harry Potter, especially regarding the intelligence artificial of our companions or other characters around the levels, have remained in place. In some cases we even had to start the game over because some characters got stuck in delicate points without letting us leave the rooms, just as happened years ago playing on PlayStation 3. Mind you that these are not excessively frequent problems, much less insurmountable, however they were already known and it would have been better if TT Games had solved them, instead of writing a new code to make the DualShock 4's LED change color depending on the spell we're casting on the screen. As if to say, it was a matter of priorities.", "date": "2016-10-31", "grade": "6.0"}