{"name": "Gilbert e le avventure vomitose", "ref": "https://multiplayer.it/recensioni/175683-eggggg-the-platform-puker-gilbert-e-le-avventure-vomitose.html", "text": "It cannot be denied that the very first impact with Eggggg: The Platform Puker, starting from the name itself, could be a bit unpleasant: not so much for the simple concept of vomit shot everywhere (even if this actually does its part), but for the idea that such a choice could have been dictated only to make some noise and try to stand out in a somewhat boorish way. In short, a more fashionable Boogerman in step with young aesthetics, however it only takes a few minutes to understand how wrong this impression could be. Just enough time to come out of an egg and quickly escape from a gigantic furious and vengeful gallinaceous (just to give an idea of a typical situation for Eggggg), after having become familiar with the only two commands available, a thought spontaneously emerges in the mind: ~welcome back, level design!~ Here too we have to deal with the reflexes now conditioned by the habits of the mobile market, and when the game opens with a frantic race between platforms with extremely simplified controls, it is easy to believe that we are facing yet another runner without art or part, but it's not quite like that. There is great attention to level design in Eggggg, to maintaining the pace but also to the study of alternative routes and secrets to discover and there is ultimately a sensitive love for the platform genre that exudes in this Hyper Games production , embellished by the great graphic design work carried out by the Spanish illustrators of Brosmind. The result is to all intents and purposes a real platformer, which is based on the historical strengths of the genre but also offers something new, precisely in that crazy and grotesque characteristic of vomit splashed everywhere. Eggggg or a name, a program: cross the levels between platforms with the force of vomiting Gilbert's Strange Adventure If you know the style of the legendary Adventure Time or similar productions you can get a good idea of the characterization of Eggggg, both in terms of the crazy stretch of the graphics and for the bizarre humorous cut given to the characters and the game world. We therefore find ourselves controlling Gilbert, a boy endowed with the extraordinary gift of perennial vomiting, within a strange world populated by robotic chickens, eggs, jellies and other more or less aggressive amenities, in an attempt to get to the bottom of the levels and possibly collect the various collectibles scattered around, always guarding against the baleful wrath of Aunt Doris, who apparently has a problem containing her anger. In itself the dynamic is very simple, but it is easy to see how the level design is still structured in a studied and intelligent way in order to stimulate exploration beyond the simple timing required to jump from platform to platform towards the end of the levels . The mechanics of the jump, which is based on the recoil given by the splash of vomit on the ground, actually opens the door to a very special way of calculating times and trajectories and the choice of direction to take makes this game an almost canonical platform in the his freedom of movement, and this is certainly a very good thing. The possibility of collecting power-ups capable of providing special abilities (always linked to vomiting, of course) gives a further level of depth to the game, allowing it to be exploited to open new possible paths in the most classic Mariasque tradition. The controls are obviously simplified by the presence of the two gropes on the screen, but their implementation and the response of the protagonist almost does not regret the input via joypad, while the care placed in the animations and in the interaction between Gilbert and the surrounding scenarios is index of the great productive value of this strange title.", "date": "2016-10-27", "grade": "8.8"}