{"name": "Il bollettino della Vittoria", "ref": "https://multiplayer.it/recensioni/175225-battlefield-1-il-bollettino-della-vittoria.html", "text": "We have finally arrived at the end of the march that directly from Stockholm, from DICE's home, brought us to the Battlefield 1 review. Today the last embargo expires and we can therefore give you our final judgment on the game, also writing about the single player campaign. that many of you will have been able to taste (along with a small portion of the multiplayer) thanks to the EA Access subscription. So let's sum up the game: for now we'll just say that the Swedish developers have hit the mark again, improving what they did in both Star Wars: Battlefront and Battlefield 4. Before starting to talk about the campaign, the last missing piece of our coverage, let's spend a few words on the multiplayer, for all those who have not read our previous articles, the one published five days ago focused mainly on the new Operations mode and yesterday's one, in which we dutifully gutted the entire multiplayer component. Finally here is the review of Battlefield 1: DICE Won WW1! Multiplayer in a nutshell The question that many are asking themselves is: ~what impact did the setting of the First World War have on the typical gameplay of the series?~ An undoubtedly benevolent impact: the title is one hundred percent Battlefield, rifles and wooden planes have in no way distorted the classic mechanics of the series. However, we can say that DICE has chosen to make everything a little more immediate; ballistics has been lightened, the pace is sustained: nothing to do with positional warfare, in short. Longtime enthusiasts may turn up their noses a bit, but this less uncompromising setting undoubtedly works great. A lot of work has been done to streamline and make player progression much more intelligible. The weapons might seem few when compared to the canonical number of shooters with a modern setting, but they all have at least a couple of variants that drastically change their use, to the benefit of the specialization of the role and one's style of play. The same thing goes for the classes, including those relating to the means and the Elite ones: the developers have designed them with the aim of respecting the tasks, of playing in concert, in short. Lone wolves will have a hard time without the support of their team. Above all, the sumptuous level design of the maps stands out. They are ~only~ nine, but they are often huge, varied, never banal and flat; discovering every single nook and cranny, each of the many ways to get to the hot spots, is truly a beautiful experience. We mention two: Monte Grappa, probably the most beautiful of the package, where it is easy to feel dizzy thanks to the difference in height between the valley floor and the highest points to ~climb~ and the Argonne forest, a lush and twisted maze, almost claustrophobic , which dwarfs the forest of Endor seen in Battlefront in complexity. And then there's the extensive environmental destructibility, never so effective since Bad Company, and the dynamic weather that can really change the outcome of a battle. Speaking of game modes, Operations is a really nice addition and, more than the mammoth Conquest or Corsa, it really manages to convey the sense of the advancing front and the conquest of the terrain. Domination and Team Deathmatch don't add anything new, which War Pigeons does, a kind of reimagined Capture the Flag. Unfortunately, however, there are still some weapon balancing problems, with a time to kill that is difficult to assimilate which can give rise to unpleasant situations, without forgetting the hitboxes that are not always one hundred percent perfect. Obviously nothing destructive, but it is impossible not to notice these critical issues in battle. In short, we await a corrective patch. War stories So, after the multiplayer discussion, the time has come to understand if the Swedish guys have really created something that makes us forget the hackneyed political fiction of Battlefield 3 and 4. The answer is undoubtedly yes. A campaign that is not free from defects, mind you, but that can be played with pleasure and above all that does not bore, not offering mediocre or simply unsuccessful missions. DICE wants to tell the horrors of the First World War, and does so through multiple characters, multiple actors on some of the main fronts, filtering everything through fraternal friendship and the camaraderie of the soldiers, between a spirit of adventure, personal growth and disillusionment once on the battlefield. The narrative, which has always been the cross and delight of the series in the single player version, has found here a good balance between (hyper) spectacularity and the story of the personal stories of the individual characters.The first and special mission, Storm of Steel, is exemplary in this sense. We go from one soldier to another once killed, ~scripted~ deaths where we know who we have impersonated, complete with name, surname, date of birth and death, one of the many fighters who gave their lives in the fight against the Central Powers. Storm of Steel is therefore a real tribute to the men who lost their lives in the Great War, just over ten minutes for a little mission that has the advantage of effectively immersing us in the climate of war, in the midst of the mud and the brutality of the combat. But then you leave the western front and the usual ~world tour~ begins, from the Italian Alps to the Arabian desert, passing through the skies and hills of France up to the bankruptcy landing at Gallipoli. All in the order we want. Thus having lost the bonds of the single story, the screenwriters were able to stage decidedly various ~small~ war stories, never banal pads in hand, but also rather short, which in fact can be completed in about five hours at a level normal. The duration is not exciting, of course, but these stories make us passionate about the protagonists, and although they are ~canonical~ in their development, without actually taking your breath away or particularly unforgettable moments, they are in fact fun. They won't remain as impressed as the most iconic phases of the ~historical~ Call of Duty set in World War II, but playing them is a real pleasure, also thanks to a breathtaking visual aspect where the Frostbite engine exaggerates without fear of dazzling us with special effects. In fact, they all have one particularity, they are not tied to their typology: for example, both the ~air~ and the ~carriage~ history have sections on foot. But above all in various moments Battlefield 1 abandons the more ~caciarone~ spirit, to propose phases with a stealth vocation, then expanding these mechanics into the gigantic sandbox (never was a more fitting definition) totally free of the Arabian desert or in the solitary race towards the fortress of Gallipoli . In this sense, Italian history is the most ~classical~ one, but it is still decidedly enjoyable and epic as never before, despite the presence of a sort of Terminator ante litteram. It is therefore a bit of a pity that the artificial intelligence is decidedly basic, showing limits in the threat research phases and often remaining impaled in the open. It doesn't completely ruin the gaming experience, but it's all too easy to take advantage of its shortcomings at times. And given that stealth is encouraged, it is really a critical issue with which we must deal. In short, play hard. The beautiful side of war We wrote it several times during this long journey that led us to the review and we are happy to repeat it now: Battlefield 1 is a real show, whether played on PC by Master Race or on consoles. Setting aside for a moment the added value given by the full-bodied and rich environmental destructibility (and related particle and volumetric effects), what is striking is the credible environmental reconstruction, and the whole system of lighting and refraction of the surfaces. Look at the sun reflecting on puddles or on the metal parts of weapons, you get blinded once you leave a building. But above all, enjoy the flight over the London sky, with the sun's rays filtering through the thick clouds, for a truly breathtaking, almost romantic visual picture. And as usual, we cannot fail to praise the audio sector: Battlefields are the paradigm for all first-person shooters, and this one is no exception. The weapons have real, real sounds, very different from each other; in addition to the explosion, it is almost possible to hear the metallic noises when it is reloaded. Really engaging indeed. The Italian dubbing is good, without particular acting peaks, and the music is good, evocative or enthralling as needed.", "date": "2016-10-17", "grade": "9.0"}