{"name": "Robot alla riscossa", "ref": "https://multiplayer.it/recensioni/175213-the-playroom-vr-robot-alla-riscossa.html", "text": "Three years after the first time, The PlayRoom is back in the limelight to show the potential of a new Sony device, just like the PlayStation Camera in 2013. While PlayStation 4 began to populate European gamers' homes, the owners of this renewed motion detector they could in fact dabble with some mini-games related to the interaction with small robots. Now as then, the arrival of PlayStation VR in stores has also been accompanied by The PlayRoom VR, an interesting collection that uses virtual reality to create fun and original experiences. Let's find out together! The PlayRoom VR is a fun collection of minigames, with some really cool ideas! The robot revolution ~Escape from the Monster~ is the first of the five minigames offered by The PlayRoom VR that we have tested: here the wearer of the viewer is called upon to impersonate a sea monster, within a party game that exploits the potential of asymmetrical multiplayer, which, as we shall see, it is a constant of the whole package. Up to a maximum of four other players can thus join the game, using the traditional controllers and driving as many AR Bots, the iconic robots already seen in the original game, on a daring city escape. The monster's task is to hit the fugitives with debris, obtained by literally breaking the buildings and vehicles it encounters on its path. If he fails, at the end of the journey the roles are reversed, and the monster finds itself being hunted in turn. All in all, the concept is very simple and does not have great pretensions in terms of longevity, but if you exchange the viewer, it can easily fill an evening with friends. The same goes for ~Cat and Mouse~, a variant of the traditional ~One, two, three, star!~. Here the player with the viewer is a cat, intent on chasing robo-mice hunting for cheese. To do this, he must suddenly emerge from his hiding place and catch the mice in the act. On the other hand, the mechanism of ~Wanted~ and ~Haunted House~ is different, two mini-games that follow, in a more simplified way, the dynamics of the excellent Keep Talking and Nobady Explodes. In the first, a rather careless sheriff is wearing PlayStation VR, who enters a Far West inn without knowing the face of the criminal on duty. Players without a viewer can instead see the poster of the wanted man on the TV and for this they must provide the sheriff with an identikit as precise as possible, highlighting the characteristic features of the scoundrel. The difficulty then increases with each catch, also thanks to patrons dressed in an increasingly articulated way and with differentiated particular signs. Simpler, but based on the same principles, is ~Haunted House~: here the viewer is worn by a new Ghostbuster, unable to see the ectoplasms inside a haunted house. It is then up to the group of participants without a controller to describe the exact point in the room where the ghost is and, based on these indications, the Ghostbuster must aim his proton rifle with precision, and then fire the beam with a tap on the touch pad of the controller. A miniature platformer ~In search of robots~ represents the least long-lasting experience of the package offered by The PlayRoom VR, but it is also one of the most interesting in the future. The player is here called to find the AR bots lost by the arrival of the evil robot, within a short platform level that takes up the structure already seen in Lucky's Tale. However, the guys from Japan Studio managed to bring together several unusual mechanics in a single stage for a couple of minutes: not only, in fact, the third-person view allows you to lean over precipices and find secret areas, but also the DualShock 4 is in aid of the little protagonist, allowing the player to make the AR Bot walk on a rope, shot at the touch towards special supports and whose height is adjusted using the gyroscope integrated in the joypad. There is also room for a second player who, aboard a ship, can rescue his partner by sucking in and shooting enemies with a vacuum cleaner. Finally, in addition to the games, there is also Mini-Bot, a virtual room where the tokens earned by playing can be invested in a ~claw crane~, the classic claw with which to grab stuffed animals and other objects in the arcade. The device contains several small dioramas, which allow you to populate the room with AR Bots intent on dabbling in multiple activities. In the light of these contents, we cannot therefore recommend The PlayRoom VR to all owners of the Sony viewer, given that it performs itsdemonstration function in an exemplary manner. Our PlayStation VR review In the last few days we have been able to test PlayStation VR extensively with all the launch titles. For an overview of the whole offer you can review our long live broadcast. If, on the other hand, you want to read our opinion on the peripheral, go without delay and consult the review.", "date": "2016-10-16", "grade": "7.2"}