{"name": "Evolution GT - Recensione", "ref": "https://multiplayer.it/recensioni/evolution-gt-recensione.html", "text": "Tell me who you are and I'll tell you how you drive Let Gabriele wait a minute longer, just long enough to discover the alternative to Career mode, which consists of the always popular Corsa Veloce: choose a car, a circuit and the weather conditions. What follows is pure arcade, immediate and uncomplicated. Well now we are ready for Career Mode. Here it is important to immediately understand the initially most difficult aspect of the game to assimilate, namely that the pilot is not you in the strict sense, but your virtual alter-ego, and that its characteristics will influence the gaming experience to the point such that what you are able to do behind the wheel will not be enough. The reason is very simple, we talked about it at the beginning, Evolution GT is a role-playing game and in every self-respecting RPG the dress makes the monk. The phases that represent the first step towards the creation of the character are all there, starting from the choice of the class, available in five different attitudes: Aggressive, intuitive, unperturbed, versatile and reliable pilot. The versatile one represents the neutral class, without any particular sign of distinction, while an aggressive driver, for example, manages to make his opponents lose their temper, but makes up for mistakes with difficulty. The more observant will wonder what it can mean to be able to recover from a mistake beyond one's personal abilities, but this is where the Tiger Effect comes into play, to which we have dedicated a separate box due to the originality of the concept underlies. the pilot is not you, but your virtual alter-ego Tell me who you are and I'll tell you how you drive If the piltoa represents the coffers, we could equate the team choice to the race, since each team is associated with one of the driving styles, reinforcing its positive sides and further penalizing its weaknesses, even if any association is legitimate and will significantly influence the growth of the character. The last obligatory step is the distribution of two skill points to be positioned by choosing whether to improve acceleration, braking, perception and other parameters relating to the skills that being a driver entails, also because you will realize how much the experience of play is directly related to the growth of these skills. But now we're here, it's time to get on the track and realize what Evolution GT offers when the traffic light turns green. Please pass me Career mode naturally consists of a series of races that can be played on different circuits, which are unlocked by managing to conquer a position on the podium, but the growth along the way is fortunately not so linear. Each race, whatever the result, allows you to accumulate experience points by testing yourself in difficult braking or by successfully completing many overtakings. Of course, winning a race and finishing first involves a very high total of experience points. The problem is that the opponents also make their way in the same way and if you start losing many races you will see that whoever arrives first starts to accumulate an advantage in terms of levels such as to make him a real nemesis to be taken into consideration during the championship . Nonetheless, you can always rely on the Challenges, which can be tackled at any time between one race and another, which consist of specific tests, 25 in all, very demanding and aimed at improving a specific skill associated with your driver. Winning Challenges is a key factor in keeping you competitive, as is of course crossing the finish line first and getting extra clothing accessories that add further bonuses to the character you play. Please pass me The races are totally arcade challenges, which implies a total absence of any customizable set-up of the car, even if the driver's skills will influence the ability to manage the loss of grip or the recovery after a sudden braking. Each competition on the circuit is therefore a race played favoring a direct approach, they leave the necessary space for the simulation to manage the physics of the cars in a credible way, which in any case takes into account the difference between the cars, which we remember meet within championships monobrand. However, if we take a quick look at the game screen, we immediately notice the presence of three indicators at the bottom left that account for some of the unique features of Evolution GT. the races are totally arcade challenges, which implies a total absence of any customizable set-up of the car Please pass me The first is an orange bar that measures our pilot's nerves or, in other words, his ability to resistre to intimidation. This is a very important factor, because the opponents can tail us at a short distance by increasing the tension of the driver, who will see the bar gradually reduce. If you are unable to evade the pressure, you will find yourself temporarily obscured by a heavy blur that will force you to slow down and give your opponent an easy overtake. It goes without saying that you too can and indeed you will have to do the same with those ahead of you on the track, thus pushing them to make a mistake: you will even see a blur effect appear if you manage to slipstream, even if it is more annoying than exciting for driving . The second bar is the Tiger Effect still available, while the last indicator immediately below measures the car's resistance to damage, which tells us how much longer we can afford to hit opponents or walls before definitively compromising the car. While this does involve the longed-for damage system, expect nothing more than two graphically visible stages, the worst of which shows us the rear window being shattered. If we compose many elements so unusual for a driving game, what do we get? This is the crucial question we're going to answer now, trying to highlight the inevitable weaknesses of a game that tests itself on hitherto unexplored terrain. A halfback championship No doubt Evolution GT is engaging and challenging, however detaching itself from the simulative meticulousness of Gran Turismo, as the Milestone title points in totally different directions, opposite on the arcade side and parallel on that of the concept, since today a role-playing game based on ran still had not seen. However, there are some shortcomings, the biggest of which seems to be the balance of difficulty in relation to the growth of the driver from one race to another. In fact, at each start we will always and invariably start last and there is no hope of reaching the first if we lose the opportunity to take the lead from the start, since the performance of the cars is identical and the skill of each driver does not reach such levels to allow us miraculous recoveries. This makes perfect sense, but seeing the first place finisher score points while you fall behind can cause a spike in difficulty that is difficult to overcome if you are not able to maintain the same level achieved by the driver ahead of you in the standings. This is not an insurmountable flaw, but a knot remains to be resolved if Milestone, as we hope, decides to continue this innovative path. Add to this the fact that you will not be able to avoid being victims of enemy attacks and seeing the anxiety that grows in your driver while you actually don't even see a car behind you makes you feel helpless in the face of the inevitable drop in sugar, with all that goes with it. Too bad for the total absence of an option dedicated to online gaming, while we will have to make do with an archaic and penalizing shared screen. In short, some elements still to be refined and made more flexible remain but overall the value of Evolution GT is undoubtedly indisputable. A halfback championship In case the images are not enough, we tell you that the Renderware game engine is fluid and convincingly renders the chrome of the vehicles, enriched by reflections and lighting always up to today's standards. Even the circuits do not disfigure for the details present and for an excellent rendering of the weather effects, in particular that of the wet on the asphalt. The soundtrack is instead decidedly anonymous and the presentation films are not very incisive, but here we are really nitpicking. Surely Evolution GT is a title that cannot leave driving enthusiasts indifferent, but precisely due to its nature oriented more towards role-playing than simulation it could entertain and interest even those who usually keep their distance from the wheel. However, we recommend a lap of the track to all video game enthusiasts in order to appreciate an original and all-Italian idea. Final comment Evolution GT is an RPG based on car racing, it is worth noting that. The idea of making your driver grow and having to rely on his specific skills as well as our skill behind the wheel is an intriguing and original novelty factor. Added to this are unique characteristics such as the Tiger Effect and psychological resistance, so that a gameplay destined to be repeated unchanged finds instead in the vision of an Italian team its possibility of being a source of inspiration for thefuture. Despite this Evolution GT is still an arcade title that can be enjoyed by anyone, passionate or not about car racing, who suffers from the lack of an online game mode but which still remains clearly above the average. If you get the chance to try it, don't hold back, you will immediately notice its uniqueness. Pros Innovative and original Unique game features Respectable graphic sector Cons Driver development system to be improved The absence of an online mode affects longevity The Eye of the Tiger The Tiger Effect is the element that more than any other breaks through as an experiment of an original concept, born from the idea of wanting to simulate the ability to anticipate events. It is in fact an indicator that decreases with use, with which it is possible to rewind the game action as if we were facing a slow motion of the race. In this way you can correct your mistakes and you soon realize that it is necessary to actively integrate the Tiger Effect within your game strategy, because this is the only way to fully enter the spirit of Evolution GT. Cross-platform Milestone is an official developer of Sony, Microsoft and Nintendo, a qualification that is earned by maintaining very high quality standards. It is therefore no coincidence that the PlayStation 2 version of Evolution GT looks good in front of the PC counterpart, with models graphically comparable to those of GT4 and without significant drops in frame-rate. Ultimately the choice between the two versions is just a matter of preference or personal availability for one platform rather than the other. Lead role Milestone is an Italian brand that has gone beyond national borders, deservedly earning a place in the spotlight of the specialized press around the world. In fact, it publishes the Superbike series under the EA label, to then return to Europe and develop Racing Evoluzione for Infogrames. It leaves behind successes such as Screamer and SCAR, to then reach 2006 and offer us a driving game that is finally refreshing, new and for once so original. A few flaws make themselves felt, but that's the least of it, because there is enough experience instilled in this Evolution GT to deserve it a place on the podium and considering the genre, which is very rigid in its parameters, it can only do it credit. I should actually take a step back, because we are talking about a driving game, when in reality we should define it as an RPG with driving elements. Confused? In fact, the bet is one that would freeze any shareholder, but luckily there is some visionary behind Milestone who isn't afraid to dare, and that's why I'm going to immediately illustrate the importance of wearing a Helmet +1 in Astuteness . First, however, a reassurance: the cars are there and they are all equipped with official licenses, among which the brands of Mercedes, TVR, Chevrolet, Volkswagen, Pagani, Seat, Opel, Renault, Alfa Romeo dealers stand out, ready to race on the European circuits of evocative and immortal destinations ranging from Berlin to Florence, passing through Barcelona, Milan and London. Just to name a few. But now let's get ready, because the driver Gabriele Tarquini will be our mentor during the tutorial necessary to learn the basics that regulate Evolution GT.", "date": "2006-04-25", "grade": null}