{"name": "Gli eroi della fantasia", "ref": "https://multiplayer.it/recensioni/175210-skylanders-imaginators-gli-eroi-della-fantasia.html", "text": "The annual appointment with Skylanders is now a solid certainty since 2011, the debut year for the Activision series. Skylanders Imaginators is consequently the sixth episode of the franchise, back in the hands of the Toys for Bob team in the usual development alternation with Vicarious Visions. The panorama of games belonging to the toys to life genre has undergone some jolts in recent times, starting from the cancellation of Disney Infinity up to the convincing entry of Lego Dimensions, without forgetting the proposal from Nintendo which with amiibo offered a slightly different solution. In all of this, Skylanders has tried to keep the bar straight, strong in its role as the authentic progenitor of this video game genre, but the sales data have witnessed a progressive weakening of user interest which has found its lowest point right in last year's chapter, with the albeit excellent SuperChargers which has just exceeded two million copies sold against the five or six of the most successful episodes. Obviously, therefore, that Imaginators represents a sort of test bed, intended to provide important indications on the very future of the series. Skylanders Imaginators brings interesting new features such as editors and RPG elements, but on the same formula My Skylanders Last year, SuperChargers had tried to renew the formula and add variety to the gameplay by introducing the vehicles, protagonists of ad hoc sections integrated within the levels and almost always very pleasant to deal with. Evidently with the desire to claim its autonomy in the development of the franchise, Toys for Bob has preferred to give all this a clean slate by relocating the main mode of Imaginators within the canonical original confines of the action platform: what for some could however, being seen as a step backwards can also be interpreted as a desire to keep the product more accessible and easily interpretable for the main user target, which obviously is that of kids. That said, however, it should be clarified immediately that Skylanders Imaginators is certainly not an episode without novelties: the main one is in fact linked to the possibility of ~untying~ from the canonical statuettes and creating a character from scratch through an unprecedented and versatile editor, which alongside the new Crystals of Creation. The latter are accessories to be purchased separately, at a price of around 9 each, and to be placed on top of the base: each of them is associated with an element, which will obviously be the one that will distinguish your Skylanders. Once the Crystal has been positioned, it will then be necessary to choose the preferred combat class, intended to determine characteristics, aptitude and attack skills, and then continue with the decisions relating to body parts (head, torso, legs, tail, eyes and so on). saying), size, weapons, voice, accompanying music, mottos and whatnot. The more patient and interested players in the editing aspect will then be able to choose the colors of even the smallest parts of the character, so as to finally create a truly unique and personal fighter. Each Crystal can only keep one Skylanders, and it is therefore evident how this can represent a substantial reason for spending when you want to make extensive use of the possibilities offered by the editor. That said, the most interesting aspect of the system devised by the Californian team is undoubtedly the continuous stimulus that is provided to rework one's character thanks to the availability of new equipment, but also body parts and so on, which is guaranteed by what is in fact a collection of loot that takes place by progressing in the adventure. In fact, the purple coffers, abundantly donated on different occasions, contain crystals of Imaginite, a sort of magical material capable of transforming itself into new objects and elements destined to enrich the list of those present in the editor. The color of the crystals distinguishes the rarity of the connected loot, thus making the collection even more interesting. In fact, at any time you can modify any characteristic of the character, or equip objects intended to improve its characteristics. Certainly the low level of general challenge makes this need not very urgent as regards the real extent of the changes, but it is very likely that younger players will find themselves appreciating this possibility regardless of this kind of considerations. On the other hand, Skylanders Imaginators is certainly not aimed at thirty-year-old Diablo fans, and this must always be kept in mind. Crash SenseiIn addition to the crystals, new real characters are the Sensei, more traditionally represented by statuettes sold separately and of more generous dimensions than the norm. These are creatures, some unpublished and some fished out by Trap Team's enemies, endowed with remarkable attack capabilities as well as the ability to increase the general level cap of their Skylanders. Furthermore, each Sensei is equipped with a highly spectacular special move, to be activated after filling a special bar. Obviously, as in every chapter of the series, the possibility of using any character released in the past is also guaranteed in Imaginators: however, the impossibility of equipping them with collected objects makes this function less intriguing, further pushing towards the choice of Creation Crystals. Then the choice to renew the way of accessing the levels through the presence of a freely explorable map (or, as it is called in the game, a M.A.P.P.A.) was apt. However, some levels remain the prerogative of characters of a specific element, making it still necessary to have at least one of each type in order to play 100% of the contents. While appreciating the work done by Toys for Bob with the editor and the introduction of RPG elements into the series, there is no doubt that the gameplay mechanics of Skylanders Imaginators are far too conservative: the progression based on combat and platform alternating with bland puzzle phases, begins to be accompanied by an extremely marked feeling of dj vu. If it is true that the recognition of a product of this type is an important element, it is equally true that the user base of fans of the first episodes has probably developed tastes and skills, and it would therefore be appropriate to propose new solutions to refresh the formula. Net of the possibilities related to the creation of the characters, Imaginators is in fact one of the least courageous episodes of the entire franchise, and this is an element likely to give rise to mixed reactions within its audience. From a graphic point of view, however, there are no major improvements compared to last year, nor substantial changes to the artistic style or settings: from this point of view, recognizing Imaginators at a glance is not so simple, but despite this it is however, a game with more than discrete technical virtues and which can be appreciated in every situation, especially on current-gen consoles. Finally, the choice to associate Skylanders Imaginators with a brand particularly loved by older players, namely Crash Bandicoot, deserves a mention. The peramele and Doctor Neo Cortex have in fact been inserted into the game in the form of Sensei, complete with a level dedicated to them which obviously recalls the atmospheres and sensations of the original titles: the result, albeit objectively a bit forced, can still at least snatch a smile to the fans of the historic Naughty Dog series, in the hope of a more than once hypothesized real new episode.", "date": "2016-10-16", "grade": "8.0"}