{"name": "Tutti per uno?", "ref": "https://multiplayer.it/recensioni/175199-playstation-vr-worlds-tutti-per-uno.html", "text": "The first time we heard about PlayStation VR Worlds we had no doubts: it would have been the classic collection of tech demos that manufacturers usually bundle with a new device, to give an idea of what it can offer. The London Heist, Ocean Descent, Scavengers Odyssey, VR Luge and Danger Ball are in fact the concrete manifestation in VR of five different genres and could have given the public a fairly clear idea of which experiences to buy in the future. Instead, PlayStation VR Worlds soon appeared in store catalogs and on the PlayStation Store at a price even higher than that of Batman: Arkham VR and Until Dawn: Rush of Blood, or 39.99 euros. But are these really five experiences that justify the price of the ticket? Our PlayStation VR Worlds review: Five demos sold for the price of a full game? Whiz, explore and marvel To break the ice we immediately jumped headlong into the busy streets of VR Luge. With a helmet on, we thus found ourselves on a wheeled sled, ready to face a vertiginous descent between cars, trucks and unexpected road obstructions. The game system here is quite simple and simply requires you to maneuver the vehicle with neck movements, while trying to reach the finish line within the time limit. The first seconds are adrenaline-pumping: the sense of speed is good, the bumps take your breath away and dodging a car at the last second gives you the creeps. It's a pity that everything is thwarted by the first impact: a lorry comes towards us while after a curve that is too wide and the crash seems inevitable, but... nothing happens: we pass unscathed through the wheels, which become invisible. Let's try a new collision: not even a penalty. Going against a guardrail then returns an equally alienating impact, throwing us back into the race with an unnatural rebound, which destroys even the smallest sense of immersion left. A similar description to that of VR Luge also applies to Ocean Descent: here we found ourselves exploring the depths of the sea, lowered to the seabed inside a cage. The first moments are quite fascinating, despite the voices of our companions who break the magic a little by trying to offer a narrative context: the variety of fish and the colors give the feeling of being immersed in a beautiful aquarium. However, more accurate graphics inevitably correspond to a proportional reduction in interaction: the player is in fact immaterial, he can only limit himself to moving his head while he is slowly lowered deeper and deeper. It also happens to come across a shark that comes close to devouring us, but what should be a tense situation leaves us completely indifferent: the pad does not vibrate, the attacks are predictable and, basically, the sensation is that inside the cage there is no there is nothing of value, much less our life. Even the contemplative component soon exhausts its charm and, with nothing to distract us, the defects of a technical sector that is in any case backward compared to modern standards begin to emerge. With Scavengers Odyssey there are some improvements, but the spatial experience is too short to represent an added value. Here we take on the role of an alien capable of controlling a large mech, which must go in search of a mysterious artifact. The initial phase is rather chaotic and, if experienced with the right frenzy, can cause ~motion sickness~ in the most predisposed subjects. The actual exploration phases are instead more comfortable: the movements are fluid and, by moving the view with the right caution, both the fights with the larvae and the leaps between debris and asteroids are overcome unscathed. However, the ~campaign~ ends in half an hour once again and the scenarios certainly do not stand out for their complexity or style. On the right track Of all the package offered by PlayStation VR, Danger Ball and The London Heist are the only ones to have left us something, even if the sense of incompleteness remains quite evident. Danger Ball is a sort of 3D variant of table hockey: in parallelepiped-shaped playing fields, we challenged artificial intelligence in rather tight tournaments, where the ball passed rapidly from one side of the field to the other with trajectories made unpredictable by rebounds on the ~ground~. The goal is to score five points before the opponent, intercepting the shots by moving the head, and then sending them back to the sender, loading them with effect with a lateral movement or giving them more power by leaning forward. Despite the simplicity and a minimalist graphic style, however pleasant, the best aspect of the production is undoubtedly the artifi intelligencecial. The opponents are in fact capable of special shots, which make the challenge quite challenging. It is a real pity, therefore, that these particularities are rather limited and that the player cannot in any way customize his own style. Despite a B-series action movie plot and a technical sector full of gaps, however, it is The London Heist that has thrilled us the most. Although perhaps the word enthusiasm is excessive in this context of widespread mediocrity. So much so, however, that the heist developed together with a local gangster and another of his henchmen manages to give moments of pure fun and takes full advantage of both the Move and our movements in reality. The shootout in the Russian boss's office had us dodging bullets with our heads, hiding behind a desk, and then striking once the barrage was over. The subsequent getaway in the van was just as fun, and we found ourselves frantically shooting at the wheels and tanks of the enemy vehicles with our UZI machine gun as we switched the gun from hand to hand, consuming clip after clip. Among other things, the reloading mechanism is also intelligent and the interaction in the interlude scenes anticipates an interesting evolution of the quick time event. However, the problem is always the same: the action phases run out in a few minutes and the presence of three alternative mini-finals ends in the short and not very interactive final scene. The interactions are then too limited to a few possibilities decided by the developers (why is it not possible to smoke a cigar or set fire to a bag with a lighter?). An all in all decent graphic quality is finally thwarted by heavy problems in visual management, which tends to deform the scenarios during some movements, giving back an annoying sense of vertigo. Our PlayStation VR review In the last few days we have been able to test PlayStation VR extensively with all the launch titles. For an overview of the whole offer you can review our long live broadcast. If, on the other hand, you want to read our opinion on the peripheral, go without delay and consult the review.", "date": "2016-10-15", "grade": "4.5"}