{"name": "Batman Arkham VR", "ref": "https://multiplayer.it/recensioni/175109-batman-arkham-vr-il-cavaliere-investigativo.html", "text": "PlayStation VR is finally available for all those intending to try virtual reality on consoles and with it a decidedly new and intriguing experience, also unripe and evolving as the technical characteristics of the viewer attest, together with the launch titles. After a few hours of testing, we can tell you that Batman Arkham VR is one of the most interesting, a tailor-made experience for the Sony viewer and available at a price of 20. The Dark Knight, by definition, represents an excellent business card for the hardware on which it runs, it is certainly part of a videogame and cinematographic world perfectly in line with the characteristics that a product designed for virtual reality should offer: involvement, charismatic setting, participation with what happens on the screen. Rocksteady Studios, the same ones that developed the excellent Batman: Arkham Knight, managed in a short time to find the crux of the matter, net of some aspects that could be improved and a duration of the adventure that could have been greater. Batman Arkham VR is one of the best PlayStation VR launch titles, we have reviewed it for you In search of the lost clue Batman Arkham VR is based precisely on the adventure genre, which practically takes up the Detective mode present in the ~2D~ counterparts to propose a piece of history set in Gotham, like an episode from a TV series, with the interactions linked above all to the finding and solving puzzles. The first thing to do, in any case, is to calibrate the Sony viewer with PlayStation Camera: the title offers the possibility of playing standing or sitting, recommending the first configuration because there are several moments during which you have to stretch your hands towards the Bass. Using two PlayStation Moves, optional but in our opinion highly recommended, instead of the pad, to enjoy maximum naturalness and identification with the movements of the Dark Knight. Compared to other VR games we took a bit more time to calibrate, since in the standard position you need to be perfectly aligned with the camera in order to have a correct proportion of your character with the game world: make sure you have some space around you, a meter or so as a radius should be sufficient. Batman Arkham VR begins with the flashback that we have seen several times in the various videogame and non-videogame transpositions, that is to say - spoilers! just kidding - the killing of Bruce Wayne's parents. Immediately afterwards you are catapulted into the present inside the wealthy billionaire's villa, in which Alfred is and it is possible to interact with some objects in the main hall, including the piano. The latter reveals the passage to the batcave, the most interactive place where there are several stations that allow you to manage the technological equipment in Batman's possession. Needless to say, we felt the first jolt when we put on the suit and looked in the mirror, with the classic natural movement of putting on the three available gadgets piece by piece: grappling hook, forensic scanner and batarang. The narrative premises tell of the disappearance of Robin and Nightwing, with the need, therefore, to identify their last known position. To move from one location in the cave to another you need to use the grappling hook, extracting it from the right side of the belt and then pressing the T key on the Move. After consulting a computer containing the information of both, complete with a holographic model showing different poses for each, we had access to Nightwing's position, thus ~unlocking~ access to the batgarage. Very nice is the option to choose which means to initially move between the batmobile and the batwing, with the possibility of placing them in front of Batman to rotate them and appreciate their excellent construction. Before leaving the batcave, however, it is possible to carry out a whole series of actions to deepen the narrative part, such as consulting the database of villains and obtaining a detailed description for each one and a 1:1 model reproduced in front, viewing some recordings, analyze your own blood, after extracting it, and that of people infected with Joker's blood, always in an interactive way using your own hands to perform the aforementioned actions. And again, reassemble some puzzle pieces left by the riddler and perform in a timed race in which you have to throw the batarang towards some targets. Continuing in the story we reach the place where there was a scuffle between Nightwing and a mysterious character: at this point you have to rotate yourscanner forward or backward to review what happened, then analyze the point where a fracture was caused or where the suspect left fingerprints, perhaps moving from one point to another to better see what was happening. We stop here to avoid further spoilers, but for example in another situation you have to analyze some corpses, use the scanner to reveal codes and physically put the pieces together to find the position of the next objective to reach. There's enough variety in that sense, and you really feel like you're a firsthand participant in the story as the masked knight, who occasionally comments on what's happening. True action is proper there is none, as stated a few lines above, when due it is only sketched or reproduced only through sound; for example, to move from one point to another, the T trigger of the Move is used for a quick sprint, at most you need to throw a batarang to activate a gear or create a diversion. A design choice in order to avoid problems related to precision linked to fast movements, which among other things require non-trivial ideas to be fun; however, everything else works and the investigation part is done very well, it is engaging and thanks to the VR it allows you to have a different experience from the classic canons to which we are used to. Unfortunately, after a period of time between 60 and 90 minutes, depending on how much you ~fool around~ with the in-depth activities, you reach the end of an adventure that is well written even in the script phase. In case it is possible to replay specific chapters with the addition of 30 secondary missions in the form of riddles created by the Riddler, together with the possibility of unlocking further aircraft, seven, and interactive biographies of Batman's companions and adversaries, for a total of twenty . Replaying at least a second time is therefore highly recommended, but even so the price of 20 is high: from our point of view a duration closer to 3-4 hours, even with this game structure, would have easily held up and given us a product to be recommended without any reservations. Batman Arkham VR is developed with the Unreal Engine 4 graphics engine and, also given the ~static~ nature of the adventure, the glance is decidedly good, net of a lower resolution than what we are used to seeing in titles without viewer. The game world has good detail, the grid effect typical of VR is reduced and indeed appears to be more of a cinematic grain than anything else. Characters, aircraft and structures have an excellent polygonal mass, which makes them defined and pleasant to see even from close range. The VR effect is equally valid, a result obtained thanks to the interactions proposed with the game world and the technical sector: in a few moments one is immersed in the setting and forgets from the rest, with only the field of vision that can be improved by PlayStation VR (the typical porthole effect on the sides) to remind you that the real world is out there. 3D audio does its job of increasing immersion by positioning the sound according to your position relative to the source; ultimately, the overall impact is pleasant, certainly among the best we have seen in this first round of titles available for the Sony viewer.", "date": "2016-10-13", "grade": "7.8"}