{"name": "La mafia pi nera", "ref": "https://multiplayer.it/recensioni/174991-mafia-iii-la-mafia-piu-nera.html", "text": "A lot has been said about the Mafia in the past. The first chapter, the progenitor, has remained imprinted in the heads and hearts of many players for its very strong narrative charge, for an absolutely non-trivial plot and with a truly audacious epilogue and for a gameplay which, despite a strong basic linearity and some passages too repetitive, it was well blended in all its components and pleasant for the entire duration of the product. The reception given instead to its sequel was completely different: a Mafia II that took on an even more cinematic cut, a certainly more adult story albeit broken up by a handful of trivial missions and above all a gameplay that began to veer towards the 'open world despite some important technical limitations. The title literally broke critics and the public in two between those who managed to appreciate it despite everything also and above all thanks to the story told and those who could not digest that a sequel could distance itself so much from the original title in terms of mechanics and writing style. However, both titles were destined to suffer from the same evil: sales below expectations in the face of a long and troubled development. Mafia III has also been said a lot in the past. A game that has repeatedly ended up in the rumor mill due to alleged leaks and which for years has apparently been under development in the offices of the original team: the guys from Illusion Softworks which later merged into 2K Czech following the closure of the software house. In fact, we had to wait until last year's GamesCom to discover that a brand new team, Hangar 13, had been set up by 2K Games to take the reins of such a complex and full of expectations project. And so if on the one hand we have tried to follow the tradition of the series by implementing the usual change of protagonist, city and time period, on the other hand we have also tried to face the tortuous and dangerous road of the total modification of the gameplay which in occasion of this third chapter turns completely towards the open world free roaming. Because we say it right away: Mafia III is in all respects a Grand Theft Auto (more IV than V) set in the late 60s in a fictitious city, New Bordeaux, strongly inspired by the famous Louisiana city, New Orleans. But be careful not to let go of prejudices on the basis of this powerful and heavy comparison: the new work of Hangar 13 is a pleasant and, after all, even original game for some design choices and its defects, which we will address in the course of the review, not they derive (or at least not only) from his contemptuous desire to approach Rockstar's masterpiece. Mafia III is an excellent game in terms of narrative, but it is a pity that it suffers in terms of gameplay From mafia helper to ruthless killer Lincoln Clay is our avatar. A big black boy with Italian origins, a veteran of Vietnam where he stood out for some exemplary war gestures that also allowed him to earn some medals. Orphaned in his youth, he spent his adolescence poised on that fine line between legality and illegality typical of someone who has very little to lose and has to build friends and family on the road. Soon adopted by the black mafia, Lincoln will find himself, once he returns to his city, taking part in events much bigger than him and in the moment punctuated by a gunshot, losing all his affections at the hands of the ruthless boss of the Italian mob in New Bordeaux, Salvatore ~Sal~ Marcano. After a long stay in the loving care of the parish priest James Ballard and under the supervision of CIA agent John Donovan, Clay is ready to carry out a violent and bloody revenge with the aim of dismantling the criminal operation of the Marcanos and to kill his breadwinner. The narrative component is, without a shadow of a doubt, the most successful part of Mafia III thanks to directorial tricks and precise management choices of the story that refer to cinema verite and the most modern documentaries. The story is in fact told as a sort of great flashback where the gameplay sequences are interspersed with interviews and statements of the protagonists collected years after the facts. The result is really interesting and manages to keep the player's attention high until the epilogue, which arrives after a scant twenty hours, taking advantage of very high quality cutscenes. The early stages of the game in particular stand out for the perfect fit of all the mechanisms involved. In fact, Mafia III starts as a long tutorial where the open world component is in the background: there is but it is never actually offered to the player who instead limits himself to following theprologue thanks to a story that goes hand in hand with the gameplay by discovering characters, controls, game features and so on. From the precise moment in which the crime that will act as a narrative ploy to justify Lincoln's desire for revenge takes place, the game transforms and begins to offer its entire gameplay without filters. The new objective becomes that of assassinating the nine generals of Salvatore Marcano in order to undermine his power over the splendid town from the foundations and thus be able to reach him now weakened and with no more allies to cover his back. To do this we will have to take control of the various districts into which New Bordeaux is divided by facing a system of primary and secondary missions which, at least on paper, seemed able to offer a minimum of originality to the classic management of the quests of each open world. In reality, this system works, unfortunately, only up to a certain point. Reached a new neighborhood we immediately become aware of the two henchmen who manage the local racket on behalf of the final target to be assassinated. To get them out into the open we will have to damage their criminal activities by completing a whole series of secondary micro-missions. At that point we will be able to face the two criminals, one at a time, within a slightly more substantial mission. Once the two unwary have been killed or recruited, the neighborhood boss will come out and we will be assigned a decidedly more intense and profound main mission and very often with a new mechanic, which will obviously end with his elimination. Repeat this routine for each of the nine districts that make up New Bordeaux and you will have understood in an instant what the gameplay of Mafia III is all about. In reality there are some small exceptions related to the management of our affiliates with consequent further secondary missions, but we will come back to this a little later. The knots come home to roost The problem is all inherent in these secondary micro-missions which unfortunately prove to be extremely basic and above all very repetitive. In fact, conceptually they are based on two archetypes grafted on the peculiarities of the districts: reach and kill or interrogate a person hidden in an alley or in a structure, or reach and destroy one or more objects hidden in an alley or in a structure. Depending on the neighborhood we may have to deal with pimps, or with drug dealers or, again, with scammers but the basic system is always the same. As if this were not enough then, the quests concerning the killing of the two criminals who manage the rackets are almost always carried out within settings that we have already explored during the micro-quests with an annoying recycling effect of the settings which can sometimes even become frustrating. This general feeling of repetitiveness that runs through and punctuates the whole game then goes hand in hand with the other highly critical element of Mafia III: the artificial intelligence of the enemies. Most of you readers will have seen the dozens of videos that crowd the web also following the controversies that arose around the release of the game and even our live shows have shown deficiencies in this sense and unfortunately we also have to confirm in the review that on the guys from Hangar 13 didn't do a good job on this front. The title stimulates and rewards the player to use a stealth approach to missions, the problem is that in doing so all the deficits of an AI come out which struggles to properly manage both the patterns of the patrols and the consequences in assisting the protagonist as he commits a kill. Enemies often fail to see Lincoln crouched half a meter from them because he is ~covered~ by the corner of a crate or, on the contrary, they are activated by a silenced gunshot fired in a very distant point of a house. It is then also possible to collect the corpses to move them, to denote an even deeper mechanic than necessary but we really happened to carry out this operation a minimum number of times since the ~single file~ stratagem works perfectly. It's basically possible to clear out an entire apartment by simply hiding behind a door, calling a guard with a whistle, killing him in stealth, and waiting for the next one to come along to check. All in a continuous loop that only ends when the enemies have been completely eliminated. From this point of view, the mechanism that regulates the intervention of the forces of order is also exemplary: they are absolutely ruthless only towards Lincoln and while he is on board a vehicle; on the contrary, the policemen seem to go dumbfounded in the momentwhere you get out of the car and enter an alley on foot. At that point, as if by magic, the police will almost completely stop looking for us, continuing to wander around the main road, often creating tragically funny scenes and choreographies. We don't want to rage further but really the problems are all, only, in these two areas since for the rest Mafia III remains a really pleasant title to play. We have just mentioned Lincoln's affiliates. We are talking about Cassandra, Burke and Vito Scaletta (yes, he, the protagonist of Mafia II) who during the first hours of the game will join our avatar to manage the neighborhoods that we will decide to entrust to him after having conquered them. Their use is quite interesting since they will give access to a whole series of bonuses and upgrades depending on the income that we will be able to make them generate. These collections will depend both on the number of districts entrusted, and on some small secondary missions that we will be able to carry out on their behalf. The system is very interesting and will force us to keep their loyalty high without disadvantaging one of the three affiliates too much, under penalty of his rebellion but, at the same time, if we limit ourselves to dividing our conquests equally, we will not be able to unlock the biggest bonuses. Before moving on to the technical aspect, let's spend a few more words on vehicles and covers. The former are quite standard both in GTA-like management (there are also motorboats) and in their extremely arcade and ~light~ handling. They are damaged credibly during accidents and shootings even if the deformations of the bodywork always remain minimal and the game also implements a system for upgrading the various aspects of the vehicles with transversal customization on all vehicles, not made ad hoc for each stolen car. Nothing particularly original even as regards the coverage on which the guys from Hangar 13 have done the task without particular flashes. It is button-activated, allows you to ~stick~ to any obstacle or element of the scenario and also allows blind fire. Precisely wanting to nitpick, we were not convinced by the system adopted to move from a shelter to a neighboring one given that you have to move the analog in an unintuitive way and press a key for a long time with the result that you find yourself very often out of cover instead of taking cover behind the next one. Technically problematic? Leaving aside all the incredible debate around the issue of locked frame rates and poor optimization of the game, which we will discuss in a future study of the PC version, we must emphasize that Mafia III seems to have the typical two faces of video games that came out before their real completion. Not only from a gameplay point of view but also in technical terms. In fact, on PlayStation 4 the title enjoys good fluidity and although it never fully reaches 30 frames per second, it is always perfectly playable and very stable. Certainly more than what Rockstar did with Grand Theft Auto at the time of its release. New Bordeaux is crafted with care and offers an excellent variety of environments and architectures. It is also very vast and the visual horizon is quite wide and able to offer splendid views. Then there is the dynamic day / night cycle and the variable weather. At the same time, however, the lighting often exhibits anomalous behavior with the sudden transition from night to full light when outdoors or due to the presence of an enormous number of areas and elements of the scenario that undergo wrong reflections and refractions. The character models are splendid and very well animated in the cutscenes while all the secondary ones have a decidedly low quality like most of the textures used in the interiors and in the secondary elements of the scenario. And then there are the bugs which, despite the day one patch, heavily affect the game. Fortunately, during our entire testing we did not encounter any blockers nor did we experience crashes or freezes, but the bottom line remains a ~dirt~ and a lack of optimization that could certainly have been solved or greatly mitigated by offering the team a few more months of polishing . The sound aspect is completely different with an absolutely exceptional soundtrack, full of licensed tracks and also enriched by conversations, news and commercials that play on the radio. This musical carpet blends perfectly with the artistic cut extremely faithful to the time and which shines not only in the reconstruction of New Bordeaux and the events that take place in its streets, but also in the care placed in the numerous collectible ch", "date": "2016-10-11", "grade": "7.8"}