{"name": "Deathverse: Let It Die", "ref": "https://multiplayer.it/recensioni/deathverse-let-it-die-recensione.html", "text": "The original Let It Die was a bizarre project, probably born from the desire of GungHo Online Entertainment to somehow exploit the visionary genius of Goichi Suda by creating a game that possessed those peculiar features typical of the Japanese game designer's productions. The end result was a title that undoubtedly had something to say in terms of personality, but at the same time found itself living with a long series of unpleasant limitations. The Japanese publisher evidently considered the results achieved with that first experiment to be satisfactory, given which considered the intellectual property in question worthy of a new episode, however no longer entrusted to the Suda51 team but to Supertrick Games, a small studio (albeit made up of former Grasshoppers) in its first real experience with a title for PC and PlayStation. How did it go? We reveal it to you in the review of Deathverse: Let It Die. Story: an unforgiving world Deathverse: Let It Die, the idol-style presenter Let's start by saying that the setting of Deathverse: Let It Die has its own reason: a terrible cataclysm devastated the planet in 2026 and the society born from that disaster has become barbaric, to the point of feeling the need to satisfy one's thirst of blood through reality shows whose contestants face off in an arena, armed with clubs, swords and hammers, with the aim of killing each other. It's the Death Jamboree: a challenge that sees sixteen desperate people catapulted into a scenario in watertight compartments, each characterized by different geometries, platforms and self-destruction mechanisms that over time force you to move from one area to another, as in the best tradition of battle royale, making direct clashes more frequent until the crowning of a sole survivor and winner of the match. The two conductors of the show (a corpulent fop with gold teeth and a sort of idol with a mechanical arm) represent the artistic soul of the project in their fascinating strangeness, a noteworthy incipit that however remains an end in itself , confined to short sequences that do not affect the style of the actual game in any way. Unfortunately, the latter is made up of extremely generic assets and characters, devoid of any character that is not related to the aesthetic objects and skins that can be obtained by spending the points and resources obtained during the games, or by putting a hand in the wallet. From this point of view, a clear and convincing direction is missing, replaced by the confusion of a sketchy hodgepodge. Gameplay: all against all and little else Deathverse: Let It Die, two players face off Deathverse: Let It Die currently includes only one mode, the free-for-all we just talked about, available in a normal or classified version, as well as training and tutorials: too limited a budget for an experience that is having to compete with decidedly more famous products which, over time, have received a lot of content in order to increase the variety of the action. The core of the experience lies in the combat system, which is put to the test of facts undoubtedly as the most successful aspect of this production. In fact, our fighter can wield different weapons (albeit strictly for cutting or blowing), deliver fast or slow blows, perform finishers on dazed opponents and attacks from above, activate special moves and rechargeable abilities. Deathverse: Let It Die, the mysterious killer who presides over the scenario To defend ourselves we will have an energy shield available that resists a certain number of hits and a lateral swerve, but the philosophy behind the clashes revolves around timing and openings to prevent things from going too long. So once you enter the enemy's guard, you can inflict huge damage on him, worrying only about any counters or a retreat that provides him with time to recover. The games are very fast and you can't stop too much, given that in a random we will be able to end up in the target of a mysterious sniper who will start chasing us within the area in which we find ourselves. In short, the system itself appears fairly solid, the arsenal has tools that are also very different from each other and the impact yield is immediately good: it is fun to hit and the scenario lends itself to different strategies, but repetitiveness is inevitably around the corner. Technical realization: few ideas but confused Deathverse: Let It Die, the editor screen for the character Let's go back to talking about Goichi Suda for a simple reason: with him directing Let It Die we found ourselves among thehands a technically modest product but with some flashes capable of adding a pinch of personality, which unfortunately does not happen with Deathverse: Let It Die. The aesthetics of the TV show and its two bizarre presenters are captivating, but the in-game graphics are really dull and frankly have nothing to do with the potential of new generation platforms. What moves on the screen is not convincing, in short, and the 60 fps do not even prove to be unshakable given that in some moments there is some annoying stuttering phenomenon. Added to this are the weaknesses of the matchmaking that send the game into a loading loop from which it is only possible to exit by closing the application and restarting it. Finally, the sound can count on some nice tunes and little else.", "date": "2022-10-26", "grade": "6.0"}