{"name": "Rise of the Tomb Raider: 20 Year Celebration", "ref": "https://multiplayer.it/recensioni/174925-rise-of-the-tomb-raider-20-year-celebration-un-bel-modo-di-festeggiare.html", "text": "As explained by Crystal Dynamics at the time of the announcement, there were concrete reasons behind the exclusive time agreement that has tied Rise of the Tomb Raider to Microsoft platforms so far. PlayStation 4 owners were able to while away the wait, so to speak, thanks to the extraordinary Uncharted 4: A Thief's End, but it is clear that they would have liked to get their hands on the new Lara Croft adventure at the same time as Xbox One users and PC. A year later, it is therefore time to celebrate the game's debut on the Sony console with an edition created for the twentieth anniversary of the iconic character, never so rich in content and at a reduced price. Rise of the Tomb Raider: 20 Year Celebration is a title of extraordinary quality, engrossing and full-bodied My name is Croft. Lara Croft. The single player campaign of Rise of the Tomb Raider puts us in the shoes of a more mature and aware Lara Croft than at the beginning, determined to find the legendary Divine Spring: a relic that her father has searched for years without success, exposing himself to criticism of public opinion and eventually committing suicide. A mission with precise meaning for the girl, who thus wants to restore her family's reputation and finally find answers to the questions that have consumed her parent. The first game sequences take place on the snowy peaks of a Siberian mountain, where Lara and her friend Jonah went following the discovery of clues with which the young explorer came into contact in Syria. The Syrian scenario is the protagonist of a consistent flashback after the ice climbing phases and some highly spectacular scenes, but everything contributes to completing a tutorial that starts exactly from what the character's abilities were at the end of the previous episode. The platform mechanisms have been refined and made more varied, just as an interesting stealth element has been introduced that allows you to face enemies in different ways, taking them from behind or silently hitting them with an arrow when they are on the sidelines, or engaging in fierce battles fire. In these situations, a good artificial intelligence of the opponents is highlighted, who lurk from a distance, change position, throw grenades to flush us out or, taken by frustration, advance with their heads down. When this occurs, unfortunately, two defects of the combat system come to the surface that have not been resolved in the passage on PlayStation 4, namely the lack of awareness of the enemies and a certain difficulty in aiming from a short distance, an inconvenience which also occurs during the hunting trips. In this regard, the very element of hunting, which in the reboot ended up being simply sketched out, finds new outlets and uses in Rise of the Tomb Raider, multiplying the pitfalls that can be encountered while exploring the forests. The adventure, the real one Just like in the first chapter, Lara Croft's new adventure does not have a predetermined progression, but uses a rich sandbox to multiply things to do and see. Each of the scenarios presents collectibles to collect, maps, testimonies, artifacts to study in Greek and Russian which lead the protagonist to refine her knowledge of these languages in order to translate the inscriptions on certain monoliths and highlight an even greater number of points of interest on the map. There are extra missions that we will be able to take on, which revolve around the destruction of electronic devices or the discovery of prisoners, but it is the tombs that represent the most fascinating part of this substantial side dish. In fact, once we have found the entrance to the location, we will have to go underground by following tunnels or diving underwater, until we arrive in an area that requires the resolution of complex environmental puzzles so that we can finally access the manuscript kept there and obtain so an extra skill. Since the package already includes all the DLC released for the previous versions, from the location of the Russian base we will be able to follow the traces of the additional mission ~Baba Yaga: The Temple of the Witch~, which sees Lara meet a girl, Nadia, determined to save her grandfather from an apparently cursed place, protected by a terrible witch. But what is the truth? Without wanting to anticipate anything, the story of this small but very enjoyable expansion is really worth living, whether you do it in the middle of the campaign or after completing it. Finally, to all these aspects is added the protagonist's enhancement system, which through the unlocking of skill points and the collection ofmaterials and projects can improve their skills within three different categories (combat, hunting and survival), according to the priorities that we want to give to our experience; as well as enhance the weapons that make up his arsenal in various ways: from the various bows to pistols, from machine guns to rifles, passing through the other elements of equipment. We go back home We have said that Rise of the Tomb Raider: 20 Year Celebration stands as the richest edition of the Crystal Dynamics title. The developers have included all the downloadable content released on Xbox One and PC in the package and added further innovations, starting with the ~Blood Ties~ mode, which sees us explore the Croft Manor, Lara's home. After the father's death, in the absence of a specific will and given the mysterious circumstances of the mother's disappearance, the protagonist's uncle threatens to take possession of the estate and our goal will be to explore it far and wide in search of useful documents to avoid this occurrence. The mission lasts about an hour if completed without paying too much attention to the numerous texts and recordings scattered around the manor, some of which, however, must necessarily be analyzed to obtain useful clues for solving a couple of puzzles. There are no fights or platform phases: the one that the developers have inserted in the ~Blood Ties~ mode is pure and simple adventure, highly enjoyable for those who have even the slightest interest in Lara Croft's background and have already enjoyed enough action with the single player campaign. Of course, if desired, it is possible to exploit the same setting in a very different way, as demonstrated by another interesting addition of the 20 Year Celebration edition entitled ~Lara's Nightmare~: it is a survival option that takes place precisely between walls of the Croft manor and which offers an alternative interpretation of the story, evidently the result of a tormented dream of the girl. At this juncture we will have to face hordes of ghosts inside the various rooms, with the aim of finding and destroying three skulls suspended in the air. It won't be easy at all, firstly because of permanent death in the event of a game over and the obligation to start all over again with randomized elements, secondly because of the few weapons and ammo available around. Also new is the introduction of two-player co-op in the Endurance mode, which we were able to try before launch. The value of this survival interpretation of the experience was already known, given that it adds to the basic gameplay the obligation to get food and keep warm in order to survive, all while looking for relics and facing off against any agents of the Trinity, moving forward as long as possible. as long as possible. Playing in two makes it even more fun, and that's enough. It is also celebrated on PC and Xbox One Do you own Rise of the Tomb Raider for PC or Xbox One and would like to access the contents of the 20 Year Celebration edition? In case you own the Season Pass of the game, you will be able to download the ~Blood Ties~ and ~Lara's Nightmare~ modes for free, together with the new extreme difficulty level, the cooperative for the Endurance mode, the extra outfits and the special cards for shipments. If you do not have the Season Pass, you can purchase the upgrade package for the price of 9.99 euros. The Xbox 360 version of Rise of the Tomb Raider is unfortunately excluded from the initiative. Playstation 4 trophies There are one hundred and twenty-five Trophies present in Rise of the Tomb Raider: 20 Year Celebration and most of them are unlocked by completing certain actions a certain number of times: healing three times during a fight, killing five enemies in ten seconds with a rifle, perform twenty-five stealth knife kills, craft five pieces of equipment, and so on. Some achievements are unlocked by performing an action for the first time, after which there are DLC-specific Trophies to further enrich the list. From a technical point of view Rise of the Tomb Raider was spectacular on Xbox One and equally spectacular on PlayStation 4. The new edition of the game runs at 1080p and 30 frames per second, but it seems that the developers have improved some aspects of the graphics for the debut on Sony consoles: frame-rates feel more stable, both during cut-scenes and fast-paced action, while textures appear sharper. The optimization work probably goes hand in hand with support for PlayStation 4 Pro, which as we know will offer the possibility of activating three different display options.one: 4K and 30 frames per second, 1080p with 60 frames per second, or 1080p with enhanced details and effects. We can't wait to be able to experiment with these presets, but in the meantime it's a great thing to be satisfied, both from a strictly technical and artistic point of view, given the quality of the settings and their variety, not just aesthetics. The Croft Manor, the new adventure that takes place within the walls of Lara's house, remains consistent with the visual level of the rest of the adventure and offers us a large and convincing mansion, net of the areas closed for restoration. Environments that we will be able to visit in virtual reality thanks to the new mode designed for the PlayStation VR viewer: yet another extra in a package of indisputable value.", "date": "2016-10-10", "grade": "9.2"}