{"name": "Radio Philadelphia", "ref": "https://multiplayer.it/recensioni/174766-homefront-the-revolution-the-voice-of-freedom-radio-philadelphia.html", "text": "In the review of Homefront: The Revolution there was talk of how the Dambuster Studios shooter went through a troubled development, passing from hand to hand until a completion that in itself is a great victory for the authors and for the new publisher of the project, Deep Silver. A pleasant title, quite challenging at first, with a sandbox full of things to do but at the same time too generic in terms of design, poorly valued in terms of some mechanisms and a little too repetitive in the secondary missions. A few months later, here we are analyzing The Voice of Freedom, an extra chapter set before the events of the base game campaign, in which we take on the role of that Benjamin Walker who enters the scene during the introductory phases of The Revolution to save the protagonist of the adventure, Ethan Brady, and spur him with his capture to work to ensure that the city can free itself from the yoke of the invading army. Homefront: The Revolution - The Voice of Freedom is an interesting but too short and limited prologue Short but intense? Talking about expansion for The Voice of Freedom is evidently exaggerated: the DLC created by Dambuster Studios consists of a single mission, which, if desired, can be completed within half an hour and which unfortunately again loses the opportunity to better characterize the figure of Benjamin Walker, the ~voice of the Resistance~, the charismatic leader who speaking on the radio has the ability to rekindle people's desire for freedom and push them to act all together to return Philadelphia to its citizens. To this we must add that the new enemy faction that is introduced in the DLC, ~The '90~, whose members stand out in the official images, is completely anonymous and devoid of any substance: at first their cruelty towards the Resistance is underlined, then everything is lost in the simple gait of the action. The pack can be accessed from the main menu of the game, in the ~story~ option, regardless of whether you have completed the campaign or not. The structure of the episode sees us intent on overcoming a hot area of the city in order to reach a safe haven, but to complete this objective we will first have to face different groups of enemy soldiers without being able to count on equipment worthy of the name, at least until we will not have reached the final stages of the mission. With the gun in hand and a few rounds in the magazine, we will have the obligation to go around the opponents and eliminate them silently whenever possible, quickly overcoming some outdoor locations to descend into the subway tunnels and thus escape the detection of the devices KPA flyers. Underground Once in the tunnels we will have to face an unexpected threat, represented by the rebel faction hostile to the Resistance we were talking about just now. We won't be able to argue with these people, so to survive we'll have to eliminate them one at a time, again preferably silently. Indeed, after having traveled long distances in search of an electric generator, we will find ourselves in the middle of a hostile location and there we will have to plan our actions well to get out alive, also because a possible game over would take us back to the beginning of the sequence. By studying the movements of some enemies we will be able to take advantage of when they have their backs to us to take them out with the knife and move on to the next target, until we can move without too many problems to go on to eliminate an armored vehicle moving along the tracks and the whose turret could kill us in a matter of moments. Collecting materials around (and the rifle, indispensable in case something goes wrong) will therefore be of vital importance in order to be able to build explosives and place them strategically along the journey of the wagon, so as to cause it serious damage and destroy it completely with three successful detonations. After that, all that remains is to activate the generator, recover a motorcycle on the fly and dart away before the continuous explosions on the surface bring down the tunnels, in the perspective of a simple but undoubtedly spectacular sequence. At that point the moment will come for a final firefight, with the possibility of finally managing the arsenal, and for the epilogue that will lead us straight to the initial sequences of the Homefront: The Revolution campaign. Voices from the front Thanks to the updates released so far, The Voice of Freedom can count on a technical sector with solid performance, which on the test configuration keeps the sixty frames per second stable without ever a hesitation, at 1080p and with all effects atmaximum. In reality, the DLC does not involve the CryEngine that much, given that it effectively renounces the open world connotation of the original campaign to offer us much smaller settings, which can also be explored according to a linear structure: the open areas, the tunnels and finally the KPA post from which Walker must try to escape to get to the appointment with Ethan Brady. Unfortunately none of these scenarios introduces any visual novelty, they are all reshuffles of areas already seen in the base game, with the same assets and even too many structural similarities. The Italian dubbing remains of good quality, with convincing interpretations for the cast of actors involved, but those elements of the gameplay that made Homefront: The Revolution an engaging and interesting product are missing, net of its indisputable defects. In short, we must accept the fact of being faced with a simple extra mission, certainly not the best of the lot, where instead the developers could have told the story of the leader of the Resistance from further away, offering more lasting and varied entertainment, perhaps with a minimum of narrative insight in exchange for a figure (5.99 euros) yes accessible but a little too high in relation to the contents.", "date": "2016-10-09", "grade": null}