{"name": "Antipasto di scorpioni", "ref": "https://multiplayer.it/recensioni/174876-gears-of-war-4-antipasto-di-scorpioni.html", "text": "When we tried Gears of War 4 on PC just under a month ago, we were impressed by the quality of the port. The game ran steadily above 60 frames per second, had no tearing, frame drops or hitches of any kind, and visually offered some jaw-dropping glimpses. However, we were still very cautious, after all we were playing the game on a computer equipped with the latest in graphics acceleration and processors, not to mention RAM, in short, a beast of at least 2000 euros. Furthermore, the test took place using a 4K curved screen, which undoubtedly further influenced the visual quality of the game. Now that we've finally been able to play it on our personal PC, which is undoubtedly performing but doesn't cost like a scooter: so let's see in more detail how the PC version of Gears of War 4 is doing. However, before starting, we must point out that once again, as with Forza Horizon 3, downloading the game proved to be quite a complicated undertaking. In fact, the title does not appear among our Xbox One app games, as perhaps it should be, you have to go to the Store, find it among the games for Windows 10 and then start downloading it. Furthermore, it was not understood why initially the size of the game was almost 70 GB, only to then, after a couple of days, drop to 40 GB and start from scratch. After this ordeal we were finally able to get our hands on the product of The Coalition. For all the more strictly playful information, we obviously invite you to read our original review published a couple of days ago. Gears of War on PC is a feast for the eyes and an advance of Project Scorpio Everything under control The first difference that catches the eye between the Xbox One and PC version is that in the latter there is an internal benchmark that allows you to understand in a short time which is the ideal configuration for the game and act accordingly. Yes, because there are so many configuration options for the game and it is practically impossible not to find the one that best suits your machine. Beyond the preset configurations, ranging from ~Low~ to ~Ultra~, it is possible to set: resolution scaling, FOV, brightness, Vsync activation, lens flare quality, bloom, shadows, ambient occlusion, light , of the textures of each character, surface or monster, the texture filter, the Anti Aliasing, the refractions, the particle effects, the motion blur, the level of detail of the environment, of the leaves and other options that will allow us to calibrate performance to get the most out of it. For the occasion, Nvidia has published a very long optimization guide that analyzes in detail how much each change affects the frame rate. In summary, the options that will cripple the frame rate the most are resolution scaling, depth of field, screen space reflection and shadow quality. The configuration we tested the game with included a GeForce 980M, 16 GB of RAM and an i7 processor. With the High configuration and a resolution of 1080 the benchmark gave us an average of 70 frames per second, while playing in hand we arrived at around 65 in the most crowded situations. By setting everything to Ultra, the benchmark recorded just over 60 frames, which became slightly less in hot moments. Bringing the resolution to the maximum and trying to push towards 4K (despite not having an adequate monitor) the frames drop between 40 and 30. All in all, we can consider it a decidedly acceptable result, given that usually the PC versions of many games do not enjoy absolutely the same optimization, indeed, they tend to struggle even with high-end configurations. In this case, however, everything went smoothly, thanks also to the fact that after each change, the options system clearly explains how your choice will load the system with further work. Everything is ok also on the Play Anywhere front. We've started a campaign on Xbox One and finished it on PC, playing co-op between the two systems without any issues, and the same goes for the Horde. As for the control system, even if Gears of War is designed for the use of a pad, which is obviously recommended, you can also think of playing it with a mouse and keyboard, for sure the monsters will wonder why your aim is improved so much. The Master Gear While I enjoyed the graphics of the Xbox One version which runs stably at 30 frames per second 1080p, the ability to play on the Windows 10 counterpart shows all the differences between the current generation and a good PC today (as it should be). Indeed, to be honest it shows what Gears of War 4 could be on Project Scorpio and we are almost sure that a revised and corrected version will be released next year, perhaps with all the maps already unlocked. The Xbox One version handles Unreal Engine 4 honorably - particularly in regards to materials, lighting and particle effects - but a quick comparison of the two versions' textures reveals a number of noticeable differences. Textures on PC are brighter, sharper and richer in detail, while Xbox One textures are less detailed, especially in the details of the armor, foliage and metal surfaces. Robots exploding to smithereens, lightning storms shaking objects and giving everything a ghostly glow, facial expressions, flying debris, everything looks beautiful even on a normal HD screen and anti-aliasing or super sampling pumped to the max . And let's not forget the 60 frames per second or more in both single player and multi, which make everything more fluid, pleasant and beautiful to look at. When the first Gears of War arrived on our screens, it wasn't just a game with a particular aesthetic and new mechanics, it was above all very nice to see. Over time this lead has been tarnished by a technological flattening and our habituation to HD graphics, but the PC version of Gears of War 4 is undoubtedly here to put things right. Its main flaw, perhaps, is not having an Uncharted 4-style Photo Mode with which to spend the days looking for the perfect shot. Indeed, perhaps a real big flaw, for those who love streaming, we have found it. Given its particular architecture, linked to Xbox One, the PC game does not digest streaming systems such as OBS or Xsplit. To be able to transmit it, therefore, you need to resort to some trick based on double screens or streaming from your desktop, an inelegant solution that will certainly limit its visibility on Twitch. A real shame, because Gears of War 4 on PC represents the closest thing to Scorpio that we can get our hands on in the coming months.", "date": "2016-10-08", "grade": "9.0"}