{"name": "Tre uomini in barca", "ref": "https://multiplayer.it/recensioni/174839-burly-men-at-sea-tre-uomini-in-barca.html", "text": "There's a story that needs to be told at the beginning of Burly Men at Sea, and that's the point. Through a curious paradox, the three bearded sailors fish a bottle with a map inside, immediately at the start of the plot, but the map is empty. The Spiccio sailor thinks it's just a useless trinket but the Brave argues that it is too mysterious to be superfluous and decides to take it to the village, where the wise old man of the inn explains: ~It is an adventure worth living that begins with the 'unknown. This map contains stories yet to be told.~ This is a very simple and wonderful incipit, because the empty map is just an invitation to set sail and experience new adventures that will fill that mysterious piece of paper with landmarks and stories worthy of being told by old sailors near the fire . The story to be told is therefore that of the game itself, which is constructed and revealed in a reflexive way. In a metaphor of travel and discovery, Burly Men at Sea continually leads us to return to the sea and try new routes based on the different choices we can make, drawing a spiral of recurring but always different stories in a sort of meta-collection of tales that truly become a book, or rather books in the plural, in advancing from one branch to another of the possible adventures. Try to avoid thinking of it as a video game, because in fact it has little of the classic graphic adventure, even if it may seem so at first glance: to enter Burly Men at Sea you have to take a step to the side and break away from conventions, exactly like the three bearded sailors decide to put aside the fishing routine to follow the Adventure, the one with a capital A. This little pearl of Brain & Brain is pure and simple interactive storytelling, but it's really easy to get caught up in this bizarre Scandinavian-flavored multi-story (although the team is American, it is curious to note how the taste is close to productions from the geographical area Nordic like the Simogo titles), even for those who view these strange hybrid solutions with suspicion. Burly Men at Sea is a sort of mini-anthology of nautical tales in a single story The folds of history Moving your finger on the screen widens the view and consequently imposes a direction of march on the action, with the sailors moving accordingly, while touching the elements on the screen you can interact with objects, animals and characters. There are no great puzzles to solve but above all the will to make choices is required, which influence the development of the story and determine the typical ramifications of this circular structure, which always makes us return to the same island at the end of an ever new adventure , while starting and ending pretty much the same way. Talking about gameplay here would be misleading, it's about reading and looking at the wonderful illustrations of this sort of children's book that hides universal truths and messages that are good (probably better) even for the less children. The simple and light style of the graphic layout is also found in the way of writing and in the development of the dialogues, which with the ordinance seafaring jargon hide moments of humor and a strongly ironic tone that invests the whole narration, making the story lively and less prone to the intellectual complacency that often emerges in similar productions by proudly ~alternative~ teams. Certainly it is a much more passive pastime than video games normally are, and even the choices entrusted to the player are often not entirely clear, thus forcing us to experiment a little at random to see the results of the different roads, on which we we find we have rather poor control. In short, the problem, if we really want to find one, is that there is very little game in Burly Men at Sea, and this is good to know before starting the adventure, but once it starts it is very difficult to regret the choice made . Unfortunately, we must point out the absence of the Italian language, which could significantly affect the experience for those who are not familiar with English.", "date": "2016-10-07", "grade": "8.8"}