{"name": "Cacciatori di taglie stellari", "ref": "https://multiplayer.it/recensioni/174540-bounty-stars-cacciatori-di-taglie-stellari.html", "text": "There is always something fascinating in the figure of the bounty hunter, and even more if this is presented in spatial declination. Those typical figures on the margins of society, outsiders everywhere and nowhere, who always act in that gray area where the laws seem to have no particular effect, despite the fact that their actions are often carried out for a good purpose and perhaps even starting from a well-established moral basis. These are the space bounty hunters, or smugglers, as certain historical characters from Star Wars or good old Firefly teach us well. Just the suggestions from the late Joss Whedon series seem to emerge with particular force playing Bounty Stars, starting from the particular country-folk soundtrack based on strings to get to the sci-fi western style that characterizes the game world, and are elements that those who love the source material will appreciate well. The story sees a sort of space venture company face various missions within a boundless and surprisingly populous universe, but also full of pitfalls and threats even for a simple interplanetary trader. As befits the figure of the bounty hunter, there are no great ideals in moving the team from one stop to the next, simply the will to get the job done and earn good amounts of money to reinvest in ships and equipment varied, but going from hunt to hunt and from delivery to delivery, the narrative elements that form the background gradually reveal themselves, and in spite of themselves the members of the Bounty Stars group find themselves involved in matters that are really much bigger than them, between climbing to the top of the trade guild and the collection of vil money. Bounty Stars looks like an excellent RPG with a decidedly particular atmosphere setting Turn-based hunting Bounty Stars takes place like a classic turn-based RPG, with the particularity of offering a double battlefield: the clashes take place both between space ships and on the ground, between individual fighters. This amplifies both the mechanics and combat situations and the character management system, because you find yourself having to check the evolution and equipment of ships, as well as the various party members, which helps to vary the action a little of the game, considering also that the collection of elements for the upgrade represents in the end the key element of the whole experience. The ground clash between bounty hunters and various enemies follows the standard rules of the genre, with the party arranged on one side and the opposing faction on the other and the turns to mark the active and passive phases, with the series of special attacks and tools available that is selectable for each character during their turn. The space battle, on the other hand, is a bit different: in this case, in addition to establishing the targets to be hit during the rounds, you also have to set the course of the ships, tracing the trajectory for each one and selecting the different types of maneuvers in this case as well and special shots in stock. In this phase, a minimum strategic approach in the disposition of the ships comes into play, with the need to carry out coordinated maneuvers in order to obtain advantages in attack and defense. It is in fact the only element of variation on a structure that otherwise remains welded to the traditions of turn-based RPG, from which Bounty Stars separates itself just for its particular setting and characterization, which however have their weight in the creation of a game world that pushes players back into the action. In this sense, even the dialogues and the humor underlying the story and the action make a good game to give personality to Bounty Stars and keep the interest high even when we grope forward a bit, considering some slowness of the plot and a reward management system that can be frustrating. In fact, in a game entirely based on the collection of loot, a somewhat random ~drop rate~ like this, which forces you to repeat the battles several times to obtain the pieces you are looking for, seems to clearly want to push towards micro-transactions.", "date": "2016-10-01", "grade": "8.0"}