{"name": "Dalla Russia con dolore", "ref": "https://multiplayer.it/recensioni/174548-mother-russia-bleeds-dalla-russia-con-dolore.html", "text": "There was a time when arcades offered things we humans could only imagine, confined to the blocky confines of gaming systems that were no match for arcade machines. In that era made of coins placed on the glass to book, people who insisted on being the boss in your place and neighborhood bullies, the scrolling fighting game genre stood as the absolute first. Two or more characters to choose from, each with flaws and strengths, tons of different enemies, tough bosses, giant chickens that heal health, energy-draining super moves, and almost always a beauty to save, a genius of crime to defeat and lots of coins to throw. Anyone who managed to finish them using a few, or even just one, was seen as a modern hero to be carried in triumph. Today that era no longer exists, but there are still many lovers of the genre, a forgotten cult of nostalgics who, at the sight of the first images of Mother Russia Bleeds, felt their heart beat like it hasn't happened for a long time. This debut work by Le Cartel, published by the madmen of Devolver Digital, points straight to the heart of those who loved Final Fight and Street of Rage and tries to plant the needle of a syringe made up of nostalgia, frustration, ultra-violence and 8 -bit. The result, like any drug, is a mix of positive sensations and brutal side effects. Mother Russia Bleeds is the scrolling fighting game that nostalgics have been waiting for, or almost It was the gypsies! Mother Russia Bleeds starts with all the delicacy of a snuff movie or a film starring Yuri Boyka: a filthy gypsy camp full of people who washed up just on the day of their baptism, an arena made up of barriers and fights between bums, drug addicts and desperate for the amusement of some and the bets of others. We are one of these fighters, but the arrival of a paramilitary group and some experiments with a drug called Nekro will upset this routine of misery to plunge everything into a nightmare of blood, kicks in the temples and shattered bones. However, like any self-respecting scrolling fighting game, the first thing to do is choose our alter-ego between the big one, the fast one, the more standard one and a woman. The rest will undoubtedly be familiar to those who know this type of title: a roundup of more or less tough enemies, weapons to collect, combos, grips and space management to make sure you always have someone in front of you to beat up or keep at bay. wide and no one behind ready to strike treacherously. If you want, you can play the game with the help of a bot, because two beat you better or with three other friends, because you beat even better if you do it with someone you know well. Sadly no online multiplayer, because old school has its limits. The great mad variable of the game is Nekro, this very powerful drug that can both cure our health and transform us for a few seconds into very fast and very strong furies of nature, capable of killing a person with a punch; by ~killing~ we mean ripping the head off the neck with one blow or opening the ribcage with a kick. The Nekro obviously does not grow on trees, but we will have to gradually recharge our syringe by sucking it from the corpses of some enemies, recognizable because before dying, they will writhe for a while on the ground. The problem is that obviously in the collection phase we will be at the mercy of anyone who wants to understand how long it takes their knuckles to break our heads. Initially the use of the Nekro will be quite sporadic, but the more we go on the more essential it will be to use it at the right time to decide whether to save your life or clean up the area from a frustrating crowd of enemies. A pity that this drug in story mode has only one effect, while in arena mode it doesn't. It would have been interesting to be able to count on different power-ups, greater differentiation between the available characters and, perhaps, a progression system with new moves, a la God of War. Nostalgia and frustrations The problem with Mother Russia Bleeds is the excessive desire to follow a genre that was once thought not only to have fun, but also to get you a lot of 200 lira coins and therefore necessarily had to become frustrating and difficult for no reason. A need that is not necessary today in a title like this, if not for the pure pleasure of remembering the good old days, which unfortunately breaks the rhythm of the game with too exhausting and frustrating fights, which end up boring. As if that weren't enough, the combat system seems excessively based on the use of the fist, to be pressed hardnti combos that in certain moments end up blocking us and exposing us to blows from behind. Even fighting on the ground tends to be dangerous, because it often takes too long to get up and you end up helpless in the face of attacks from those who are still standing. The result is that over time there will be less and less tendency to finish an opponent on the ground, effectively making the possibility of doing so useless. To close this combo of flaws and little flaws, there are also some alignment problems with the enemies: sometimes it happens that we hit someone who is not exactly in front of us, sometimes in the same situation we hit empty, or we are unable to collect a weapon on the ground. As long as the situation is manageable, everything is fine, but when chaos reigns supreme, every movement, every gesture must be calibrated to perfection, so the bugs do nothing but feed an already punitive situation in itself, increasing the annoyance. A real pity, because for everything else Mother Russia Bleeds is simply the fighting game that we old cowards have been waiting for too long: the feeling of violence is tangible, the situations are completely out of mind, the variety of enemies and their attack is extensive, the bosses are spectacular, there are loads of weapons and the graphic style is simply perfect in its nod to the 16-bit era, giving the nostalgic eyes of the beholder moments of pure pixel art. In less than half an hour you go from having to prevent dozens of guards from picking up a radio, thus trying to fight evasively, to fighting each other on a train, avoiding obstacles that arrive at full speed, to fistfighting in a empty swimming pool in which on one side a sort of combine is ready to tear us apart, passing through saunas full of tattooed Russians, rave parties, prisons and smelly butcher shops. We're not even going to tell you how fun it can be played with three friends on the same sofa, but will you be able to find three other people who can put aside commitments, work and family to find themselves like in the old days?", "date": "2016-09-30", "grade": "7.8"}