{"name": "Lancio nello spazio", "ref": "https://multiplayer.it/recensioni/174373-fractured-space-lancio-nello-spazio.html", "text": "Building on the great success achieved by exponents of the MOBA (Multiplayer Online Battle Arena) genre such as League of Legends and Dota 2, this acronym has been used for a long time to collect a multitude of games. In reality, these are titles that often have little in common with each other, if not a game scaffolding on which each development team builds in its own way. In Fractured Space, the game we're dealing with today, we don't find the classic fantasy setting of the genre, but mammoth ships ready to do battle in space. For the boys of Edge Case Games this is only a formal debut on the scene, given that the Guildford-based studio can rely on some experience in the field of stellar fights. As those who have followed our coverage dedicated to Fractured Space will certainly know, the team in fact includes a large part of the team already seen at work in 2013 on the appreciated Strike Suit Zero. Archived the positive experience made with the latter, the developers decided to focus on a more ambitious project, starting work on Fractured Space: after almost two years spent in Early Access, the free-to-play game has finally seen the its official launch a few days ago. From the developers of Strike Suit Zero comes Fractured Space - that's why it convinced us! Alpha, beta and gamma As we had already seen in the test a few months ago, compared to our first contact with Fractured Space, the game has seen the arrival of some new features, however leaving the basic system rather unchanged. The work of Edge Case Games is in fact revolved around the mode called Conquest, in which two teams made up of five players each collide. The points where Fractured Space meets the MOBA genre consist precisely in the foundations at the base of the gaming experience, starting from the final objective of the two sides which is to destroy the opposing base. The map is divided into a group of quadrants that form a sort of cross, at the vertical vertices of which are the two structures to be destroyed. To attack the enemy base, the teams can move by making space jumps through two different ~lanes~, identified with the names alpha and beta. Only by conquering the enemy bridge present in one of these two quadrants is it possible to access the enemy base area, but it is good and right not to ignore the extraction plants: it is thanks to the control of the latter, in fact, that the ships can level up to become more powerful. The central quadrant is instead identified with the name range, and contains an area which at regular intervals of time allows the team that conquers it to obtain important bonuses. The matches of the Conquest mode, usually around thirty minutes long, are joined by those of Frontline, the second type of game wanted by the developers for those looking for a different experience, more oriented to ~hit and run~. In this case, in fact, all the ships are placed on a single play area, engaged in the usual conquest of the opposing base. However, when a timer expires, the respawns stop working, thus transforming the match into an elimination game in which the team to which the last surviving ship belongs wins. It is a good variant to the Conquest mode, especially in light of the fact that at least for the moment Fractured Space cannot count on other maps. In addition to the tutorial, quite well done and always available to clarify any basic dynamics, the game also offers an offline mode, in which to give life to clashes that also see ships controlled by artificial intelligence as protagonists. Time to time Fractured Space's free-to-play system leads players into an inevitable progression system, based mainly on the ability to purchase additional ships and upgrades for those already in your hangar. The main benefit obtained by those who decide to invest real money is that of being able to access the various elements more quickly, compared to those who find themselves having to accumulate matches to buy the various objects without spending real money. If the specter of pay-to-win is always present in such a situation, we would like to say that in Fractured Space the main element able to decree the success of a player fortunately remains his skill, accompanied by the work of squad. It's nearly impossible to see a single player dominate an entire match, while a well-organized team can give even better equipped, but less adept at coordinating opponents a run for their money. Maneuvering ships isn't always easy, and to succeed in the most rewarding feats is rRequires an amount of Dexterity that can only be stacked with experience. It is no coincidence that the developers have littered the quadrants with asteroids, intended to act as a shield but also as an obstacle depending on the situation. As intuitive as it is, the control system adds a further pinch of complexity to the gameplay: using the classic WASD keys it is possible to carry out the basic movements of your ship, which however also has the possibility of exploiting the third dimension to go upwards or down with the spacebar or control key. The identity of the many ships is defined by a series of parameters and abilities, accompanied for convenience by three different numbers linked to as many indicators that show the vessel's propensity for attack, defense or support. Returning to the issue related to purchases, the possibility of trying each ship before buying it is appreciable, in order to evaluate its compatibility with your style of play before making the purchase. Among the elements that cannot be purchased with normal currency (Credits) we find the ship skins, which can therefore only be obtained after converting euros into the Premium currency. For Edge Case this is obviously the easiest way to earn, which does not affect the balance of the free-to-play we were talking about above. Beyond the aesthetic customization, Fractured Space also gives the player the possibility to choose the equipment of his ship, presenting a series of alternatives to which different bonuses are linked. In this case, the crates also come into play, obtainable by completing some daily objectives without having to spend real money in this case too. Each crew member unlocked then requires the use of Fractured Space's third currency type, DNA, which can be obtained by converting normal Credits or by purchasing one of the content packs available on Steam. We close with a few words on the technical sector, to which the developers have dedicated particular attention starting from the creation of the settings. But the models of the ships shine above all, appreciable in their details even at high zoom levels. The audio effects are also good overall; enough soundtrack.", "date": "2016-09-27", "grade": "8.0"}