{"name": "Wheels of Aurelia", "ref": "https://multiplayer.it/recensioni/174249-wheels-of-aurelia-sulla-strada-aurelia.html", "text": "The history of the consular roads built in Roman times is as interesting as it is an essential part of Italian history. Cassia, Salaria, Casilina and all the others, formed an impressive network that connected the main sites of the empire and, despite the changes of layout that took place over the centuries, they are still today fundamental connecting routes. It is rumored that some of the potholes in the current road surface date back to Roman times, but that, as they say, is another story. The Via Aurelia is the one that runs along the Tyrrhenian coast connecting Rome with Ventimiglia, to remain in Italy, but also continues beyond the border ending in Nice. In reality, the historical route did not go beyond the Versiliana (the initial project was supposed to stop in Cerveteri), but over time the road was extended, becoming the SS1 we know today. Lella, the protagonist of Wheels of Aurelia, is the daughter of the good Rome of the 60s/70s. Born and raised in Parioli (one of the wealthiest districts of the capital and the one where the most drug dealing is done), she experienced first-hand the socio/political turbulence of the hottest period of the years of lead, the period in which the entire game is set . We meet her in the prologue, where we drive her to a nightclub. Here he meets Olga with whom he decides to escape from Rome to reach Nice. The actual game begins with the two girls in the car leaving Rome. The bird's eye shot shows us the selected car, which we control directly. The graphics in a pleasant low-poly 3D reveal an environment made up of buildings that vaguely resemble those of the Roman suburbs. It's time to get familiar with the control system. We have reviewed Wheels of Aurelia by the Italian Santa Ragione: find out how it is Accelerate and brake Wheels of Aurelia is a driving game, but driving is not the focus of the game. We can steer left and right and accelerate (to brake, just release the accelerator), but that's about it. There are other cars on the road that must be avoided, but even if you run into them, nothing more irreparable than a jolt will happen. In some moments you participate in competitions and chases, but they are always functional events to the story told and not ends in themselves. In short, in Wheels of Aurelia traveling is not a problem, it is the theme. Choosing whether to run more or less is a choice linked to the other fundamental aspect of the title, namely the dialogues. In fact, going slowly allows you to read a greater number of exchanges between the various characters. Olga is the first, but there will be others: an ex-pilot, a priest, but also eccentric hitchhikers, others more prosaic and so on. The dialogues are managed in a very simple way: all you have to do is select a joke from Lella among those available and wait for it to be pronounced. There is a bar/timer that divides the selection from the execution, to allow you to read what you are about to say and, perhaps, change your mind by making another choice. As you may have understood, the mechanics are essential. It is a precise choice, dictated by the desire to focus the user's attention on something else, that is, on the stories told that faithfully depict the conflicts and themes of Italy in 1978, topics that we still carry with us for the most part. today, though the actors on the nation's stage have changed. We are inevitably children of those years and even if we ignore them completely we have to deal with them. Lella and Italy at the end of the 70s As already mentioned, what Wheels of Aurelia does well is to frame those years from a historical and social point of view. The characters talk about everything: from the abortion law, to the kidnapping of Aldo Moro, passing through Andreotti and political terrorism. There are tons of social references, flying around on different levels depending on which character you're talking to. To give some examples, with some people we talk about Juventus, UFOs, bank robberies and much more. Lella is connoted in a very definite way and represents a clear point of view: she is a left-wing militant feminist who rebels against bourgeois society by ~running away from home~. He admires the French '68, while he despises how the protest movements in Italy have been interpreted. He reads Pasolini, hates television and loves engines. In short, she is a progressive revolutionary on the move, with an ironic joke always in her mouth, but ready to confront anyone who is different from her (fascists aside). It is an original character compared to what are the canons of video games, which is good for a title so focused on storytelling. Describing Lella in such detail is not secondary to understanding Wheels of Aurelia, because it is his choices, entrusted to the player, that determine the endings. To abandon or not a travel companion? To participate or not in a car race? Follow the road or divert? Civitavecchia or Bracciano? Siena or Piombino? The sixteen endings are reached by following the storylines that unfold in the dialogues. Sometimes we are asked to change course, sometimes to stop, still others to speed up. The important thing is to continue traveling accompanied by the splendid soundtrack, made up of modern songs that imitate the sounds of the late 70s, framing the sounds of the road (engines roaring, wheels squealing, doors slamming). The illustrations are also on the subject, which effectively imitate the style of the Italian comics of the time, those read on the various Launch Story, Intrepido and so on. In short, the research work was profound, both in the composition of the landscape and in that of the various decorative elements. Thus, even if the places have not been reproduced with photographic precision (there wasn't even a need to, in truth), they are suggested by symbolic elements and references in the dialogues. Everything is functional to the length of the individual trips, which can last from fifteen to twenty minutes (if you are passionate about the concept of longevity, multiply by sixteen). Comprehension Basically Wheels of Aurelia can be described as a narrative experience. Despite the cars, we can bring it closer to a Dear Esther/Journey/Abzu/The Path than to any racing game, with which it shares little or nothing. For this reason, if you are looking for more traditional experiences, you can simply ignore it (after all, if you don't like flight simulators, don't buy them, don't go writing on the forums of enthusiasts who should be platformers). If we have to make a criticism starting from what the game of Holy Reason is, we would say that it sometimes sins in arbitrariness. Let's explain ourselves: the general construction is excellent, but some dialogues are far too guided and didactic, while some narrative turns seem a little too arbitrary. These are moments that do not pollute the overall charm of the title, and do not diminish its qualities, but are nonetheless strident with respect to ambitions. On the other hand, those who worry that only Italians can understand many of the dialogues... well, that's not our problem. Playing a title like 1979 Revolution: Black Friday we certainly didn't understand all the references to the Iranian historical / social framework of the time, but that didn't diminish its value. After all, the wise man is not what he knows, but what he is looking for and in these cases the discriminating factor is not what the game tells, but how curious one is about what one does not know. Unfortunately, nobody can give you curiosity.", "date": "2016-09-23", "grade": "8.5"}