{"name": "Solo il ritmo ci salver", "ref": "https://multiplayer.it/recensioni/174028-hatsune-miku-project-diva-x-solo-il-ritmo-ci-salvera.html", "text": "The land of the rising sun is full of disruptive phenomena that become almost incomprehensible once you cross the borders and come into contact with western tastes. One of these is certainly that of idols, which is not the first time we've talked about in recent weeks, stars born mostly from the world of music who then end up establishing themselves as television or film personalities driven by the unwavering support of hundreds of thousands of fans who follow his deeds with a passion that sometimes borders on the morbid. The idols of the real world weren't enough, for some time now virtual ones have also burst onto the scene, born mostly from the diffusion of a vocal synthesis program called Vocaloid, used to produce songs to be played on Japanese radios. Each type of voice has earned its ranks of supporters just as if they were singers in the flesh, so much so that they have organized concerts in which holograms are projected on stage to accompany the songs. Well, why are we telling you all this? Just to introduce you to Hatsune Miku: Project Diva X, a rhythm game that takes us to a virtual world in danger, to be saved with the sound of songs. Hatsune Miku: Project Diva X is an excellent rhythm game for fans of the genre A world to save The whole introduction on Vocaloids was necessary to give a more precise idea of who Hatsune Miku is, protagonist of Project Diva X and digital singer grappling with saving her world invaded by an evil force that is consuming it little by little little by little. Only the protagonist's voice can restore order and fill it again with joy and good feelings, and our task will be to help her draw the maximum possible energy from each of her songs. The game world is divided into five different spaces called Clouds, each of which is characterized by a different aura: Cute, Cool, Elegant, Quirky and Classic and also correspond to the five categories into which the playable songs are divided. Each of these five areas is controlled by a crystal that must be reactivated with the energy of the voice: to do this we must complete the six scenarios present in each Cloud by exceeding the minimum scores. There are thirty performances in all, all with a J-Pop theme, not many but with a good variety within the tracks both in terms of musical genre and speed and difficulty of execution. The story itself proved to be a mere glue between one song and another, without succeeding in capturing the player despite the presence of multiple supporting actors, but rather, often falling into banality due to too verbose dialogues and digressions secondary to the events of the main plot. Once the campaign is over, each performance becomes available to be tackled individually in search of the best score, greatly favoring replayability thanks above all to the presence of many collectibles to be used during the performances. At the end of each level, in fact, Miku receives as a reward additional costumes and objects that can be equipped to increase the points multiplier to obtain a better final result. Glasses, backpacks, dog ear headbands and cat paw gloves each belong to a specific category and only with accessories of the same style you get the highest bonuses. Playstation 4 trophies Hatsune Miku: Project Diva X offers 31 trophies of which 10 bronze, 15 silver and 5 gold to which is added the precious platinum Platinum. Most of these are related to completing the main story and exploring the menus and related functions, such as filling the photo album with at least ten shots, but to have them all you will have to sweat a lot and collect very high scores in the various missions. Sing what's up with you In addition to the good variety of tracks, one advantage of Hatsune Miku: Project Diva X is that it is extremely immediate and fun for both newbies and the more savvy, who will not fail to sweat a lot to complete each scenario at maximum difficulty. As a good Japanese idol, our Miku accompanies each performance with a choreography, as happened in the classics of the rhythm game genre such as Parappa the Rapper, while the keys to press with the right timing materialize on the sides of the screen. Going in time with the rhythm of the songs, each correct pressure is given an evaluation which serves both to increase the final score and to ring in combos that help in building the multiplier. In addition to the four keys on the pad to be pressed at the right time, we find the stars that are assigned to the analog stick and the pi insidious darts that require the simultaneous pressing of the marked directional arrow and the corresponding pad key. Easier said than done, mind you, but as mentioned, by increasing the level of difficulty, the combinations that appear on the screen will be increasingly difficult and faster, putting even the most prepared to the test. During the song there will then be specific time challenges called ~Chance Time~, in which we will have to try to hit as many buttons as possible to unlock a new costume of our virtual idol and have a substantial score bonus. It must be said that at least initially the many things that happen on the screen have proved to be a concrete distraction and have often distracted us from the action, but over time you learn to concentrate on the keys without paying too much attention to animations and sudden changes of scenarios . In this sense, the settings and the models of the protagonists of Hatsune Miku: Project Diva X have proved to be rather poor in terms of detail and care in the realization by exploiting the PlayStation 4 hardware to a minimum. Despite the 60 images per second and the support for PlayStationVR, the series' debut on the Japanese home console shows its limits especially during the cutscenes and choreography. Finally, we remind you that the title is also available for the Sony portable console, PlayStation Vita, in a formula similar to the home one and with the sharing of game saves to pick up the adventure exactly where it left off and try to break new records for each song.", "date": "2016-09-22", "grade": "7.7"}