{"name": "I segreti di casa Wayne", "ref": "https://multiplayer.it/recensioni/174126-batman-the-telltale-series-episode-2-children-of-arkham-i-segreti-di-casa-wayne.html", "text": "What you are reading is the review of the second episode of Batman: The Telltale Series, entitled Children of Arkham. The five-episode series can only be purchased in full, at a price of 22.99. The text contains some spoilers on the first chapter. Among the many versions of Batman's origins and his rise to Gotham City, the one that Telltale Games has set up for Batman: The Telltale Series has particularly impressed us. As we have already seen at the time of the Realm of Shadows review, the choice of the team specializing in episodic adventures was in fact to take the classic story of the Dark Knight, adapting it into an unpublished plot in which the elements are still preserved hinge. A choice that proved to be right for the little we've seen, thanks to the support of some unexpected finds that made Batman: The Telltale Series attractive even for those who already know the life, death and miracles of this superhero. Children of Arkham picks up where the opening chapter left off, with boss Carmine Falcone captured by Batman, while at the same time Bruce Wayne gives Gordon some damning evidence about the criminal's illicit activities. The wealthy heir of the Wayne family, however, finds himself forced to deal with an uncomfortable reality, retracing in the opening of this second episode one of the most important events that led to the birth of Batman: the killing of Thomas and Martha Wayne . Avoiding excessive spoilers on the portion of the plot developed in these two episodes, we limit ourselves to saying that in Children of Arkham the hidden side of the Wayne house finds itself even more at the center of the whole issue, falling on a Bruce forced to expose himself in the first person to investigate the truth kept from him for a long time by his trusted butler Alfred. As in Realm of Shadows, there are decidedly more occasions in which we are called to wear the jacket and tie of the multimillionaire rather than the Batman costume, in which we find ourselves only in cases where there is the need to exploit all the gadget supplied to the bat man. At a certain point, in reality, we can even choose whether to face one of the sub-chapters of Children of Arkham as Bruce or Batman, thus setting our strategy on dialogue or action. On balance, it is a pity that at least for now this choice is confined to a minimal part of the adventure, as it is an aspect that opens the door to an extra pinch of replayability, prompting the player to try the specific piece again to relive the same situation from a different point of view. Speaking of time, it takes about an hour and a half to complete this second chapter, less than the two hours of Realm of Shadows. It is not only due to the reduced duration that the minutes go by rather quickly, pressing the player with a fast pace of events narrated in a particularly effective way, thanks to the alternation of various twists and turns. Even particularly well-known elements such as Harvey Dent's transformation into Two-Face are cleverly wrapped up in a story that remains original and engaging, putting Children of Arkham head and shoulders above its predecessor in terms of plot and character development. Bruce Wayne still grappling with family secrets in the new episode of Batman: The Telltale Series! Classic Telltale In terms of gameplay, this second episode of Batman: The Telltale Series does not differ from its predecessor. We are therefore grappling with the classic backbone of Telltale Games titles, within which the dialogues and the choices we make within them play an important role, leading the characters to later remember the way we treated them. The many chats alternate with series of quick time events, present above all in the moments in which Batman appears, but not only: one of the cutest action scenes of Children of Arkham is indeed the one that sees Bruce Wayne protagonist in a bar together with Selina Kyle, better known as Catwoman. As happened in a few moments of The Walking Dead: Michonne, the excellent directorial cut almost makes you forget that you are grappling with the usual quick time events, provided you are not really bored with the classic dynamics of Telltale Games. From this point of view, even this new chapter does not present any particular loopholes, on the contrary sacrificing some slightly more original points glimpsed in its predecessor in favor of the rhythm of the narrative. In Realm of Shadows we had in fact appreciated the scene in which Batman had to investigate what happened to some policemen inside a warehouse, showing off his doti of the world's most skilled detective to piece together some clues and thus reconstruct the events. In Children of Arkham there is none of this, so before starting to play it is good and right to put your soul in peace. In technical terms we are fortunately far from the disasters of Realm of Shadows, even if the defects have not completely disappeared. On Xbox One the game has never crashed, and phenomena such as loss of lip sync or loss of frame rate are much less noticeable. The gaming experience is therefore decidedly more enjoyable than the first release of Telltale's Batman.", "date": "2016-09-21", "grade": "7.5"}