{"name": "Tripletta al sangue", "ref": "https://multiplayer.it/recensioni/174007-dead-rising-tripletta-al-sangue.html", "text": "It's been eight years since Frank West first faced a horde of zombies in what is one of the most iconic undead-related settings. It was signed by the legendary director George Romero who for his second film dedicated to zombies chose a deserted shopping center as the theater. But if in the film the huge building is chosen as a refuge by a group of survivors, the protagonist of Dead Rising, at the Xbox 360 exclusive launch, spontaneously decided to jump into a real hell, intrigued by the isolation of the town of Willamette. Upon his arrival he finds the classic group of fugitives who commit the even more classic imprudence due to which the entire population of Willamette, transformed into a swarm of brain eaters, pours into the mall. At this point Frank has 72 hours of time during which he can hide or jump into the middle of the action in search of answers and survivors to save. Thus begins the Capcom saga whose first three chapters, all united by the same basic mechanics, are re-proposed to us with a package that celebrates the tenth anniversary of Dead Rising. Dead Rising Triple Pack takes the field at the head of a huge horde of zombies 72 hours to die The first aspect of Dead Rising that struck us and still surprises us is the huge number of undead, which we can literally mow down using the vehicles and all the improvised weapons we find in the mall. We are talking about something like 500 zombies on the screen and 25,000 usable objects that guarantee action in quantity for all the 72 hours that separate us from the recovery via helicopter. Frank, well-placed despite his career as a photojournalist, can weaponize almost anything from ineffective cardboard boxes to baseball bats that crash zombies' pumpkins in a bloody triumph. Generally firearms are more effective and unlike common objects they don't break too easily, but bullets are in short supply and it would be wrong to underestimate the satisfaction guaranteed by the use of chainsaws, chairs, cans, torn arms, propane tanks, waste bins , frying pans, fire extinguishers and so on. The number of potentially offensive tools is endless and plays an important role in a title that allows us to smash, crush, slice and butcher the undead who chase us dreaming of a dinner based on fresh brains. In some situations the enjoyment is such, even when the weapon we are holding is not the most effective, that there is the risk of wasting time and this is not a luxury we can afford. If the gameplay revolves around a sort of sandbox delirium focused on the evolution of the character and on pure violence, the structure of the title is based on the ability to string together missions and quickly overcome the numerous and crazy bosses that appear in front of us. Between sadistic clowns and angry butchers, the panorama is decidedly varied and almost all psychopaths do not struggle to get us into trouble in an unforgiving title. Making the perfect run requires a lot of games, in an unforgiving title even if the final six guarantee an epilogue worthy of the name, albeit sometimes dramatic, for all those who manage to do something in the 72 hours of time available which, in real time, I correspond to six hours. The same time granted to Chuck Greene, a stuntman and motorcyclist by trade, whose destiny is to face the undead and conspiracies four years after the Willamette accident, in a profoundly transformed world. Dead Rising 2 is set in Fortune City, a Las Vegas where zombies, now up to six thousand on screen, are even the protagonists of a reality show in which the protagonist also participates, forced into this madness to pay for a medicine that prevents his daughter infected to permanently turn into a zombie. Suddenly what appears to be an accident releases a new wave of zombies that forces us once again to turn everything, including benches, into a weapon. In short, the structure is the same as the original but the improvements to the gameplay give us a less wooden and more refined title that includes more reactive allies, human enemies, multiplayer structured through the disciplines of the aforementioned reality, online cooperative mode and a dynamic survival related to medicine for Katey. Furthermore, to all this we add the combo weapons which, with the increase in the level of the protagonist, expand the already enormous arsenal of the title with freezing cannons, adhesive bombs, sound weapons, electric spheres, plate launchers and so on. All availsites that, together with new tools of destruction, also come in handy for Frank Castle, again the protagonist in Dead Rising 2: Off the Record. Much of the title is identical to Dead Rising 2, excluding the return of the sandbox mode of the first chapter, but the assumption is different since it reinterprets the whole plot with a different protagonist. Precisely for this reason the events are not considered an integral part of the main storyline and it is good for fans of Frank, who finds himself infected instead of Greene's daughter in order to maintain the mechanics of anti zombification medicines. Shadows, lights and blood splatters Dead Rising 2 and Dead Rising 2: Off the Record already boast the best graphics obtainable on PC and the arrival on next-generation consoles brings nothing new, unless you have played them on PlayStation 3 and Xbox 360. Dead Rising, instead, it never arrived on PC and this means that the re-edition comes back with a cosmetic never seen before both on consoles, where like the two most recent chapters it runs at 60 images per second and 1080p, and on PC where it can count on 144Hz with unlocked frame rate, 4K resolution, G-Sync support and compatibility with Xbox 360, Xbox One and DualShock 4 controllers. The gameplay, however, does not change and the first chapter of the series must bow its head in front of Dead Rising 2 and Dead Rising 2: Off the Record which have aged better thanks to less woody movements, less spartan interface, decidedly superior artificial intelligence of the companions and a few more technical devices that reduce the weight of the less well-finished elements, unfortunately inevitable given the amount of enemies on the screen. Yet both exert a lesser charm than the first Dead Rising which, despite being less refined from a graphic point of view, is tougher, a pinch more credible and on PC, thanks to the fact that it is an unpublished port, decidedly richer in options that also include the command mapping. The models of the main characters, among other things, are still doing quite well while the crazy bosses maintain their charm and level of challenge unchanged. On the other hand, the aiming system does not hold up, also problematic in the second chapter, and the problem of an artificial intelligence full of flaws that stand out forcefully despite the undead certainly not having to win the Nobel to be convincing. Instead, the companions should have a minimum of brain, if only to justify being chased by zombies, but this is not the case and the effects on the gameplay are nefarious, thanks to the often inauspicious position of the save points. The second chapter, we said, drastically improves from this point of view but inherits other problems from Dead Rising, some of which have been mitigated but never resolved as in the case of bad collisions. Furthermore, the PC versions suffer from some hitches on Steam and the incomprehensible thing is that these problems, ranging from the disappearance of the sound to the non-recognition of the mouse, also involve the first Dead Rising, despite having just arrived on Windows. Fortunately, restarting the Valve platform solves the problem but a shadow remains on a conversion job which on the one hand, that of optimization, is more than good but on the other, when it comes to refinements, would have needed an extra coat of paint. Yet, despite the congenital defects and the weight of the years, the first two chapters of the series, to which Off the Record is added as a reinterpretation of Dead Rising 2, remain unique experiences, reviews of memorable psychopaths and well-crafted cutscenes that they have aged quite well. Not to forget, then, that they are all replayable titles over and over again thanks to the time structure that involves different crossroads and endings.", "date": "2016-09-20", "grade": "7.5"}