{"name": "Core ingrato", "ref": "https://multiplayer.it/recensioni/173839-recore-core-ingrato.html", "text": "Having archived the experience of Mighty No. 9, Keiji Inafune returns to the direction of triple A projects with ReCore, an exclusive for Microsoft platforms developed by Armature Studio. The game features Xbox Play Anywhere functionality, which means that by purchasing it digitally, you can play it freely on Xbox One and/or Windows 10. Right from the start, the title catapults us into a very pleasant sci-fi atmosphere, halfway between Lost Planet 3 and the incipit of Star Wars: The Force Awakens. The scenario is in fact that of a desert planet, Far Eden, which in the intentions of some scientists should have become the new home of human beings, decimated following the spread of a devastating epidemic. But something has gone wrong: the cunning meteorologist Joule Adams awakens from her cryogenic sleep a century late and realizes that the corebot technology has been somehow corrupted, transforming the service androids into hostile and dangerous machines, with the The only exception is his trusty ~dog~, Mack, and other specimens that we will get to know during the adventure. Supported by an excellent quality Italian dubbing and an excellent soundtrack, the story of ReCore is very well told and undoubtedly constitutes one of the strengths of this production. ReCore is a great title: well narrated, engaging, with so much to discover. Too bad about the uploads! I, corebot At the outset it seemed that the gameplay of ReCore would have enabled us to use the cores to create different machines, but in the finished product this ambition is evidently scaled down. However, the configurations presented at the start have been maintained, therefore the aforementioned dog Mack, capable of supporting our attack by jumping on enemies and electrifying them; the fearful octopus Seth, capable of firing missiles at pre-selected targets and magnetizing himself to make us travel certain ramps; the very strong gorilla Duncan, who tears opponents to pieces using fists and fire; and little Violet, in charge of checkpoints, fast travel and team change. After completing a short tutorial, the game quickly takes on the characteristics of an action adventure with many things to do and discover, climbing mountains and platforms with a view to pleasant and multifaceted platform sections, in many ways ~old school~, reminiscent of a little vertical exploration of the Prince of Persia in cel shading or even the catacombs of Assassin's Creed, crates included. You move within very large maps, each containing passages that allow you to access dungeons where you can confront new threats, overcome paths full of pitfalls and conquer resources of various types, in particular prismatic cores. The latter represent a fundamental requirement to be able to grapple with certain challenges and even to be able to complete the story, so never back down when you can get some, or you will then be forced to do backtracking in order to move forward. The collected objects can be used once they return to Joule's Sandsweeper, in order to unlock and assemble new components for Mack, Seth and Duncan, as well as enhance their attack, defense and energy characteristics. An interesting solution full of variables, although characterized by some edges in terms of interface and the impossibility of improving the protagonist's rifle, which however progresses as you go up in level. Xbox One goals ReCore's fifty-three objectives revolve around crafting and creating new components for the corebots, reaching certain combat-related numbers, and completing certain story stages. Unlocking them is quite simple at first, as obtaining them goes hand in hand with progress in the campaign, but then it takes a little patience and extra effort. Sand and sand The initial sensations about the gameplay of ReCore are controversial, given that the protagonist moves a little too ~lightly~ within the scenario and pressing the left trigger automatically activates a lock-on on enemies that prevents you from making a mistake . In reality, after a few ~introductory~ battles, the combat system turns out to be challenging and fairly varied, with Joule's pulse rifle which must be adjusted to four different colors (red, blue, white and yellow) in order to inflict damage on the different types of corebots that we will be facing. However, to make everything more interesting is the support of our androids, who can weaken the defenses of the opponents and distract them enough so that they can be hit with a loaded shoto (right dorsal); perhaps making the indicator for the activation of the extractor appear, a sort of grappling hook with which we can grab the core of our target and take possession of it through a small ~tug of war~ minigame. Thanks to the presence of some guessed ~bullet time~, these phases turn out to be spectacular and satisfying, whether it is dealing with a small gathering of robots in the dunes or with the big bosses who guard some dungeons, fairly varied and cunning. The degree of challenge seemed balanced to us: the campaign is completed in about eight, ten hours going straight, but the dungeons and mysteries require a little extra time which increases the overall duration of the experience. Sure, there are real frustration peaks at the end, but for the wrong reasons: every game over, the game reloads the entire stage, with very few exceptions, and this translates into a wait of close to two minutes. It goes without saying that dying in challenging combat and also having to wait that long to get back into action creates episodes of pure frustration - a problem the developers will hopefully remedy quickly with an update. For the rest, the technical realization moves between ups and downs: the design of the characters and corebots is very good, except that of the nemesis on duty, while the quality of the scenarios fluctuates and the effects do not do justice to the setting at all. see especially the mediocre early stage ~duststorms~. There are some glitches, polygonal interpenetrations and sudden drops in frame rate which fortunately do not affect the actual gameplay in any way, while conveying the idea of a shaky engine, which fails to offer great performance, especially as regards the visual distance. In short, there is a lack of finishing, and it is a great pity: with a few extra months the guys from Armature Studio could have delivered us a more coherent and ~glossy~ product, as well as perhaps with reasonable loading times.", "date": "2016-09-14", "grade": "7.8"}