{"name": "Dragon Quest VII", "ref": "https://multiplayer.it/recensioni/173682-dragon-quest-vii-frammenti-di-un-mondo-dimenticato-meglio-tardi-che-mai.html", "text": "Dragon Quest VII is as much of a time paradox today as it was when it first came out. It was 2000 and the Enix-signed title was closely following games of the caliber of Final Fantasy IX, The Legend of Dragoon and Xenogears: while Squaresoft aimed to renew the jRPG genre, Enix did not leave its privileged position in the slightest. After all, Dragon Quest had practically founded that genre, and at the time it was practically the most popular franchise in Japan, thanks also to the contribution of the character designer Akira Toriyama, that is the author of Dragon Ball. Even in 2000, however, Dragon Quest VII had raised more than one eyebrow especially after being landed in North America: while the Japanese players celebrated its extraordinary success, the American ones - and the Europeans forced to import the game - struggled to understand that what was fun in a graphically old jRPG in which even hours passed between one fight and another. In a sense, history repeats itself even today. The remake of Dragon Quest VII lands in the West (including Europe) almost three years after the Japanese publication for Nintendo 3DS and iOS. Not only that: Fragments of a Forgotten World arrives in all its classicism after titles of the caliber of Bravely Default have tried at all costs to ~dismantle~ the jRPG genre, renewing it in almost every aspect. Highly anticipated above all because unpublished in the Bel Paese, as well as unknown to the new generations, Dragon Quest VII bets against everything and everyone, winning hands down for a simple reason: it is immense. Dragon Quest VII is the pinnacle of old-school jRPGs, for better or for worse Crazy about the pieces Let's put it this way: to get through the prologue of Dragon Quest VII on PlayStation you needed granite patience and the curiosity of a cat. Many gave up after a couple of hours, but those who persisted discovered a simply unforgettable adventure. Today, however, an introduction like the original one, without fights or a precise direction, would not have been acceptable, and so Square Enix has made some changes to make the first few hours of the game less distracting. Better this way, in our opinion. The merit also goes to the new localization - completely in Italian, let's make it clear - which is much more faithful to the goliardic spirit of the Japanese screenplay and abandons the virtuosity of the first English adaptation: in an attempt to make the names and dialogues more serious, the original translators had distorted the philosophy behind the game. Dragon Quest VII is not the usual epic adventure in which the chosen one sets out to save the world from who knows what supernatural threat. Actually there's this too, but the story doesn't start like this: it all starts with a stunt. The unnamed protagonist is a humble fisherman but also the best friend of Prince Kiefer of Estard, a brat who drives the entire royal family to despair. The two have long been trying to sneak into an ancient temple that could hide the secrets of their strange world, a boundless ocean in which only their island exists. The propitious occasion presents itself when the father of the protagonist finds the fragment of a strange tablet in the sea: after having investigated, our naughty discover that by reconstructing the tablets and placing them on the altars of the mysterious temple it is possible to travel in time and visit the other islands that dotted the sea before something or someone erased them forever. The canvas of Dragon Quest VII will remind fans of the series that of Dragon Quest IX: The Sentinels of the Sky, since it is not a cohesive and linear plot but a carousel of almost self-contained micro-stories. Every time the hero and his friends manage to rebuild a tablet - an operation facilitated by the new radar that warns the player of the presence of fragments in the surroundings - new islands are unlocked to visit: each of them has its own problems that translate into puzzles , dungeons and fights. Once the current crisis has been resolved, the island can also be visited in the present to find out what has changed and find new fragments of tablets: it is a scheme that looks a lot like that of Chrono Trigger and which guarantees a certain freedom, also because Sometimes our decisions can change the fate of some characters. Each island then enriches the mythology of this strange world, outlining the main storyline and the real goal of our heroes. Those looking for a guided, linear jRPG full of shocking twists and turns might find the formula of Dragon Quest VII disheartening to say the least, but as we have said, it is a colorful adventure that still does not disdain some touching low blows and which offers a variety yesvery rare situational. That's how it was played 15 years ago As we have already said, Dragon Quest VII is an atypical jRPG in the sense that it doesn't give a damn about throwing the player into a fight as soon as possible to show him how cool and fun it is to beat up enemies. It will be quite some time before you can face your first Slime and when that time comes you may still be dumbfounded. Fans of the series will already know what to expect from the very first clashes, when the party can only physically attack, defend or run away, despite the interface anticipating the possibility of choosing between offensive and defensive spells and special techniques, but the combat system of Dragon Quest VII really takes a long time to get going and the first few hours could appear not only boring, but also frustrating. In this version for Nintendo 3DS enemies appear on the screen and can be dodged, although in the corridors of the dungeons there is often no room to maneuver and one ends up remembering the ancient random ambushes a little too often. The problem is that from the outset the party is often in the minority and the shortage of weapons, money and healing items makes each fight decidedly challenging: you have to sip the magic points, understand when it is appropriate to run away and concentrate the efforts on the most dangerous enemies. If you lose there's no Game Over and you start over at the nearest church with half the money you accumulated, but keep in mind that reviving party members also has a price, so you really need to be wary. Everything is bound to change, even if perhaps it takes too many hours, but when the vocations are finally unlocked Dragon Quest VII drastically changes its face and becomes one of the most complete, deep and fulfilling jRPGs you will ever be lucky enough to play. The system resembles that of Final Fantasy V or precisely of Dragon Quest IX, with the characters who can change class at any time at the appropriate sanctuary. Fighting increases the level of the current vocation and when a character reaches a certain rank in certain vocations, he unlocks new and more sophisticated ones: warriors, paladins, priests, summoners, pirates, beast tamers... whoever has the most, put more. Each vocation increases different stats at each level up, so it is possible to alter the predispositions of the various heroes and try an infinite number of different combinations, taking advantage of the synergies between the various skills in a game that greatly rewards strategy and caution especially in the advanced stages of the adventure or in the random dungeons that players can generate and trade through StreetPass. The last function - obviously exclusive to this edition for Nintendo 3DS - recalls the Treasure Maps seen in Dragon Quest IX, even if it is much less sophisticated: nevertheless, it clearly increases the longevity of a game which, for the avoidance of doubt, content-wise it is almost without rival. Between casinos full of mini-games, monsters to capture and villages to rebuild and customize, it's easy to understand how the hour counter can easily exceed eighty before reaching the end credits. The 3D effect Enjoy the stereoscopic effect while you can, as it won't be in Dragon Quest VIII. Luckily here it is very pleasant and increases the involvement during the explorations; moreover, it is possible to choose two types of intensity to make the fights even more spectacular. The stuff remakes are made of Although three years have passed since the Japanese release of Dragon Quest VII, the remake developed by ArtePiazza defends itself very well and offers an excellent compromise between what is offered by the Nintendo DS in Dragon Quest IX and the natural technical evolution of the series we have witnessed with Dragon Quest VIII on PlayStation 2. In fact, the setting of Dragon Quest VII is very reminiscent of Odyssey of the Cursed King: the world and the islands are divided into macro areas that we can explore in the third person, passing from external fields to city and inside buildings. Generally it is also possible to rotate the camera around the vertical axis, even if the dungeons often prevent this from being done for a matter of pure and simple level design. Despite some nasty pop-up effects during exploration, especially as regards trees or structures that suddenly appear when we approach them, the wacky world of Dragon Quest VII perfectly restores that color and enthusiasm that characterize its inhabitants and their stories, thanks also to the hand of the ever prolific Akira Toriyama: it is true that his characters all look a bit alike, but they are funny and full of caratter. Furthermore, ArtePiazza has intervened in two directions to update the technical sector to modern standards. Firstly, once the actions in combat have been selected, the camera will move backwards or rotate to show the animations of our heroes, partially abandoning the first-person view characteristic of the series to embrace a model halfway between the aforementioned Dragon Quest VIII and Dragon Quest IX. Furthermore, when we have finally unlocked the vocations, we will discover that the appearance of our heroes changes together with their classes, further defining them from a visual point of view: our protagonist could abandon the green tights to dress a real warrior armor with our great satisfaction. The same goes for the weapons, since they all have different polygonal models, even if the variety in terms of equipment is decidedly less than what was seen in Dragon Quest IX, also because in this seventh episode there is no ~ crafting~ to lose sleep over. The excellent technical realization is accompanied by the excellent soundtrack of the evergreen Koichi Sugiyama, historical composer of Dragon Quest who once again accompanies us on the notes of iconic tunes, carefree or disturbing if necessary. In short, from a technical point of view, Dragon Quest VII does not disappoint at all even if it already has a few years on its shoulders, but unfortunately we have to admit that we would have definitely appreciated a rejuvenation of the menus and the interface: slow, cumbersome and spartan, it perpetually reminds us that the (Square) Enix series always walks in the balance between two eras, even if perhaps its charm is just that.", "date": "2016-09-13", "grade": "8.5"}