{"name": "Capitolo finale", "ref": "https://multiplayer.it/recensioni/173716-call-of-duty-black-ops-iii-salvation-capitolo-finale.html", "text": "Call of Duty: Infinite Warfare is officially upon us. Two months to go before sitting on the Retribution deck; now, however, it's time to get back firmly on the ground and face the latest DLC of Black Ops III. The menu brought to the table by the talented boys of Mark Lamia is the usual one, or rather four multiplayer maps and the new Zombies, Revelations setting, which closes the story of Richtofen, Dempsey, Takeo and Nikolai. Everything as per the textbook, therefore, and at the usual price. Let's try to figure out if these extra contents are worth our 14.99 Salvation is the latest DLC for Call of Duty: Black Ops III. A farewell in style! A walk through time and space With Rupture we go back to 2008, since we are facing a futuristic remake of the Outskirts map. The original setting was that of a half-destroyed German town, but now we are inside a generously sized compound made up of modern structures and old sheds. A decidedly unmemorable location: the map is not flat, you can enter buildings, there are small squares and barriers where you can take shelter, but the urban combat feeling is certainly not exciting. Trying to make it all the more thrilling are the mechs to pilot. Unfortunately they are slow and not very effective: not really an unforgettable plus. Call of Duty has accustomed us to bizarre settings for years now, but this time Treyarch has undoubtedly exaggerated, but he did it very well. Do you remember Micromachines? Do you remember how nice it was to run in the ~tiny~ shoes of cars on home routes, dodging everyday objects? Here the sensations are the same as we find ourselves fighting on a picnic table, cluttered with hamburgers, glasses, fries, hotdogs and donuts. A beautiful map, obviously very colorful and very frenetic, with the classic three-lane design, just intricate and perfect for putting all the extra movement possibilities to the test. With Citadel we remain on the subject of settings that have little to do with modern, advanced or future warfare, if you prefer. The cursed forest full of spooky trees and the castle with its ~dark~ corridors, gloomy and gloomy halls seem to take us to the Dark Souls area. Call of Duty and Dark Souls are certainly polar opposites, but they share a very low life expectancy... Just set foot in the castle, where blind corners and sudden openings are the perfect places for ambushes and close combat. But there are also caves, towers, waterfalls and long tunnels. Without a doubt it is the best map of the package, not only for its design, but also from a purely technical point of view, with a nice lighting system to ~color~ the internal environments. Outlaw instead takes us to the old West, taking Standoff from Call of Duty: Black Ops II as a starting point. In short, another remake, but if Rupture was eight years old, here it is only four. As a result, a lot of freshness is lost, even if to be honest the map was good before and is still good now. A medium sized level, one hundred percent urban combat, where you can enter any building. What was written for Citadel applies here: Treyarch has really done a good job visually, both in terms of technology, with clean textures and good lighting, and in terms of ~staging~, with rich environments that are perfectly consistent with the setting. Nothing is missing in this country under construction. There's the saloon, there's the train, there's the caravans. Really nice map, just not quite new. And then there's the final chapter in the Zombies campaign, Revelations. We are in a country cottage, together with the good Malcolm McDowell, only instead of the placid English moor, we find ourselves at the edge of the universe, at the mercy of titanic entities taken by weight from the Chtulu cycle, between cursed temples, prisons, portals they transport us to past battlefields and disintegrating planets. All illuminated in the manner of the beautiful Italian genre films of the past. Those who madly love Mario Bava will therefore appreciate Treyarch's work. We are facing the best of the best of this mode: Revelations is huge, complex, intricate, full of things to build and of course easter eggs.", "date": "2016-09-12", "grade": null}