{"name": "Terra bruciata intorno", "ref": "https://multiplayer.it/recensioni/173619-ark-scorched-earth-ark-si-fa-terra-bruciata-intorno.html", "text": "The path of development, success and consecration of ARK as one of the most important exponents of the modern survival game is probably the dream of any video game studio. Thinking of entering such an inflated genre and instantly becoming the undisputed king in terms of preferences of a certain type of audience, instantly leads you to live the famous ~American dream~. Thanks to an excellent placement on the market and a bomb announcement with a trailer that gave everyone the idea of living in a sort of gigantic Jurassic Park, when the Wildcard title arrived on the market on June 2 last year, it was a riot of ovations . As always happens, especially when it comes to an early access title, there was no shortage of detractors from the first hour who, after playing a quarter of an hour or not playing at all, labeled it a bankruptcy project and destined to never end. From there to a handful of weeks, the reality is that we were faced with what, in all likelihood, is the most supported game ever, at least within its category. All with patches and content additions that went on every couple of days for the first few months and still don't go beyond two weeks today. Wildcard's commitment has been the keystone of user satisfaction despite features, such as support for DirectX 12, announced practically at launch and not yet released. A little over a year later, Wildcard tries again, even before leaving Early Access, and with two console versions, one of which is being run in and another due out at the end of the year. In this panorama we are going to place Scorched Earth, the first real DLC of ARK, bringing with it a series of elements of the highest level, but also the nature of a paid expansion. The latter concept is the reason why the game has currently gone from an extremely positive to a mostly negative average rating on Steam. With ARK: Scorched Earth you will satiate your desire for hunting in the desert! Scorched earth, same story ARK is a survival of classic workmanship, as we said before. You choose a server, create your own character and enter a world (PvE or PvP) in which you will need to survive, create your own resources and become self-sufficient. All, possibly, accompanied by a nice tribe that divides the roles. So far, nothing different from the usual, at least until dinosaurs are introduced into the discussion. With these you will have to live, fight and eventually tame them to make them your garden animals. If the base game put us in the role of a character who found himself in a world populated by known dinosaurs, Scorched Earth, on the contrary, puts us in front of a series of incredible mythological creatures, including golems and wyverns. On a purely narrative level this translates into nothing: in the sense that, in the same way as the basic version of the title, there is no common thread that leads you to live some particular experience. You wake up in an unknown place, with a graft in your arm (the symbol of ARK) and try to survive, dying a dizzyingly close to infinity number of times. That's all? Yes, because ARK doesn't want to tell you a story: it wants you to experience yours, preferably with a series of friends to share it with. In this sense, the freedom promised by the title turns out to be total. And the ability that the survival in question has to turn even the simple picking of berries from the ground into fun is inexplicable. Probably also thanks to a balanced and well-structured crafting and taming system, one cannot fail to experience ARK as an incredibly functional experience, at least in its cooperative form. As far as PvP is concerned, the critical issues remain the same. The game is clearly based on group operations, on the need to organize yourself with weapons and dinosaurs capable of overcoming the most dangerous dungeons, in order to facilitate the conquest of a series of artifacts necessary for summoning the bosses. For this reason, Studio Wildcard has developed a totally free spin-off, called Survival of The Fittest, suitable for clashing with other players and for which tournaments with prize pools of tens of thousands of dollars are already active. Let me be clear, in the game it is possible based on the servers to organize raids to take the supremacy of an area, but if you are looking for a less deep survival but more focused on simple competition, better look towards Rust. So what's new in this expansion? A new map, slightly smaller than the main one and the one added for free via mod. Ahost of new creatures, including inventions like giant mantises and acid-shooting centipedes, and presumably a host of new bosses as well. So the point is, and this is where the barrage of criticisms arriving at Studio Wildcard in these days is based: was it really necessary to publish an expansion for the certainly not modest sum of twenty euros, for a game that is still in early access? Wouldn't it have been better to complete the game, release the PlayStation 4 version as well and launch an all-inclusive package? It is clear that it is also necessary to see the operation from the point of view of a company. For more than a year the game was supported very well, and now there was a need to monetize it. Judging by the sales, the goal has been achieved, but it is obvious that the reputation of a splendid survival and fantastic development team is no longer so valid. For posterity the arduous sentence, we are required to talk about the game and tell you if it's worth it and if you are a fan of the genre and you are still fed up with this title, you certainly won't be bored. Optimize my ARK(a) We arrive at the sore point of the title, the one that even after a series of substantial improvements since the release, still suffers from a series of not indifferent problems: optimization. ARK is undoubtedly the survival with the most impactful visual sector on the market, provided you have a computer useful for the launch of the last shuttle. Who speaks to you, plays the title with a good PC, on which a NVIDIA GTX 960 is mounted. We are certainly not in the Olympus of video cards, but for a 2015 title it shouldn't be difficult to shoot at a stable 30 frames per second with high detail. These two values, especially as regards the original map and even more so for this new one, are often a mirage even for far more performing configurations. The drops in frames, especially in areas more fervent with flora and fauna bring to mind the delirium experienced by PC players with Batman Arkham Knight and, although the problem can be stemmed with the decrease in details, it is a pity not to be able to enjoy full of a truly dizzying visual sector, considering the genre it belongs to. Above all, it makes you smile how the second map - The Center - born as a mod and then officially inserted into the game, is instead better optimized. Sign of the classic fanmade work that often surpasses professionals in the sector. This is emblematic if we consider that the map of this expansion, as can be guessed from the title, is almost entirely desert, with small oases scattered around and a large mountain range bordered by a gorge where all the wyverns live. In the face of all this, the classic problems of the genre cannot be ignored: such as certainly not extraordinary animations and a series of interpenetrations capable of creating strange hybrids between different types of living beings, including plants. ARK: Scorched Earth, net of its problems, is undoubtedly an excellent DLC. Why is it not recommended then? We simply feel like condemning the developer's choice to put a paid expansion, even before a title is released in its final form. The greater fear is that a choice like this could set a precedent for other similar cases in the future, and this is a reality we would much rather avoid.", "date": "2016-09-09", "grade": null}