{"name": "La posizione del ninja", "ref": "https://multiplayer.it/recensioni/173472-naruto-shippuden-ultimate-ninja-blazing-la-posizione-del-ninja.html", "text": "Nintendo has shown that it is possible to take a very popular gaming brand and bring it brilliantly to mobile devices, so now all the major publishers are willing to make further attempts in this direction. Bandai Namco has long since launched a more massive support of iOS and Android terminals, and with Naruto Shippuden: Ultimate Ninja Blazing it brings one of its most important franchises to its debut on these platforms. It does so in collaboration with Gree, a real authority in the field of Asian mobile gaming, developing a very immediate and fun strategic touch, characterized by rather tested freemium mechanisms: an indicator of resistance that determines how many missions we can try before having to wait for a recharge, an upgrade system based on loots and the ~fusion~ of bonus characters, as well as a degree of difficulty that increases progressively, leading after a few hours to consider grinding as a viaticum for faster upgrades in view of challenges impossible to sustain otherwise. In short, a structurally ~average~ product, which tries to monetize the right amount and places the usual obvious but not obsessive constraints on those who want to play without ever putting a hand in their wallet. Naruto Shippuden: Ultimate Ninja Blazing represents a good debut for the franchise on iOS and Android The dynamic trio After a set of introductory missions, Naruto Shippuden: Ultimate Ninja Blazing allows you to try your hand at the numerous levels of a campaign that follows the events of the manga, with single cooperative multiplayer battles, special missions, a survival mode or the inevitable timed events. In all cases it is possible to play alone or together with other users, whether they are friends or complete strangers, with a view to a fairly rapid online sector as regards matchmaking but sometimes marred by some latency problems. So how does the gameplay work? Our team is made up of a total of three pairs of interchangeable characters, with one ninja necessarily borrowed from another player's team. Once you take the field, you have to face a certain number of stages, each with enemies to fight, to finally get to the confrontation with the boss on duty. The action is managed as in a turn-based strategy, with a great emphasis on position: each character has a field of influence that allows him to get in touch with opponents and companions in order to attack the former and receive support from the latter . It goes without saying that managing the clashes in a ~close~ way turns out to be the best solution, following the indications given at the top left as regards the relationship between the various elements: red beats green, green beats blue, blue beats red. Just move a ninja near an enemy for him to automatically bring his attack, gradually increasing a chakra gauge which, once full, allows you to perform devastating specials. The formula works, it's fun and is constantly stimulated by the loot and the upgrade system, although in the long run the mechanism inevitably becomes repetitive. On the technical front, however, we move between ups and downs: the design of the protagonists is valid and the direction manages to give the opening sequences a spectacular appearance, but the ~unpublished~ characters are decidedly ugly to look at and the scenarios are sometimes terribly anonymous .", "date": "2016-09-07", "grade": "7.5"}