{"name": "Italian Style", "ref": "https://multiplayer.it/recensioni/173154-redout-italian-style.html", "text": "34BigThings srl is a young Italian company specializing in videogames, and this in itself is news, considering that, apart from Ubisoft Studios and the timeless Milestone, in our country the software houses dedicated to the home entertainment sector count on the fingers of one hand. Redout is their second project: the first was Hyperdrive Massacre, an old school driving game released a year ago on Steam and Marketplace with good critical acclaim. With Redout the guys based in Turin raise the bar: quoting their own site verbatim it is a tribute to the various WipeOut, F-Zero, POD and Rollcage, real cornerstones of a particular derivation of driving games. We are obviously talking about racing at supersonic speed on super futuristic tracks, a category that is already little exploited on its own but which has even fewer exponents on Windows territory: the Nintendo saga, obviously, has never arrived there, while that of Psygnosis has stopped to the timeless episode 2097 and its stratospheric soundtrack. However, we also like to remember Star Wars: Episode I - Racer, another excellent example from LucasArts. No more talking though: the time has come to test the potential of this long-awaited racer, honored among others by Epic as one of the best indie games of 2014. Memories run fast at Screamer: Redout has what it takes for an international success Speed Test The offer is complete: in fact, there are ten game modes that can be played. It starts from the solo tests, with or without the presence of accelerators on the track, in which the enemy is the clock, passing through the elimination tests, where there are traps and the respawn of the aircraft is disabled. When other opponents take to the track there are six types of challenges: from the traditional ones to others in which the last of each lap is gradually eliminated, passing through survival trials where the important thing, rather than finishing first, is arriving healthy and save, to conclude with a sort of real marathon where five circuits are connected to each other. You can tackle them freely, choosing the circuit, number of laps and participants (up to a maximum of twelve), or sequentially by measuring yourself against the interesting career, made up of over seventy stages. In this case you start with a basic spaceship, selecting it from among seven stables: each differs from the others in terms of energy reserve and boost recharge speed, acceleration and maximum speed, resistance and grip. In the first matches you become familiar with the game structure; progressing with the results, things get more complicated while in the meantime experience and bank account increase. The first serves to unlock new tracks and classes of spaceships (four in total); greenbacks are used for power-ups. You can install two of them, choosing from a list of twelve: the active one, requiring user intervention, has limited effects over time; otherwise, it permanently modifies the ship's statistics. In this case we note the skill of the programmers in studying types of game that can enhance one or another enhancement, avoiding that the choice always falls on the obvious increases in grip and acceleration. Speed Demon Once on the track, the sensation of speed is total. The guys at 34BigThings claim that Redout is the fastest title ever created: although we cannot guarantee it scientifically, we feel we can espouse their statement. The frame rate is very high and, as overseas colleagues would say, ~rock solid~, already with the first spaceship models, those that allow you to reach approximately 1000 km/h. Of course it would have been worrying if the system used for the review, equipped with a GeForce GTX 1070, had not managed to carry out the task at FullHD resolution, but the programmers claim to have worked hard to achieve similar results, perhaps sacrificing some detail , even with a humble GTX 960. The credit undoubtedly goes to the expensive Unreal engine, but also and above all to the excellent work done by the designers who have been able to create spectacular tracks, without weighing them down with useless frills but rather looking for the right harmony between sportiness and elegance. The title of the Turin software house is a classic example of ~made in Italy~, responding to the distinctive features, including above all the aesthetic refinement, for which our creativity is renowned. Waiting for the player there are loops of the loop, leaps into the void, real twists and turns of the track and other adrenaline-pumping evolutions that wind along a total of twenty tracks scattered throughout theseother locations: Cairo, Alaska, Abruzzo and Volcano. Very different locations, however united by an excellent stylistic and chromatic coherence and, nevertheless, by the sensation of speed that they transmit to the player. For each region we find five variants of track that are progressively enriched with insidious curves, gravitational accelerators positioned in increasingly critical points and lanes that gradually narrow, forcing you to drive to the limit. Speed limit The only small drawback in a largely positive picture is represented by the level of detail of the spaceships, on the textures of which a little more attention should have been spent: the models are, just like the circuits, harmonious and well proportioned, but lack colorations bit sloppy. Fortunately, these are improvements that can be added at a later time, perhaps through the now inevitable DLC. A small criticism could also be leveled at the HUD and in particular at the absence of a minimap useful both for anticipating the insertion maneuvers and for appreciating the distance from the opponents, but it is not the case to tread too much considering that the build in our possession was still subject to refinements. The driving style brings back memories of the aforementioned past glories. Assuming that the use of the joypad is decisive, it can well be said that the right index finger will (almost) never give a break to the accelerator trigger, while with the thumbs the two sticks must be moved more or less in unison analogue to allow the spaceship to face the curves as fast as possible without hitting the barriers that delimit the runway and which, in addition to slowing down the spaceship, reduce its shields until eventual destruction. Using the turbo and power-up buttons is just as crucial to getting the better of your opponents. In Redout there are no real weapons, but a single optional that drains the energy of the opponent in front as long as it is close enough. As we have seen, to equip this system it is necessary to sacrifice others that make the spaceship more resistant or faster, so that it does not always prove to be a winning tool. Physics is decidedly well studied and in some ways continues along the main road indicated by WipeOut, with which Psygnosis taught us what Formula One could aim to become in the coming centuries. Speed Of Sound Artificial intelligence is another of the strong points of the 34BigThings production: the competitiveness, elevated both from the very first races, is surprising. The danger that those in the lead slow down to make the player recover is averted, as well as the opposite one, i.e. that those chasing miraculously become faster to reduce the gap from the top. The first impact is surprising, also because there is only one level of difficulty and seeing yourself literally stripped off your paint by your opponents on the second straight can create some fear for the novice: however, with experience you can get the hang of the pad and some good ~drifting~ ~ manages to take away more than one satisfaction. The adrenaline that flows abundantly through the veins is also pumped by an in-house soundtrack: it is a real gem usually the preserve of more expensive productions. The result is convincing, with a series of progressive songs stitched on the same frequencies as the rest of the production. Longevity is excellent: the career mode is full of demanding challenges that will require several attempts to be mastered to the tune of gold medals, while the single race is indeed unattractive even due to the impossibility of challenging a friend in split-screen. For the game in the company there is a multiplayer sector that of course we have not been able to test considering the elitist nature of the release in our possession. However, if the title continues to be supported with a continuous addition of content we are sure that the community around Redout will expand rapidly and deservedly.", "date": "2016-09-01", "grade": "8.0"}