{"name": "Pioggia di proiettili", "ref": "https://multiplayer.it/recensioni/173274-touhou-genso-rondo-bullet-ballet-pioggia-di-proiettili.html", "text": "Touhou Project has enjoyed some success in the Rising Sun since the 90s, identifying itself in the so-called ~Bullett Hell~ shoot'em'up sub-genre. The first chapter developed by Team Shanghai Alice arrived on NEC PC-98 in 1996, at the end of the platform's life cycle, and remained confined to Japanese territories only. The game mechanics were inspired by the classic vertical scrolling shooters and put a huge amount of bullets on the screen, to the point of saturating the game screen. These features soon became one of the hallmarks of the series, which in the meantime carved out a niche for enthusiasts and landed on Windows PCs, where it has remained confined until today. The Touhou saga consists of numerous main chapters and various spin-offs; the last in chronological order is Touhou Genso Rondo, originally released on PC in 2012 and converted to PlayStation 4 with the remastered Bullet Ballet edition. The title developed by CUBETYPE takes up the classic universe to which the main series refers, combining traditional shooter mechanics with an encounter structure borrowed from fighting games. The game is about to debut in our territories on September 16, both in physical and digital versions, at the price of 29.99 euros. Touhou Genso Rondo is a spin-off of the Touhou Project series Shoot'em'up at meetings In the Touhou universe, there is a region of Japan called Gensokyo, which has been unknown to the rest of the world for many years. The Harukei barrier, created by a human with enormous powers, divides the rest of the planet from the Youkai race. The lack of contact between the two dimensions has led the outside world to forget about Gensokyo, but in this particular land, humans and youkai continue to coexist with mixed success. For the sole purpose of limiting the belligerent intentions, which continue to warm the spirits of the two factions, the game of Danmaku was set up, in which some girls can challenge each other head-on and with no holds barred. In Genso Rondo the narrative contextualization that we have just summarized is practically non-existent, therefore the role of the characters involved and the related dialogues present in the Story mode will only be framed by those who already have a certain familiarity with the main series. The game offers a roster of ten girls, equally distributed between the two factions. Each heroine is equipped with peculiar attack techniques, which alternate the predisposition to hand-to-hand clashes and cross incursions from a distance. After taking part in the long tutorial, which illustrates all the main forms of interaction available, the training section allows you to do a little preliminary practice before actually taking to the field. The clashes take place one on one in circular arenas, where the player's primary objective is to reset the opponent's health bar, located at the top of the screen. For this purpose, you can resort to long-range attacks and melee raids, both managed by two indicators that regulate their use. Each heroine has a main, a secondary and a third special attack, which vary according to the subject taken into consideration but maintain the high rate of fire and the distribution of bullets for the entire spectrum of the map as a common denominator, as per tradition for the franchise. Alternatively, you can fall back on close combat: each protagonist is surrounded by two concentric circles, the first to indicate the range of the primary melee attack and the second referring to the secondary melee attack. The success of these sorties depends on the timing in completing the action but also on the characteristics possessed by the girl who has chosen to control. By landing the shots it is also possible to receive power-ups that remain in play only for a few moments and can serve to increase the effectiveness of the rate of fire or of the other powers at one's disposal. In addition to the ordinary attacks we have the Charge indicator which, once charged, allows you to enter Spell mode - and in its Final Spell variant during the final moments of each round - and transform the arena into a frenetic battle with a boss for a handful of seconds. The use of dodging is also of fundamental importance: thanks to the pressure of the right back it is possible to perform a lateral rotation in any direction, necessary to avoid the direct frequency of fire or to try to get around the opponent and then hit him from behind with a surprise attack. Unfortunately this system does not always allowto extricate themselves in the forest of bullets that can saturate entire portions of the arena. The battles that rage in Genso Rondo are in fact far too chaotic to enjoy and at various stages of the game it can become complicated to keep track of the indicators at your disposal; consequently it will often happen to make wrong decisions or to let randomness prevail over the planning of a correct strategy, also because, unlike what usually happens in fighting games, there are no button combos that reward the execution technique of the single attacks. Playstation 4 trophies Touhou Genso Rondo Trophies are 30, divided into 11 bronze, 20 silver and 3 gold. The tasks are mainly divided between completing all available storylines and achieving 7 or 10 consecutive victories in Arcade and Boss Rush modes, with all available characters. What are you talking about? Overall Touhou Genso Rondo offers five game modes. The already mentioned History section, during which you have to win some encounters of increasing difficulty, allows you to experience a short adventure in the role of each protagonist. The interlude sequences offer the typical style of visual novels, bearing static images in the background and some dialogue boxes, which unfortunately will be of little interest to those unfamiliar with the universe to which they refer. The Arcade mode draws obvious references from fighting games and allows you to face all the other protagonists in sequence, through a dry round, with the sole purpose of improving your previous record. Boss Rush instead provides a series of questionable challenges against the CPU in Spell mode, during which the player is forced to resist a hail of bullets, in an attempt to empty the enemy gauge before being overwhelmed. As an alternative to the single player options, there are two multiplayer modes: by selecting vsHuman you can challenge a friend locally, while by opting for vsOnline you can challenge yourself with the rest of the community in training or ranked matches. Furthermore, it was not possible for us to analyze this last category, since the servers have not yet been activated.", "date": "2016-09-01", "grade": "6.0"}