{"name": "Un  forastero!", "ref": "https://multiplayer.it/recensioni/173254-resident-evil-4-hd-remaster-un-forastero.html", "text": "Before its release, which took place in Japan on the GameCube on January 27, 2005, Resident Evil 4 had puzzled all the purists of the survival horror genre, presenting in previews and demos game mechanics that were strongly different from its predecessors and much closer to those of a third-person shooter. Jumps, climbs, swarms of enemies simultaneously on the screen fully armed: where was Resident Evil, many wondered? Questions and doubts that however took a back seat when the game arrived in stores and, regardless of everything, it proved to be a true masterpiece in terms of level design, playability, graphics (at the time, perhaps, the best available on consoles) and longevity. Acclaimed by critics and the public, with millions of copies sold in its peregrination from platform to platform, conversion after conversion, Capcom's horror action game also arrives on Xbox One (and PlayStation 4) with a remastered edition, as we will see, it honestly has only the name. In short, waiting for Resident Evil 7, which we recently tried, we hoped to be able to console ourselves with this, but we were rather disappointed... Resident Evil 4 on Xbox One and PlayStation 4 is more of a simple port than a remaster edition From the Hell of Raccoon City to that of El Pueblo Six years have passed since the destruction of Racoon City and the bankruptcy of Umbrella, and now former police officer Leon Kennedy is a veteran of the army special forces sent to Europe for a delicate mission: to rescue Ashley Graham, the daughter of president of the United States of America held captive by a mysterious sect in a small village lost in the mountains of Spain. But there is something else wrong over there: there is talk of mysterious disappearances, of brainwashed people who go crazy and kill. Is there any connection between these events and the sect? And who is behind this strange organization? At the time of its release, as many of you will remember, the game proved to be revolutionary in terms of mechanics, especially considering the saga to which it belonged. With this game, in fact, Resident Evil took a definitive turn, then taking an action drift in the future that was not appreciated by most historical fans. The first big difference compared to the past was the completely 3D environment with the fixed third person view, placed directly behind the protagonist's shoulders, which instead always remained in the lower lateral corner of the screen. Shot controllable within certain parameters, which in the years to come would be adopted by other famous games. Then the gameplay which, as mentioned before, turned towards a system that abandoned puzzles, slow rhythms and tension in favor of another more focused on action and first person shooter schemes. Key elements that we obviously still find today in this porting, together with all those that at the time constituted a real novelty, such as enemies for example. In fact, the creatures and the infected are not the traditional zombies of the past, but for the most part fast, intelligent monsters capable of often using weapons, tools and interacting with the elements of the scenario such as stairs, doors and so on. This more aggressive but also reasoned and ~team~ nature of the enemies forces the user to take a more dynamic approach to the action, making the most of both the agility of the character, who can in turn use elements of the scenario to defend himself, hitting or blocking passages, and certain physical abilities to kick, climb or jump out of some windows, perhaps to avoid close combat or getting trapped. Not to mention the many weapons he will come into possession of throughout history. Leon's arsenal is more stocked than ever, ranging from different types of pistols to bazookas, grenade launchers and sniper rifles. But they will all be needed, some more, some less, to get to the bottom of clashes that in the end prove to be very fun and quite varied, like the level of challenge, especially when you have to face the various bosses at the end of the area, even if they are sometimes present QTEs. Xbox One goals The objectives of this edition of Resident Evil 4 are twelve for a total of 1000G. To obtain them you must progress in the adventure, to be completed perhaps at the highest difficulty, or satisfy certain requests. like collecting all caps or defeating El Gigante. Technically below expectations For the rest, the game remains quite long-lived, at least for those who don't know it well and already know how to move and how to act. In addition, it can count on a decent rate of replayability thanks to the things to discover and the extra modes inserted, what acesthey cure several more hours of fun. Moving on to the technological part, which in some ways is the one that sometimes interests the user the most on the occasion of remastered titles for better performing consoles than the original ones, Resident Evil 4 HD Remaster is re-presented with a graphic resolution equal to 1080p and with a frame rate pegged at 60 frames per second. But here the problems arise: the game, among other things the oldest of the three reproposed in recent months by Capcom and therefore more in need of ~treatment~, has not undergone major improvements and indeed, to be honest, the graphics of the Japanese company didn't even try too hard to insert some more complex textures. In fact, graphically, the game seems to have been taken and transferred to Xbox One without further changes except, as mentioned, resolution and frame rate, with the latter parameter guaranteeing greater general fluidity. Paradoxically, however, with the resulting clean graphics, the visual rendering gains in sharpness but loses it in everything else: flat and low-resolution textures, for example, are much more noticeable and therefore clash more in the context, especially in close-ups of objects or in reverse shots of some element of the scenario placed near the camera. Instead, it goes a little better with the lighting system: in this sense, the developers have implemented a new process (or reworked the old one) for the management of light sources which significantly improves the play of light and shadows, but don't expect who knows what miracles. For the rest, even the polygonal mass is exactly that seen on old consoles and personal computers, like the rest of the sound, which however can boast the good old speech in English and Spanish, with the classic Italian subtitles. In the same way, even after years, the music and sound effects remain spot on, which as always manage to recreate the typically horror atmosphere of the adventure in a valid way.", "date": "2016-08-31", "grade": "7.0"}