{"name": "Relitti spaziali", "ref": "https://multiplayer.it/recensioni/173148-phantaruk-relitti-spaziali.html", "text": "Phantaruk tells a story we've heard before, that of a research ship turned into a tomb adrift in space by too much ambition of human beings. In this case the ship is called Purity-02 and the ambition was to create the usual superior beings. The result was the massacre of the entire crew caused partly by the toxin emitted by an alien parasite, partly by a legendary creature called Phantaruk, which as you may have guessed also gives its name to the game. Finding out what happened is up to the player. In terms of gameplay, it all translates into classic Amnesia-style first-person horror, where you have to crawl forward in the shadows to avoid detection. We'll talk about an important mechanic later in the review that attempts to differentiate Pantharuk's gameplay from the competition, but for now, be content with knowing that the protagonist has a flashlight, whose batteries need to be replaced from time to time, and that the narrative is conducted for recorded messages, accessed via a transmitter, and for written texts lying around the ship. Phantaruk in game terms is the classic immortal opponent, which can only be evaded. In case he sees us, we have to run for cover in some hiding place, hoping he doesn't find us. It's a very slow creature, hanging around the ship hunting for survivors (us). To escape him you have to stay out of his sight, perhaps trying to stay silent in dark areas. An eye-shaped icon helps us to understand our level of visibility: when we are completely hidden it disappears, while when we are in full light it is clearly visible. Unfortunately, the lighting system does not help us understand which are the dark areas and which are the illuminated ones and sometimes we find ourselves visible and helpless in a point that we thought was dark (perhaps behind a box), while in other cases the eye disappears without there being a noticeable variation in lighting. Nothing dramatic, because you soon get used to it and because in any case you tend to identify hiding places a priori to be exploited in case of escape from the monster, but this aspect could have been taken care of more, also considering that graphically the work done on the game it's not bad: we are not dealing with a masterpiece, but as an independent title for a few euros Phantaruk is doing just fine. Sure, it makes a lot of use of stock items, but it's inevitable given the production level put in place. However there are several suggestive and interesting passages, which show great skills in the team, evidently under-exploited (it would be nice to see them at work with more resources). We reviewed the horror Phantaruk, without much excitement. Find out why Overdose Phantaruk's most important mechanic, which is also the one that characterizes him, is the need to inject himself with an anti-toxin antidote from time to time so as not to end up like the rest of the crew: dead. In terms of the game, this translates into the need to go looking for syringes to inject when a counter starts signaling that the protagonist's poisoning alert level has been exceeded. Having such a sword of Damocles hanging over your head for the entire adventure enormously changes the way the gameplay develops compared to the canons of the genre, both in terms of rhythm and on an emotional level. Normally in an Amnesia-like survival horror you tend to progress very slowly, for fear that there is some danger around every corner. The same also happens in Phantaruk, at least until you realize you don't have too much time and, above all, that there aren't very many syringes scattered around the ship. The situation that arises is paradoxical, because horror, which would impose slowness, instead asks us to run as soon as possible. In reality, enough time passes between the administration of one dose of antidote to allow us to explore the area in which we find ourselves, but it is still impossible not to take it into account and not to feel the anxiety grow. The timer mechanic also carries a big risk: that of getting to the next checkpoint without a spare syringe, making it impossible, or very difficult, to continue the game. In these cases, running to find one becomes imperative, but sometimes frustration can force the whole adventure to be restarted. To solve the problem and enjoy the game more slowly, we have adopted an incorrect tactic: in case of excessive consumption of time exploring an area, we let ourselves die to start over from the last checkpoint, thus proceeding at a faster pace. The problem is so acute that the development team has already tweaked the number of yes several timeslines traceable in the maps. In the latest version (1.4.1 at the time of writing the review), the situation is much improved, but the mechanics remain as interesting as flawed in their essence. Quick escape Despite what is written above, Phantaruk is a very easy title that can be finished within two / three hours, depending on how quickly you can proceed. Purity-02 is not gigantic and soon reveals most of its secrets. In addition to Phantaruk there is another threat around, more complicated to overcome, but not very frequent and, above all, not very problematic once you understand how it behaves. We do not go into detail because it is one of the twists of the game and to explain it we should reveal a piece of the plot. Let's say it's an unexpected variant. The fact is that the end comes soon and the reasons for returning a second time to Purity-02 are very few. You may want to delve deeply into the environments you've rushed past, to look for some hidden message or object, but there's nothing strong enough to keep you from playing. In short, details aside, a single lap is enough to discover how much Phantaruk has to offer, both in terms of narrative and gameplay. A little bit, if we also consider that we are certainly not dealing with a milestone in videogame storytelling, despite the good writing and good dubbing (only in English). Some horror fans will appreciate it, but others", "date": "2016-08-30", "grade": "5.0"}