{"name": "Torchlight: Infinite", "ref": "https://multiplayer.it/recensioni/torchlight-infinite-recensione.html", "text": "Once upon a time Torchlight: the dream of Travis Baldree and the Schaefer brothers to create a rival to the mammoth Diablo was touched upon with the first two chapters, but the series then strangely got lost, perhaps in search of a formula that would free it right from the cumbersome shadow of the Blizzard title, without ever being able to find its own precise identity. As we see in this review of Torchlight: Infinite, even the attempt to transform it into a free-to-play action RPG strongly based on mobile use failed in full, marking another uncertain stage in this wandering between videogame structures and forms inconclusive, decidedly far from what had been achieved with Torchlight and above all with Torchlight 2. On the other hand, this path is also a reflection of the complex transformation that the series has gone through in terms of development: after the first chapters of fine craftsmanship on the part of Runic Games, the passage under Perfect World Entertainment could only mean a clear shift towards MMO ambitions which then only partially emerged with Torchlight 3, while the departure of the major original authors left room for quite questionable drifts. Torchlight: Infinite, in this sense, has almost nothing left of the original spirit, having been entrusted en bloc to the Chinese team XD Games which has carried out a certain revolution of the structure, while admirably maintaining some characteristics of the original chapters, starting from peculiar world building and cartoonish graphic style. The world is still characterized by that particular mix of fantasy elements and steampunk grafts that we loved previously, with those bright colors and that variety of settings that contrasted with the typical style of the first Diablos. There is still talk of Ember as a fundamental energy for civilization and of a great looming threat, against which to launch pet-supported fighters, but the humorous and ironic spirit that distinguished the first two chapters has been somewhat lost, replaced by a rather anonymous story, decidedly terrible dialogues and forcibly edgy characters. In short, heroes and settings are well designed, but the narrative is not really a strong point, although this has never been a fundamental element in this genre of games. Gameplay and combat system Torchlight: Infinite, the initial characters What matters in a hack and slash action RPG of this type, however, are essentially two elements: the combat and the progression of the character through the accumulation of experience and above all of loot. From a structural point of view, both pillars hold up in a rather convincing way, but are affected by the classic negative drifts of mobile games, because the latter is the area to which the developers clearly wanted to aim, although Torchlight: Infinite is also present on PC. Characterized by the classic ~isometric~ shot, even if perhaps a little too close, the game makes us explore various areas of the world of Leptis following different quests which essentially involve clearing areas of enemies up to the clash with the local boss. The combat system is typical of action RPGs of this type, which substantially requires a constant use of attacks and special abilities depending on the chosen build, short or long range, in this case with extremely low cooldowns which greatly increase the pace making it almost frenetic (and very little strategic, to be honest). The level of challenge is not exactly prohibitive, at least during the first hours of the game, but there is a good progression towards the higher levels, with some moments more challenging especially at the bosses. In essence, everything is based on choosing the right skills to place in the keys on the control interface, given that the alternation of these is essential to win, as well as the enhancement of the standard attack through modifiers. In this sense, the positioning of the character and the ability to evade have much less importance, given that it is above all a question of attacking constantly and with the greatest possible power, as well as recharging one's energy with the right timing. The almost canceled wait times transform the mechanic into a kind of button masher that does not require great reasoning, but there is a satisfying sense of physicality in the attacks and in the way they land, knocking out hordes of enemies. Character progression and management Torchlight: Infinite, a scene in the beginning of the game Torchlight: Infinite boasts outstanding numbers when it comes to the amount of possible combinations on builds: we are talking about 24 different skill trees for a total of 230 unlockable skills, even if the bombastic figures are not necessarily reflected in the actual differences in terms of game mechanics. However, they work very well to get us in the classic mechanism of constant progression, which is always the strong point of this type of action RPG. The initial choice is between 6 characters, each characterized by its own fighting style and specific weapons, even if strangely there is a certain overlap between some skills that blur the line between one type of fighter and another. probable consequence of the huge amount of skills and traits found in the game. The progression system is extremely stratified and complex, so much so that it becomes rather cumbersome and convoluted: in addition to the standard experience level, you need to keep an eye on the skill trees of the traits of the character, with the enhancement of each single node that determines variations on the power of active and passive skills. Torchlight Infinite, the skill tree of talents The system is positioned halfway between Path of Exile and Diablo but is a little more difficult to understand at first, also due to an interface designed to work best on mobile platforms which however results in a chaos of unclear information which can easily lead to error. Between skills, sub-skills, modifiers, nodes to activate and upgrade and obviously care of equipment, armor and weapons there is something to get lost, but unless you are a big leveling and loot fetishist this it is not necessarily always a good thing. Obviously, the enhancement also includes micro-transactions, and here the most critical elements emerge: the developers had promised a fair system and no forced battle pass at the time of the beta, intentions which, however, have evidently been canceled at launch. Torchlight: Infinite has the classic free or paid battle passes that unlock various rewards, as well as several features that are only found behind paywalls. Among these are some class-specific traits and the Pactspirit system - meaning pets in this chapter, which are crafted as passive skills - which is mainly developed through a rather expensive gacha system. In addition to this, there are also various paid Quality of Life options such as automated auto-loot systems, new inventory and auction house slots, and other elements. Difficult to call it ~pay to win~ since there are no multiplayer elements in the game (at least for the moment) but the typical predatory monetization characteristics seem to be there. Graphics and performances Torchlight Infinite boss fight The technical aspect is perhaps the most successful element of Torchlight: Infinite, which comes with really excellent graphics and able to scale in the best way on a plethora of different devices, also helped by the cartoonish characterization that masks well any loss of detail. The design of the characters and their skins is very captivating, which is of no small importance in a game of this type, but the settings are also nice and pleasant, prompting us to explore the different settings. It must be reported that the different armor and accessories do not change the appearance of the character, with only the different weapons that are actually visible during gameplay, unless of course you totally change the skin of the fighters, a secondary detail but which could be important to some enthusiasts. The performances sometimes show the side on less performing hardware, but they never become a real obstacle to use, therefore from this point of view the XD Games team has worked particularly well, creating a game capable of presenting itself optimally both on smartphones than on PC, with the possibility of being played in total cross-play from one platform to another. In this excellent technical framework, strangely, there is still no place for multiplayer: the developers intend to insert the functionality in the near future, but at the moment it is an action RPG missing an element that has become fundamental for many players. Torchlight Infinite, a gameplay scene From a certain point of view, the absence of PvP can be positive for not being faced with the pay to win problem, but at least a cooperative mode would be desirable in a game of this type and the lack of it is rather felt. In the main hub area it is possible to see other players connected online, but we can only try to chat with them, ifwithout any other possibility of interaction. As regards the mobile version in particular, i.e. the one specifically reviewed, some critical elements linked exclusively to this one are found. The first is given by the mammoth size of the software, which requires several and downloads capable of significantly weighing on the archive of any device, while the second is the classic problem of the touch screen interface: the sticks and virtual keys work properly, but the ideal solution is always the use of an external controller.", "date": "2022-10-22", "grade": "7.0"}