{"name": "Medaglia dhero", "ref": "https://multiplayer.it/recensioni/172351-sports-hero-medaglia-dhero.html", "text": "With the opening of the Rio Olympics, it was inevitable that the App Store and Google Play offer would adapt by showcasing applications and games dedicated to this great sporting event: in this regard, one of the hottest names these days is of Sports Hero, a title created by the Polish team Cherrypick Games which - although not directly connected to the Brazilian event - has managed to capture the attention of users thanks to an old school style reminiscent of the 1983 Track & Field forerunner. Beyond of the nostalgic component, so let's see if Sports Hero will be able to deserve the top step of the podium. Sports Hero is a hymn to nostalgia, but seasoned with little content and too many advertisements Few sports, many commercials The Sports Hero play offer is made up of six specialties, only one of which is available from the outset: thanks to a rather unfortunate design choice, which forces the user to repeat the same events over and over again to accumulate the points necessary to unlock the next ones, unless you are willing to use your credit card by paying 0.99 Euros to purchase a new discipline or 3.99 Euros to have access to the complete package. The 100m run, weightlifting, javelin throw, 50m swim, steeplechase and long jump make up the (admittedly rather meager) menu of Sports Hero, it can also be tackled in a multiplayer mode for two players and characterized by gameplay mechanics that are quite similar to each other, which most of the time require the player to press furiously on the two virtual keys on the screen. Nothing new compared to what has already been seen in many other titles over the past decades, with the exception of touch support which obviously has a different feeling to the physical buttons: evidently aware of this, the developers have also granted the user the possibility of swiping the finger between the two inputs instead of tapping, which is actually much more comfortable and tends to guarantee even better results. Beyond this, it certainly cannot be said that Sports Hero amazes for particular merits: to begin with, the quality level of the various disciplines is far from constant, an element that is not insignificant if we consider their already small number. Despite this, then, Cherrypick Games hasn't really racked its brains to offer content that would make up for these shortcomings, given that in the game you do nothing but repeat the same activities with no other goal than improving your own records: a greater emphasis on competitiveness certainly would not have hurt, also because opponents controlled by artificial intelligence are practically never serious competitors for the gold medal. This does not mean that Sports Hero can still prove to be a pleasant pastime, good for a few fleeting games in their spare time especially for those who have enough years on their shoulders to remember Track & Field and beautiful company: the decision should probably be framed in this perspective of the developers to rely on an absolutely old-school technical component, with dignified pixel art graphics and a chiptune-style sound accompaniment so minimalist as to be immediately repetitive. What is certain is that those wishing to amuse themselves for a few minutes with Sports Hero will also have to take into account having to waste some time closing the advertisement windows which (very) often invade the screen, not to mention the 30-second commercials which there is no way to jump. A media bombardment that is certainly excessive in proportion to what the game really has to offer.", "date": "2016-08-11", "grade": "6.5"}