{"name": "Sacre Leggende bistrattate", "ref": "https://multiplayer.it/recensioni/172302-sacred-legends-sacre-leggende-bistrattate.html", "text": "It is a strange parable that accomplished by the Sacred series, which although it has never reached incredible qualitative peaks is always remembered with a certain affection by the players, if only for being one of the most valid alternatives to the most famous hack and slash RPGs. Started with a first chapter in some ways excellent, the series suffered a sudden collapse with the next two chapters, including the bizarre Citadel, a 2D action-style digression and finishing rather low with the third chapter. This does not mean that the title still has its admirers and a certain appeal on the gaming market, reason enough to try the mobile road with a sort of spin-off perfectly suited to this particular environment, which essentially means two things: a Extremely streamlined gameplay and the classic free-to-play model. Unfortunately, Sacred Legends adopts some rather poor characteristics of mobile video games, even if at least it tries to propose an interpretation of hack and slash that can be enjoyed even without the use of a mouse, keyboard or controller with even good results. In essence, it is a question of choosing a protagonist belonging to one of the three available classes (seraphine, warrior and archer), obviously each with its specific characteristics in combat, and advancing within a rather bland story composed of various stages to complete fighting against the enemies present in the various locations. The levels always follow the same pattern, presenting three battles in sequence with progressive difficulty, at the end of which you get rewards and the possibility of continuing to the next stage, which basically repeats the situations of the previous one with some variations in terms of quality and quantity of enemies present. There are also some side missions more based on the collection of materials useful for upgrading equipment, but these have a timed activation which forces you to wait rather long, unless you spend it to reduce them, of course. Sacred Legends dusts off the famous hack and slash series for a new mobile-style adventure Automatic Warriors To meet the type of use of mobile platforms and the touch screen control system, player interaction during the levels is reduced to a minimum: with the protagonist (together with any party mates) who automatically attacks with standard moves , we simply find ourselves pressing the keys corresponding to the special skills as soon as they have loaded, with the only foresight to calculate the times well, choose the right skills and perhaps save the most powerful ones for the final clashes. It is a dynamic already seen in several other mobile titles and can only generate a certain tedium in the long run, although it stands by the push to collect loot and level up the character, springs often enough to make us face almost identical levels several times repeatedly. Where Sacred Legends works best is probably in the management of the character, with a large amount of parameters to keep under control between evolution of statistics, active and passive special abilities and many objects with different levels of rarity to equip, improve and forge, the main engine of collecting treasures and conquering various rewards. The latter are also awarded through daily or fixed ~pseudo-quests~, which require you to perform certain actions during the game but without any reflection on the structure of the levels, being essentially cumulative performances that are achieved as you progress through the story. Microtransactions have a certain weight in the game, as they can cut practically any wait, and they are practically everywhere, starting from the need to refill the food used as mission access currency to the possibility of obtaining extra rewards with the payment of gems. In short, the paywall is there and makes itself felt, even if to tell the truth it is reached after a sufficiently long playing time, at least to make it clear whether it is appropriate to invest time and money in this title or not.", "date": "2016-08-10", "grade": "6.8"}