{"name": "Overboard!", "ref": "https://multiplayer.it/recensioni/overboard-recensione.html", "text": "It would be wonderful to write the review of Overboard! on the contrary, a bit the leit motif of Inkle's work, the small studio that in 4 months has given birth to a nice narrative journey. Nice, captivating, replayable, willy-nilly if you start it you will finish it. It is a concept of challenge that starts from a nice gameplay gimmick: you are a shrewd assassin who, during an ocean voyage, must convince everyone that she is innocent and arrive on US land free like a nightingale. Fast, calculated to the minute, well told, the story of Mrs Villensey, a self-styled actress with a few skeletons in the wardrobe, kills her husband by throwing him overboard, hence the name of the work. We are therefore talking about a product that is somewhat the opposite, which in its story goes against the tide and pushes us to think far from the paradigms: you don't have to find the killer, you have to avoid being discovered. Of course, recent fashions have made this playful approach somewhat universal but here the round of questioning, response and analysis of the movements of the passengers on the ship adds a single player bite that should not be underestimated. Eight long hours A game scene You have to resist 8 hours in-game: after completing the crime, the epic of Miss Villensey and the ship's crew begins, each with their own personality, background, secrets and mysteries. Every choice and dialogue takes time, but unless you collect enough versions and information, the adventure will end in an eternal defeat loop, destined to be accused of murder for reasons we don't tell each other. Get one cycle wrong, get two wrong, you'll probably get many wrong: each loop brings with it new questions, considerations, deductions told a little at a time through a different path of answers and choices, it seems based on a scripted movement of the supporting actors in the ship. They will always move in the same way, you won't: you will be able to redo choices or change, try other answers, make different gestures. When the attempts begin to be a dozen, then you will learn that there are two ways to speed up each loop: speed up the dialogues or redo the choices of the previous loop, perhaps up to the point where instead you decide to take another fork. Ah, let's not forget the goals: it's not enough to land with an intact criminal record, you have to do it with style and maybe some life results accrued in those 8 hours. An element, this, which adds playability and pushes you to look for a sort of perfect run and trust that it will keep you busy. On the ground... now what? Once this trivial gameplay synopsis has been overcome, it is the narrative element that wins. Overboard! it immediately appears as a title with low production values and yet it works wonderfully, flows smoothly, makes you angry, but also gives satisfaction and all, trivially, with a system of pre-compiled answers. Inkle has packaged a simple mix, which however hooks the player precisely because of its concrete immediacy, without fancy flights of settings, stories or motion capture actors. The narration is the gameplay, and vice versa, in a succession of situations in which you will want to know more, but you will realize that time is ticking and the captain, for example, is waiting for you in your room and not to have a chat. Or you will discover the vices of your husband, or of the cabin neighbor, or you will have to make a sleeping pill disappear, or even put it in a drink to put the spinster lady to sleep. The network of narrative cause and effect is coherent and instantly captivating, promoting a title full of reasoning, reading and criminal slyness. Unfortunately, the title is only in English, but simple enough to understand. There is, in reality, a flaw, but it is truly subjective: longevity. There is no doubt that if you are not a completionist and you are satisfied with reaching land without having done the run of your life but with discreet dignity, Overboard! it will hardly exceed a couple of hours of gameplay. The fact is that it shouldn't be taken like this, not in the usual way: abounding in a continuous overflowing as a result, Veronica's actions and words have after-effects that it's up to you to guide, aware that a mistake is enough to end up in prison and start over. boss.", "date": "2021-06-10", "grade": "7.8"}