{"name": "Vita e destino", "ref": "https://multiplayer.it/recensioni/172140-shiren-the-wanderer-the-tower-of-fortune-and-the-dice-of-fate-vita-e-destino.html", "text": "Spike Chunsoft is a development team that has always been known to fans of Japanese role-playing games due to its vast over ten-year production, focused precisely on products of this genre or on visual novels. The Dragon Quest episodes on the NES, the Pokmon Mystery Dungeon series, and Shiren the Wanderer are just some of the more popular sagas they've worked on over the years. The latter, in particular, in addition to representing in some ways one of the flagships of the group, has just recently seen a new episode of its reaching the shores of PlayStation Vita both in physical edition (for now only in the USA) and digital , on the PlayStation store: it is Shiren the Wanderer: The Tower of Fortune and the Dice of Fate, a classic RPG roguelike capable of arousing the curiosity of fans thanks to its peculiar gameplay. Let's see together why. Shiren the Wanderer: The Tower of Fortune and the Dice of Fate is an RPG roguelike for fans of the genre A destiny already written The setting is typical of dozens of Japanese role-playing games, and draws heavily on many of the typical clichs of the genre. A remote village in the mountains in a fantasy-style feudal Japan and a mysterious Tower linked to a local legend are the backdrop to the events of Shiren, a wandering hero, and Koppa, his ferret, committed to helping the young Jirokichi to save the beloved Oyu, afflicted since birth by an incurable disease. To do this, the two braves together with other bizarre companions, will try to get to the top of the Tower of Fortune, divided into three sections (past, present and future), to change the future established by Reeva, a deity who according to legend governs everything and that through the roll of the Three Dice of Destiny, establishes the fate of every single individual right from his birth. Also as regards the gameplay, Shiren the Wanderer: The Tower of Fortune and the Dice of Fate maintains the typical characteristics of roguelike role-playing games, with a ~sprinkle~ of dungeon crawler elements. As in any title of the genre, therefore, also in this game there is a randomly generated map, a different arrangement of objects and enemies every time an area is restarted, many labyrinths to explore, optional puzzles, monsters to face and treasures to be recovered to temporarily improve one's skills or to earn hard cash to reinvest in fixed equipment. But unlike many other similar products, this one from Chunsoft Spike offers an extremely challenging level of difficulty that forgives nothing to the gamer, who at certain points will not only have to sweat the proverbial seven shirts to overcome certain obstacles, but if he dies he will find himself having to start practically from the beginning of the area and with no more money and objects (with the exception of those set aside, as we will see later). In some ways Shiren the Wanderer: The Tower of Fortune and the Dice of Fate looks like a kind of 16-Bit Dark Souls and with a bird's eye perspective. Weapons, magic sticks, enchanted scrolls and all the consumable items that are recovered inside the dungeons therefore become essential for overcoming certain clashes, and we are not just talking about those in the immediate future. In fact, in the game you have to pay close attention to what you decide to bring with you, because the slots available for objects are very few compared to the use you would like to make of them. To survive, therefore, it is necessary to learn the best way to act and the weaknesses of the opponents, in such a way as to be able to fight them while minimizing losses. In any case, the enemies, always visible on the screen, face each other in real time - there are no random encounters in the game - through a battle system that involves simply pressing a button or selecting an item from the menu, depending appropriate, to make a move. But be careful, for every action or movement performed by the user, one of the enemies always corresponds. In fact, once you have crossed an opponent and entered clash mode, just press the X button to physically attack (the damage done or suffered will obviously depend on the weapon, armor and shield used at that moment), or select an action from the menu for Shiren, while the other party members, usually two, do it themselves. If desired, it is also possible to call up a grid on the ground, as in strategy RPGs. PSVita trophies There are fifty-five total trophies in the game, split between one platinum, two gold, six silver, and forty-six bronze. To obtain them, you must progress through the adventure by obtaining rare items, eliminating a certain number of enemies or a particular boss, leading to a certainlevel weapons or characters and so on. Be careful in the dark The possibility of making friends with certain types of monsters thanks to special ~friendship pacts~ is amusing. If, for example, one is available for the Flamebirds or the Mamels, two races of creatures present in the game, all those who are part of those families of enemies will not only not attack the protagonist, but in many cases they will fight alongside him! These ~licenses~ can be recovered by exploring the dungeons, or be purchased in special shops inside human villages, like other objects such as weapons and skills, while in other buildings such as banks or specific warehouses it is possible to deposit money up to at that time earned or store all recovered goods. A wise way to manage one's resources and avoid losing all the loot collected in the event of premature death. Another peculiarity of the title is the presence of a day-night cycle which in fact completely changes certain mechanics. If during the day the objective is to explore the areas and advance from area to area, with darkness falling you must instead worry about escaping and surviving. In the dark, in fact, powerful and aggressive entities arrive, so frightening that even the other creatures flee. In fact, these Beings attack monsters and characters managed by the user without distinction, and are really a tough nut to crack. Shiren the Wanderer: The Tower of Fortune and the Dice of Fate also offers both cooperative and competitive local multiplayer modes. In the first case it is possible to fight together with a friend in the various dungeons, while in the second one you can fight against each other and act in a non-chivalrous way, for example by stealing the opponent's objects. Then there is a nice function that allows a user to call another adventurer who is connected at that moment to help him: once he is dead, a menu appears where the gamer is asked if he wants to ask for help or not. But the number of times this system can be used is limited. As for the technical sector, the production offers an entirely 2D graphics engine that immediately brings to mind the good old Super Nintendo or Mega Drive games, even if thanks to the PlayStation Vita processor scenarios, characters and anything else related to the aesthetics of the game they appear more defined and colorful. The soundtrack, also similar to that of dozens of old 16-Bit video games, is discreet, alternating musical pieces that are catchy in their own way, with others that are a little repetitive.", "date": "2016-08-08", "grade": "8.0"}