{"name": "Assolutamente Gran Turismo", "ref": "https://multiplayer.it/recensioni/172169-assoluto-racing-assolutamente-gran-turismo.html", "text": "Although being clearly inspired by a famous product may not correspond to the vision of the video game market that unites many users, it must be recognized when a project is created on the basis of mere economic convenience and when, instead, it moves from the developers' passion for a certain vein and for its highest representatives. That said, raise your hand if you think it's easy to make a credible clone of Gran Turismo. On mobile devices. With a team of six people. It only takes a few minutes to understand that the guys at Infinity Vector have worked a half-miracle with Assoluto Racing, moreover without resorting to who knows what monetization mechanisms: you play completely free of charge, without waiting or ~fuel~ to refill after a race, and each event guarantees a handful of credits that can be set aside for the purchase of a new car or the upgrade of those in our possession. Considering the incidence of the most important upgrades, usually those concerning the engine, it is also quite easy to switch from one performance category to another with a view to the same car, thus earning the right to try your hand at the various types of racing at the moment available. A true work in progress, which with the next updates will introduce drift-type races and new vehicles, Assoluto Racing currently boasts a line-up made up of thirteen truly existing cars, produced by Honda, Mitsubishi, Nissan and Peugeot, with which to face a handful of circuits to get all the required medals or complete skill challenges. Assoluto Racing manages to position itself as a credible clone of Gran Turismo for mobile devices Curved brushstrokes There are different sensibilities in this regard, but we found the Assoluto Racing control system almost perfect. The game has various layouts and also supports physical controllers, but the default setting immediately won us over, in particular thanks to a wise and shrewd use of the accelerometer, which literally allows you to brush the curves and dose very gradually the steering, while with the thumbs it is possible to manage the accelerator, brake, handbrake and possibly the gearbox. Going from the classic third person view to a more distant one, to the ~simulation~ first person or even to the replay camera, just for completeness (driving like this is in fact impossible), the possibilities are really many and the experience can really be customized according to your preferences, be it the layout of the buttons or their size, as well as the sensitivity of the tilt. Having taken note of the solidity of the system, the rest becomes almost accessory: the numbers on offer are not stratospheric at the moment and the races are often designed for very rapid use, on one lap, but the quality of the driving model is so clear to bear the weight of the whole package by itself. The excellent graphics from sixty frames per second, the realistic models of the cars, the excellent lighting system, the sound effects and the music that refer to the great Gran Turismo are almost in the background. On the other hand, what appears to be the greatest limitation of this production weighs heavily, namely the fact of racing against the clock or in search of perfect performance, but always and in any case alone, without other cars on the track. Is this also an aspect that we will see change with the next updates?", "date": "2016-08-06", "grade": "8.0"}