{"name": "Tre contro tutti", "ref": "https://multiplayer.it/recensioni/172091-suicide-squad-missione-speciale-tre-contro-tutti.html", "text": "Suicide Squad: Special Mission immediately distinguishes itself from the plethora of tie-ins that crowd the mobile market for one fundamental detail: it is truly free, therefore without relying on those well-known (and often unpleasant) free to play mechanisms that provide in one way or in Another thing is the payment of small sums to be able to continue without resorting to grinding or recharging times. Simply download the application to amuse yourself with an FPS that allows you to take on the role of Deadshot, Harley Quinn or El Diablo, engaged in playful mechanics that follow those of the Horde modes typical of many competitive shooters. Appreciable because it is free, Suicide Squad: Special Mission, however, proves to be too repetitive Group suicide The intentions of Suicide Squad: Missione Speciale to go straight to the point without too many frills can already be understood from the main menu: it is possible to change the options, watch the trailer of the film, view the online rankings and above all launch into the only game mode available, who also doesn't waste too much time giving a narrative context to the action. In fact, a very short sequence shows a crashing helicopter, from whose carcass the three protagonists emerge, forced to defend themselves from the attack of humanoid monsters in a city scenario. A couple of tutorial screens prove to be more than enough to educate the user on the gameplay, effectively divided into a series of phases that end when all enemies are eliminated, thus allowing you to switch to a different portion of the scenario to start the game again. process. At the beginning of each round you can choose which of the three (anti)heroes to play as, all of them different enough to guarantee a different approach to the game. Deadshot is the character closest to shooter standards, armed with an automatic rifle and wrist pistols that make him most effective from long range; El Diablo, on the other hand, focuses entirely on short-range combat, taking advantage of his ability to throw flames from his hands; Finally, Harley Quinn represents a compromise between the previous two, being able to shoot enemies with a revolver or hit them hard with her proverbial baseball bat. Beyond what has just been described, the offensive skills of the protagonists are completed by a personalized special move that can be activated after having collected a certain amount of kills and which helps to clean up opponents with the added value of a bonus score. This is an aspect not to be overlooked, given that since there is no real campaign or multiplayer mode, the only real objective that the player can pursue in Suicide Squad: Missione Speciale is precisely the achievement of the hi-score, which unfortunately, however, passes through to extremely unhappy design choices that heavily affect the life expectancy of the title. Beyond an evidently repetitive play structure, the major limitation of the product lies in the absence of any progression model that stimulates restarting after a game over or the abandonment of a game: every time the three protagonists are defeated or closes the application, the only alternative is to start over without even having inherited the power-ups accumulated in the previous game. A solution that inevitably makes the game tire very soon, and it's a shame considering the goodness of the production values put in place by the developers: from a graphic point of view, a tasty style in cel shading is accompanied by an enviable fluidity, while under the profile of the controls everything works perfectly, thanks to two virtual sticks that allow you to easily manage movement and aim with the character who fires autonomously whenever an enemy is framed by the reticle.", "date": "2016-08-05", "grade": "7.0"}