{"name": "Tom Clancy's Ghost Recon: Advanced Warfighter - Recensione", "ref": "https://multiplayer.it/recensioni/tom-clancys-ghost-recon-advanced-warfighter-recensione.html", "text": "Different Twins We are part of the Ghosts, a selection of the best fighters of the American army, our aim is to infiltrate behind enemy lines and act invisible, just like ghosts, achieving strategic objectives without creating a fuss around the mission. In the near future, all special commands, such as ours, will be equipped with highly advanced technology, called Integrated Warfighter System or better IWS, which will help soldiers on the battlefield, providing, through the Cross-Com, a special viewer, fundamental information in real time and signaling the presence of enemies around our position. In GRAW, set in Mexico City in the year 2013, we will use this very advanced technology and, playing as Captain Scott Mitchell, leader of the Ghosts, we will have to save the President of the United States of America, recover some nuclear weapons and eliminate a large rebel group; this in a nutshell is the plot of the offline mode of the game. During the campaign divided into twelve missions, for about ten hours of play, the action will dominate and we will find ourselves faced with the most varied situations to complete, crossing different areas of Mexico City together with our men. As anticipated we will be able to count on the IWS system, an on-screen hud that will provide us with fundamental indications for the achievement of the objectives, from trivial information on residual ammunition and state of our health, to an advanced communication system that will display a small window, with the of the picture in picture, at the top left of our screen every time we receive a higher order. Above all, this system will allow us to monitor the area around our action group, receiving the signal from special cameras placed above the helmets of our men. In the PlayStation 2 version, this last function has been replaced by the presence of a small map, which in practice has proved to be quite useless. The window that opens when we receive orders is certainly excellent from the point of view of identification with the game, unfortunately the technical realization is not of the same level, vaguely recalling a kind of animated gif. GRAW for Xbox was set up by Ubisoft Shanghai as a canonical first person FPS with rifle view Different twins GRAW for Xbox and PlayStation 2, unlike the version for its older brother from Microsoft, was set up by Ubisoft Shanghai as a canonical first-person FPS with a rifle view, so forget the ~over the shoulder~ view that made it famous GRAW on Xbox 360. The choice of combining the display of the hud with a canonical view with the shotgun in the foreground could certainly be managed better; in fact, the screen display already reduces visibility by itself and when combined with the close-up of the shotgun, it greatly limits the field of vision. From a technical point of view, the product as a whole was created in a somewhat hasty way, the polygonal models have a decent level of detail like the animations which are quite good, while the urban areas have poorly defined and particularly dull textures. The lighting on Xbox 360 had made a miracle by implementing HDR, here instead the clear and diffused light makes everything seem ~washed out~ and with few details. The problems then continue with the presence of excessive ~fog~ in the distance, not allowing the player to have a clear view of the horizon and significantly affecting the possibility of long-range sniper shots. The game scenarios are then very repetitive, with the same number of blocks repeating themselves almost in sequence. The frame rate is also often uncertain, resulting in several slowdowns to the game engine inexplicably even in situations that, in principle, should not weigh too much on the hardware of 128-bit consoles. Gameplay After doing this long technical examination let's examine the gameplay. As already anticipated, Ubisoft Shanghai has decided to depart both from GRAW for Xbox 360 and from the previous episodes of the series, differing considerably from the first Ghost Recons, which made tactics their strong point, and strongly approaching the Rainbow Six series, much more immediate and turn to the devastating and close-quarters firefight. First of all, the first big news is the fact that in this new chapter we will command only one soldier, Captain Mitchell to be precise, unlike what happens in the Xbox 360 version, and what happened in the previous chapters of the series. The movement of our character and that of the soldiers has been accelerated, it is not possible sdgetting down to shoot and even hiding around corners has become problematic. Let's not talk about precision shots, we have already talked about long-range fogging problems, we must add to these the frustration of seeing our sight move quickly from one side of the target to the other, we will have nothing else to do if don't wait for the right moment to fire. Quite an irritating system. All these changes are obviously reflected in the behavior of the gamer, now much more dedicated to direct, frontal assault, with heavy bursts of fire, forever abandoning the silence of real ghosts. We liked the missions, very varied and full of action Gameplay We liked the missions, very varied and interesting, we go from recovering important personalities, such as the President of the USA, to preparing defenses in anticipation of the assault by rebel militiamen. The possibility of calling the combat helicopters and the elite of the snipers to our rescue is also pleasant, just a pity that the possibilities of interacting with these two teams are very limited. The multiplayer modes have not been neglected at all and the implementation is also particularly noteworthy, at least on Xbox: there is a cooperative campaign to be played in two both in split screen and online, to which are added the usual online and system link modes up to twelve players simultaneously. The maps are very good as are the modes ranging from the classic last man and team last man, to hamburger hill or assasination, with extensive customization of the game servers capable of making every game exciting. For PlayStation 2 there is no split screen mode and the online game is reserved for only eight participants, for the rest the maps and modes are all confirmed. Comment Tom Clancy's Ghost Recon Advance Warfighter left us with a lot of bitterness in the mouth, the developers wanted to keep GRAW a traditional shooter, bringing it very close in terms of gameplay to the other Ubisoft saga, namely that Rainbow Six which at least in the console environment bases everything on the frenetic action. The tactical component that has always characterized the adventures of the Ghost team has been completely lost, moreover the technical sector is very subdued, it is difficult for us to believe that the finished product is a game of the latest generation of software that runs on Xbox and PlayStation 2. The variety of missions is good as well as the longevity of the campaign, which is further increased by the many modes to be used online and in System Link. So forget the Xbox 360 version, you would only hurt yourself, since it is not even remotely related to this new episode that appeared on 128-bit consoles. We can only recommend the game to fans of the series and to those who want some action. Pros Very varied campaign Multiplayer game Cons Technically only sufficient It's no longer GR but it looks like Rainbow Six Cross-platform The versions we tested were quite similar in terms of gameplay and while the technical sector reserved for the game on PlayStation 2 is decidedly lower. Apart from the presence of aliasing and slower loading than Xbox, the thing that bothered us the most are the interruptions during the missions. The levels, in fact, on Sony hardware, given their size, are broken up into two or three sections per mission and long loads must be endured between one ~block~ and another. Precisely because of these limitations present in the version for the Sony console, please remove half a point to a whole point from the vote in the review. With the advent of the next generation, all the most important publishers, for their most prestigious titles, have decided to publish various versions, using different game engines, in order to offer a product dedicated to the single console in which it will have to run. This is what happened to Tom Clancy's Ghost Recon Advance Warfighter, Ubisoft's flagship title for Xbox 360, which now also arrives on Xbox and PlayStation 2, developed for the occasion not by the French publisher's American branch but directly from the Shanghai division , will be the same success?", "date": "2006-04-18", "grade": null}