{"name": "Mastodontiche", "ref": "https://multiplayer.it/recensioni/171831-micro-machines-mastodontiche-da-chillingo.html", "text": "Times change and the Micro Machines adapt, apparently, even if something of the original spirit seems to have remained in this sort of free-to-play racing game specially designed for the mobile market. If you were lucky enough to live the videogame 90s live, it is likely that you took part, at least once (but more than once it is probable) in a multiplayer game of the old Micro Machines released on the major 8 and 16-bit systems. bit. Thinking about it now, it could be a sort of time capsule for the videogame style of the time: a genuinely arcade racing game, devoted almost exclusively to multiplayer (offline, of course), which staged basic graphics in a party of bright colors and typical elements of the daily life of the time, or at least a representation of it. Knowledge of the original could represent the best starting point for enjoying this new Micro Machines, taking advantage of the nostalgia effect, but it is also a double-edged sword: if on the one hand the affection for the brand - still alive in those who all era really collected the little cars - it represents a significant push towards this title, the gap between the genuine light-heartedness of the 90s arcades and this complex business model proposed with the free-to-play mechanics and the cumbersomeness of the system is now too evident touch control. The microtransactions are not very invasive but their presence begins to be felt after a few initial games in which everything proceeds in a very natural and expedited way, with the need to reach new car models in order to unlock different races and specialties , without which we easily get stuck on the initial choices, which are not very varied. The other problems of Micro Machines, if compared to the original, are the design of the tracks and the control system: even the old series bet everything on simplicity but this was associated in a particularly apt way with the stylized graphics of those years, while here the search for greater refinement tends to clash with a development of the tracks without particular leaps of creativity. The control system does nothing but reiterate the difficulties of touch screen devices in replicating the most classic and fastest arcade experiences, but unfortunately little can be done about that and indeed Codemasters (yes because there is really the legendary British development team) has probably did everything possible. Micro Machines takes us back to the spirit of arcade racing and toy car collecting The spirit of Micro Machines Micro Machines is essentially an arcade racing game with a shot from above, in which we find ourselves driving different types of vehicles (taken from the huge catalog of cars of the same name) within thematic tracks and arenas, represented in scale with the dimensions of vehicles, traditionally very small. Following the most classic canon of the genre, the action requires both careful control of the vehicle and the appropriate use of various offensive and defensive power-ups, to be collected gradually during the races. It is appreciable how this game manages to capture a fundamental aspect of the Micro Machines brand: the drive to collect. If the old titles were above all standard racing games set in a particular context, this game puts the collection of cars of various shapes and types at the center of the action, and it is a perfect move. The whole progression mechanism is based on the conquest of new packages containing car parts and customization items, which allow you to expand your collection and upgrade the cars. This has the double effect of cultivating our collector's spirit and opening up new challenge possibilities, given that the various car models and classes correspond to new tracks and new challenges, even if the game modes are still reduced to three: the standard race , in which it is above all important to finish first, the battle and the elimination mode, in which the physical elimination of the opponents is aimed at. Obviously in the first the driving ability counts more while in the second and third the power-ups come into play above all, even if both elements are present in each of the three modes. It should be noted that the customization element also adds an interesting layer to the depth of the gameplay, enriching the progression with an effective evolution of the car's performance. A major limitation to the use of Micro Machines is given by the strange decision to always make us run in online multiplayer: although the game lends itself perfectly to single player use, without a connection it is impossible to start a game, which represents an important limitation formany users.", "date": "2016-07-28", "grade": "7.5"}