{"name": "Headlander", "ref": "https://multiplayer.it/recensioni/171719-headlander-atterraggi-di-testa.html", "text": "Anyone who loves cartoons designed for an adult audience (not hentai, silly) knows how great is his debt to Adult Swim, or the section of Cartoon Network that over the years has offered TV series such as Family Guy, The Boondocks , Robot Chicken and recently the hilarious Rick and Morty. For some years, however, his bond has become equally strong with the world of video games, both to create titles based on his intellectual properties, and for completely new games but still linked to a vein of allusive irony, made up of cross-references, quotations and double meanings . Headlander is the latest product from Adult Swim Games, created in collaboration with a developer who undoubtedly understands humor, Tim Schafer's Double Fine studio. Let's see together what they have come up with! Headlander: a video game made of puns, retro looks and a disembodied protagonist! I do my own thing The heart of Headlander is that of a Metroidvania, therefore strictly lateral view, even if the game is 3D, backtracking and an environment that develops and expands following the improvements of our alter ego. However, compared to the classics of the genre, Headlander is based on a fairly important feature: the protagonist is just a head that can float around. The game is in fact set in a future in which all men have transmitted their consciences within robots, so as to live forever and devote themselves almost exclusively to unbridled pleasure and the oblivion of the senses. This condition has allowed an evil artificial intelligence called Methuselah to control humanity and keep it in a perpetual state of stupor, thanks in part to its robot henchmen, called Shepherds. We will play the only surviving human being, or at least what remains of him, encapsulated inside an astronaut helmet equipped with a rocket that allows him to move freely and above all to take possession of the robotic bodies he encounters. In this way if we twist on a civilian we will be a civilian, if we take possession of the body of a soldier we will be able to shoot and overcome any areas forbidden to normal people. The game is therefore basically based on finding the right body at the right time, or understanding when it's time to remove the head and slip into an air duct. Here and there there will also be some side this quite funny, like that of a lady who has lost her robot dog, on which we can graft our head to bring it back to the mistress. All retro The graphics of Headlander is undoubtedly one of its most interesting points. To give the game a certain character Double Fine chose to set everything in a sort of space TV series from the 70s. A visual suggestion that begins with the title, vaguely inspired by the graphics of Atari games and the first Activision logo to continue in environments that recall Studio 54 in all respects, with robots reminiscent of Metropolis, references to drugs, psychedelia, children some flowers and even a button dedicated to performing Tony Manero-style dance moves. Also particular is the choice of artificial intelligence that helps and guides us in our adventure, characterized by a strong Texan accent, reminiscent of certain characters from the Old West. However, the atmosphere will change drastically as our exploits continue, even if it will retain a certain taste for retro science fiction. What will not change, however, will be the constant need to find the right body to continue, given that the whole game is based on the possibility of accessing the various rooms to retrieve information, give or take power or unlock doors and elevators. In fact, almost all doors have access restrictions, so a red guard will only be able to pass red doors, an orange guard will be able to pass red and orange doors and so on. Furthermore, some robots will be able to pass on electrified floors, while others will be able to retrieve data from terminals and so on. The problem will be managing this situation in an environment where everyone is shooting at you and trying to kill you, for this reason we will be able to develop over time skills that will allow us to project shields, control other robots, take more damage or overload their systems from a distance. To unlock these skills you will need experience points, which can be obtained by collecting crystals around or completing various missions. Being a metroidvania expect secret sections everywhere in which to increase energy, shield power and so on, as well as a certain need to visit areas already seen in order to continue. Lasers everywhere Headlander's combat is almost entirely based on su lasers that can bounce off walls, creating a chaos of bullets to dodge, cover to hide behind at the right time, the occasional melee attack and suicidal strategies in which to send our nearly exploding robot into opponents, while our head flutters around. For the rest, being a Double Fine game, expect double meanings, guilt-ridden turrets, gossiping vacuum cleaners and ex-humans rubbing against the carpet in search of cuddles. Unfortunately, however, also expect a certain repetitiveness and a subtle feeling of frustration that will start to be felt towards the middle of the game. In fact, all the mechanics of Headlander will become increasingly complex and articulated as the adventure progresses, forcing you to find the right robot to do something while dozens of lasers around you are waiting for nothing but your explosion, after which you will have to start from scratch from the previous checkpoint. Over time this goes from being fun to being boring, especially since it will be repeated over and over again. At the beginning you will have to align five satellite dishes and that's fine, then unlock four doors, destroying as many generators and ok, then recover data from 5 terminals, using five different robots while walking helplessly in a sort of giant version of chess, but with lasers and here things will start to get more frustrating than fun, since all in all the humorous charge of the game is certainly not enough to go on. It will be at this point that you will understand if the game has really taken you or if you want to finish it by now because it annoys you to leave things half done. In our case it was the second case.", "date": "2016-07-25", "grade": "7.8"}