{"name": "L'eredit di Iwata", "ref": "https://multiplayer.it/recensioni/171343-boxboxboy-leredita-di-iwata.html", "text": "Still hard to hold back the tears today. A year ago Satoru Iwata left this world for perhaps a better place, leaving a huge legacy and a responsibility of equal magnitude to the future holder of the scepter of Kyoto. We don't know how much Kimishima has had his say on the production of BOXBOXBOY!, but it is splendid to think that Iwata's simple and pure soul once again envelops the HAL Laboratory product, what - more than any other - we can call ~his team~. That unique, simple, minimal trait yet capable of not tiring as a simple tool of creative expression: in April of last year we met Qbby and that little square won its challenge. But we were sure of it: go find what was written at the time and you will understand that in reciting ~we expect Nintendo to invest in a sequel~, we knew we were not wrong. This is the power of a small, low budget brand but not in a derogatory sense, quite the opposite, indeed, exactly the opposite. Fun and gameplay also start from that substrate of humility in which microscopic but extremely well-finished products such as BOXBOXBOY! they remind us that very little is enough to charm, even on the move. BOXBOXBOY! it is proof that often the simplest ideas are also the best Small news It might seem almost trivial, but it's the truth: this - like so many others - is the classic portable console title. Short levels, divided into puzzles that can be played and replayed in case of a mistake, combined with the possibility of closing the shell of the Nintendo 3DS and putting everything in stand-by now represent a playful offer that those practicing playing around will hardly be able to give up . Including us. Like the best of puzzles, the obstacles of BOXBOXBOY! they have a key that alternates multiple solutions with one-way ones, with a little twist: this time Quby can create two rows of blocks. For those who don't know what we're talking about, a summary is needed: BOXBOXBOY! is a clever puzzle where progress depends on our ability to use the ability to create a limited number of adjacent squares with which to overcome the puzzles. Soon said, or almost: the skill of HAL Laboratory lies precisely in the mastery of alternating apparently trivial situations with others less obvious than expected, with the result that it will be difficult not to remain glued to the double screen of the Nintendo 3DS. Now, it is also necessary to clarify another aspect: compared to the first episode, BOXBOXBOY! adds practically nothing. Or at the very least, the ability to create two rows is new but at the end of the day the core remains absolutely identical, only increases the number of tools and logic behind the puzzles. The pleasure of the challenge Sure, you must like puzzles. Perhaps, you should also appreciate that aftertaste of completionism that the software subtly insinuates into your ego, forcing it to master the gameplay to exploit as few blocks as possible in each level and thus grab the coveted crown, the only collectible with a utility look. Yes, the in-game shop is back but as in the past we are talking about extra items, all stuff that you can safely leave there because the real prize is not to use the coins earned to buy goods, but rather to have earned them and that's it. Perhaps you have another vision of the world, yet nothing takes away from our minds that in this type of product what electrifies is only that moment in which you realize you have made it, that you are close to the solution on which perhaps you were stuck for minutes or more . BOXBOXBOY! it's a light-hearted title, which takes you to the beginning of each world explaining the element on which the next sequence of levels is based and then drops your hand, leaving you to be tempted. It is also for this reason that it is really difficult to resist him, even if anyone who has already played the first episode will perhaps feel a little too much at home.", "date": "2016-07-14", "grade": "8.0"}