{"name": "Lomino batte sempre tre volte", "ref": "https://multiplayer.it/recensioni/171294-super-stickman-golf-3-lomino-batte-sempre-tre-volte.html", "text": "In a historical period in which the gaming industry churns out sequels at a perhaps even excessive rate, the case of Super Stickman Golf 3 is of an exactly opposite sign: the developer Noodlecake Studios preferred to take things slowly, even letting three years pass ( an eternity especially in the mobile sector) to come up with a sequel to the highly appreciated second chapter of the saga of the little golfer. We just have to find out if all this time has actually been used to create a better product than the illustrious previous one. Super Stickman Golf 3 improves on every aspect of the prequel while also switching to the free to play model Nice Shot At first glance, little or nothing seems to have changed in Super Stickman Golf 3, and in some ways it is, starting with a graphic sector that maintains almost unchanged the characteristics of simplicity that have always distinguished the series: certainly the product Noodlecake will not win any awards for audiovisual excellence, but on the other hand it is undeniable that everything is made to be functional to the gameplay, which is again the beating heart of the title. In the role of the little white man who stands out on the application logo, the player is called to tackle 20 courses divided into four cups, following the basic rules of the golf discipline but in an absolutely arcade and imaginative context. Using the simple touch controls on the screen, it is therefore necessary to adjust the direction of the shot and give the desired force, trying to reach the hole with the fewest possible strokes. As in the previous episodes, the most characteristic elements of Super Stickman Golf 3 are represented by the design of the levels - full of obstacles of all kinds, suspended platforms, cavities and so on - and by the presence of power-ups and various abilities that allow you to improve character performance or to remedy potentially harmful situations. Once again, the Noodlecake Studios team has proved to be very skilled in making the most of these two aspects, creating a fun and immediate but at the same time decidedly profound title for those who want to aim for the best scores. In addition to refining and improving the already existing material, the developers have also introduced the new mechanic of the effect to be impressed on the ball after the swing, an element as simple on paper as it is potentially decisive (so much so that there is a path entirely focused on it) for all those who want to apply themselves to mastering it to the fullest: concretely, the discussion is reduced to a slider that appears in the lower part of the screen while the ball is in flight, which can be dragged from one end to the other to obtain a clockwise or counterclockwise rotation. In short, Super Stickman Golf 3 offers even more tools to fully enjoy the gameplay both in single player and in the renewed multiplayer section via Game Center, which allows you to face friends or random users in two distinct modes called Racing or Turni. Another novelty of this chapter compared to the previous ones is the free to play model of use, which in truth is divided between lights and shadows. In fact, if on the one hand nothing prevents those who wish to enjoy the game in single player without paying anything, on the other hand the inevitable in-app purchases objectively give great advantages especially from a multiplayer perspective, with the risk of making some games too unbalanced. All this despite the fact that Noodlecake Studios has tried to move with caution, showcasing only a couple of premium offers and the possibility of buying quantities of Bills (the game's currency) with real money, which serve both to advance a level up and to unlock card packs containing random rewards. Probably we could have acted differently, but we can't even put the cross on the shoulders of the developers too much for having only aligned themselves with the trends of today's mobile market. Looking at the glass as half full - indeed, definitely three-quarters full - being able to download Super Stickman Golf 3 for free and play it without major external interference is still an excellent result that we hope will give the title even greater popularity which, due to the quantity and quality of the contents offered, it would be absolutely deserved.", "date": "2016-07-14", "grade": "8.8"}