{"name": "Ghostbusters: Spirits Unleashed", "ref": "https://multiplayer.it/recensioni/ghostbusters-spirits-unleashed-recensione.html", "text": "Asymmetrical multiplayer games represent one of the many bubbles in the market. Difficult to balance, even more to make really exciting, but titles like Dead by Daylight still continue to grind hundreds of thousands of players constantly, strong as they are licenses that lead the public to constantly return to the servers. Illfonic, US software house which in recent years has made asymmetric multiplayer its life, continues to apply the formula on fully licensed products. After exploring the icy lake on Friday the 13th and giving a new voice to that pretty big guy from the Predator, it's time to play a lot more on the irony. Here we are, therefore, with the review of Ghostbusters: Spirits Unleashed. We have tried it, so as to be able to tell you if and for whom the purchase of yet another clone of Evolve is worth it. The most famous fire station in the world The barracks are reproduced in Ghostbusters: Spirits Unleashed with extraordinary fidelity Come on, let's be honest, if Ghostbusters is written at least you feel pleasure in thinking of seeing the protagonists of one of the most important sagas in the history of cinema again. Despite having experienced ups and downs (especially the latter). the ability to attract the public continues to give constant attention to an evidently immortal brand, which knows how to attract new audiences to every generation. In our case we approached the game without too many pretensions, aware of both the problems of the reference genre and the performances nothing but extraordinary implemented by the team over the years. The two previous licenses of weight, albeit with some interesting findings, have in fact failed to maintain attention over time. Ghostbusters: Spirits Unleashed tries a slightly different path, trying to get the player into a sort of sequel to the saga. The Ghostbusters are made up again, albeit not in full, and the possibility of being faced with a Dan Akroyd - voiced by the iconic actor of the same name - manages to snatch some genuine nerd tremors in the hearts of fans. The fire station, the Echo, even the machine to contain the ghosts and the pole to launch headlong into the work are exactly where we remembered them. We really appreciated the fidelity in the reproduction of that area which then represents a real gaming hub. Although the whole experience is focused on cooperative / competitive multiplayer, the developers have nevertheless thought of inserting a sort of short and simple campaign, which carries on a story that is the background to the events and which advances following dialogues and small cutscenes between the protagonists. Obviously, forget screenplays and dizzying Hollywood means, but for the great fans of the Ghostbusters this detail could be able, by itself, to justify the ticket price. Asymmetrical gameplay Ghostbusters: Spirits Unleashed maps don't shine for level design, but they are well done with their cartoon style We now come to the fundamental part of the offer, or the asymmetrical gameplay of Ghostbusters: Spirits Unleashed. As mentioned earlier, the whole experience is based on four-on-one matches. At the very beginning of the adventure you will be asked to create your own Ghostbuster following the rules of a really skimpy editor who will see the possibilities and accessories increase as the player level advances. featured maps and start your own ghost hunt. When playing as Ghostbuster you find yourself controlling your character in first person, with the possibility of choosing between using the proton pack or the supernatural anomaly detector. In addition to the two main ~weapons~, you can choose a gadget to take with you and which facilitates the deeds of the Ghostbusters in some situations. Ghostbusters: Spirits Unleashed - studying history is always important The rules are simple: the Ghostbusters are called upon to capture the ghost, while the latter must try to haunt the map being played at that moment to 100%. Let's go step by step: the Ghostbusters are clearly less powerful as individuals, but if it is true that unity is strength and that sometimes flows must be crossed, teamwork is essential to succeed in the enterprise. Getting to lock the ghost in the trap requires attention and coordination. In fact, by shooting with the proton beam it is possible to hook a ghost and drag it as best you can towards the trap placed on the ground, so as to let it enter and close the game.It's all pretty simple, except that there are always three breaches on the map through which the ghosts can re-enter the game before running out of any opportunities to win. There are always three breaches and using the detector it is also possible to identify and break them before the opponent can use them, so as to reduce his chances of respawn. Knowing the levels is important in Ghostbusters: Spirits Unleashed Wandering around the maps, you can find a series of collectibles that, when accumulated, generate an experience bonus for the entire account. Once the games are over you will be able to view a brief summary of what happened and the experience points earned. In addition to this, another of the mechanics included is that of comfort. The game maps are in fact littered with non-player characters who suffer the terror induced by the ghost and who, if they don't cheer each other up, will end up going crazy and running away, dramatically increasing the percentage of infestation. Really nothing could be simpler: so much so that in fact the title tends to become repetitive in a very short time, which is exactly what shouldn't happen in a multiplayer game. As the ghost Ghostbusters: Spirits Unleashed ghost gameplay is fun in its simplicity On the other side of the fence moves the ghost - it is required to complete several games of Ghostbuster before being able to play as one of the organisms that haunt the maps. Entering the realm of the dead means being able to change the choice relating to the ghost, as well as rush headlong into the fray. Unfortunately, despite the active cross-play it was practically impossible to find ghost matches that didn't take tens of minutes just to start, a detail that also affects Ghostbuster matches to a lesser extent. In essence, the gameplay remains similar for all ghosts, with the difference that everyone uses a single unique skill. We don't want to spoil the fun of discovery, also because the quotes relating to canonical events of the series are always around the corner. When you impersonate a sprite it is possible to move freely around the map, also taking advantage of a rose water verticality, which otherwise remains almost unexplored. Iconic locations from the series are easily recognizable in Ghostbusters: Spirits Unleashed The goal as mentioned is to infest the maps. This means being present in various zones, continuing to interact with elements of the environment that can also be possessed, as well as attacking and ~ectoplasmizing~ human beings. Obviously, in full light-hearted style of the saga it is not possible to kill anyone and play your cards well, between breaches to move and well-conceived possessions, it makes the difference between a game won all too easily and a real otherworldly nightmare. Once the 100% infestation bar will start a countdown that works as a real showdown. No more breaches - assuming there were any left - and the position of the ghost is almost always clearly visible, with the consequence of transforming this few seconds into a real hunt. Also in this case the gameplay is really simple, but still pleasant and satisfying if taken in small doses. The technique without control Ghostbusters: Spirits Unleashed - never cross streams! Or maybe yes? The technical sector of Ghostbusters: Spirits Unleashed thrives on great contradictions. The cartoon graphic style adopted by the Illfonic guys is a gem. It doesn't astound for its polygonal and texture counts, but it perfectly marries the heart of the saga. Unfortunately the same cannot be said for an optimization that is certainly not extraordinary. With our configuration, which also includes an RTX 3080, the game still risks slowing down substantially in some situations. Nothing to say about the audio sector with both original pieces and weight taken from the history of the series. What unfortunately is really difficult to overlook is artificial intelligence. It is true that the game remains anchored to its multiplayer component, but it is equally fair to say that bots exist and that they often fill entire games. From this point of view, the two main problems are the inability of bots to really work as a team and the frenzy in using the ghost which makes it useless to work with logic to find out where it awaits you. Mediocre in this respect.", "date": "2022-10-19", "grade": "7.0"}