{"name": "Mattoncini stellari", "ref": "https://multiplayer.it/recensioni/170919-lego-star-wars-il-risveglio-della-forza-mattoncini-stellari.html", "text": "Considering that TT Games' LEGO video games - although now, perhaps, we should call the developer TT Fusion - began their very long cycle in 2005 with LEGO Star Wars, it should come as no surprise that the British software house's latest effort is inspired right at The Force Awakens, the seventh episode of Star Wars that broke the box office last year. We won't stay here to talk about the merits of J. J. Abrams' film (also because we've already done it!) but we certainly want to talk about its brick-based videogame transposition, since it dispelled any fears that arose during the test of LEGO Marvel's Avengers, the which had left us quite dumbfounded. Will TT Games have managed to renew the now stale formula of the series at least a little? The answer may surprise you. The Force has truly awakened in the new LEGO Star Wars, one of TT Games' best tie-ins It's all true! That LEGO Star Wars: The Force Awakens is not a simple tie-in can be sensed from the very first level, a prologue set at the time of The Return of the Jedi and, more precisely, during the final battle against the second Death Star. It is immediately clear that TT Games did not limit itself to doing the homework and transposing the key scenes of the film; instead, he reworked them, integrating them into much more complex and varied stages than usual. And so you solve puzzles and ride the AT-STs as Han, Leia, Chewie and company in the Ewok forest, then move on to the battle between Luke, Vader and the Emperor on the Death Star and finally attack desperate rebel fleet as Lando and the Millennium Falcon. In just one level, TT Games concentrates puzzles, platforming sequences, a boss and a first on the tracks and then free shooter sequence. All linked by irresistible cutscenes that re-propose the story as we know it, joke by joke, but peppered with hilarious gags. It's just the beginning, but also a real demonstration of what awaits us in the internships to come. In most cases, the adaptation of The Force Awakens does not just translate the most important moments of the film into playable stages, but mixes the scenes in a cauldron of situations and scenarios that make the levels always rich and surprising. After preparing the village of Lor San Tekka for the First Order's invasion as Poe and BB-8, we find ourselves wearing those of FN-2187 as he helps the rebel pilot escape from the Finalizer aboard a TIE fighter to then immerse ourselves in those of Rei in a reckless descent along the side of the Star Destroyer shot down on Jakku: it all happens during the same stage, without breaks and in complete continuity. In this sense, the levels tend to take perhaps a little longer than necessary, but maintain a commendable variety in terms of situations and gameplay. Basically, this LEGO Star Wars is also played like any other LEGO-branded video game of the past: you control one character at a time - or two, if you take advantage of the split-screen cooperative mode - and destroy everything you can to accumulate buttons and bricks, defeating the enemies who attack us with bare hands or blaster shots. There is no game over; the maximum defeat reduces the counter of our bricks, necessary to unlock upgrades and other bonuses. Each level is then peppered with secret areas and collectibles that encourage you to replay it in ~free mode~ using the other characters: each minifig has unique abilities that allow you to reach otherwise inaccessible areas. Rei, for example, can climb certain walls, while Jedi like Luke Skywalker can move some obstacles with the power of the Force. From this point of view, the level design has proved to be even more complex and interesting than usual thanks to the introduction of some very welcome innovations such as multiple constructions and shooter sequences. Playstation 4 trophies Like any self-respecting LEGO video game, The Force Awakens also platinum which is a pleasure. Unlocking the 50 trophies (40 bronze, 6 silver and 3 gold to get the platinum one) is far from a titanic undertaking, but you have to completely sift through every corner of each stage to unlock practically everything. lego gears of war Star Wars heroes spend a large part of every film firing blaster shots from behind cover, so the folks at TT Games decided the Force Awakens tie-in was the perfect time to spice things up. on the historical gameplay of the series. So here is that almost every stage offers at least one sequence in which the camera approaches our minifigures hidden behind some barricade: as in a shootouttto in third person type Gears of War or Uncharted it will be necessary to lean at the right moment to open fire on enemies, often solving some puzzle to take out the boss on duty that prevents us from continuing. In these situations the controls seemed a bit wooden to us, but it is a problem that fades into the background thanks to the automatic aim and the frenzy of the action. The same goes for the portions of the stage in which we have to fly the Falcon or the X-wings, especially when we have full control of the aircraft: at the beginning the response to the commands leaves something to be desired, but once you get the hang of it it becomes much easier to destroy targets, dodge the sights of pursuing TIE fighters, fire proton torpedoes around and twirl in mid-air to collect bricks. While maintaining the squared and stylized style of the LEGOs, it must be admitted that the guys from TT Games have really raised the bar in the technical sector, re-proposing the scenarios of the films in detail and guaranteeing a remarkable spectacularity even when fighting gigantic Star Destroyers made entirely of small bricks. In this regard, it seems to us the right occasion to discuss multiple constructions, the small workhorse of the new puzzle solving. In terms of puzzles, LEGO Star Wars: The Force Awakens offers some new rather intuitive puzzles, but from time to time it happens to come across real alternative paths: we will be able to choose whether to build an accessory or a vehicle instead of another, to example, and thus access some hidden collectibles or simply complete the stage in less time. Sometimes it will be necessary to use the same bricks to solve puzzles by building something in the right order; in any case, it is a very simple but ingenious solution that pushes for replayability and once again guarantees a certain amount of variety. The fact that TT Games has sacrificed the open world scenarios employed in the latest tie-ins like LEGO Marvel's Avengers in favor of small hubs full of activities, collectibles and challenges hasn't broken us at all, also because each planet/hub allows the access to multiple internships, including some that go beyond the original film script to propose different points of view or completely new events. Whether they are canonical events or not, LEGO Star Wars: The Force Awakens tells us what happened to the mythical Admiral Ackbar before the film or how Han and Chewie managed to capture the Rathtar before locating the Millennium Falcon. The bonus levels tell unpublished stories that will appeal to Star Wars fans and in this sense the upcoming DLCs promise very well. However, the fact that the stories are unpublished implies that the jokes of the characters are also unpublished, and like the other adaptations of recent years, this LEGO Star Wars has also been dubbed into Italian. Fear not, however, because unlike the mess found in LEGO Marvel's Avengers, the work done by the localization team this time has turned out to be much better: when the game does not reproduce the original Italian audio track, it almost always employs the Italian voice actors of the film, giving us back most of the voices we've come to know over the past few months. Between a high-level adaptation work and the soundtrack by John Williams, the audio sector of LEGO Star Wars: The Force Awakens deserves our praise.", "date": "2016-07-06", "grade": "8.5"}