{"name": "Furi", "ref": "https://multiplayer.it/recensioni/170954-furi-il-flagello-dei-nove-mondi.html", "text": "Authors of the excellent Squids mobile series, the developers of The Game Bakers are confronted for the first time with the PC and console market, and their debut title demonstrates a certain degree of ambition from the very beginning. The protagonist of Furi is in fact a mysterious character, a sort of cosmic samurai who is freed from an imprisonment that has lasted for who knows how long thanks to the intervention of a strange guy dressed as a rabbit, who brings to mind Donnie Darko's ~dream messenger~ and who, likewise, whispers cryptic phrases about the possibility of escaping only once some powerful guardians are defeated. The first is our jailer: a mighty warrior, equipped with three masks reminiscent of the Kabuki theater and which alternate on his face as if they had a life of their own and each corresponded to a different state of mind. The duel that follows serves as a tutorial for the gameplay of the game, which is divided into two phases: the first takes on the characteristics of a twin stick shooter in which you generally fight from a distance, shooting at the enemy with a laser pistol and avoiding their shots by performing lightning sprints or an instantaneous save, which must therefore be activated with a certain timing to be effective; the second has the features of a hack'n'slash in which the protagonist takes out his sword and carries out spectacular exchanges with the opponent, also here trying to intercept his maneuvers by dodging or parrying them, with the aim of opening the enemy's defense to pull off a combo and deplete one of the many bars of energy it is equipped with. Each bar corresponds to a different attack pattern and all must be memorized in order to have any chance of winning, which means that Furi's experience builds its duration essentially on learning, trial and error, on the powerful curses that you will issue with each defeat on the razor's edge, with the constant temptation to significantly lower the challenge level and easily overcome all the bosses. Too bad that in this way the sense of this production is completely lost: don't do it, also because you would give up the Furiosa mode and the Speedrun. Furi is a title of great impact, capable of offering a real, engaging and exciting challenge Management first Furi's characters were designed by Takashi Okazaki, the author of Afro Samurai, and his touch probably extends to a whole range of ideas that affect the art direction of the game, which is really solid and compelling. In fact, between one boss fight and another, our character walks through absolutely improbable scenarios, some of which are truly inspired and original, heading towards the portal that will lead him to the next duel, from the point of view of a path that unwinds through a dozen satellites. This phase of the game is basically passive, so much so that it is possible to opt for an automatic movement and focus on the words of our mysterious companion, who will gradually reveal some more pieces about the reasons behind our imprisonment. There are at least three different endings for the adventure, which by far does not boast an incredible duration (theoretically it could be completed in a couple of hours) but resists precisely because of the need to learn the attack patterns of each boss, organizing the appropriate counter-moves and trying to never lose concentration. If the enemies have various energy bars, from four to six, we have in fact only three, and every time we lose one we will have to start the last phase of the duel all over again. The approach chosen by the authors seems ruthless, but in reality it rarely happens that a game over depends on shortcomings that are not ours. However, it is important to understand certain mechanisms, such as the aforementioned instantaneous nature of the parry (which, if well executed, allows us to recover some energy) and the fact that the dash, essential for dodging a whole series of attacks, starts at the moment which we leave the X button instead of when we press it, due to the possibility of loading the maneuver. Playstation 4 trophies The thirty-four Furi Trophies are obtained naturally by defeating all the bosses in the game, but also by completing a series of missions based on attack and defense maneuvers. Important achievements are unlocked by accessing the different endings and then experimenting with the modes that become accessible once the story mode is completed at the medium difficulty level. An exhilarating experience Furi is not the first action game based on a boss fight sequence, indeed playing with the title of The Game Bakers brought to mind the fascinating lore of Malicious, which could also return with a new episode.However, the construction of the experience is incredibly solid, both for the already expressed concept of a duration that is put at the service of learning, of failed attempts and finally of the satisfaction of a victory conquered with tooth and nail, between very fast duels and bullet hell-style shooting sessions, where the screen is completely filled with energy projectiles and avoiding them seems like an impossible feat; both for an exhilarating direction, which manages to emphasize to the maximum a cel shading graphics that are not always impeccable and indeed sometimes coarse, but capable of offering evocative, mysterious, fascinating glimpses. The bosses themselves, true reference figures for the game, boast a very successful design full of personality, apart from two or three cases. And then, well, there is a majestic audio sector, characterized by an intense narration full of character, subtitled in Italian, but above all by an extraordinary soundtrack, signed by a set of rather famous artists, which remains in the lead, excellently underlines the ~slow~ phases and the more agitated ones of the experience, also representing one of the few valid reasons for replaying the ~walks~ that take the character from one stage to another: sequences of great impact at first, also thanks to crazy shots, but downgraded in the stints following a purgatory of delays.", "date": "2016-07-05", "grade": "8.5"}