{"name": "Crafting a tutto spiano", "ref": "https://multiplayer.it/recensioni/170926-7-days-to-die-crafting-a-tutto-spiano.html", "text": "The survival 7 Days to Die, developed by the guys from Fun Pimps Entertainment, has carved out a decent following in the PC environment, despite the fact that the project has been in Early Access for a couple of years. With over 1.5 million copies sold on Steam it would have been reasonable to expect the completion of the work and the launch of a definitive version, instead the studio preferred to devote itself to a console conversion, which landed on PlayStation 4 and Xbox One on June 28th. through the Telltale Publishing imprint. 7 Days to Die is proposed as a distinctly survival title, in which the crafting of resources and the construction of structures, with defensive functions, assume the focal role of the interactive experience. The dynamics that have made the fortune of products such as Minecraft have been combined with role-playing elements of character growth, while the combat system with a first-person view takes its place in a post-apocalyptic sandbox context that alternates periods of daytime exploration, focused on control of resources, to nocturnal moments in which all you have to do is defend the integrity of your base. Presented in this form, the playful offer would not seem bad at all, however the good intentions promptly failed due to obvious gaps, which affected the overall content quality and, by virtue of a technical realization far below current standards, they appeared to us further aggravated in this conversion. The console version of 7 Days to Die has many problems, especially from a technical point of view By day you create, by night you survive The single player mode of 7 Days to Die allows you to take part in a survival campaign, entirely oriented towards the collection and development of resources in a difficult context. Before starting your game you can set a fair number of settings and calibrate the main aspects of the game. First of all, there are six different difficulty levels, from the most accessible Scavenger up to the Insane degree. The movement speed of the zombies can be changed, although the default setting is for the creatures to be slower during the day and faster after dark. Other settings determine the degree of aggression of the enemies, the duration of daylight hours compared to night hours, the amount of loot recoverable within the map or the number of zombies that will be placed on the ground at the start of the game. Finally, one can opt for the traditional Navezgane map or fall back on random generation, although the tangible differences between one and the other category, once the game has started, have seemed completely relative to us. The driving force of the game is the many materials that can be customized during the campaign. A short tutorial allows you to receive the rudiments of resource gathering techniques and the construction of the main weapons, such as the axe, the mace and the bow, but also on the creation of clothes, the preparation of a camp fire or the placement of the bed to rest. However, it is the basic concepts for the construction of defense structures - within which it is vitally important to barricade oneself - that play one of the most important roles, hand in hand with the need to obtain food and water. During the first few minutes it is advisable to optimize the limited resources at your disposal, perhaps trying to exploit one of the few dilapidated buildings that you happen to come across along the map; this makes it a little easier to find cover and strengthen the defense with the help of scarce items. However, to make your way through the map you need to be able to survive the initial impact, a prerogative that is not limited to the simple understanding of the game mechanics. In fact, 7 Days to Die requires a considerable dose of patience, surviving means being able to obtain a sufficient amount of resources, expand the size of your arsenal and start moving more safely. The real problem is that the majority of players will not be willing to overcome this type of obstacle, and this also happens due to the heavy technical contraindications that invalidate this conversion. Playstation 4 trophies The 7 Days to Die Trophies are 44 in total. Some objectives directly concern crafting, others are instead based on the amount of zombies killed, the number of consecutive hours lived in a single game or character enhancement. Post apocalyptic wasteland The extreme poverty of detail and variety of settings is one of the main sore points that catches the eye. The resources must be obtained in a context that define brullor is it really an understatement, with almost non-existent settlements, flora and fauna undermined by an embarrassing visual depth and an unsatisfactory quality of textures and polygons. Furthermore, you have to deal with a wooden combat system, aggravated by a gruesome quality of the animations, by repeated freezes of the image and drops in fluidity. The functioning of the menus complicates an already unflattering picture, putting in our hands an interface that is ill-suited to the use of the joypad. As a result, the collection of resources and the transfer of material prove to be cumbersome and not very intuitive, with a bar for equipping objects, located in the lower part of the screen, clearly inadequate. The second sore point, this time unrelated to the intrinsic quality of the conversion, concerns the absence of a purpose that guides the player's actions and offers a valid reason to continue building objects, perfecting shelters and overcoming the distressing night hours. Without any doubt a more complete ecosystem could have been organized, providing at least a context to which to refer, for example through the presence of non-player characters with whom to interact. By doing so, a more acceptable compromise and better management of fairly large open world maps could have been found, which, moreover, are always too empty and excessively anonymous to become a long-term attraction. Contrary to the PC version, the console conversion was also accompanied by a local cooperative mode, which involves the participation of two players through the split screen. Here too, the problems outweigh the positives. If on the one hand it is clear that sharing the adventure with a friend can help forget some of the critical issues just underlined, bad game management does not allow for effective sharing. For example, it is not possible to pass objects or interact in any way in the construction and customization of materials. Furthermore, in the event that one of the two participants dies, the respawn will not take place in the same map as the partner, absurdly forcing you to resume your solo game. Finally, there is a multiplayer mode, in which it is possible to enter maps already populated by other users, creating new customized settlements or taking possession of the already available structures.", "date": "2016-07-04", "grade": "5.0"}