{"name": "Gambe in spalla e pedalare", "ref": "https://multiplayer.it/recensioni/170928-pro-cycling-manager-2016-gambe-in-spalla-e-pedalare.html", "text": "Pro Cycling Manager has been pedaling non-stop for the past fifteen years, punctually crossing the finish line of the summer outing with more or less full-bodied news. This year, we say it right away, there aren't many changes but the changes relating to the interface, now more understandable and free from the usability problems of the previous one, are evident. The other change that catches the eye concerns the technical sector but we will talk about this later. First we focus on the game, a cycling manager that allows us to manage a team starting from training to get to the heart of the competition. The main mode revolves around this formula, allowing us to train our team, manage finances, pursue the goals set by sponsors and aim to win tons of competitions. But racing them all, it is good to know, is not a wise choice given that the health of our runners represents a fundamental resource, without which strategies count for little or nothing. The choice of which competitions to face, therefore, represents an important step on a par with training and team composition. In this regard, the most relevant novelty concerns the introduction of a secondary team made up of under 23 riders. We are talking about a veritable breeding ground of new sprinters, climbers, timekeepers and supporters whose selection passes through the scouts who offer us new talent following the our directives. Data from new runners is readily available, including the growth potential that can be developed through targeted training, making it pretty easy to manage. Unfortunately the depth of this component does not stand out but it is a nice addition that we hope will be developed in the future. Pro Cycling Manager 2016 winks at the community by focusing on Steam Workshop and multiplayer A massive offer A career as a team coach remains the beating heart of the Cyanide title but, starting from the last chapter of the series, we can decide to take on the role of a single rider thanks to the Pro Cyclist mode which sacrifices the management component by focusing everything on involvement. Unfortunately Cyanide has revived this mode without major changes, even if the implementation of multiplayer offers us a whole new interpretation. Among other things, the whole experience has been enriched thanks to the work done on the online component which now allows us to organize customized tournaments down to the smallest detail, to collaborate with other players as a team and even to aim for the competitive side by climbing the online rankings. And all this while being able to count on very useful functions such as quick reconnection and automatic download of any customized databases used in the creation of a competition. Finally, to close the offer we find two other modes with the classic single race that allows us to choose which one to face among the over two hundred stages available and the track mode that offers us seven different disciplines allowing us to compete in sprint, points race, elimination , scratch, keirin, 200m dash and omnium. In the Pro Cycling Manager career mode it allows us, like any self-respecting manager, to simulate competitions but in doing so the strategy on the field which represents an important part of the experience is lost. Between breakaways, recoveries, management of the supporters and slider of the effort put into the pedaling by our cyclists we have the concrete possibility of helping our athletes to conquer a good placement. On the other hand there is the artificial intelligence that does its best to make the race realistic between breakaways, recoveries and sprints. Undoubtedly improved and capable of giving us more credible rides, it still needs some work. Successful breakaways are few and most races end with very similar sprints. All this, together with a still too aseptic attitude of the managerial component, takes away the bite from an experience that shouldn't be predictable but the representation of that epic fight to the last pedal stroke that has created and sacrificed countless heroes throughout history. The lack of official licenses also contributes to the general lack of pathos, which manifests itself through fake names that are content to recall those of really existing cyclists. Fortunately, and this is probably the juiciest news of Pro Cycling Manager 2016, the problem will soon be solved by the community thanks to the Steam Workshop support that allows you to change jerseys, names and so on. New details, old problems It used to be that in Pro Cycling Manager all the riders were stiff as cod and moved in unisonor completely destroying the illusion of realism. Fortunately, those times are far away and from chapter to chapter the visual details increase, improving the overall performance which is very important in a cycling game, made up largely of verdant landscapes. Also in this new chapter of the Cyanide series the increase in detail is evident but the engine is starting to feel the age that you can see all in the panoramic views from above. Furthermore, we are once again faced with long-standing flaws that are increasingly difficult to forgive. The interpenetrations are a real horror, the pop-up is rampant, the models of the cyclists leave something to be desired and the animations have a lot of room for improvement. Furthermore, the blur lacks refinement, creating unbelievable trails that end up destroying the realism instead of increasing the sensation of speed. Fortunately, it is sufficient to remove it to go back to admiring colorful landscapes, sunflower fields and towns that are not exactly realistic but still credible even if when the computer has to load all this, in the absence of an SSD, the times are exhausting. To all this must be added the crashes, the usual far from exciting soundtrack and a general lack of optimization which is evident in the excessively fluctuating frame rate. The obligation to register online and the negligible commentary close a technical sector that is anything but exciting, even if we must applaud the numerous cameras, the presence of filters that allow you to alter the color tones and the interface whose the greatest value is the dynamic selector that allows us to quickly switch from the main group to any runners or squads left behind or engaged in a breakaway.", "date": "2016-07-04", "grade": "6.0"}