{"name": "Blazing Angels: Squadrons of WWII - Recensione", "ref": "https://multiplayer.it/recensioni/blazing-angels-squadrons-of-wwii-recensione.html", "text": "The song of the angels... The audio department sees noises perfectly in line with the type of game: noise of scrap metal engines, machine guns, bombs, alarm sirens and explosions make it really good if you have an adequate audio system. On a 5.1 system it's fun. To all the chaos of sounds is added a spot-on soundtrack, majestic enough, even if depending on the duration of the missions the music is repeated, but all in all it can always be heard. The speech has remained in the original subtitled language, and the dubbing is perfectly timed: hearing the German or Japanese pilots speak in forced English is spectacular, but unfortunately very repetitive. Only the companions vary the dialogues a bit. In this respect, a few more exclamations were in order... BEWARE STARFORCE! Warning: This game makes use of the now famous (to say the least) Starforce protection. It is now in the public domain that the latest versions of the aforementioned protection, due to a rather invasive procedure, can cause malfunctions or, worse, breakage of optical devices. Furthermore, it seems that they do not guarantee sufficient compatibility, both hardware and software, which can cause incorrect recognition of the disc, even if it is original, and therefore the failure to start the game. The manufacturer has denied, declaring that it is slander, but the affected players do not seem to be of the same opinion. So far, both developers and distributors have not yet decided to indicate the presence of this protection in the technical specifications. For this reason we, to be honest, prefer to inform you. Every decision is up to you. P.S.: the new Starforce present in the game proves to be even more problematic: if you try to start the game (or even just to enter the settings menu) without disabling the XP firewall, the PC will crash! City of Angels... And here we are at the point everyone was waiting for: graphics. There were more or less dubious comments about the title, so let's get rid of them right away: the game is pleasant to look at on the three machines for which it was programmed. In essence, the best version remains the one for Xbox 360, which runs at a constant 60 FPS in high resolution without too many problems; to report on it only a v-sync sometimes annoying. The problem that has always plagued airplane games is the quality of the world on the ground when you descend to a low altitude. In recent years we have gone from simple flat textures to timid polygonal parallelepipeds, but always with a result that disappointed most due to the poor quality of the cities. Well given the lack of simulators or arcade based on flight in recent times, we expected the usual collection of cubes on the ground, but incredibly this time things have changed. Just look at a level like London to be sure: thousands of houses that disappear as far as the eye can see, all dimly lit by the sun with HDR effects. Definitely a big step forward for this kind of title. Certainly we will not find super-defined and completely different houses, some sacrifices had to be made, but the visual rendering is still good and in certain moments truly effective. Unfortunately, not all missions will take this care: the sections in the desert or on the sea certainly don't offer great variety of scenarios, sometimes being really monotonous. Let's say that there is an equal alternation on the quality of these: we go from Pearl Arbor (pretty) to the bombing of the Japanese fleet (only ocean in practice), passing through ugliness like Africa and spectacular views like Paris or London. Blazing Angel is a title that has its ups and downs City of Angels... The planes are well made, nothing striking but overall satisfactory; considering that there are about forty of them, all flyable and diversified, you really can't complain. Negative note to the explosions: something more could have been done to make the effect better. You will only see a yellow glow, lots of smoke and little debris. Even bombing ships is a bit disappointing not to see them fall apart or sink. Much better is the smoke caused by enemy bombardments, which rises into the sky in great curtains. As for the PC version, it must be said that on a mid-range computer the game runs adequately with all effects (but without filters and antialiasing) at 1024x768 in the ~poorest~ missions. In urban scenarios and with many planes things get more serious and showy shots can be glimpsed. Flaming Angels Blazing Angel is essentially an arcade game in which the great air battles of the 2nd World War are faced aboard aircraft that have become legendary. The idea appears at least apt and of interesting transpositionvideo game site. Unfortunately something went wrong and the title suffers from some flaws in the execution. Just to be clear: the commands are based on the arcade, so those who expected a simulation may be disappointed; but in any case the physics appears sufficiently realistic and the control system perfectly intuitive. After a long tutorial that will explain the basic techniques, we will be immediately launched into battle, facing a not too long-lived single player campaign, through the most important moments of world aviation, but always on the side of the Americans and the British. And it is here that Blazing Angels shows its downsides: there is not a shred of cutscenes or links between individual missions; our supporters (who will play an important role in the game), can only be seen on the cover of the box; throughout the adventure we will only hear them talk. So once a mission is over, we will go directly to the next one, with the only variant of a screen of our moving plane and the meager explanation of the events that are happening. A little, considering that the sense of belonging to the team is lacking, linked only by sporadic comments and help from the riders. Given the involvement of certain clashes, something more was hoped for. multiplayer is certainly the flagship of the game Flaming Angels In addition to the main campaign, it will be possible to play in free mode; here you will have three options: mini-campaign, arcade and duel. The first allows you to choose between clashes and bombings, to be tackled by starting immediately into battle; ~Arcade~ takes up the concept of a bar game, where you have to shoot down endless waves of planes within the time limit; the ~Duel~ instead will see you face an enemy guided by artificial intelligence who will have the same plane as you. All aircraft that can be won in free mode can then be used in the campaign. In general, the missions involve attack and defense maneuvers in the skies, and bombardment sections on the ground or on naval fleets. There are also some additions such as reconnaissance or photographic mode, in which you will go to spy on the enemy to understand their deployments. All in all, the effort in wanting to vary the simple ~destroy everything~ is appreciable, but in some moments boredom reigns supreme. Note: the available view will always be the third person except in the moments in which we will be co-pilots firing machine guns from the turrets. Here too there is a point against: the opponent's locking system moves the camera towards him, sometimes making it difficult to understand which way to turn, especially if he finds us in inverted flight or during elaborate maneuvers which, in some cases, they become lethal. Angel heart As mentioned, we will find ourselves at the head of an incredible squadron, in which we will have three pilots under our orders, each with specific characteristics. Tom is our ~shield~: if we are under enemy fire, just tell him to cover us and he will take out all the enemies who shoot at us. Frank, on the other hand, is the attacker of the team: with the appropriate command, he will throw himself into the fray by himself, trying to bring down as many opponents as possible. Finally we find Joe the mechanic: his function is to tell us how to repair the damage to our plane, in a truly unrealistic way. In case of huge damages (detectable only by the smoke and flames coming out of the nacelle) asking for his help we will be suggested four keys to press in the right sequence (as a kind of very easy combo); if done correctly the plane will be magically fixed. It is also possible to send the whole squadron on attack or defense, in order to hastily eradicate the greatest dangers. The AI of our supporters works great, without them making big mistakes or crashing. To be honest in certain missions it will be all too easy to defeat the enemy forces, which only in certain cases can put us in serious difficulty. The enemies arrive in more or less numerous groups, and especially in the case of bombers, they allow themselves to be destroyed with impunity. This is the other flaw of the single player, which could have been memorable with more attention. Fortunately, the multiplayer mode turns the tide of many. Final comment Blazing Angel is a title that has its ups and downs. In the face of a campaign lacking in several respects, there is a high-class multiplayer, with lots of modes and planes to use. With a moment of extra care, the involvement could be very high, also given the drama of some missions. The sense of brotherhood is missing, and overall there is a lack of some more detail (both historical and graphic). In any case, longevity is gainedagna with online gaming, where the challenges are able to offer great satisfaction even to the less experienced, thanks to the excellent control system (strictly to be used with a joypad! The 360 one is perfect!). We recommend everyone to take a look at it, even if the maniacs of simulations and historical reconstructions will surely turn up their noses. Pros Excellent multiplayer Lots of planes and modes Pleasant graphics on each version Cons Lack of single player Non-existent plot and cutscenes Few particle effects Cross-platform The Xbox version is the ~worst~ one: the frame rate is uncertain and although the graphics are in line with the other versions, there is a fogging effect for objects in the distance and some changes such as water. Still, let's play. The one for 360 is undoubtedly the best: 60 frames, excellent visual distance, with the only flaw of a shaky v-sync. The PC version varies according to the configurations but as already mentioned in the mid-range you have to sacrifice the filters and something else. To enjoy it to the fullest, it requires recent video cards, preferably with 256 MB of memory. Finally, some frills (such as starting the propeller by turning the analog stick) have been mysteriously removed from the computer edition. RAF vs Lutwaffe The multiplayer is certainly the flagship of the game: it is possible to participate in battles with up to sixteen players. The modes available are diverse and offer some very interesting variations. The three main modes each have different types of gameplay. The first, the classic deathmatch, takes the name of ~Solo~; here you can fight all against all, in ~search and destroy~ mode (where you have to kill each opponent at least once) and finally ~Ace of the skies~. With this last choice, whoever kills the enemy first becomes the ace who is the only one able to score points; however, when it is destroyed by another, the latter becomes the ace. Whoever scores the most points in the allotted time wins. The second mode available is the cooperative: here you can fight the AI together with other human players. Assault involves destroying enemy planes within the time limit; Clash sees humans facing constant waves of enemies over and over again until the last player is eliminated; Bombardment consists of destroying the enemy base by bypassing its defenses; ~Kamikaze~ instead forces you to defend your base against crashing planes. Finally, it is possible to play the most important historical missions of the campaign together with the other pilots. The third and final choice is ~Squadriglia~: two opposing teams involved in a deathmatch; Conquer the base (where you have to take possession of airports and aircraft carriers by landing and staying there for a few seconds; after which points are earned until the enemies take possession of them. The team with the highest score wins); Bombardment (whoever destroys the enemy base first wins) and finally Kamikaze. The latter is a must try: you have to devastate the enemy base by crashing the planes on it! Especially worth it for the sake of saying Banzai!!!", "date": "2006-04-14", "grade": null}