{"name": "Zero Escape: Zero Time Dilemma", "ref": "https://multiplayer.it/recensioni/170497-zero-time-dilemma-il-gioco-finale.html", "text": "In a parallel world Zero Time Dilemma has never seen the light of day. Our doppelgangers reluctantly had to include Zero Escape in the list of unfinished trilogies, because in that story Kotaro Uchikoshi failed to find financiers for the last chapter of the series he created. Despite the sales problems and a whole year of hiatus, fortunately, however, the money finally arrived in our universe. Spike Chunsoft and Aksys Games have set the release of Zero Time Dilemma on June 28, 2016, complete with an almost worldwide simultaneous launch (Japan, for once, will have it two days late). A boon for a work of this type, where even just knowing you can peek at some guides on the internet risks ruining the experience irreparably. In spite of our alternative self, we then enjoyed these twenty-five hours of interactive reading and we can already reveal that the ending is worthy of the series and absolutely crazy. Even if there were some elements that made us turn up our noses. Here's our verdict on Zero Time Dilemma, the concluding chapter of the Zero Escape series Life is unfair Let's start with a small warning: while trying to avoid plot spoilers, some minimal reference to the history of the previous chapters is mandatory. So, if you intend to recover them, the advice is to play them as soon as possible and go directly to the next paragraph of the review. Although it has been guaranteed that in theory it should also be enjoyable for newbies, Zero Time Dilemma in fact presents many references to the past and it would be a real shame not to be able to grasp them. We are at the end of the year 2028, inside an underground bunker located in the middle of the Nevada desert, where the protagonists were taking part in an experiment to simulate a mission to Mars. Chronologically, the story fits between the first and second Zero Escape, but the consciousness of some characters does not belong to this era. This is the case for example of Sigma and Phi, but there are also other regulars of the series, such as Junpei Tenmyouji and Akane Kurashiki. Carlos, Diana, Mira, Eric and the mysterious child called Q are all ~new entries~, at least in theory. Even the ~villain~ of the moment breaks with tradition and shows up in a showy dress and the mask of a plague doctor. This takes the place of the iconic gas mask of the series, to underline the pivotal theme of the episode: the spread of a Radical-6 epidemic that will cause six billion deaths. The narration, which starts together with the Decision Game (not the classic Nonary, therefore), focuses on the moral choices of the participants, who due to the circumstances often end up questioning their own certainties. The usual exceptional characterization derives from it, which leads the player to identify himself to such an extent that he wants to make the choices most consistent with the psychology of the character of the moment, even if they are probably less advantageous on paper. Everything fits within a high-level frame, with a plot that ranges from science fiction to even complex scientific theories, without ever being heavy. Unlike the other chapters, the dialogues are in fact very well balanced and we never encounter infinite ~explanations~, which instead had characterized, for example, the second part of Virtue's Last Reward. The twists and turns follow each other relentlessly, so much so that at a certain point you start to have that typical feeling of loss, thinking once again that the good Uchikoshi-san has lost his bearings, this time forever. Then all of a sudden all the pieces find their place: the many questions left unanswered begin to have answers, the motives become clearer and, even when some twists are a little more forced or less original, the feeling is that of finding yourself in the center of a canvas so well woven that some imperfections can be forgiven. Unplugging the console becomes a luxury that cannot be afforded, not even to charge the battery or to scrape together the minimum hours of sleep necessary for survival. The ending, the real one, among the many game overs and alternative stories, is then something exciting, above all because even those secondary stories never fail to add new and interesting elements to the narrative. The snail of fate We could therefore talk for hours about this or that moment in history that made us cry, laugh or feel disgusted with ourselves, but quoting even just a small part of Zero Time Dilemma would mean precluding the pleasure of playing it. And the same can be said for online guides, which we once again categorically advise againstdespite some possible initial difficulties. The game structure may in fact seem more confused than in Virtue's Last Reward (but it is only an appearance) and understanding how to move from one segment to another is not always immediate. In fact, there is no real chronological order and the fragments of the story must be selected almost randomly, to then see them inserted into the flow of the various branches only after having completed them. It is therefore impossible to understand which universe is going to alter. The only element that you can choose in advance is which character to play at that moment. The participants are in fact divided into three groups, each led by a protagonist controlled by the player, and each group has dedicated narrative sequences, followed by the search for the solution to get out of a room and concluded by one of the aforementioned moral choices. There are only thirteen rooms to escape from, but they are all different and it never happens that you have to complete the same puzzle several times. The difficulty is not very high and the help system cannot be disabled, so after a couple of unsuccessful attempts the suggestions of the companions will begin to arrive. The puzzles are of various nature and range from mathematics, memory and logic tests. The notes and the camera of the smartphone can be a valid support, also because the memo functionality of the game is a bit too cumbersome and still lacks some useful options (such as screenshots, a keyboard or the possibility to keep the notes in the foreground while solving the puzzle). We've only come across a couple of slightly more complex situations, but all problems can be solved with a minimum of reasoning. All except one who, after reaching the solution by trial and error, still remained a mystery. Even the moral choices offer a good variety and, although we had some doubts about those entrusted to chance, in the end our fears proved to be unfounded and all of them integrated very well into the context. As the title suggests, even playing with time finally has a fundamental role and it is good to keep this in mind when you think you have reached a dead end. PSVita trophies The trophies of Zero Time Dilemma are 33, connected to the resolution of the puzzles and to the vision of all the narrative sequences. Obtaining platinum is therefore quite simple and it is sufficient to unlock all the fragments of the different parallel stories to get your hands on the most coveted trophy. See all the trophies Icarus Syndrome? On the technical and artistic front, the choices of the Chime boys didn't convince us. Indeed, one could almost say that the visual rendering of Zero Time Dilemma is almost disastrous. Let's start with the design of the characters: in search of greater acclaim in the West, the historic designer Kinu Nishimura has been replaced by Rui Tomono. The trait is different, not worse, but deciding to drastically change the appearance of historical characters like Akane or Junpei didn't seem like a great idea. But there can be. What really leaves you speechless is the inexplicable cinematographic drift of the title, almost a parody of the improvements seen in video games in recent years. The ugly but functional 3D environments already introduced in Virtue's Last Reward are re-proposed here, even for the backgrounds and cutscenes, where the level of detail is therefore minimal. During the dialogues, the classic visual novel cartoons were thus removed, in favor of alienating in-engine scenes: low polygon count, woody animations, zero expressiveness and, as if that weren't enough, even some problems in physics, with crazy locks of hair hard to ignore. The shots are then used without an understandable criterion, the movements of the camera are hysterical and there are also awkward attempts to reproduce the effects of depth of field (which is so fashionable in video games, but which only makes sense if its meaning is beyond blurring random elements of the scene). A bit like bad handwriting, after a while the immersiveness of the story overshadows these elements, even if some distortions end up being noticed even in the final bars. Net of music and a good level dubbing, with all the lines of text translated into voices (strictly in English and Japanese only), Zero Time Dilemma manages to make annoying the only aspect in which it was enough to limit oneself to the homework in order not to do damage. It's not for everyone.", "date": "2016-06-27", "grade": "9.0"}