{"name": "Il successo uccide", "ref": "https://multiplayer.it/recensioni/169472-minecraft-story-mode-episode-6-a-portal-to-mystery-il-successo-uccide.html", "text": "If you want to play the sixth episode of Minecraft: Story Mode - A Portal To Mystery, you have to pay for it. Which would be normal, but the way Telltale Games has hooked players, at least according to the reactions on the Steam page, is a shining example of bad public relations. The first series, which can be purchased in bulk, is in fact made up of five episodes, but tells a story that ends with the first four. The fifth episode is a narrative bridge that prepares the ground for subsequent events, narrated in the course of a trilogy that starts with the sixth episode and ends with the eighth. The fact that the numbering has not been reset, combined with the fact that the players have been drawn emotionally into a new adventure with the fifth episode, only to be left with a dry mouth, has therefore created a generalized sense of dissatisfaction. In short: playing only the first series, because of that middle episode, it feels as if everything has remained pending, despite the satisfactory conclusion of the fourth episode. And the only remedy for this painful ignorance about the continuation of the story is to shell out more money. So if you've only just tuned in to Minecraft: Story Mode, make the appropriate assessments. Putting this sinister commercial trap aside, the sixth episode was for us one of the funniest, and certainly the least predictable in terms of content. We had left Jesse, Petra and Luke in a corridor of dimensional portals, so we were not surprised when we saw them fall into a world full of zombies, during the typical opening of the series, with the opening credits mixing with the stunts of the our heroes. On the other hand we were blown away by the next turn. After finding a strange invitation written in a diary, our trio of adventurers find themselves trapped in a house with other people, at the mercy of a maniac who calls himself White Pumpkin and who is killing them one at a time to get hold of a magical kit composed of a stone and a tinderbox, essential for opening the dimensional portals. To get to the bottom of the mystery, Jesse becomes a sort of lieutenant Columbo, starting an investigation that follows the more classic yellow genre in a light and ironic way. This is in itself a welcome variant, in a series that has always staked everything on action and adventure, but there's more: the other guests held captive in the house are in fact youtubers who became famous playing Minecraft. For our part, we're too old to add YouTube celebrities to our list of things to get excited about, but many of you will be happy to see Captain Sparklez, Stampy Cat (this one's dressed as a cat, for example) StacyPlays, LDShadowLady in action and DanTDM. Especially knowing that the killer is one of them! Great, but in practice, how does this mix of publicity stunts and genuine professionalism of the writers work? Let's find out in the next paragraph. The sixth episode of Minecraft: Story Mode puts us on the trail of a dangerous youtuber killer! Five little youtubers Let's start with the special guests of the episode. On the one hand they introduce considerable variety into the typical cast of this series, but on the other they crowd out the established heroes of the group. The fact that they are still all in the hands of Jesse, and therefore of the player, makes the tube celebrities more likeable and less protagonists. And while they may not boast professional voice acting, you can feel the genuine effort they put into the part. And if you know who they are and follow their exploits online, they will give you even greater satisfaction. As for the actual investigation, as you can imagine, it doesn't deviate one iota from the classic game system of the series, wasting the potential of these games as always, which would need a few more ideas to make the leap in quality. but by now you should be used to Telltale's minimum effort mechanics, so it's useless to insist. The identity of the murderer is unpredictable, and this is certainly a point in favor of the episode, which also abounds in irony. The fact that some characters die raises the stakes, but the way they are quickly forgotten mars the emotional potential of the event a bit, leaving the story to swing between seriousness and levity without finding a balance. Thankfully it redeems itself from its ups and downs in the finale, with one of the best action sequences so far, especially for the tension it manages to create. Also from a graphic point of view, despite the jurassic age of the game engine, it seemed to us that the series has taken a step forward, especially as regards the animations. Ultimately, A Portal To Mystery is staIt was a pleasant episode for us, despite being disconnected from a broader narrative and we didn't know a damn about various youtubers. But the real question is: is it worth investing more money for the new trilogy based on what we saw in this episode? If you loved the first series and Minecraft is your passion, we feel like answering yes. If, on the other hand, you are looking for a structured narrative that adds something to what has already been told in the first four episodes, it is also powerful to close here and perhaps wait for the start of a real second season. Unless episode seven changes the tables. With a magical flint and flint, anything can happen.", "date": "2016-06-24", "grade": "7.3"}