{"name": "#sarannofamosi", "ref": "https://multiplayer.it/recensioni/170334-tokyo-mirage-sessions-fe-sarannofamosi.html", "text": "Originally announced as Shin Megami Tensei X Fire Emblem during the January 2013 Nintendo Direct, what has now become Tokyo Mirage Session #FE - known at home as Genei Ibun Roku #FE - is a very different JRPG than expected. The partnership between Nintendo and Atlus so strongly desired by the producer Kaori Ando had increased the salivation of fans of the genre to oceanic levels; after all, there was talk of a meeting between two real sacred monsters who have captivated gamers for more than twenty years each. Many unknowns had arisen about the gameplay from the beginning. Fire Emblem is a turn-based strategy, Shin Megami Tensei usually takes the form of a first-person ~dungeon crawler~ type RPG: what hybrid could have come out? After a nebulous period in which the project almost seemed to have fallen into oblivion, the crossover has completely changed its shape and transformed into a more traditional JRPG but not without a certain originality. In a word, Shin Megami Tensei X Fire Emblem has become... Persona! Tokyo Mirage Sessions #FE is the closest Persona-like JRPG you can play on Wii U Paso adelante After completing the ~main story~ and most of the side missions of Tokyo Mirage Sessions #FE in about forty hours, we can say that the crossover between Shin Megami Tensei and Fire Emblem looks much more like Persona than either of the two titles that they gave him birth. It is not so strange, if we consider that the award-winning Atlus series was born from a rib of Shin Megami Tensei; despite this, the influence of Fire Emblem is decidedly limited to a few extras and some audiovisual quotes: the Nintendo component seems more like a glorious fanservice than the backbone of the game. At this point, fans of Japanese RPGs will already be quivering. After all, looking like Persona is anything but a bad thing! Yet Tokyo Mirage Sessions #FE tries at all costs to rise to the same levels without completely succeeding, especially on the narrative front. But let's go in order. The story begins with a flashback: during a concert by young pop star Ayaha Oribe, a strange phenomenon occurs and the singers and audience disappear into thin air. Ayaha's little sister Tsubasa is mysteriously saved. Years later, Tsubasa intends to become an idol like her sister and enters a contest. By chance, his schoolmates Itsuki Aoi, our protagonist, and Touma Akagi are also there. The disturbing phenomenon repeats itself, but this time Itsuki rushes to the aid of Tsubasa and sinks with her into a parallel dimension called the Idolasphere and populated by supernatural beings called Mirages who manage to absorb the Performa, basically the creative energy possessed by humans. Itsuki discovers that he is a Mirage Master: he manages to purify a Mirage who only remembers his own name, Chrom, and merge with him to save Tsubasa and free the victims trapped in the Idolasphere. Tsubasa also discovers that he is a Mirage Master but, twist, Touma was already one from the beginning; the young man, in fact, works for Fortuna Entertainment, an advertising agency that promotes new talent, in reality Mirage Master thanks to whom he fights the threat of the Idolasphere. If this incipit seems absurd to you, welcome to the world of Tokyo Mirage Sessions #FE... we're just getting started. Itsuki and Tsubasa, in fact, will join Fortuna Entertainment to become true artists, increase their powers as Mirage Masters and foil once and for all the mysterious threat hanging over their city. Each of the six chapters that make up the ~main story~ of Tokyo Mirage Sessions #FE revolves around a particular case and one or more labyrinths in the Idolasphere, adding some detail to the general scenario until composing a mosaic that acquires a little more sense in the epilogue. Realistically, however, the story of the Atlus/Nintendo title is a triumph of absurdities and clichs punctuated through long dialogues, interlude sequences that are not exactly excellent from a director's point of view and continuous references and quotations from pop culture and the entertainment business Japanese. Don't get us wrong, a club of paranormal high schoolers chasing a serial killer who drags his victims into television isn't exactly a more realistic scenario, but there is a substantial difference between the more recent Persona and Tokyo Mirage Sessions #FE : the cast. The protagonists of Tokyo Mirage Sessions #FE are pleasant, captivating, but far from unforgettable. Itsuki is a generic teenager that couldn't be more generic, Tsubasa is the typical shy girl who hides a great willpower, Kiria is tough outside but insecure inside, and so on: nothing that a lover of Japanese animation hasn't already seen in any Japanese cartoon. In the absence of a full-fledged bad guy, the Mirages inspired by the Fire Emblem heroes spend most of the adventure complaining that they don't remember their previous lives and the player, paradoxically, finds himself entangled more in the dynamics of the entertainment industry than in a struggle to save the world. Fortunately, to deepen our knowledge of the various characters, various optional secondary missions, or ~side stories~, take over, which we can undertake in the grace period that divides each chapter from the next: these strongly narrative missions tell the background of the protagonists and unlock skills and upgrades decidedly useful. In short, they represent the Social Links of Persona, but without strategic nuances since we are not forced to choose between our friends or to micro-manage our times. We're pretty sure that many players will greatly appreciate this more casual approach to the limiting - and somewhat frustrating - Persona 3 and Persona 4. Dirty dancing The somewhat cloying narration of Tokyo Mirage Sessions #FE compensates for a rather traditional but damned well thought out combat system. The Atlus / Nintendo title is an old school JRPG in which you explore the city, visit the shops, interact with some passers-by to undertake any secondary missions; then you dive into the dungeons of the Idolasphere, often divided into multiple floors and characterized by environmental traps and puzzles to decipher and solve with a little intelligence. The exploration is interrupted only by the ambushes of the Mirages, ghost-like creatures that will pounce on us, triggering a fight on physical contact. Itsuki can strike them with his sword to stun them and then outflank or attack them while maintaining initiative; in the second case, the game loads a battlefield similar to a stage on which the three characters that make up our party are arranged. The fight takes place in turns and the order of actions is based on the speed of each allied or enemy unit. In reality, the third-person combat system is really an almost slavish copy of that of Persona 3 and Persona 4, with the small difference that the Mirages of our heroes only materialize during the most powerful special attacks. Each character is versed in the use of a specific type of weapon reminiscent of the Fire Emblem trinity: axes, spears and swords. Don't misunderstand, because the similarity ends there, since they represent Persona's ~pierce~, ~slash~ and ~blunt~ damage; in other words, some enemies are more or less vulnerable to certain weapons and, therefore, to the special attacks of certain characters. Itsuki, who wields a sword, will inflict more damage on an enemy vulnerable to that type of weapon: if in Persona hitting an enemy's weak point granted an extra turn to our character, Sessions occur in Tokyo Mirage Sessions #FE instead. Heroes who have learned the appropriate skills will immediately attack after the character who abused a weak point, and defeating one enemy during the Session will cause the remaining attacks to land on another enemy. Since the weaknesses apply to both weapon-related skills and those related to elemental powers - in fact, the spells of the Shin Megami Tensei series such as Zio, Dia, Rakukaja and so on are back - with a little strategy it is possible annihilate enemies within a few turns and earn extra rewards at the end of the fight. Keep in mind, however, that Tokyo Mirage Sessions #FE is no cakewalk even on the easiest difficulty level. Even Mirage Masters have their weaknesses, and enemies will not fail to take advantage of them in turn; moreover, the points necessary to use magic and special attacks are counted and it is not infrequently necessary to exit a labyrinth, perhaps using a practical teleportation, to refresh oneself at some drink vending machine before returning to the attack. It's also easy to run into some unwelcome Game Over when ambushed by the unstoppable Savage-type Mirages, which are hard to escape under normal conditions. Fortunately, Tokyo Mirage Sessions #FE guarantees the possibility of saving anywhere and at any time, urging the player to more or less long ~farming~ sessions between one boss and another. The cast enhancement system is in fact quite simple, but requires a fair amount of patience. By consuming the Performa of the enemies it is possible to manufacture new weapons - also called Carnage - for each character: if it is true that inOur idols level up by gaining experience points, their Mirages rack up points at the end of each fight, and the better we play, attacking weak points or winning in fewer rounds, the more points they earn. Carnage weapons unlock various skills at each individual level up, perhaps enhancing the spells or attacks already learned and therefore ~duplicates~. The catch is that each character can learn a limited number of skills, so at some point you have to decide which ones to forget and which ones to learn instead, a bit like it happened in (guess what?) Persona, when one spirit learned a new skill but could not learn any others. In this sense, the player has a minimum of freedom on the ~builds~ of the various heroes, it being understood that each of them remains anchored to a certain archetype which is expressed through the initial classes of their Mirages. The Radiant skills work in the same way, passive bonuses that increase the combat skills of the various characters or that guarantee them special powers such as the ability to survive a mortal blow once in combat: even the Radiant skills are learned by consuming the Performa accumulated by defeating the enemies, but they are also and above all unlocked by progressing in the main story or by completing the side missions. As we said, it's a rather traditional combat system: it takes place in turns, there are weaknesses, elemental resistances, magic and combined attacks. However, the excellent balance between simplicity and complexity that characterizes Atlus' JRPGs is felt from the very first minutes. Footloose It is typical of Atlus to play on the art direction to compensate for the technical deficits of its titles. He had done it with the latest Personas on PlayStation 2, he also easily succeeds on Wii U with Tokyo Mirage Sessions #FE, a JRPG that oozes style from every pixel net of a far from amazing polygon count. In the city, most of the inhabitants appear in the form of simple colored silhouettes: they don't count, we can't even interact with each other. Why waste memory and resources when you can visually turn them into background noise? Walking through Shibuya among myriads of colored silhouettes, then, immediately acquires a different meaning even under the narrative front. Tokyo Mirage Sessions #FE is a colorful title, at times excessive, almost baroque in the details of the costumes and in the performances of its protagonists, obviously the best made models of the bunch. It is not surprising, in this sense, that the uploads have appeared to us a bit long even in digital download, but fortunately the Atlus title shows very few uncertainties in terms of fluidity, except perhaps when the enemies are gigantic and the screen is filled with effects, but we are talking about almost imperceptible slowdowns. Strangely, it is not possible to play on the GamePad, which was even possible with Xenoblade Chronicles X, and in Tokyo Mirage Sessions #FE the screen of the Wii U joypad / tablet acts as a real subsidiary tool and a sui generis social network. In the universe of the game it's called Topic, but we'd call it WhatsApp: an irritating instant messaging software through which our scene mates comment on the story, converse with us and update us on their lives with illustrations and memes. The GamePad shows us the map of the city and the dungeons at any time, but also the statistics of our characters, their abilities, those of the monsters listed in the bestiary on the big screen, even the synopses of the various chapters of the story: it does practically everything , except let us play while someone else is using the TV. It's not a huge miss, but it's worth pointing out. Nothing to object, however, on the absolutely incredible musical accompaniment, as indeed it was reasonable to expect from a game about young singers and the entertainment industry. The songs are many and always spot on; there are also fully sung cartoon sequences, even if they are not many and are even shorter than we would have liked. The music of Tokyo Mirage Sessions #FE is something very special and it is no wonder that the soundtrack has sold very well at home. On this front, it is right to close the technical parenthesis, and the review, with the most controversial feature of this ~crossover~. No, we are not talking about censorship. Honestly, but who cares if the protagonists are a year older or if Tsubasa wears a t-shirt under the stage costume? We are referring instead to the western adaptation, which has preserved the Japanese dubbing and the texts completely in English. We are aware that for many readers the", "date": "2016-06-22", "grade": "8.0"}