{"name": "A Rio con le Olimpiadi di Mario e Sonic", "ref": "https://multiplayer.it/recensioni/170272-mario-sonic-ai-giochi-olimpici-di-rio-2016-a-rio-con-le-olimpiadi-di-mario-sonic-su-wii-u.html", "text": "The Olympic competitions of Mario, Sonic and their friends are back to celebrate the 31st Olympic Games to be held in August in Brazil and, just over a month after the release of the Nintendo 3DS version, Mario & Sonic at the Rio 2016 Olympic Games also arrives for the Wii U in what could be the last Olympic transposition for this console, given the arrival of the new Nintendo flagship in 2017. In our test a few days ago we had already had the opportunity to praise the formula of this Nintendo sports party game which, according to the sales data of recent years, has managed over time to carve out an important slice of supporters. The sunny beach of Copacabana immediately immerses us in the action, giving us the possibility to choose to immediately face one of the 14 disciplines using one of the more than 30 characters in the game or a Mii from those present on your console. As now in almost every title of this type, by winning you will gradually unlock new modes, challenges and objects in the game. As you will see, there will also be the Rio carnival which, from time to time, will ~arrive~ in the street adjacent to the beach and will allow you to face special challenges in one or more disciplines, depending on the allegorical float you choose among those present at Mario or Sonic theme (and related friends). Mario & Sonic at the Rio 2016 Olympic Games debuts Video Game Rugby on Wii U On the beaches of Copacabana Similar to the Nintendo 3DS version, control your Mii with the GamePad but this time, instead of wandering around the Olympic village of Barra da Tijuca or the Rio Maracan or Deodoro areas where many of the events of the Brazilian Olympics will take place , you move on the beach of Copacabana and in the area behind it and the different characters present will be your menu for choosing the game modes. Initially, you'll have to practice alone or in local multiplayer with at least Five different disciplines out of the fourteen available and, only afterwards, will you have access to the actual competition by choosing one of the three that will be randomly offered to you from time to time: in this way you will begin to collect medals but, if in some discipline you are unable to conquer them immediately, you will have to wait for it to reappear to try again. Although there are only fourteen sports, the three most complex, football, rugby and beach volleyball, they also have a Challenge version that adds bonuses or malus closely resembling the dream mode of this game on Nintendo 3DS. Fewer sports available than those present in Mario & Sonic at the London 2012 Olympic Games for Wii, however some are completely renewed in the commands, compared to previous versions, and can be tackled with three different levels of increasing difficulty: ranging from the typical pressing of in speed for the hundred meters, timing and coordination for the javelin throw and the triple jump. Swimming becomes more difficult and tactical, as it is necessary to start with good preparation and a precise dive (which is usually at least 50% of the race in reality), in order to accumulate as much energy as possible, the bar of which will only be visible in some phases of the race, to spend intelligently without repeatedly pressing the button for the strokes, thus avoiding running out of breath. In archery you will have to focus more on speed in hitting as many targets as possible than on precision, while a high number of stunts will make your fortune in competition with BMX; Rhythmic gymnastics has been quite simplified by limiting the typical structure of the ~rhythm game~ to pressing two keys corresponding to the right and left clubs and we have not found any particular difficulties even at higher levels. Both boxing and horse riding pass the test without infamy or praise; table tennis, on the other hand, is very fun, even if nothing particularly complex. The 4x100m relay is quite technical and, in fact, it is not limited to pressing the key to run but also to the precise and rapid pressing of some pairs of keys, increasing the speed during the passing of the baton. We arrive at the last three tests, the most complex and the only ones, as we said, to have a special mode (to be overcome even in the medal tournament). For football - or rather, futsal - you have the possibility to choose the game scheme between attacker, defender, central and lateral and, although it is nothing particularly miraculous, its choice will change the behavior of the players without the ball who will follow the action passing through central or lateral streets or remaining behind in the case of ao more prudent scheme: in the Sfida version there are no fouls of any kind, not even lateral ones, also allowing you to play from the side. You can also accumulate challenge points by throwing your opponent, knocking him down, beams of energy that will increase the value of the single goal. Beach volleyball is the simplest of the three remaining sports and, even on the difficult level, it won't take you long to win the tournament: the challenge mode, on the other hand, is slightly more complex as, even here, the challenge points could suddenly change the score that will be increased through the use of bonus items released by the inevitable ~mario kart cubes~. Particular praise goes to rugby which is not only very entertaining but, as we said in the test, it is the first playful video simulation of this sport: we will have to choose four characters to which we will place three Goombas or three Egg Pawns as props and we will be able, as per the rules of rugby, pass only backwards, sideways, to teammates who will free themselves from time to time. Once you have scored a goal, you will have the opportunity to increase your score with the classic free throw which here consists of trying to block an arrow that moves continuously from right to left between the posts, varying its speed (and therefore the shooting difficulty ) depending on where you are when you make a goal. Here too, in the challenge mode, there will be bonus cubes and, in addition, some rainbows which, if crossed, will make you temporarily impossible to tackle. Rings and coins for Sonic and Mario The game modes do not end here: the Clash of Heroes is very exciting, playable both in single and multiplayer, in which you will have to choose Mario or Sonic's gym and, with nine random characters per team, you will have to eliminate sporting counterpart elements. During the challenge you will also win bonus cards that will temporarily give advantages to the members of your team or will send some members of the opposing team to the bench: the challenge is a last man standing where the last to fall is the captain (Mario or Sonic). As we said, every so often the Carnival parade arrives and will present you with challenges with particular rules such as, for example, a rugby match in which you don't have to win but hit your opponents at least a certain number of times with bonus items, or a boxing in which you will have to win by technical knockout in one round. By overcoming each of the modes present, you will always be rewarded with coins and rings, to be spent in the Mario and Sonic shops, which will allow you to collect stamps and, above all, new equipment (swimsuits, soccer uniforms but also goliardic carnival costumes) which, when worn to compete in the appropriate discipline, will increase the statics of your Miis. The unlockable contents do not end here, in fact, by winning the gold medal in the various tournaments, a challenger from Mario or Sonic's gym will occasionally arrive and try to take it away from you: if you defeat him, you will unlock both the character himself and his theme music that you can select and listen to from Big, your character/inventory that you will also use to change your clothes. The amiibo have not been forgotten either: after winning medals in at least 25 Olympic tournaments, the part dedicated to them is unlocked and, using Mario or Sonic, you will participate in their special tournament, moreover, using any other amiibo will give you per day extra coins and rings. The graphic sector is always of excellent quality and the green and gold colors of Brazil are found everywhere: the game never suffers an iota of slowdown, no matter how excited the action is but, after all, the quality of graphics and music at which the Olympic transpositions Nintendo have now accustomed us to are a guarantee (the main musical theme, although basically quite pleasant, after some time becomes decidedly repetitive). Do we have the definitive Mario and Sonic Olympics game on our hands? Unfortunately there are some flaws. First of all, the challenges are not well balanced, some disciplines are almost embarrassing for their ease at level 1 but are almost impossible if not performed with maniacal precision at level 3. Another negative note is the obligation to use the GamePad for single player , we can in fact use the remote control or the Wii U Pro Controller only in multiplayer also; the GamePad, which also works in touch for menu selection, only acts as a second screen without adding anything in particular. Locally it is possible to play up to four players at the same time but as usual the online multiplayer is missing and everything you can do to compare yourself with the~rest of the world~ is to observe your ranking, or challenge other players in Match with ghosts mode (just like in Mario Kart 8) only for the hundred meters, the relay and the swim.", "date": "2016-06-22", "grade": "7.5"}