{"name": "Mighty No. 9", "ref": "https://multiplayer.it/recensioni/170269-mighty-no-9-mega-mighty-man.html", "text": "The story, whether or not you are interested in the game, you probably all know it, having been one of the main topics of discussion in the gaming world in the last three years, and especially for a few months now: there is Keiji Inafune, very big name in the industry, which after abandoning Capcom and founding Comcept, no longer being able to work on its children, decides to take back at least one, Mega Man, to give the many fans a modern version of the original spirit of the Blue Bomber, somewhat abandoned by parent company, after the revival of Mega Man 9 and 10, in favor of certainly valid spin-offs but now far from hardcore roots. There is a Kickstarter campaign that scores record after record and quickly reaches, with the help of another small PayPal campaign, 4 million dollars, well over the 900,000 initially requested. There is the collaboration with Inti Creates, another studio of refugees from Osaka who know very well how to get their hands on the blue cyborg, and there is even an important publisher, Deep Silver, who sees the potential of the project and intervenes to support it, guaranteeing it even more greater support, financial and visibility. After many vicissitudes, Mighty No. 9 is finally among us. To the ultimate test, did Inafune make it? Do androids dream of electric sheep? In short, the conditions for an old school success story are all there. But many things then go wrong: Mighty No. 9, this is the title of the game, begins to be afflicted by a series of delays, which have pushed the release date, initially scheduled for April 2015, first to September of the same year, then in February 2016 and finally in these early summer days. Apart from the extent of the delay, nothing very serious, it happens that a game is continuously postponed and if the extra time taken serves to improve and clean up the experience, so be it: the problem lies in communication and in the relationship with crowdfunding, which Inafune and his team have amply demonstrated they can't handle well. Boisterous promises on the dates that were not respected on time, and in the meantime another funding campaign for another project, Red Ash, failed miserably, and the media short circuit helped. Not that we should deal with all of this in this article, they are very interesting ideas for the direction that the industry is taking that we have dealt with several times and on which we will certainly return, the fact is that all this has contributed to diminishing what it was a great initial enthusiasm for the project until it turned into skepticism when not outright hostility, but does poor Mighty No. 9 deserve this ostracism? We say it right away: if you are a fan of Mega Man, even if with some reservations, the answer is no. The atmospheres of the original series are breathed starting from the plot, which deals with the question of the relationship between human beings and sentient machines in a very simplified way. The Mighty Numbers are a group of nine androids created by a team of brilliant scientists for the defense of humanity, but a worldwide virus strikes them and makes them rebel against their masters, along with all the other simpler machines. The only one immune from the epidemic seems to be Beck, the Mighty No. 9, who therefore has to face his companions one by one and bring them back to reason, assisted by his creators and his partner Call. A story therefore quite banal, but then well structured in its progression which foresees inevitable twists and turns and would also address, even without any pretension to philosophize, interesting themes with the right mix between drama and comedy, were it not for the dialogues, very present, which often in this attempt to resume the 90s they decidedly exceed, recovering all the worst of that period in terms of rhetoric and ~attitude~ so ostentatious as to be ridiculous. AcXelerate! Like his father, Mighty No. 9 is a side-scrolling platformer with very strong doses of traditional shoot 'em up action and a pinch of healthy puzzle solving, not explicit but which is necessary in understanding how to deal with some particularly difficult sections and in understand end-of-level boss patterns. Beck isn't a particularly mobile android, he runs with a certain phlegm, his jump isn't the highest, he can't even duck and his basic shot isn't a monster of power. It also has a few more possibilities, such as that of hanging from the ledges of the platforms, and then eventually getting on them or taking off a new jump from that position, or launching a blow and simultaneously jumping backwards, but basically it is not equipped with the myriads of moves of the protagonists of modern action. Thus one of the fundamental concepts of g comes into playameplay, i.e. the use of the AcXeleration, which in practice would be the classic ~dash~ that can be performed seamlessly both on the ground and in the air. Not only, however, can you move much faster than normal and cover distances in the air that a normal jump would never allow - which becomes fundamental in the more advanced stages - but it is also possible to absorb the Xel of enemies. In fact, these require a certain number of hits to be eliminated, but before complete obliteration they will enter a sort of tilt releasing an aura of a certain color: accelerating on them, Beck will absorb their power for a short time, which is a speed higher, greater firepower or the possibility of recovering some energy, and, moreover, the more enemies you absorb in sequence the more the score indicator will rise exponentially according to a classic combo scheme. All this gives the gameplay a very different imprint compared to the first, clumsy and slow approaches, making everything much more agile and spectacular. These are performances that give a great sense of satisfaction, but reserved for the best: even if you want to tackle it without ambitions of greatness, in the full spirit of its inspirers Mighty No. 9 is a very, very difficult game. With the general lowering of the difficulty in recent years we had forgotten how infamous the titles of the last two decades of the last century could be, and Inafune's new one reminded us of it in the most ruthless way by immediately presenting a series of situations that really put unease. The beauty is, however, that, after making us feel like fools, Inafune's novelty also reminds us how good we once were: with commitment and perseverance, we begin to struggle out of the more thorny phases, then we timidly try to put the acXeleration successful, and you end up getting decent scores as well. In this, Mighty No. 9 perfectly hits the target of recreating certain atmospheres and sensations, the satisfaction one feels in repeating the same section several times and becoming a little better each time, around which practically all the action until to a few years ago, it will definitely never be made obsolete by any prize-and-win mechanism. Playstation 4 trophies In addition to three secrets, a total of 28 Trophies are made available by Mighty No. 9: 13 Bronze, 9 Silver, 5 Gold and Platinum. Predictably they are connected both to the completion of the story and to the achievement of particular objectives concerning the score, the number of combos carried out in sequence, the time taken to finish a stage or the entire campaign, and obviously to obtain the most precious ones you will have to sweat the proverbial seven shirts, even a few more. Vintage or just retro? And how do Inafune and his team create this difficulty? The natural spontaneity of yesteryear level design is still there, but not always. In a context that always remains above the sufficiency, and which sometimes reaches peaks of excellence, at times, however, one has the feeling that some parts of a level are mere fillers with little action, only to then take you straight into the center of a phase unnaturally more difficult than the one that preceded it; we are talking about a few situations which, however, in the context of substantially short levels (but don't worry about the longevity: apart from the basic difficulty, two further difficulty levels, stages to unlock, DLC, one of which is already included, an EX mode with tons of challenges to deal with and competitive online multiplayer can keep you busy) make their presence felt. Speaking of levels, again in keeping with tradition, after a first introduction there are eight that can be tackled in free sequence: theoretically their difficulty should be increasing, but as happened in our test, don't be surprised if you find it more manageable, for example , the fifth compared to the second, depends both on your attitudes as a player and on the issue of the strong impact with the difficulty of the first hours of the game. And it also depends on the fact that, once a boss has been eliminated, its powers can be used, which however need a certain amount of time to recharge, assuming their form: powers that involve Beck's shot, all better than the basic one but each especially effective against another given boss. The fights with the bosses are the sections that are at the same time the most difficult and the most successful of Mighty No. 9: rich in patterns that they use without a particular predetermined sequence, these engage us both intellectually, to understand the countermoves to carry out, and with the pad, to implement the devised strategy. An encounter between a good player and a boss becomes a truly spectacular dancepad in hand, an epic moment like many similar ones from our past as players. The particular power of the boss also dictates the whole atmosphere of the level to which it belongs, due to the classic variety of situations involving, for example, the stage set in the mine, the one with an electric theme, the frozen one or the one that develops in height. In this sense, the title renders the atmosphere of the settings well, just as the character design seemed good to us, which closely resembles that of Mega Man but adding a very pleasant touch of Osamu Tezuka, one of the most famous manga artists in history, in particular in the representation of human characters who reminded us a lot, among others, those of Astro Boy; where Mighty No. 9 fails soundly, however, is in the mere graphic quality. It will be for the development started when the current gen was still next (and here the speech made at the beginning on the vicissitudes of the genesis of the title are valid), it will be for the presence on many platforms, if Inafune wanted to make the old school spirit attractive also thanks to the technical component, he didn't make it. Few polygons, trivial animations, decidedly dull textures which could also be an effect of the engine used, the Unreal Engine, which however on the other hand would be capable of managing a much higher three-dimensional mass and without those uncertainties in the framerate that even every both in Mighty No. 9 peep out. The effects are beautiful instead, apart from very rough explosions they are colored and sometimes very numerous on the screen, but the general picture is disheartening even for the less powerful machines involved. The pure music is in full tradition, even the composers come from the Mega Man saga, and suitable to accompany the action, but not memorable: however, it is possible to choose to listen to them in 8-bit mode. We close with the much dubbing present (in English, Japanese and French while all the texts are also available in Italian) and we refer to a discussion made previously, namely the recovery of the worst of the 90s: in full agreement with the quality of the dialogues , the acting is decidedly ~cheesy~. It will also please some nostalgic smelling of trash, but being interrupted in the middle of a demanding action by annoying voices that say annoying things in an annoying tone, well... it's annoying.", "date": "2016-06-20", "grade": "7.5"}