{"name": "Attraverso lo specchio", "ref": "https://multiplayer.it/recensioni/169223-mirrors-edge-catalyst-attraverso-lo-specchio.html", "text": "Against the backdrop of a futuristic city controlled by a totalitarian regime, the Conglomerate, Faith is a girl just released from prison and forced, according to KrugerSec directives, to reintegrate into society by finding a job within a time limit. She, however, has very different intentions: raised by Noah, charismatic leader of a faction of Runners, expert parkour couriers who make a living delivering on the roofs of Glass, Faith has nurtured over the years a strong desire for revenge in the against Gabriel Kruger, guilty of killing his parents and his little sister Kat when she was still a child. However, settling the bill will not be easy: Kruger controls the city thanks to technology and militarized squadrons ready to suppress any attempt to destabilize the established order. The plot of Mirror's Edge Catalyst is undoubtedly better than that of the original 2008 episode, with the total rewriting of the origins of the protagonist but the maintenance of some elements, although their introduction at a certain point is a bit phoned. The cutscenes act as the glue for a narrative that, as per sandbox tradition, follows a main storyline but does not skimp on subplots and secondary missions, working a lot on the structure to solve another of the problems of the first Mirror's Edge, namely the short duration : dedicating yourself to the story, to the optional quests, to the delivery missions and even to the timed courses (complete with a leaderboard for a comparison with the results of the other users) will probably take about thirty hours. Similarly, the controversial interpretation of Asia Argento, who in the first version lent her voice to Faith, was fortunately replaced by a group of dubbers proper, capable of rendering very well the various situations - even the most intense ones - and to add value to the product. Mirror's Edge Catalyst improves on the original experience in many ways, albeit with some limitations Get into the flow DICE has clearly set itself the goal of improving some of the less brilliant aspects of the original title, which nevertheless had conquered many players and offered an original and innovative experience; that of a first-person action game in which it was possible to run, jump, climb, perform stunts and reach a sort of nirvana, entering an endless flow of maneuvers that allowed you to go from point A to point B on the map in the fastest way and direct as possible, precisely as the philosophy behind parkour maintains. Unfortunately it often happened that you had to stop abruptly, encountering cumbersome paths to interpret, which had to be completed through a series of trials and errors that hatefully broke up the gameplay and ended up communicating exactly the opposite of what the authors intended. From this point of view, Mirror's Edge Catalyst improves things substantially, both through the expedient of the ~runner's perspective~, which by default shows with a red trail the route we have to take to get to a specific surface area on the surface and in combination with the inevitable red highlighter on the objects, but which can also be turned off or adjusted so as to be similar to that of the 2008 episode; both by offering a level design that best lends itself to the dynamism of our movements, with a few moments in which we must proceed slowly, perhaps balancing on a pipe or beam. In most cases we will therefore be able to run, jump, slide, hook onto long cables, land on tents and quickly climb walls and pipes, all without ever interrupting the flow. The same flow loads a bar which, once full, allows us to dodge the bullets of KrugerSec agents, especially if we decide to flee without a fight. Many things to do The perplexities expressed in our experience are fortunately averted, thanks to the introduction of missions that are quite different from each other, practically divided into categories according to the character with whom we will have to interact to access them. There is the main storyline, as mentioned, in which we will be asked to reach certain places, activate switches and face enemies in furious hand-to-hand combat that becomes increasingly difficult; but there are also optional quests that push hard on the platform component, recalling on several occasions the tombs of the old Assassin's Creeds or the climbing paths of the Prince of Persia ~with the glove~. In these situations we will not be able to count on visual assistance and we will therefore be asked to identify the points on which to jump, the mechanisms with which to interact and the areas where to exploit the new MAG tool, a magnetic grappling hook that allows you to perform various actions, from swinging from one platform to another to pulling yourself up towards a raised point, ending with pulling out barriers and supports, creating alternative routes. Then there are the typical sandbox missions, namely those in which KrugerSec control towers are deactivated, facing squads of soldiers and then fleeing and hiding from the sight of helicopters and video cameras; and those of delivery, which refer to the true job of the Runners and which will see us engaged in mad rushes from point A to point B to deliver the most varied goods within a very tight time limit. These situations clearly clarify that the ~Runner perspective~ can indeed be an advantage if you are not sure of the interactions with the environment to risk an improvised route, but at the same time it does not necessarily indicate the fastest route: by familiarizing yourself with the controls and by enhancing our character's mobility (see box) we will be able to discover different approaches, shortcuts and imaginative ways of cutting across the road that allow us to make deliveries on time. Finally there are the speed races, those that refer to the (unfortunately) small multiplayer component, in which we will have the task of completing various routes, memorizing the time obtained in an online leaderboard for comparison with friends and other users. We empower Faith Among the novelties also stands out the enhancement system of the protagonist, who can earn special points by completing the main missions and spend them to improve the characteristics related to movement, combat and equipment. The latter depends almost exclusively on the progression in the story, which brings with it the unlocking of new tools, while the other categories benefit substantially from the upgrades, allowing us to obtain a faster and more fluid stunt run, as well as to inflict greater damage on enemies during the clashes. fight! Another round, another issue on which DICE wanted to get a hand in order to resolve the inconsistencies of the original work, in this case the fights. In Mirror's Edge of 2008 it was possible to hit enemies and even steal their weapons, transforming the experience into a sort of shooter, but with a whole series of limitations and inconsistencies that hadn't convinced. For the reboot it was therefore chosen to prevent Faith from fighting except with punches and kicks (through the expedient of biologically calibrated weapons on the soldiers who wield them), inserting a set of opponents that is not particularly vast but well thought out, with agents of base that it is possible to kill through a simple combo of light attacks and others decidedly less inclined to be knocked down easily, armed with sticks, machine guns or pulse bracelets, ending up with an armored type, very resistant and capable of deliver deadly blows. You can exploit the environment in various ways, by hitting enemies to slam them against a wall or into each other, or even making them fall from a railing for instant elimination, as well as take advantage of a dash that is activated with the key right dorsal and which allows us not only to dodge their maneuvers, but also to assume an advantageous position to hit them from behind. Of course, if the developers' goal was to combine combat and movement, unfortunately it was not achieved: the clashes are static, sometimes cumbersome and even frustrating, and there is a lack of design choices that can support certain solutions, such as the attack from high, effective but not always easy to perform. In short, more work could have been done on this aspect, which nevertheless performs its task discreetly in certain moments of the campaign, creating dangerous situations from which we will have to get out with a minimum of strategy and promptness. The Xbox One version We also tested the Xbox One version of Mirror's Edge Catalyst in parallel, in order to evaluate any differences with the PC version. It must be admitted that DICE has done a good job on the Microsoft console, everything runs smoothly in sixty frames per second glory. Fluidity in a title like this is a decisive point. However, even in this case the difficulty of the consoles in reaching 1080p on the Frostbite Engine, used for the game, is felt. We haven't had the chance to measure the image yet, but the general lack of sharpness and the rather unsightly jaggies suggest the use of a resolution around 720p, exactly like the closed beta.Dario Rossi Youhere, the city? Although the improvements made to the original formula are many, there is a basic question that grips during the experience with Mirror's Edge Catalyst. The developers have built a sandbox structure that allows you to go virtually anywhere, but in reality it rarely happens to move between the roofs, on the balconies or in the offices without using the ~GPS~, and therefore for the pure pleasure of exploring the scenario . In short, the rendering of the city in the distance disappoints a bit, either for a graphic style that tries to remain faithful to the atmospheres of the first episode but ends up giving a feeling of old-gen and low polygonal count; you want for the details, such as the aircraft that crowd Glass's skies, the cars that travel the streets or the people who move in the few crowded spaces visible only from afar, all rendered really badly. Luckily, things improve substantially in the interiors, thanks above all to the massive use of transparencies and reflections, as well as chromatic choices capable of giving a minimum of personality to some locations. Unfortunately there is a lack of attention to detail, see the reflection of the protagonist on the panel of an elevator (which, moreover, reveals a very different polygonal model from that of the splendid cutscenes, much more spartan even in the animations) but not on the windows of the buildings or on the surface of the mirrored glasses worn by Nomad, one of the supporting characters. In short, the trick is there and it shows, although the general lack of graphic complexity helps to determine excellent performance on the test configuration, with 1080p and sixty frames per second constant, apart from rare cases, with all effects on ~ultra~ . Speaking of adjustments, the PC version of Mirror's Edge Catalyst, object of our tests, allows you to modify the general quality, through some presets, or to manually set the various values: texture, lighting, effects, post-processing, shadows, filter anisotropic, ambient occlusion and motion blur. Frostbite 3 has demonstrated good scalability, so it is possible that the game can run decently even on medium-low end configurations. Less engaging than we hoped, however, the soundtrack, which is functional to the action but leaves no mark. Editorial PC The editorial team uses the MSI Nightblade X2 Gaming PC", "date": "2016-06-06", "grade": "8.3"}