{"name": "Venti di guerra", "ref": "https://multiplayer.it/recensioni/169243-hearts-of-iron-iv-venti-di-guerra.html", "text": "The strategic series Hearts of Iron set during the Second World War was born in 2002, when Paradox was still a very small reality, which however had already made itself known to strategy enthusiasts with the first two Europa Universalis. Since then, a lot of water has passed under the bridge and today the Stockholm Software House has become a giant with dozens of titles behind it, including those developed directly and those published, which all strategy enthusiasts always look at with great interest. In the meantime we have arrived at the fourth Hearts of Iron, which not only follows the thread of the previous episodes, but takes full advantage of other series, especially in the interface. One of the main defects of Hearts of Iron III was precisely the excessive cumbersomeness of some menus, which made entry into the game more difficult than necessary. Of course, fans of the genre have never been frightened by a few extra clicks, but given the work done with the fourth chapter, in which everything is much more intuitive, above all thanks to a better organization of the menus and the more rational positioning of the various buttons, now less hidden and always in evidence, it is clear that the criticisms have served. However, there are a lot of buttons, because there are really many functions to cover, but now everything appears more controllable and direct, despite the fact that the complexity of the game mechanics has not disappeared. For those wondering why we started talking about the interface and why we dwell so much on the subject, it is right to specify that in a grand strategy title the legibility of what happens on the screen is one of the fundamental elements of judgement; one of those that can make the difference between a good title, a mediocre one and an excellent one. A bad interface risks transforming any strategy into a chaos of incomprehensible icons and numbers, inexorably compromising it. We reviewed Hearts of Iron IV, the new strategy set during the Second World War Let's start playing Once Hearts of Iron IV has started, like good boy scouts we select the tutorial to try to understand the rudiments of war. Unfortunately, despite the effort, after finishing it we had more questions than answers. The tutorial is structured in such a way as to let us perform some basic actions, explaining the different buttons as we use them. Too bad that to make our lives easier some options are completely deactivated, while the explanations never get to the bottom, referring to external links for more information. In fact, instead of following the game tutorial, before playing you should watch one of the many video tutorials that are already on YouTube (we recommend this channel, but there are others to consult), or go and read the Wiki official, practically a manual, where details abound (the Italian is missing, unfortunately, as in the game, after all). Of course, someone will already be frightened by a similar preparation before being able to play, but it is one of the costs to pay if you want to enter one of the most complex and satisfying genres on the market. However, something more within the game could also be done. After the introductory phase, which in this case already means several hours spent with the title of Paradox, it's time to choose our nation and start getting serious, examining the different possibilities available. The first box that we open is that of scientific research, which allows you to develop four technologies at a time (the slots can be increased during the game), chosen from a huge list. In the various selectable boxes you can find everything that can be used in war. It should be specified that technologies do not mean only new weapons or vehicles, but also types of infantry, tactical equipment, medical equipment, production facilities and much, much more. During a campaign it is not possible to develop everything and one is forced to choose a specific address, which guarantees not only a greater specialization of the army in the chosen field, but also a greater speed in discoveries, as it is logical. Production and micromanagement Speaking of production facilities, it must be said that there are several of them and they are located or are to be built in the provinces into which the territory of our state is divided. Initially care must be taken to have a certain number of civilian factories, which will be used to satisfy the overall needs of the population and to build and feed the military factories, in which the equipment for the front is built, and the shipyards, necessary to expand and fortify the fleet. The more factories you have available, the more projects you can buildsimultaneously, obviously provided you have the necessary resources to build what you want (we'll talk about it later). In reality there are many other structures that can be built in the provinces and cover all aspects of managing a nation in a time of war. For example, it is possible to upgrade the railway network to speed up the transport of men and vehicles to the front, or military airports can be created to, guess what, expand the range of action of the air fleet, while simultaneously reducing fuel consumption. In addition to production, an important factor to take into consideration is that of national focuses. Selectable from a rich tree diagram, they are targeted policies that take into account national specificities and are based on the historical reality of each state involved in the conflict. For example, Italy has national policies involving the war in Ethiopia, before and after winning it, while Nazi Germany has many voices regarding the use of propaganda, one of the driving forces of the Third Reich. National policies are not all prosecutable without distinction, but require choices of direction. In fact, the skill tree has branches that are mutually exclusive. This gives more weight to the selected aspects. Don't worry, because there is no possibility of making mistakes, unless you act on the field in a way that contradicts what you have chosen. If, for example, expansionary policies related to the naval fleet are implemented, then it is also necessary to work at a production level to enhance it, otherwise we only end up wasting resources. National policies also affect general politics, i.e. the hold the government has over the population. What does this entail? For example the percentage of people who can be drafted, but also the conviction of the troops at the front. Fighting for something you believe in makes you stronger than fighting disheartened by those in charge. Nazis to tie There are still many factors to take into consideration to start playing with a minimum of awareness of what one is doing, for example there is the economic factor, i.e. the type of market that one decides to embrace and which determines the possibility of selling a greater or lesser number of resources produced. Leaving the free market can lead to an increase in exports, with corresponding higher monetary revenues, but also the risk of having to buy back goods that have been sold and suddenly become necessary at a high price. There is also the political factor to be considered from a strictly institutional point of view, ie the general structure of the government, the political background of the councilors and more. The choices made influence other factors such as relations with other nations, verifiable in the menu dedicated to diplomacy, or the degree of trust of the population in the government. In reality, this speech is valid for the entire Hearts of Iron IV and in our opinion represents its greatest strength: if it is true that there are more or less important aspects to evaluate, it should always be kept in mind that every decision taken is reflected cascading over the entire state, and consequently over the game in progress. Often choices that seem innocuous end up producing unexpected effects such as nervousness of other nations, which for example could begin to fear our expansionary aims in the face of the production of a certain type of unit, or the implementation of certain national policies. Into battle! Did you find micromanaging your state complex? Know that even managing the army is no small matter. Available or created troops are located on the map. If desired, it is possible to transport them to the theaters of war (the latter are created by selecting more units at the front) more or less quickly depending on the available communication routes; for example, having a railway speeds up travel times compared to normal roads. Once a theater of war has been created, it is possible to assign a general or a commander (the former acts directly on the field, while the latter moves the ranks from the rear) to obtain bonuses due to their skills. Then you can set the front line to which all selected troops will move. Finally, the occupation of the attacked territory can be planned. If desired, it is also possible to move the troops individually, but you lose a lot in terms of planning bonus and overall impact strength. Furthermore, men do not take advantage of the skills of other troops and superiors. Thus, if for example you want to attack a single territory from several fronts, you should set them up and work on the positioningment of the troops considering them as a whole as forces of an army, rather than managing them individually, risking losing them in rash actions. Good management of the war fronts allows you to compensate for some deficiencies with tactics. For example, attacking an enemy from several fronts allows us to exploit the surprise effect, giving us victory even over forces that seemed superior to ours. Obviously you have to learn how to deal with the different types of units. For example, good air support can make the difference in an apparently disadvantageous theater of war. Once the planning phase is over, the pause can be removed and the result of our choices can be seen. The troops will move on the world map simulating battles, while the passage of time will be represented by the day/night alternation, which will allow you to quickly realize how many days have passed.", "date": "2016-06-06", "grade": "8.8"}