{"name": "Strategia in punta di dita", "ref": "https://multiplayer.it/recensioni/169097-battleplans-strategia-in-punta-di-dita.html", "text": "Battleplans is a kind of real-time strategy game specifically developed for mobile platforms. ~Ah, another tower defense, then~, you might think. Not really: incredibly, C4M Prod has come up with something that doesn't resemble Clash of Clans, nor precisely anything seen so far in the mobile sector, at least in this form. It is not yet a game comparable to the complexity of a PC strategy/management game, which perhaps is not even viable successfully on these platforms, but an interpretation of the genre perfectly placed in its particular context of use and endowed with an undeniable character. There is a lot of design work on this game, and this is evident both in the graphic aspect, very coherent and pleasant in every element, and in the care with which the control mechanics, troop movement and organization of events are built . There are many aspects to keep an eye on because Battleplanes develops on various levels, requiring the conquest of new territories, the management of one's army and the defense of the conquered territories, which can be targeted by other players in a sort of asymmetric multiplayer that introduces an interesting PvP element intersected with the single-player Campaign, mainly structured around PvE. The purpose is as classic as the war strategy itself and requires you to conquer the maps by taking control of various points of interest located within the various locations in the form of diamonds on which it is necessary to pass over with your units, obviously having to face numerous enemies attacking from different directions. To complicate the situation there is also a very strict time limit which forces them to operate with maximum speed, making precise and calculated movements with maximum efficiency. The description of such a game always seems much more complicated than the experience actually is, and the fact that everything can be downloaded for free prompts us to advise everyone to try it directly to get a more precise idea, there is a high probability that you will be very satisfied with what will appear on the screen, at least for the first few hours of the game. Want a mobile strategy that is not the usual tower defense? Battleplans is here With your fingertips A well-designed project for mobile devices is immediately recognizable from the interface, and the control system of Battleplans is perhaps one of the best seen in this genre. In battle we command various patrols of soldiers, each made up of a hero, endowed with special abilities and greater resistance, and a series of subordinates specialized in different classes (infantry, archers, cavalry, spearmen, etc.) whose level evolves with the training. It is simply a question of touching a patrol and moving your finger on the map to indicate the direction to take and the interface draws a line in correspondence with the traced movement, building the trajectory through an excellent pathfinding system. Considering that each map has various points to conquer within the time limit, it is necessary to send the patrols to different positions and it is therefore useful to learn how to assort the various teams in the best way to face the different situations that can arise in combat, while exploiting the particular abilities of the heroes. The clashes are resolved in a rather simple way, more based on the level of experience and power of the fighters deployed than thanks to actual complex strategies of encirclement or arrangement on the map, to tell the truth, but there are considerable refinements for a title of this typology, such as the influence of the type of terrain on the ability to move and the attack/defense parameters and the precise calculation of the guard times to be set on the maps in the defensive phase, i.e. when you find yourself having to set the protection of the conquered territories from other players' attacks in asymmetric multiplayer. To all this we must then add the management of the base with all its ramifications concerning the flow of gold in the coffers through the control of the mines in the conquered territories, the evolution of the heroes through the various levels of experience with consequent expanded abilities, the unlocking new classes of fighters to be deployed as units in battle and the training of the latter with the obvious progression in experience level. All very well done even if some shortcomings emerge in the medium to long term. The structure of the game is set in the long run on rather wild grinding, and we know what this feature associated with the free-to-play model leads to: every action on the management front is based onThe wait, which can be cut by spending gems, which are earned in action but can also be purchased for real money. As the game progresses, the expectations multiply, also because the actions to be queued increase and all this translates into an extremely fragmented pace of play or in the more or less regular use of microtransactions.", "date": "2016-06-02", "grade": "8.3"}