{"name": "Lemmings", "ref": "https://multiplayer.it/recensioni/lemmings.html", "text": "The fulcrum of the game is the moment of strategy decision and role assignment Playing Suicide The purpose of Lemmings, if it had not yet been understood, is to guide a group of bipedal rodents within a setting strewn with obstacles up to the end-of-level point (which distinguishes salvation). From the moment they become part of the stage, the Lemmings will continue to move incessantly, it will be the player's task to manage the movement times and assign the tasks for each animal. The fulcrum of the game is the moment of strategy decision and role assignment: at the beginning of each level it will be absolutely necessary to pause and study the geographical conformation of the current challenge, because from the moment the lemmings start walking, nothing can stop them anymore. In the lower part of the screen you will find the selection bar which will allow the player to select, by pressing the backbones, a specific job (excavator, paratrooper, bomber, climber, and so on..) to be performed by each rodent present in the internships; for each level there will be a maximum limit of lemmings present and a certain number of them to be brought to safety (most of the time a percentage of the total is dedicated to the ~allowed losses~, a certain number of useful deaths to bring the level to achievement ). For each stage there will be different ways to achieve victory, Lemmings is a game that leaves the player with a certain degree of customization of his strategy, only in some particular cases, however, will it be absolutely necessary to find that single solution capable of unraveling the skein and bring the entire group to safety. The difficulty of the game is divided into four distinct categories that offer increasingly complex challenges, making the experience a sort of educational path in terms of puzzles: the greater the difficulty, the greater the speed and lucidity of the player must obviously be in analyzing the internship that presents itself before him. 100 Lemmings the size of two 3.5~ floppy disks As previously mentioned, this chapter of Lemmings PSP takes up the very first episode in all respects, all 120 stages of the original version are present in the umd with some interesting new features: the backdrops, while remaining faithful to their predecessors, have been rejuvenated' and reproposed in a pre-rendered 3d version, decidedly more attractive for the current generation; the display takes full advantage of the psp screen, giving the player a better chance of observing the conformation of an abundant 75% of the stage; the concept of the video recorder was linked to the adventure, it will be possible to pause the game with start while continuing to select objects with the backbones or simply observe a certain part of the level not framed, in the same way it will be possible by pressing the circle button to send the game ~fast forward~, without having to wait for endless minutes for the evolution of the lemmings. In addition to the historical levels, there are 36 extra stages designed especially for this portable version and an absolutely intuitive level editor that will allow you to create your own settings at will by choosing from all the elements, traps and obstacles present in the game. In addition to the canonical game modes, there is also the possibility of downloading level packs directly from the yourpsp.com site, a bit like what happened with wip3out, a really interesting implementation because it will allow players who are passionate about Lemmings to continue the 'rescue' operations even beyond the end of the game. The graphics sector will certainly not be remembered for having fully exploited the psp hardware, Lemmings is a graphically essential game and history teaches that it knows how to play its best cards when there are no useless additions to its solid gameplay. The sound does not live, like the graphics, moments of glory, many of the effects also come from the original version and the music that accompanies the levels often end up getting lost in the concentration of the game. This version of Lemmings for PSP apparently has nothing wrong: to a renewed care of the two-dimensional backgrounds, we add the undoubted properties of the screen and a number of levels capable of engaging even the most talented player for a long time. Beyond this, however, the game does not go: 15 years have passed and the saga has not found new ideas of originality, returning and fossilizing itself on a structure and a gameplay which, however successful, can now boast the title of ~old~ and ~already played~. Definitely a good game for atypical puzzle game lovers and a great gameco for fans of the saga, not recommended for those who would like an innovative and graphically performing console on the PSP. Pros: It's Lemmings and it's in top shape. Very long-lived. Some interesting news. Cons: It's Lemmings and it's always the same. It doesn't take advantage of the psp hardware at all. It was the year 1991 when the small DMA Design released -for Commodore and Amiga- Lemmings, a game that soon would have redefined a new type of puzzle game ironically dubbed ~Save them'up!~, or ~save them all~. Because this was what had to be done in the game: an incredible number of rodents wandered aimlessly within a strictly two-dimensional stage, in search of salvation. The lemmings were nothing more than the virtual counterparts of the small rodents which, according to the myth, followed mass suicidal instincts by jumping into the cold northern seas. In the game you had to subvert this bizarre law of nature by helping the little animals with green hair to victoriously complete the stage. Lemmings has followed the video game market in the (vain) attempt to keep up with the times and after the unsuccessful 3D episodes, the guys from Team17 (already makers of Worms and with a very recognizable graphic touch) try again once again by bringing back the franchise back to square one: remake with additions of the very first chapter of the saga, again 'strictly two-dimensional'. The PSP is the predestined console for the big comeback, so all that remains is, laptop in hand, to return to give hope to the little people.", "date": "2006-04-11", "grade": null}