{"name": "Persona 5 Royal", "ref": "https://multiplayer.it/recensioni/persona-5-royal-recensione-nintendo-switch.html", "text": "Better late than never, says an ancient proverb, and you can bet that all those who have been waiting for a long time to convert one of the best Japanese RPGs of the last generation to their reference platform are repeating it. Released in 2017, then re-proposed in a revised and corrected version in 2020, Persona 5 immediately became an iconic game that many Sony console owners have envied for years and years. Fans of the genre were able to amuse themselves on Nintendo Switch with Shin Megami Tensei V - which, for the uninitiated, is the series from which Persona derives - but for those who love fiction, let's face it, Persona 5 was quite another thing . At least the wait is over and in our review of Persona 5 Royal for Nintendo Switch we will tell you how this conversion went. Be careful, though, because if you want to know more about gameplay, content and story, the best thing to do would be to go to read our original reviews of Persona 5 and Persona 5 Royal. Here we will only give a brief overview of what the Atlus title can offer you, we will compare it with the closest RPG in the Switch library and we will evaluate the quality of this conversion for Nintendo Switch. History today as then Persona 5 Royal, you may have to answer questions at school Our review of the original Persona 5 began with a warning about the narrative, something like: ~If you don't speak English, forget it because otherwise your eyes will bleed~. Persona 5 Royal, however, does us the holy courtesy of having subtitles completely in Italian - but dubbed in English or Japanese, your choice - even if it remains a highly discursive game. We read a lot, sometimes even too much, and in certain moments it borders on the visual novel by how much the characters speak. But this is exactly a characteristic of the Personas, the price to pay for a solid narrative, a cast characterized in the smallest details and a long and articulated story that lasts many hours. of Wonderland and the Japanese as angelic figures who are always selfless and helpful, Persona 5 Royal will give you a loud awakening, as it strongly attacks Japanese culture and society, especially in the relationship they have with modern youth. For those unaware of everything, we will only tell you that the protagonist, framed by a man of power for a crime never committed, finds himself living away from home for a year, and therefore attending a new school in an environment which he doesn't know. For inscrutable reasons, he also discovers that he can access the Metaverse, a sort of parallel dimension in which the shady figures who dominate reality have erected their Palaces, practically the projections of their disturbed personalities. Forming the band of Phantom Thieves, the protagonist and his friends decide to get justice with the power of the Persona, a spirit that each of them can draw on to fight and which represents their inner self. In short, the story is quite bizarre, but Atlus tells it to you as a kind of thriller, complete with flash forwards that do nothing but intrigue the player, pushing him further and further. Compared to the narrative of Persona 5 released in 2017, the Royal version adds some important innovations, such as an additional playable character and a series of supporting characters that extend the adventure by a few hours. Persona 5 Royal, Kasumi is a character added in the Royal version The Nintendo Switch version of Persona 5 Royal maintains all the features of the 2020 edition: it is literally a slavish copy in terms of content, so the same thing we did in the past is valid and not valid. I mean, does it make sense to replay Persona 5 Royal if you've played Persona 5 before? Today as then, it is an answer that you have to give yourself. The fact is that Atlus has organically integrated all the novelties within the original adventure, in the sense that the additional narrative arc is not something that could be assimilated to a separately proposed DLC, which whether it is there or not there is the same, and this means that if you have already played Persona 5 - which, we repeat, is a very long and demanding RPG - to get to the new features of Persona 5 Royal you will have to start all over again. It's a less topical speech in 2022, considering that many Nintendo Switch owners probably didn't play the original in 2017, and if instead they did at the time, well, it might also be a good opportunity for them to refresh themselves the memory. RPG and turn-based combat Persona 5 Royal, Jose is one of the new Confidants As for the gameplaylay, Persona 5 Royal falls overwhelmingly into the category of Japanese RPGs or JRPGs, in English and if you have played Shin Megami Tensei V you will immediately feel at home: you will immediately recognize the infamous Press Turn system - here renamed Ancora 1 - which forces you to exploit enemies' weaknesses to stun them and gain an advantage. The difference between the combat systems, which are both turn-based, lies in the fact that Persona 5 Royal is a little more complex, with a series of additional features that you have to learn to master, such as firearms or the Relay , and which the game fortunately explains adequately and gradually. The Anchor 1 system, for example, allows you to pin enemies on the spot and extort money or items from them, if not hit them with an Assault that inflicts a lot of damage. In some cases, a dialogue can also be established, and if the player responds correctly, the enemy becomes a Persona to be summoned in combat. Persona 5 Royal, taking advantage of weaknesses you can enter Robbery mode The similarities with Shin Megami Tensei V don't end there. In the Velvet Room - a pocket dimension that can be accessed from specific entrances - recruited Personae can be merged into predetermined combinations that offer new abilities, new spells and new resistances. In short, if you managed to complete last year's challenging Atlus RPG, you shouldn't have any problems embarking on this adventure, also because it is possible to choose between various difficulty levels. Once you understand how to use spells, firearms, grappling hooks and so on, the combat system explodes and gives a lot of satisfaction, also because it can be extremely spectacular and stylish. However, everything else changes compared to Shin Megami Tensei V. Beyond the fact that Persona 5 Royal, as already mentioned, is strongly narrative, as well as structured with more or less closed maps that include the city with its neighborhoods but also the Palaces and the Memento, real dungeons full of enemies , puzzles and pitfalls, there is a whole ~social simulator~ component that must absolutely be taken into account. Persona 5 Royal, turn-based combat can get very challenging In essence, given that the story follows the protagonist's school year, we will find ourselves attending school and micromanaging our free time, during which we will have a plethora of different activities available but also a narrow window to practice them. Better to study or work, to improve our statistics and access new content, or meet one of the Confidants, the supporting actors of the story, to get to know him better and acquire new skills? Better to go to the cinema or eat a snack with friends? What if instead we sacrificed the RPG component to dive into a Palace or the Memento to look for new Personas or level up? Strange as it may seem, Persona 5 Royal is an extremely strategic title from this point of view and, without following a guide , you risk reaching the end without having seen all the content that Atlus has managed to squeeze into it. In short, for those who love role-playing, even considering that the protagonist has no voice of his own and we will often have to choose his answers with all that can ensue, Persona 5 Royal could be everything that Shin Megami Tensei V was not. The paradox, in fact, is that as similar as they are, the two Atlus RPGs are also very different in their ambitions and in the audience they are aimed at. The Nintendo Switch version Persona 5 Royal, the inevitable Jack Frost The fact that Persona 5 Royal - a code that basically dates back to PlayStation 3 - runs beautifully on the Nintendo console should come as no surprise, and certainly not after we got a taste of it in the form of Persona 5 Strikers last year. For the record, the Omega Force title released a year ago, which wanted to be a sequel, now becomes a kind of parallel future, given that it took into account the original Persona 5 storyline and not the Royal version. Closing this brief parenthesis, in reality there is little to say about Persona 5 Royal except that on Switch it runs at 30 frames per second instead of the 60 of the current-gen platforms. It is a stable frame rate, however, because we have not noticed any particular slowdowns even in the most geometrically complex scenarios, such as for example the passage through the skylights in the first Palace, in which theoretically the hardware should have struggled a bit more. Persona 5 Royal, micromanaging daily life is very important We feared that Strikes, for example, could choke the Nintendo hybrid console, but even in combat we were pleased with the fluidity that Atlus managed to maintain, without sespecially sharpen the resolution. The image appears less defined than the 4K of the PlayStation 4 Pro version and of course the current-gen ones, but the aliasing is barely noticeable and in general we found a good cleaning of the image, which however appears a bit blurry. However, this does not detract from the beauty of the scenarios, characterized by an edgy and ingenious design that adapts reality to Shigenori Soejima's anime style. Switching from the Dock to portable mode, we didn't notice any particular difference. The game remains practically as it is, only reduced: fortunately, interfaces and menus remain highly legible even in the resized space and do not tire the eyes that much. In other words, those who feared a disappointing conversion can reassure themselves: Atlus has done a great job.", "date": "2022-10-17", "grade": "9.6"}