{"name": "Una storia persa nella nebbia", "ref": "https://multiplayer.it/recensioni/168572-fallout-4-far-harbor-una-storia-persa-nella-nebbia.html", "text": "Bethesda had specified that support for Fallout 4 would not be lacking after its release, and it certainly kept its promise. Far Harbor is now the third DLC available for the title and it is a very different beast from the first two additional contents on which fans of the house have been able to get their paws: no crafting upgrades this time, just a new island with a very different atmosphere from that of the original map to be explored, and a dedicated storyline. The American giant found himself faced with a rather challenging situation to resolve with this DLC, given the dissent expressed by the fans for the fluctuating quality of the main narrative and secondary questlines. With Far Harbor the developers have therefore decided to follow another path, closer to the third Fallout and much more satisfying for those who have long wanted a plot worthy of being followed. And all in a location where the contents are at least as dense as the fog. Disappointed with Fallout 4's main storyline? Far Harbor could be the DLC for you Atomic Fog Far Harbor starts with a simple request for help received from the good Nick Valentine. The Nakano family, residing on the edge of the Commonwealth, is looking for their daughter who ran away from home and needs a detective (or at least a good Samaritan) willing to follow in her footsteps to bring her home safely as soon as possible. It won't take long to understand where the young Kasumi Nakano is: convinced that she is part of the synthetics, the girl has in fact fled to the island of Far Harbor, where there is a mysterious refuge of her fellows called Acadia. On board a boat owned by your customers, therefore, you will leave for the distant islet, all emboldened by any reward or by the simple desire to do good. And this very strong motivation will last about twenty seconds once you touch the ground, because you will almost immediately understand that in Far Harbor there are far more interesting characters than Kasumi and far more complicated stories than that of a daughter who ran away from home. Far Harbor is, after all, an evocative place not because of the perennial radioactive fog that pervades the air, but because of the unstable situation that arose after three factions settled there: the inhabitants of the port are the most classic, a group of people who simply try to live between the constant attacks of brigands and the changed marine fauna that occasionally decides to take a trip to the coast; much more curious are the Children of the Atom, fanatics of atomic energy who worship the radioactive fog of the place, or the synthetics of Acadia, led by the peaceful DiMA. On the other hand, these groups are attractive above all for the characters who populate them, among the most multifaceted and best characterized of the entire production. Good and evil are relative concepts The main strength of this DLC lies precisely in the story and in the characterization of its protagonists. You will be able to complete the primary narrative line in a handful of hours, but you will spend these between well-written dialogues and not very dispersive events, during which secrets of all kinds will be revealed to you and even some of the more innocuous personalities encountered will prove to have very dark. It is this kind of duality that was missing from the main campaign, as well as the lack of clear and very heavy moral choices on the player's part. Far Harbor corrects the shot, giving rise to a series of morally complicated situations that will often put you in front of choices far from heroism (sometimes for the common good). Even among the Children of the Atom, which apparently should be a simple group of lunatics, there is no shortage of decent enough people to interact with, demonstrating how much Bethesda has committed to creating factions and side quests worthy of being explored. We also advise you to bring Nick Valentine with you during the expansion: many of the DLC events directly concern the detective, and it would be a shame to miss out on some dedicated dialogues just to replace him with the much less charismatic new adventure companion. Old Logfellow, this is his name, is certainly a veteran fighter, but we found him really dull in terms of personality, especially when compared to the other individualities of Far Harbor; do yourself a favor, therefore, and leave it aside immediately in favor of the good Nick. Between secondary and primary quests Far Harbor has approximately 20 hours of gameplay if you are a lover of exploration, and many of the minor missions in turn boast greater care than the common both in terms of narrative and structure. For heaven's sake, there is no shortage of typical tasks, but at least you will have good motivation to complete them most of the time.Harpoon everything Even the art direction of the new setting is remarkable, much more gloomy and darker than the barren but colorful lands of the Commonwealth. The banks of fog that cover a large part of the territory help to hide enormous monstrosities, radioactive dogs and brigands suitably styled to fit worthyly into the new ~seafaring~ setting, and there is also a considerable effort in the creation of the headquarters of the various factions, from the town maritime where you reach the beginning of the DLC, the atomic submarine around which the Children of the Atom have settled. Finally, the dlc does not lack a fair amount of weapons (including a very tasty harpoon rifle) and additional high-level armor, a fair reward for battles generally recommended for already rather massive characters. An already high-level player won't have much difficulty tackling this adventure, but if you try at the beginning of the game you could easily end up badly. Between robotic amenities, super mutants and overgrown crustaceans, you won't survive long at low levels. We only feel like making a few negative notes on the DLC: the first concerns the price outside the season pass, because 25 euros is not a few, despite the longevity in this case is not lacking. We also found a particular puzzle phase during the main quest, which takes place in a sort of virtual reality, rather tedious. The idea on paper is very tasty, but it is poorly implemented as it uses the same clunky mechanics of crafting in outposts. It could undeniably be applied in a better way. We close with the bugs, which sadly never fail, and even on this occasion they managed to block the progress of a couple of minor quests. Fortunately, however, we did not have similar problems with the main missions.", "date": "2016-05-23", "grade": "8.2"}