{"name": "L'imperatore ci salver tutti", "ref": "https://multiplayer.it/recensioni/168396-total-war-warhammer-limperatore-ci-salvera-tutti.html", "text": "Not even the Emperor knows what fate awaits the Warhammer Fantasy world. If we talk about board games, enthusiasts have rarely experienced a more tumultuous period than the recent one, which between End Times and Age of Sigmar turned years of tradition inside out like a sock. Games Workshop itself does not seem to have too clear plans for the new direction taken; more accessible, of course, but at the same time not without serious problems in the eyes of veterans and according to some more focused on the sale of miniatures than on hard and pure strategy. It is therefore curious to see how, in an unpredictable moment of chaos, the British house appears to have finally achieved a much-needed lucidity in the parallel field of video games. The Warhammer license has in fact been granted to a long list of talented developers, who have started promising projects whose arrival we did not believe possible. Among them, one in particular has caused cheers and jaws to drop among fans: Total War Warhammer. On the other hand, few other marriages seem as predestined as the one between the Games Workshop brand and the Creative Assembly strategic saga; yet a mix of complex rules can create both an incredibly profound work and a tangled disaster, and it is certainly not easy to deal with a titanic background like that of Warhammer, even for experienced development teams. After spending several hours waging war between the undead, greenskins, dwarf beards, demonic abominations and the glory of the imperial army, we are therefore ready to give you our verdict on the title on which the burden of reviving Totals falls. War, and luckily it's not a Pyrrhic victory. This is not a Total War like the others: here is our review of Total War Warhammer! The strongest wins... or the biggest one However suggestive a fusion between the rulesets of the two products involved could be, it was immediately obvious that the smartest (and feasible) solution for the development of this title would have been the application of the Total War systems to the Warhammer armies , and the very concrete Creative Assemblies therefore immediately followed this path. Total War Warhammer is not a simple reskin, however, so much so that the changes made to the mechanics compared to the past have at times surprised us by their importance. Starting from the imperial campaign can easily be misleading: you still start with classic troops such as spearmen and swordsmen, and during the early stages you do nothing but repel enemies with tactics very close to the well-known and well-known ones of the series. Yet it is enough to observe the unnatural power on the field of Emperor Karl Franz to realize that there is something profoundly different in this game compared to the other chapters, and the first ~unnatural~ opponent is enough to understand that he is dealing with a much more aggressive and indomitable beast than usual. The main and most obvious novelty lies in fact in the asymmetry of the armies, and in the presence of highly unrealistic units and elements in them. Warhammer is basically a fantasy brand, and this automatically leads to deploying wizards, griffins, giants, ghosts and an endless list of other mystical creatures in their armies that completely change the gaming experience. In past Total Wars you might see soldiers knocked to the ground by cannon or catapult fire, or troops snapped in half by advancing cavalry, but never before have you seen the effect of greater forces on a base militia than in Total War Warhammer. Between huge Araknaroks and trolls, clashes between armies appear much more brutal and devastating, and in general all charges between troops seem more ~physical~ and less like two shapeless masses pushing one on the other. The ~blob~ effect obviously remains largely when two humanoid militias are challenged, but the strength of certain units still gives enormous satisfaction. My army is not like your army We specify, even gigantic beasts and ghosts fall within the typical ~rock-paper-scissors~ system of Creative Assembly works, and if before it was automatically clear which units were strong against cavalry or infantry, here it is the case to read qualities and weaknesses of the various choices before being deployed on the field. Indeed, it is the asymmetry that we mentioned earlier that is the real star of the show, as it forces us to approach both the battles and the management elements of the campaign in a totally different way based on the selected faction. The situation makes more sense if described in detail: the Empire, for example, may seem like a faction without major peculiarities, but is actually able to completely annex other human factions thanksthanks to diplomacy, with the latter's armies and cities passing under the player's control without damage (this feature makes the Empire the faction most focused on peaceful relations with neighboring kingdoms). The Vampire Counts, for their part, expand thanks to vampiric corruption, a value which, if spread in the various opposing provinces, causes unrest among the population, while guaranteeing greater control over their own regions; at the same time the vampires can flesh out their army by awakening the dead, without having to wait more turns to acquire new troops (it may seem unbalanced, but we are only talking about very weak basic troops, provided that you are not in areas where many have fallen fighters in a battle). Even more peculiar are the Greenskins, who fill a special WAAAGH! at every battle; if you reach the climax, a second general guided by artificial intelligence appears to support your army, causing those who side with the Orks to adopt an extremely offensive and warlike style. Finally, to achieve the final victory, the Dwarves must take revenge for any wrong they have suffered, promptly marked on a book that almost serves as a menu for the secondary quests. Technology or magic? However, the diversifications are certainly not limited to a few extra mechanics. In battle, for example, the dwarves do not have magical units, but they can count on effective flying vehicles, excellent ranged troops and resistance to mystical energies. The Vampire Counts, on the other hand, lack long-range units, yet their heroes boast highly effective magic, their flying units are mighty, and among their ranks are monstrosities resistant to physical damage. Put simply, we could list the differences between the races for hours, also because these expand to the technological research system (very crude and simplified for the orcs, of course), to economic sustenance, to the management of public order and to diplomatic ambitions of the commanders. Perhaps it is on this last aspect that we had more fears: the world of Warhammer is in constant war, and between certain sides the thought of a truce is almost impossible; diplomacy was therefore a very difficult element for the Creative Assembly to dose, since it would have been unmanageable if too close to the real Warhammer, and would have infuriated the fans if completely detached from the mythology of the brand. The approach was therefore of a mixed type, and the developers decided to insert a rather simple diplomatic system like the one seen in Rome II, with markedly differentiated behaviors based on the groups involved. Let us explain better, all races can make non-aggression pacts or truces, but while for some it will be quite easy to do so, reasoning with others will be almost impossible. With the Greenskins, an agreement will succeed a practically zero number of times, while a peace between Vampire Counts and Dwarfs will be rare and dictated mainly by pressure linked to dangerous enemy armies in the vicinity. The solution will not satisfy the mythological fundamentalists, but it remains sensible. In addition, while not the best diplomatic system ever seen in a Total War, Warhammer allows some interesting goodies related to factions and its heroes. For example, sending one of your agents to expand the vampiric corruption in a region with which you are in truce can subtly lead it to rebellion, and all without affecting relations with it. War heroes Speaking of heroes, these represent another total distortion of the typical Total War structure. In Warhammer, armies are led by lords, some of whom, such as Emperor Karl Franz or Mannfred von Carstein, count as legendary characters as they are very important to the game world. Heroes can join the battle in their lords' armies, but at the same time have the ability to separate from them to act in various ways. They can create turmoil in a region, attempt the assassination of a general, weaken a city's defenses; they practically replace the agents, becoming very effective factotums even during the clashes. And when we say ~super-effective~ we're not kidding, as each hero alone is as good as a veteran unit, and each comes with specific buffs or magical powers capable of giving a faction enormous advantages. The magic system is particularly curious, as it takes advantage of the magical winds that vary from battle to battle, represented by a consumable value to cast the various spells. However, starting immediately to shoot bursts of mystical energy can be detrimental, since the charges of the winds recharge more and more slowly, until your magicians are left defenseless. Clearly, both heroes and lords owna dedicated development system, which usually focuses on battle, agent or political skills to positively influence the performance of their regions. We are just a little concerned about the balance of the armies, in the face of heroes equipped with these abilities and numerous units alien to the usual world of Total War. We haven't noticed any particular upheavals, unbeatable units, or unsurpassed counters between the various races, but it has already happened that the Creatives missed the center with the balance of the armies, and in this chapter the likelihood of seeing instabilities in competitive multiplayer is higher than ever. Chaos is watching Considering how significant each race's quirks are to the gameplay, and how unusual the units are this time around, we fully understand why the popular upsurge following Chaos' cut from the initial factions. Not that the game already doesn't boast respectable content, but its fulcrum lies precisely in the diversification of the experience linked to the races, and eliminating one of these to re-propose it as DLC was in fact a dishonest move. It's fortunate that Creative Assemblies came to their senses, deciding to give Chaos away to all first-week buyers, but sadly it wasn't included in our review copy, so we didn't get a chance to try that campaign. The same goes for Bretonnia, present in the game but without a campaign and with a perceptibly less colorful choice of units and heroes than the others. Overall we expect many new entries as time progresses, but already we are satisfied: after all this is without a doubt the Total War with the most unique and worth playing campaigns of the saga, and even if there is no real plot and proper to give weight to your actions, there is no shortage of sudden events, dedicated quests, and even a random loot system which, based on certain completed missions, supplies your heroes and lords with weapons and artifacts (a particular sword has given way to a long questline for Manfred von Carstein during our test). The behavior of the artificial intelligence on Normal difficulty is also very appreciable, given that we found it much more active and aggressive than usual, especially when it comes to Greenskins. The only problem here lies in the changes the Creatives seem to want to make to the difficulty ahead of launch. In fact, it seems that for the testers the campaign was too difficult with this setting, and therefore will be filed downwards. We sincerely hope they don't overdo it. We only have the technical analysis left, and it's time to start with the most important aspect to evaluate: artificial intelligence. In the mind of the strategist After the nasty surprises of Rome II we wanted to avoid being caught off guard, so we tested the AI of all races at various difficulty levels in numerous battle situations. In general we found her to be of a good level, capable of navigating passably at Normal level, without particular virtuosity, and extremely dangerous at maximum difficulty, where she performs complex pincer maneuvers and practically always moves in the meanest way possible. The level of challenge is therefore there, but we have found some shortcomings. For example in the underground ways (elongated maps that appear when Dwarfs or Greenskins decide to move their armies underground and are intercepted) the artificial intelligence of certain races seemed extremely passive to us at maximum difficulty. Without positional advantage, the CPU waits for your move before moving; she can therefore be fooled with long-range siege weapons, to which she sometimes does not react. We've seen this sort of behavior on normal maps as well, but it's rarely happened that the enemy freezes completely if attacked, so the problem only exists underground. In sieges, however, it performs well, also facilitated by the many changes to the system. In practice, sieges are now always directed in a specific direction, with similar city layouts, single or double and angled walls, and a more basic outpost internal structure. With only one side to think about, these battles have gotten much faster and more brutal, but also less tactical. Repetitiveness is avoided by the differences between the races, which deal with the assault on the walls in a very particular way, but in general, lovers of advanced strategies may not be happy with the solution. The way in which the artificial intelligence moves in the countryside is also more than good. Seldom have we seen senseless diplomatic proposals or insane attacks on even the most acute difficulties", "date": "2016-05-19", "grade": "9.0"}