{"name": "Progetto completo", "ref": "https://multiplayer.it/recensioni/167874-project-cars-game-of-the-year-edition-progetto-completo.html", "text": "Exactly one year has passed since the market debut of the final version of Project Cars, the ambitious automotive title from Slightly Mad Studios financed by users through one of the most important crowdfunding campaigns in the world of video games. Even after going through several postponements and with ~the misstep~ of the Wii U version repeatedly promised and reconfirmed and finally canceled to the disappointment of Nintendo users, Project Cars ultimately convinced the lovers of simulation car titles in many ways , also garnering acclaim from critics. So after a few months, Bandai Namco wanted to collect all the work done with DLC and post-launch updates, adding other extra content and finally condensing the loot in this Game of the Year Edition, evidently with the intention of convincing with a version richer - and sold at a reduced price - those who were still at the window or hesitant about buying. Even with some perplexity about the appropriateness of subtitling this edition in this way by recalling prizes and coronations that are not particularly clear in their origin, let us now examine what the offer of this new release consists of. Project Cars: GOTY Edition is an edition that contains the work done in 12 months by the British team At full throttle So as regards the additions on the disc compared to last year's version, the list is quite rich and starts from the presence of 125 cars, 50 more than the original number, with 60 liveries created by the community. Although expanded, the virtual garage of the Bandai Namco production remains strongly focused on out of the ordinary cost and power means: a precise design choice, which wants to avoid the player the tedious initial stages aboard ramshackle four-wheeled snails. Precisely in this sense, and exclusively for this occasion, two Pagani supercars have been introduced, namely the Zonda Revolucion and the Huayra BC, which add to the rather meager list of Italian four-wheelers available. In addition to this, a special version of the Nurburgring circuit combined with the Nordschliefe was later included. A challenging and fun track, which blends well with the others already present originally or added through subsequent packages, and which brings the total of available locations to as many as 35 for over 100 overall layouts. All this makes up a package that can therefore count on a considerably enriched amount of content compared to the debut: the most important thing however, which is certainly not exclusive to this GOTY Edition, lies in the refinement of the Project Cars experience and at least in the elimination of a large part of the bugs and problems that had negatively characterized the period immediately following the launch. With 12 months and a dozen patches behind it, the Slightly Mad Studios title has finally been cleaned up of the most serious imperfections that had initially affected its value, allowing the game's full potential to be expressed. PC master race As previously mentioned, Project Cars also in this GOTY Edition offers a rather different game structure than usual, with a career freely accessible in each of its classes right from the start (whether it is a question of Karts or prototypes of the 24 hours of Le Mans) and therefore with practically all the contents accessible without the need to unlock them. A choice which, if on the one hand allows you to avoid the exhausting and often boring early stages of the career mode of most similar titles, on the other hand it reduces the stimuli for progression a little by delegating everything to the ~simple~ pleasure of driving and improving their skills and then put them into practice in online challenges against real opponents, which constitute the richest and most interesting slice of the English team's offer. Project Cars also shows its best in the customization possibilities, truly numerous both as regards the rigorousness of the driving model and therefore the activation or otherwise of the relative aids and damage management as well as for the duration of the race, the weather conditions (with the ability to see them vary dynamically) and the period of development within the day, from morning to night. Our test on PS4 has lent its side to some criticism regarding aspects that are all in all marginal, but nonetheless indicating an improvement that can be improved for the console version. For example, the interface appears a bit too elaborate, with the size of the texts so small that it is difficult to read even on a 55~ TV. Although it has always beenseeing as the reference version for Project Cars was the PC one, an eye to the different methods of use between monitor and television would have been appreciated. Closely linked to this discourse must then be interpreted what is almost a necessity in the case of Bandai Namco's production (and more generally in the approach to a simulation racing game), or rather the use of a setup with steering wheel and pedals: all this not only to fully appreciate the nuances of the driving model studied by the British team, but precisely because of the difficulties encountered in using a pad, which greatly reduce the appeal of the product. Also from a technical point of view it is clear that the best performance remains the prerogative of computer users: let it be clear, on consoles we are not talking about an ugly game to look at, but undoubtedly capable of offering a minor impact due to the sacrifices made above all in scope of textures and some effects.", "date": "2016-05-09", "grade": "8.6"}