{"name": "Panderoico", "ref": "https://multiplayer.it/recensioni/167841-taichi-panda-heroes-panderoico.html", "text": "Released exactly a year ago, Taichi Panda used the now not very original gimmick of the martial arts expert panda to offer an action RPG experience on the one hand very ~Asian~ in the interface, full of writings and icons, very confusing at first; on the other, she has a good attitude and a lot of substance. Net of the inevitable implications of the freemium model, in this case the need to carry out a bit of grinding at a certain point in the campaign, the formula worked and entertained pleasantly, so much so that we find ourselves twelve months later with what originally should have been a real sequel, but it was then mysteriously called Taichi Panda: Heroes instead of Taichi Panda 2. The differences compared to the first episode, in truth, are several; in particular in terms of the structure, which now has a rich online hub full of players, from which to access, according to automatic or manual mechanisms, a large number of missions, usually short and culminating in a boss. Does it remind you of anything? If you have had the opportunity to try it, you will certainly notice that it is the same approach used by the Chinese team for Age of Wushu Dynasty. More: so similar as to give the sensation of being faced with a simple reskin. An educated guess? Taichi Panda: Heroes is an enjoyable, good quality action RPG, but originality is not its forte Heroes, heroes, heroes After selecting our character from a shortlist of three, obviously including the panda, who represents the ~powerful~ alternative of the group, the game takes us through a series of missions to familiarize ourselves with the gameplay and with the mechanisms that regulate the looting, crafting and upgrading our warrior. The phases in the hub are resolved almost entirely through automation: just touch the icon of a quest for the avatar to head in the right direction, interacting with NPCs or jumping into the portal that will lead him to a new battle. At that point we will have to use the basic attack and the character's four special abilities, to be unlocked progressively, to face hordes of increasingly cunning opponents and the inevitable bosses. Compared to the original Taichi Panda, in this new episode there is the possibility of recruiting two companions and taking turns in command of each of them, so as to obtain greater variety. At the same time, however, we will have to take care of the growth of each member of the team so that there are no weak links: luckily an automatic setting, once again, allows us to resolve the age-old issue of upgrades with very few touches and without having to do boring comparisons between weapons and equipment. Does the end result work? Basically yes, but only provided you haven't spent a few hours with the aforementioned Age of Wushu Dinasty, since the two titles are practically the same. To turn up their noses, in addition to the clear lack of originality, there is also a technical sector that offers good design solutions, but which in terms of performance leaves much to be desired: the sixty frames per second are a distant mirage, indeed in truth Taichi Panda: Heroes does not even hold 30 fps and there is no point in lowering the quality of the graphics. A very annoying thing, where touch control systems would need all the reactivity possible. The sound effects are also bad.", "date": "2016-05-07", "grade": "7.0"}