{"name": "Protagoniste a tutti i costi", "ref": "https://multiplayer.it/recensioni/167685-hyperdevotion-noire-goddess-black-heart-protagoniste-a-tutti-i-costi.html", "text": "Sooner or later it had to happen. Idea Factory has postponed this moment for a long time, but after years of (semi) exclusive games on PlayStation consoles, the situation was becoming unacceptable. How could empty-headed Neptune afford to steal the show so shamelessly from the beautiful and intelligent Lady Noire at every opportunity? Why, despite her gullibility, did she always have to get the honors of victory? Thus, after repeated and vehement protests, strictly anonymous, the CPU (Console Patron Unit) of Lastation has finally obtained the deserved role of protagonist. Not only that: the presence of a heroine with an IQ higher than that of a monkey has allowed Compile Heart to push itself into a genre for brainiacs, that of strategic JRPGs. On the occasion of the arrival on Steam of the spin-off released last year on PlayStation Vita, his faithful secretary is then ready to analyze Hyperdevotion Noire: Goddess Black Heart and, through a series of irrefutable proofs, show the world why Noire is and will be still better than Neptune. Or maybe not. Obsessions of protagonism or a valid spin-off? Here is the judgment on Hyperdevotion Noire, Idea Factory's T-JRPG An unrealizable utopia The story of Hyperdevotion Noire: Goddess Black Heart shows some short circuits from the standards of the series from the very beginning. First of all, in the introductory battle, Noire's superiority is overwhelming, so much so that the Lastation CPU manages to keep up with the three rivals without too many problems. Admitted defeat, Purple Heart Neptune, White Heart Blanc and Green Heart Vert, respectively CPU of Planeptune, Lowee and Leanbox, decide to run away to study a new offensive. In fleeing, however, they forget Histoire, the oracle of Planeptune and Nep-Nep's babysitter, who is welcomed by Noire waiting for Neptune to notice her absence (and decide she still wants to bear her lectures). In the meantime, however, not everything goes right and, in an attempt to end the conflicts, poor Noire is deceived and loses her powers. It is at this point that the player, strictly male, makes his providential appearance and, due to a series of fortunate circumstances, is immediately hired as secretary of the beautiful CPU. And here's the second oddity: sure, it's not a new situation for a spin-off (who remembers Hyperdimension Neptunia: Producing Perfection?), but the presence of a male in the cast of main characters is definitely unusual, especially if it's a human being. Even if he is not a playable character and his lines are never dubbed, the figure of the secretary is central to the story and helps to put the player in the middle of equivocal situations, typical of harem games. However, the overall quality of the gags suffers and in this way the narrative ends up becoming too monothematic. There is no shortage of the usual amusing inconclusive dialogues, especially if Neptune is involved, and the fourth wall is always close to falling apart, but the common thread ends up remaining unchanged even in the most bizarre situations and thousands of characters are wasted for only two reasons: try to seduce the worthy secretary or find an excuse to convince the various generals to join the team with slaps. Another novelty introduced in this chapter is in fact the presence of the CPU lieutenants, or the personifications of successful brands such as Metal Gear Solid, Final Fantasy, Monster Hunter, Pac-Man and many others. Obviously they are all pretty girls, who embody the typical stereotypes of Japanese animation while using phrases and attacks on the theme of the game they are inspired by, in the usual citation whirlwind that helped make the series' fortune. At your service, Lady Noire! The presence of the player in the roster of characters in Hyperdevotion Noire does not only have implications on the story, given that the secretary is also involved in a whole series of Sim mechanics introduced in this spin-off. In addition to canonical structures such as the shop, where you can buy potions and weapons, the two crafting areas, where it is possible, respectively, to develop games to add to your equipment or use projects to increase the shop's assortment, and the guild to accept new missions, the capital of Lastation also offers the possibility of visiting Noire in the Basilicom and the allies in a special hotel, where you can also find the images, videos and music unlocked up to that moment. However, it is precisely in the ~basilica~ that the player can increase his bond with his employer. The mechanism is actually extremely consumerist, given that everything revolves aroundno to gifts to improve the decor of Noire's home. Gifts are bought on Amazoo.nep, but to do so you need Sim Points which in turn are obtained by spending credits in the shop. The more Credits you spend, the more Sim Points you have and the happier the CPU is and more available for new conversations, in a whirlwind of shopping spree that highlights Black Heart's unbridled passion for shopping. However, the duties of the secretary do not stop there and at the beginning of each new chapter the player is called upon to provide support in public relations with the inhabitants of Lastation: responding correctly to more or less bizarre requests from the fans, with response choices in perfect dating simulator style, bonus conversations and new CG images can be accessed more quickly. The visual novel vocation, in fact, is also solid in this spin-off: obtaining new artwork remains one of the factors that drives us to continue playing and increase the inevitable Lily Rank, the degree of affinity between the heroines who it also affects the characters' battle prowess. The chessboard of goddesses The combat system is, inevitably, the most interesting aspect of Hyperdevotion Noire: Goddess Black Heart, since it allows you to control the CPUs in a new genre. This obviously doesn't apply to those who have already played the PlayStation Vita version, but let's leave the self-evident statements aside for a moment. It has already been mentioned above how in this spin-off the characters spend rivers of words, often to no avail. The combative vocation of Noire and her companions in fact transforms even the quietest exchange of jokes into a pretext for beating hands: not only against enemies, but also when dealing with companions and potential allies it is easy to end up in a clash for leadership or to demonstrate one's determination. Once on the battlefield, the work of Compile Heart, which for the occasion has collaborated with Sting Entertainment, however, proves to be more solid than expected. The characters thus move on scenarios full of obstacles and traps, objects to move, mobile platforms and treasures to collect. The attacks are divided into three standard types (basic, skills and special skills), but thanks to elemental crystals, weapons can change their affinity with the elements, with Fire, Ice, Lightning and Wind forming the classic wheel of weaknesses and resistances. Between kisses that reduce the cost of skill points, spectacular special moves and situations of clear numerical inferiority in which it is essential to weigh each move well, the result is a strategic RPG that is sometimes quite difficult and stimulating, especially at the Hard level. Unfortunately, a historical problem of the brand also returns, which inexplicably continues to offer difficulty peaks that are inconsistent with the progression, prompting the player to repeat the side missions rather than attempting new strategies. Finally, a few words should be spent on the technical sector, which does not differ at all from what was seen in the portable version. The super deformed style of the protagonists benefits from a higher resolution and the fluidity is much better on PC, but there are no real settings to adapt the graphics to your gaming system. On the other hand, the title has not obtained any graphic upgrades and the limits of the original in the polygonal modeling and in the quality of the effects remain evident. The sound sector, on the other hand, remains on good levels, proposing some classic music from the series and the usual, discreet dubbing in English.", "date": "2016-05-05", "grade": "7.0"}