{"name": "Ve li buco questi palloni", "ref": "https://multiplayer.it/recensioni/167523-pang-adventures-ve-li-buco-questi-palloni.html", "text": "It is virtually certain that anyone born before the 90s has seen Pang at least once, regardless of whether they are a fan or have simply followed the world of video games or not. It is one of the most popular arcades in the 90s, coming from the volcanic Capcom of those times, queen of the arcades together with the other historic Japanese manufacturers. It is probable that exotic screenshots of this arcade appear somewhere in the memories of those years, if not for having played it directly at least as a background element of some neighborhood bar experience or summer arcade, and the fact of being able to draw from this common memory is a good starting point for Pang Adventures, the inevitable remake-nostalgia operation by the DotEmu specialists. For the younger ones, or for those who spent the 90s away from any contact with video games, let's summarize the basic concept, which has remained the same as at the time: mysterious aliens are trying to invade the Earth using a large number of of colored orbs that kill on contact. These can be hit but they split into two spheres of reduced size and higher speed, and so on until the spheres become very small (and numerous) and at which point they can be eliminated (if you manage to hit them, of course). The story features two boys intent on cleaning up the Earth from this alien threat, traveling the world to various settings represented by static screens with variable scenarios and trying to eliminate all the spheres present in each level armed with a sort of gun with bullets and effects editable based on the collected power-ups. The basic mechanics have remained unchanged and still proves to be very valid today, with the new additions stuck quite well in the flow of the game, however some intrinsic problems emerge in the long term while in the immediate term the control system proves to be somewhat uncomfortable. Can Pang Adventures fully exploit its potential on mobile platforms? Bouncy balls As befits certain historical arcades, the mechanics of Pang Adventures are simple but at the same time well thought out: the main character moves at the bottom of the screen while the balls bounce both on the floor and against the edges of the fixed screen, creating considerable chaos in every visible area, especially when they begin to double and increase in speed. The greatest difficulty is given by the impossibility of crouching or jumping, which forces you to move on the horizontal axis with perfect timing to dodge the spheres, also considering the fact of having to deal with the immovable edges of the levels. Even the use of the weapon poses some difficulties: in its basic form, the gun can only fire one shot at a time which takes a certain amount of time to reach the top of the screen, leaving the protagonist defenseless for very long fractions of a second, therefore a missed shot can become quite fatal. This feature can be modified by the numerous timed power-ups that can be collected around and modify the rate, range and effects of the projectiles, creating considerable variations in the pace of the game and the gameplay, which in itself also changes with the variation of the spheres (different colors correspond to different behaviors) and with the configuration of the levels, which present destructible and non-destructible obstacles and platforms. This sort of remake also introduces some new features, expanding the amount of levels and scenarios, introducing new boss fights and adding new power-ups, all elements that are generally well integrated into the basic structure, in addition to the inclusion of a couple of additional modes based around asynchronous online challenges based on score. Unfortunately, the classic multiplayer is missing, which was also one of the basic characteristics of the original Pang, with its classic ~doubles~ now no longer replicable. The remake operation obviously also concerned the graphic design of the game, which presents itself as a valid updating of the original look, even if the charm of the pixel always remains unsurpassed compared to the modern ~flash-like~ design. More traumatic, on mobile devices, however, is the adaptation of the control system, with the classic virtual keys on the screen which, being fixed, can be difficult to touch with precision and can lead to fatal errors, considering the very small margin of error allowed by the game .", "date": "2016-05-03", "grade": "7.8"}