{"name": "Buon anno del Kraken: arriva lo standard mode", "ref": "https://multiplayer.it/recensioni/167520-hearthstone-sussurri-degli-dei-antichi-buon-anno-del-kraken-arriva-lo-standard-mode.html", "text": "The year of the Kraken officially began on April 27th and this event marks a real revolution in Hearthstone with the birth of Standard mode, a new format that no longer allows you to use cards from the Curse of Naxxrmas and Goblins against Gnomes, and Wild mode, another format in which, however, all existing cards can be used. Not only that, the cards of the brand new Whispers of the Old Gods expansion have made their entrance on the game board. In our preview we had mentioned the corruption that was taking place in the depths of Azeroth due to the awakening of the Old Gods, but we had only been able to know C'thun and little else. During the month of April, however, all the remaining cards of the expansion were presented culminating, shortly before the release, with the heavy nerf to 11 existing cards which, in some cases, made them even unusable (at least for the moment). Lots of news, therefore, and now more than ever we feel like saying that it was really necessary to move the waters in a decisive way, due to a meta game now dominated by the usual four or five decks with cards that are impossible to replace simply because they are too strong: from a certain rank onwards (already from 17, we could say) a Paladin opponent was enough to know that he almost certainly had to face his secrets or, generalizing, a turn 7 of any deck to find himself facing Doctor Boom (now called Doctor Seven by the community) . We will try to understand if the standard will be the right move or just a simple way out to be able to eliminate from the competitive mode now ubiquitous cards such as the Piloted Log Sawmill or the Shielded Minibot, in any case, as reiterated several times, in trading card games a division into formats is absolutely inevitable and now it's Hearthstone's turn. Whispers of the Old Gods, standard and wild formats, lots of new features for Hearthstone Goodbye Combo Druid As already mentioned, the developers really waited until the last moment to communicate the nerfs of the classic cards to the community and, as expected, it was the Druid with the Force of Nature who, in the new version, lowers the its cost at 5 mana and summons three chargeless Treants, effectively canceling, in addition to the well-known combo with Wild Roar, also its very useful removal power; the Keeper of the Wood keeps its effect and cost intact but the body goes from 2/2 to 2/4 making it much weaker, while the Ancient of Knowledge is only slightly weakened by drawing only one card instead of two. The changes to the other classes were certainly more painless with the Hunter seeing the cost of the Hunter's Mark raised from 0 to 1 and the Thief's Blade Flurry no longer doing damage to the opponent but only to minions and seeing the cost rise to 4. Some neutral minions have also suffered a fatal weakening in some cases, such as the Arcane Golem, which becomes 4/4 but no longer has charge, the Tainted Gnome, which from 2/1 becomes 1/1, and the Giant of Magma, whose base cost becomes 25 making it playable at 0 mana only when we are at 5 life points and, therefore, dangerously close to defeat. More luck for the Knife Thrower who reduces his attack from 3 to 2, keeping the skill intact, and for the Hunting Expert who increases his cost from 3 to 5 mana but will see even more use due to the minions, with very high attack, present in the new expansion. We don't fully agree with these changes, both because in some cases they make some cards unusable, as happened in the past for Captain Warsong in combo with Grim Client, and because instead of correcting cards that are still too unbalanced, such as Reno Jackson ( which restores life points to the maximum), insert some new legendaries that, conceptually, resemble them and risk reducing the game to ~a single draw that makes too much difference~. We listen to the new whispers Finally we also know the remaining deities who join C'thun and then, directly from the Lovec books... no, from the World of Warcraft universe make their appearance Yogg-Saron, Y'Shaarj and N'Zoth and also they, with their whispers, corrupt the existing cards transforming them in the most unexpected ways: one above all is Ragnaros who from a neutral Legendary becomes Ragnaros Enlightened and enters the ranks of the Paladin with a healing effect instead of an offensive one. This possibility of corrupting the cards has led to some very amusing results both in the effects of the cards (which, however, generally, in terms of gameplay, do not make one cry for a miracle) and, above all, in the artwork where the designers really indulgediti (we cannot fail to mention the very Italian illustrator Dany Orizio and his Vate della Rovina Fedele). In a nutshell, 51 of the 132 cards are neutral minions and each class adds 8 cards and a legendary minion to its arc: it is still early to say how the meta game will move, however some decks for the Druid, the Sorcerer and the Warrior revolving around C'thun, legendary who has a high number of minions who interact with this deity (there are as many as 15). The other very strong legendary is certainly N'Zoth who, for 10 mana (this is the cost of all the Old Gods), is a 5/7 who as soon as he enters play brings all his already destroyed minions back onto the field, provided that have the Deathrattle ability: we have already seen the birth of a very strong adro deck that involves using it by interacting with other new spells such as the Underground Journey which, for just 1 mana, allows you to discover (skill introduced with the League of Explorers) a card with Deathrattle. Y'Shaarj for 10 mana is a 10/10 that at the end of each turn puts a random minion from your deck into play: for now this seems to us the Ancient with the least possibility of use. For Yogg-Saron there is a separate discussion: at the usual cost of the Old God it is a 7/5 that casts a number of random spells equal to the number of spells you have played up to that moment on random targets (including you among the targets) thus appearing as a card born specifically to create chaos (with good grace of Trolden, the youtuber who creates videos of funny episodes closely related to chance or ~RNG~, the Random Number Generator). We have seen the most absurd situations materialize, including losing a game in which a player who blatantly has the advantage, summoning Yogg-Saron, has first seen a pyrosphere hit him, then forced to draw fifteen cards and, therefore, die for the end bunch. In general, it seems that the games in the standard mode are getting longer, moving the game towards mid-range/control: we have only scratched the tip of the iceberg and in the next few days a bullying return of some aggressive decks is not excluded but, for now, even the first (few) decks for the hunter seem to confirm this trend. Gifts... divine Although it was possible to purchase the promo pack of booster packs of the new expansion at a special price throughout the month of April, Blizzard is well aware that there are many players who have never spent money on Hearthstone and, therefore, with the launch of Whispers of the Gods Antichi has decided to meet everyone. Upon entering the game, it immediately gives us three packets and, upon opening, you can add both C'thun and two copies of the Invoker of Evil. But that's not all, in fact you will have the opportunity to play two very special missions that will give you access, by winning, to an additional 10 packets for a total of 7 games in standard mode. Also on a visual level there has been a change in the interface for the Standard or Wild formats with the latter modifying, at the time of selection, the colors and the elements present by adding branches, roots and leaves. As far as the Arena is concerned, there are no modality distinctions and, therefore, the choice of cards will fall on all existing ones except C'thun and the cards that support it. It will be possible to face two ladders separately and become a Legend in any mode but, as well specified by Ben Brode and his development team, the only competitive one that will provide points for the continental ranking will be the Standard one. The End of Season Reward Chest, on the other hand, will be awarded based on the higher of the two rankings. We can say that Blizzard's choice to steer the competitive scene towards Standard certainly eliminates a good portion of that uncontrollable C factor which was present above all in the Goblins Vs Gnomi cards, just think of the outcome of a game which could have been changed by Unstable Portal or by a Doomsayer coming out of the Deathrattle of a Piloted Lumberjack. So all that glitters is gold? Not exactly; the part of the expansion linked to C'thun, in our opinion, has not been developed very well and this, first of all, can be seen from the fact that the Shaman, the Hunter and the Paladin do not even have a card dedicated to interacting with this God while, for example, of the six classes that have them, the Druid has two excessively stronger than those of the others: the Amber Weaver Klaxxi for 4 mana is a 4/5 which becomes 4/10 if C'thun it's already at least a 10/10, and Dark Arakkoa is a 5/7 for 6 mana with Taunt that gives C'thun +3+3 when it enters the battlefield.", "date": "2016-05-02", "grade": "8.0"}