{"name": "No More Heroes 3", "ref": "https://multiplayer.it/recensioni/no-more-heroes-3-recensione-playstation-xbox-pc.html", "text": "With limp hair, an unkempt beard, a neck support and two showy bandages on the thigh and leg, Travis Touchdown appears in the opening sequences of No More Heroes 3 as a normal person, indeed as a man plagued by years of superhuman efforts . Despite this, the right reason is enough for him (in this case an unexpected alien invasion) to transform himself once again into the infallible killer we all know, putting aside his ailments and ignoring the inexorable advancing age. Well, one could trace a parallel between the last chapter of the Suda51 signed series and its charismatic protagonist who yes, must once again turn on the Beam Katana, pull up his hair and don his iconic sunglasses to take on the role of the invincible warrior and face anyone threaten humanity, even if they were deadly extraterrestrials with superpowers. Behind his certainty, however, there is a project carried out almost exclusively with the strength of determination, and which in fact presents itself as a sort of incomplete prototype, closed as best as possible in the absence of further resources. A condition that was evident on Nintendo Switch and which appears even more evident on the new generation platforms, which on the one hand remedy the performance uncertainties during the motorcycle phases (and we would like to see well!), on the other underline the absolute mediocrity of scenarios that are used by the game as empty containers of missions, a simple expedient to switch from one fight to another, from one cutscene to another. But what fights and what interlude sequences! In short, as you may have understood, Travis's latest adventure Touchdown is confirmed as a controversial experience. Until what point? We reveal it to you in the review of No More Heroes for PC, PlayStation and Xbox. Story: E.T., home disintegrates No More Heroes 3, the evil Jess Baptiste VI Overloaded with references to Ultraman, Tekkaman, Rocky and retrogaming, No More Heroes 3 tells a story that basically stands as an ~evil~ reinterpretation of E.T. The extra-terrestrial. There is a little boy who befriends a little fluffy alien and helps him return to his planet: the problem is that several years later, when he returns to Earth, the little creature has become a warrior as powerful as it is cruel, ready to devastate the our planet. Jess Baptiste VI, for friends FU, brought with him nine generals who are considered the strongest fighters in the universe and took possession of the multinational that his human friend, Damon Riccitiello, built from scratch, using the mental abilities given to him from the little alien who was once so good and cute. Naturally Travis cannot allow the extraterrestrials to destroy the world: the first of the warriors who came from space falls without too much effort, but the tide of the battle changes dramatically when FU openly challenges the killer with the Beam Katana, defeating him and massacring his closest friends. Becoming strong enough to beat the powerful alien will take about twelve hours, which is the duration of the No More Heroes 3 campaign where you proceed relatively quickly. In terms of storytelling, the game leaves no stone unturned and indeed immediately reveals itself as a concentration bizarre ideas, the outlet of an undoubtedly brilliant author, who had set aside notes and concepts in view of this third chapter of the series. In its disarming simplicity, the plot of Travis's latest adventure Touchdown is an exciting patchwork of quotes with the hobby of breaking the fourth wall, and if you like Suda's style you will love it. Structure: the city is all mine, a desert that I know No More Heroes 3, an exploratory phase on a motorcycle There are three elements that make up the structure of No More Heroes 3: the spectacular interlude sequences, the hilarious fights and the horrible exploration phases. As mentioned, we will have ten main opponents to beat (nine, since we will take him out in practice during the tutorial) and as many sums to raise in order to access the boss fights, sums that we will only be able to collect by completing the missions scattered throughout 'within five different scenarios, plus the final stage. Going around aboard the Demzamtiger, Travis's very fast motorcycle, we will therefore have to reach these settings and go in search of points of interest that guarantee access to the so-called ~designated clashes~, that is, fights with more basic opponents (the bestiary from this point of view is quite varied, in truth) that we will have the task of completing to earn the related rewards and grow our bank accountto. No More Heroes 3 and the plunger minigame A sushi kiosk, an essential presence in a Suda51 title, will allow us to buy food to take with us to restore health or energy, or to obtain momentary boosts in times of greatest need. However, between one assignment and another, nothing will prevent us from returning to the base and using the points earned to enhance the characteristics of our character, as well as unlock chips capable of giving Travis specific advantages. There are some side activities (see the toilet bowls to unclog, garbage to collect, grass to cut...), but in general the scenarios are terribly old-gen on a conceptual level, desolate and lacking in interactions, probably innocent children of a distribution of resources that during development it left the ~world~ element uncovered, disappointing not only those who expected to be faced with an open world, but also those who simply imagined being able to explore pleasant settings. Gameplay: here we are No More Heroes 3, a fighting sequence Fortunately, the gameplay of No More Heroes 3 buffers for a large part the displeasure linked to the exploratory phases of the game: getting off the motorbike and entering the portals that lead to the various fights, Travis regains confidence with his lightsaber and begins to slash which is a beauty between fast and slow shots, spectacular combos, rechargeable special moves and even a Henshin mode in which the character is covered in high-tech armor that allows him to fly and fire missiles at enemies. In this situation everything works great : the rendering of the impacts which keeps the involvement high in the clashes, the perfect dodges with relative bullet time in which to inflict as much damage as possible on the opponent on duty, the wrestling moves (also inevitable), the Beam Katana which must be recharged by ~beating it ~ for a few moments and then of course the boss fights: all different, all interesting and with a non-trivial degree of challenge, which sometimes requires several attempts... also thanks to a slow and cumbersome access to consumables, it must be said. Technical Achievement: Problems Solved, Problems Created No More Heroes 3, one of the first bosses While maintaining the constant 60 fps in the action phases, the Nintendo Switch version of No More Heroes 3 suffered from very evident drops in frame rate and monstrous pop-up phenomena during exploration, which clearly on PlayStation 5, the tested version, did not happens: the Sony console manages the graphics of the title directed by Goichi Suda with great ease, which however was conceived for a much less powerful machine. This original sin, if we want to define it that way, inevitably ends up influencing the success of the conversion which, while moving very well, it offers a visual impact well below the standards for the new platforms, being two if not three generations old. You hardly notice it while fighting, thanks to the quality of the design, but when you travel aboard the Demzamtiger a tear almost falls. No More Heroes 3, Travis Touchdown prepares to draw the blade Suda puts his own into it and transforms many of the limitations of this production into merits, or at least into particular solutions, imbued with more or less explicit references and with such a marked, even insane, authorship that today it is not easy to find in a video game, but which often has to deal with a whole series of practical flaws and not always the check. Certainly the test of the audio sector is passed with flying colors: the soundtrack of No More Heroes 3 is fantastic, the chapters have even an opening and closing theme, and the interpretations of the voice actors (the voices are all in English, with Italian subtitles) lend themselves perfectly to the atmosphere of the game, adding value to the whole package.", "date": "2022-10-15", "grade": "7.0"}