{"name": "24: The Game", "ref": "https://multiplayer.it/recensioni/24-the-game-3.html", "text": "Real time~ The peculiar feature of the television series, i.e. the real-time narration of events, has been transferred in a somewhat unnatural way within 24: The Game. Obviously, since it was not possible to establish that each single play phase lasted an hour, Studio Cambridge solved the problem by making the clock appear superimposed in certain points of the stages, also to give the user an idea of his level of progression. It's not the height of realism, but it works. And to be honest, it wouldn't have been exactly a good thing if the game had an actual duration of 24 hours... So much to do, so little time Before starting to talk about the actual playful part, it must be said how 24: The Game does an excellent job of reproducing the feel of the television series in its entirety, starting with a storyline that closely resembles the brilliant scripts of the various seasons . The plot of the Sony product begins at six in the morning, with the granite Jack engaged in leading an assault by CTU agents on a ship in which a device containing toxic gas is hidden, ready to explode. Without obviously wanting to spoil the surprise for those concerned, let's just say that the narrative continues with the same syncopated and enthralling rhythm that made 24 a successful series, masterfully intertwining characters and events in a whirlwind of constant twists and turns: just to give a vague idea of what awaits Jack and his companions, in the storyline of 24: The Game there is room for an attack on a government official, a terrorist attack and even for the inevitable kidnapping of Bauer's daughter, Kim. Excellent is also the presentation of such a rich plot, which makes use of all the stylistic tricks typical of the series: picture in picture, ~nervous~ shots with frequent zooms and the ever-present clock that marks the passing of time accompany the cutscenes that make as a glue between one section of the game and another: all further enriched by appreciable cosmetics and by a dubbing that makes use of almost all the original voices of the protagonists of the show. In short, 24: The Game is a real jewel to watch, for fans and not of the exploits of Jack Bauer. It's a pity that the merits of the Studio Cambridge title are mercilessly limited to the scenographic plan alone, because once you take the pad in hand the situation degenerates in a truly vertiginous way... Lethal mix 24: The Game offers an impeccable outline, but a gameplay made up of varied game phases and - unfortunately - all made with considerable inexperience. In command of a series of characters (Jack, Tony, Michelle, Kim, Chase the main ones) in fact, the user finds himself facing third-person shooter or stealth sections, interspersed with puzzles and mini-games of various kinds and even guide. Starting from the former, the extreme linearity of the stages and the ease with which it is possible to complete them should be noted first of all: thanks also to a truly fallacious AI of the opponents, with enemies that never constitute a serious threat to safety of the current hero. All this despite the fact that the control system and camera do their ~best~ to prevent the achievement of their objectives: in the first case, making every single action that can be performed in the game uncomfortable and cumbersome, in the second, by opposing a normal, fluid and rapid vision of the environment surrounding. It is sad to note that, in the face of truly top-level cut-scenes and storylines, 24: The Game fails to offer sufficiently well-finished and complete gameplay Lethal mix One literally falls from the frying pan into the fire passing through the driving sections, already guilty of a crude cosmetics and victim of pop-ups and unhappy frame rates: the cars of 24 have the same mobility as a dumpster (and a speed of just superior) and at their commands you find yourself forced to face incredibly clumsy and unfunny escapes or chases. The mini-games close the roundup, in some cases constituting sections in their own right and even appreciable (this is the case of sniper sequences or interrogations), in others apparently used as mere filler-puzzles, considering their quality and very low commitment - which require to be overcome. Unfortunately, it is sad to note that, in the face of truly top-level cut-scenes and storylines, 24: The Game fails to offer sufficiently well-finished and complete gameplay, and a similar discourse must unfortunately also be extended to the in-game graphics of the Sony product . The settings are anything but astonishing from the point of view of polygonal complexity, and even the models of the characters make one's nose turn up a bit: notAlthough they bear a remarkable resemblance to their filmic counterparts, they are in fact rather ungainly, especially due to wooden and often unnatural animations. Thumbs down also for the quality of the light effects, while the annoying bugs found in the game should be dutifully reported, ranging from AI deficiencies to graphical problems such as interpenetrations and rather imaginative physical reactions. On the other hand, the sound is good, which beyond the already mentioned excellent dubbing, offers effects at the height and pressing music taken directly from the television series or inspired by it. Comment 24: The Game is an impeccable title in terms of presentation and storyline management, but which presents major gaps from a technical and playful point of view in the gameplay phase. The game suffers above all from obvious problems with the control, lock-on and virtual camera systems, real negative trademarks of the latest Studio Cambridge productions. If to this we then add bugs scattered here and there, an AI full of flaws and a decidedly subdued in-game graphic design, it is easy to understand how 24 is a title tolerable only by fans of the film eager to enjoy a new adventure of Jack Bauer and associates. Pros Excellent presentation Great sound Cons Varied but always unsatisfying gameplay Mediocre in-game graphics Unforgettable control system and camera Back from a resounding success in America, and to a lesser extent also here in Italy, the television series 24 now sees the release of a tie-in dedicated to it not far from the start of the fifth season in the country of origin. Nothing to be surprised about, on the contrary: the adrenaline-pumping adventures of CTU agent Jack Bauer appear so suitable for a videogame transposition that one could even have complained of a lack in this sense. Aware of this fact, and above all of the enormous resonance in the public of the 24 franchise, Sony has therefore well thought of buying the rights, but risking entrusting the development of the title to Studio Cambridge, already authors of the mediocre Primal and Ghosthunter. Will Jack Bauer approve of this choice?", "date": "2006-04-06", "grade": null}