{"name": "Il garage di Fox McCloud", "ref": "https://multiplayer.it/recensioni/166941-star-fox-zero-il-garage-di-fox-mccloud.html", "text": "Star Fox is notoriously one of the fetish series for historic Nintendo fans, although - a bit like with F-Zero - the brand has been very little exploited by the Kyoto house over the years. The progenitor, released in 1993 on Super Nintendo, represented a sort of Copernican revolution due to the fact that it was the first title with polygonal graphics developed by Nintendo, thanks to the support of the legendary Super FX chip mounted directly on the cartridge board. It seems like a century has passed, and to all intents and purposes in a rapidly evolving world like that of video games we are really talking about other times, a period of extraordinary ferment and bearer of emotions that only those who have had the good fortune to experience firsthand can understand . All this preamble just to make it clear how behind the name of Star Fox are condensed not only the values of a game, but of a precise and important turning point for the industry. The affection of many towards the series is therefore clear, although the joys with the very few subsequent titles have been truly rare: after the cancellation of Star Fox 2 and the recovery of many of his ideas in the excellent Star Fox 64, it was the turn from the modest spin-off Adventures developed by Rare and the even weaker Assault, up to the graceful Command released for the Nintendo DS, dated 2006. Except for the remake of the Nintendo 64 episode released on the Nintendo 3DS in 2011, they have therefore passed 10 years since the last chapter of the main series. Star Fox Zero is that compelling relaunch of the series fans have been waiting for so long Not only ArWing Star Fox Zero therefore represents a particularly awaited return, although the gestation was not the easiest, this despite the presence of Miyamoto in the role of producer: above all the presentation during E3 2015 left several perplexities in the insiders for the courageous choice made about the control system. Leaving the discussion of this component in the next few lines, it is worth emphasizing how Star Fox Zero in many respects is not a breakthrough or turning point at all, rather going to recover mechanics, situations, locations and characters from the past. Although Nintendo has refused to label it both as a remake and as a sequel and prequel (!?), it is clear that the points of contact - if not overlapping - are very many. The protagonist is once again Fox McCloud joined by his companions Falco, Peppy and Slippy, while the antagonists are again the members of the Star Wolf and the super villain Dr. Andross. The missions are once again set on planets arranged in a star map, some of which can only be reached on the basis of certain actions performed previously. And also a large part of the aforementioned planets are names known to fans, starting with that Corneria which is once again the starting point of the adventure. Anyone who has spent the years going through the Lylat system is therefore destined from the very first moments to feel a familiar sensation, full of dj vu, which however undergoes an abrupt interruption as soon as one finds himself having to learn almost from scratch how to play, or better how to govern the means available. Yes, because in Star Fox Zero, as many will already know, a courageous choice was made making the management of the shot independent of that of the vehicle used, all this through the use of the motion sensors integrated in the GamePad. In summary, the analog sticks allow you to move the ArWing or someone for it, perform barrel rolls, looping and the like, while the viewfinder and therefore the direction of the shots respond to the inclination of the controller which is detected via the gyroscope. To give a clearer representation of everything, the action is shown on the TV screen in a ~classic~ way in the third person, while on the GamePad display the perspective is through the eyes of the pilot from inside the cockpit (possibly you can reverse the situation using the ~-~ key. All this involves initial moments of authentic drama, during which we find ourselves completely lost in the face of the need to reprogram the brain, forgetting the way in which all shooters with spacecraft or similar have been played for years. The aforementioned drama actually continues well beyond the first few minutes, because everything can be said about the Star Fox Zero control system, except that it is immediate; in our case, the frustration only began to fade near the first conclusion of the story mode, which takes about three to four hours. Once this obstacle has been overcome, one begins to appreciate more and more the possibility of managing movement and shooting in a totally wayindependent, so perhaps as to move the vehicle to the right while firing in the opposite direction, enjoying a freedom of action completely unknown in the past. However, the best solution to deal with things is to almost always keep your gaze fixed on the TV, switching to the GamePad only when particular precision is needed to hit small targets. In short, the relationship between the player and the input method undoubtedly improves over time, and from the initial discomfort we slowly pass even to moments of enthusiasm. Let it be clear, however, some inaccuracies and technical limitations remain that in the end prevent the final result from being promoted unreservedly, but the sense of Nintendo's choice is ultimately fully understandable. For example, the loss of calibration of the gyroscope is quite frequent, and forces - especially on certain occasions - repeated centralization using the Y key. But more generally, it is the decision to introduce various usable vehicles, in addition to the ArWing, that leaves room to rather fluctuating results in practice. For example, the same ArWing can transform, by simply pressing the A key, into the Walker (legacy of the canceled Star Fox 2), or a bipedal ground vehicle that works quite well, except when asked to make ~tight~ direction changes ~ or even worse when in confined spaces. Then there is the Landmaster, the armored tank that already appeared in Star Fox 64, which can become a Gravmaster and therefore fly for short periods: the levels dedicated to this vehicle are actually among the most successful, precisely because its size naturally leads to slow movements that are supported well by the design of the related areas. But that's not all, because the other novelty is represented by the Gyrowing, a drone-like aircraft that can release a small terrestrial robot, called Direct-i (a tribute to the NES ROB) and capable of hacking special terminals. Gyrowing missions have a much slower pace, mostly having stealth and exploratory features: a solution that increases the variety of gameplay, but which ultimately distinguishes what are perhaps the most boring moments of Star Fox Zero. In reality there is still another vehicle, to be unlocked after finishing the game, of which however we prefer not to reveal anything to avoid spoilers. If on paper the presence of all these new means can be seen as a positive aspect, and to a large extent it is also in practice, in our opinion the final result leaves room for some shadows: this is due to the aforementioned multiplication of different control methods which makes an already dangerously daunting element even more complex, both for the fluctuating quality described above of the individual sections, with a certain fragmentation of the experience into many different solutions. And if you are among those who think that the best moments of the series are those spent on the ArWing in the forced scrolling levels, know that you will encounter very few of them in the ~normal~ development of the Story mode: indeed, very often in this case when you are on board the combat shuttle you end up playing sessions in full-field mode, that is, within areas with pre-established borders in which to move freely facing more or less demanding enemies. Slippy, shut up! However, to resolve the situation there are undoubtedly the numerous boss fights, usually of enormous dimensions, which give the right epic tone to the fights, exalting the player in case of success; the level of difficulty of these clashes, quite challenging without ever leading to excess, is undoubtedly a plus point. And then there are the many crossroads, which in most levels lead to different areas and bosses, and subsequently to portals through which to reach bonus stages in some truly remarkable cases. The research and the discovery of all these alternatives, in addition to the collection of the total 70 medals and the achievement of the best possible score, provide an enormous incentive to repeat the levels already completed, greatly extending an otherwise questionable overall longevity, and offering a value of the certainly greater challenge. Star Fox Zero, in some ways, therefore seems like a first generation product for Wii U. In a positive sense for the effort to fully exploit, integrate within the gameplay and therefore promote that much mistreated and, ultimately, little considered GamePad in many cases even in first party titles. Had it been released in 2013, we would have been here talking about Fox McCloud's adventure as an imperfect but intriguing andpromising showcase of the qualities of a console to be discovered. Today, however, Star Fox Zero looks more like a post-it stuck on the refrigerator, placed to remind us of the potential of a controller that has only rarely been attempted to exploit with courage. In a less happy sense however, what makes it look like a first-gen game is the graphic component, unfortunately rather modest. Except for a few pleasant glimpses or passages, Star Fox Zero is in fact a fairly meager product both in terms of polygonal construction and effects. The reproduction of water and explosions, for example, is antiquated to say the least, but also the entire lighting system appears simplistic and elementary, the latter factor rather strange given that the very management of the light sources and their behavior have constituted one of the flagships of Nintendo's first party titles on Wii U. The frame rate, while never arriving to suffer collapses such as to affect the gameplay, in the most complex situations often abandons the optimal 60 frames per second in a visible way. Without a doubt the reason why Nintendo had to make such compromises is linked to the need for the console to render two images at the same time, namely the one reproduced on the TV and the one on the GamePad. A final mention of the local multiplayer mode, which allows two players to share the tasks: the one with the paddone to control the shot while the other, with Wiimote or Pro Controller, to manage the movements of the vehicle.", "date": "2016-04-20", "grade": "8.5"}