{"name": "Il cuore  mobile", "ref": "https://multiplayer.it/recensioni/166508-kingdom-hearts-unchained-x-il-cuore-e-mobile.html", "text": "Disney and Square Enix crossover fans who will install Kingdom Hearts Unchained  - it reads ~who~! - in their tablet or smartphone to find out what connects it to the highly anticipated Kingdom Hearts III they will be quite disappointed: although it was the historical producer Tetsuya Nomura himself who mentioned the importance of this piece in the now gigantic and increasingly confused mosaic that is his series, Kingdom Hearts Unchained  is actually a title for beginners, a kind of introduction to the colorful universe revived in a mobile version after the moderate success of the almost homonymous browser game released in Japan a couple of years ago. That's why this adventure retraces the scenarios and situations that we now know practically by heart, between Alice who is lost in Wonderland and Aladdin who tries to escape the guards of Agrabah: set even before the Keyblade War, the story should clarify the reasons for the conflict and lay the foundations of the Kingdom Hearts universe, but it is dispersed in the short cutscenes scattered among the more than two hundred missions of the game, downplaying the importance of the key moments that could clarify the confusing narrative hodgepodge. Kingdom Hearts Unchained  doesn't reveal any shocking secrets, but it's done really well It is not a  Having left behind the role of Sora, Roxas and associates, this time we will step into those of a Keyblade bearer summoned to fight the notorious Heartless in one of the various factions that we will be able to choose after creating our character, deciding his features through a discreet variety of options. In reality it is possible to change faction even later, since the decision only marginally affects the asynchronous multiplayer experience, which allows you to create groups to chat only or face gigantic bosses in the company of friends and complete strangers. Kingdom Hearts Unchained  is in fact a ~gacha~ in which we will mainly have to defeat enemy after enemy in each stage, collecting the materials necessary to enhance the Keyblades at our disposal and the so-called medals. The latter depict the darlings of Square Enix and Disney that we have come to know and love over the years, but basically they express our special attacks during fights: if the appropriate indicator allows us, just simply drag the turn medal toward the center of the screen to perform a flamboyant special shot. Each of the more than two hundred medals can be upgraded, evolved, perfected and shared with other players: although it can be downloaded for free, the great advantage of Kingdom Hearts Unchained  is that it hardly pushes compulsive microtransactions at all. The game generously gives out the crystals and currencies necessary to purchase the new random medals and the various bonuses, as well as the action points that determine the duration of our games and which recharge in a short time. Considering that it is possible to obtain and upgrade each medal to the maximum without spending a cent, a minimum of planning is enough to enjoy each content in fairly intense game sessions. Kingdom Hearts Unchained  is in fact a well-crafted RPG, full of features and, above all, clear and intuitive menus, perhaps just a little slow due to the need to play connected to the Internet. In terms of gameplay, each stage is explored by tapping the screen to move your character, engaging visible enemies to trigger on-the-spot combat. The combat system is reminiscent of the ~card~ one of the good old Kingdom Hearts: Chain of Memories, in the sense that in each Keyblade it is possible to set a certain number of medals respecting precise limitations. On the battlefield, then, just repeatedly tap the target to ring a combination of shots, while the swipe allows you to launch an area attack that damages several enemies at the same time, inflicting some less damage. Each hit is associated with a medal in the clockwise direction according to which they are arranged in the equipped Keyblade, therefore a certain strategy is necessary in choosing the medals to use, taking into account the indicator they consume and the element associated with them, which respects a sort of elemental Chinese paper that allows you to inflict more or less damage to different enemies. Everything is represented in two dimensions through a delightful character design that recalls the colorful illustrations in fairy tale books of yesteryear: it is a choice that might leave purists accustomed to the classic style of the series dumbfounded, but which works perfectly in the context and it turned out to be light even on older systems, bypassing any difficulties of trremove the three-dimensional graphics of the latest episodes in the mobile version. Nothing to say about the soundtrack by Yoko Shimomura, the famous historical composer of the series who in this case did not have to work so much, given that the songs are mostly rearrangements of those already heard in the previous Kingdom Hearts.", "date": "2016-04-14", "grade": "8.0"}