{"name": "Drunk Souls", "ref": "https://multiplayer.it/recensioni/166414-good-knight-story-drunk-souls.html", "text": "Raising your elbow from time to time isn't a big deal, unless you completely lose consciousness of what you're up to. Well, that's exactly what happens to the protagonist of Good Knight Story, a knight without blemish who wakes up after a powerful hangover with no memory of the previous night. The clues, however, do not bode well: it seems that a mysterious guy in armor has kidnapped the princess, taking her to the lair of a huge dragon. A coincidence? The fact is that there is a damsel in distress and it is necessary to save her, so the brave warrior sets off to face the fire-breathing beast, fighting along the way with a large number of different monsters. The gameplay of the title developed by IRIX takes up the mechanics of the classic Puzzle Quest, however adopting a series of interesting strategic solutions. In the lower part of the screen we find the usual board with objects of four shades (green, purple, red and light blue), plus hearts and shields, which must be connected to each other and eliminated for the knight to behave accordingly. Making a combo of elements results in an attack that becomes stronger depending on the number of objects involved, but you have to respect the order indicated at the top left: ice beats fire, fire beats poison, poison beats rock and rock beats ice. This way an ice attack will deal extra damage to a fire monster, while conversely a rock-based attack will only tickle a poisonous creature. The combat system also has other facets: each opponent is characterized by a number of useful rounds in order to be hit, at the end of which you have to pair shields to raise your guard or resign yourself to suffering damage, which can then be restored by performing a combo of hearts . Good Knight Story offers an interesting and original approach to the strategy puzzle game genre A knight's feast The Good Knight Story campaign is made up of one hundred and twenty-five increasingly complex levels, in which we will be asked to defeat a certain number of monsters or, in the variants, to eliminate objects from the board to drop bonuses that the character will collect, all while a big invincible monster tries to take us out. The presence of bricks on the board gradually complicates things, but at the same time making large combos gives rise to special elements that destroy entire rows of boxes with a single blow, and that we can maybe keep aside for more complicated situations. Added to this is the RPG connotation of the equipment, with new weapons that are obtained for free or through the use of gold coins, and which can be upgraded exactly like the knight, every time he reaches a new level. experience, increasing the values of attack, defense and life energy. The system proves to be solid and convincing right from the start, and is supported by very well done graphics, which sees the protagonist slicing monsters and grappling with funny dialogues when he stops in a tavern along the way. At this juncture also occurs the funniest invitation to put a positive review on the App Store that we have ever seen, with the innkeeper trying to bribe us by passing us bags of coins. Humor permeates the whole experience, as was already clear from the incipit, and some errors in the Italian translation do not detract from the good work done in this sense by the developers, who have been able to insert many brilliant jokes, able to snatch more of a smile. The freemium implications of the product appear bland: there are no limits to the number of levels with which it is possible to try their hand nor evident paywalls, only a gradual increase in difficulty which at a certain point will undoubtedly lead to having to do some grinding in order to continue the adventure.", "date": "2016-04-09", "grade": "8.0"}