{"name": "Asterigos: Curse of the Stars", "ref": "https://multiplayer.it/recensioni/asterigos-curse-of-the-stars-recensione.html", "text": "A curse, an ancient city, a young and willing heroine who finds herself entangled in a story clearly bigger than her: these are the basic elements of Asterigos Curse of the Stars, the action RPG from Acme Gamestudio , Chinese team at its first development experience. However, the premise of Asterigos was known since last week, we offered you our tried and true. On that occasion, with only a small demo available, we hadn't been able to delve into much of what the game had to offer, but we finally completed our adventure in the city of Aphes. The final version allowed us to understand how much good and how much less refined this game has to offer that we remember is available for PC (via Steam), Xbox Series X|S, PlayStation 5, Xbox One and PlayStation 4 from October 11th 2022. For all the details, you just have to continue with our review of Asterigos Curse of the Stars. One thousand years Hilda, the protagonist of Asterigos Curse of the Stars The story of Hilda, our protagonist, begins when she is sent by the leader of the Legion of the North Wind, of which she is a part, in search of a squad that has been missing for months. The final destination is Aphes, a city corrupted by a curse that has also affected the King of the Anbari kingdom, of which the Legion is the elite guard. The story of Aphes, however, begins 1,000 years earlier, because the curse has blocked the humans of the city in time. Aphes is inspired by the city-states of ancient Greece, not only on a stylistic level, with its temples and buildings, but also on a social level, with a clear division between free men and slaves. Hilda looks at scrolls in Asterigos Curse of the Stars It is not just a detail inserted to make the game world more credible, but one of the central themes of the adventure. The Asterigos, in the game, is the curse around which the adventure revolves and which the characters want to break, but the central figures of the adventure will be able to speak not only of the freedom lost due to this condition of non-mortality, but also of the social freedom that Aphes does not grant to most of its inhabitants. Between talks of magic, rites that transform people into monsters and mythological figures inspired by ancient Greece, the characters will talk about redemption and independence. Among other things, it will not be only our allies who will do so, but also the antagonists, which made it difficult for us to understand whether they were actually on the right side throughout the adventure. Hilda with an ally in Asterigos Curse of the Stars On average, the quality of the writing isn't always very high, to be honest, and certain characters are a little too simple even though they play an important role within the adventure, but the two or three key figures for the story have received sufficient care to ensure that the plot remains interesting until the end. The game world is also extremely refined and is full of narrative collectibles that tell sub-plots and reveal the backstory of Aphes. Accessing such content takes some dedication, as there is a lot to read (more than we expected) but it can be worth it. We fight Hilda with her daggers in Asterigos Curse of the Stars However, you don't spend your time just talking and reading, don't worry. Asterigos Curse of the Stars is an action RPG and first of all you fight. As we told you in our test, Hilda immediately has all the weapons (six, in all) that are present in the game. He will only be able to obtain accessories that improve defense statistics and, due to the need for the plot, talismans that apply an element to our attacks. Weapons and elements can be upgraded using materials, which are also useful for creating the aforementioned accessories. Still speaking of upgrades, Hilda has three stats (attack, life, power of special moves) and has a series of skill trees related to the various weapons she uses: the latter is the most important part for the evolution of the character . The skills are divided into passive (which improve the capabilities of the weapons, sometimes also changing the attacks available) and active. Hilda uses the staff against a boss in Asterigos Curse of the Stars Hilda can use all the skills she unlocks even if she doesn't have the attached weapon equipped. Are you using daggers, but want to attack with a hammer skill? No problem. This expands the strategic possibilities and allows us to fight with the weapons we like best and any skill. In reality, however, it is difficult to complete more than two skill trees in the adventure, so you will tend to prioritize those of the chosen weapons withso as to obtain related passive bonuses. Only by investing more time in leveling up and, above all, by launching into New Game + will it be possible to expand one's skills and have a more eclectic character. In any case, skills are powerful moves, capable of doing great damage and creating variety in the combat system. There are pure attack moves, but also skills that create temporary defenses, areas of influence that empower us, moves to stun enemies or perhaps create gravitational forces that attract them. Various moves work well in combination. Hilda faces a powerful enemy in Asterigos Curse of the Stars The variety also comes from the base weapons. Each weapon has its own moveset and perks, including a unique special move. Sword and shield allow you to parry damage, the magic staff becomes a loaded sniper rifle, bracelets allow you to place mines and so on. The combat system rises above all with these secondary abilities, given that pure and simple melee is quite classic (not to say derivative). You attack, do evasive rolls and circle enemies to gain positional advantage, without too many surprises. Taking advantage of skills is therefore important not only to win more easily, but also to have more fun. Common enemies are unfortunately a bit simple in their attack routines and tend to react a little too slowly at the start of combat, making themselves easy prey for our magic staff (our weapon of choice). On the contrary, the bosses are very interesting, since they all have unique and fun mechanics to exploit to get the better of them. Another positive note is the design of the areas, all large and full of secondary sections and shortcuts to unlock: there isn't that ~interconnected world~ depth of the best souls-likes, but on average the areas are well done and often have some unique gameplay. One of the bosses in Asterigos Curse of the Stars The combat system of Asterigos is not revolutionary, it is simply well done and works. The game, while taking limited inspiration from the souls-like world, also allows you to choose the level of difficulty: in our opinion, the normal level is perfectly balanced for such a demanding challenge, which forces us not to attack head-on, but at the same time itself never punitive. At this difficulty and with very few deaths, it took us 20 hours and a little more to finish the plot, completing just a few side missions. The latter are perhaps the weakest element of the package, as they mostly ask us to go back and forth to deliver items to secondary characters. We will get rewards and we will be able to find out more about the game world, but they are playfully quite tedious. Finally, to lengthen longevity there are a whole series of end-game bosses that are unlocked when you arrive in front of the final battle. We will be able to return to the game world to find and defeat them all. Considering then that there are good reasons for a second game, the longevity of Asterigos is more than excellent even considering the budget price. Hilda attacks with the spear in Asterigos Curse of the Stars As already anticipated in the test, which we can confirm was representative of the final game on a technical level, Asterigos offers a simple cartoon graphic style. The environments are varied, not always very detailed but still pleasant. There are some caps on load points between maps, with heavy frame-rate drops, but it's only an instant in non-combat moments, so you can get past them. The English dubbing of the characters has not always convinced us, however, while the soundtrack can be listened to without remaining impressed. The game has all texts in Italian.", "date": "2022-10-13", "grade": "7.9"}