{"name": "We Are Football: la recensione del nuovo manageriale calcistico", "ref": "https://multiplayer.it/recensioni/we-are-football-recensione.html", "text": "Can you really compete with Football Manager? The question must also have been asked by the members of Winning Streak Games before embarking on the creation of We Are Football, a football manager destined to arrive in these days in a market dominated by the milestone by Sports Interactive. Even if the name of the development team tells you little, know that behind Winning Streak Games there are actually some veterans of the sector, intent, as we are about to see, to support their proposal with that of Football Manager, rather than making a real competition to the old colossus. Before moving on to the review of We Are Football, we recall that the name of Gerald Khler, creator of the old On The Ball series and key figure in the creation of the first FIFA Managers, is at the helm of the project. Having buried the franchise created by Electronic Arts for several years now, the time has come for Khler to return to work in the niche of managerial football dedicated to football. Modes and teams Once you have completed the short tutorial intended to show the basics of We Are Football, the time comes to choose how to live your managerial adventure. The options that are made available concern the possibility of playing alone or together with another person in hotseat mode, after everyone has chosen their own team. From this point of view We Are Football decides to immediately embrace the philosophy already adopted for some years by EA Sports with FIFA, proposing women's championships as well as men's championships. The difference in game dynamics, as far as we have been able to see, is minimal, but the fact remains that We Are Football is the first manager to propose such an alternative. Whether you choose men's or women's teams, what is totally missing they are the licenses of real clubs, leagues and players, in the absence of which the members of Winning Streak Games have had to invent fictitious names with which to fill the game. The teams are easily recognizable thanks to their colors and some cute puns that recall the real counterpart, such as Sirtaki Verona instead of Hellas Verona or Giovin Torino for Juventus. Unfortunately, the same cannot be said of the players present. The composition of the roses is in fact completely random and therefore does not allow the stars of the real world scene to be recognized in any way. By selecting Napoli, for example, we found ourselves a squad made up mostly of only Italian players, accompanied by two Argentines. Over time, we also end up becoming attached to the players we find in We Are Football, but it is clear that a starting situation in which we are unable to recognize the Koulibaly or Mertens of the moment in any way can inevitably end up taking away interest in this title. The editor inside the package tries to remedy these shortcomings, thanks to which players can modify and create the game elements to their liking. The hope is of course that a We Are Football community will form and take charge of this work as happens in other similar cases, even if such a thing is not at all obvious. Gameplay The idea behind the gameplay of We Are Football can be summed up in the saying ~easy to learn, hard to master~. For what is the system set up by Winning Streak Games, the most suitable competitor is perhaps Football Manager Touch, or the simplified version of FM that Sports Interactive has been putting into circulation for some years. The game is played through shifts that go from week to week, allowing the player to plan the activities that will be carried out by the staff over the next seven days. For example, we can set up a meeting with a sponsor or with another team to buy a player, so that the negotiation is then carried out when the passing of days arrives at the appointment. In general, the negotiation phases are limited to a few elements such as the duration of the contract, the basic amount and any bonuses. We have to say that, once you understand how the CPU thinks, the more shrewd player will have no difficulty in being able to bring the figures towards more convenient conditions for his club. Among the various activities to plan, there are also training sessions. Just like all aspects of We Are Football, we can accept the suggestions of the technical staff, which we can then modify at will. The activities available are actually different, so you must always be careful not to overdo the workloads between one game and another, going instead to deprivelect athletic training in the initial phase of the season. The growth of the players takes place through a series of levels, highlighted on the screen with a representation of stars. In addition to the generic activity, we can choose any focus to which to devote the members of our team, possibly spending our action points to give a small bonus to a particularly promising young player or a key element of the squad. The action points are obtained as our coach grows and improves and are obviously limited: for this reason they must be spent reflecting properly on your choices. The match The pre-match phase is similar to what Football Manager fans are already familiar with. Before entering the field, you can in fact choose to give an incitement speech to your players, intended for example to make sure that they adhere more scrupulously to the tactics or to raise their morale. Similarly, at half-time we can tell them what we think of the first forty-five minutes played, with a group speech or by taking one of the starting eleven players individually to praise or scold him. slow down the stopwatch when a dangerous action occurs. In this phase, the representation activates a series of 2D animations, in which the trajectory of the ball and the action performed by the player who controls it are constantly shown, up to the conclusion on goal or another type of epilogue of the action. Overall, the experience proves to be rather immediate in this case too, while still leaving the player with the possibility of setting tactical elements such as attitude on the pitch, the propensity for fouls and the frequency of pressing. As it is set up, the gameplay of We Are Football allows you to perform the duties of a coach quite quickly, offering, as we have seen, ready-made solutions to which we can still choose to make changes by going into more detail. Potentially, therefore, it is possible to play entire seasons even in the space of a few hours of play. One last note regarding the texts, they are entirely translated into Italian.", "date": "2021-06-09", "grade": "6.0"}