{"name": "L'avidit regna", "ref": "https://multiplayer.it/recensioni/166263-gremlins-inc-lavidita-regna.html", "text": "Gremlins, Inc. is a complex virtual board game, made by Alexey Bokulev, the same one we owe Eador: Genesis, in which the goal is to accumulate more points than your opponents by playing cards. Put like this it doesn't seem that difficult, but the complications are different and, all together, they form an amalgam that is as interesting as it is not suitable for everyone (Bokulev has never made a secret of not loving simplifications in strategic titles). Each card can only be played when it reaches a square with the same suit, and doing so costs a certain amount of monetary resources. If all the requirements are not met, it is impossible to play a card. To accumulate money there are two methods: pass on an income square, or play a card that gives money. At the beginning of each game, six cards are drawn which determine the first moves, both in terms of movement (each card has a certain value of movement points) and in terms of actions (each card produces a certain effect). The cards, a total of one hundred and sixty-four, are of various types. There are the normal ones which, paid the amount due, give the indicated resources; there are permanent cards, linked to the character and whose effects remain active for the entire game (they can still be taken by other players); there are secret and criminal cards, which are used to play dirty with your opponents and so on. The cards in the players' hands are all drawn from the same pile (when they are finished, the discarded cards are drawn again). It is practically impossible to start describing the effects of each card in this context, also because it would be of little use (only by playing do you realize when it is more or less useful to play a certain card). However, to let us know them, Gremlins, Inc. provides a handy internal encyclopedia, called the Gremlinopedia, which contains all the information you want. There are actually still Chaos cards to talk about, which we cover separately because they're optional. These are six special cards that are given along with the six normal cards at the start of the game. By activating them, one of the goals for victory becomes to play them all. Why not make them mandatory? Because they basically slow down the game enormously, since they only produce their effects under certain conditions. We have reviewed Gremlins, Inc., a virtual board game where deception is the law Complexity At the beginning of each round, a card must be selected for movement (moving over it with the cursor highlights the boxes on which we can move). Alternatively, you can hover the cursor over a square to highlight the cards you can play to get there (obviously if you choose a square too far away, no cards will be highlighted). Once we reach our destination, we can play an action card depending on the box we are on, which immediately produces its effects. Cards used for movement are immediately discarded and cannot be used as action cards (and vice versa). Doom events, or Doom Telegrams, will occur from time to time, which will give players malus. If desired, they can be activated by passing over the Misfortune boxes, but this should only be done in certain situations (for example, to create a bit of chaos). Even the boxes have specific functions: for example, the casino allows you to gamble to make money, while the factory allows you to work. Add all these elements together and you will have the complex gameplay we were talking about at the beginning of the article, in which the individual mechanics are decidedly clear, but their intertwining is less so, which requires a deep knowledge of the mechanics to play at high levels. The tutorial itself, accessible at any time, explains a lot, but not everything. In short, as with any good board game, even Gremlins, Inc. requires a lot of practice after the explanations. Better in company As we said in the previous paragraph, Gremlins, Inc. is a good board game. As such it has a big limitation: the single player. Put bluntly, if you don't have friends to play it or you don't like online very much, forget it. The mode for solitary players is fine for a few test matches, that is, to practice the various systems, but in the long run the artificial intelligence tactics become predictable and all the stimuli disappear. By playing online (or on the same computer with some friends) you will instead enter the true spirit of the game, made up of betrayals, tricks, tactics, convenient alliances and everything that makes a Gremlins worthy of being called one. What wouldn't you do for money? From a technical point of view, Alexey Bokulev's title does its duty, without excelling. There are several places that doas a background to the game board; the cards are well designed (without exaggerating) and there are also small animations here and there to season everything. Nothing transcendental, but basically we are talking about a board game and readability is more important than technical prowess. We can do the same for the soundtrack: the music is good, but its function is purely decorative. Indeed, to be honest in the most heated online games, the music can even become annoying and it can be turned down without problems to encourage reflection.", "date": "2016-04-06", "grade": "7.8"}