{"name": "Non ce n' per nessuno", "ref": "https://multiplayer.it/recensioni/166152-killer-instinct-season-3-non-ce-ne-per-nessuno.html", "text": "If many have bought the latest Microsoft flagship to enjoy flagship series such as Halo, Forza Motorsport and Gears of War, there is also a slice of enthusiasts who on November 22, 2013 placed the Xbox One under the TV for a 'another exclusive, certainly with less commercial appeal than the others, but absolutely essential for those who, like us, hung out in arcades and bars in the 90s to play what is now considered one of the most spectacular coin-ops in videogame history, it is no coincidence that it is kept as a real ~sacred relic~ in the offices of many software houses. Enthusiastically announced at the controversial Xbox Reveal of May 20, 2013, the Killer Instinct reboot was however lukewarmly received by critics due to a certain confusion in the distribution model and above all due to the small amount of content, which at launch included only six of the eight wrestlers planned for the first season. Since its debut, however, the title has been the protagonist of a constant process of maturation; has changed hands from Double Helix Games to Iron Galaxy Studios, has been enriched with a second season full of novelties and has drawn new lifeblood with the announcement of the third season and its arrival on PC, as an exclusive Windows 10, thanks to the cross -play and cross-buy with the Xbox One version. After a long wait we have finally been able to get our hands on the work of the Chicago team, and we can guarantee you that it was really worth it. With the third season Killer Instinct arrives on PC and wins the title of best fighting game Price question Before going into the analysis of the title and listing the specific characteristics of the PC iteration, it is necessary to spend a few words on the distribution model and clarify the aspects related to the so-called cross-buy. As was the case with the console version, Killer Instinct landed on the Windows 10 store as a sort of Free to play, which allows you to play for free with a single character in rotation. If you want a specific one from the roster, now made up of over twenty wrestlers, you can buy it individually, or you can rely on one of the different bundles available. Season 1 and Season 2 Double Combo contains all the characters of the first two seasons for about 30 Euros; Season 3 Anticombo offers for 20 Euros the eight characters of the new season, four of which are already available; the Season 3 Ultra Combo for 40 Euros includes all the new characters, costumes, VIP XP, accessories, colors and 18,000 KI Gold, while the Supreme Edition offers all the contents of the three seasons and is sold for 50 Euros on PC and 60 on Xbox One. The price difference is linked to the fact that the two original chapters of Killer Instinct are also included on Xbox One, which for (alleged) licensing issues will not be able to land on PC. To these figures must also be added the 10 Euros needed for Shadow Jago, a special character released as a Jago skin and included in a rare retail version (combined with an annual subscription for Xbox Live), which later became a real exclusive fighter with set of dedicated moves. In the light of these offers, it seems clear that new players have much more advantageous purchasing options than those who, to get the various Ultra Combos at launch, found themselves spending as much as 120 Euros. As for the PC version, as specified, the game was released exclusively on the Windows Store, and although we have not encountered any problems, in pulling down the 21 GB of the package some players have experienced a couple of error codes, with the download stuck suddenly and with no possibility to activate the resume. Microsoft is aware of the issue and working to fix it. If you had the game on Xbox One, in addition to all the purchased contents you can also share the save file with the PC, but it is necessary to proceed with the update first on the console (another 21 GB to download), access with the personal profile and finally align the two versions going back to Windows 10. We had some headaches in recognizing our save, but fortunately after a few attempts the synchronization was successful and we found even the customized options set on the console on our system, including the configuration of the keys and audio volumes. All new As specified, Killer Instinct has been a project in constant growth since 2013, and all the innovations introduced in this third season (also in terms of fixes and balances) are practically impossible to report in a single article; but let's proceed in order and focus first on the contents, advising you to go and read the original review to learn more about the dynamicsgameplay, linked to spectacular chained combos based on Opener, Linker and Ender. The four new wrestlers available since launch are Tusk, Kim Wu, Arbiter and Rash: the first two are old acquaintances of Killer Instinct 2 and therefore highly anticipated by fans; the Arbiter is the charismatic character taken from the Halo series, while Rash is a sort of ~guest star~ translated from the Battletoads license, a new entry that we had already been able to appreciate in test during Season 2. Without going too far into the technical analysis of the individual characters, we can say that Iron Galaxy Studios has done a truly excellent job in terms of characterization. Although he has a somewhat anonymous ~Viking~ look, at least with the first color / costume, Tusk is a flexible warrior who makes power his main weapon, supported by the iconic two-handed greatsword. The special moves are not unlike those of the old character; among them stand out the classic ~dragon slayer~, the uppercut with sword rotation and devastating charges. His peculiar skills are the so-called ~Ender with staggering~ and the ability to generate an explosion by sticking the sword into the ground (Backbreaker), an unstoppable move if fully loaded. Overall it is a slow but very effective fighter. Unlike Tusk, the petite Kim Wu makes agility and elegance in attacks - with nunchucks - her best qualities. In addition to being able to perform repeated combos through the pressure of the medium punch and strong punch, Kim Wu can land Linker throws (Dragon's Grip) and absorb ~Dragon Spirits~ which allow her to expand the range of moves in dowry. Simultaneously pressing all three punches or three kicks can block enemy strikes and perform a fast-advancing null, a move that can create some headaches if you're not careful with the timing. In addition to being graceful and lethal, Kim Wu is one of the characters who gained the most charisma with the transition to the new Killer Instinct, given that in the second chapter she looked a bit awkward, and her ~retro~ costume is probably the best of the entire roster for fidelity to the original. The mighty Arbiter is a slow character, but he balances this limit with some moves and abilities translated from the series signed by Bungie and 343 Industries: in fact, he can shoot with the Type-51 carbine, throw a plasma grenade by varying its range, take advantage of the concealment of the Elite armor and strike with the energy blade. By activating the instinct bar, the Arbiter activates the energy shield and can parry attacks with techniques from the Covenant shock troopers. Overall it is a fearsome fighter who does full justice to the hero of the saga of origin, where the fanservice is perfectly integrated into the dynamics of the gameplay of Killer Instinct. The fourth character of the package, Rash, from an exquisitely artistic point of view is certainly the least ~integrated~ of the roster, however he performs his role as a fighter very well. The wiry amphibious is distinguished above all by the ~Battlemaniac~ combos, which allow him to land hits in sequence with the simple pressure of the punch and light kick. Among his peculiar moves there are a kick with the spiked boot (Big Bad Boot), the wrecking ball and the ram's horn, all well integrated into the flow of the combos, moreover with the active instinct he can summon the iconic speed bike rideable. Unlike the other three characters, Rash unfortunately does not have his own arena and fights in Kan-Ra's. The roster of the third season in the coming months will be enriched with the vampire Myra - sister of Maya - and with Gargos, the boss of Killer Instinct 2, and will continue with the release of General RAAM of Gears of War, a character confirmed by stolen material. The fourth and last wrestler of the third season could be Eyedol, the hostile two-headed minotaur boss of the first Killer Instinct and highly anticipated by fans. As previously specified, the novelties introduced in the gameplay are many and are also accompanied by a renewed graphical interface, even more elegant and usable, especially in the selection of characters. The whole roster has been enriched with a new skill; Sabrewulf, for example, can now perform an airborne attack called ~Dive Slash~, while Sadira has a new Ender and a move called ~Salticidae~, which allows her to bounce on the opponent's head. Among other things, the values of the damage inflicted have been balanced, the frames of the moves have been adjusted, new reactions to hits have been added, some characteristics of the Combo Breakers have been modified and much more. Only with time and thorough testingFrom now on it will be possible to verify the effectiveness of all these interventions, but we can confirm that our experience in battle has been even more solid, rich and gratifying. Finally, we remind you that the third season will be enriched in the future with new modes, such as the Shadow Lords, which in addition to presenting roguelike elements will see Gargos as the final boss and will allow you to create teams of fighters. Even more beautiful The landing of Killer Instinct on Windows 10 coincides with a further finishing work carried out on the technical sector, already adequate in the past on Xbox One with the transition from the (criticized) 700p resolution of the debut to the more recent 900p. On PC, with an adequate system, it is possible to abundantly surpass even Full HD (1080p) and reach the magnificence of 4K, which flexes its muscles also thanks to the renewed lighting system, capable of enhancing both the levels and the beautiful character models . In this regard, the rendering of some small details makes you turn up a little, such as Sabrewulf's hair and the hair that remained anchored to the stylistic features of the debut, however the overall result achieved makes Killer Instinct the most spectacular fighting game around, where they are especially the particle and volumetric effects to enchant the eye. Glacius' ice, Jago's Endokuken and Tusk's flaming blade, just to name a few, produce sparks, explosions and luminous effects that revisit to the nth degree all those effects that made millions of players fall in love with them in 1994. And the sound is absolutely no less, thanks to incisive sampling and a very inspired soundtrack. The new levels are beautifully crafted and brimming with life; in Tusk's arena, a pack of narwhals, polar bears and burning drakkars can be observed, while Kim Wu's one features extremely realistic lighting, a tasty quote and is used in the game's benchmark. The level dedicated to the Arbiter set in Sanghelios is also beautiful, where a battle rages and you are accompanied by the unforgettable soundtrack of Halo. To participate in online ranked matches, Killer Instinct requires passing a system performance analysis, which must ensure solid fluency . With our test configuration, visible in the box below, we obtained a score of about 1600 points out of 1000 with all the details at maximum, moreover the game is perfectly scalable thanks to the good number of advanced graphics options. The netcode, linked to cross-play, was solid and effective during our tests, however some players have complained of problems that are under consideration by Microsoft.", "date": "2016-04-05", "grade": "9.0"}