{"name": "Calcino d'altri tempi", "ref": "https://multiplayer.it/recensioni/166197-active-soccer-2-dx-calcino-daltri-tempi.html", "text": "What happened to the calcium? Let's not talk about the soccer simulation, that obviously is now well covered every year by the two giants who compete for the market with the regular releases of FIFA and Pro Evolution Soccer (one more giant than the other to be honest, at least as regards the copies placed), but of the good old ~kick~, with its fast and purely arcade approach, its almost amateurish production compared to the maxi-collections of modern millionaire licenses. And above all, is there still room for football games made that way? Does an interpretation of football so different from reality and based entirely on immediate playability in the modern market still make sense, beyond the simple nostalgic recollection? These are the thoughts that emerge when playing Active Soccer 2 DX, or rather between one game and another, given that in the short minutes they spend on the pitch there isn't actually much time to think, given the speed of the action. Once upon a time many software houses, mainly European and Japanese, tried to have their say on the subject by bringing out their inevitable Soccer and interesting experiments came out, sometimes even titles capable of starting cult series, all invariably fallen into oblivion over the years. In a panorama dominated by a single vision of this sport (albeit in two different stylistic variants) a game like this by the Italian team The Fox Software is to be welcomed with joy, if only for the breath of fresh air it seems to bring, but the doubt on the actual value of such an operation is legitimate, apart from some objective defects of the game. The idea is therefore that Active Soccer 2 DX can be a game appreciable by everyone above all for its ability to break the mould, and by the more expert and elderly players in particular for its evident desire to pay homage to the masterpieces of the past, in particular Sensible Soccer and Kick Off. Active Soccer 2 DX attempts to revive the glory of arcade soccer on modern consoles Sensitive football The reference to Sensibile Soccer in particular is clear, starting from the introductory music sung in the style of the historical one of SWOS and moreover heralding an incredible surprise: according to the credits, the author of the song would be none other than the legendary Chris Huelsbeck himself , just to remain in the field of re-enactment of the Amiga era. The feeling is then strengthened to see the menus, which seem to be extrapolated directly from the historic Sensible title, complete with names suitably modified to remember the real ones but changing the vowels so as not to run into licensing problems. Finally, the game is clearly derived from the setting of the time, with the field viewed from above, the players small on the screen and an extreme speed and simplicity of the action. Forget tactics and articulated key combinations: in Active Soccer 2 DX what matters is speed and one key for the short pass, one for the long pass (or cross), one for the shot and one for the sprint. In the standard settings, there is not even the pressing of a button for pressing (however modifiable in the options), given that the ball is stolen simply by meeting and contrasting the opposing player, or with the classic slide, but it takes very little to enter the mechanism and appreciate the immediate gameplay offered by the game. Unlike Sensibile Soccer, here the ball remains attached to the players' feet, which further simplifies the action but still forces you to play with continuous passes and few touches due to the simplicity with which the opponents can steal the ball by intercepting or tackling. The pass is semi-automatic based on the direction given and the shot has the trajectory control system also derived from the old classics, although it seems to have a greater randomness given the strange results that can emerge after kicking towards goal . The game options allow you to play a single game or take part in tournaments and leagues, which can be created and customized as desired by the player. The multiplayer is provided only in offline form on the same console, therefore any type of online is excluded, effectively crippling the potential of the game in a significant way. Also present is the Career mode which allows you both to play matches and to manage the various aspects of your team, from the transfer market to subsequent acquisitions, sales, transfers and budget management, thus merging arcade action with managerial depth as in the classic Sensitive World of Soccer . Xbox One goals Active Soccer 2 DX contains only 10 unlockable achievements, as a resulteach of these brings with it a nice haul of 100 gamerscore points. Apart from those related to Career, which obviously require some time and application, the others are easily reachable after a few games. The Twelfth Man The major problems of Active Soccer 2 DX derive from the evident lack of tests that must have characterized its development, given the presence of various bugs and structural oversights ranging from the uncertainty of some responses to the controls to the mysterious interpretation of some basic rules of the football, such as offside or managing the ball from a corner kick, but also from a very spartan and disorganized interface. The latter may seem like a marginal and deliberately simplified element to pay homage to the sources of inspiration but it becomes a problem especially if you engage in Career mode, which forces you to spend a lot of time in front of these rather anonymous and disorganized screens, which certainly don't promote immersion in the game. It is clear that a game born with the intention of paying homage to some classics of the past must necessarily appear derivative, just as the original simple and humorous cut, typically British, is difficult to recover in such a different context. However, there is a remarkable overall coherence in all the representation of Active Soccer 2 DX on the playing field, where there is actually a nice atmosphere of lived football, thanks also to the representation of the public and the chants that seem to have been recorded directly in the stadium , as well as a nice general liveliness between animations and colors, all enlivened by the application of some touches of class such as variable weather conditions. The sadness of the menus is therefore counterbalanced by a good realization that emerges in the heart of the action, with a representation that is always very simple but effective, complete with different shots to be used with various zoom levels and vertical or horizontal scrolling. Note the refinement work carried out with respect to the mobile version from which this DX edition derives, even if overall the price of 15 euros applied to the game is a bit high compared to the cost of the original.", "date": "2016-04-05", "grade": "6.0"}