{"name": "Einherjar nello spazio", "ref": "https://multiplayer.it/recensioni/165946-eve-valkyrie-einherjar-nello-spazio.html", "text": "Here we are. After much talking, we finally put our hands on the pads and, helmet on, launched into the first complete experiences for virtual reality. With our now trusty Oculus Rift Development Kit 2 (waiting to get our hands on the Consumer Version), we decided to take off to outer space to discover EVE: Valkyrie. It is a title that has been talked about a lot and that those who follow VR now know quite well, given that it is expected by many to be one of the first killer applications of the new technology. After several hours of play, however, our feelings have not been so positive. And not just because of the motion sickness. We thoroughly tested EVE: Valkyrie. Is it really the first killer application of virtual reality? Towards Valhalla We are dead. No, it's not the beginning of a Dark Souls III game, but the peculiar incipit of EVE: Valkyrie. Immediately justifying the reference to the Norse deities, the guys from CCP Games have decided to welcome us into their world by telling the day of our death. Don't worry though, because it's nothing serious or irreparable: our consciousness was in fact archived just before we breathed our last and was then promptly transferred into a clone. A procedure apparently far from unusual, given that it will be the one that will justify each of our respawns. But let's go in order. Death, as we know, has some contraindications and memory loss is apparently one of them. After reminding us of our gender, the guiding voice then proceeds to explain our past to us and, through a series of simulations, also introduces us to the basics of flight and aerial combat in space. The controls are quite simple: as the ship moves forward, you use the left analog of the Xbox One controller to determine the direction, the B key to slow down and the A key for a boost. The lats change the pitch of the ship, while the triggers are assigned to machine guns and homing missiles. Finally, the X and Y keys are used respectively to activate the countermeasures for the missiles and to select a target to facilitate the pursuit. It is a pity, however, that at the end of the tutorial the most substantial section of the title plot also ends, which from this point on abandons all its narrative ambitions to the memory fragments of the fallen pilots - the so-called ~echoes~. Thus comes to light the true vocation of EVE: Valkyrie, which focuses decisively on the multiplayer component. The Hero's Path Even with some single-player modes, such as the ~chronicles~, which allow you to collect the aforementioned echoes in reconnaissance missions or to face waves of enemies guided by artificial intelligence, EVE: Valkyrie does not seem to have any interest in developing the offline component with varied missions and just tapping into the wonder of VR to entice players. Online becomes so fundamental and forming your own team is as necessary as it is dangerous. Playing together and against human opponents in 8 against 8 matches is in fact fun and rewarding, but improving one's rank to access new classes and upgrades is far from simple. Here then comes the shortcut, served on a silver platter with the contents of the Founder's Pack reserved for those who have pre-ordered Oculus Rift. At stake are two thousand five hundred gold, or ten dollars in real currency, with which to have access not only to aesthetic improvements but also to an increase, for a limited period of time, of the experience points earned in battle. Thus we face the controversial world of microtransactions, which in a title sold at full price are always rather annoying: we would have preferred to be able to conquer all the rewards on the field, perhaps through a less lethargic growth system. In any case, the clashes are far from simple and require a good deal of familiarity not only with the shooters, but also with the mechanisms of virtual reality. In fact, it is not so immediate to get used to blocking the sight of homing missiles with your eyes or reacting to sound impulses to activate the necessary countermeasures when under fire. From this point of view, the developers have granted very little to casual players, who risk being overwhelmed by fast gameplay that requires lightning-fast reflexes. The wow effect Despite a rather meager amount of content, it is undeniable that diving into EVE for the first time: Valkyrie is an almost mystical experience for a player. As we look around before launch it's amazing to see our virtual hands gripping the controls where in real lifeAt this time we hold the controller or catch our alter ego's shoulder out of the corner of our eye while it rotates slightly to follow the movements of our head, which moves continuously, curious. Small and essential, the cockpit can be observed at three hundred and sixty degrees and it is equally astonishing to note how perfectly it integrates with the game interface: in front of us we find a small radar and two indicators, one for speed and the other to keep under control the charge necessary for acceleration. The take-off also manages to convey a good sensation of speed, but it is in the open space that EVE: Valkyrie gives its best. Once outside it is easy to forget both the outside world and the ever-present grid effect on the screen, and it is not easy to concentrate on the battle either. In fact, the maps offer impressive glimpses, including wrecks, space bases and celestial bodies. However, it is precisely the rather disorderly presence of these elements that creates the biggest problems. Unlike other games where seasickness is due to delays in recognizing movements, here we often find ourselves without real reference points even just to establish which is above and which is below; after some evolution to avoid enemy attacks, the enterprise then becomes absolutely impossible. We were thus able to play in sessions of no more than a couple of consecutive hours, experiencing a practically continuous feeling of malaise even after rather important breaks.", "date": "2016-03-31", "grade": "7.3"}