{"name": "Championship Manager 2006 (Scudetto 2006) - Recensione", "ref": "https://multiplayer.it/recensioni/championship-manager-2006-scudetto-2006-recensione.html", "text": "You are dolls, that's what you are!!! Luckily there's only one such coach... In any case, however, our job will be far more difficult than that of the inimitable Ciccio Graziani, in fact, even if there won't be cameras buzzing around us, we'll still have many more things to look after. This is because our duties will be a little different from what actually happens. A normal coach he simply has to ~limit himself~ to coaching the players, choosing the starting 11, the formation and tactics to adopt, and leading the team in the match (to these tasks is added the interaction with the press if he is in a professional division) . In addition to this, he must indicate to the management the players to sign that he deems necessary to strengthen the squad and those he does not need and who can be placed on the market. As if all this weren't more than enough to fill the day, in CM2006 we will also have to keep track of the cash, that is, make all the necessary decisions to avoid the company going bankrupt (which often translates into a drastic cut in the more expensive than the rose). So let's go and see in detail all the ~paperwork~ that awaits us before the actual game, and try to understand how it was done in the game. Obviously the greatest difficulty arises if you decide (like me) to start from a minor division and with an underdog team, in fact in this case financial management will be a very important problem for several years and will condition many choices. If, on the other hand, we want to start directly with a strong and established team, we will hardly have budget problems (except in the case of repeated inconsiderate choices) and we will be free to do what we like without many limitations. The first thing to do is to decide which and how many championships to activate, among the 26 nations available (see the screenshot for the complete list), for a total of 63 divisions; account this fact without counting, any splitting of the minor categories, as is the case for our C1 and C2. It won't be a mammoth database like that of the various Football Managers, but it still manages to gain respect. So we will have to create a profile that acts as our digital alter ego and choose the team to coach. Then you press the confirmation button and usually go down to the bar to get cappuccino and brioche, sure to come back with a large margin of advance anyway, given the times we are historically accustomed to. But here the fun begins, because the entire operation performed on an Athlon3200+ with 1 GB of RAM and all the divisions of all the nations enabled lasted 1 minute and 20 seconds! A speed not even remotely hoped for with Football Manager (which this year is already much faster than the last edition). The beginning is therefore more than excellent; go on. [C] The complete list of selectable countries. The creation sheet of our coach alter-ego. ...and with San Marino in C1, I chose the most competitive C2 team. close to home... I didn't want to travel too far to get to work... [/C] What are we, the Brancaleone army? Once catapulted into the main game screen, the first thing to do (for those who have not played the disastrous CM5) is to get carried away with the navigation interface. It's a nuisance that everyone would like to avoid, but I guarantee you that it's the best way not to have to start again when you realize you've thrown away half of the summer transfer window because you didn't know where to put your hands. However, I announce that the interface is very simple and comfortable, and a few minutes of experiments are enough to learn the necessary rudiments. the interface is very simple and comfortable, and a few minutes of experiments are enough to learn the necessary rudiments What are we, the Brancaleone army? Now, everyone would be tempted, like placid children with a nutella jar in front of them, to go and sift through the characteristics of the squad, but unless you have chosen an economically more than stable team or have activated the option ~ benefactor at the beginning, in order to have an avalanche of money as a gift, it is better to leave this enjoyment until later and take an indispensable look at the company's finances. As already anticipated, in fact, we will also have the responsibility for financial management and, at least in theory, a company in the red does not buy anyone (in reality, with the games of capital gains, aid and loans from friendly banks and some other tricks, this is not the case, but here we are talking about an ideal world in which there are no such subterfuges). First of all, don't be fooled by the nice little number next to the ~market budget~ item, because it is the last chand you must worry: the real trouble is the salaries. Too often we already start above the company's ceiling, and above all nobody notices that the maximum salary limit is updated every two weeks based on the availability of liquid assets and net of income and expenses, therefore, on balance, the ceiling indicated at the beginning of the season is on average almost double what the club can really bear without going into the red. It is probably an error in the calculation that is made at the beginning of the season due to the fact that the initial liquidity is considered as the net income of the previous year and the program assumes that this represents the rule of the company's balance sheet; on the basis of this forecast, a salary ceiling is thus calculated that is much higher than necessary. It is a discrete nuisance, which often forces you to restart the game after the first few months, but once you understand the trick it can be easily avoided. If there's anyone here who doesn't prove they deserve to stay, I'm sorry, but they'll pack their bags Now that we have an idea of how much we can really afford to spend, it's time to check the quality of the human material at our disposal. This is by far the most complex phase of the whole game (so arm yourself with patience and don't give up, everything else is downhill), above all because you have to compare all the players in each department, therefore a large number of data. Being a management game, the players are represented by a set of numerical characteristics (39 total). Each value indicates a specific skill. So, if, for example, the player we are observing has indicated a 100 in elevation, it will mean that he is an incredible jumper; on the contrary, should he have 25, he will barely be able to get off the ground. The interface then allows you to view the list of players along with some skills (physical, mental, defensive, offensive and goalkeeper, but it is also possible to create a personalized selection) and this greatly facilitates the task. It seems apparently easy, but the skills needed depending on the roles are not few. A defender, for example, will absolutely need Tackling and Marking to stop his opponents, but also Heading to win aerial duels; however, without a good Elevation, he will always be overtaken by his opponents, and therefore his skill will be useless and, even worse, without a good Advance, he will miss the timing of interventions, and all the rest will be useless; to this list it is also good to add good scores in Aggression, Courage, Safety and Determination, in order not to be put under psychologically, as well as Strength, Endurance, Speed (Rhythm), Acceleration and Balance, in order not to be outclassed on a physical level . The list therefore becomes quite long, and it is impossible, especially when dealing with less established players, to find someone who has all the points in the right place (or rather, you can find him, but it costs a fortune!), so you have to try to mediate between all these numbers and find the most profitable combination. At this point there are usually two needs: stripping the squad of unwanted ones (which sometimes also includes good players, but with salaries that are too high) and plugging the holes with valid grafts. We have therefore arrived at the moment of the market. looking for new players is easy, finding valid ones is less. To help us we have the indispensable search engine and our faithful observers If there's anyone here who doesn't prove they deserve to stay, I'm sorry, but they'll pack their bags Looking for new players is easy, finding valid ones is less. To help us we have the indispensable search engine (unchanged from the past edition, but it didn't need modifications) and our trusty observers. Once we have identified the right player for us, all we have to do is make an offer to the team that owns the card and, if this is accepted, offer him a contract. Everything is particularly intuitive and easy, but there are some things that don't go as they should. First of all, we can only buy, borrow or try out a player, therefore no Italian co-ownership, furthermore, sometimes, during the negotiations, we witness a rise in requests that has no explanation (if I accepted the initial request, because then I asked for triple, and so on until the club rejects my engagement?). Apart from the purely technical issues, however, there is an inexplicable flatness of the available players: they are all more or less the same! To take the usual example that is worth a thousand words, all midfielders (I mean the pure ones, not the ones I cannot fill other roles as well) have low Pace and elevation and high Passing Accuracy; to have one capable of hitting a header with the ball, one must necessarily look for one who is also a defender. So goodbye variety and goodbye team customization! Again, (EU) foreigners accept starvation contracts (600 per month!!!), Italians are worth their weight in gold, and there is a clear gap between the quality of players based on nationality. Apart from the Brazilians who are all from Serie A, there are also other incomprehensible situations, such as the fact that football players from the most prolific champion nations (Italy, Spain, Germany, France, England...) are on average worthless compared to others (never found a decent one among the free agents) while, I don't know, Norway is the new land of football (I've caught 4 excellent ones, all always for 600). However, as always, everyone was affected by the flatness of the characteristics based on the roles, so there is no need to turn around half of Scandinavia in search of a tall midfielder just because up there they are all taller on average, because this does not count. The scouts are definitely useless in the search for talent, but this is due to problems related to training which I will talk about later. It therefore makes no sense to send them in search of players, while on the contrary they are very useful for revealing the characteristics of those with unknown scores. So get ready to spend at least the entire first season ordering each of them every two days to follow the stranger on duty (it's a pizza, but it's the only way to find someone really good). What do I have to do to explain myself: speaking in Chinese? The next stage is training. There isn't much to say here, at least nothing more than the past edition, since it has remained unchanged. The programs are indicated thanks to the list of real exercises to be performed, and we can change them to our liking by choosing from a thematic list. It is also possible to create a completely new training program, and to help us we have a convenient automatic generator, in which we only have to indicate how much time we want to dedicate to each category. Once decided, the generator will draw up the program by himself assigning the specific exercises. It is then possible to assign the training program to the players who can see their progress, both via a general screen and directly from the summary panel of each player's characteristics. The general impression one has of the training system is that no progress has been made in this respect, in fact, if at the beginning one is happy to see a rapid improvement in the scores of the whole squad, after a few months one he realizes that in reality it is only an oscillation, ie the values, after having risen initially, have returned to normal, to then rise again, with a kind of ~pendulum effect~. I can't guarantee it for sure, since there's no way to run tests without taking whole days (there's no ~go on vacation~ option that lets you simulate everything from the PC), moreover, probably, external factors also influence such as the conditions of the training field or the scores of the trainers, but the general impression is this. Finally, and very importantly, the possibility of training a player in a position other than his own is totally absent, in order, over time, to convert him in order to favor his best characteristics or plug a key role. [personal example: I have a very fast striker, but not a great shooter, and I would like to turn him into a winger, a role that would suit him perfectly, but I can't and I am forced to keep him out of position with the certainty that sooner or later he will get angry. ] What do I have to do to explain myself: speaking in Chinese? And let's move on to the tactics board. Again, nothing new, you choose the formation based on the type of game you prefer and you assign a few specific orders, such as the intensity of the tackles, the types of passes and the game mentality, and you define the priorities to take penalties, free kicks and corner kicks. Unfortunately there are many possibilities that one would like to have, such as that of specifying the areas of the field in which to concentrate the attack maneuver. In fact, for months I only had one valid winger, but there was no way to start all the action from there. In addition to the basic tactic, this also precludes the possibility of modifying one's tactics based on the skills of the opponents, with all due respect to any strategic ambitions. Damn you and whoever makes you play!! After a few hours of play (and over 15,000 characters...) it's finally time to play. A couple of days before, however, we can read the news and previews with the opinions of the newspapers. A nice idea, also because", "date": "2006-04-03", "grade": null}