{"name": "Dead or Alive Xtreme 3", "ref": "https://multiplayer.it/recensioni/165792-dead-or-alive-xtreme-3-il-paradiso-del-desiderio.html", "text": "Probably one of the most talked about and controversial sequels of recent times, Dead or Alive Xtreme 3 was a somewhat surprising move by Koei Tecmo Games, considering the lackluster success of the second installment of the series. The summer and sexy spin-off of the Dead or Alive saga made its debut way back in 2003, as an absolute Xbox exclusive, following an idea of the historical leader of Team Ninja, Tomonobu Itagaki. The title reflected all his obsession with breathtaking reproductions of sensual and provocative girls, in a form in any case aligned with Japanese parameters. The vulgarity of the staging was relative, not to say non-existent, and indeed there was an ingenuity capable of arousing tenderness in a Westerner. Regardless, Dead or Alive Xtreme Beach Volleyball was also a surprisingly fresh, fun and different title thanks to its unconventional nature, as well as being a great graphical showcase for Xbox. The small band of enthusiasts turned their backs on the less entertaining and less inspired Xbox 360 sequel, suggesting that there probably wasn't room for serialisation. Thirteen years later Team Ninja has attempted to try again, with Yosuke Hayashi at the helm. However, Itagaki's absence has left a void that the studio has never been able to fill, losing part of its vision and indulging too much in the prospect of easy money through DLC. Dead or Alive Xtreme 3 continues this questionable philosophy. Dead or Alive Xtreme 3 recovers the old formula without relevant news Thirteen years and feel them Since its presentation, Dead or Alive Xtreme 3 has generated a long series of discussions, due to a push and pull with Hayashi's rather annoying user: at first the title was announced only for Japan, however suggesting that there would be possibilities for a western release. Finally it was decided to go back to the original plan, with reasons that left more doubts than clarifications: the company decided not to distribute it in order not to run into potential controversies for the exploitation of the female image. In fact, the climate in the world of video games has taken on the contours of an inquisition, but by testing the title thoroughly we have finally managed to focus on a certain basis in the fears of the Japanese house. However, we prefer to think of a combination of causes. Compared to its predecessors, Dead or Alive Xtreme 3 proves to be a low-budget production that takes advantage of a large part of the assets of the previous two chapters. There are also defections: the slot machine from the casino and the jet ski races are gone, however gaining a rather bizarre new event, which requires the girls to climb a rock face. The roster also reflects Japanese tastes: the nine chosen ones were selected from a poll and feature recent additions Honoka and Marie Rose in the front row. The first exaggeratedly buxom and the second exaggeratedly young, even if the information on age tries to divert the embarrassment. Almost all Western characters are cut out, so no Tina Armstrong, Christie and Lisa, who enjoyed less popularity in Dead or Alive 5: Final Round. The iconic Kasumi, Hitomi and Ayane are present, together with unexpected characters, such as the very mischievous Nyotengu. Fortunately, beach volleyball has also remained, emerging with a worrying delay in the hype, and which once again represents the strong point of the production. The profile is therefore that of a title strongly designed for the Japanese and Asian market; from the latter we obtained the PlayStation 4 version, called Fortune, which presents the texts in English and is therefore perfectly usable. Beach volleyball is always fun The title is still developed like its predecessors: the player is free to choose one of the nine girls, helping them to spend a pleasant two weeks of vacation on Zack's tropical island, which however doesn't exist this tour, a bit to save money on assets, but above all to justify the new management method. The choice on how to invest the fourteen days is up to the player, choosing from various activities (the infamous mini-games), unbridled shopping and managing relationships with other characters. Each day is divided into three phases, morning, afternoon and evening, in the latter the scene passes from the beaches to the hotel, where the possibility is opened to go to the casino and increase the internal currency, the Zack Money, playing poker, blackjack and roulette. The Zack Money are the driving force of the whole game, each progress is governed by the accumulated coins, which allow us to buy new costumes for our heroine, but also gifts to increase thelevel of social relationships with partners. To play beach volleyball it is mandatory to move in pairs, a peremptory condition that is immediately calibrated by proposing a partner to the player. You can decide whether or not to accept the proposal, but in the second case it could be difficult to find a new partner, risking missing several games. The other mini games are as mentioned almost all present; net of defections, the various competitions in the swimming pool, the capture of the flag on the beach and the aforementioned mountain climb return. The control systems are variable, in full style of multi-event productions, but only apparently simple. Jumps in the Pool requires the passing of a path made up of floats, Battle of the Backside and the Rope are strategic competitions, in Steal the Flag the rapid pressing of the keys is required, in full Track & Field style, while the Mountain is the classic quick time event , however without unpleasant results: it is impossible to fall (it would not be very relaxing), but it is important to get to the top in the shortest possible time. Among all, Beach Volleyball remains the most ambiguous and satisfying event: the game only partially explains the controls, limiting itself in the tutorial to describing the various types of service, but there is much more behind a subtly essential structure. In any case, nothing has changed compared to the previous episodes, including the vaguely isometric shot, which is not always very comfortable. My island The real novelties of this third chapter are represented by the mission system and the island manager mode. The first is a stimulating addition, which gives a precise stamp to the strategic aspect of the title, giving it RPG overtones. In essence, the most disparate objectives are proposed to facilitate earnings and experience points, completely independent of the Trophies, which allow a different approach to the dynamics of the title. For example, you go from simple tasks, such as buying a new swimsuit or giving a gift, to more complex tasks, such as playing certain times in the casino. It is always possible to prematurely end missions, which are still timed, if you are unable to meet their requirements. The manager mode is accessible by pressing the touch pad of the Dual Shock 4, thus resulting perfectly integrated into the main one. The switch must become a natural practice in the economy of the title, as the missions are alternated between the two modes. It is the owner himself who earns experience points after completing missions, leveling up and allowing access to new items available in his personal shop. Regardless of everything, the game will still end on the fourteenth day, leaving in memory both the conquered objects and the level of relationships between the girls and with the manager. In this case there is even talk of two distinct parameters, that of sympathy between the girls and the level of satisfaction with the owner. The grind is consequently more exaggerated than in the past, the first games will be less productive in terms of results and we will have to get used to many refusals and hostile attitudes. Let's forget the most coveted and skimpy costumes right away, especially in the exchange between girls, which represents the most intriguing aspect considering that each one has its own precise style. In any case, perseverance pays off and everything is tempered by the fact that there is no real purpose other than spending two weeks carefree. Each game is never an end in itself and represents a building block for the achievement of new results. Even heaven has some flaws Another aspect that demonstrates the limited budget of Dead or Alive Xtreme 3 is the graphics. The game is undoubtedly a pleasure to watch and focuses entirely on the creation of the girls, the real protagonists of the production and engine that fuels its attractiveness. The Soft Engine makes itself felt in the creation of breathtaking anatomies, perhaps unprecedented in the sector, embellished by tons of motion capture that are vented in the various ~gravure~ scenes, where the girls engage in various activities under the watchful eye of the camera. The PlayStation 4 version also has peculiar characteristics, such as a rendering of the physics of the breasts, all abundant and perfect, truly impressive, progressive tanning effects, complete with signs of the swimsuit, and bikinis that move in case of contact with water . However, there is no shortage of less convincing sides, the animations are often wooden and it can be seen that they are largely derived from the previous chapters, the scenarios are totally recycled and feel the weight of two generations, with sporadic excesses that are difficult to digest, moreoverpresent particularly severe polygonal interpenetration phenomena in the case of hair rendering, even this not very sophisticated. The style is what distinguishes the series, vaguely cartoonish with a Japanese anime imprint. The resolution has been raised to native 1080p (always at sixty frames), a factor that allows for great sharpness, but which on the other hand highlights the aforementioned defects even more. The costs have also affected the licensed music, completely absent and replaced by audio produced internally by Team Ninja, however surprisingly pleasant and on topic. Playstation 4 trophies Dead or Alive Xtreme 3 features 50 Trophies to earn. Most are linear, as they can be achieved in normal games, others require more effort, such as the trophy that requires an S rating at the end of the holiday. In principle, in a few hours it is possible to win 30% of the trophies. Let's put our shirt back on, times are about to change The nature of a fan service product is evident right from the start, as has always been this spin-off, so it is a factor that should not surprise. His philosophy of looking and not touching is typical of Japanese sexual culture; the most thorny side is precisely the one linked to voyeurism, raised to a power in each line of code and encouraged by the gameplay itself, in fact it is also required to take pictures of the girls to accumulate experience points. This third chapter generally proves to be less open to the western market, proving to be a very targeted product, but one that will nonetheless fascinate lovers of oriental culture. However, it arrives out of time with a formula that does not bring any relevant innovations compared to the past: the mini-games always remain the same and are a pleasant side dish to beach volleyball, which still represents the most interesting and profitable activity, but is played exactly like 2003 Another aspect that didn't convince us is that of the micro-transactions, present in the game and not ancillary, which heavily influence the manager mode. In this case the only source of income, excluding the dedicated missions, is represented by the casino, among other things with a cap set at one and a half million Zack coins. Special swimsuits, which are unlocked in the exclusive shop and will likely welcome future DLC (Tecmo Koei has already confirmed their arrival), are expensive and difficult to obtain. This is where the Premium Tickets come into play, which can be purchased with real money and which allow you to save time and resources. Even in this case, however, success is not guaranteed, since the girls can easily refuse the gifts, frustrating the purchases and forcing them to spend more money to repackage the object. The microtransactions are irrelevant for European users, as it is not possible to connect to the server to redeem them, but the fact remains that they affect the balance of the game itself, making the progression system slow and burdensome.", "date": "2016-03-28", "grade": "6.0"}