{"name": "Nella tana del topo", "ref": "https://multiplayer.it/recensioni/165746-disney-magic-kingdoms-nella-tana-del-topo.html", "text": "Taking younger gamers as a target, for its new title Gameloft has decided to focus on the classic, in this case it has acquired an official Disney license to create a traditional casual management game with the various Mickey, Goofy and Donald as protagonists, together with an abundant amount of characters taken from more or less recent animated films: from Toy Story to Rapunzel, from The Sword in the Stone to Wall-E. The result is precisely Disney Magic Kingdoms, a rather vast product full of activities, but characterized by decidedly worn-out mechanics and lacking in interaction, in which you simply have to touch some icon and wait for the completion of a ~mission~ to then move on to the next one , pursuing a growth that will lead to the unlocking of new characters, new buildings and new areas. All, however, with a view to a structure strongly based on monetization, in which hard currency must be used to speed up the completion of operations and proceed more quickly. In short, not exactly the ideal game to put in the hands of a very young user, especially if you don't set blocks for in-app purchases. Disney Magic Kingdoms is a casual management game like many others, nice to look at but very limited Tap and wait The first aspect of Disney Magic Kingdoms that strikes you is the technical realization. The developers have done an excellent job of modeling the characters and environments, which reproduce the most famous theme parks of the mouse, with attractions that move in the background, fireworks to celebrate any level jumps and an excellent choice of colors, vivid and gaudy as expected. The music is also beautiful, it is no coincidence that these are very famous themes, although in this situation the variety is not incredible, on the contrary. Touch management on the iPhone 6s is reactive, fluid, free from inaccuracies in the location of touches: a limit that this video game genre now seems to have overcome for some time. As mentioned, everything else is missing: the gameplay, if we want to call it that, appears heavily limited by mechanisms that simply ask us to touch a character, touch the icon of an available mission and wait for its completion, and then eventually collect the prizes that are scattered around the scenario and continue with the next quest. A formula that could still work with younger gamers but which, thanks to a very marked and limiting freemium approach, really has nothing to offer to users who have already had to deal with this kind of product, and no longer have the desire to open an application, touch two icons and close it waiting to be able to go on.", "date": "2016-03-26", "grade": "5.0"}