{"name": "Solleviamo il vespaio", "ref": "https://multiplayer.it/recensioni/165517-blues-and-bullets-episode-2-shaking-the-hive-solleviamo-il-vespaio.html", "text": "While at the end of August many were still enjoying themselves between sun and sea, lovers of the noir genre did not miss the arrival of Blues and Bullets. At the time of the review of the first chapter of the A Crowd of Monsters title, we too declared ourselves quite satisfied with the encounter with this episodic adventure, while highlighting some defects dictated by its independent nature. Seven months have passed since then, during which the arrival of the second episode has been postponed from time to time, only to finally take place a few days ago. Having kept Blues and Bullets on our radar all this time, we were therefore more than welcome to have the opportunity to Raise the Hornet's Crawl, just as the Barcelona-based developers have invited us to do with the title of the second part of their noir adventure. Eliot Ness and Al Capone are back in the second episode of Blues and Bullets, a little less convincing Past and present Since it's been so long since the release of the first episode of Blues and Bullets, let's go back to dealing with the plot of this game a bit as a whole: references to the previous chapter are inevitable, so if you haven't played it yet, pay attention to spoilers. The adventure revolves around the figure of Eliot Ness, famous in reality for leading the team of the Untouchables and arresting Al Capone. In the story developed by the Spanish boys, Ness succeeds in the same enterprise, only to fall into disgrace after failing to solve a case related to the disappearance of some children. After several years, the possibility of redemption passes through the enemy of all time, Capone, who gets out of jail and manages to involve the now ex-detective in a case similar to the one that cost him his career. The two then unite in an attempt to find little Sofia Capone, for the reasons told in the first chapter. If the latter was rightly focused on laying the foundations of the plot, also introducing us to the various figures involved in it, with Raising a Vespaio the developers decided to give more space to the past, while continuing to carry on the events of the present. The main story then continues on the line drawn previously, with the interlude of some flashbacks dedicated to the past of Ness, anything but peaceful both before and after the arrest of Al Capone. The noir style naturally continues to dominate, in this second chapter encroaching a bit even into horror, when we find ourselves catapulted into a nightmare of Ness; some supernatural elements also come into play, which we will however leave to you the pleasure of discovering in detail if you decide to play this second episode, for which the duration is around two or three hours. Before returning to the plot to express an opinion, however, we must also go back and take a look at the actual game. As before, less than before In terms of gameplay, the elements that we had appreciated in the first chapter of Blues and Bullets also return on this occasion, however overall in a lesser way. In the first place because the deepening of some mechanics, already desired starting from the review written seven months ago, unfortunately did not take place. The third-person shooter parts, for example, continue to be extremely simplified: although this is not necessarily an excessive problem, the developers have overemphasized this type of dynamic, resulting in long shooting sequences in which the player has to work very little to be able to move forward. The result is a pinch of boredom too much, fueled by some quick time events that are far too rudimentary to be able to convey any kind of tension to the player. Indeed, all this makes us find ourselves a little estranged even in the moments in which the plot should touch its apex points. The same type of discourse can be applied to the investigative part, appreciated in the first chapter but really too simple in this case, to the point that it almost seems to be in a visual novel. From this point of view, fortunately, the plot continues to be interesting, even if it is quite symptomatic that it is the part that follows the epilogue, the one in which neither Ness nor Capone appears, that involves the player more from the point of view emotional. In stylistic terms, once again there is nothing to complain about: the black and white with red hues continues to appear inspired by whoever is in front of the monitor, but unfortunately the graphics sector has lights and shadows. As before Blues and Bullets continues to have optimization problems even on the most powerful PCs, dropping frames aeven in the most unthinkable moments. There is also a certain woodiness in the animations of the characters, to the point that seeing Ness ~run~ is almost laughable. As far as the audio is concerned, hats off to the guys from A Crowd of Monsters: an excellent soundtrack, guessed above all in its main theme, is accompanied by a particularly inspired dubbing, for which Doug's voice also returns ~ Geralt~ Cockle. There are also subtitles in Italian. Pause for reflection While remaining determined to see how the story of Blues and Bullets will evolve in the next few episodes, after having recommended the first one we find ourselves suggesting instead to wait before buying its successor. We do this in light of the defects found in the previous paragraphs, but above all because after selling The End of Peace individually, the developers have instead included episodes from number 2 to 5 in a Season Pass package. The various episodes cannot therefore be purchased individually, making the purchase in a single solution obligatory: the only chapter that can be purchased for 4.99 euros therefore remains the first, while to have all the others it is necessary to spend an amount that varies from 16.99 to 19.99 euros, depending on whether or not you own the part that came out seven months ago.", "date": "2016-03-24", "grade": null}