{"name": "Corse tarzanistiche", "ref": "https://multiplayer.it/recensioni/165586-rope-racers-corse-tarzanistiche.html", "text": "The swing on the ropes is an expedient already successfully tested for the creation of a racing game in the mobile sector, already seen in titles that have met with great success such as Slingshot Racing and Rock Runners, just to name a couple, therefore the mechanics of basis of Rope Racers is now well established. The idea probably arose from the need to simplify the control system as much as possible, and the fact of exploiting the oscillation of a rope (a cable, a liana and so on) allows you to dedicate yourself to a single preset input, leaving the physics the rest. In fact, even in this case we essentially find ourselves pressing on the screen to throw the rope, which is always fired in the same condition, i.e. upwards at an angle of about 45 degrees with respect to the protagonist, limiting ourselves to pressing again to throw again and grab onto the next foothold, effectively advancing quickly within the levels with the simple pressure of a finger on the screen. The only interaction required is therefore based on the timing in touching the screen to release and throw the rope, trying to exploit the acceleration given by the pendulum and keep the speed as constant as possible, using the trajectories to avoid obstacles at the same time and collect the bonuses in a mad race against time. Indeed, in fact it is a real race against 9 other players in an asynchronous multiplayer which turns out to be an excellent choice to encourage the player to carry on the challenge by placing him directly against other users without slowing down access to the game with the need for classic matchmaking expectations. Running against the ~ghosts~ of other players we always have opponents immediately available in the game and we don't risk running into problems related to networking or collision between sprites. Challenges in small portions Rope Racers is therefore to all intents and purposes a racing game, in which the main objective is to finish first or place on the podium at the end of each race. Thus preferring speed over the exploration of the levels, the latter are structured in such a way as to favor the maximum exploitation of the pendulum to maintain a high swing rhythm. Consequently, the level design is not particularly structured, limiting itself to containing the runners within a route and directing them towards the finish line, occasionally placing some obstacles and platforms to be strategically exploited to save as much time as possible through minimally reasoned and mostly In some cases the levels finish in less than a minute. This intuitiveness and speed of execution leads to an ideal use in the mobile sector but also to a slightly excessive simplicity in the structure, as well as making the poor mechanics of the free-to-play adopted in this case more evident. In fact, Rope Racers takes advantage of microtransactions through two main dynamics: a classic energy bar that allows you to run about fifteen races before forcing a break for recharging (or the purchase of energy through the outlay of money) and a price to pay for access to the rides, which is quite expensive at the highest levels. Obviously the in-game currency can be easily earned by winning the races, but moving on to the more advanced challenges (the only ones, however, capable of guaranteeing good income with victories) everything gets complicated because the entry price becomes very high and the risk of losing everything by failing to qualify in the top three is present. It is a sustainable system, in the sense that the energy still allows you to play for about 10-15 consecutive minutes which are the average time per session allowed by this type of game and in-game money management is not particularly difficult. but detractors of free-to-play will find bread for their teeth here. There is something primal about the joy of swinging on hanging ropes: let's try it again with Rope Racers", "date": "2016-03-23", "grade": "6.8"}