{"name": "Perch accontentarsi di un'armatura quando puoi avere un robot?", "ref": "https://multiplayer.it/recensioni/165587-fallout-4-automatron-perche-accontentarsi-di-unarmatura-quando-puoi-avere-un-robot.html", "text": "The latest Fallout was nothing short of controversial. Praised almost everywhere for its complex crafting system and its very rich world, it has unfortunately dissatisfied many gamers due to the abandonment of particularly successful elements of its predecessors in favor of accessibility, too many bugs and a gameplay that it has not evolved enough since the third chapter. The fanbase's irritation is understandable; after all, Bethesda has followed the usual rule of ~modders think about it anyway~, setting up a title that is undoubtedly rich in content and exciting, but which once again seems more like a huge foundation on which the community can build a masterpiece in its own right . Regardless of how you think about Fallout 4, however, the US software house has always updated its titles with criteria, developing DLCs with a fair frequency that exceed expectations and any user project. For this reason we have been waiting at the gate for the first piece of the season pass, whose ambitions and costs have significantly increased in recent months. Automatron, this is the name of the number one official DLC, adds a new series of missions to the adventure, but it doesn't just bring new quests with it... the developers have in fact put two and two together, and they realized that their very tasty crafting system lacked one thing absolutely essential to fully satisfy their army of fans: customizable robots armed to the teeth. Oh, prove him wrong. Customizable robots in the Wasteland? Unleash your inner Dr. Wily in Fallout 4's first DLC Math salads To kick off the Automatron questline, just follow a caravan's call for help via radio. There, however, you will find only death, an army of particularly enraged automatons and a robot named Ada, who will decide to follow you after the inevitable transformation into wreckage of the mechanical enemies who were attacking her. Ada is an Assaultron programmed to defend people, but her mechanical mind thinks in a rather simple way: ~you kill all her friends, she kills you~. Driven by the desire for revenge of your new robotic friend you will therefore have to go around the map in search of the culprit, massacring piles of tin at every corner. Nothing particularly memorable so far but, as mentioned above, the real attraction of Automatron is not the main quest. If you have enough materials, in fact, you can practically immediately equip yourself with a workshop to create and customize robots, where you will be able to enhance not only Ada, but also mechanical warriors aside, as devoid of personality as they are useful for protecting their settlements . The crafting of the robots is quite intuitive and in some ways reminiscent of a poor man's version of the Armored Core workshop. Your robot will be placed in the center of a comfortable platform and there you will be able to modify every single part of it, from the head to the armor of the legs, passing through dozens of weapons. Clearly, eliminating opposing robots and collecting their pieces will allow you to unlock the latter also in your headquarters. We were genuinely impressed with the number of customization options the DLC offers - creating your own deadly variant of Bender Rodriguez still has considerable appeal. It's just a shame that the rest of Automatron isn't as fulfilling. Short circuit The quest series started by Ada is enjoyable, that's for sure. The variety of enemies, which use the same components offered by the new workshop, is impressive, and these pose a real threat if you don't face them at a high level and with the right equipment. The duration of the whole, however, is around three miserable hours, even less if you don't look for all the possible testimonies of the terminals in the maps and face Automatron head on. The fact that the locations in the game are discreetly cared for, full of traps and rare components, as well as quite interesting to explore, is certainly comforting, but it is not enough to justify a very poor longevity for a 10 euro DLC. At least this additional content also offers an extra companion in addition to Ada (and in our opinion significantly more interesting in terms of characterization), new equipment and some unique dialogues for the more attentive. Additions are always welcome, in products of this type. There is not much to say, however, from a technical point of view. During our test we did not notice any major bugs, but it happened that Ada got stuck at random in some areas and that some doors took too long to open; it is therefore not the case to expect a level of limhigher than that of the base title. In other words, we are faced with a good quality content that adds a not indifferent gem to the already praiseworthy crafting of the base game, and has fun with a short but intense and demanding questline if you don't face it too far. In our opinion we are facing a valid DLC, with reservations. Before recovering it, therefore, ask yourself a simple question: ~how much do you love robots?~", "date": "2016-03-23", "grade": null}