{"name": "Funtasia", "ref": "https://multiplayer.it/recensioni/funtasia-recensione.html", "text": "To date, the team known as Fantastico Studio has released a whole series of truly special productions, even if practically unknown to the general public - partly because they are indie, partly because they are strongly authorial. The writer, and it is not a shame to admit it, knew absolutely nothing about these developers, but curiosity arose immediately after the first few minutes of the game in the company of Funtasia. In fact, we have played a lot of strange productions in recent years; however we believe that Funtasia will stay in our memory for quite a while. Nothing is really missing: a crazy racing game, as arcade as damn technical; an artistic direction able to wink at the very particular grotesque of the figures of the eighties; even topics close to raising awareness of global pollution. And everything not only holds together, but also works very well, so much so that in the last few days, without even realizing it, at every break we found ourselves on its colorful and dangerous tracks, firmly gripping our Nintendo Switch (we reviewed the title here, but it is also available elsewhere, for example on PC via Steam). Our review of Funtasia follows, but don't push too hard - you'll need some time to fully understand the value of its strangeness. Plot: ran at breakneck speed against the waste of the Apocalypse A day of normal administration in that of Funtasia The plot of Funtasia is so crazy that at some point it comes full circle and starts to make sense. The eponymous planet was once very colourful, green, luxuriant, and was also home to many anthropomorphic animals. But one day the waste problem became overwhelming: to avoid local pollution, it was decided to send it into the open space - so what could have happened? Instead, cosmic rays hit the garbage creating monstrous shape-shifting beings, endowed with just enough reason to make them dangerous. So now the world is threatened by the waste of the Apocalypse: the horrible-looking (and equally smelling) creatures unpleasant) have returned to Funtasia seeking revenge. What to do? A brilliant scientist has seen fit to build four-wheeled vehicles capable of sweeping away pollution in a strong way; thus begins the battle between the self-propelled animals and the cosmic junk. If the premise of the production appeals to you, know that everything else is even better. Are Funtasia waste scared? And that's still nothing The structure of the title is in fact in a certain way bipartite. In total there are ten levels - one for each biome, and each characterized by a specific animal, equipped with an equally personalized vehicle. The levels, however, have two different moments: in the first the player must ~simply~ reach the finish line by overcoming all sorts of obstacles, and accumulating material to upgrade his car in the garage, between one game and another; in the second, the actual boss fight of that biome begins. Which can be a creature capable of shooting laser beams empowering itself with discarded syringes (medicine waste) or a grotesque giant child capable of (literally) throwing up real atomic bombs. Gameplay: Speed and lots and lots of balance Funtasia is a remarkably atypical two-dimensional racing game. It is clear that that little car must run from the beginning to the end of the course, reaching the finish line as quickly as possible: but we must take into account, at any given moment, such a vast series of variables in the gameplay, that we would not hesitate to deviate the production from the generic ~arcade~. At times Funtasia is closer to a puzzle or platform game than anything else. First of all, the little car is very delicate: just the slightest pebble on the road to make it skid, wheelie or overturn, let alone the real overhangs scattered along the way. Furthermore, each vehicle is equipped with a battery placed on its upper part: if the latter collides with the environment, the car immediately explodes, causing game over. As well as falls into the void, or the simple consumption of all available fuel. The player therefore does not only have to run to the finish line: he must always keep the vehicle in balance, using the left stick of Nintendo Switch; he must calculate the friction on the climbs and the acceleration on the descents well, to avoid getting stuck or ending up in the void; must avoid battery collisions; must collect objects along the way, sometimes essential to get around a certain obstacle (for example the bonus linked to the high jump, marked bya yellow arrow); all of this, often, at the same time. And don't trust the difficulty levels reported for the game worlds: our experience has taught us that Funtasia is a difficult title. Immediate, fun, highly replayable: but difficult. Maybe that's why it works. Funtasia is fun but difficult: you have to learn its mechanics well to get satisfaction The presence of the multiplayer mode both in local cooperative and in online competitive has sincerely amazed us: partly because contained productions of this type usually do not have the resources to project themselves even on anything other than the single player, and partly because Funtasia in itself it didn't seem like that kind of title ported to online. Instead, everything works: simply several vehicles start together from the start, and - to the best of four routes - the player who scores the best time overall wins. Finally, the artistic direction is really valuable. Of course, you may or may not like the style, but it is undeniable that it manages to perfectly convey that sort of ~cartoonish-grotesque~ that was so fashionable in the eighties and nineties (the more elderly will perhaps remember the Sgorbions, we are there with the inspiration). Among other things, the style is the result of the work of an Italian artist, Emanuele Olives, who seems to have been inspired by Heinz Edelmenn (Adventure Time and Troma). Overall, and here we really close, on Nintendo Switch we have not encountered slowdowns of any kind, indeed the vibration system of Nintendo Switch has always perfectly returned the situations in which we found ourselves, favoring - as far as possible in a racing game experienced not on real roads but on consoles - the immersiveness.", "date": "2022-10-09", "grade": "8.0"}