{"name": "MOBA in miniatura", "ref": "https://multiplayer.it/recensioni/164886-clash-royale-moba-in-miniatura.html", "text": "Managing a success like the one achieved by Supercell isn't easy, given that we're talking about a catalog of titles that are played every day by one hundred million users. Situations of this kind often lead to the inability to abandon the initial concepts for fear of taking a wrong step, endlessly recycling formulas which, however, at a certain point, inevitably end up tiring. Well, that's not what happened with Clash Royale, given that right from the start the game offers an alternative vision to that of the very popular Clash of Clans, in this case a gameplay very similar to that of MOBAs, albeit with particularly small dimensions. One could almost speak of a sort of ~strategic diorama~, with the action developing within a small two-lane map; and which, precisely because of the reduced extension of the scenario, has precise implications on the artificial intelligence of the units, which can attack the invading enemies or reach the towers of the hostile faction depending on the distance and individual peculiarities. Having completed a brief tutorial on the mechanics, the game immediately starts the matchmaking for quick one-on-one battles online in real time, therefore not in asynchronous mode, in which our goal is precisely to destroy the enemy castle, passing possibly for the two towers that surround it, but trying to prevent the hostile army from reaching the same goal before us. Clash Royale offers a dry, simple and intuitive multiplayer experience, but not trivial for this Who do you throw from the tower? The Clash Royale interface is very simple and well designed, with a main menu that allows you to start an online battle, open up to four chests earned with as many victories, manage your units (choosing which ones to insert in the ~deck~ and upgrading those who have reached a certain level), access the clan menu (with a variety of social implications) and watch an integrated TV with replays of the best matches. Let's immediately address the question of the freemium model, whose limits materialize precisely in the management of the aforementioned boxes: the opening of each box takes from three to twelve hours, unless you use the gems to speed up the times, but having available only four slots it is clear that once filled you will have to wait to avoid making clashes without being able to collect prizes. A couple of indicators at the top of the screen remind you of the arrival of free chests and take into account our degree of experience, which together with the number of victory points will determine whether or not you will access a series of extra arenas. Unfortunately, to unlock even just the second scenario, many hours of play will be needed: as a choice, it seemed a bit questionable to us. Beyond this, there is a great variety in the units available: from those specialized in melee (princes, knights, robots) to those who attack from a distance (archers, riflemen, bombers, spear-wielding goblins), passing through the special shots (the swarm of arrows, the ball of fire) and the giants, who thanks to their size protect other soldiers as they approach the towers, damaging them with powerful punches. The touch control system sees us place the characters in our half of the map and leave them free to proceed towards the closest objective, alternating the cards and the possibility of summoning them based on the energy of action, which is continuously recharged in the part bottom of the screen. In the end, despite the small size of the whole experience, the strategic substrate of Clash Royale is evident and creates the typical enthusiasm of those ~one more game and I'll stop~ mobile games, which was precisely the intention of Supercell . Too bad for the lack of further facets, because after a few hours the repetition of the same mechanisms gets a bit boring.", "date": "2016-03-10", "grade": "8.2"}