{"name": "Sangue e arene", "ref": "https://multiplayer.it/recensioni/164475-mortal-kombat-xl-sangue-e-arene.html", "text": "The Mortal Kombat series seems to have found a second youth thanks to the work done in recent years by NetherRealm Studios, a team capable of bringing it back to great levels in the field of fighting games. As we have repeatedly emphasized on these pages, the merit of the US developers was to retouch the original structure without however overturning the concept that has always been the basis of the brand too much, effectively managing to combine graphics that exploit the third dimension with an excellent gameplay, anchored to the more traditional expression of the fighting game, with a pinch of fan service and a significant dose of violence. Precisely on these bases NetherRealm Studios offers fans an expanded and more complete version of its Mortal Kombat X, awarded last year by sales and critics (it was elected Best Fighting Game at the 2015 Game Awards). This edition of the game, called XL, in fact adds to the content already available in the normal one, all the character packs, costumes, moves and various abilities released during the last season through a series of DLCs, plus other goodies and the return of a history of the series, which, however, we will talk about later. Mortal Kombat XL brings back the best fighting game of 2015 in a definitive version All purchase options Those who already own a copy of Mortal Kombat X on PlayStation 4 and Xbox One can buy the Pack XL which, at the price of 24.00, will give them access to Kombat Packs 1 and 2, and therefore to all the digital contents of the edition XL (characters, Fatalities, skins). Those who previously purchased Kombat Pack 1 can instead buy only Kombat Pack 2 for 19.99. Finally, the full game can be purchased for 59.90 on the Xbox and PlayStation stores. Curiosity Triborg is the only character on the roster to have four combat variables available: each one emulates the style of a character from the saga, specifically Cyrax, Sektor and Smoke. The fourth style, that of Cyber Sub-Zero, is instead secret and can be selected from the character selection screen through a simple combination of keys (Up, Up and then Y), until Triborg turns blue. Big, thick and bloody The Mortal Kombat XL roster is quite large and offers all the characters of the original title, namely Johnny Cage, Sub-Zero, Mileena, D'Vorah, Takeda Takahashi and Erron Black, just to name a few, plus all those who were were only made available as extra content within various packs. We are referring to Goro, Tanya, Tremor, Triborg and Bo'Rai Cho, coming from various episodes of Mortal Kombat, plus four wrestlers from as many film sagas: Jason Voorhees from Friday the 13th, the Yautja from the film Predator, the Leatherface ) and the xenomorphic alien protagonists of the Texas Chainsaw Massacre and Alien series respectively. Each of them, like every element of the cast, is present with various alternative costumes, Fatalities, Brutalities and three different fighting styles (four in the case of Triborg) which vary their combos, special moves and sometimes even their versatility. In this way, gamers who prefer to use a specific fighter do not need to resort to another character to try a new fighting style or to use one that is more functional in a given match, given that they can access different sets of moves than those classics of their favorite. Not to mention the fact that in this way the phenomenon of counterpicking is limited, to the benefit of a gameplay that obviously maintains the structure of the original title. This is characterized by a style strongly anchored on a certain spectacularity and speed, even if it doesn't disdain to give technicalities to those who are willing to dedicate a little more time to it and who like to play it at more advanced difficulty levels. Everything is then corroborated by a massive dose of violence tending to caricature, and by a series of other factors that embellish the mechanics by giving it a fair depth. Physics undoubtedly plays an important role among these, definitely capable of restoring the sensation of giving and receiving real blows, as well as controlling now massive, now more agile bodies, depending on the size of the character. Similarly, the implementation of running gives players the opportunity to try new ways in approaching certain phases of the match, and in trying new combinations of moves. Provided you don't abuse it, given that every time you take the appropriate resistance meter it drops dramatically. To make the experience more complete, there is also the possibility of interacting with some elements of the scenario, which canor be used to your advantage by pressing R1 when they light up. For example, in the Dead Forest it is possible to cling to the branches to swing and try to gain momentum for an attack, use them to climb over the enemy and escape one of his combos, or detach them from the trunk and use them as a melee weapon. In other scenarios it is even possible to grab and throw a poor old woman or a monk at opponents. These gameplay elements, introduced (or reintroduced) with Mortal Kombat X, are joined by all the more traditional ones, from the devastating X-Ray, attacks that can be activated after filling the appropriate indicator with which to reduce the vital energy of a challenger by breaking literally the bones, to the Brutality, to be performed in particular conditions to mutilate the now annihilated opponent, and thus immediately put an end to the fight. Equally violent are the Stage Brutalities, to be performed by exploiting some elements of the scenario to carry out a final blow, and the inevitable Fatalities, which in particular cases allow the winner to wreak havoc on the defenseless body of the opponent, with often out of his mind solutions. In this sense, just think of Johnny Cage who opens his opponent's stomach and imitates Jack Nicholson in a scene from the film The Shining, or his daughter Cassie who takes a nice selfie with the defeated body. Those of the film characters were also particularly successful, with sequences that wink right at the key scenes of their films, from the alien Queen Mother who grabs the opponent of her xenomorphic companion from above and from behind by piercing him with her tail, to Leatherface who having fun with the chainsaw. Mortal Kombat XL also offers Stage Fatalities, final moves related to the environment where the fight takes place. These are present in three arenas, namely Il Kovo, The refugee camp and the old, dear Fossa (The Pit), the latter to be downloaded for free together with the medieval Skin Pack. In short, as they say in these cases, there are so many elements to make meetings always different and exciting, and the fans will hardly have anything to complain about. Tower Challenges In our examination of the NetherRealm Studios title, we have not forgotten the game modes, which are many and different enough to keep gamers busy for a long time. Starting with the compelling and cinematic Story mode, where a logical sense is given to the presence of old and new wrestlers on the roster. All this takes place through a story in which the user plays several characters, and where the battle sequences are interspersed with videos that tell the events as if it were a film, complete with interactive scenes with the classic QTEs. A ~film~ not very long to tell the truth, given that you can finish it in just over two-three hours net of the game and a few too many deaths in terms of difficulty Difficult, but equally beautiful to experience and well designed, considering that basically we are talking about a fighting game and not an adventure title. Equally valid are the modes related to the Towers, such as the Traditional ones, within which it is possible to select five different types of ~competitions~, including the one called Klassic which refers to the traditional arcade climb, or the inevitable skill tests on strength and luck , complete with random modifiers to condition its progress. Too bad the tower with the 300 challenges, a fan favorite of the series, is missing. In any case, a sort of evolution of the aforementioned challenges is certainly Living Towers, where the game conditions are dynamic and are periodically and automatically updated via the internet connection. Within this mode, in fact, as in the other, you can choose to face a series of tests of variable difficulty, where each battle is accompanied by modifiers that alter the battle conditions, such as those that slow down time or the speed up, or those that make players immune from being knocked down, that poison with every hit, that start a round with penalties or advantages, and so on. But compared to the ~normal~ one it is possible to do it in three different towers, each of which has different updating characteristics: there is in fact the hourly one, the one that does it once a day and the other main one that changes weekly, perhaps at some special event organized by the developers. World War For the rest we have the classic one-on-one matches choosing between classified, friendly and private, or in teams, and King of the Hill. Still on the subject of methods related to online, also confirmedhe in this edition of the game that of the Factions, in which users can choose to be part of one of the five groups available in the game, namely Black Dragon, The Brotherhood of Shadow, Lin Kuei, Special Forces and White Lotus, with the possibility to contribute to its success through a series of performances based on the achievement of certain objectives during both solo and group matches. At the end of the week a winner in the Faction War is then determined based on the points that have been accumulated, and in return the gamer receives special rewards related to the faction to which he has joined, including exclusive finishers. Finally there is the Krypta, the interactive environment where you can unlock costumes, moves and much more with the gold tokens acquired by winning matches in the other modes, plus the presence of particular secret trunks that appear inside only in certain moments, and that the player must be able and lucky to cross and open in time. Moving on to the technical part, Mortal Kombat XL confirms the good things we had already tasted in its previous incarnation, despite the fact that on a graphic level it does not cry out for a miracle. The characters are well modeled and characterized, including the newcomers, with the appearance that changes a little depending on the fighting style adopted, or totally in relation to the selected skin, even if some seem more inspired than others in terms of design . In the same way, the scenarios offer a good level of detail, apart from some textures that are a little too simple in certain points: there are variations of some areas, however, that are truly suggestive thanks to the skilful use of lights, shadows and atmospheric effects, such as the whipped Kovo from the waves of the stormy sea, with a vessel stranded among the rocks and corpses splashing out of the water, or the Dead Forest at night, with wolves running around in the backlit background, and an almost magical atmosphere. In the same way, the audio sector is confirmed as excellent both in terms of audio effects and for the soundtrack, characterized by a series of tracks belonging to various musical genres, each of which is able to adequately ~accompany~ the various meetings. The work done by the technicians on the Italian dubbing is also commendable, for the most part well recited even during the fights, with the exception of some ~stonacing~, as in the case of Cassie Cage's voice, which did not convince us too much in terms of tone and acting.", "date": "2016-03-04", "grade": "9.0"}