{"name": "Taito Legends 2 - Recensione", "ref": "https://multiplayer.it/recensioni/taito-legends-2-recensione.html", "text": "In this second phase of the rediscovery of the videogame ~vintage~, Taito could not miss the appeal, the Japanese software house that dominated the market from the end of the 70s (Space Invaders tells you something?) for over a decade. A few months ago, gamers already had the opportunity to get their hands on Taito Legends, the first collection of old-time jewels from the house of New Zealand Story, Bubble Bobble, Rainbow Island and many others, and now the time has come to present this second chapter. in this second phase of the rediscovery of the videogame ~vintage~, Taito could not miss the appeal 40 pearls or almost Let's immediately discover the complete list of titles present in Taito Legends 2. You will have at your disposal the following coin-ops ranging from the end of the 70s to the first half of the 90s: Alpine Ski, Arabian Magic, Bonze Adventure, Cameltry, Chack'n Pop, Cleopatra Fortune, Crazy Balloon, Darius Gaiden, Don Doko Don, Dungeon Magic, Elevator Action Returns, Football Champ, Front Line, Gekirindan, Grid Seeker: Project Storm Hammer, Growl, Gun Frontier, Insector X, KiKi KaiKai, Kuri Kinton , Legend of Kage, Liquid Kids, Lunar Rescue, Majestic 12, Metal Black, Puchi Carat, Puzzle Bobble 2, Qix, Raimais, Rastan 2, Space Invaders 95, Space Invaders DX, The Fairyland Story, Violence Fight, Wild Western. Also in the PlayStation 2 version will be found exclusively Balloon Bomber, Ray Storm, G Darius, Syvalion while only in the PC and Xbox versions will Bubble Symphony, Cadash, Rayforce and Pop 'n Pop be placed. As written to mark this paragraph, Taito Legends 2 presents as many as 40 titles, a number decidedly above the average of this kind of compilation, even if not all of them are shining episodes of videogame production made in Taito. On the other hand, however, it must be said that the ~goodies~ are not lacking, starting with the legendary Football Champ (how many tokens spent in the arcade to win the world championship...), the very special Cadash role-playing game, the very nice Liquid Kids and KiKi KaiKai, for then move on to some fundamental titles of videogame ~prehistory~ such as Lunar Lander, Crazy Baloon and Qix. TL2 fills all the shortcomings of the first episode by offering us, for example, the various sequels released over the years of Space Invaders and also the sequels to Rastan, Bubble Bobble and Elevator Action. but the best news comes for lovers of shoot'em up and puzzle games But the best news comes for lovers of shoot'em up and puzzle games. For the former, Taito Legends 2 presents an excellent selection of horizontal and vertical scrolling shooters both of rather famous names (starting with Darius) and less, but all of high quality with gameplay still up to par even at a distance of many years. Puzzle lovers, on the other hand, will be able to delight in an equally good number of titles, moreover these are the more recent ones such as Cleopatra Fortune and Puzze Bobble 2; the latter an absolutely timeless game. Goodies As with the first chapter, Taito Legends 2 has also been treated excellently in every aspect. Not only has nothing of the original titles been lost in terms of number of players, saving of high scores, but there is also the possibility of viewing the games with the original dimensions (alternatively we can play them in adapted full screen or with horizontal black bars /verticals). Moreover, there are various ~goodies~ such as some scans of the advertising pages of the titles present. We will thus also be able to observe how over the course of 20 years, videogame advertising has completely revolutionized itself Cross-platform Taito Legends 2 can be enjoyed by PlayStation 2, Xbox and PC users. In the review we have already listed the games available, four, exclusively on PlayStation 2 and those present only in the Xbox and PC versions. The other difference concerns the on-screen display. In fact, on consoles, since the TV has a lower resolution, the low res of the coin-ops is less noticeable than on a PC monitor despite the fact that antialiasing can be applied for this version. With regard to the PC format, on large monitors (test carried out on a 23-inch one), the lack of full-screen display with a black space on the right side of the screen is negative. Final comment Beyond the emotions that can be felt in reviewing on the monitor so many titles that have marked the childhood of the oldest players, Taito Legends 2 undoubtedly has great historical value and for lovers of puzzle games and shoot'em ups, there are many titles still fresh from a strictly playful point of view. The only regret, beyond a few small ~technical~ problems on PC, is that the two chapters of Taito Legends would beI could have been a single large collection with all the seminal history of the Japanese software house while in this way authentic pearls are also mixed with already mediocre products at the time of the first release. Despite everything, we are certainly faced with a retrogaming compilation above the average in terms of quantity and above all quality. Pros All the tradition and prestige of Taito Quantity and quality above average As a godsend for lovers of puzzles and shoot'em ups Cons Some titles present were already mediocre at the time of their release With only one Taito Legends could be included all true legends A few display problems on PC Once upon a time Once upon a time there was the Internet at 14.4 and 28.8kbps, a virtual network in its infancy, without rules. Once upon a time there was the Napster phenomenon and the free exchange of songs, once upon a time there was the digital Far West and the phenomenon of retrogaming, i.e. the diffusion of thousands of videogames from the past decades that can be easily downloaded and played on PC with the help of emulators (the MAME in primis). Once upon a time but all this is long gone: the web has become a means of communication of equal importance and diffusion (if not greater) than traditional media and with precise rules. And so the retrogaming phenomenon has returned to the hands of its legitimate owners, the software houses, which have flooded the market with more or less successful compilations of games from the past.", "date": "2006-03-29", "grade": null}