{"name": "Valkyrie Elysium", "ref": "https://multiplayer.it/recensioni/valkyrie-elysium-recensione.html", "text": "Maybe one day Square Enix will explain to us his obstinacy in reviving old classics, allocating tight budgets and releasing them in the worst possible times. Because if you want to test a potential market and develop a new game on the cheap, it shouldn't surprise you that not only the fans are disappointed, but also the players approaching the series for the first time. And the case of Valkyrie Elysium is even more controversial, given that Soleil Inc., which developed it instead of tri-Ace, has distorted the original JRPG formula to switch to a fully action drift. A few days ago we told you about Valkyrie Profile, a cult but niche series that continued for some time before falling into oblivion and resurrecting after almost fifteen years. In the review of Valkyrie Elysium we explain why, although the sequel is so different from the original, in the end it turned out better than we hoped. Low budget Valkyries The protagonist of Valkyrie Elysium is a... Valkyrie If you thought that Valkyrie Elysium would continue the story begun in 1999 by Valkyrie Profile: Lenneth, we fear you will be disappointed. With the exception of some more or less veiled references to previous titles, Valkyrie Elysium is a completely autonomous product, and this is good for those approaching the series for the first time. The premise is very simple: with Ragnarok upon us, Odin creates a new Valkyrie to save the mortal realm. To tell the truth, at the beginning, the dimension of this threat and the purpose of the protagonist are confused and opaque, despite the fact that the story is linear and conducted by kinematics and dialogues written in Italian and spoken completely in English (but it is also possible to choose the Japanese dub). The story is in fact rather bland, but it improves markedly towards the end of the game, when the knots begin to come home to roost and the narrative picks up pace. What then, between time travel and reincarnations, no Valkyrie Profile has ever had an extraordinary narrative, mind you, but the problem with this new Elysium lies entirely in what is usually defined as ~world building~, that is, a set of written and unwritten details writings that contextualize the plot and give it meaning. Valkyrie Elysium entrusts everything to the aforementioned kinematics and to the ~flowers~ that we can collect in the various chapters and which represent the thoughts of the mortals who have lived in those places. Putting these reflections together, the circumstances and the background that led the Valkyrie to the place are better understood, but it is a little game that does not work as perhaps Soleil Inc. would have wanted and the spectral flowers take on a simple collectible role in a few moments which is very less noble. Valkyrie Elysium, the game is divided into chapters or stages The Einherjar, that is, the spirits of the valiant warriors that the Valkyrie will meet on her path, and who will join her in her mission, once again think of peppering this lame narrative. Although it is necessary to complete some side missions to unlock their memories, and learn more about the background that led to their deaths, these characters are well characterized and guarantee a satisfactory level of interaction both in the cinematics and in the actual gameplay, giving the a welcome choral plot. It is clear that the limited budget is felt above all in the presentation. If the direction does what it can to restore a certain solemnity to the narrative, the overall technical framework is little more than sufficient. Valkyrie Elysium is not a bad title, and has several arrows in its bow that can counter the hyperbole that has been read on the Internet since the first trailers: the 3D models, for example, are detailed and animated more than decently, with good texturing which brings out every detail, net of the questionable accentuated contour, which you may or may not like. Valkyrie Elysium, the Valkyrie can wield different types of weapons Let's just say that everything else screams old-gen. Valkyrie Elysium also comes out on PlayStation 4, and this results in a number of compromises and limitations that we also felt in our PlayStation 5 version of the software. If the almost total absence of NPCs is justified by the ghostly flowers mechanic, and the compartmentalization of enemies is quite typical of action titles of this ilk, it is more difficult to turn a blind eye to a generally washed-out color palette, a level of environmental interaction to a minimum and some more or less evident slowdown, especially when multiple Einherjar are deployed simultaneously between attacks, spells and enemies on the screen. Even the soundtrack is without infamy or praise. It sure isevocative, but far from memorable. The English-language dubbing is instead of excellent quality, although the lip-synching leaves something to be desired in most of the cinematics. But the mere fact that the game has not been translated into Italian makes it clear how little Square Enix has invested in this revival of Valkyrie Profile. Norse fighting Valkyrie Elysium, the Einherjar will help us in battle Absurdly, Valkyrie Elysium excels precisely in the aspect that most distances it from the rest of the series. Unlike the previous Valkyrie Profiles, which while atypical were still Japanese RPGs with turn-based combat, the new sequel is a third-person action game, divided into chapters, which can be accessed from a central hub. Each chapter takes place in a large map that develops horizontally and vertically. Soleil Inc. has worked well on the general level design: the progression is highly linear and there are very few alternative paths that lead to the set goal, but the presence of chests, flowers and collectibles, hidden more or less everywhere, pushes you to explore every corner of the scenario. Usually you deviate from the main path for a few moments and then always return to it, but exploration is not at all obvious and some collectibles can easily escape sight, forcing us to repeat the chapter to find everything. Valkyrie Elysium, the Arts can weaken susceptible enemies The completion percentage does not seem to determine the multiple endings, which rather depend on some choices made in the very last bars of the game: Soleil Inc. gives the player all the tools to strip Valkyrie Elysium in a single game, without New Game+ or other amenities that could can also be added at a later date via DLC or free updates, but which at launch simply aren't there. In this sense, Valkyrie Elysium is a really straightforward action game, which can be completed in barely twenty hours even solving most of the side missions. The latter are managed intelligently: they are unlocked by interacting with the wisps in the chapters and are therefore added to the selection screen of playable stages in Valhalla. At that point, the game only loads a segment of the already completed chapter, repositioning objectives and enemies to scale back an otherwise annoying sense of dj-vu. Valkyrie Elysium, the Soul Chain allows you to reach distant enemies in an instant In a game of this type, where you fight continuously from start to finish, the problem of repetitiveness is always around the corner, but luckily Valkyrie Elysium is supported by a very good combat system, which is ironic considering the origins of the series. The demo released a few weeks ago and which allowed you to complete Chapter 1 and then import your save data into the final game, was purely indicative: within a few hours Valkyrie Elysium grants the player a variety of tools, weapons, combos and features that they totally overturned our tepid expectations. Let it be clear that Valkyrie Elysium is neither Devil May Cr nor Bayonetta, much less Dark Souls. The combat system is more chaotic - mainly due to an often inaccurate camera - and lacks the perfection in the collisions and hitboxes that characterize the titles of the most experienced and noble developers. However, it works great and it's pretty darn fun. Valkyrie Elysium, the combat system is really fun The dynamics that embellish it are really many to mention them all, so we will focus on the most important. Keep in mind that the Valkyrie begins the adventure with a sword and a handful of combos that mix the two standard attack types, but over time she unlocks additional weapons that have different characteristics and utilities, which can be equipped in two different slots to swap them at any time. Each weapon is characterized by a degree of competence that improves with use and which allows you to spend the gems accumulated in the chapters in a progressive upgrade that not only increases the basic stats, but also the combos on the ground and in the air that the Valkyrie can unload on unfortunate enemies. The same gems also serve to unlock a whole series of passive bonuses and secondary skills that the game divides into three categories: Attack, Defense and Support. These talents expand the combat system even further, introducing mechanics such as counterattacks, perfect dodges and parries, Soul Bursts, final blows and so on. Valkyrie Elysium, you don't need to play the previous ones to understand the story To all this they addor some features that, once mastered, give the combat system a much more interesting level of technicality. The Soul Chain is a simple movement maneuver that allows the Valkyrie to quickly reach distant enemies while dodging or interrupting their attacks. The Arts, i.e. the spells, which are unlocked by finding the tomes in the chests, can be equipped up to four at a time: they consume the charges of an indicator that fills up with combos and have unique characteristics. Some Arts pursue enemies, others attract them to the Valkyrie, still others restore the protagonist's vital energy. Each spell has a specific element - fire, lightning, earth, and so on - which consumes a gauge above targets that have it as a weakness. Once this indicator is reset, the enemy is induced into the so-called state of Elemental Crush: paralyzed, he will take much more damage from each attack. Valkyrie Elysium, in deserted cities we will find ghostly flowers But there's more. There are the Einherjar. Once these spirits have been encountered and enlisted, up to four of them can be equipped, one for each face button on the controller. The Valkyrie can also call them all together, as long as the appropriate indicator of the Soul Gauge allows it, and at that point each Einherjar will persist on the battlefield for a certain amount of time, attacking the enemies in concert with the protagonist. Einherjar also serve to solve simple environmental puzzles, their utility in combat is very important: not only can they attract the attention of enemies and keep them busy, but they also give the Valkyrie's weapon their elemental powers. By choosing the right Einherjar, it is therefore possible to consume the enemy elemental weakness gauge more quickly and induce the Elemental Crush condition sooner. Valkyrie Elysium, the stages develop both horizontally and vertically By putting all these mechanics together - which are not finished: there would also be Runes, consumables and more - you get a solid combat system, which gradually develops the complementary features, without overwhelming the player right from the start, but indeed accompanying him in the discovery of every possibility. The goodness of the gameplay alleviates the sense of repetitiveness we mentioned earlier, but it is clear that Valkyrie Elysium remains a monotonous action game for its entire duration. However, not being particularly long or complicated - which is different from complex, mind you - the title developed by Soleil Inc. completes itself with pleasure. Perhaps a more traditional RPG would have been better, but we feared disaster and instead archived it with average satisfaction. Update: a previous version of the article incorrectly reported that the game's texts were in English. We have updated the review to correctly report the presence of texts in Italian.", "date": "2022-10-05", "grade": "7.5"}