{"name": "A spasso con Michonne", "ref": "https://multiplayer.it/recensioni/163996-the-walking-dead-michonne-episode-one-in-too-deep-a-spasso-con-michonne.html", "text": "Few other works have been as adept at stepping outside their original entertainment genre as The Walking Dead. Beyond its undoubted quality, the comic created by Robert Kirkman's pencil has become a global success also taking advantage of the springboard offered by the television series of the same name, which was followed by various creations from the videogame world. As we recalled in a special published a few days ago, the adventures of Rick Grimes and his group have in fact lent themselves to this area on several occasions, above all thanks to Telltale Games which has exploited the setting to put us in the shoes of Lee and of little Clementine. Waiting to publish the actual Season 3 of The Walking Dead in this same 2106, the San Rafael-based studio is back at work to dedicate itself to one of the most loved characters by fans of both the comics and the TV series: Michonne . So here is our review of In Too Deep, the first of the three episodes scheduled for fresh release. Katana or machete the result doesn't change: Michonne slices zombies in The Walking Dead! Sea zombies The Walking Dead: Michonne marks the first time we find ourselves in the role of one of the protagonists of the main story in a Telltale video game. Although in the past it happened to meet some of the key characters, our virtual alter ego had in fact always been a specially created character, whose story intertwined with that of the comic books in a marginal way. The miniseries on Michonne instead goes to fit into a very specific moment of the narrative, namely the one between the books number 126 and 139 of the American comic, in which the woman famous for her skill with the katana comes out of the story about Rick and company. This is actually a point where the series broadcast by AMC has not yet arrived, but don't worry because at least in this first episode there are no particular spoilers. While telling what happened to Michonne in the interval of time spent away from the other survivors, the Telltale miniseries actually focuses on the conflict experienced by the character and on her history prior to the zombie invasion, rather than on the events immediately preceding the separation from the group. Things are made quite clear during the opening scene of the game, in which Michonne is shown in the middle of a kind of daydream, where she finds herself fighting against some zombies while being attacked by feelings of guilt for the disappearance of the his two daughters. An element that he will carry with him throughout the rest of the first episode and let's imagine even further, after having met one of the new adventure companions with whom he will embark on a journey by sea right in this initial phase. Is the first good? Given the strongly narrated nature of Telltale productions, we will not go further on the details of the plot, limiting ourselves to talking about its development in general. The first episode of The Walking Dead: Michonne performs more of an introductory task, however necessary despite the fact that it is dedicated to one of the best-known characters of The Walking Dead. The goal is in fact to show us the ghosts from the protagonist's past, tormented once again by the anguish of having lost what was most dear to her in her life. Especially during its first part, In Too Deep doesn't actually disdain to put us in front of a series of action scenes with the inevitable zombies, proposed to the player through the use of quick time events. However, a component that this first episode of The Walking Dead: Michonne ends up abusing, once again revealing the side of those who criticize the playful aspect of Telltale-branded productions. When the boredom of repetitiveness is about to take over, fortunately things also start to move from an emotional point of view: it is no coincidence that it happens when the zombies step aside, to make room for relationships between human beings. The second part of In Too Deep slips away in a much better way than the first, involving the player in a series of dialogues that leads up to the inevitable open ending with an attached twist. Also thanks to the duration of less than two hours, it must still be said that there are no particularly memorable moments, but at least this bodes well for the second episode. Before leaving, let's take a quick look at the technical aspect: The Walking Dead: Michonne graphically takes up the same comic style known during the first two seasons created by Telltale, while as regards the audio we note the presence of Samira Willey (Orange is the New Black) as Michonne. We also point out the total absence of support for the Italian language, even for subtitles. In conclusion, after this first encounter with The Walking Dead: Michonne, we would like to recommend In Too Deep only to the most avid fans of its protagonist and to those who don't want to miss even a Telltale adventure. Instead, we invite all the others to wait at least for the considerations on the second episode, before proceeding with the purchase also because in this case it is only possible to purchase the entire season pass for  14.99 and not the individual episodes.", "date": "2016-02-24", "grade": null}