{"name": "Shadow Blade: Reload", "ref": "https://multiplayer.it/recensioni/163869-shadow-blade-reload-la-ricarica-del-ninja.html", "text": "The case of Shadow Blade is quite curious: released in 2014 on the App Store and Google Play, the game received a tepid reception overall (as confirmed by our review) but still managed to make its way up to the following year remastered for PC that improved some features of the original while also adding some content. Now, this revised and corrected version lands again on the familiar shores of the iOS platform, trying to remedy the many shortcomings of the original: let's see if it's a worthy initiative or a cold commercial operation... Shadow Blade: Reload tries to monetize the most with a decidedly lazy conversion Kuro kuro equaled Unfortunately, it is evident from the outset that Shadow Blade: Reload belongs to this second category, to the point that it doesn't even try to hide the fact that it is a very trivial direct port of the PC version without any semblance of optimization for use via smartphones or tablets. Otherwise, the decision to adopt a graphic layout characterized by elements that undoubtedly made a good impression on a computer monitor, while here they prove to be microscopic and difficult to distinguish: from the characters on the screen to the indicators up to even the selection keys, cannot be explained. of the menus (memorable in this sense the list of challenge scenarios, taken paro paro from the PC version and simply impossible to manage without a mouse), everything is really too small especially if you play on an iPhone. Worse still, the application settings only allow you to adjust the sound, cutting out all those options that have now become a standard for any self-respecting mobile product such as customizing the control system and changing the size of the virtual keys. In short, the developers' intent to monetize at almost zero cost is clear, and it wouldn't even be too regrettable if it weren't for the absurd price assigned to the product: 4.99 Euros for a two-year-old game, converted into four and four eight and with a quantity and quality of content far inferior to many titles sold for the same amount is something that is simply neither in heaven nor on earth, especially considering that the original Shadow Blade was (and is still) available on the App Store for 1.99 Euros. It must be said that the changes to the play structure are there, but they do not justify such a surge in price: like the identical PC counterpart, this Reload version also has a more in-depth story - so to speak - narrated through pleasant comic-style tables , expanded levels, new boss battles, some gameplay filings (concerning for example the use of shurikens) and the aforementioned challenge scenarios. However, the heart of the experience remains the same, with the user having to reach the end of the level in the shortest possible time, trying to collect all the collectibles and avoiding dying to maximize the score. The control system is reconfirmed as precise, and the game action is more striking for its speed than for actual merits, given that the platform component offers nothing that has not already been covered a thousand other times and the fights are reduced to a mere question of timing. Shadow Blade: Reload, in essence, fully confirms the positive and negative aspects that we had already highlighted at the time of the review of the original, with the aggravating circumstance of the evident laziness in the conversion process and a positioning in a range of price in our opinion absolutely not fair.", "date": "2016-02-22", "grade": "6.3"}