{"name": "Arriva il divertimento", "ref": "https://multiplayer.it/recensioni/163721-rocket-league-arriva-il-divertimento.html", "text": "If you don't know Rocket League, the only case that sees you justified is the one in which you have spent the last few seasons in the shadow of a rock on Mars. As owners of Xbox One, you may also have decided to completely ignore its existence, given that the Psyonix title arrived last July only on PC and PlayStation 4. Very quickly, Rocket League was able to leverage its mechanics extremely simple to become a point of reference in online gaming, above all thanks to the ability to offer players seemingly simple and immediate entertainment. A wink to the world of eSports did the rest, allowing the sequel to Supersonic Acrobatic Rocket-Powered Battle-Cars (fortunately they changed the name!) to apply among the most interesting releases of the whole of 2015. The success of Rocket League has meant that even Xbox One owners were clamoring for its arrival on their platform: if we are here today it is because Psyonix has decided to please them, so we just have to start the engines and see what happens. there is in this version. The wild fun of Rocket League is finally coming to Xbox One! All in one For the benefit of those who have been involved in the Martian retreat, let's remember that Rocket League sees us engaged in controlling a car, but not in racing on tracks or roads. The objective is in fact to throw a big ball into the opponent's goal, as we would in a football game, complete with a timer for the duration of the match and final score. A simple concept, as we said, which allowed the game created by Psyonix to immediately make its way among online game enthusiasts: for all the details, we refer you to the review of the PlayStation 4 version, instead focusing now on the innovations introduced by the developers inside of this Xbox One conversion. To make up for the months of additional waiting, the San Diego-based team has included all additional content in the base price of 19.99 euros: the same price at which Rocket League is sold on PC and PlayStation 4. In this way, it is It is therefore possible to save the money that players had to spend on these two platforms to purchase the additional packs Supersonic Fury, Revenge of the Battle-Cars and Chaos Run: 3.99 euros each, which multiplied by three makes about 12 euros. Given the competitive nature of Rocket League, it's all about new car models and decorations to put on them, but getting a few more items for free (that others had to pay for) is certainly nice. Two special cars are added to the list of contents: the HogSticker, inspired by the Halo Warthog, plus the Armadillo, coming instead from the Gears of War universe. Both titles, plus Sunset Overdrive, are dedicated to further objects with which to customize your vehicle including wheels, antennas and more. Xbox One goals Rocket League on Xbox One has a total of 44 achievements, which allow you to collect 1,000 points. As on PC and PlayStation 4, most of them are about the player's performance during the match, with epic elements like 6 goals scored in a single match or goals scored with a reverse shot. The other trophies are related to completing game modes and unlocking some customization items. Panic Button, I choose you! If from the point of view of content, the basic version for Xbox One is the most complete ever, on this platform Rocket League is presented without one of the features present on PC and PlayStation 4. In fact, players in possession of the Microsoft console cannot count on cross-play with other gaming systems: given the considerable numerical base of people who populate the servers, accumulated over the months, it is a real pity, but the impossibility of communicating PlayStation 4 and Xbox One is now known. As far as the technical sector is concerned, we can say that we are facing an excellent conversion on Xbox One, for which Psyonix has resorted to the help of Panic Button, an external team specialized in bringing games from one platform to another. The frame drops encountered at launch on PlayStation 4 were already a thing of the past on the Sony console thanks to the interventions of the developers, and fortunately even on Xbox One the game seems to hold up quite a lot. To the point that it seems difficult for the eye to notice differences from the 60 fps that Rocket League maintains more or less constantly, losing a little something only in the most agitated phases in some arenas. After the negative experience made at the launch of the game on PlayStation 4, the servers have proved to be perfectly capable of withstanding the wave of players arriving on Xbox One, eventhat if we do not know if for a real intervention on them or simply because on this platform there have been fewer people who have tried to connect all together. In fact, we recall that the game arrived free of charge for many on PlayStation 4, through the PlayStation Plus subscription. In the audio part, everything remains unchanged, including the soundtrack of the menus composed by sound designer Mike Ault.", "date": "2016-02-18", "grade": "9.0"}