{"name": "Pro Evolution Soccer 6 - Recensione", "ref": "https://multiplayer.it/recensioni/pro-evolution-soccer-6-recensione.html", "text": "When writing a review of Pro Evolution Soccer, it is possible to skip over each descriptive or caption section; by now Konami's masterpiece has reached such a high level of popularity, and its qualities have been told so many times, that it is practically impossible to find someone who has never heard of the best football video game ever made. For this incarnation on PSP we can therefore go directly to the gist of the speech, which is also what owners of the Sony laptop want to know, namely: is it worth spending your hard-earned savings on the UMD in question? The right time When Konami first brings its PES to a console other than the original PS2, the results are often at least slightly disappointing. This happened with PES 5, debut on PSP, heavily impaired by some fundamental components; and in the same way this sixth episode, in its first edition for Xbox 360, has inexplicably lost some characteristics and features along the way. Fortunately for the Japanese giant's handheld, the second attempt seems to have been the right one: PES6 for PSP is this time a robust, substantial game that has little to envy - as regards content - to the versions for major consoles. Let's start with the uploads, an authentic cross (without delight) of the laptop; decidedly improved compared to the exhausting ones of last year, so much so that now apart from the consistent initial loading everything else flows in a rather acceptable way. And then yes, the Master League has finally been included, thus guaranteeing that longevity that the 5 had not even remotely been able to enjoy. And this is already a fundamental step forward, without a shadow of a doubt. But fortunately the improvements are not finished, since the dramatic slowdowns during the beaning in the area have fortunately become only a memory; moreover, the real use of widescreen, a strong point of the PSP, brings with it a greater vision of the playing field and therefore a simpler and more effective organization of actions, especially in midfield. The commentary has instead been cut, with the exception of a few sentences on the occasion of the goals, but honestly it will be difficult to find someone who will miss it. From the point of view of content, PES 6 for the Sony laptop therefore remedies practically all the heavy flaws of the previous episode, thus managing to satisfy even the most demanding player. But the playability? Comment PES 6 for PSP is a huge step up from the frankly disappointing fifth installment. No longer crippled and limited, this year's chapter is a competent, solid, valid and rich football game that effortlessly obtains the crown of best title of the genre ever made for portable consoles. The only real weaknesses that still keep it away from the Ps2 version are unfortunately linked to the insurmountable limits of the PSP interface, which lacks some fundamental keys for the most savvy players. And it's a pity that this disadvantage has not been balanced by an online multiplayer mode, which would certainly have made the overall picture much more pleasant. But all in all we can't really complain about a PES 6 which, without surprising, brings an almost intact experience to the Sony laptop; which, given last year's disappointment, is certainly no small result. Pros A real PES, in all respects Excellent playability Very good graphics Cons The missing keys are no small burden No online multiplayer Improved but still consistent uploads Where are the keys? The effort of Konami's programmers in trying to bring an experience as faithful to the original as possible to the PSP is therefore indisputable, and for the most part successful. But where, even if they wanted to, they couldn't do anything about it is in the number of keys available on the Sony handheld, which lacks two backbones and an analog stick compared to the controller around which the game was designed and developed, i.e. the dual shock . The weight of this lack inevitably varies from player to player, based on the knowledge and depth with which he usually faces games of PES 6. However, anyone who normally makes extensive use of the functions delegated to the absent keys cannot help but suffer particularly, believing the experience is satisfying but slightly incomplete. However, if there had been an online multiplayer mode, one could have easily turned a blind eye; unfortunately, this great potential of Sony hardware is destined to remain unexpressed in this case too, allowing you to challenge a human opponent only via a local wireless connection. A last word on the graphic component, extrememind faithful to the Ps2 edition especially for the polygonal modeling of the athletes; the compromises, few, are to be found mainly in the textures on the sidelines, washed out and poorly defined.", "date": "2007-03-02", "grade": null}