{"name": "Niente panico", "ref": "https://multiplayer.it/recensioni/163570-all-is-lost-niente-panico.html", "text": "One of the most frequent scenarios in science fiction films is that of a broken-down spaceship forcing the occupants to flee desperately towards the lifeboats: the latest addition to Foursaken Media, known in the mobile sector for its successful mix of genres but which in this case takes a slightly more traveled path like that of the autorunners. Fortunately, the US team formed by the four Jackson brothers has not placed its proverbial originality in the drawer, managing to infuse All is Lost with peculiar elements capable of making it unique in its own way within the mobile offer. All is Lost puts good ideas well done on the plate, even if it's a bit short of breath Okay, panic The premises of All is Lost are undoubtedly intriguing: the player's aim is to respond to the emergency signals launched by various spaceships scattered throughout the galaxy and save the crew members who are escaping from disaster. On a strictly practical level, all this boils down to an action game in which you have to act both on the fleeing character and on the elements of the scenario to allow him to reach the coveted rescue pod. Being part of the large extended family of autorunners, All is Lost frees the user from the need to make the astronaut run on the screen (who proceeds autonomously from left to right on a two-dimensional plane) allowing him to manage everything exclusively through swipes from perform on the touch screen in correspondence with the signals that appear along the way: two pictograms indicate at which points it is mandatory to swipe up or down on the left side of the display respectively to make the character jump or roll, while the arrows that appear in correspondence with various obstacles (closed doors, mobile platforms, open flames and so on) establish in which direction to swipe your finger on the right side to clear the way for a few seconds. Simple on paper but decidedly effective in practice, also thanks to a level design which - fortunately - does not rely wildly on random generation, allowing the various stages to guarantee a constant and well-calibrated level of challenge. We therefore move gradually from the first schemes that act as tutorials to more advanced sections capable of making even expert players sweat cold, requiring a considerable quickness of reflexes in order to be completed. A peculiar feature of All is Lost then adds a nice dose of pepper to the playful action: each spaceship in fact has a certain number of crew members to save, to which corresponds a specific level characterized by a finite number of attempts to be able to complete, inversely proportional to its difficulty and to the rank of the protagonist astronaut. Therefore, the scenarios relating to the lowest grade crew are generally simpler and guarantee the user a good number of extra lives, while the stages dedicated to the commanders not only prove to be more difficult, but must be completed on the first try under penalty of permanent death of the relevant character. An aspect that adds a pleasant tinge of tension, also because in order to proceed to the subsequent phases it is necessary to save at least 75% of the occupants of the current space station. With all these beautiful cards in hand, it's a bit sad that the Foursaken Media guys didn't pay particular attention to the variety of All is Lost's playful offer, which actually proves that it doesn't have enough strong shoulders to hold up well in the long run : the levels are always based on the same elements, both from a playful and graphic point of view, with characters and scenarios that are constantly repeated, ending up debasing a little a technical achievement that is however appreciable and cured also from a stylistic point of view. Something more could have been done also with regard to the contents: after the five chapters that make up the adventure, there is nothing left to do but retrace your steps, try your hand at a trivial survival mode or aim for objectively uninteresting trophies. Not bad, however, for a free to play title that does not abound in advertising or annoying in-app purchases.", "date": "2016-02-17", "grade": "8.2"}