{"name": "Strada per la vittoria", "ref": "https://multiplayer.it/recensioni/163515-street-fighter-v-strada-per-la-vittoria.html", "text": "On the eve of the PlayStation Experience 2014, a careless Japanese employee clicked one button too many, marking the beginning of a succession of leaked information and surprises gone up in smoke that for two years would have dogged the entire communication plan around Street Fighter V Yet, already from the few seconds of that video that appeared by mistake on YouTube, one could guess the new direction that the Capcom series was about to take. If with Street Fighter IV Yoshinori Ono had managed to remove the franchise from the freezer and set a new standard in the fighting game genre, with the fifth chapter the Japanese producer wants to go back to mainstreaming a saga that defined the competitive nature of video games twenty-five years ago . However, cabinets, tokens and arcades are a distant memory, and it is no coincidence that Street Fighter V is the first episode of the mother series not to debut in Japanese arcades. Today Street Fighter tries to evolve in the era of Twitch and eSports. The slogan chosen for the marketing campaign, ~Rise Up!~, is a call to arms for all fans of online competitions, a virtual token to challenge, just like Ryu, fighters from all over the world, with the aim of establishing themselves as the one true World Warrior. With Street Fighter V, Capcom purifies the series and looks closely at the world of eSports Playstation 4 trophies The unlockable Trophies in Street Fighter V don't deviate particularly from those of Ultra Street Fighter IV, or any other fighting game. In addition to the classic bronzes that are obtained simply by completing the single-player modes, the game is full of rewards related to online victories, your rank in the leaderboard, the amount of games played or special techniques used. The descriptions of each Trophy are quite amusing and accurate: an unimportant detail but which makes unlocking them even more pleasant. Between old and new The philosophy behind Street Fighter V is clear and ambitious: to expand the user base by making the mechanics accessible to complete newbies, but at the same time keeping the fighting game enthusiasts close. To do this, Capcom took the good things Ultra Street Fighter IV had and skimmed it from all the complexities that made the game inaccessible to a casual user. Thus the Revenge System disappears, taking the Ultras with it and saying saiyonara to the Focuses, one of the main innovations introduced by the previous episode. The EX hits and the spectacular Super (now called Critical Art) remain, but terms such as crouch tech and FAD-cancel are deleted from the vocabulary of Street Fighter V, incomprehensible tongue twisters for anyone who is not an experienced player. The fight is now reduced to the bone, made more essential, and the confrontation between the two opponents is more ~honest~ and easier to interpret. Many seemingly small changes make it essential to be able to decipher the action, predict the opponent's moves and take responsibility for your choices. Compared to Ultra Street Fighter IV, the shots of the characters tend to cause more damage: this means that even a non-technical player can overturn an entire round with just a few hits landed. Comebacks are always around the corner, and for this reason the outcome of a match is never taken for granted, keeping the two challengers constantly on the alert. In short, while not reaching the immediacy of Rising Thunder, Street Fighter V manages to bring the series back to more accessible shores, but this, mind you, should not be seen as a negative note by more experienced users. The game enhances the skill in influencing the opponent, pushing him into error, conquering spaces and making the best use of the weapons that your character offers. Combat in Street Fighter V is therefore more solid, fun and elegant than ever, able to ensure the intensity of the competition in a distillation of everything good the fighting game genre has to offer. Despite the skimming work, there is still no lack of unpublished mechanics, the most important of which is certainly linked to the Variable system. It is a small indicator that fills up as damage is received and which is used to activate the so-called V-Reversal and V-Trigger. Conceptually similar to the Alpha Counters in Street Fighter Alpha, V-Reversals help turn an uncomfortable situation around by executing a counterattack while on parry. Another thing are the V-Triggers, skills that are activated by pressing the two strong blows (HP + HK) and which change according to the character. With his V-Trigger active, for example, Ken can amplify the power and range of his shots for a short period of time; Zangief lures the opponent and strikes him with acyclone, Nash can teleport instantly, while Ryu can charge his Hadouken to launch waves faster and able to break the opponent's parry. It is a system that gives further personality and depth to each fighter, working in concert with the so-called V-Skills, skills that allow you to recharge the indicator and which are unique to each character in this case as well: Ryu has a parry like in Third Strike, M. Bison absorbs and reflects bullets, while Ken sprints forward to close the gap in an instant. The general impression is that Capcom has taken a step back and then taken two steps forward, skimming the superfluous from Ultra Street Fighter IV, but at the same time experimenting with the characters as it did in the past with Alpha and Street Fighter III. In the shadow of the netcode Under the hood, Street Fighter V hides another novelty compared to the fourth chapter. Called Kagemusha, after a Kurosawa film, the new netcode should ensure a smoother experience closer to local matches by applying the same rollback approach behind Street Fighter III: Third Strike Online Edition or Darkstalkers Resurrection. It's good news for those who don't have many opportunities to play locally, but not even Kagemusha (literally ~shadow warrior~) can save a bad connection. Indeed, precisely because of the new type of netcode, those who do not have a good connection risk finding themselves in front of characters who teleport and sudden rewinds of time. As far as we're concerned, we haven't had any major problems finding opponents and playing online, but to verify how the servers really behave, we'll have to wait for the game to end up in the hands of the fans. The good, the bad and the wrestler At first glance, Street Fighter V's sixteen-character roster may seem meager, especially when compared to the 44 fighters that Street Fighter IV achieved in its latest incarnation. However, it should not be forgotten that if Ultra Street Fighter IV is the culmination of a fighting game that has been going on for eight years, Street Fighter V represents a new beginning in a series that has always been meticulously attentive to the balance and characterization of the characters . So the ~few but good~ of Street Fighter V are welcome: in an attempt to rejuvenate, renew and differentiate the roster, Capcom has carefully chosen every single fighter, bringing back old faces like R. Mika, Birdie and Nash and introducing new ones like the Arab Rashid and the Brazilian Laura. F.A.N.G., a new entry characterized in such a way as to meet the tastes of the Asian public, seems to be Capcom's answer to Voldo, proposing a set of moves so atypical as to make it different from any other character ever to appear in the series. Ken, historically a copy of Ryu, has had a drastic makeover, receiving unique moves and becoming a much more aggressive and faster character. Street Fighter V has a flexible and heterogeneous roster, so varied that the player chooses a character as well as choosing a musical instrument. Despite the small amount of characters, it's hard not to find a fighting style you can identify with and express yourself online, and that's only going to get better as six more fighters (Alex, Guile, Ibuki, Balrog, Juri, and Urien). And it is precisely in the content distribution model that one of the most interesting novelties of the game resides. Perfectly done Although it is a clear evolution of the 3D style of the fourth chapter, it is evident that Capcom has made an effort to characterize Street Fighter V also from a graphic point of view. Thanks to the new animations and the large amount of detail, the characters now appear more expressive and at the same time less ~cartoony~, despite the exaggerated body proportions typical of the series. The arenas available so far are crowded and lively jewels, ranging from a waterfall in the mountains to a Brazilian carnival, from a rich Japanese mansion to Indian streets lined with elephants. Yet, although the leap in quality compared to Ultra Street Fighter IV is evident, and the frame rate during fights is granite, at times the game does not seem to be comfortable with Unreal Engine 4, with clipping and simulation problems of physics that almost make you regret the days of 2D sprites. Towards the eSports scene Updating Street Fighter episodes through new paid versions is a vice that has always distinguished Capcom, to the point of becoming a frequent gag among fans. For the Japanese publisher it has always been the ideal way to introduce important gameplay balances, new content and unpublished modes, but sodoing so ended up creating an extremely fragmented community. The case of Street Fighter IV and its four editions spread across as many platforms is exemplary: in order to play online with a friend, not only did you need to own the same edition of the game, but also the same console. This time however, there will be no revisions on the style of Super, Arcade and Ultra: PC and PlayStation 4 users can compete online without restrictions, and all gameplay changes and content will be applied to this first and only version. Bringing the whole community together in one big league is a key move from a competitive point of view: the ranking of all players in the world is finally unified and anyone can compete in the same league as stars like Momochi and Daigo Umehara. As if to underline the importance of online challenges, the largest button in the game menu is the one that leads to CFN (Capcom Fighters Network), a new platform that provides a whole series of options and services for online challenges. For example, you can see the areas of the world with the most intense activity, do in-depth searches for players, compare the statistics of others and analyze their replays. ~Stalking~ your friends or other players in the rankings means discovering the characters they play best with, the fighting style they prefer, the moves they use most often and the matchups they have the most difficulty with: through this information, you can understand your own weaknesses and those of your opponents, taking inspiration to improve and get the better of direct confrontations. As for online, the only drawback is the possibility of creating online lobbies with a single opponent: to have eight-player lobbies, complete with a spectator option, you will have to wait for the first free DLC to be released in March. Between Fight Money and DLC Inspired by the model of free-to-play games, Street Fighter V will introduce characters, costumes and various embellishments over the months that can be purchased using the two game credits: Fight Money is the game's virtual currency, which can be accumulated by playing online with others players or by completing single-player modes. Zenny, on the other hand, are obtained by spending real money (1 euro = 100 Zenny). Since the Shop won't be available until March, we don't know what it will be possible to unlock specifically. Capcom has repeatedly reassured fans that all additional characters will be accessible simply by playing and spending Fight Money, but predictably there will be ~Premium~ costumes that can only be obtained by spending with Zenny. Updates regarding modes or gameplay balancing will instead be free for all game owners. Stake launch Impeccable for those who want to play online or against a friend locally, the version of Street Fighter V that will arrive in stores could however displace those users who are not necessarily interested in competition and who also expect a fair amount of single player content from a fighting game. The current story mode is just a lackluster prologue to the cinematic campaign that arrives in June, too short and simplistic to represent a sensible alternative to the classic Arcade. The Survival option is more stimulating and demanding, but for the daily objectives, the challenges of each character and the simple versus against the CPU (strangely absent at launch) we will have to wait for next month, when all this content will be added for free. Among the options that will arrive in March there is also the Shop, which means that all the Fight Money accumulated in single-player modes or in online matches cannot be spent in any way until then, limiting the rewards even more and the sense of completion for the average user. One wonders why, in a game that aims to welcome everyone without distinction of experience and skill, there is a lack of those basic contents and options that serve precisely to capture the attention of more casual users, to make them familiar with the mechanics and characters before taking them by the hand in the online challenge arena. The reason is probably related to the imminent start of the Capcom Pro Tour 2016, and the need for the Japanese company to publish the game before the international competition begins. This is why there are those who, not too mistakenly, speak of a full-price ~early access~: the Street Fighter V that will arrive in stores will be aimed at those who divide their time solely between the training stage and the online challenges. All the others will have to have a few more weeks of patience.", "date": "2016-02-15", "grade": "8.5"}