{"name": "Rally da leggenda", "ref": "https://multiplayer.it/recensioni/162801-sebastien-loeb-rally-evo-rally-da-leggenda.html", "text": "After having taken care of the WRC series from 2010 to 2013: FIA World Rally Championship dedicated to the maximum rallying competition, the wealth of experience accumulated by Milestone with the ~material~ has increased significantly, so as to push the Milanese software house to embark on a new themed project even without the official license of the championship, which in the meantime passed from the hands of the Parisians of Kylotonn. To give prestige to its ideas and give a productive breakthrough, Milestone has decided to involve the French champion Sbastien Loeb in the enterprise, a true legend of motorsport capable of conquering the title of World Champion nine consecutive times (2004-2012) . The intense development period, resulting in a delay of a few months on the initially planned schedule, has just been completed, and we flew to Paris to follow the launch event which was held at the Peugeot Avenue at the Champs Elysees, where Loeb himself took part, demonstrating his monstrous driving skills with a (crazy) session on ~his~ simulator. On the spot, thanks to some spectacular racing seats made available by Milestone, we were able to test the title in the PlayStation 4 version, however the analysis you are reading is based on the PC version, put to the test as soon as we returned to Italy. Lots of content, a garage for connoisseurs and guaranteed fun in Sbastien Loeb Rally Evo Abundant After installing the three DVDs included in the box and the 1.0 patch on Steam, the first time you start the game you are projected into a classic customization menu, where you can select some surrounding elements such as the driver's name, overalls, helmet and so on. Once the pleasantries have been overcome, you immediately start to press on the gas with a brief but significant tutorial which, thanks to a powerful DS3 Rally Car, allows you to assimilate the basic dynamics within a peculiar layout obtained from a quarry. Particularly interesting is the guide to the so-called graphic Pacenotes, or rather the indications in rally jargon that the navigator provides to the driver: it is one of the aspects to which Loeb has contributed most and the difference with other rally titles is perceptible. We will discuss this later. The first access to the main menu coincides with a welcome gift, a fantastic Peugeot 106 Rallye perfect for getting familiar with the basic competitions. The little French car, a true icon for enthusiasts, is not just any car, but it is the one with which Loeb began his wonderful career. If the 106 tickles the palate, know that the title garage is one of the richest and most interesting for a product of this type, where some of the most beloved and fascinating racing cars of the discipline are present in the eleven categories offered. Just to name a few, in addition to the inevitable Mitsubishi Lancer and Subaru Impreza, we find ~pieces of history~ such as the Lancia Delta Integrale, the Celica ST185 GTFour, the Renault 5 Maxi Turbo, the Alpine A110 1600 and the FIAT 131 Abarth Rally. There is no shortage of Saxo, Xara, Punto, Clio (Williams included!), Swift and many others, for a total of about sixty vehicles, ranging from the most docile 2WDs up to racing cars with around a thousand horsepower dedicated to hill climbs, including the Peugeot 208 T16 Pikes Peak with which Loeb (literally) destroyed the competition record. In short, from this point of view the Milestone work has nothing to envy to other similar titles, far from it. As for the modes, from the main menu it is possible to access the Career, the so-called Loeb Experience, the Multiplayer and the Fast Modes, which allow the organization of Rally, Rallycross and timed trials with the possibility of renting some cars. The real career is made up of an infinite number of events organized into categories, ranging from races for beginners under the name of ~Debut~ up to the ~Loeb Events~, where the French driver will act as mentor in some specific stages, including the legendary Pikes Peak Hill Climb. Not all races are accessible right from the start, and for some of them, beyond the need for a useful means, a certain position in the world ranking must be reached, based on Reputation exactly as in RIDE. The ~climb~ also coincides with the unlocking of some cars, which are given to the player by overcoming certain events of the Loeb Experience. The latter is nothing more than a summary of the career of the legendary French rider, from the first competitions aboard the Saxo up to the aforementioned Pikes Peak in 2013. In this modality the groups of events are organized in years, introduced by documentaries full of anecdotes and curiosities in which the pilottells about his life and his career: a definitely interesting plus for fans of the ~Martian~ from Haguenau. The real races are divided into single specials, complete rallies spread over several days (complete with necessary repairs between the various rounds), races against time and rallycross, both in the traditional mode with ~Giro Joker~ and alternatively with eliminations and times on sectors. Sometimes to overcome some events you need to be particularly skilled, given that in addition to first place, you may be required to place the best time in each sector of the track. If we add to this variety the presence of eight locations for rallies (Wales, Alsace, Australia, Finland, San Remo, Mexico, Sweden and Montecarlo), the very long twenty-kilometre Pikes Peak and five rally cross circuits, for a total of over three hundred kilometers of replicated routes, it is clear how substantial the amount of content proposed by Milestone is. It should also be emphasized that the sense of progression is well studied and the player is pushed to accumulate credits to unlock new cars and try new events, a virtuous circle that can simply be translated with the term fun. Belts fastened Sbastien Loeb Rally Evo is not a pure simulator, but a convincing ~sim-arcade~ with a solid and pleasant physical-dynamic model, whose algorithms have been refined by the developers to make driving accessible but challenging at the same time. Before diving into the gameplay analysis, it is necessary to underline a very important detail: our test was in fact carried out with the Thrustmaster TX Ferrari 458 Italia Edition, a high-end racing wheel that is perfectly compatible with the Italian title. Unfortunately, support for peripherals from other brands may be inadequate or poorly implemented, for example not allowing the use of the pedal board as indicated by some users. We hope that Milestone releases a corrective patch as soon as possible to make the title fully usable for everyone. Returning to the test, with our Thrustmaster equipment the Force Feedback effect is very precise and vigorous, furthermore the steering wheel adjusts effectively according to the car model in use for an even greater involvement. The best results are obtained by eliminating the various aids (in braking and stability) and reducing or completely removing the intensity of the TCS, expedients that make the driving experience more effective and genuine but never too demanding. The consequences of oversteer and understeer are well reflected on the basis of the type of car, moreover one perceives the good work done by the developers with the differentials, one of the characteristics to which the greatest attention has been paid, as explained to our microphones during the Parisian event . Overall, accessibility is clearly superior to that of Dirt Rally, a ~ruthless~ title that is much closer to a real simulation. We reiterate that to fully enjoy Sbastien Loeb Rally Evo it is advisable to play with a good steering wheel and strictly with one of the internal views: the title can also be appreciated with the joypad and external view, however the result is decidedly less engaging and sometimes you feel some smudges in the behavior of the car. Although the physical-dynamic model works very well, when the wheels come off the ground and during impacts, the need for greater refinement is felt, due to some not exactly realistic consequences which, however, are not unusual in such products. The damages, aesthetically valid, if set as ~heavy~ can affect the performance and behavior of the cars, even with realistic jolts returned on the steering wheel. The Intermediate difficulty level is too simple to beat and for a more compelling challenge it is necessary to set the highest ones: the maximum is the Realistic one, but an even harsher challenge is possible by facing the ghosts detached by Loeb himself. Speaking of ghosts, their implementation is not very successful, since the transparency management can disturb driving, especially in multiplayer sessions. Before getting behind the wheel, it is naturally possible to modify the set up of the cars, intervening on numerous parameters which include basic and advanced components. As previously indicated, Loeb also contributed to the management of the Pacenotes, which in standard mode are read to the player in groups of three/four and communicated well in advance of other rally titles. The timing of the co-pilot's interventions can however be calibrated through a dedicated option. From dusk to dawn With our test configuration, at maximum detail the title travels to sixtyta (very solid) frames per second and the only drops we have detected during the replays of some specific races, for example when a big fuss is raised. The optimization is clearly superior to that of the demo, from which it also differs for the greater cleaning and the removal of some graphic glitches. Being a 64-bit executable it is not possible to force the triple buffering from the Nvidia panel or with programs like D3DOverrider, therefore if you don't have a very performing machine, to avoid annoying jumps from 60 to 30 frames per second we recommend disabling the V-sync from the game and activate the ~adaptive~ one from the control panel. However, the title has a good scalability, offering several options to set such as antialiasing filter, high quality AFX, motion blur, texture quality (up to 4GB of memory), reflections and more. The overall result, while not crying out for a miracle, is certainly solid and pleasant, above all thanks to the variety of the track design which on some tracks is even more refined than in Dirt Rally, although the latter generally appears more realistic and clean. The very long Swedish Torsby special, just to name one, is the perfect example of the good work done by Milestone, who went around the world to effectively map and replicate all the locations featured in the title. The lighting is valid during the day, at dawn and dusk, while at night it loses part of its appeal, resulting significantly lower than that offered by Dirt Rally. The weather phenomena are not freely selectable and you have to be content with already wet, snowy or icy tracks; each setting still offers eight stages (including the ~reverse~) and some of them can even exceed ten kilometers in length. The polygonal models of the cars are well done both in the interior and in the exterior, but overall they still appear a step behind compared to those productions like Forza Motorsport 6, Project CARS and Assetto Corsa. As happens in RIDE, the roar of the engines comes with ups and downs, while the other sound effects, sometimes afflicted by some bugs in reproduction, don't always offer vigorous and incisive samplings, even if they carry out their task with dignity. The netcode for the multiplayer modes is very good, which in addition to the classic rally for sixteen players allows exciting challenges in rallycross for up to a maximum of six players. However, the options are limited and the heart of the production clearly lies in the single player.", "date": "2016-02-01", "grade": "8.0"}