{"name": "Frenesia tricolore", "ref": "https://multiplayer.it/recensioni/162694-slybots-frantic-zone-frenesia-tricolore.html", "text": "Slybots: Frantic Zone has come to us following that flow of Early Access which represents an excellent opportunity for new developers and small publishers to show off without having to shell out large capitals. Often the titles that arrive in this cauldron do not stand out for their complexity or content, but there is no shortage of interesting products and Slybots has what it takes to attract our attention. In Slybots: Frantic Zone crazy little robots compete with swords, grenades and missiles The stealth ingredient Slybots: Frantic Zone is a top-down twin stick shooter with three main modes, two of which are playable against both AI and local four-player multiplayer. The online will arrive in the near future and promises to significantly broaden the horizons of the title, but for now we can only evaluate what we have on our plate. The protagonists are small fighting robots and the game mechanics include melee, four firearms, physics and some stealth dynamics embellished with rather interesting synergies. For example, some vents allow you to disappear and reappear by coming out of one of the different exits on the maps. Inanimate Slybots also emerge from these outlets and the possibility of turning off one's own, in this case automatic, allows the player to blend in and then suddenly reactivate behind an enemy. The problem is that these mechanics, including the ability to make short trips with the Slybot deactivated, are very difficult to exploit given the extreme frenzy of the action, the explosive weapons and the difficulty in fooling human opponents, but when timing and luck fit together the satisfaction you get is remarkable. In Deathmatch the task of the robots is to eliminate as many opponents as possible, while Capture the Battery is based on the recovery of an energy cell that the robots must try to bring back to their respective base. The third mode, exclusively single player, is called Endless and is a wave survival in which the aim is to prevent enemy robots from reaching the level exit. In this case, the artificial intelligence uses ducts and camouflage dynamics to deceive us, while our task is to position ourselves in the best possible way to cover as many openings and prevent ten opposing robots from escaping from the play area. The latest update, among other things, has added a second map to this mode which, according to promises, should soon be enriched with new variants, but for now it is better to go back to the contents already implemented. Colored pods appear in the middle of the maps, allowing you to switch weapons from the basic machine gun to shotgun, missile launcher, and grenade launcher. In the first case the advantage is the long shooting distance but it is necessary to have eye contact. The latter requirement also applies to the shotgun, but the range of bullets, despite the short range, can cause significant damage and allows you to hit multiple targets at the same time. The missile launcher, on the other hand, deals massive damage at long range but its shots can be repelled by a well-timed sword slash, making it quite dangerous to use. The most interesting weapon is probably the grenade launcher which requires geometric calculations, good timing and good aim given the slowness of the shots, the possibility of a deviation in the trajectory and the defect of being able to cause damage even to the user. The merits of grenades, however, are several since the projectiles ricochet off walls, overcome lower obstacles and allow you to strike without the enemy being in sight, and this means that the enemies cannot shoot directly at us, guaranteeing us an important advantage in a frenetic title in which high mortality punishes any distraction. Three minutes to die AI-controlled enemies are aggressive, move with precision, exploit vents and are already fearsome on the lowest difficulty. Adding to this the refined gameplay, physics and stealth dynamics we should be able to count on an addictive single player; for some time it is, in fact, but the enthusiasm for the solo experience is destined to fade between infinitely repeated situations, very high mortality and two main modes designed for multiplayer. Slybots: Frantic Zone is at its best when played against human opponents provided you have plenty of space and controllers given the need, at the moment, to play locally. The calibration of the controls allows you to use the mouse and pad simultaneously without too many disparities, even if you are equipped to be able to play comfortably from the sofait could be a significant bonus for an evening with friends. The ten maps currently available, two for the infinite mode and eight for the two arena modes, are limited to one screen and are generally symmetrical, but they change essentially in terms of movement mechanics, power-up positions, fences that can be crossed by projectiles, location and number of teleporters, treadmills, explosive bins and destructible crates. The small maps full of openings force us to consider every trajectory in a title that does not forget about the details, as in the case of power-ups that are not crossed by enemy projectiles and which can be used as a barrier. It must be said that the levels are rather simple and often anonymous, but the overall detail is quite high at least in relation to the production value of the Team Error title, and from an aesthetic point of view this is not the only advantage of Slybots. The effects are simple but delicious and are combined with effective light effects that further underline the excellent rendering of explosions and blows like the sound effects, spartan but equally convincing. Probably the techno soundtrack is not destined to leave its mark on the musical landscape, but it is well made and, more importantly, it adapts to the atmospheres of the Team Error title. Also for this reason we find ourselves positively evaluating the relationship between quality and price which also includes a tutorial. This is composed of a series of short missions which, between levers, puzzles related to ducts, stealth movement and invisibility plates, let you imagine single player scenarios that are far more complex than those created by the developers. It is almost legitimate to hope that in the future Slybots can also expand in this sense, although the heart of the game lies in the excited combat mechanics. Mechanics that give us a game that is probably not very long-lived, at least until the arrival of online, and rather simple but with attention to both graphics and gameplay.", "date": "2016-01-29", "grade": "7.5"}