{"name": "Nel nome del padre", "ref": "https://multiplayer.it/recensioni/162587-rise-of-the-tomb-raider-nel-nome-del-padre.html", "text": "Lara Croft has grown since her baptism of fire, moving closer to being the cunning and unstoppable explorer of the classic series. And so, for her first ~voluntary~ adventure, she decides to follow in the footsteps of the Divine Spring, a source which according to legends has the power to give eternity to anyone who drinks her water. This is not a random goal: Lara's father, Lord Richard, dedicated his life to this research and was literally consumed by it, even without being able to complete it. The clues point to Siberia, and it is on a snowy mountain that the first, spectacular sequences of Rise of the Tomb Raider take place. Accompanied by her friend Jonah, the protagonist must reach the summit of the mountain before a storm makes the climb impossible, but time is running out and there are many pitfalls along the way. While these early stages basically act as a tutorial to the platforming sections of the game, the excellent direction and stunning visuals turn them into a truly immersive experience, as epic as a grand adventure should be. Rise of the Tomb Raider was a great title on Xbox One and even more so on PC Change of pace Between collapsing ice walls, seemingly impossible jumps and long runs to safety, the initial stage of Rise of the Tomb Raider ends with a flashback dating back to two weeks earlier, when it all began in London. The setting therefore moves to Lara's first searches on the Divine Source, carried out in Syria, and changes completely with respect to the snowy lands, catapulting us into the middle of a desert, between besieged cities and the imminent danger represented by the Trinity, an organization of religious fanatics determined to find the legendary source before the girl. At this juncture we come into contact with some of the new exploratory mechanics introduced by the developers, with the protagonist who has the ability to refine her knowledge of ancient languages by consulting engravings and paintings, to finally get to translate monoliths that contain useful additional information on the map . Everything flows in the same direction, given that it is precisely the exploratory element that plays a leading role in Rise of the Tomb Raider, thanks to the presence of tombs and their interesting puzzles, but also of resources to collect and prey to hunt , going to dissect (literally) those aspects that in the previous episode, for one reason or another, had not found a place. The importance of traditions The rest of the system, beyond the side modes (the Expeditions are very fun, but we refer you to the review of the Xbox One version for further details) resumes what has already been done with the first chapter of the Crystal Dynamics reboot, while inserting small extras to further enrich the crafting and combat system. The latter is characterized by the same strengths and weaknesses that we had noticed in Tomb Raider: great difficulties in close-range battles and an artificial intelligence of the enemies that is lacking in such situations, proving instead to be fairly valid in the standard routines, when the opponents change positions, they destroy our barriers, throw grenades to flush us out and, in general, have a sufficiently dynamic attitude. The stealth phase is very accurate, thanks to the shelters in the tall grass inspired by Assassin's Creed IV: Black Flag and the possibility of creating diversions to change the composition of the patrols and take individual guards by surprise. It is a pity that these very valid intuitions are sometimes trivialized by an all in all modest level of challenge, in particular due to the abundance of ammunition and resources at every corner, a factor that even in the new episode relegates hunting to such a present activity and fascinating, but at the same time optional from a crafting point of view and never fundamental. From Xbox One to PC There are design choices that naturally remain common to all versions of Rise of the Tomb Rider, and which also on PC draw the picture of a majestic product during the early stages, certainly among the most beautiful things that have been seen in recent years in the action adventure genre, but which then ~lays down~ in the safety of the groove traced with the debut episode, leveling its ambitions also in terms of visual impact. It is for this reason that the environments of the Soviet Base or the Geothermal Valley do not touch the peaks of the introductory and final levels, and it is a pity because we are talking about the vastest scenarios and full of things to do, if you want to completethe campaign at 100%; which is certainly not guaranteed by proceeding straight towards the main objectives, but by focusing on the secrets of the locations, on the secondary missions that are provided to us by the allies on duty and by dedicating ourselves to the entire exploratory phase we talked about previously. In this sense it is clear that the arrival on PC brings an upward leveling of the general technical standard, thanks to visibly more defined textures, a doubled frame rate and much more advanced effects, in particular as regards the rendering shadows and hair. Let's say right away that the much talked about VXAO, the new voxel-based ambient occlusion technology from NVIDIA, has not found a place in the pre-release of the game and will therefore be added to the official launch, but we are confident that it will be able to further improve a graphics sector for already stellar in some ways, which manages to take full advantage of the spectacular nature of the settings and to transparently mix sequences in computer graphics, cutscenes calculated in real time (with the usual improved version of the polygonal models) and in-game visuals, all at the service of storytelling, just like in Naughty Dog productions. It is comforting to know that there are at least three development teams out there (we also include Ready At Dawn with its The Order: 1886), capable of combining these aspects of a video game in an almost perfect way. A footnote also for the localization in Italian, characterized by a dubbing that we found excellent in terms of interpretation and attention to detail: the actors are aware of the situation in which they find themselves, undoubtedly thanks to a good direction and some shrewdness from part of Square Enix, and even the lip sync is flawless. In detail The PC version of Rise of the Tomb Raider boasts many advanced adjustments. On the resolution screen, NVIDIA's specific antialiasing technologies are missing (no TXAA, in short), which makes one turn up one's nose, but the further settings guarantee a great scalability of the experience. In fact, it is possible to determine the quality of the textures and the anisotropic filter, the shadows on two different levels, the ambient occlusion (as mentioned, it stops at the HBAO+ setting, which in any case guarantees a remarkable glance), the depth of field and the general level of detail. Then there are tessellation effects, screen reflections, dynamic foliage, bloom, blur vignetting and blurring, as well as lens flare and screen effects. Adjusting each of these parameters results in an eventual improvement in performance, but for NVIDIA cards the key is once again in the hair. In fact, the game includes AMD's new PureHair technology, which guarantees a realistic rendering of the strands with respect to wind and atmospheric agents, in a much more beautiful way to look at than the TressFX of the previous episode, but equally problematic for those who do not own a card manufactured by Advanced Micro Devices. NVIDIA has not yet released the optimized drivers for Rise of the Tomb Raider, so the situation could easily change, but to date the impact of PureHair on the test configuration is something like ten frames per second. It's incredible how the ~non-optimized~ hair calculation alone produces such a drastic effect on game performance, that in terms of polygon count and effects it moves much more, but in an open field keeping PureHair activated brought back to mind the first release of Batman: Arkham Knight on PC, and it wasn't pleasant. In our opinion a system equipped with an upper mid-range Intel processor, a GTX 970 and 8 GB of RAM can run Rise of the Tomb Raider at a stable sixty frames per second, at 1080p and with all effects maxed (at part of the hair), while with the AMD FX 8320 used in the tests we had to lower the quality of the shadows slightly to obtain the same results, with variations from 40 to 75 fps depending on the situation. We also report some small glitches and some visible uncertainty during the cutscenes in real time, probably due to the speed of loading the assets: the first patch should fix everything.", "date": "2016-01-27", "grade": "9.0"}