{"name": "Pako Highway", "ref": "https://multiplayer.it/recensioni/pako-highway-recensione.html", "text": "The recovery of the more classic forms of the racing game has become a sort of trend for mobile games, often resulting in game solutions that are perfect for use on these platforms, as this review by Pako Highway also demonstrates. The Pako series has specialized in a more set variant on pursuits and races in city traffic, but with this Highway the standard structure of the checkpoint driving game is recovered a bit, with some derivations that also recall the historic Burnout series. It's hard not to think of the late Criterion game when you find yourself having to touch cars and run as dangerously as possible to accumulate boosts, or when at full speed we find ourselves crashing opponents in real takedowns, albeit speeded up and simplified as you can it suits a title that aims at decidedly more immediate entertainment. The mechanism works very well, above all because it requires simple and not very articulated controls, which can be perfectly associated with the touch screen of mobile devices. It is a recovery of the more classic style of arcade racing type OutRun, now obsolete on standard gaming platforms but which seems to have found another youth on smartphones, as also demonstrated by the well-known Horizon Chase series, to mention one of the best known cases . After having staged racing and chasing in full 3D environments in the previous chapters, it's time to return to the good old behind-the-car camera in this Pako Highway, which could be the most polished and successful game of the Tree Men Games franchise, despite being perhaps the one most distant from the structure seen in the three main chapters. Reckless racing Pako Highway mainly focuses on urban roads The purpose of Pako Highway is simply to try to go as far as possible within various settings, accumulating meters traveled in order to be included in the general classification of the drivers. The gameplay is based on a few simple rules, which on the one hand keep the title playable and immediate but on the other inevitably condemn it to a certain general superficiality and a constant repetition of the same situations, easily leading to monotony in the medium term. The controls adapt perfectly to mobile use: with the car placed in the center of the screen and viewed from behind, we simply have to touch the side edges of the touch screen to make it swerve in both directions, while it launches into a mad race through accelerating traffic constant. Passing as close as possible to other cars accumulates the boost bar, which is automatically released once it reaches its maximum and allows for brief moments of unbridled speed, with the possibility of knocking down anything in its path during these seconds of unbeaten run absolute. The action is therefore very simple and purely arcade, but there is also a certain sense of progression: a good amount of content can be unlocked by accumulating gold in matches, allowing it to be invested in new cars and other roads to go, with settings that are also quite different from each other. Pako Highway has a rather particular graphic style The graphic style is another distinctive feature of Pako Highway: also in this case the elementary and minimalist 3D of the first three-dimensional games is recovered, with the raw polygons, devoid of textures, but everything is represented with considerable care. Between colors that veer towards sepia and an interesting management of the lights, it seems to be faced with a sort of vintage racing game, which alternates fluidity and extreme speed with spectacular slow-motion scenes. The free-to-play management is also good, which never presents invasive micro-transactions, even if the advertisements can be annoying.", "date": "2022-10-01", "grade": "7.0"}