{"name": "Ghost Recon: Advanced WarFighter - Recensione", "ref": "https://multiplayer.it/recensioni/ghost-recon-advanced-warfighter-recensione.html", "text": "Near future GRAW is set in 2013, and as a result our soldiers are equipped with the most modern technological discoveries that the US military can provide, among which stands out a visor integrated into the helmet in which a considerable amount of information about our targets is projected, on their distance, location on the type of threat they represent and others of a multimedia nature such as video streaming in a small box on the screen. The visor also offers aids for targeting enemies, highlighting them with a colored diamond, even if they are covered by some types of structures. If at first glance it may seem like excessive help during missions, we can safely deny this feeling. The game has been designed considering this type of situation and the relative level of difficulty has been calibrated properly. For the more savvy players, it was possible to change the type of view in the game, from just behind the back of our alter-ego, to the old first person. After a bit of testing with both available cameras, despite perhaps more accurate aiming in certain situations with the first person camera, we would like to recommend the default camera, which allows you to better manage the position of your character at the time of shooting. levels and their interaction with their surroundings. At least for offline play. Captain, to your orders! In GRAW it is advisable to carry out the zero level of tutorial for a first impact with the basic controls of the game, but we remember, for the joy of many, that this level is completely skippable. The character control method is structured in levels, the more you play the easier and more intuitive it becomes to use the various advanced functions, such as sliding while you are running to get to cover quickly, rolling over while lying down, secondary shots, using intelligent of grenades and smoke bombs, the possibility of being able to hold your breath to increase the accuracy of the shots while using the various telescopic sights, the change of posture and so on. The control of the squad and of some types of vehicles, on the other hand, has been simplified to the maximum. Just aim at the desired point and press ~up~ on the digital cross to move the team to that point, if instead you aim at a target or another wounded team member, always with the same key you give the order to attack and disengage respectively. carry out the necessary treatment. By pressing the ~down~ key on the digital cross, the group is summoned at our position. Artificial intelligence One of GRAW's strengths, in addition to the atmosphere you breathe in each level, is represented by the combat method and the type of equipment that can be selected at the start of the mission. Choosing one type of weapon rather than another completely changes the approach to battles, making them more frenetic if you choose a weapon with fast bursts and grenade launcher included, more reasoned if you use a rifle equipped with a single shot and optical sight precision, or extremely slower with the choice of the sniper rifle equipped with an extremely powerful telescopic sight, which however limits short-range clashes to the use of a pistol as a second portable weapon. This type of situation also positively affects the longevity of the single player campaign, a player can in fact repeat the mission simply using a different type of weapon and completing it in a completely different way than before. The same can also be associated with the choice of the three companions who will follow us in most of the game. There are different members of the team, with related specializations. From the rifleman to the gunner passing through the grenadiers and machine gunners, also in this case the choice of our colleagues will influence the clashes with the enemies. a player can in fact repeat the mission simply by using a different type of weapon and completing it in a completely different way than before Artificial intelligence Each mission, as already mentioned, has multiple objectives to complete, some of reconnaissance, others to garrison an area, others to escort vehicles or key people to the story of the game, others purely for attack and conquest of predefined points of the level. In GRAW it is not possible to save at will, but automatic save games are provided for the conquest of each single objective, and some control points that allow in the event of premature death, not to carry out a large portion of the mission from scratch. It should be specified that the checkpoints do not save the game permanently, therefore in case of switching off the console and subsequent loading, it will resume from the last savegame effected. There are only two difficulty levels, normal and difficult, and in the latter the challenge increases significantly, because the reaction parameters and aim quality are modified for all the soldiers managed by the cpu, who will be extremely lethal, even from very long distances. The artificial intelligence in GRAW is fluctuating at times, even if the challenge and the level of difficulty are high in the single player campaign, the enemies react in an all too predictable and scripted way, so in 90% of the time a passage has to be repeated, and believe me, even on normal difficulty level it will happen frequently, enemies will be in the same positions and will react in the same way. Every now and then in a completely random way, this situation ceases, in fact you could find the opposing soldiers in completely different positions much closer to your position, causing a decidedly unexpected surprise factor. Shaders, Hdr and company.. In analyzing the technical aspects, one can only take his hat off to the work carried out by the development team, which delivered a short distance from the launch of the console, a title that if enjoyed in high resolution shows a truly marked qualitative gap compared to the previous one console generation. The only two admissible defects can be a slight tearing of the image in certain situations, and a frame rate with some drop in the most critical situations. These two weak points do not undermine the final result which makes the lighting management its best point, thanks to the High Dynamic Range (HDR) techniques implemented. The surfaces of every object on the screen are equipped with some kind of effect, from classic bump mapping to more advanced normal mapping and various algorithms for realizing particle effects, such as explosions, up to shiny and reflective surfaces. Among the secrets of graphic rendering in GRAW, in addition to the aforementioned lighting effects, there are additional image post-processing filters to create effects such as heat distortion in the distance or the use of motion blur. Another point in favor in the technical realization of GRAW lies in the interaction and relative destruction of some objects on the screen, first of all cars and vehicles, which offer various parts that can be destructible and possibly used as means of cover. The references to the physics implemented on some objects are also seen during the fights, and through the use of particular weapons such as sniper rifles, capable of penetrating some materials, such as some thin metal sheets, wooden planks and others. Even the sound realization in GRAW is commendable, both for what concerns the soundtrack used, in particular the tracks that are heard in some helicopter transfers, and for the well-kept implementation of the sound effects in Dolby Digital 5.1 inside of the game. We remind you that the GRAW is localized in Italian both for the texts and for the voices of the characters. Small Bugs Unfortunately, not all games are perfect, and in GRAW you may notice some bugs which, while not ruining the gaming experience, do not fully honor one of the best games of recent months. The bugs can be identified in irrational behavior in the characters to be escorted, who perhaps move into the full battle area by loosening themselves from cover, or in any blocks of the character in an area of the level and similar situations. As already mentioned, they don't ruin the game, and they are simply minor annoyances, perhaps due to an accelerated final testing phase to meet the release date, but they are all solvable with a simple patch downloadable from Live and completely tolerable. The King of Xbox Live Online play has been one of the hallmarks of Ghost Recon right from the start, even in the Xbox version, in this third episode Ubisoft has further raised its quality level, increasing the options and modes and optimizing everything for the 16 players supported via System Link or Xbox Live, apart from the splitscreen mode which, as usual, has been implemented for up to 4 players. To play GRAW in multiple players, you must first decide whether to use classic multiplayer or cooperative modes. In the standard multiplayer mode, single games offer a good number of options for customizing matches and also include the classic Deathmatches, single or team, capture the flag or the conquest of territories, siege and various other sub-types. All this is supported by the possibility of eliminating the respawn, forcing or limiting one of the types of view or the weapons available and so on. As a result, play on Xbox Liveit is definitely more tactical than singles matches. On the net, one does not aim much at spectacular actions, one cannot stay in cover in the same spot for long, rather one must aim at the practical act, in which to shoot little but well, and try to avoid sorties a la rambo that can, indeed must be done in other ways. Even the type of posture taken by our virtual alter ego must be changed, moving completely upright is almost an act of suicide, so we switch to crouching practically by default, and as a second option, crawling around is not a bad idea at all. The level design in the available maps is certainly spot on, and for once one could complain more about the complexity and useful size of the playing area in certain arenas, rather than the other way around. The only flaw relating to the levels is their number, which is certainly not very high, but considering the possibility of additional content via Xbox Live, it should be an easily solvable problem in the future. The King of Xbox Live The graphics engine dedicated to the multiplayer section was developed in parallel with the one used by the game in the single player, but on the technical basis of the one used in Ghost Recon 2. The reason can be understood almost immediately, a realization with the numerous filters used in the post processing, lighting created using HDR and company techniques, would have become almost harmful for the management of these arenas, both due to the size and the fact that the players on the live stage would hardly have been able to admire the landscape during a fight to the death in deathmatch. In summary, the graphics rendering of the multiplayer is visibly lower when compared to the single-player campaign, but still remains at high quality levels and perfectly functional to the type of experience that a game like GRAW must be able to guarantee. As regards the lag and the quality of the net code in Ghost Recon, it is necessary to evaluate the various types of connection available, a fastweb line was used during the test, and in the hosted sessions even with the maximum load of connected users, i.e. 16 , we had no complaints about the quality of the game. This type of situation also occurred when connecting to hosted games from different connection types and, except in one case, particular lag problems did not manifest themselves. Slightly different speech on the stability of the line, which in certain games, connecting to other users, was not granite, with some disconnections too many, due to the lower quality of those lines. In any case, the gaming experience was decidedly rewarding, as already mentioned, like the excellent single-player campaign and the ad hoc co-op section. As for the cooperative in GRAW we have two possibilities, a simple co-op mode in which the players fight within levels separated from each other with the rules of engagement already seen in the singleplayer, unfortunately undermined by an artificial intelligence by the cpu not up to par, or an entire co-op campaign in which a real team of players is formed, up to a maximum of 16 people, and objectives quite different from the classic ones must be completed, and with rules unique to the game, such as time limits. In this campaign, the level of challenge offered by the CPU is much greater and although it is shorter than the main single-player campaign, it proves to be a high-level gaming experience and not to be underestimated compared to the classic multiplayer modes. Given that it requires a team spirit and knowledge of the game mechanics from all members of the team, at times, exciting. Comment Ubisoft has literally swept away the series of doubts born during the X05 test on an incomplete version of the game, releasing a product which, apart from the graphic aspect, not only proves to be the most complete of the series considering the available modes, but also one of the best titles in the genre. In GRAW you breathe the same atmosphere attributable to films such as Black Hawk Down, an atmosphere that transports the player directly to the battlefield, meeting the needs of the typical audience of the console world, with a product that is not extremely simulative and not too distinctly unrealistic. Ghost Recon: Advanced Warfighter has a great advantage, that of entertaining the player both in offline and online games. As you have read, there are some imperfections or some limitations that could have been avoided with more time for optimization and testing of the game, but the final result is absolutely not obscured, giving life to one of the best games for Xbox 360. Definitely well done and recommend", "date": "2006-03-17", "grade": null}