{"name": "Amplitude", "ref": "https://multiplayer.it/recensioni/161724-amplitude-il-ritmo-della-sfida.html", "text": "Before the advent of the multifaceted Guitar Hero, Rock Band and the more recent Rocksmith, which ennobled the concept of music video game thanks to the didactic component, the so-called rhythm games generally had a more light-hearted and ~playful~ air, where to have fun it was it is enough to hold the classic joypad without having to go through expensive plastic gadgets. Among the productions that in the past were able to stand out for their originality and involvement there was certainly Amplitude on PlayStation 2, a title developed by the American Harmonix which, while not achieving the hoped-for commercial success, was favorably received and allowed the software house to specialize in the genre with which dominated in the past generation. With the support of a classic Kickstarter campaign with a nostalgic flavor, from which it raised around 850 thousand dollars by hitting the main objective alone, the team founded by Alex Rigopulos and Eran Egozy has decided to bring its historic intellectual property back to life, developing it on PlayStation 4 an evolved remake. We've tested it thoroughly and here's what we think. Electronic music, psychedelic scenarios and a very demanding challenge in the remake of Amplitude Playstation 4 trophies The remake of Amplitude presents a total of seventeen Trophies, of which two are bronze, five are silver, nine are gold and one is platinum, the latter relating to the conquest of all the others. The lesser metal is achieved by completing a single song or using one of the bonuses, while the silver ones offer some interesting challenges such as getting 100% sequences in a song or completing FreQ mode. Gold Trophies feature diversified objectives such as unlocking all songs, finishing the Campaign mode, and getting a three-bar rating in each song. Laser key In any good self-respecting rhythm game the main purpose is basically to be able to go in time with the running melody, pressing the inputs at the right time with the support of the graphical interface. Amplitude is no exception, however it has some peculiar characteristics that differentiate it from similar products. In fact, the player controls a sort of ship called the Beat Blaster which, sailing on a psychedelic path made up of colored tracks, must hit some gems (cells) strategically arranged with the lasers to align with the rhythm. Although the heart of the game is represented by the classic Quick Game, where you aim to improve your score by challenging the inevitable world leaderboard, in the Harmonix title there is also a Campaign mode with a rather fascinating objective, namely to be able to awaken a patient from a coma. The Beat Blaster, present in four variants, is nothing more than a nanomachine capable of stimulating synapses and functions of the neural network to the rhythm of music, visually represented as a sort of abstract dream map. Thirty songs are available in the game in all, many of which can be unlocked by obtaining certain scores or performing a certain number of songs, however the Campaign mode embraces only half of them, to be completed in sequence by ~travelling~ in three specific areas of the brain; Prefrontal Cortex, Temporal Lobe and Limbic System. At the end of each brain area, a ~boss~ piece must be tackled in which it is necessary to overcome the so-called mnemonic barriers, specific series of arrangements that can cost the player dearly in case of errors. But how exactly does Amplitude's gameplay work? Our spacecraft, as specified, flies above five colored tracks that represent the individual instruments that give body to the song: pink is the drums, red the guitar, green the voice, yellow the synth and blue the bass. The musical track has a sort of skeleton that the player can enrich and modulate according to the track he decides to follow: once the sequence is completed, hitting the gems with the dedicated laser, you move on to the next one, ringing the series, which are the basis of the best scores. The four Beat Blasters, namely Raven, Chubs, Boxy and Shogun, have three colored indicators placed in front of the hull which act as a viewfinder for the targets, or the gems distributed on the track. By default they are assigned to the L1, R1 and R2 keys, respectively left, central and right blast, however it is also possible to use square, triangle and circle, although this is a less intuitive solution. Practice and memorization of the pieces are essential to obtain noteworthy results, especially in the two more advanced levels of difficulty, where the precision and speed of execution must be simply perfect. In fact, the Beat Blasters feature di a limited amount of energy, which error after error decreases inexorably until game over if you are unable to replenish the appropriate indicator. In support of the player there are some bonuses that facilitate the journey in the neural network, for example by slowing down the pace of execution or automatically completing a sequence by destroying the track. By completing the campaign, the FreQ mode inspired by the old Frequency, the forerunner of Amplitude, is unlocked, and it is also possible to face quick games in the company of three friends thanks to local multiplayer. The goal related to online multiplayer was unfortunately not achieved in the Kickstarter campaign. Bass riffs The sonority of the songs that make up the Amplitude offer is electronic in nature, highlighting an experimental nature of the arrangements which for large sections is clearly built around the gameplay. While not all songs are equally inspired and catchy, overall they do their job very well; only in some cases they seem a bit too elaborate and chaotic. Tracks like Red Giant, for example, at the highest levels of difficulty are so complex to perform that if you don't deal with them with the appropriate preparation, the game over is revealed in the very first meters of the course. Fortunately it is possible to have fun with the Harmonix work even at the lowest levels, and listening to the music shaped through one's very personal ~touch~ is undoubtedly engaging and satisfying. It's a pity that the gap between the Intermediate and Advanced difficulty levels is really too sharp, and we also noticed that the DualShock 4's back buttons don't always respond effectively during sequences that require very rapid and agitated pressures. From a purely technical point of view, the title is fluid thanks to the sixty frames per second, and while not stupendous in terms of polygonal and effects size, the abstract images that accompany the journey through the neural network are in any case pleasant, showing geometric figures with a design in continuous change. The particle effects and the color palette are good, at the full service of the gameplay and the modern graphic interface.", "date": "2016-01-14", "grade": "S.V."}