{"name": "Dio non gioca a dadi", "ref": "https://multiplayer.it/recensioni/161860-tharsis-dio-non-gioca-a-dadi-ma-la-morte-si.html", "text": "Today's man looks to the stars with respect and admiration, hoping one day to overcome what in all respects has become the new frontier of the intellect and of the human being. We would like to be able to take a shuttle and walk on the Moon, imagine a colony on Mars, assume the colonization of new habitable planets similar to Earth. All very nice, pity that there is a small problem: a bit like the frontier of western films, space is a very dangerous place where any mistake is potentially fatal. If you don't believe us, try Tharsis. This simple but very bad indie title is basically a single player board game, in which we have to control four members of a spaceship bound for Mars where everything will go wrong. The goal is to make it in ten rounds, juggling between breakdowns, food, madness and cannibalism. Tharsis: a journey to Mars between breakdowns, madness and cannibalism! Space, last curse Just to immediately put us in the right mental predisposition, Tharsis' tutorial, perfect in explaining the basics of the game clearly, begins with the death of the fifth crew member. Every time we start a new game we will do it from the exact point where the poor guy leaves us pens, and trust us if we tell you that this thing will happen very, very often. The rest of the story of Tharsis is narrated through small cutscenes between one turn and another which, unfortunately, will always repeat the same in each session, even if fortunately we will be able to skip them instantly. Our knowledge of the story will only be based on how good and lucky we are to progress in the game, know however that it will be very difficult to see the end because, perhaps you have guessed it, Tharsis is a damn difficult game, bordering on sadism that fits into that vein of complex and bad titles in the style of FTL, The Banner Saga and so on. It's basically like Gravity or The Martian, but worse. The whole game is based on a variable number of dice from six with which we will be able to decide whether to repair parts of the ship, heal the crew, progress in research or obtain food. Each die is invaluable and absolutely cannot be wasted because its placement can mean the difference between another turn or a horrible death. In truth there isn't a moment in the game where the aforementioned horrific death isn't near as a grim specter looming over the entire mission, it only takes a single unlucky die to plunge everything into the deepest muck and ensuing storm of punches on the table dressed up with insults. Welcome to Iktomi Our unfortunate vessel bound for the red planet is divided into seven sections, each with a specific function. The hospital will treat injured astronauts, the greenhouse will provide food, the communications center allows you to talk to the base and reduce stress. Each turn one or more of these sections will suffer failures that may affect the ship's hull or injure the crew and must be repaired within the same turn to prevent this from happening. To do this we will have to place one of the four astronauts in the appropriate module and roll the dice and it is here that the sadism of the game is revealed in all its grandeur. Each failure can be repaired by adding up a certain result of the dice; so if it's a 26-point breakdown, try to send the member with a high enough number of dice to resolve the situation within the turn. Yes, because at every shift in which they don't eat, the astronauts lose a die, becoming hungry and useless over time to solve even the least critical situations. To avoid this problem, we either spend some dice in the greenhouse or well, the corpses of our dead comrades are still in the icebox, ready to be thawed and used as emergency rations. The cost will be one life point and the mental balance of the crew who will start making less and less rational decisions. In fact, at each turn we will also have to decide between two different choices that will influence the subsequent moves, such as choosing whether to repair the hull or to heal oneself, but the more stressful the situation becomes, the less these choices will make sense. Ah, as if that weren't enough every time we try to repair a part of the Iktomi, rolling out a certain number could make the die disappear or take away a life point from the astronaut. To overcome this problem there are the so-called Assists, or a life saver that eliminates the effects on the dice. The problem with these assists is that they are few and automatic, so we won't decide when to use them which is particularly frustrating because perhaps we are willing to lose a die but not to suffer the damage that would kill the astronaut. Appi to a die In Tharsis it is essential to understand when not completely repairing a damage and risking damaging the ship is a necessary sacrifice to use the dice more profitably, but also how to use any dice that are left after solving the problem. In fact, each character has a special ability that will be activated using a die with at least five points: the doctor can cure a companion, the mechanic gives one life point to the ship, the captain adds one die to a companion, the technician gives two assists and so on. If we prefer then we can choose to use the dice for scientific research. If desired, it is also possible to unlock new astronauts by completing certain objectives, such as eating at least 300 rations of human flesh or finishing the game at least once. In this case we will have to place the die in the slots below, one for each score obtained. We will therefore not be able to use two or more dice on which a six came out, but six dice with six different scores. Depending on how many dice we choose to use, we will then be able to exploit special powers that will repair the ship, lower general stress and have other very useful effects that can turn an impossible situation into a potentially deadly ~only~ one. In fact, there is never a moment in which there is not something to do or the situation can be managed calmly, the randomness of dice and failures makes it practically impossible to apply a strategy that is always valid, each round has its own story and the problem little of the previous round can be the cause of our death a moment later. This continual hanging by a thread that only chance can cut makes the games in Tharsis a matter of luck more than strategy and eliminates part of the fun, because even the most sensible reasoning collapses in the face of the inevitable sentence of one who had to be a five. If the goal was to make us feel alone and hopeless in space, it has undoubtedly succeeded. Another flaw of Tharsis is that being a game made up of short and brutal sessions, over time you tend to detach yourself emotionally from the astronauts. So, if the first time we cry for the disappearance of the coach, who died electrocuted in a short circuit, after the tenth game we can't wait for someone to die so we can have some food. Ah, there's also a ~hard~ mode if you want, but we didn't even get close because we were afraid of waking up the next day in space.", "date": "2016-01-13", "grade": "7.8"}