{"name": "Anche gli elefanti uccidono", "ref": "https://multiplayer.it/recensioni/161764-assassins-creed-chronicles-india-anche-gli-elefanti-uccidono.html", "text": "In recent weeks, the hypothesis has been growing that the next ~regular~ episode of Assassin's Creed could skip 2016, interrupting an annual cadence that began with the second chapter. We do not mind this, in theory, because the additional time available could be used to increase interest in a saga that has been published at a constant pace for years, not to mention that it would translate into more time available for developers in order to take care of the quantity of content and the quality of the overall experience. Having made these due considerations, last April we delved into the Assassin's Creed Chronicles trilogy, a two-dimensional spin-off nestled within a three-dimensional setting that tells of three stories set in as many historical periods, with unpublished characters but continuous references to the main episodes, especially those starring Ezio Auditore. After nine months, we got to play with the second chapter, Assassin's Creed Chronicles: India, to ascertain how the developer, Climax Studios on behalf of Ubisoft, hasn't distorted the original formula but improved the quality of the experience to give an overall product superior. The review of Assassin's Creed Chronicles: India, a step forward from the previous chapter Playstation 4 trophies Assassin's Creed Chronicles: India offers 18 trophies, without offering platinum. Beyond those related to each sequence and completing the game, we have ones dedicated to specific objectives within the levels, such as getting the gold rating at least 30 times, defeating a certain number of enemies with gadgets and complete the missions within a certain time limit. To get them all, probably, you have to finish the adventure at least a couple of times. Arbaaz Mir the womanizer After controlling Shao Jun in China in 1500, the story moves around the figure of the assassin Arbaaz Mir in the context of India in 1841, precisely in the midst of the conflict between the Sikh empire and the East India Company. Within the latter there are several Templar infiltrations, and the purpose of Arbaaz, among other things, is to recover an artifact in their possession. For this second chapter, therefore, the developers have abandoned the gloomy trait and reddish tones, in favor of one dominated by soft colors oriented towards green, yellow and orange. The results, in our view, are superior to those obtained previously, not only for the stylistic choice, whose preferences can be subjective, but also for the creation of the backgrounds and for the overall detail. In Assassin's Creed Chronicles: India there are, in fact, several evocative glimpses, more transitions in three dimensions by camera and a generally better frame rate stability, subject to some uncertainty still present. The control system, on the other hand, is substantially identical: with the left analog you walk, to run you have to hold down the right trigger, which also works together with X for jumping and switching from one handhold to another. With the square there are the light attacks, with the triangle the heavy ones. In the previous episode we ~complained~ about a not exactly immediate response to the commands especially in the chained actions, in this case we have a slightly better situation with the same practice necessary to assimilate all the moves available to the protagonist. Major differences are felt in the gameplay; not so much in its foundations, which include stealth sections or passages to the white weapon, rather in a decidedly more mature and articulated level design, which first of all almost always suggests going unnoticed, as it should always be, then proposes a tangibly superior variety of situations . Playing with the Ubisoft title we used almost exclusively the stealth component, the implementation of which for this episode manages to better disguise an artificial intelligence that remains scholastic as before, but in fact does less damage because here it is better possible to perform silent killings. Furthermore, where in China the classic action was broken only or almost by escape sequences that showcased the athletic skills of the main protagonist, in India we have greater variety within the levels - also read situations in which the rifle is used sniper - and above all some quite airy platform sequences, in which there are great climbs and insidious obstacles to overcome. Dulcis in fundo, in the main menu there are some unpublished challenges divided into three types, eachwith just as many objectives that contribute to unlocking the next levels. We have the timed challenge to recover all the Helix holograms, for example without touching yellow areas or stopping in the walk, or a certain number of killings to be carried out in sequence according to different styles, to get to having to recover some contracts while avoiding entering the field of view of opponents. To complete Assassin's Creed Chronicles: India it takes at least 3-4 hours, thanks to levels of extension greater than the previous chapter. Once the game is completed, a higher level of difficulty is unlocked which allows access to further power-ups, linked to the score obtained in each sequence and to a multiplier that increases if you pass the sections with a gold shadow degree, i.e. without entering open conflict and being singled out. There is no shortage of tougher antagonists, in the form of key characters for the story and impossible to eliminate unless first stunned with the gadgets available from Arbaaz Mir. The latter are of four types and are selected with the DualShock 4 digital cross, they include smoke bombs, knives for cutting ropes, firecrackers to direct enemies away from the protagonist and the ever-present whistle to distract them. Finally, the Helix bar allows you to enter a state of trance or to make yourself invisible even before the gaze of enemies, and then eliminate them as soon as possible.", "date": "2016-01-11", "grade": "8.0"}