{"name": "Mano tonante", "ref": "https://multiplayer.it/recensioni/161679-whats-under-your-blanket-mano-tonante.html", "text": "What's under your blanket!? it's a masturbation simulator, which is already contradictory in itself because you play it alone and in the dark, i.e. in the ideal conditions for practicing the real active simulated on the screen. No, oh well, you can also play in full light and with someone next to you, but the situation changes little. We were saying, you are there experiencing the force feedback of your joystick when some nuisance falls into your privacy for reasons that are almost always completely useless. Stuff like ~it's ready to eat~, ~lend me a euro for parking~, ~grandma is dead again~ and stuff like that. Fortunately over the years you get used to it and develop the right spider senses to understand if the footsteps you hear in the corridor are a threat to pelvic reflection or a sudden attack of dysentery from someone inside the house. In short, you become more and more skilled and shrewd in not getting caught, even if accidents can still happen. We believe that many of you have recognized yourself in this dignified and romantic description, and that the older ones, now equipped with children, have shed warm tears thinking about when they could have fun without compromise, that is, before their seminal fluid acquired the gift of speech and never let them sleep at night. But let's get to What's under your blanket!? which attempts to take us back to the years of innocence, when the hand ran free over the prairies of the imagination. What's under your blanket!? is a masturbation simulator. Need more to read the review? faplay The game puts us in the role of a boy who wants to masturbate without being disturbed by fathers, mothers, sisters, grandparents, cats, bodybuilders and even Santa Claus. Ours is a true professional in the sector and, equipped with a blanket and his ever-present heart-shaped underpants, he can do it everywhere: at home, in the hospital, under the Christmas tree and even in the gym. In terms of game mechanics this translates into: A, bring the pointer to his pelvic area under the blanket; B, repeatedly press the left mouse button listening for the sounds coming from the corridor; C, stop when footsteps are heard; D, wait for the nuisance on duty to leave to get out of bed; E, close the door and start over from point A. The goal is to fill the bar at the bottom of the screen before time runs out, but without getting caught, otherwise fap over. The faster you click, the more the excitement multiplier increases, the faster the bar fills up. The problem is that if you get too carried away and the multiplier exceeds a certain amount, the hero's penis catches fire and the game ends with the intervention of the firemen. Every now and then in the rooms, instead of the usual nuisances, special characters arrive who must be hunted by clicking on them with the mouse, like a nurse in the hospital or grandfather when we are in front of the computer. Leop, faces Tarzan Between one session and another of smanaccio you also have to face bosses arm wrestling, always beatable by clicking as quickly as possible on the mouse (in this case, if you don't click or if you are too slow, they fill up the bar) . The game ends after the fifth boss, really tiring to overcome, electing us fap world champions. The whole thing takes about a quarter of an hour ... let's make it twenty minutes, since five are needed to understand the mechanics and adapt to the bad control system, which despite having to manage two actions manages to do it very badly. In fact, it doesn't make much sense that you should use the mouse to masturbate (it would have been much more convenient to use the keyboard) and it has a certain effect to see the character get stuck when he has to go and close the door. But What's under your blanket!? it's not a normal game and it's childish to give him fleas as if he were. Less childish is to define it for what it is: completely useless. The idea itself also makes us smile, but after a few seconds the teenager inside us dies a little and fills us with sadness, not only for the game, but also for ourselves. So we begin to see the dead seasons, the time of our sweet life and the top of the ancient tower, with that damned lonely sparrow that takes on a very different sense from what it should have. There is no salvation in despair.", "date": "2016-01-08", "grade": "1.0"}