{"name": "Final Fantasy VI", "ref": "https://multiplayer.it/recensioni/161621-final-fantasy-vi-una-conversione-firmata-kefka.html", "text": "When we talk about the best JRPGs of the 16-bit era, we must necessarily remember the masterpieces baked by Square for the SNES, and what comes to mind - often even before Chrono Trigger - is Final Fantasy VI. It is no coincidence that many fans of the famous brand also consider it the highest point reached by the genre, as well as the best Final Fantasy ever today. Over the years (and Final Fantasy VI has twenty-two!) we have played various conversions, and it was only a matter of time before Square Enix decided to bring the much talked about release originally developed for mobile systems to PC as well. Here, then, is that Final Fantasy VI arrives on Steam in a version that does not in the least do justice to the importance of the phenomenal JRPG released in 1994. The PC version of Final Fantasy VI, one of the best JRPGs ever, leaves a lot to be desired Better a Chocobo today... The introduction of Final Fantasy VI made history and set the ~mood~ of the game perfectly: unlike its five prequels, the sixth Final Fantasy is set in a world halfway between fantasy and steampunk, devastated by wars and conflicts. Having abandoned the colorful and carefree atmospheres, so to speak, of the heroes in search of crystals, the story of Final Fantasy VI follows the vicissitudes of a heterogeneous cast of characters, jumping from one to another until bringing them together in a carousel of micro-stories linked by a common thread: Kefka Palazzo. He's one of the most evil villains ever created, stuff to give Sephiroth nightmares, and the worst thing is that at one point he even wins. On the other side of the fence we have historical heroes like Terra, the half-Esper, or Locke, the gentleman thief, not to mention other iconic figures like the enigmatic ninja Shadow, the mysterious Setzer, the Figaro brothers, the embattled Celes... In short, it is impossible not to fall in love with at least one of these extraordinary characters, and it is they, all in all, who make the simple storyline of Final Fantasy VI an unforgettable adventure. In this sense, the Square Enix work has not lost even a shred of its original magic, but the conversion has unleashed a hornet's nest due to the graphic restyle that replaced the original pixel art with rounded and colorful sprites that seem to come out of the last version of RPGMaker. Mind you, this is not a catastrophic change; on the contrary, to be honest the sprites in question, both of the monsters and of the characters, are detailed, animated more than discreetly and even pleasant. Nostalgia is rogue, however, and Final Fantasy VI, when it was released for Super Nintendo, was certainly one of the most visually complex and elaborate titles on the market. It has remained so for years, and it is a pity that Square Enix has decided to sacrifice its retro beauty in favor of a more modern, but also much more anonymous, graphic style. From a technical point of view, among other things, the contrast between the new sprites and the ~remastered~ 2D backgrounds sometimes appears a bit blurry, almost botched. Fortunately, Square Enix hasn't touched up on Nobuo Uematsu's original soundtrack which, on the contrary, seemed to us to be a little more fit than the previous Game Boy Advance and PlayStation conversions, and remains one of the best ever composed by the very famous Japanese musician. ... what a bug tomorrow Now that we have thrown behind what is generally considered the biggest problem of the new edition of Final Fantasy VI, or the graphic restyling, we can deal with decidedly more important matters. For example, we could argue that this PC port uses the exact same interface as the mobile versions of the game, with all the consequences of that. We could underline that the game diary, which summarizes the storyline and is updated with each new progress, does not take into account the choices made in the moments in which it is possible to alter the course of events, generating a lot of confusion. We could highlight the inconvenience of having to change the settings from the launcher, since it is not possible to do it once the game has started, and suggest that configuring a possible joypad is not only irritating, but also harmful since the software, from time to time, tends to crash only for this. And while we're at it, we could infer, remembering that until a few weeks ago you couldn't play in offline mode, and that cloud saves regularly went crazy, erasing players' progress to member of hound. But why dwell on all these examples, when it is enough just to point out that the port, born in 2015, does not exceed the maximum resolution of 1360x768 pixels, and occasionally sports a very nice tearing effect? Not only. This verseone of Final Fantasy VI continues to give trouble in the same, identical moments in which it happened on Android and iOS, overwhelming proof that the code has remained essentially the same. It's a great shame, because between one bug and another there is an incredible JRPG that is absolutely worth playing, but the way it was proposed, we might as well have authorized the ROM emulation for Super Nintendo and best wishes.", "date": "2016-01-08", "grade": "4.0"}