{"name": "FIFA Street 2", "ref": "https://multiplayer.it/recensioni/fifa-street-2_c.html", "text": "The ball is round Having to give dry answers we would say yes but not so much to the first question and a decided no to the second, but this is a review and therefore things need to be just a little more in-depth As far as the game modes are concerned, FS2 follows the classic of the Made in USA tea towels: there is the possibility of taking command of a national team made up of the greatest champions of a given country (obviously with all the right names in the right place, being able to take advantage of the official license), choose the own opponent, the place to play, all the various rules, level of difficulty and committing to a single game. Or, alternatively, it is possible to create your own avatar from scratch, insert it in a team and take everything from the suburban pitches to the most enormous, spectacular, important pitches on the world stage. The customization options are a satisfactory number, considering that we are talking about a DS game, and above all they range from the actual physical appearance to clothing up to gadgets; the development of the career is not dissimilar to what has been seen in a thousand other titles of the genre: you start from absolute zero and you have access only to the pitch in Marseille, where you can only try your hand at the beginning in friendly matches useful for collecting money, or Cash Points. the development of the career is not dissimilar from what is seen in a thousand other titles of the genre The ball is round With these you will be able to improve the characteristics of your alter ego, face special matches in which the prize is the entry into your team of a new player more talented than the pitchers you play with, and finally register for the knockout tournament, having won the which you finally gain access to the next setting. These are numerous and scattered across all continents of the globe, going from each city to reproduce one of the most characteristic places: in Rome, for example, you will play under the imposing ruins of the Colosseum. Parallel to your victories, both the caliber of your opponents and your reputation will grow, gradually until you face the greatest champions of the world; finally, you will unlock increasingly trendy and fashionable clothing and gadgets as you progress. The very classic wireless multiplayer mode closes the scene, unfortunately for only two players each with his good game card. and Penalty is when the Referee blows his whistle Once on the field, the profoundly arcade soul of this game immediately emerges, which initially takes us back, not without some nostalgia to the atmosphere of the big party at home that we all experienced as kids, when everyone felt like a little Oliver Hutton (but I was rooting for Mark): the settings are in fact strictly road-based, and reproduce, as we have already remarked, the typical atmosphere of a specific country. Each team has only four players available and any division between roles, apart from the goalkeeper, which even theoretically exists is canceled out by the small size of the team and the pitch, just as it was done when two jackets were enough to delimit a goal The control scheme base is reduced to the bone, consisting of a low pass, a high pass, a shot to be directed via the directional cross and a comfortable radar located in the lower part of the upper screen, where the game action is displayed, and the run button, which however it doesn't affect player fatigue simply because this attribute doesn't exist. In defense, soft tackle and bad slide, never sanctioned. However, the heart of the game are the ~tricks~ available to each player However, the heart of the game action are the ~tricks~ available to each player, also called feints, dribbles, gabolas, tricks or, a particularly apt Neapolitan definition and which from now on we will officially adopt, ~diseases~. The repertoire of diseases, although numerically not vast, is nevertheless spectacular and ranges from the most classic dribbling devoid of any malice, to real masterpieces of football sadism with which to deceive the artificial or human opponent's intelligence and leave it with the palm of the nose continuing unstoppable the advance towards the door. Diseases are absolutely vital in a game: they ensure solid money with their execution, perhaps in a combo that feeds the team's coffers even more, they are nine times out of ten the only way to overcome an opponent and even wanting the extreme defender, feed the Gamebreaker bar (we'll be back in a very short time), are spectacular and, theoretically, very funny. Why theoretically? Simply because while on the console the execution of the tricks is entrusted to the right analog stick, perhaps in combination with the dorsathere, on DS you will have to resort to the touch screen. And if you've always wondered why Nintendo has equipped its laptop with the so-called thumb strap to be placed on the thumb, with FS2, which one time out of three does not correctly interpret the movement impressed by the bare finger (because otherwise how do you press the buttons? ) you will finally have a clear and decisive answer. But what if the referee isn't there? It is a problem that can also be very frustrating, but it is not the only one in the game and not even the most serious, given that you can also get used to it, pardon the pun, rather soon; in general it is all the game action that shows the side to a series of criticisms. Although it keeps intact all its characteristics of speed and spectacularity, it has intrinsic defects related to its fundamental repetitiveness: forget about setting up a game action as God commands, here it's all a ball ahead and pedaling even beyond what the genre would recommend, and the matches are reduced to a continuous execution of the most varied tricks in order to overcome the opponents, increase the points and get to the Gamebreaker. Which in itself is not a defect, there are those who want Winning Eleven and those who are interested in FIFA Street, but are frustrated, as well as by the aforementioned difficulties in control, by the spectacular lack of effectiveness of the Gamebreaker (action present in all titles EA Big and which here is reduced to a simple shot that will be successful in 99% of cases) and above all by a simply ridiculous artificial intelligence. There are countless sensational mistakes made by opponents who repeatedly score own goals, pass behind marked teammates when perhaps they are free in front of goal and who simply don't care about the match when they are at a great disadvantage, thus recalling a historic FIFA bug ' 98 for Nintendo 64. in the face of such a picture, spectacular graphics [...] and exemplary sound are of little value But what if the referee isn't there? And there are even real bugs, such as the goalkeeper who, before making a clearance, runs backwards to recover the right position, except clamoring against the edges of the field and then continues undaunted to look for a position that he had actually found ten meters early until time runs out. Furthermore, by increasing the difficulty, the situation, if possible, gets worse, because the bugs obviously don't go away, and all that the program limits itself to doing is forcing the poor opponents to carry out repeated illnesses, without ever moving from their position. and make the goalkeepers real shutters that can be overcome, and not even always, only with a Gamebreaker, which makes it all quite frustrating. With the multiplayer mode, most of the problems related to poorly implemented AI are solved, but the bugs and goalkeepers remain the same, and furthermore the doubles game itself is poorly explored. And then, faced with such a picture, spectacular graphics are worth little, the only flaw of which is to be found in the relative dirt of the image and which presents detailed, big and above all animated players with a naturalness, fluidity and spectacularity that on a laptop they become a real feast for the eyes, and an exemplary sound that reproduces from the small speakers of the DS eight rigorously complete and sung, and also quite beautiful, licensed tracks in a clean way. If video games were just a demonstration of technical prowess, they would be called animated cinema Comment It's a real shame that things went like this, even more so because anyone who comes across the ~regular~ FIFA DS today will find a surprisingly enjoyable and thick football. Instead, its street version suffers both from intrinsic limitations of the game structure, which the title carries with it from the console versions, and from an imperfect implementation of the DS features, and above all from a horrible and buggy artificial intelligence. What remains is an exemplary technical realization and a harbinger of many satisfactions and some objectively funny moments of the game, together with a multiplayer that, as always, slightly improves the general situation. But there is little left to justify the purchase.Pros Spectacular graphics and sound on a laptop Initially it can exalt Cons but the limits soon emerge ..and an AI to be rejected on the whole line! For several years now it has been the custom among the most renowned American software houses to combine the obligatory (at least until EA Sports will finish canceling the competition to the tune of millions of copies sold) with regular sports series with more or less ambitions simulation, another series, more alternative and in some cases even fantasy, with rules and sitown actions aimed much more at emphasizing the show and the furious playability typical of the arcade than the faithful reproduction of the sporting event. If we remember correctly, EA wasn't the first, the palm should go to Midway and its NFL Blitz, but the American giant still didn't take long to seize the ball (literally!) with NBA Street, the first title in the Big series. Since then, various disciplines have been the subject of an extravagant reinterpretation, and could football perhaps be missing, which with FIFA International Soccer has been guaranteeing EA monstrous income and image recognition for more than a decade now? Obviously he couldn't: but FIFA Street was objectively a bad game, the publisher took note of it and set to work to improve everything there was to improve, while leaving the game philosophy substantially unchanged; and while he was at it, he even made two portable editions. There are basically two questions to answer when reviewing the DS version of FIFA Street 2: has the game improved compared to the first chapter? And EA, after the excellent exploit of the regular FIFA, will it have managed to create a portable football finally worthy of the name?", "date": "2006-03-17", "grade": null}