{"name": "Blind Fate: Edo no Yami", "ref": "https://multiplayer.it/recensioni/blind-fate-edo-no-yami-recensione.html", "text": "The myth of the blind samurai reinterpreted in a cybernetic key against the background of a new post-apocalyptic Edo period, in which hordes of robotic Yokai have set cities on fire, constitutes the solid narrative foundations of the new action developed by the Italian team Troglobytes Games. An undoubtedly ambitious project, just think of the fact that it was launched simultaneously on all platforms; endowed with a potential that already appeared clear at the time of the first demo, and that we were really curious to verify by trying our hand at the final version. It took longer than expected, but we're here now. Has the game kept its promises? We reveal it to you in the review of Blind Fate: Edo no Yami. History Blind Fate: Edo no Yami, the protagonist talks to Tengu The story of Blind Fate: Edo no Yami tells the story of Yami, a demon hunter in the service of the Shogun who is deprived of his sight and reduced to death by a warrior goddess. Rescued by a mysterious cyborg, the samurai is given various bionic implants but his eyes do not regain vision, forcing him to use the sensors of an Oni mask to perceive the environment around him.Strengthened by his new abilities, Yami returns to fight in search of revenge but gradually discovers that things are not as he imagined. What is really behind the invasion of robotic Yokai? Who is the warrior goddess who nearly killed him, dooming him to eternal darkness? And what role does Tengu, the artificial intelligence that gave him a new life, play in all this history? To find out the truth about the game's post-apocalyptic Edo period we will have to explore various locations within a campaign whose duration would in theory be around five hours, but which is substantially extended by the inevitable repeated attempts to complete the levels after the game over and the possibility of returning to the maps already visited in search of any secrets. Between one expedition and another we will be able to return to the Dojo, the refuge of our savior as well as the place in which to mount the upgrades collected around, use the experience points earned to unlock new skills, try your hand at tutorials of all kinds and maybe spend a few seconds dispensing cuddles to Tengu's gigantic robotic ~dog~. Gameplay Blind Fate: Edo no Yami, the charm of the futuristic city of the first levels. Spoiler: It's an illusion. Although the formula behind the experience is that of a two-dimensional action, various contaminations find a place in the gameplay of Blind Fate: Edo no Yami. The stamina that regulates the character's ability to deliver blows, jumps and dodges is the one that is generally found in action RPGs, as well as the general degree of challenge, a sharp management of checkpoints and some sensational peaks of difficulty bring to mind the sub-genre of soulslike.Those who imagined metroidvania mechanics will have to think again, in the sense that the exploratory element within the campaign is practically never developed, the possibility of switching from the normal view to the one focused on sounds, heat and smells proves to be less central than we think we waited and indeed the sequences in which we are simply asked to travel a stretch of road and continue towards the next section of the scenario are wasted, at the latest after having moved an object to jump on or having broken through a wall: a pity. Blind Fate: Edo no Yami, the scenario perceived based on sounds The correspondence between what Yami's sensors perceive and the actual connotation of the map, to be updated by appropriating the data of some defeated enemy, is therefore confirmed as little more than a gimmick (albeit visually suggestive in the transition from ~memory~ to reality). while the moments in which we find ourselves faced with improvised design solutions are wasted, with the game asking us to guess certain interactions or mechanisms that have never been introduced before. However, the fights are the fulcrum of the Troglobytes Games title, characterized as told by a degree of challenge that is anything but trivial. We will be able to hit enemies with rapid blows, always net of stamina, and resort to a spectacular arm-cannon which in certain cases can daze the opponents and allow us to perform a quick quick time event to immediately put them out of action, parry some blows and dodge them others, trying to memorize the pattern of every single Yokai in order to avoid surprises. Blind Fate: Edo no Yami, a fight sequence Furthermore, after a few successful attacks, we will be instructed to activate one of Yami's three sensors (sounds, heat, smell) not to perceive the environment differently, but to execute with thesword a flash maneuver of great visual impact, with typically Japanese traits, capable of inflicting huge damage to the enemy on duty and thus reducing the usually long times that characterize some duels. The problem is in fact that our blade generally inflicts damage limited, while the conspicuous variety of Yokai that we will face is able to reduce us to death with just a couple of hits, or even kill us instantly in the case of the more dangerous and advanced bosses. Remedying these situations is complicated, given that medikits and additional magazines for the cannon arm are not given in abundance, far from it. Blind Fate: Edo no Yami, the moment of true blasphemies The hardcore approach, which is surprising considering how the difficulty level is set to ~easy~ by default, unfortunately produces extremely frustrating situations when it is combined with the aforementioned angular management of checkpoints, which sometimes force you to start entire levels from scratch in case of defeat, and with a peak that is perceived very clearly during one of the last boss fights in the Forge. In this situation you will find yourself overwhelmed by a monster with two health bars as long as the entire screen, which can kill you in an instant collapsing on top of you, to which you are unable to inflict very little damage each time and which cyclically recalls hordes of Yokai who will try to slice you while flying units continue to target you with precision shots, all without any possibility of recovering energy or ammunition. The festival of blasphemies. Technical realization Blind Fate: Edo no Yami, one of the quick time events to eliminate dazed enemies If on the gameplay front the path taken by Blind Fate: Edo no Yami is full of uncertainties, on the technical side there is no doubt that the developers have done a great job, making the best use of the available resources and giving us an almost always very pleasant visual sector. In fact, net of some small expedients that reveal the inevitable budget limits of a fundamentally independent production, the post-apocalyptic Japan of the game can count on a convincing representation, at times even evocative, especially in the first stages. Blind Fate: Edo no Yami, a forest scenery However, the protagonist role is played by the characters, from Yami with his creepy armor and Oni mask to the many Yokai that we will find ourselves facing during the adventure, able to offer a fascinating meeting point between features of the monsters of Japanese folklore and their mechanical reinterpretation. The audio system supports the experience in a more than discreet way, alternating well-interpreted dialogues in English and more or less solid effects, as well as a soundtrack that however we hoped could give us some emotion more, and which instead remains for the bulk of the time to act as a simple and harmless background to the action.", "date": "2022-09-28", "grade": "6.7"}