{"name": "Agente pennuto a rapporto!", "ref": "https://multiplayer.it/recensioni/160887-rocketbirds-hardboiled-chicken-agente-pennuto-a-rapporto.html", "text": "Chickens and penguins. Weapons and jetpacks. And a fair amount of platforms. Not much else is needed to briefly describe what Rocketbirds: Hardboiled Chicken has to offer, a volcanic scrolling platformer with shooter elements that will be downloadable for free for a few more days as part of the PlayStation Plus Instant Game Collection for the month of December . After making itself known at the 2010 Independent Games Festival and making its debut in a flash version under the name of Rocketbirds Revolution, the title developed by Ratloop Asia also landed on PlayStation 3 and PlayStation Vita between 2011 and 2013. As you say ? Has much water passed under the bridge since 2013? Undoubtedly true but, since at the time there was no way to review it, we preferred to make up for the lost opportunity, also because it is definitely worth diving headlong into a frenetic and excellent quality adventure starring the improbable all-rounder Hardboiled Chicken, moreover in a guise that gives its best in portable form. Rocketbirds Hardboiled is a very successful platform shooter, especially on PlayStation Vita A chicken and an army of penguins Like all self-respecting special agents, Hardboiled Chicken also has a troubled past from which to escape. The skeletons in the closet must be exorcised and therefore our brave feathered hero decides to embark on a suicide mission to definitively put an end to an oppressive totalitarian regime erected by an army of penguins, suffering from pseudo-protagonism delusions and with some evident predilection for Augustus Pinochet and the like. In fact, Rocketbirds does not intend to take itself seriously, on the contrary it stages an irreverent representation of totalitarianism, even making fun of the usual upright hero called to save the world. The Ratloop boys wanted to be inspired by the many films that belonged to the B-Movie genre of the 80s, not even failing to pay homage to a master of the action genre like John Woo. And in fact, shooting in Hardboiled's shoes can only cause big smiles, converted into broad nods of approval as soon as you have the opportunity to test the excellent control system that has been prepared for the PlayStation Vita version. The shooter mechanics are reminiscent in many ways of a timeless classic of the past such as Contra, an arcade title that was very successful between the 80s and 90s and will certainly be remembered with pleasure by those who have a few more years on their shoulders. Obviously here the difficulty level is significantly lower, but some very specific features such as the possibility of shooting only horizontally, the presence of enemies from both sides of the screen and the opportunity to crouch down to dodge bullets are the main ones elements of connection with the past. The weapons are decidedly traditional, ranging between the usual assault rifles and shotguns, pistols and explosive grenades, while the selection mechanics of each item of equipment are very quick and intuitive, placing themselves in perfect harmony with the general spirit of the game. Moreover, alongside the traditional platform levels, a series of interlude sequences aboard a jetpack have also been created, during which the game will be converted into a classic shoot'em up. In these moments Hardboiled will rise into the sky and will have to break down all the enemy anti-aircraft resistance, dodging bullets and homing missiles, and then enter the structures, start the self-destruct mechanism and leave the area before it's too late. Playstation 4 trophies Rocketbirds Hardboiled has a total of thirty trophies, including 17 bronze, seven silver and six gold. The objectives cover both the single player campaign and the co-op. Puzzles and mind hacking The original version of Rocketbirds has been expanded with various extra content, from the introduction of new weapons to the expansion of the number of cutscenes, up to the just mentioned presence of the levels on board the jetpack. The longevity isn't great but the presence of two different game modes makes the overall offer a little more extensive than it was in its first incarnation. The single-player campaign extends for a total of fifteen chapters, while the cooperative mode is designed to give the possibility to complete a second and separate walkthrough lasting ten chapters in the company of a friend, which can be experienced through an online match or via the traditional ad hoc mode. In this second assignment you will take on the role of Ripper and Roper, an equally improbable commando of gunner chickens who will have to find,recover and bring to safety the daughter of the general. But beyond the very successful shooter mechanics, divided between platform levels and aerial shootings, Rocketbirds also offers some other goodies. In fact, the resolution of environmental puzzles is often provided, useful for unlocking doors and gaining access to subsequent areas. To tell the truth, the structure of these sequences is not particularly complex and a high mental effort is not required to be able to figure it out. Nonetheless, some fun remote control mechanics of enemies come into play, which can be implemented thanks to a particular type of stun grenade. By doing so, you can infiltrate behind the lines without problems, easily make a clean sweep of any threat and finally unlock all those indispensable mechanisms in continuing your journey in the role of Hardboiled. This tool has proved to be well balanced compared to all the other phases of the game, never an end in itself and fun to use in its simplicity, also by virtue of the peculiar form of interaction entrusted to the rear touch pad of PlayStation Vita, by means of which both the radius and the direction of the launches can be managed with good results. A special mention should be reserved for the soundtrack, really suitable in highlighting the moments of greatest frenzy and in filling both the intermission scenes and the clashes aboard the jetpack with adrenaline. All the tracks were created by New World Revolution, a Californian indie band that explores the meanders of the Science Fiction Space Rock genre.", "date": "2015-12-23", "grade": "8.2"}