{"name": "Ratchet & Clank: Rift Apart", "ref": "https://multiplayer.it/recensioni/ratchet-clank-rift-apart-la-recensione.html", "text": "In addition to being one of the first games officially announced for PlayStation 5, Ratchet & Clank: Rift Apart has always seemed the most concrete of all. Impressive and explosive right from the very first videos, the new exclusive that Insomniac Games has developed for the Sony console follows a thread as heterogeneous as it is valuable, which after the dark intensity of experiences such as Demon's Souls and Returnal, leads to a decisive change of tones and emotions . Our review of Ratchet & Clank: Rift Apart comes in a particular period, in which the gaze of video game enthusiasts is directed to the coming months, to the trailers and announcements of a summer season dotted with presentations and digital conferences. Woe to distraction, however, because while many are looking to the future, the present of PlayStation 5 has been enriched with a new and unmissable piece. Planets and levels Although the story of Ratchet & Clank: Rift Apart is based on a rather simple narrative premise, in the space of a few minutes it literally opens up new universes and new possibilities for the protagonists of the saga. Having saved the galaxy countless times, Ratchet and Clank are now heroes known and admired by all. During a parade held in their honor, Clank decides to amaze his best friend Ratchet by giving him a working Dimensionator, a gadget capable of opening glimpses into other dimensions, and which would allow the furry protagonist to find other Lombax. Too bad Doctor Nefarious steals the Dimensionator, and following a malfunction that has created dimensional anomalies throughout the universe, everyone, hero and villain, ends up in a parallel dimension. Here Nefarious is emperor and Ratchet's counterpart is Rivet, a female Lombax enlisted in the anti-Imperial resistance. From here on, a story takes hold that we leave you with the pleasure of discovering for yourself, and which in the course of the adventure entertained us, excited us and was able to give us a couple of very well-placed twists. Ratchet finds himself in another dimension The plot comes to life between the exploration of one planet and another, to all intents and purposes the various levels of the game, and here a first important clarification must be made. In all these months there has been a lot of talk about how Ratchet & Clank: Rift Apart exploits the power of PS5 to manage all the dimensional travel part, and we have firsthand heard the developers talk about ~Seamless teleport through stages~ or passages seamless between levels. In reality this only happens on some planets where, through the use of quantum crystals, Ratchet and Rivet pass from one dimension to another but always on the same planet. An expedient already used in the past by other videogame productions but pushed to the limit in Rift Apart that it can really be considered as the immediate transition from one level to another given the total difference between the dimensions. For all the other planets the loading with the animation of the spacecraft returns, but so short as to not even be perceptible as such but simply with a very short interlude. The menu will always indicate which of the two Lombaxes that particular level can be played with, and if you're wondering, no, there is no possibility to choose the character to use, while all progress in terms of arsenal, inventory and collectibles are shared between Ratchet and Rivet. We collect everything Rivet uses Hoverboots on Sargasso Apart from those exceptions just mentioned, the most usual levels of the adventure are much larger than those seen in the past and extremely denser, not only in terms of assets present on the screen but precisely as regards the contents. Each planet is overflowing, full of characters, enemies and crates full of Bolts (the bolts that make up the game currency); a riot of animations, particle effects and wonderful views that make everything extremely alive and vibrant, as well as continuously stimulating the player to use the rich photographic mode included in the options menu. A density that is also reflected in the activities offered by the internships: on average, in each level we will have missions related to the main plot, secondary ones that will provide rewards, different dimensional bags, and the search for two types of collectibles, Golden Bolt and Spybot . By collecting these little robots you will have access to the blueprints for a special weapon, the famous R.Y.N.O that appears in every chapter of the series, while the Golden Bolts allow you to obtain some cosmetic customizations and other extra options, including a useful indicator of the damage inflicted on enemies. The dimensional bags, on the other hand, are optional challenges with a strong platform nature, paths that require a little skill at the end of the q'swhich we will usually find a piece of armor. And, speaking of armor, there are several sets in the game, each consisting of a helmet, torso and legs; these provide different types of protection and can possibly be customized in color and mixed together. Optional platform Rivet in the first dimensional pouch If you like jumping, swinging on ropes and throwing yourself into daring stunts, you will surely appreciate the dimensional pockets of Ratchet & Clank Rift Apart, portals within the levels that project into bubbles where time has stopped, and which present the player with challenges mostly optional but often extremely interesting stunts. We liked these ingenious sequences so much that we not only wished for more, but also that Insomniac had integrated them directly into the main campaign. This is in fact dotted with fights, with entire platoons of enemies ready to make us skin, and the most interesting and most successful platform phases are relegated to the dimensional pockets. This obviously doesn't mean that there aren't interesting platform sections integrated more naturally with the adventure, but they are usually very guided and hyper-spectacularized. It will be the experience, it will be an effective lightening of the difficulty, the commitment required by the research of Bolt d'Oro and Spiabot seemed to us a little below the average of past episodes, whereas a simplification that we continue to appreciate is instead the criterion with which normal Bolts are collected during the adventure: if during a fight you have earned a certain number of Bolts from killing enemies, and then die immediately afterwards, you will not lose what you have collected before game over. On paper it seems like a strong facilitation but we, in all honesty, have never perceived it, thanks to a careful balancing of the amount of Bolts that are collected during each fight against a significant price to buy weapons ... and if you'll all want to sweat a lot of Bolt! Not to mention that, once the campaign is over, you can start the adventure again in Challenge mode, in which the difficulty increases significantly but you will have all your weapons already collected plus some that will be added in the shop. Quantum streams and antivirus Clank talks to Ratchet during the parade Before focusing on the weapons, however, we would like to finish the level topic, because special stages are added to everything already mentioned: the levels of Clank and a new character called Glitch. The former are made up of a succession of three or four mini-stages in which we are asked to restore the correct time flow: this is represented by an infinite series of Clanks running in line and the objective will be to lead this flow of dimensional echoes to their destination, creating a path using some special energy balls. There aren't many of these interludes but they are still well integrated and balanced in the general economy of the game. Added to these are also the small special stages of Glitch, a computer program that Ratchet infiltrates into the circuits of computers infected with viruses. The artificial intelligence is very reminiscent of the shape of the bots of the Spider Robot Glove, a gadget belonging to the past chapters of the series, but with a decidedly kawaii design that makes it truly adorable. Upgrade your arsenal Ratchet during a firefight But the fighting is the beating heart of Ratchet & Clank: Rift Apart and throughout the duration of the game we have perceived how much Insomniac has worked on this aspect. We had already had numerous advances on clashes, weapons and other gadgets and it makes sense to retrace the footsteps of what was already said in the preview but, this time, being able to also provide our evaluation pad in hand. When the developers mentioned the great work of balancing and perfecting the action phases of Rift Apart, they weren't joking at all: the fights are always very intense, with battlefields designed in detail and an ammunition respawn system that helps but without exceeding. What struck us in particular was the study of the spaces in which you fight, clearly designed to keep the player always on the move by exploiting the Fendilinks, the dimensional faults that allow Ratchet and Rivet to quickly reach a point in the arena, in addition to the base movement rates provided by jumping, Hoverboots (footwear that adds a speed boost), and Phantom Rush. The latter is really important because it provides a handful of seconds of invulnerability, perfect for dodging a barrage of bullets or a laser beam; forget one of quThese prowess in battle is tantamount to making your own life difficult. The variety of enemies present in the numerous attack waves is also designed to force the player to use his entire arsenal and not just his favorite weapons: surely during the adventure you will find the weapon that will steal your heart but not you will be able to use only that to the bitter end: not only because it may not be effective against a particular enemy, with each of these having its own specific weakness, but above all because it may not be functional compared to the amount of opponents. Pier Le Fer, space pirate In fact, the weapons are designed according to the quality and quantity of the enemies: there are some that aim to do a lot of damage to a single target and others that are useful for controlling crowds. For this reason, the quick choice on the directional cross and total customization of the entire wheel through the game menu is an obligatory step if you want to face the adventure at the highest difficulty levels. The upgrading of weapons follows the tradition of the saga: the more you use a weapon, the more experience you will accumulate, making it increase in rank. Increasing the levels of the weapon translates into the unlocking of upgrade slots, each of which can be activated by spending a piece of Raritanium, a crystal that joins the Bolts as game currency. Thus the Weapons of Destruction scheme returns, with a series of hexagonal slots placed side by side like a board: to access the most powerful features of the weapons it will be necessary to activate all the slots around the gold ones. The changes that a weapon can undergo during the upgrade are different, so as to even change the name of the weapon itself. The maximum level a weapon can reach during the campaign is fifth, rising to tenth by purchasing Omega versions of the same weapon in Challenge mode. The energy of Ratchet and Rivet will also increase during the adventure based on the accumulated experience. Pad in hand... finally! Ratchet uses a powerful weapon against an enemy With each trailer and presentation, the doubt that always lurked in our heads was: aren't these fights a bit too confusing? The answer is yes: the battlefields, when crowded, are really difficult to read at the beginning and it took us a while to orient ourselves despite our great familiarity with the series. Furthermore, on several occasions, which almost always corresponded to particularly agitated moments of the action, we encountered some uncertainty in the command feedback, with a somewhat slow response in jumps and dodges and a rapid weapon wheel, positioned on the directional cross, which did not he always responded appropriately. It must be said that there is a way around the problem, but we will talk about it later in the paragraph dedicated to the technical aspect. What Rift Apart, however, succeeds in a splendid way is to return the game action to a tactile level through Dual Sense. Also in this case the developers had spent many words on the work done with the PlayStation 5 pad and how every single element of the game produced tactile and / or auditory feedback. By activating the ~experiential vibration~ option, each weapon will react differently, some taking advantage of the double stroke of the left trigger while others will emit their sounds through the pad speakers; even the mounts in the game give a different sensation based on the animal ridden while in the stages with Glitch you will hear a pleasant ticking every time the robot puts its paws on the ground. Ratchet uses a Fendilink The work done on the audio effects is also truly remarkable, not only for those already mentioned that come out of the Dual Sense: each element present in the level produces its own peculiar sound, which is very useful for understanding if you have an enemy behind you or if you you are leaving a Fendilink on the street. These are surrounded by a blue border that turns gold when we get close enough to use them, also producing a distinctive noise. Obviously we are talking about a sensory experience that not everyone can access but this is absolutely not a disadvantage because every aspect of the game can be compensated with a specific accessibility option that assists players in every need, whether this is due to motor or visual impairment or auditory. Playstation 4 trophies There are a total of 47 Ratchet & Clank: Rift Apart for PlayStation 5 trophies, divided into 36 Bronze, 7 Silver, 3 Gold and 1 Platinum. Rift Apart breaks a historical tradition of the saga, eliminating Style Points. Debuting on PlayStation 2, therefore in a historical moment in which the PlayStation Trophies did not yet exist, these challenges were established to add some spice to the adventure.", "date": "2021-06-08", "grade": "9.4"}