{"name": "Gemme e carte", "ref": "https://multiplayer.it/recensioni/160909-magic-the-gathering-puzzle-quest-gemme-e-carte.html", "text": "Forgive us for being English: ~a match made in Heaven~, ~a match made in Paradise~, is in the language of Albion the way to describe the union of two things that go together really well. And this is precisely the case of Puzzle Quest (which so far has hybridized with various universes) and Magic: The Gathering, not only for the common fantasy theme, but also because, we say it right away, the guys at Hibernum Creations have really played a excellent job in synthesizing two worlds and two mechanics each with its nice load of fans. Puzzle Quest joins Magic this time: to marry them an honest Freemium model, and lots of fun! Deck of cards, deck cards Especially if you are used to games for mobile devices, how Puzzle Quest and all match-3s work will not be unknown to you: on a grid made up of various colored objects, it will be necessary to align them, exchanging places only two adjacent ones at a time, at least three in order to make them disappear, trigger any chain reactions, and earn ~points~. These points then in each version of Puzzle Quest have materialized into something different, always starting from the assumption that you play against an opponent, be it virtual or human. Herein lies the beauty of this version set in the world of Magic: you play a Planeswalker and you have a deck of up to 10 cards at your disposal, divided between creatures, support and spells. At each turn, one is drawn, which queues up to be summoned onto the battlefield, and the summoning takes place by gaining mana (each card has its own request in this sense) with each successful move. From the turn following the summoning, the card plays its effects, which can be varied, each well defined in the description: ranging from the simple attack to the more defensive card, gradually up to the more complicated spells. Each Planeswalker also has its own affinities, and the colors of the gems in the game grid reflect these affinities: by clearing gems of that specific color, you obviously get more mana. However, there is also a particular gem whose elimination will not contribute to accumulating mana but will allow summoners to use one of the three skills they have available, which can be unlocked and upgraded with level increase. With the obvious aim of reducing the opponent's life points to zero, a last fundamental mechanic is the possibility of modifying the queue for summoning at each turn: with the clashes that start immediately quite difficult (because of the Freemium model, of course, but evidence of an excellent artificial intelligence) a good planning ability becomes necessary, giving priority to the most powerful creatures and skilfully alternating between spells and support cards. Honest magic The two game coins, obtainable after each success, are used for various things. Level up your own Planeswalker, buy new ones, purchase sachets with which to customize and improve your deck - the possibility of leaving this task to the CPU is very useful for this purpose - and also, indirectly, reduce the waiting times for a character who lost life points during a fight you recover them completely. Obviously it is possible to speed up all these processes by putting a hand in the wallet, but we must say once in a while that the Freemium model adopted is pleasantly honest: not only is the necessary repetition of the missions made enjoyable, as well as by the game system itself, also by the presence of two optional objectives for each fight, although the classic rewards for each daily access also include quite juicy elements, such as sachets with a high probability of finding rare cards. Thus it becomes very pleasant to return and return to the game, and even deciding to shell out a few real euros, thus rewarding the excellent work of the programmers, one does not feel cheated at all. At the moment, contrary to the spirit of Magic: The Gathering, the emphasis is on the main quest, with PvP against real players doing little more than climbing the leaderboard, but the promise of big future events will keep us on the lookout. keep an eye on the game, which also looks good from an aesthetic point of view. The cards, updated to Origins, enjoy the fantastic original illustrations, the gems are alive and vibrant as well as the effects that accompany each action; on the other hand, the situation on the sound front is a little less happy, a single piece of music, however evocative, which repeats itself endlessly, and on the strictly technical one, with some small bugs that are still heard and seen from time to time and in general a cleaning, for example when passing from one screen to another, is not always optimal. Last note on the only available language, the iEnglish: You don't need to know it well to be successful, but being able to read the various cards and the history of the Planeswalkers certainly helps immersion.", "date": "2015-12-19", "grade": "8.0"}