{"name": "Fight Night Round 3 - Recensione", "ref": "https://multiplayer.it/recensioni/fight-night-round-3-recensione.html", "text": "The new Italian stallion? The atmosphere you breathe while spending hours with the latest EA Sports creation is one of great occasions, moments of artistic inspiration, technical avant-garde and fun. Although the discipline examined is not the most popular, the production exudes obsessive aesthetic care. Dirty and deliberately retro menus, like a filthy and discolored poster of clandestine meetings, exhibit shaky and squared fonts, grooves of an old film that no one has ever shot, and are coupled with a rough, essential hip hop soundtrack. Sadly epic. Only a few notes are missing from Bill Conti, a Sylvester Stallone struggling on that famous staircase, and the name Adriana immediately stands out among the player's thoughts. FNR3 makes this filmic epic, of the American selfmade man, one of its sharpest weapons. But above all there is no doubt the will to glorify the genre, presenting an extremely rich sample of athletes, an editor for their own of commendable depth, the inevitable career mode, and the final, essential touch, the massive online support. It looks like a formula of divine perfection, it's not like that on balance, but the developers have come damn close... What nextgen it is In terms of gameplay, FNR3 inherits the heritage of its predecessors without major changes, but adds some moves that veterans will appreciate, such as impact punches, special shots capable of turning the tide of the match, and greater general balance. The aforementioned editor not only offers the means for creating the perfect virtual alter ego, but also allows the customization of class and controls, offering a fighting style based on speed or power. The ESPN classic mode is also excellent, which allows you to try your hand at historical clashes in the role of the legendary Cassius Clay, Evander Holyfield, Oscar De La Hoya, Jake Lamotta and many others. The faces deform under the weight of the gloves... To get to the scenographic climax, the decisive blow that knocks the opponent down, seasoned with a slow motion animation that is difficult to describe. Simply, it must be seen with your own eyes What nextgen it is The excellent impressions gained while browsing the menus are not sufficient to cushion the impact with the actual game engine. Those who have tried the demo will be ready to absorb the blow without major emotional trauma, for all the others, especially if equipped with HD displays, it will be an exhilarating experience to say the least. Gigantic athletes made up of an exorbitant number of polygons, but above all incredibly defined textures and a photorealistic lighting system to say the least, are the first real demonstration of the exploitation of the new Microsoft hardware. Equally impressive are the scenarios, which include gyms, warehouses, famous arenas such as Madison Square Garden, all enriched with an entirely polygonal audience. The neophyte's most natural reaction will be to admire the display with a dazed look, hesitantly take the pad and hint at a few hooks. With a consequent discharge of punches kindly bestowed by the CPU on duty, to realize that the best is yet to come. The faces deform under the weight of the gloves, presenting swellings, cuts and streams of blood, all with an unprecedented wealth of detail. To get to the scenographic peak, the decisive blow that knocks the opponent down, seasoned with a slow motion animation that is difficult to describe. Simply, it must be seen with your own eyes The referee begins the agonizing countdown that separates from the KO, with difficulty we manage to get up, just in time for the bell to ring, it's over for now. Reclining on smelly armchairs, we can admire a further touch of class of the saga, the possibility of healing the wounds on the athlete's face. A real minigame that further shows the care put into making faces, simply impressive. The second round begins, and things start to look better. After the graphics hangover, you begin to enter the game to assimilate the commands, to understand that everything is very intuitive. And instinct soon gives way to targeted, strategic combat. Just enough to turn the tide in our favor, and after a series of effective uppercuts the computer is knocked down. From zero to myth But this is only the beginning, the career mode is long and provides for the complete climb of our fighter, from the lowest ranks, the amateur matches played in the gyms, until our popularity will be high enough to aspire to matches with the champions of the upper classes. The game includes a strategic section that precedes the fightor real, first of all it will be necessary to sign the contracts of the various available matches, evaluating the capabilities of the opponent on duty. The next operation will consist in trying some training mini-games, designed to improve the skills of our boxer, and will have to be performed according to the opponent's parameters. And before stepping into the ring, it's a good idea to buy a better pair of gloves at the glove shop. Indeed, the system is more invasive than complementary, as demonstrated by the possibility of skipping mini-games and instantly gaining improvements in physical values, but it is an appreciable diversion between the various clashes. The career mode is fun, but it doesn't best represent the spirit of the game, thanks to the low difficulty opposed by the cpu, more inclined to contain the player's attacks, making some matches rather tedious. Initial loss of controls is quickly averted with a comprehensive tutorial, featuring training sections with a sparring partner. Once practiced with the total punch control, a peculiar attack system based entirely on the right analog stick, even the novice player will easily get the better of the artificial intelligence. Stronger, guys! It is at this point that the Live mode assumes crucial importance, fully supported for online multiplayer, and characterized by a highly competitive ranking system. Once you step into the internet ring, things change radically. It's easy to come across remarkably difficult human opponents, so much so that the offline challenge is made a Sunday walk. Before jumping into the fray, it is therefore advisable to try your hand at friends in the appropriate lobbies, and look for a challenge suitable for your abilities through the optimatch. The modality also foresees being able to use an athlete created in the appropriate editor, but the absence of limitations in the physical parameters (present instead in the career mode) consistently false an attractive opportunity. Despite everything, what interests us is the functionality of the online. And it's nice to see how EA Sports has smoothed out the lag problems that afflicted the previous 360 productions, except for some occasional clashes, the sessions proved to be fluid and highly playable. It goes without saying that this mode dramatically lengthens the longevity of the title, by its very nature enhanced by clashes between human players. Comment The latest incarnation of the EA Sports boxing franchise enhances the aesthetic component and levels of absolute excellence, warming up the Xbox 360 engine as few titles currently manage to do. The playful foundations are based on the solid foundations of its predecessors, offering a model that balances the need for simulation and arcade immediacy. The control system is simple but not without depth, avoiding random tinkering and offering the player an interesting level of customization. The comprehensive Live mode is the proverbial icing on the cake, which completes a product strongly recommended to enthusiasts, but also to those who are interested in the noble art for the first time. There is no lack of room for improvement, especially for an offline mode that is not very diversified and excessively affordable. This does not take away from the EA Sports production the scepter of best simulation of the genre. And an unmissable opportunity to amaze your friends. Pros Amazing graphics Intuitive and customizable control system Full Live support Cons Career mode can be improved A little too easy offline If you really hate boxing... EA Sports and the next generation. More than anyone else, the Canadian softhouse demonstrated the effectiveness of its new generation, innovative, amazing graphics engines, already admired in FIFA RTWC, Madden and NBA Live 06 in the 360 versions. But the commendable technical development did not help the recreational sector, firmly anchored to the old canons, if not regressed. In fact, the aforementioned titles are distinguished by drastic cuts to modes and options, and rarely manage to match the 128-bit versions in the gaming sector. Fight Night is a very different case though. The previous versions have shown a constant improvement in terms of gameplay and aesthetic appeal, but it was the videos shown at the last E3 that traced the real generational leap. With literally jaw-breaking graphics and relevance to the real sport, this third incarnation of the franchise was a candidate for the benchmark of boxing simulations. Today this promise is a tangible reality, the final version lands on 360 after a promising demo to say the least, and it sparks. Can we talk about real nextgen? Definitely yes.", "date": "2006-03-16", "grade": null}