{"name": "Tappiamo il castello", "ref": "https://multiplayer.it/recensioni/160568-frontier-defense-tappiamo-il-castello.html", "text": "It's quite difficult to consider clicker games, or tapping games, as a genre in their own right, even though the category now has its own defined boundary. After the first experiments, it is increasingly assuming the role of a sort of complement to other characteristics of different genres, paving the way for hybrid experiments that modify consolidated structures in order to accommodate the obsessive mechanics of tapping, i.e. the continuous and exaggerated touch as the primary mode of interaction. By definition, this type of game takes simplicity of action and continuous repetition to a paroxysm, but if the furious touch on the screen is counterbalanced by a more structured form of play, interesting solutions can emerge. This is the case of Frontier Defense, which bends the classic dynamics of tower defense to fast mechanics and certainly milder from a strategic point of view than tapping, however coming out with an interesting mix of the whole. The question is very simple: it is about defending a castle located on the left of the screen from continuous waves of enemies arriving from the right side, in a battlefield squeezed into two dimensions in order to automate the defensive action towards a direction only. The castle is defended by three heroes who fall under the direct control of the player and by various defensive units to be applied to the gate which instead act automatically, all to be upgraded and customizable in a progressive way. The three characters hit the enemies through simple touches on the three corresponding buttons, with the possibility of activating special attacks, once loaded, always pressing the other appropriate buttons and this is where the tapping mechanics come into play, but the timing with which to use the special skills and the need to set up ever more impressive defenses significantly enrich the game action. Tap tap tap tap: Find out how hard it is to defend a castle in Frontier Defense Medieval carpal tunnel The action starts with a solitary warrior placed as the only defense of the castle, which is then gradually joined by other fighters until you have three warriors in action at the same time to be controlled by touching the buttons on the screen, in addition to the automatic defense systems. Enemy attacks take place in progressive waves, ten for each level, with the last obviously representing the most massive assault, for which it is necessary to preserve energies and special skills. As you progress through the levels, the scenario changes but above all new enemies appear that are increasingly powerful and have different characteristics, which force you to change your approach and continuously upgrade the fighters. The upgrading of these takes place by spending the gold and diamonds collected in battle, the protagonists of the microtransactions present in the game, but which are also given with a certain logic simply during the game, with not impossible prices for the purchase of upgrades and battlemates. The action itself is so frantic as to be confusing, but rather than hitting the keys like obsessed (which in any case must be done for a good part of the time), one soon realizes that the trick, in addition to a continuous evolution of the fighters with prudent spending, it lies in the right timing with which to use the special shots and the activation of the automatic attacks, alternating them in a balanced way and trying to reach the most demanding moments with a few tricks still to be used up the sleeve. If you think of simply advancing by dedicating yourself to a furious tapping it will be difficult to overcome the first levels, in addition to probably also causing a certain pain in your fingers, therefore a dosage of the action and a certain strategic planning (extremely elementary, mind you) are necessary and determinants, ending up characterizing the entire gaming experience. Furthermore, the graphic characterization is excellent: although it is a now standard style for the type of game, the clean and humorous line is perfectly centered.", "date": "2015-12-12", "grade": "7.8"}