{"name": "FIFA 23", "ref": "https://multiplayer.it/recensioni/fifa-23-recensione.html", "text": "From a certain point of view, it is almost effective to realize that you are writing the first words of what will probably be the last review of a FIFA, at least as we know it. Over the past twenty-nine years, the legendary EA Sports sports series has been the ideal companion with whom to share one's passion for football, a faithful friend towards whom we have often cursed for a goal conceded in the 90th minute, but who has always been there for us every time we turned on the console in search of a little escape from the everyday. After almost three decades of partnership, starting from 2023 the historic partnership between the Fdration Internationale de Football Association and Electronic Arts will be definitively consumed and , even if the publisher has promised to continue producing football video games indistinguishable from those that currently make him earn billions, there is no doubt that the name change will cause an earthquake in the sports market whose effects are difficult to predict. In the calm that precedes the hurricane, EA Sports is preparing to publish FIFA 23, the latest edition of the football dynasty made in Canada, before next year's rebranding. Given all the premises, we knew that we would be faced with a chapter of strong transition, but after the many editorial appointments dedicated to deepening the novelties of the game we couldn't wait to be able to throw ourselves into the exploration of its final version to taste what is the latest FIFA packaged by Electronic Arts made of. Find out with us, in our review of FIFA 23. A FIFA like this has never been seen before Forget about being able to outrun two opponents without resorting to any skill moves Let's get our teeth out and face the question from the beginning: this FIFA, in terms of game modes, is in our memory one of the most conservative in the history of the series. We will deal with the topic in detail in a few paragraphs, but FUT, Career, Pro Club and Volta Football do not include concrete news this year, to the point that many game menus have remained unscathed by the transition from one edition to another . This immobility, paradoxically, however, contrasts with the substantial revolution that has affected the gameplay of FIFA 23, truly unrecognizable compared to the past. We had learned to deal with the frantic and convulsive nature of FIFA, and you will be surprised to know that this time EA Sports wanted to go in a completely opposite direction, offering an experience that is absurdly much closer to that given by its rival always, eFootball. Forget the pinball machine and remote-controlled passing, FIFA 23 is supported by a slower gameplay, at least when compared to the standards we are used to. Everything is linked to the feeling of extreme heaviness that, especially in Ultimate Team matches, even the most agile players give to those who hold the controller in their hands. In the strait, turning around and overcoming an opponent is extremely complicated, the players no longer possess the same explosiveness of the previous editions and, more generally, the perception is that the goal can be reached better with a reasoned and choral maneuver, rather than with singles play. This change of approach, although it will displease those who preferred making the game spectacular, is an absolute strong point of this chapter, so much so as to overshadow the indolence of the study on the modalities that yes, remains hardly justifiable, but which assumes everything other seriousness in the general context. Women's soccer is an integral part of FIFA 23 On the other side of the field, we noticed that the defense is much more manual than usual, excellent news if we remember how the frequent presence of autoblocks managed by the AI was an evident defect of the previous chapter. Another factor that reminded us of the gameplay of eFootball is the constant vagueness of game situations, the result of the introduction of many new animations thanks to the use of HyperMotion2 technology. EA Sports has captured two entire matches between professionals, recording about 6,000 new animations: if in the past a tackle was made up of a limited number of these, on PC and new consoles the same situation will develop as a result of a concatenation of many unpublished elements, and will therefore have a more realistic and totally impossible to predict outcome. A few games are enough to realize the magnitude of the progress achieved by physics, the real highlight of this edition. We referred to the PC and the current-gen consoles since all the news related to Hypermotion2 are absent on PS4 and Xbox One. On these platforms the gameplay has been revisited (unlike the Switch, in which only the squads have been updated), but the feeling is more similar to the 2021 understood and the pace of the action is much more affected by the speed of the athletes. All these innovations make the gameplay of FIFA 23 particularly pleasant, even if as expected there is no shortage of dark sides on which EA Sports will necessarily have to work in the coming weeks. If in FIFA 22, before the patches, it was very easy to score from outside the area with a shot from outside, this time it is always very difficult to place a shot from outside, also because in all probability the development team wanted to give importance to the new shooting mechanic powerful, a shot that takes a long time to load and that once completed allows you to throw the ball with impressive force. On the contrary, it is instead very easy to score from inside the penalty area, due to the total inability of the goalkeepers to react to close shots: even in the case of players with ridiculous shooting statistics, every shot that starts from inside the box slips eight vote out of ten behind the goalkeeper, a dynamic that makes the gameplay more realistic, but which can be frustrating if you score the goal during the last minutes of a Weekend League game. FUT, the same masterpiece as always, but with few new features Scoring in the area, also due to some oversight by the goalkeepers, has become very easy We know, Ultimate Team is the main mode of every FIFA and for this reason we ran to build a team to find out what news the new version of FUT had to offer. Unfortunately, the answer to that question is not too many, as the playlists remain basically the same as last year. It's not necessarily a bad thing, because the triptych made up of Squad Battles, Division Rivals and Weekend League works perfectly and it would have been a shame to upset the balance, but we would have liked to see at least some slight changes to each of them, even considering how these are been included with the exact same interfaces as last year. The great news is that, starting this year, FUT (but also other game modes, such as Friendlies and Online Seasons) will be supported by crossplay between the same console generations, a feature that has long been requested by the community. Crossplay will unify the matchmaking of all major online competitions such as Division Rivals and FUT Champions as well as the market, after years in which it was always divided by platform. The only real new content of FUT 23 is represented by Moments, a new mode single-player brand that in exchange for some rewards plans to complete gameplay scenarios with very specific requirements. Some of these are quite immediate and will simply ask you to finish an attacking action with a goal, while others have squads with strong requirements and will really put you to the test. Scenarios reward the player with Stars, a new currency that can be spent in a dedicated shop filled with packs or other rewards. At the moment the prizes are not particularly greedy, but the hope is that EA Sports will update the shop as soon as possible to include others. Here's what the new Chemistry system looks like in FUT Finally, how not to mention the new Chemistry system, which significantly revolutionizes the way FUT managers can build their roster of champions. Where previously links counted for Chemistry, starting this year it will no longer be necessary to directly link like-minded players for the team to benefit. In fact, the agreement takes into account the similarities between all the players present in the starting 11, so you will have much more freedom and flexibility in combining athletes from different championships. If on the one hand the Agreement now offers us the opportunity to build formations less bound by affinity ties, on the other hand we will no longer be able to move players freely on the pitch as happened in the past. Through the chain of role changes, in fact, in the last chapters of FIFA it was always possible, for example, to move an attacker to midfield, to exploit his advanced characteristics in an area of the pitch far from what should have been his area of flu. To avoid this dynamic, the development team thought of limiting the roles that each player can occupy in the formation. Each of them will now have a preferred standard position, and up to three other secondary roles, so forget about being able to move Mbapp or Ronaldo to the halfback as they did in the past, if you want to enjoy the substantial stat bonuses that the new chemistry system guaranteesto the footballers. A career revolutionized only in appearance A scene from the new player buying sequences in Career Among the many FIFA modes, one of the ones that gathers the greatest number of aficionados is Career, which again this year is divided between Coach and Player. In the first case, although the interface of the entire sector has been overturned, the Coach Career has the same structure as the previous editions, even if we have learned to know its goodness and we are fully aware of the fact that revolutionizing it in order not to improve anything would have been an exercise in itself. The classic coach editor is now supported by the possibility of taking on the role of one of the approximately 30 flesh-and-blood coaches who coach in real football, each reproduced with a dedicated model which however is not always faithful to the counterpart. another couple of news, all related to transfers, which make it even more enjoyable to sign champions for your favorite team. First and foremost, the Manager Career welcomes the Transfer Analyst, a new member of staff who will present a detailed account of how skilful we were during the transfer with each transfer transaction. Secondly, after completing the purchase, totally unedited videos will be played showing the player reaching the club's sports center, undergoing medical examinations and being welcomed by the most representative members of the locker room. A very fitting idea, although quite simple. The transfer analyst will be ruthless if you don't make a good buy As far as the Player Career is concerned, we have welcomed the new system that allows (also in the Coach career too) to play only the key moments within a match, so as not to get stuck between the shirts of a long season competitive. This novelty goes hand in hand with the player's personality: our alter ego earns personality points based on the decisions made off the pitch and according to the style he prefers on the pitch. Furthermore, each style earns the player unique bonuses, useful for making his characterization even more profound. Will you be Individualist, Driven or Generous? Pro Club and Volta Football merge together The mini-games of the previous edition are back in Volta Football About Pro Club and Volta Football there is actually very little to say, since both turned out to be an inexplicable porting of the versions present in the latest edition, so much so that every single ounce of their menus has been recycled and reinserted in the new chapter. As has become tradition, the Pro Club offers the possibility of controlling a personalized footballer during matches that involve as many as 22 players, while Volta Football brings back to the field all that series of playlists dedicated to street football that can all be tackled alone or in a team with other friends, between more classic matches and a bevy of imaginative mini-games. EA Sports, perhaps in an attempt to promote both so that the popularity of one could benefit the other, has merged them under the aegis of a single progression system, so that by dedicating yourself to one you will already have a respectable footballer to launch in the other. The idea is not bad, also because Volta desperately needed to be among the priorities of the community and with the unified progression players will be encouraged to give it a chance, but we would have liked to see the introduction of some new features for the Pro Club, an extremely popular modality, but which for years has not enjoyed the attention it deserves. The avant-garde of interactive football Year after year we risk being redundant, we realize this, but we will never stop praising EA Sports for the quality that the Canadian studio manages to instill in the technical sector of its football video games, which are ever closer to being indistinguishable from a real match. Although FIFA 23 still carries the weight of the old console generations on its shoulders, the graphic impact of the simulation is impressive, as are the faces of the most famous players in international football. At the moment, the only grain is represented by some rare graphical bugs during matches, for example which occasionally obscure the result of the match in progress: nothing the studio can't fix in the weeks to come. Note on the soundtrack of this FIFA, a real compilation of hugely successful songs, which includes some of the most listened to authors of the moment, such as Rosalia and Stromae. Finally, we point out the absence of substantial news regarding the telecron", "date": "2022-09-27", "grade": "7.8"}