{"name": "E se Hotline Miami finisse nel Selvaggio West?", "ref": "https://multiplayer.it/recensioni/160413-12-is-better-than-6-e-se-hotline-miami-si-trasferisse-nel-selvaggio-west.html", "text": "Let's try to take a cult western movie like The Beautiful, the Bad and the Ugly and mix that atmosphere with the mechanics of Hotline Miami. We enrich the compound with a soundtrack that unites contemporary music and exotic tones with a Mexican flavor and we decorate everything with a graphic sector that seems to be inspired by the classic Tex Willer comics. What could possibly come of it? It is easy to say: 12 Is Better Than 6. What at first glance might seem like an improbable Mexican proverb coined at the time of the gold diggers is instead the debut video game of the independent team Ink Staind Games. As you may have guessed we are talking about a grim shooter with a top view and stealth infiltration mechanics characterized by a high level of challenge. The project was funded through the Kickstarter platform and was appreciated by the Steam community, to the point of being approved on Greenlight in just four days. Sombreros aside, 12 Is Better Than 6 is nearly identical to Hotline Miami Homage to the Western genre We are in 1873 and a fugitive is trying to cross the desert that divides Mexico from Texas. The Mexican - as the mysterious protagonist is generically defined - has almost completely lost his memory, he only remembers the last five years of his life, spent mostly breaking his back in a mine and watching desperate people die. There are no other images in his mind, the only idea that makes its way is to be able to get very far and try to rebuild a new life, if it weren't for the bounty hunters who stubbornly hunt him down. And it is precisely from the synthetic initial events that an explanation is given to the singular title of this work. Very prosaically: it is more advantageous to be judged by a jury of twelve people because of the crimes committed, rather than being transported by six other people inside a coffin. The Mexican will therefore prefer to kill those who hinder him and risk ending up behind bars for his actions, rather than being brutally murdered by other criminals and prematurely resting three meters underground. And it doesn't matter if in Texas, where the Mexican is headed, the death penalty has been in force for the crime of murder since around 1820. After all, this is a top dawn shooter, not a penitentiary history treatise! Here then is that the player can prepare to carefully sharpen the knife, take up a revolver and shotgun, fill his pockets with dynamite and set off with a great spirit of adventure through the four acts that will serve to reconstruct the murky past of the protagonist, to eliminate his bitterest enemies and to find the coveted peace of mind. What struck us the most was the artistic realization of the levels. The game was in fact entirely hand drawn, the white background highlights the blue outlines of the objects, from the hats of the characters to the details of horses and buildings. It really seems to be inside a comic strip inspired by Western iconography and supported by cinematic quotes. One of the main sources is precisely ~The Beautiful, the Bad and the Ugly~, historical film and one of the most popular in Clint Eastwood's career. It is no coincidence that the protagonist of this adventure has characteristics in common with Tuco, universally remembered as the Ugly. But we mustn't forget the pressing soundtrack either, which has very little to envy to the pounding tones of its older cousin Hotline Miami. The material was created in collaboration with the musician Ivan Rechetnev and mixes some rock tracks with a contemporary flavor in a very interesting way with other melodies clearly influenced by both the western panorama and the Mexican tradition. Knife or revolver? During the raids as the Mexican you can get access to a fair amount of weapons. You start with the classic revolver with drum magazine but you can collect the famous Winchesters, sawed-off shotguns and even sticks of dynamite from the bodies of fallen enemies. Moreover, given the high level of difficulty, it will be advisable to make good use of the knife and silently kill as many enemies as possible, but in some cases it will also be allowed to move from the entry point to the extraction point without touching any weapons and cutting any throat. The artificial intelligence is particularly reactive, therefore it will be sufficient to make an error of judgment to be surrounded from several sides and have no way out, also because exactly as happens in Hotline Miami, the game ends after having suffered a single hit. Assuming that the game mechanics replicatealmost entirely those of the title created by Jonatan Soderstrom, it is also possible to identify some completely exclusive features, specifically the firearms loading system. Both revolvers and shotguns must be reloaded manually, with an interaction consisting of pressing three buttons simultaneously. Consequently, every single shot can be fired only after having pressed a double trigger: the right mouse button is useful for aiming, while the left button must be pressed for each new shot. These factors help to increase the level of difficulty inherent in the game and at the same time require planning and a good dose of strategy regarding the order of enemies to be killed and the direction to take. And although the first maps offer a slightly more constrained and obligatory path, continuing in the story you will have the opportunity to wander around, choose more alternative routes or try opposing strategies. Moreover, the charging system, despite being an original component, is not free from some defects. Primarily pressing the R, M and B buttons on the keyboard, which can cause more of a headache in busy situations. But it is above all the field of view that has left us some question marks. By pressing the shift button it is in fact possible to move towards the more advanced areas of the scenario and check if there are enemies or what their movements are. This function guarantees to engage in firefights from long range with a lower risk of being torpedoed on sight, but the fact of not being able to move one's character at will, when the latter is outside the line of sight, represents a handicap of no small matter. Thus it happens to be placed in the vicinity of a cart or a rock, to move the view forward but not being able to move from the cover without continuously alternating the two shots, with the consequence that the identification of the enemies will become increasingly complicated or will happen to lose sight of them and then find them immediately on. In these cases you have to go a little trial and error, until you have a better idea of the whole surrounding environment, and the operation may not be without frustration. The composition of the maps, on the other hand, did not disappoint us at all, since there is a fair variety of situations and objects sufficient to guarantee multiple approaches.", "date": "2015-12-10", "grade": "7.5"}