{"name": "The Sims 2: Funky Business - Recensione", "ref": "https://multiplayer.it/recensioni/the-sims-2-funky-business-recensione.html", "text": "How to open a shop, get rich and live happily (or almost) The first step to take is choosing whether to open a home business or afford the luxury of a real shop. The first case is preferable at the beginning, when we lack the necessary funds to purchase a private lot and we simply want to practice selling everything from the meals we usually prepare for ourselves to the household furnishings, passing through the classic lemonade stand in the garden (blessed Sims who don't know winter!). Let's say we managed to put away a large nest egg: with a simple phone call - or sitting in front of the computer - we find out which plots of land are still free where we can build our shop. We can undertake all kinds of activities: pastry chef, hairdresser, florist, opening a restaurant or a toy shop, passing through luxury clothes shops or gyms with fashion trends up to the sort of Spa where the only purpose is to relax. For this review, the undersigned has decided to give in to the charm of a thousand colored petals, the intense scents they bring with them... and above all to the magnetism of a consolidated and sure-successful business, turning me into a florist! Sparing no expense, I decided to buy a lot in the commercial district  a brand new 'village' that joins the pre-existing ones related to the university and nightlife. Unfortunately, the first - and major - limitation of the game mechanics is clear: every time we want to move from home to our shop we will have to call a taxi or take our car, but whatever happens we will have to endure the loading screens that this operation brings with itself, and we can assure you that it will happen much more often than one would like Having arrived at our beloved ~Fiori e Co.~, it is clear that we cannot do everything alone ... we need someone to work with and for us! No more talking, with a leap we are already on the phone thanks to which we can hire subordinates with different skills and abilities. Each may possess one or more talents, the ability to create more complex flower arrangements, sophisticated toys, and even robots. But not only that, there are Sims able to take care of the procurement of materials from the warehouse and others capable of selling to others as well as managing cash registers. Somehow it feels like going back to the year-end budget that all Sim City players remember well. Running the shop involves making ends meet by hiring and firing, placing orders from the wholesaler and trying to sell the most expensive piece to the hesitant buyer. The penalty, in case of failure, is bankruptcy and the consequent sale of our beloved shop. Brrr Handle me, baby! I bought the shop, hired a couple of helpers, it's time to continue the investment! My technique is to keep the shop closed for a while longer and to direct all efforts into creating bouquets of assorted flowers, from roses to tulips, including daisies. Once a good supply of materials has been created, it is time to place them on the shelves, price them  we can choose terribly popular-cheap or exaggeratedly inflated prices and let the dance begin. Everything is conveniently managed with a new bar positioned at the top right and the goals will not be just a fat current account! We will have to learn to create a steady clientele, talk to any journalists who come - in disguise - to review our business and again, we will level up, increasing the prestige and ranking position of our showcases. In fact, of great playful interest is the existence of a sort of skill tree where we will be able to transform our success into new economic or social skills, without the choices ever revealing themselves to be definitive, we will be able to redistribute the points whenever we want in an always different. However, the goal will always be the same: to conquer the business world! style Great attention has been paid to the graphic style and furnishing of houses, lofts, clubs and shops. Real consultants have helped Maxis to create refined and increasingly sophisticated environments. The risk, ironically, is that of not feeling up to the situation when faced with gardens in a minimalist-chic style or almost baroque rooms, full of ornaments that the average user will hardly be able to create Final comment Ultimately, approaching the umpteenth expansion of such a famous game, one always and only asks one thing: ~Is it worth it? Really?~. Well, what can be seen after hours of downocato, is that Funky Business really adds something to the game mechanics. It enriches the environment, the experience, much more than the previous chapters. There are inherent limitations  such as the problem of having to constantly load home screens and those related to the shop  but at the same time it opens up a whole new dimension of its own. Longevity, already the maximum strength of this title, enjoys it infinitely together with the eye, tickled by the many improvements and graphic refinements introduced from scratch. Pros A real expansion, which significantly 'expands' the playing experience Refined graphics, refined environments and a thousand new features Perfectly usable in conjunction with the previous expansions Cons Thousands and thousands of CDs to be installed with the resulting timing! Loading times always to be taken into consideration, even with powerful machines Know this, it's a game that requires hours and hours of commitment... We were starting to worry, exactly six months after the release of Nightlife where fun and nightlife surround the lives of our Sims, what else could we have done? By now our Sims are graduating, climbing the heights of success in a thousand different activities, passing from goliardic jokes to wild nights between clubs and dance floors; all without ever missing the primary possibility of falling in love, marrying and maybe even starting a family with children. With an eye to the fan community full of advice and wishes to be fulfilled, and always under the aegis of Will Wright, here comes ~Funky Business~, or even the Sims launch themselves fascinated by the capitalist demon (!) of earnings and free enterprise . That it turns out that they are also Brianza?", "date": "2006-03-15", "grade": null}