{"name": "Chivalry: Medieval Warfare", "ref": "https://multiplayer.it/recensioni/160261-chivalry-medieval-warfare-danza-della-morte.html", "text": "Translated from a sophisticated mod of Half Life 2 called Age of Chivalry, Chivalry: Medieval Warfare was the first commercial title for the Canadian software house Torn Banner Studios, a ~simulator~ of white-weapon combats that received (and continues to still collect) a good success on Steam, where it was launched in October 2012. A couple of years later and under the protective wings of Activision, a discussed iteration for last generation consoles was also published, however passed into muted due to the presence on the market of the new flagships branded Sony and Microsoft. Precisely for the latter, the developers announced a conversion - by Hardsuit Labs - last November 19, which landed on the PlayStation Store and on the Microsoft Marketplace about ten days later at a cost of 19.99 Euros. We put the Xbox One one to the test and this is what we think. The forbidden heists of Chivalry: Medieval Warfare also on PlayStation 4 and Xbox One No mercy Since the original work for PC was released, of which you can read our review by clicking on the following link, the title has been constantly refined and expanded by the Toronto team, and today we find ourselves on our hands a certainly more full-bodied product that has welcomed also single player and cooperative modes, although the competitive multiplayer sector always remains the core of the experience. As specified in the introduction, we are dealing with a medieval combat simulator, whose play infrastructure is not exposed to the technicalities of the famous Mount and Blade and the lesser known War of the Roses, but offers an excellent compromise between carefree fun and depth of duel. The two opposing factions that can be used are the Knights of Agatha (in blue) and the Order of Mason (in red), whose deeds are accompanied by a very light narrative substratum that quickly gives way to the noise of weapons. In the main menu, which shows a glimpse of an epic battle that has just ended in the background, among the various items there is also Training, a very useful arena tutorial that introduces the player to the stratified combat system. Starting from the basic dynamics, one reaches the mastery of the most advanced techniques, also becoming familiar with the characteristics of each of the four classes present, specifically Archer, Man-at-arms, Point unit and Knight. In this version of the game, over sixty weapons are available, ranging from traditional swords, axes and crossbows to halberds and two-handed broadswords, passing through flails, spiked maces, war hammers and other very painful dispensers of death. The weapons naturally offer specific range, speed of use and effectiveness, moreover they are not all accessible at the beginning, and to unlock the more ~exotic~ ones it is necessary to level up a lot. The equipment of each class includes a primary weapon, a secondary weapon and a very useful extra object, to be selected among additional ammunition (arrows and darts), throwing knives or various types of shields, which obviously favor defensive action at the expense of mobility. The beating heart of the experience is the solid combat system, which translates into a tight ballet of death with your opponents. The action is completely based on timing and resistance management, and it is essential to carefully mix dodges, feints, parries and the three types of attack, as well as the kick to break the defense or perhaps push the unfortunate person on duty into one of the numerous precipices that dot the maps. The commands are well implemented on the joypad and the solution adopted by Hardsuit Labs represents a valid alternative to the combination of mouse and keyboard. The main attack and the combos are performed with the right trigger, with RB the powerful attack from above and with R3 the lunge, while the left trigger is assigned to the feints and above all to the parry, an action that requires the right amount of practice to be mastered to the fullest. The other buttons are used to move through the menus, switch weapons, crouch and launch the iconic battle cries. Chivalry: Medieval Warfare is a title designed to be enjoyed mainly in first person, however it is also possible to play it in third person by pressing LB and X simultaneously. However, the result is not very usable, furthermore all the historical bugs (still present) related to interpenetrations are amplified polygonal. As specified, the combat dynamics are well studied and the various classes are sufficiently balanced, although soldiers equipped with long weapons (such as halberds and two-handed swords) have significant advantages in certain circumstances. The impact of the fenteeth on the bodies of the enemies is generally solid and credible, with very violent results that can lead to clear beheadings, dismemberments and rivers of blood. In the heat of battle one often ends up hitting and killing one's comrades in arms, moreover it is not always possible to perceive exactly the extent and power of the blows inflicted, but despite some technical hindrances the final result works very well, and the compromise between arcade action and depth always guarantees challenging duels and tons of fun. Xbox One goals Chivalry: Medieval Warfare offers the usual 1000 G divided into forty distinct objectives of 20 and 40 points each. Most of it is related to the unlocking of numerous weapons, however there is no shortage of achieving specific experience levels or performing certain actions in multiplayer games, such as beheadings. Step back Among the most interesting features of this iteration of Chivalry: Medieval Warfare are the multiplayer for up to twenty-four players and above all the dedicated servers, a detail not to be overlooked in a title where the slightest uncertainty about the connection makes the difference between life and death . As for the game modes, in addition to the more representative Team Objective, we also find the various types of Deathmatch, Survival, Duel and Horde. In the latter, playable both in cooperative and single player, you face a series of waves of enemies made up of orcs, skeletons, ghosts, soldiers, trolls and other amenities, which follow one another in overwhelming numbers. In the Horde Town variant you start already armed with a sword and the various waves are activated after killing the helpless king, while in Crypt you can choose a class immediately after hitting the three skulls in the center of the map. The artificial intelligence is rather cheesy and there are also gross and hilarious bugs, however the fun is not lacking and can be a pleasant diversion after a tight competitive session. In the aforementioned Team Objective, players must perform specific actions in sequence in dedicated maps to get the better of their opponents. In Citadel, for example, in the first phase it is necessary to destroy the walls of a castle with ballistae, while in Coldfront it is necessary to prevent enemies from destroying or lowering a drawbridge and subsequently killing the fleeing king. Among the most curious objectives there is also the escort of a wagon full of corpses, and there is no shortage of sections with siege weapons or the elimination / protection of multiple VIP objectives. Among the most popular modes there are certainly Survival, where the only life available obliges a more reasoned approach, and Duel, in which you face each other in very tight one-on-one situations. Apart from some small differences, the interface is practically the same as the PC version, but fortunately the bizarre ~mixed~ translation between English and Italian has been corrected. From a purely technical point of view, unfortunately the game has a significantly lower cosmetics than the PC counterpart, furthermore the Xbox One version is characterized by a lame fluidity at thirty frames per second, against the sixty of the PlayStation 4 version. Considering the type of product it would have been appropriate to cut the resolution (1080p) rather than the frame rate, moreover, in light of the quality appreciated in the latest titles released on Xbox One, there is no doubt that the developers could have done much, much more. The maps as a whole have a decent level design, but the darker color palette, accentuated aliasing and a rather low quality of some details and textures significantly reduce their charm. The sound effects related to the clanging of weapons are good, a little less some samplings related to speeches and war cries. The soundtrack is impalpable.", "date": "2015-12-07", "grade": "7.5"}