{"name": "Cuori in fiamme", "ref": "https://multiplayer.it/recensioni/160199-real-boxing-2-creed-cuori-in-fiamme.html", "text": "Three years after the first episode, Real Boxing 2: CREED tries to kill the proverbial two birds with one stone: on the one hand it renews the boxing series of Vivid Games with a second chapter that is richer and more multifaceted than the original, as well as a harbinger of many novelties in terms of gameplay; on the other, it uses the cinematographic license linked to the film ~CREED~ to offer us not so much a digital version of the figure of Rocky (present but definitely a side dish), but rather to couple the traditional single player campaign with a second parallel story mode, in which we dress precisely the role of Adonis ~Creed~ Johnson, the son of the legendary Apollo Creed, who in the film produced by Sylvester Stallone decides to turn to his father's old friend to put his skills to good use and establish himself in the world of boxing. In short, we will be pursuing two parallel careers, even if the one with Adonis will immediately prove to be less profound and fun, as the character is limited in terms of characteristics and cannot be modified, whereas instead our avatar (created with a simple but not very rich editor) will be able improve between one match and another, enhance one's skills also through training sessions (present in the form of fun minigames) and use a whole series of objects capable of giving him interesting bonuses. The five ~zones~ that make up the single player campaign (North America, Europe, Asia, Australia and South America) are therefore contrasted with as many scenarios with the protagonist of the film, from the point of view of events that seek more or less to retrace what which happens in the film, but which are unlocked only if the two careers go hand in hand. Real Boxing 2: CREED is a great boxing game, regardless of the movie license Boxing's Creed The interesting thing about Real Boxing 2: CREED is that it does not reveal all its cards right away, on the contrary it continues to offer advanced tutorials even after completing the first area, thus making a complete repertoire of moves available to us only after a few hours. The control system makes use of taps and gestures to execute jabs, hooks and uppercuts, with two special moves available and the ability to unleash devastating charge shots. In the lower part of the screen there are also the buttons for parrying and dodging, while by moving two fingers simultaneously in the various directions we will be able to perform rapid lateral swerves, retreat or advance towards the opponent, so as to put him on the ropes and bombard him with sganassoni. The gameplay works very well, and even manages to give an idea of the boxer we are building: powerful but slow, or fast but ineffective? As usual, it will not be easy to choose which skills to enhance and which to leave behind, with the risk of remaining anchored to a balance that is unlikely to take us far. The artificial intelligence of the other boxers is discreet, but the presence of various attack and defense patterns is particularly surprising, to be studied to identify any flaws to be exploited. There's also asynchronous multiplayer integrated into the campaign itself, which means that in certain cases we'll be facing characters created by other users, albeit still controlled by the computer. The events are numerous and the double campaign helps to compose the picture of a structure capable of keeping people busy for quite a few hours, assisted, however, by an excellent technical sector, which manages to render polygonal models well even though they lack variety, both from an aesthetic point of view and from the entrance animations. To cut the legs off the experience, preventing it from really taking off, there is a fairly aggressive freemium model, which at first appears too limiting, only to lighten up over time. Which in some ways represents a contradiction: during the first phase there is an indicator of the energy of action which sets the number of matches that we can play in a row at three before waiting a few minutes for the recharge, but by accessing the following areas the indicator increases its units, giving us more freedom. The presence of traditional advertising films also allows you to restore the ~reservoir~ without necessarily using hard currency, which is also bestowed at certain moments in the story mode.", "date": "2015-12-05", "grade": "8.0"}