{"name": "L'antiterrorismo secondo Ubisoft", "ref": "https://multiplayer.it/recensioni/159967-tom-clancys-rainbow-six-siege-lantiterrorismo-secondo-ubisoft.html", "text": "A couple of years ago during Gamescom we could surprise try a new incarnation of Rainbow Six that promised sparks. Almost total destruction of walls, ceilings and doors, the possibility of playing both as special forces and as terrorists, with an interesting game mechanic based on traps, barricades and raids. Over the years, some videos have shown us the progress of Rainbow Six: Siege, giving us hope for its success. In fact, the saga had been missing for too long and there was a lot of potential in what we had seen. Then news came out that the game wasn't going to have a proper single player mode and we didn't like that at all, however we remained hopeful, there was still ample room to make it a fun game in multiplayer. We then went to London to try the final version of the game for three days and sadly our suspicions proved to be true. Take a good look at the video below and then forget it, because Rainbow Six: Siege is not like that. Explosions, flashbangs and terrorists, Rainbow Six: Siege arrives! Friendly fire We don't know why, but it seems that Ubisoft has some problems in adapting the vision of their ideas to the limitations of the current hardware available for next gen. It's not the first time that preliminary footage of a game is different from the final result or that bugs damage the experience. It happened with Watch Dogs, it happened with Assassin's Creed: Unity and Rainbow Six: Siege is no less. Compared to what we had admired in the videos and previews of some time ago, the game we tried last week shows dull graphics, with low-medium level textures, a non-exciting physics engine, elementary lighting effects, much less debris and fairly simple hostage and operative models. The downgrade has not only degraded the visual aspect of the game, but also its core mechanics. Now it is only possible to breach certain walls and certain specific areas of the floor, fortunately it is still possible to shoot through most of the walls and the so-called ~gunplay~ is largely satisfactory, but otherwise we are facing a decidedly poor game and marred by a few bugs too many. To give an example, we too often happened to activate a laser trap that was beyond a barricade, only for our knee to magically go over the wall as we ducked. This drastic downsizing has also influenced the contents of the game which, after the start of a single player campaign, is divided into two sections: PvE and PvP, which in turn are marred by some fairly obvious defects that could easily have been avoided by looking at past editions of Rainbow Six. Terror hunt PvE is itself divided into two sections: Simulations and Terrorist Hunting. The first is a sort of tutorial in which we will have to face various scenarios with different settings and abilities that will introduce us to the maps and operatives that we will be able to unlock by accumulating experience points. The simulations have three levels of difficulty: medium, hard and realistic and will lead us to free hostages, defuse bombs or simply eliminate every terrorist in the building. Unfortunately this part of the game turns out to be quite frustrating and not very stimulating for a number of very specific reasons: the terrorists are always in the same position, so once you die a couple of times later it's just a matter of always aiming at the same point. The threat AI goes from ~I don't realize you're by my side~ to ~I'll shoot you over a wall even though I had no idea you were here~, then there are some game design choices that lack every sense. For example, let's assume that you have placed a bullet in the head of each terrorist and are ready to neutralize the bomb, at which point we will switch from attacker to defender and protect the defusing device from hordes of enemies that will burst in from all sides. Leaving aside the fact that they often proceed in line, so it will be enough to find the right angle to kill them all, what's the point? Why can terrorists appear out of nowhere in an isolated building? What tactical experience should this situation give us? Another interesting case is that of the liberation of the hostages: once the civilian has been taken into custody we will be attacked by new terrorists who have mysteriously appeared in the area, some will even be next to the police cars or waiting for us next to the extraction helicopter! Why create a game about terrorism if you then deliberately decide to ignore its foundations in the name of who knows what principle? It's been twelve years dto Rainbow Six: Raven Shield, yet it was enough to copy the system of waypoints and commands to teammates managed by artificial intelligence to give players a more satisfying ~anti-terrorist~ experience. As far as the hunt for terrorists is concerned, the situation is much better. Four friends are enough here to bring out all the true spirit of Rainbow Six, with all the preparatory phase, the search for terrorists using drones, continuous communication with companions to cover each other and that peak of adrenaline that precedes the explosion of a breach charge, flash banging and firefighting. In these moments the game manages to make us forget the general technical poverty to become a moment of pure fun, made up of perfectly planned assaults, lucky gusts that pierce the wall in the right place and doors broken down with hammer blows. Once again in the breach Having a group of friends also drastically benefits in the case of PvP play, which otherwise turns out to be one of the most frustrating multiplayer experiences ever, due to the very nature of the game. Each round is divided into two rounds, attack and defense and each map is repeated at least twice. The first we will have to defend a bomb, a certain area or a hostage and the second we will have to plan an attack or vice versa. At the start of the turn, the attacking team has 45 seconds to locate the defenders using small drones, avoiding that the latter are discovered and destroyed. At the same time, the defenders must place traps, reinforce walls and barricade doors, trying to create obligatory paths to guard weapons in hand. Both of these aspects are based more than on personal skill on communication between the various team members: ~I look at that door knowing that behind me you are keeping an eye on the window and that further down one of our buddies has positioned a heavy machine gun ~. Or ~On my three I blow the door open, you flashbang and you go through the other door and we shoot anything that moves.~ The matches are a mixture of tension, anxiety, strategy and the ability to move tactically, showing the bare minimum to the enemy, because in the world of Rainbow Six the one who shoots first almost always wins. If desired, those who die can usually help using surveillance cameras in defense or drones left intact in the attack, providing valuable information to survivors. Maybe it's a good idea not to bore the players, however doing so dramatically unbalances the game, because it doesn't make sense for a dead man to help his companions. Another questionable game design choice concerns the presence of a strange reddish effect that occurs when a terrorist tries to look out of the window or exit, during the preliminary phase. We are sure that more elegant game design solutions than an invisible wall could have been thought of. Unfortunately, another aspect to review concerns the rotation of the maps. If desired, it is possible to create customized games to play only in certain modes, but in multiplayer we could only decide to exclude a certain type of game and declare which map we prefer, matchmaking will then decide which scenario to load based on the preferences of all ten players involved. Obviously, the good things we found in multiplayer and terrorist hunting almost completely disappears if you don't play with friends, which makes Rainbow Six: Siege one of the least suitable games for those who like to play alone, even less suitable than Evolve . This is because there is no simple team deathmatch mode that is accessible and devoid of tactical implications. The paradox is that, even if there is always a very specific objective, in most of the games we have played the clash was resolved by ignoring it and simply killing all the opposing players, so if we wanted we could easily implement a more ~casual~ mode ~. The hope is that the free DLCs will unlock not only new maps, but some additional modes, because there is no doubt a great need. politically correct Given the delicate international situation, talking about terrorists, hostages and suicide bombers is not particularly easy. It is no coincidence that the game is not widely publicized around and if the game's terrorists were created to be as neutral as possible. All wear some kind of white mask and speak an English accent with slight American overtones and are quite indistinguishable from each other. The only exception is the kamikaze, dressed in an armored biological suit that requires only hitting him on the head and which is announced by a disturbing Darth Vader-style breath. Thethe need to dodge the recent news events in the most absolute way has probably led to the decision to use the special bodies in PvP both for attackers and defenders, however absurd it may seem to see SAS defend an explosive device. In total there are twenty different operatives, divided into four special corps, ten for attack and ten for defense and which can be unlocked by spending an ever-increasing number of experience points. If the operatives that we have already unlocked have already been taken by other players, we will be able to take on the role of a recruit without particular skills and equipped with standard equipment. As for the various roles available, some prove to be more useful than others. For example, given the fairly close-quarters nature of the clashes, the sniper will not have a large use and the same can be said of the policeman equipped with sensors for electrical impulses, useful just when hunting terrorists in PvE, while the Russian Tachanka can deploy a fixed emplacement machine gun already widely used in servers. However, the most annoying side of operatives is not their poor balance, but the fact that they are subject to equipment limitations. If an officer carries a ballistic shield, it's okay that he only fires small arms, but why stop others from using their favorite rifle or force them to only use flash bangs? The customization of weapons is also decidedly reduced and is limited in most cases to the viewfinder, silencer and different skins. Unfortunately, thermal and night vision goggles are completely missing, even if one of the operatives has a sensor that detects heartbeats beyond a wall, a frankly inexplicable lack and which would have opened up even more interesting tactical scenarios. As for the maps, they are ten and range from Air Force One (one of the most successful) to the Hereford SAS training camp, passing through embassies, ports and civilian homes.", "date": "2015-12-02", "grade": "7.0"}