{"name": "Fai vincere il Wookie", "ref": "https://multiplayer.it/recensioni/159994-star-wars-galaxy-of-heroes-fai-vincere-il-wookie.html", "text": "Between Star Wars Battlefront, Disney Infinity 3.0 and The Old Republic's excellent expansion, Knights of the Fallen Empire, it seems that the Force is once again running strong in Star Wars video games for PC and consoles. Yet, Electronic Arts has repeatedly reiterated how much it intends to milk Disney's bantha even on mobile devices, a market that brings in over one hundred million dollars a quarter to the publisher's coffers. This is how Star Wars: Galaxy of Heroes appears on the App Store and Google Play, a game that mixes turn-based strategy, RPG mechanics and a trading card game structure, all inserted within a free-to-play model. play which, as all too often happens, is its cross and delight. Star Wars: Galaxy of Heroes is a mobile strategy that gives in to the dark side of free to play War doesn't make anyone great Playing Star Wars: Galaxy of Heroes it is immediately evident how much the Californian EA Capital Games has recycled from its disappointing Heroes of Dragon Age. At the base it is once again a team combat game, in which you have to deploy your team of six characters and, turn after turn, try to eliminate the opposing party. To get an idea, try to imagine Final Fantasy VII if it were reduced only and solely to battles. The player can choose which attack or ability to perform and which enemy to hit, while a simple cooldown system sets the pace for each match. Once on the battlefield, the strategy ultimately comes down to choosing the most suitable moment to use a particular power, and which enemy to target first. Perhaps it may be a good idea to try to eliminate the other team's healer immediately, or to use skills that confer penalties, ruining the opponent's strategy as much as possible. In some cases we have noticed difficulties selecting specific targets, an input problem that we imagine will be corrected with the next game updates. However, the most interesting aspect of Galaxy of Heroes concerns the possibility of creating and personalizing your own party by unlocking characters from the Star Wars universe. From well-known faces, such as Luke Skywalker, Darth Vader and Obi-Wan, through heroes who appeared in The Clone Wars series, up to some no longer canonical characters, including HK-47, the killer droid from Knights of the Old Republic . There's no shortage of units from the seventh cinematic episode either, and it's only a matter of time before new characters are introduced through future updates. From the strongest of the Sith to the last of the Imperial stormtroopers, each character has his own characteristics and special abilities, and the challenge lies in building an effective strategy at every opportunity. Of course, it can be fun to set up a dream team with your favorite characters, or face the game with a squadron of Jedi, but if you want to compete in the online leaderboards you have to pay attention to team building and create a party that is balanced or don't have too many weaknesses. Unfortunately, the big problem with Galaxy of Heroes is typical of many games conceived around the free to play model. In order to access all the content, the different game modes and, of course, the characters to unlock, you have to repeat the same actions for hours and hours, completing battles, accumulating resources and strengthening your team. It's not a question of ~how much~ time you need to invest to unlock a character, but ~how~. In-app purchases are out of the question (40 for two characters and little else?!), and so we dedicate ourselves to the most unbridled grinding, automating each fight and letting the artificial intelligence play for us. Even now, at the time of writing this review, we left our party fighting autonomously on the screen, as if the game were a screensaver for the mobile phone (if a screensaver can be defined as an application that devours the device's battery in record time ). It's a real shame, because if you spend enough time to unlock modes, options, characters and upgrades, Galaxy of Heroes also proves to be challenging in building your party and finding the right strategy to use in the various matches. The developers themselves have shown that they care about the Star Wars imagery by filling it with little goodies, settings and references taken from both the Classic Trilogy and the prequels: Luke Skywalker is faced in the Bespin hibernation room, the notes of the Cantina Band are heard in the Mos Eisley arena and members of the Jedi Order face each other in the corridors of the Temple of Coruscant. Too bad that much of the work done is thrown awayand from a completely busted rhythm and from all the recurring nuisances in free to play games, such as waiting times to be able to play and the progression too tied to resources to be accumulated by always repeating the same actions.", "date": "2015-12-02", "grade": "6.0"}