{"name": "Prosegue la ricerca alle frontiere dell'incubo", "ref": "https://multiplayer.it/recensioni/159913-bloodborne-the-old-hunters-prosegue-la-ricerca-alla-frontiere-dellincubo.html", "text": "More than six months after the last steps taken in the cryptic Lovecraftian desolation of Bloodborne, we have returned to take on the role of the hunter to deepen the already consolidated experience and above all to dissect the new expansion called The Old Hunters, which is and will remain the the only additional content intended to expand From Software's action RPG. The new material served as a pretext to delve once again into the hidden depths of a product which, like all ~Soulslike~, reaches its maximum form of expression especially during the so-called New Game Plus. The first run is useful more than anything else to test the rigid zest that unites all the works signed by the creative genius of Hidetaka Miyazaki. With the first experience it is possible to scratch the details of a world that deliberately leaves many open points, offering delicate undertones and requiring a rather strong analytical deductive spirit, at least from those who do not want to limit themselves to killing creatures one after another , without even asking questions of a narrative and content nature. Bloodborne, like its predecessors, requires settling, requires the player to systematically learn from every mistake and grow in awareness as the character evolves. These phases necessarily pass from the memorization of every possible path, secret, trap or shortcut that arises in front of one's path and are an important testing ground for items such as skill, patience and dedication. But then there are also the thirstiest hunters, those who are seized by the desire to know everything more deeply, understand the origin of the places or entities encountered and recover every possible object. All good reasons to start a second walkthrough, perhaps sharing your efforts with the entire community. The desire to better understand the visual details of the nightmare is growing, interpreting every single line of text, opening the field to all the interpretations that can open up the coffers of that implicit narrative so appreciated by From Software fans. Bloodborne is all that and more, just as Dark Souls and Demon's Souls were, in their own way, before it. Creators of a niche, which has grown relentlessly to the point of consecration towards an ever wider audience, which will certainly find in The Old Hunters very valid reasons to take Ludwig back in hand and return to the hunt for blood echoes. The Old Hunters expands the already vast Bloodborne universe with new maps, weapons and bosses to defeat The distortion of a new nightmare The Old Hunters is in line with From Software's past and introduces many substantial innovations. The new game areas, embellished with five unpublished bosses and a considerable amount of additional weapons, in many ways bring to mind Artorias of the Abyss, a rich expansion that had expanded the first chapter of Dark Souls. But there are also content details that extend the narrative background and offer new food for thought to those who love to discuss mythology. Moreover, in conjunction with the release of the material, the developers have made available patch 1.07 which, in just under 10 GB, introduces a good number of changes. The corrections made to the code have served to further reduce those loading times - already significantly improved with the previous patches - which at the beginning of the game were a thorn in the side and required long waits especially when you wanted to return to the central hub. Beyond the purely technical factors, however, new contents related specifically to the DLC have also been included. For example, the League was introduced, a singular faction of Hunters that had never been mentioned so far. In the Forbidden Woods segment it is now possible to interact with the leader Valtir and, by deciding to enlist in his ranks, you can also obtain a new rune and receive additional life points during co-op battles. The contents of the expansion can only be activated after killing Vicar Amelia at the Great Cathedral and bringing night to Cathedral Ward. At that point, returning to the Hunter's Dream, two new objects will be unlocked at the stairs leading to the workshop, exactly as was the case for the first weapons received at the beginning of the game. The first of these materials is the eye of a blood-drunk hunter, a key element that allows access to the Hunter's Nightmare. The brief description suggests that a misshapen creature will lead the player out of Oedon's Chapel, right into the heart of Cathedral Ward. After returningat the appropriate lantern it is sufficient to go out into the side courtyard of the building and be captured by the Great Being positioned on the perimeter walls. By doing so you are teleported into the new nightmare and the journey through the events of the old Yarnham can finally begin. The second key object recoverable from the central hub is a particular bell of the Old Hunter, which can be used to invoke ancient members of the order in the form of characters controlled by artificial intelligence in the vicinity of the various bosses. Also in this case, exactly as it happens for the Calling Bell, each summoning will require the use of an Intuition Point. The support of these subjects managed by artificial intelligence proves to be quite useful, but the fact that they can be used as a source of help even when a second user enters the game undoubtedly contributes to making the more challenging obstacles much less difficult. Moreover, this new feature allows the summoning of the old hunters not only in the traditional maps but also in the battles with the bosses of the procedural Chalice Dungeons. Alternatively, it is possible to disregard any help and stubbornly proceed alone. In this case the intrinsic difficulty of The Old Hunters proves to be really set up. Without supports, the character will have to be prepared more carefully, ~farming~ as much as possible in the already known areas or in the Goblets. During the New Game it is advisable to experience the territories of the expansion not before having reached level 70, while in New Game Plus it will still be preferable to wait until level 120 is exceeded. The challenge level of these sectors is in fact on average higher than much of the game and is in line especially with the final areas of the main maps, such as the Frontier of Nightmare or the castle of Cainhurst. Furthermore, compared to what happens in Mergo's nightmare, you will have to face a much larger amount of hunters, who will not disappear from the radar after being shot down the first time. The latter are in fact intent on fighting the beasts scattered around the map and will reappear on the battlefield with each new loading. Their presence is especially concentrated in the opening segment of the DLC, which depicts an ancient and heavily distorted version of Cathedral Ward. The area is very different from how players have become accustomed to knowing it in the past months, full of new branches, unexpected ups and downs, connecting paths between portions of the map that are usually found elsewhere or shouldn't be there at all. The peculiarity of this first part is precisely due to the wide recognition of the environment, which oscillates between the identification of a part of the architecture and the amazement at the frequent diversity hidden behind every corner. The next two areas are instead completely new and unravel according to diametrically opposite characteristics. In fact, you will have the opportunity to visit a sinister research center that belonged to the Chiesa della Cura, while the final section takes place near a coastal area and alternates open-air paths with tunnels scattered underground. The level design is once again among the flagships of the production: there are many possible paths, countless things to see distributed over a period of time that will require you at least between ten and fifteen additional hours of play. Every corner of the maps requires study, systematic exploration, strategy in order not to end up at the mercy of the enemy and a careful search for all those shortcuts that facilitate the advance. What's more, we also noticed a certain attention to verticality, which finds expression above all in the second area. Playstation 4 trophies The new trophies added by The Old Hunters are only six. Five can be obtained by defeating all the bosses present in the new areas, while the sixth objective is inherent in the recovery of all sixteen new weapons. Armed like the old hunters A note that could be moved to the original contents of Bloodborne was linked to the presence of a rather limited amount of weapons, especially during the experience that was lived in New Game. From Software has treasured these observations and with The Old Hunters has made sixteen new weapons available to the player with the most disparate characteristics, some of which guarantee unprecedented strategic approaches during the fights. This is the case, for example, of the Affetta-Belve, which had already been widely shown in the preview phase. Thanks to this tool, a fair compromise between attacks can be obtainedvery fast melee and long-range whips to reach enemies from medium range. But we can also mention the Explosive Hammer, which contains a small furnace inside which physical and fire elemental attacks are performed, or the Rotating Axe, which in the basic version is nothing exceptional but once connected to a circular saw allows you to link the movements of your hunter with the rotation of the blades and can be a valid alternative to the Hunter's Axe. In our opinion, however, the most particular weapon remains the Arm of Amygdala, which due to the unexpected attack parabolas requires a discreet spirit of adaptation in its own style. There are also new firearms, including a powerful machine gun that discharges high-frequency bursts. Moreover, during our test we realized that, unless you have already finished the New Game Plus and forfeited a considerable amount of Bloodstones, it is quite difficult to be able to upgrade a large part of the new arsenal up to levels +9 or +10 . This factor inevitably ends up having some negative repercussions on the customization of the equipment. In short, there is the risk of remaining conservative, or of becoming sectoral, concentrating at most on a couple of innovations and necessarily leaving the rest in the background. As we said The Old Hunters also offers new content related to the story. There are new characters with whom it is possible to have dialogues, receive information that extends the general background and intersect these details with those already present in Mergo's nightmare. Good feedback has also come from the characterization of the old hunters, who are divided into several categories and often exploit peculiar equipment, which require the assimilation of routines and the identification of the correct counterattack windows with firearms.", "date": "2015-12-01", "grade": "9.0"}