{"name": "Hai fatto il Kill Shot? Bravo!", "ref": "https://multiplayer.it/recensioni/159930-kill-shot-bravo-hai-fatto-il-kill-shot-bravo.html", "text": "Released a year ago, the first Kill Shot was not very well received by the critics: as also highlighted by our review, the game put on the plate a fairly modest amount of content, however peppering everything with massive doses of in-app purchases necessary to continue, betraying its obvious interest in monetizing with as little effort as possible. Having learned the lesson, the Canadian team Hothead Games now presents itself with this Kill Shot Bravo, a sequel that promises to improve the gaming experience in every respect, without however renouncing the free to play sales model: let's see if things went differently this time ... Great variety Kill Shot Bravo obviously starts from the same foundations as its predecessor, putting the player in the role of a sharpshooter committed to completing a whole series of missions that involve the killing of targets linked to an unspecified military organization: as in the first episode, even here the narrative component is so reduced as to be almost absent, but fortunately it is one of the few similarities that link the two products. Mindful of the criticisms received for the poor play offer of Kill Shot, Hothead Games has rolled up its sleeves and in this sequel has not spared itself on the content front: from the main menu it is possible to access a campaign divided into six regions each containing about fifty of missions, participate in public events or engage in PvP challenges with other players based on the score obtained in a single scenario. Definitely appreciable numbers which are also accompanied by the evident attempt by the developers to keep the user's interest alive through the variety of situations offered: in addition to the classic-style levels that see the user engaged in being a sniper while maintaining static position, more dynamic scenarios find space which include short-range assaults with shotguns or frenetic shootings with machine guns and automatic weapons, situations in which Kill Shot Bravo practically transforms into a shooter on rails. A great emphasis is then placed on the management of one's equipment, with the various elements that can be purchased and upgraded by spending the money earned by completing the missions, and there is also room for a marked social component given by the possibility of writing in global chats or private and to join in clan to get special rewards thanks to the contribution of all the participants. Giving space to all this content in a mobile title is not an easy task, and in fact it must be admitted that Kill Shot Bravo ends up curling up on itself a bit, filling the screen of the device with menus, windows, numbers, statistics and buttons that can undoubtedly be confusing. Despite all its limitations, Kill Shot Bravo is an enjoyable and content-rich shooter Free up to a certain point If Hothead Games undoubtedly deserves praise for the improvements made to Kill Shot Bravo as regards the play offer, the same cannot be said about the weight of in-app purchases on gameplay, which is still quite important. We are not at the dramatic levels of the prequel, but even here the tricks adopted to steal money from users are very well rooted, and it doesn't take long to get to a point where the money earned by playing is not enough to buy the upgrades needed to continue in the countryside. Wanting to see the glass half full, this aspect can be considered an acceptable price to pay for a product that is in any case well made from basically every point of view, not least the purely technical one. The control system is simple, precise and reliable, and landing a headshot from sidereal distances gives a palpable satisfaction, further invigorated by a convincing slow motion ~kill cam~ that accompanies the achievement of a mission objective. Graphically, then, Kill Shot Bravo proves to be a product that may not be revolutionary but undoubtedly solid, showcasing sufficiently well-finished and diversified scenarios and convincing polygonal models also for the dynamic animations that vary according to which parts of the body are hit by the bullets.", "date": "2015-12-01", "grade": "7.5"}