{"name": "Beyond: Due anime", "ref": "https://multiplayer.it/recensioni/159893-beyond-due-anime-jodie-torna-piu-bella-che-mai.html", "text": "Beyond: Two Souls was part of that handful of titles that gave an unforgettable swan song to PlayStation 3, almost as if to redeem itself from the disastrous start and wish the best possible start to the new generation now upon us. Analyzed two years later, Sony's plans have exceeded even the wildest expectations, with the Japanese home console gaining a substantial advantage over its US counterpart, growing steadily until it reaches the remarkable milestone of thirty million units placed. One of the clearest implications of this supremacy is certainly the transition of many Xbox players to PlayStation 4, which has seized the opportunity to give them new editions of the great exclusives of the last generation: from God of War to Uncharted, passing through The Last of Us, the collection is now enriched with the two works of Quantic Dream, Heavy Rain and precisely Beyond: Two Souls. The latter is already available on the Playstation Store, while for the intricate events related to the origami killer we will have to wait until next March 2, when a dedicated bundle will also be marketed with both titles in a packaged version. The new version of Beyond pushes on the accelerator by further improving an already valuable technical sector on older generation hardware, but finds itself facing the spectra of an approach to interactive storytelling which, thanks to the last two works by David Cage and associates , has undergone a particularly flourishing period in the last two years, with titles that have proposed game design and narrative choices capable of highlighting all the limits of the sometimes confusing formula behind the tormented story of the beautiful and fragile Jodie Holmes. Two years later, Beyond: Two Souls returns to the improved PlayStation 4 in the technical sector The passing of time Despite the huge investments by the Japanese producer, we can safely define Beyond: Two Souls as an experimental but lucid work in its ambition to rewrite the relationship between cinema and video games, aiming to give authentic emotions and a sense of deep involvement and empathy towards the protagonists of the story, decidedly unusual for a videogame product. Paradoxically, the final rendering was undermined by its creative mind, that David Cage so hungry for drama and pathos as to surround the complex relationship between Jodie and her abstract half Aiden by events and situations at times so forced as to leave the player completely displaced, wondering why resort to certain narrative constructs to expand a range already in itself sufficiently rich in traumatic experiences for the young protagonist. Perhaps intoxicated by the presence of Ellen Page and William Dafoe in the cast, by the very advanced motion capture technology that gave the production a Hollywood feel and by a graphics engine capable of draining every resource from the PlayStation hardware, he let himself go losing sight the few important pillars around which he should have concentrated all his energies, ending up diluting the precious emotionality aroused by the most delicate situations with passages that do not in the least dig deeper into Jodie's psyche and her complex personality. In this sense, the most famous is certainly the supernatural interlude in the Navajo reservations, to which are added a rather gratuitous attempted rape and, why not, the birth of a homeless woman in a cold Chicago covered by a white blanket of snow. As happened two years ago, however, it is precisely the indissoluble bond between Jodie and Aiden that gives depth and involvement to Beyond: Two Souls, to make us fall in love unconditionally with the protagonist and to touch the right emotional chords by dragging us into situations with sometimes strong implications such as an unexpected jab in the stomach. A unique experience, which completely absorbs, leaves its mark and remains beautiful to be relived even today, despite the leap forward made by the genre to which it belongs. The decisions made with the passing of the hours of play tangibly influence the evolution of the characters, constituting a legacy that will accompany us in the various chapters and will change the relationship with the supporting actors, up to the delicate final crossroads. In this regard, to have a more detailed overview of the various possibilities, Quantic Dream has opted for the introduction of a summary screen at the end of each section which collects all the possible choices with relative preference percentages by all the other players. Playstation 4 trophies Beyond: Two Souls offers 46trophies, most of which are hidden so as not to reveal prematurely events related to the plot or decisions related to Jodie's story. For this reason we avoid discussing it extensively, but it is enough to know that to get to Platinum you will have to play it several times making different choices. A new light However, as already pointed out in its time, Beyond: Two Souls fails to convey that sense of freedom already more present in Heavy Rain, forcing the player within a large frame of pre-established events on which to affect in a rather limited way. The new edition immediately puts the player in the possibility of tackling all the missions in chronological order, or of reliving the 15 years of Jodie's story as originally conceived, in a complex temporal plot marked by continuous leaps between the past and the future, passing without continuity from typical teenage school situations to dangerous escapes on the roof of a train, up to the strenuous workouts in the CIA training center. Everything was imposed by the difficult mix between the intention of telling a story whose evolution is contextualized to multiple choices, and that of enlivening the action with chases, fights and heart-pounding sequences managed with quick time events. One cannot live on dialogues alone and a narration chained to the correct chronological order of the events would end up condensing all the adrenaline in the finale, leaving the first hours of the game with a succession of family situations and adolescent dramas centered on dialogues and choices aimed at forming the character of a young girl forced to live constantly with a presence as powerful as it is problematic, willing to help her but always ready to rebel to prevent her from living a normal life. A decidedly unbalanced path, which we therefore advise against pursuing. Speaking of the action scenes, the DLC ~Advanced Experiments~ is added to the package: it is basically a series of environmental puzzles to be solved by exploiting Jodie and Aiden's skills in the context of CIA training. Nothing striking and absolutely ancillary to the main plot, both in terms of narration and gameplay, but additional content worth giving a chance. On the technical front, Beyond on PlayStation 4 takes advantage of the very solid foundation of the original title which made it one of the most beautiful on old generation consoles. The images flow smoothly at 1080p accompanied by a granite frame rate of 30 frames per second, embellished by a new dynamic lighting system that significantly improves the quality of the scene and shadows, increasing even more realism and involvement. The escapes and clashes in the rain are the ones that benefit the most from it, but also the volumetric effects have received a substantial improvement, noticeable above all on the occasion of the explosions that dot the most eventful sequences. While on the one hand the already very accurate polygonal models of the main protagonists have not undergone substantial improvements, the side characters above all benefited from this re-edition, now more accurate in the details of the faces and clothes thanks to the application of richer textures details. In short, a substantial step forward that for those who have not yet experienced Jodie's story in the first person is certainly worth the price of admission.", "date": "2015-11-30", "grade": "9.0"}