{"name": "Tempura spaziale", "ref": "https://multiplayer.it/recensioni/159857-dariusburst-chronicle-saviours-tempura-spaziale.html", "text": "One of the many merits of Steam is that it has also given Western PC gamers the opportunity to become aware of titles that otherwise would have remained confined to console owners. Dariusburst Chronicle Saviours, for example, is one of these: it is the last exponent of a family founded in 1987 with the first Darius+ which has evolved over the years with countless other versions (as in the best Japanese tradition), but which has always remained faithful to the basic idea that the galaxy was infested by the Belser armada, formed by evil robotic creatures in the shape of fish. In its original version Dariusburst was released for PSP in 2009 and was then subject to revision in the coin-op release entitled Another Chronicle. The Second Prologue was released three years ago for mobile systems and deserved the praise of Tommaso in our review. The awaited conversion for the two Sony consoles currently on the market and, of course, for PC ends in these hours. The images should be eloquent enough to explain that we are talking about a horizontal scrolling shooter in which the player, aboard the Silver Hawk space fighter, must exterminate hordes of spaceships in a psychedelic succession of missiles and explosions, facing, at the end of each stage, the tough giant boss on duty. Fish-shaped robotic creatures, Out Run-style crossroads and psychotropic soundtrack: Darius is back! More of the same The structure is quite basic: in addition to the directional commands, only the two buttons of the primary and secondary fire are sufficient to control the spacecraft. The first, which changes according to the chosen Silver Hawk, can be upgraded during the game by collecting colored spheres which from time to time increase the effectiveness of the primary weapon (red), the secondary weapon (green) and the shield (blue ). Then there is the so-called ~burst~, i.e. a powerful beam of energy capable of rapidly sweeping away any enemy whose duration is however limited: in order to be able to recharge it, it is necessary to ~blast~ other Belsers. The levels are short and obviously end with the final boss, who knows how to prove to be fairly challenging already at the lower challenge levels: in order to defeat those of higher difficulty, you need considerable reflexes and excellent coordination with the joypad (or better still an analog stick). As per tradition, the internships do not develop sequentially but present crossroads, in Out Run style, so that, in order to be able to complete them all, it is necessary to repeat the common traits several times: this is an approach that would normally risk becoming repetitive , but which goes well with the philosophy of a shoot'em up like Dariusburst. Double enjoyment From the initial screen you can choose two modes. AC is the same as in the arcades (and in fact you can also choose which of the 90 cabinet models to use, even if it's not clear what this option entails) and is in turn divided into several items. The classic campaign, the one for experts (who share the same philosophy) and the individual missions, in which you have to complete stages with some preset parameters (absence of power-ups, etc.). We must point out a serious flaw that occurs when choosing this mode: the screen is in fact displayed at 32:9, so that only a third of your monitor is used, with two gigantic black bands that limit the field of vision. Probably with a dual screen solution (which we have not had the opportunity to test) this setting is correct (let's not forget that the cabinet is developed on two monitors), but in traditional configurations it proves to be absolutely inadequate. And it's a shame, because the bulk of the offer is proposed in this way. By selecting the unedited CS, the display problems disappear and the action is reproduced in full screen, with all the resulting benefits. In this case we will find ourselves facing a series of missions in sequence with a dual objective: in addition to completing the game we should try to climb the rankings to give proper gratification to our ego. The internet component of Dariusburst CS does not limit itself to recording the ranking of the players but provides for real events in which we obviously could not participate as, at the time of the review, the title was not yet available for the general public. Instead, we tested the fun deriving from cooperative games: up to four players can lend a hand in maintaining peace in the universe. The foundations obviously do not change, but the satisfaction in taking out the cursed end-of-level crab increases exponentiallyially. Space column The soundtrack was edited by Zuntata, a band directly employed by Taito that has become a cult object among Japanese music lovers (and not only): they are the authors of the soundtracks of Arkanoid, Puzzle Bubble, Ninja Warrior and numerous other blockbusters. The offer is rich and includes a selection of unreleased tracks and hits from the past remixed for the occasion. It is also worth listening to on your home stereo, but it reaches its maximum effectiveness during gaming sessions where it helps to create a state of competitive trance: truly excellent. From a graphic point of view, the notes are rather painful: beyond the technical problems that afflict the Another Chronicle mode, the visual rendering is not at all satisfactory on desktop systems, unlike what it could have been in a mobile environment. The polygons are very few, the low-resolution textures and not even the special effects are as convincing as it should be in a genre that makes adrenaline and spectacularity one of its reasons for being. The settings are at least well varied. All this is compensated for by an extremely rich offer that will be able to keep enthusiasts glued for several tens of hours: in this respect the Japanese almost never contradict themselves.", "date": "2015-11-30", "grade": "7.0"}