{"name": "Ritmo lento", "ref": "https://multiplayer.it/recensioni/159731-beat-sports-ritmo-lento.html", "text": "The release of the fourth generation of Apple TV brought with it the main novelty of the new tvOS operating system derived from iOS, thanks to which even the Cupertino set top box was finally able to have access to a catalog of apps to be installed on the internal memory similar to smartphones and tablets. This also meant an unprecedented and tantalizing opening towards gaming, with what in fact represents a new attempt by Apple in this sense after the Pippin bankruptcy. As per tradition, however, the Californian giant has not chosen to engage personally in the development of video games, trusting in the commitment of third parties and in the contemporary and directly correlated good response of the public in terms of hardware sales. Among the few exclusives that accompanied the first weeks of life of the product, this Beat Sports made by Harmonix seems to stand out, ~those~ from Guitar Hero, Rock Band and Dance Central, just to name a few of the titles made in the twenty-year career. Beat Sports is unfortunately not the game capable of giving prestige to the gaming component of Apple TV It's not Wii Sports At first glance, Beat Sports seems to want to make the similarities between Apple TV and Nintendo Wii fully explicit as regards potential target users and - above all - for the control system that passes through a remote control equipped with a gyroscope and accelerometer. If the cornerstone of the success of the late president Iwata's console was indisputably Wii Sports, the Harmonix title could appear just like a sort of more or less shameless copy of that concept. In reality, the proof of the facts is only the sporting theme that remotely connects the two products, whereas the gameplay of Beat Sports refers absolutely to the genre of rhythm games. Wanting to point out a more appropriate citation in fact, one could find more points of contact with SEGA's Space Channel 5 rather than with the Nintendo blockbuster: either for the space setting, or for the need to listen to the rhythm proposed by the alien opponents and reproduce it with right timing. Certainly the protagonist in this case is much less intriguing and alluring than the sexy reporter Ulala, and unfortunately the music also appears not even remotely comparable in terms of effectiveness and the ability to remain impressed in the mind, despite the contribution for some tracks by Masaya Matsuura (Parappa the Rapper, Vib-Ribbon). The game is essentially divided into 3 disciplines, respectively called Volleyball, Extravagant Battuta and Hungry Holes: the first is a sort of cross between volleyball and tennis, the second recalls baseball, while the third is inspired by golf. Even with the respective variations, the gist of the gameplay is always contained in the simple need to hit a ball with timing, to the rhythm of the beat. All this through the movement of the Remote, which can be performed in any direction, and on some occasions by swiping on the touch surface. It takes little to understand how there is a lack of verve, of inspiration in the Harmonix title, which soon collides with a repetitiveness and a certain sense of predominant boredom. In this sense, the medal evaluation system, which rewards with objects and clothing for your avatar, and the bland 4-player multiplayer mode to be exploited by having each user download the appropriate free app on his iPhone. However, the main problem of Beat Sports is the most serious one for a rhythm game, namely the lag between the moment in which the command is given and its actual execution on the screen. A few moments of delay are enough to make the experience frustrating, and this is precisely what happens in Harmonix's fatigue, especially when the difficulty starts to rise. In reality it is almost always possible to replace the movement of the Remote with the click of the touchpad, but the result improves only slightly. Considering the developer's experience, one would have expected the presence of an option to adjust the timing of the inputs, which is rather trivial in this genre of games but very necessary considering also all the many and different factors in competition for each individual case (controller, TV, sound system). The hope is that a future update will correct this shortcoming, but at the moment it is impossible not to point it out as the main defect of a product that is in any case certainly not able to establish itself as a killer app for Apple's set top box.", "date": "2015-11-27", "grade": "5.5"}