{"name": "Tales of Legendia", "ref": "https://multiplayer.it/recensioni/tales-of-legendia.html", "text": "Legacy, Eres and other goodies Namco's bizarre choice to set practically the whole adventure in one huge location: in fact, the gigantic and self-propelled Legacy island is the stage on which our heroes will move. The protagonist of Tales of Legendia, Senel Coolidge, finds himself shipwrecked on this huge island-ship together with his sister Shirley: fleeing from a mysterious threat, Senel will discover that he has fallen from the frying pan into the fire when Shirley will be kidnapped by a shady figure . Out of necessity, Senel will be joined in the search for little Shirley by some rather wacky adventure companions, including a pedantic sheriff, a masculine swordswoman and a childish treasure hunter, not to mention a soft-hearted bandit, an omniscient spy and a sweet dancer. Uniting this motley crew of heroes is their ability to wield powerful Eres magic, as well as their connection to the legend of the divine Merines and the lost civilization that built the Legacy before it was wiped out by a terrible cataclysm. So: a reckless and stubborn hero, a damsel in danger of dark fate, a band of absurd traveling companions, an evil and violent empire, a tyrant with delusions of omnipotence, a lost civilization and a looming disaster: there is no denying that Tales of Legendia is a combination of clichs rarely seen before. The plot, although interesting, leaves plenty of room for considerable deja-vue, and even the characters, especially some protagonists, seem very stereotyped. However, they are not major flaws in an all in all original narrative structure which is divided into two distinct phases: a first, the so-called ~Main Scenario~, which is nothing more than the main storyline that will be played from the beginning; and a second phase, divided into ~Character Quests~, which will tell the personal stories of the various protagonists, characterizing them in more detail while clarifying some obscure points of the story. Tales of Legendia, in short, is narratively a strange experiment, a mix of abused and other original ideas, which together with the classic gameplay demonstrates Namco's willingness to celebrate the anniversary of the series with a return to the classicism of the JRPGs, without forcing the hand on new and necessarily abstruse aspects. However, it must be said that the characters of Legendia fail to arouse in the player the same affection that Lloyd, Collette and the other protagonists of Symphonia already inspired from the first hours of the adventure... Tradition... A constant in the Tales series (or at least in the real JRPGs of this Namco cycle) has always been the combat system, which in 1995 had won the hearts of fans of the genre with the original fighting game setting scrolling, in a period in which turn-based combat series such as Final Fantasy and Dragon Quest were the masters. The Linear Action Battle System has since been reworked several times to match the standards of the various consoles that inspired the series, and while it was recently nearly overturned in Tales of Symphonia, with the addition of multiple parallax ~lines~ during the clash, in Tales of Legendia we go back and return to the total two-dimensionality of the clash, despite the three-dimensional and polygonal realization of characters, opponents and background. The random fights (another step back, compared to the visible and avoidable enemies in Symphonia) are faced as in any Tales, directly controlling one of the characters (generally, Senel) while the others are managed by the AI, which will eventually follow the models behaviors assigned to each character (really limited guidelines). By pressing the controller keys it will be possible to carry out combinations of attacks (moreover, for the first time in a Tales the protagonist is not armed with a sword, but fights with his bare hands), both normal and special: the latter are divided into Iron Eres, or real fighting game ~special moves~ performed by fighters such as Senel and Chloe, and Crystal Eres, real magic that can only be launched by certain characters such as Will and Norma. Furthermore, during the fights, a special indicator will be charged, and once at the maximum it will be possible to use the Climax: time will stop for the enemies, allowing the player to attack as he prefers without interruptions, or to use a combined super-attack extremely harmful. Tales of Legendia returns to the total two-dimensionality of the clash, despite the three-dimensional and polygonal realization of characters, opponents and background. Tradition... Among other things, the mechanism by which it is possible to ampimprove the war skills of our heroes: for the Iron Eres it will be necessary to use the various attacks learned from level to level several times to obtain even more powerful combinations, while the Crystal Eres learned will be normally executable only after having obtained their essence, once defeated in battle. There is also the possibility of creating Compound Eres, combining a rather devastating sequence of Eres in a single key. Unfortunately the artificial intelligence of the enemies is not up to the excellent combat system: the possibility of varying the level of difficulty seems to affect only the amount of hit-points of the opponents who, excluding the bosses, seem simple cannon fodder ; their overlap during the clashes in fact allows you to get rid of multiple opponents with single attacks, while they charge with their heads down. Tales of Legendia is naturally not made up only of battles, but unfortunately the puzzles that had distinguished most of the dungeons in the previous episodes are missing: instead of the ingenious puzzles scattered in the various labyrinths, in Legendia, rooms peep out from time to time calls Puzzle Booth, in which a simple puzzle will have to be solved to continue exploring the location. The absence of a puzzle component in dungeons tends to make them decidedly linear and all too simple, as a result. Fortunately, Namco has once again included all those classic divertissements that surround the narrative and playful corpus of the adventure as a pastime; so here comes the culinary side-quest, with a funny cook to be found around the dungeons to learn how to cook some healing items; here also in Tales of Legendia the possibility of merging various items to obtain new ones, more powerful than those normally recoverable, is proposed again; here are the arena and tournaments, the rating with rewards for battle performance and much more. Despite the sensitive linearity, Legendia allows the player to leave the narrative tracks to undertake these ancillary activities: considering the certainly not impressive duration of the adventure, it was certainly a good idea to continue this tradition. ... and Revolution? The graphic style of the Tales series undergoes a new transformation with Legendia: after the magnificent cel-shading adopted for Symphonia, this time Namco has dabbled in texturing the polygonal models so that a certain plasticity of the image stands out. Protagonists, supporting actors, enemies and monsters therefore appear like puppets, thanks also to the super-deformed realization, both in the normal game phases and in the combat ones: the variety and fluidity of the animations makes them a little more alive, but this style unpublished requires a few hours of play to be appreciated; in fact, the first impression will tend to make purists turn up their noses, who will already be a little banned by the excellent but bizarre character design: the medieval and typically fantasy style returns, this time however influenced by extremely exotic and almost indigenous traits (just think to Moses). The care given to the creation of the various truly magnificent environments deserves special praise: rich in detail, colorful and often surprising, dungeons and cities are a joy for the eyes, as is the three-dimensional world-map (well found, in a period in which geographical maps with fixed locations are in vogue). As for the sound, there's little to say: Tales of Legendia probably has one of the best soundtracks ever made for video games of this generation. Beautifully orchestrated, the soundtrack of Legendia is full of tracks of all kinds, able to underline in an exemplary way the emotion of the most important cutscenes or the frenzy of dungeons and fights. The quantity of tracks, often even sung, and the melodic and instrumental variety truly deserve special praise. It should even be underlined that the opening song that accompanies the splendid introductory cartoon film (once again edited by Production I.G.) is for once a very pleasant alternative, in the American version, to the original Japanese song ~TAO~ (the players American versions of the various Tales will probably remember the absence of splendid songs such as Flying in Tales of Eternia or Starry Heavens in Tales of Symphonia). The dubbing is also excellent, even if the choices of some voice actors (Shirley, for example) leave a little dumbfounded by the tone of voice that is a little too childish: the acting is still of good quality. Tales of Legendia is certainly not a masterpiece like Dragon Quest VIII, but it is senno doubt an RPG that fans of the genre will appreciate for its balance between tradition and innovation, however leaning a little too much towards the former. Unfortunately not shining for narrative originality (despite the interesting second part dedicated to the Character Quests) or characterization of the protagonists, Legendia relies on a playful sector not without defects, first of all the linearity of the dungeons, interspersed more by simple random fights than by ~intellectual~ component, linked to the occasional Puzzle Booth. For Tales fans, therefore, Legendia will seem like a step backwards compared to the excellent Symphonia, but those who have not been able to enjoy the Game Cube adventure in understandable language will have the opportunity to enjoy a new generation Tales on PlayStation 2 as well. therefore a touch of bitterness for a good quality title that does not excel by virtue of Namco's desire to anchor it to too traditionalistic traits: therefore recommended to fans of the genre and to those waiting for Dragon Quest VIII who don't know which RPG to play and want to enjoy a good story without too many pretensions, together with a still very fresh and very fun battle system.Pros Excellent combat system Graphically valid Soundtrack of great workmanship Cons Too traditionalist Overly linear design Few puzzles and low difficulty It seems like an eternity since 10 years ago on the SNES the Japanese had the pleasure of playing Tales of Phantasia, the forerunner of a series that has since made a lot of talk about itself, especially for the dancers and bizarre localizations. And so, while finally in the West we are preparing to welcome the understandable language version of that same Tales of Phantasia, but this time on the Game Boy Advance, Tales of Legendia also appears on the shelves. Comparison with the other Tales in English of this generation, Tales of Symphonia for Game Cube, is practically a must, and even if Legendia seems to have some gear less, it certainly deserves the attention of fans of the saga and JRPGs.", "date": "2006-03-15", "grade": null}