{"name": "Non chiamatelo XCOM", "ref": "https://multiplayer.it/recensioni/159661-hard-west-non-chiamatelo-xcom.html", "text": "To go out on the market in the same period in which blockbusters such as Assassin's Creed, Call of Duty and Tomb Raider are also appearing, it takes a good dose of courage, which evidently is not lacking in the guys at Creative Forge Games. Their Hard West project proved to be ambitious right from the start, when on Kickstarter it presented itself as a strategic one in which exploration and adventure elements would also play their part: with these premises, the crowdfunding campaign closed at mid 2014 with $100,000 raised, then postponing us almost a year later until the first real contact we had with this game. In fact, the test of the demo version given to the backers dates back to a few months ago, during which we spent words of appreciation, also accompanied by some doubts about the parts of Hard West still to be discovered. The arrival of the final edition, which took place a few days ago on the usual Steam, finally allows us to draw conclusions. Hard West is not a simple XCOM in the time of the cowboys: great work, Creative Forge! For a bunch of dollars Hard West is a title that can be played exclusively in single mode, where in the absence of other types of game it is the campaign that constitutes the entire soul of the experience. The story told to us by Creative Forge opens with the journey of a family on the Oregon Trail, to go in search of fortune: during the journey, something inevitably goes wrong, forcing father and son to recover their wife and mother from a group of criminals. This will not end well, and the two will find themselves without possessions in a land as unknown as it is dangerous: so we get to know our Warren, who will still be able to find love in the beautiful Florence, without giving up the his goal to return to following the Oregon Trail. For the benefit of those who have not read the Hard West trial, we remind you that the setting is not exactly that of a spaghetti western, but rather is placed in the ~weird west~ of From Dusk to Dawn, combining the classic world of bullets and cowboy elements related to horror and the supernatural. To get an idea of what awaits us, just think that the story is narrated by Death itself, the true protagonist of the story told through eight chapters, each dedicated to the point of view of a character with undoubtedly interesting plots. Despite the inevitable clichs, the narrative developed by the developers is able to keep the player glued to the desk, also taking advantage of the part of the Hard West where you don't shoot. In fact, between one mission and another, the game gives us the opportunity to explore the map of the area where the portion of the story takes place, visiting places that allow the story to go on but also allow us to make decisions that go somewhere way to influence subsequent events. For example, you can choose whether to carry out an action to weaken one enemy rather than another, or even go around collecting money and then spend it in the market, where you can buy weapons and items to use in battle. Exploring the map also allows you to recruit additional allies to take with you on your next shootout. Wanting to find a hair in the egg to the dynamics designed by Creative Forge, we have to say that Hard West does too little to entice the player to let himself be taken by the exploratory mode compared to the strategic one, in absolute value much more inspired. We hope that sooner or later an expansion or a sequel will give more space to this mode. Matter of luck In passing, Hard West may seem like just an XCOM clone dedicated to the old west. In some ways that's obviously the case, but limiting Creative Forge's creature to this comparison - excellent as that may be - doesn't do it justice. The most distinctive element presented by Hard West is undoubtedly the concept of luck, according to which a shot manages to hit the target or not. It works like this: when you attack, the success rate of the hit is compared to the number of luck points possessed by the enemy. If the difference is positive, the bullet is able to hit the target, otherwise it misses. With each successful blow from the opponent, the character on duty loses an amount of luck linked to the aforementioned confrontation, conversely gaining points in case he is hit. It is a dynamic on paper perhaps a little difficult to understand, but immediately assimilable when you are in the game: its introduction offers quite particular implications, encouraging the player to choose the right moment to exitand uncovered by the inevitable cover system. Speaking of the latter, as already seen during the test it is possible to use tables and other objects to build a cover where there would be none: this is just an example of interaction with the Hard West scenario, where for example it is possible to notice the presence of an enemy thanks to his shadow, or shoot through a curtain to hit him. Instead of the usual skill tree, Hard West offers a series of poker cards, each associated with an active or passive skill to be assigned to one of the characters, interchangeably between one mission and another. Even this idea turns out to be very nice, because by creating combinations of cards that reflect winning hands in poker (for example a pair of aces) you can unlock additional bonuses. Skills, as well as weapons, have a varied range of actions, such as our favorite which allows you to shoot all enemies in the character's visual cone. The fact that so far there has been no talk of defects does not mean that Hard West does not have them: the main complaints of the players concern the absence of a guard mode for the characters, with good reason we would add given that the enemies have one instead and they don't let themselves be asked to shoot our passage within their attention span. The behavior of the artificial intelligence is also fluctuating: although overall the clashes manage to require a fair amount of tactical thinking, the enemies tend to remain a little too much out of their cover, especially when they are discovered. The checkpoint system should also be reviewed: in some cases the length of a single mission can also be quite high, and being forced to start all over again is not exactly the best. This happens more times than one might think, because on the death of a character considered essential for the continuation of the story, the game shows us a nice game over, forcing us to restart the mission. The analysis of Hard West also returns an extremely positive result under the stylistic aspect, where indeed this title manages to touch peaks of excellence. Creative Forge has evidently spent a lot of time characterizing the world described within the game, presenting scenarios full of details and classic elements of the western genre, expertly coupled with the supernatural elements that make up the setting of this title. A gloomy atmosphere, which really gives the feeling of being poised between life and death amidst bullets, dust and strange demonic rites, painted in a style that nods to graphic novels. The sound is also of an absolutely high standard, starting with the dubbing of Death, to which practically all the dialogues are entrusted given her role as narrator, which, if necessary, leaves room for a series of pieces composed for the occasion by Marcin Przybyowicz, previously also working on The Witcher 3.", "date": "2015-11-25", "grade": "8.0"}