{"name": "Un bel guazzabuglio medievale", "ref": "https://multiplayer.it/recensioni/159529-knight-squad-un-bel-guazzabuglio-medievale.html", "text": "In the progressive complication of current videogame experiences, every now and then it is good to return to the frank simplicity of a sword in the teeth given without particular calculations or hesitations, and this is why Knight Squad manages to immediately take any type of player. Like a beautiful hodgepodge of classic suggestions, there are several elements that make us immediately like them: there is the simple and cruel strategy of Bomberman, the framing and carefree violence of Smash TV and the medieval labyrinths of Gauntlet, all condensed into a mixture with a strong arcade flavor and all based on multiplayer games. Don't let its simple looks fool you, Knight Squad is the result of a constant refinement process that has been going on for some time now. Released in early access on Steam about a year ago, the game has evolved to its current form starting as a multiplayer game exclusively in presence and enriched with the fundamental addition of online multiplayer only in recent times. In fact, the atmospheres and the mechanics suggest that the best use would be the offline one, with the companions / opponents at a slap and the infamous ones with gestures of annoyance attached to frame the action on the screen. And all this is still always contemplated by the game, but it is certainly not easy to be able to create such a situation at any time, therefore the solution offered by online multiplayer is essential to appreciate it. The Xbox One version therefore reaches the culmination of the project's maturation and is rich in a good amount of content and game elements available directly ~out of the box~, these too built and refined over time, through the long test period represented from Early Access with the active support of the players, but it is very likely that the path has not yet concluded and that Chainsawesome Games intends to revive the offer again with further game modes and options. You too come to battle: Knight Squad stages a fun medieval massacre Knights and clubs Inside arenas represented by fixed screens framed from above, eight knights face each other pursuing different goals depending on the game mode but all concerning in some way the elimination of others and the need to score points. There are many variations on the theme: there is the classic free-for-all or team deathmatch, the good old ~capture the flag~ or the mythological digression ~capture the grail~, modes that require you to score points by staying inside as much as possible of a certain area of the map, the ~Juggernaut~ mode, based on the conquest of a special weapon that guarantees a considerable advantage over the opponents but at the cost of having to face them all together, a sort of football game with a huge rock to throw in the opponent's goal and various other variations on the theme, with the central nucleus always and in any case provided by direct confrontation with the other knights using various types of weapons. To all this are added further implications such as the presence or absence of automatic respawn, the modification of the victory conditions and the duration of the games and much more. With such a simple and fundamentally repetitive basic structure, the presence of a large amount of variations on the theme becomes very important to enrich the gameplay and keep the interest in the game high for a long period of time, and on this front the team has worked well, providing a good choice of alternatives, which allows a continuous rotation between game modes, all of good quality. The interesting feature is that all the game options are associated well with the clash system, the weapons made available and the construction of the maps. While there are indeed ups and downs between the various modes, they all become equally valid when thrown into a steady, fast rotation, so you don't abuse your usual two or three favorite options for too long. Multiple duel Combat is lightning fast as each character has practically only one hit point and is eliminated on the first attack he suffers (unless he picks up a shield, in which case he can suffer two attacks before perishing), so it is a question of attacking first and aim well, taking into account the different particularities of the weapons that require different approaches to the enemy, always in the order of the few seconds allowed to make one's move. Weapons and power-ups are located within the maps and regenerate at regular time intervals, with a broad division between melee weapons such as swords of various shapes and maces and weaponslong-range god like bows, wands, and guns, plus explosives and drills to break through walls. With eight fighters in a small arena you can imagine the chaos that arises in every match, with a frenetic pace that causes fighters to leap into battle, collide and perish within seconds and then return to the field in moments after (unless a no-respawn game mode is active) and restart the sequence, averaging one death every 10 seconds or so. Just to add further confusion, the overhead shot is quite distanced and the characters appear rather small, which makes it even more difficult to perfectly discern what is happening in particularly agitated situations. It is therefore not a particularly tactical game and chaos represents a bit of a distinctive element, but in modes without respawns or in team battles, where it becomes difficult even to distinguish one's companions from opponents, this lack of clarity becomes quite annoying . Another problem encountered concerns online multiplayer, which in some cases suffers from a certain lag involving micro-jerks of fractions of a second: although they do not seem to be major problems in a title played entirely on millimeter and fraction-of-second clashes, they become very important, although everything could simply depend on the quality of the connection. Spartan warriors A game like this clearly doesn't focus on photorealism or particular high-tech solutions to stage the clashes. Knight Squad prefers a humorous and caricatured tone, also managing to build its own particular identity within the market, although it does not differ much from several other independent productions. It also partially manages to escape that Flash game tone that high definition 2D graphics often tend to have, taking refuge in the ancient suggestions that we have already mentioned above. In any case, the technical realization is perfectly functional to the game and is also fun, as demonstrated by the cartoon animations, the design of the characters and the voice commentary on the clashes which fully incorporates the style of ultra-violent fighting games such as Mortal Kombat, to mark the particular contrast between the brutality of the action in the arena and the general cartoonish look. Of course, this is not a particularly inspired design or able to stand out among the numerous old-school action games currently present in the indie scene, but in a title that makes gameplay its pillar, the aesthetic aspect necessarily remains in the background. More serious is the problem of poor visibility of the elements on the screen, with the shot and the color choices that often prevent a clear vision of what is happening in the game, as we reported previously, which can be decidedly frustrating considering also the extreme speed of the action and the little time allowed to make one's moves. Some doubts also emerge on the access to data made by the game, given that the loads are particularly long despite the levels being limited to a single screen, therefore they shouldn't require an excessive data flow. Along with the lag issues encountered, these are also elements that can easily be fixed with subsequent updates, and considering the status of Knight Squad, fresh out of its extended Early Access testing period, it is likely that there is still some something to record.", "date": "2015-11-23", "grade": "7.8"}