{"name": "L'eterno conflitto", "ref": "https://multiplayer.it/recensioni/159490-eternal-arena-leterno-conflitto.html", "text": "MOBA and action RPG belong to different strands, although they share various aspects and characteristics. In both cases, these are genres that work quite well in the mobile sector, since they go perfectly with a touch control system (in particular multiplayer online battle arena). Over the last few years we have seen brilliant exponents of the two categories depopulate on iOS and Android, see for example the Dungeon Hunter series, the excellent and recent Ire: Blood Memory or, on the MOBA front, productions such as Vainglory or the original and ~hurried~ Call of Champions. However, NetEase Games' vision is different, and practically combines the best of both worlds, offering us an engaging mix of situations that cannot leave us indifferent. Eternal Arena has the name of a multiplayer online battle arena, yet it is basically an action RPG, with missions in which you have to explore scenarios in search of treasures and enemies to face, but also stages in which you have to resist the attack of different waves of opponents, or collide with a powerful boss. However, this type of level is accompanied by others in perfect MOBA style, with one or two corridors to go through with the aim of destroying the towers of the hostile faction, minions included. Oh, and let's not forget the competitive online multiplayer... Eternal Arena is a great surprise, a successful mix between action RPG and MOBA that focuses on variety Blood and sand The incipit of Eternal Arena is very particular, as we are asked to select an avatar but that will not be the character we will control in the game, but a team made up of three warriors from a shortlist of over thirty heroes, divided into categories tank, ranged and mage: the former are clearly skilled in hand-to-hand combat, but also have great resistance to blows; the latter can bring devastating ranged attacks, but be careful to avoid close encounters with enemies; Finally, mages are support units that have healing and/or offensive spells often based on the elements. Mindful of the experience with Dungeon Hunter 5 and, in general, with approaches to the action RPG genre which often do not include evasive maneuvers or parries, we have chosen to use a ranged and have carried it forward for a few chapters, unlocking various maneuvers and obtaining a plenty of firepower. The nice thing is, however, that it takes just a tap to switch from the default character to any of his companions, which means that we can actually tackle the missions as we please ... even by pressing the autopilot button and standing by. The control system is traditional, with an excellent virtual analog stick repositionable and a series of buttons on the right side of the screen. The interesting thing is that the layout remains the same even during MOBA-style missions, thus allowing a different, more active and less close to the RTS philosophy approach to action. Graphically really well done, were it not for the inevitable repetitiveness of some scenarios, Eternal Arena can be played easily even without spending real money, or at least after a few hours the freemium model did not seem to us to make changes to the difficulty balance such as to make it necessary a little grind to be able to continue. The presence of the traditional ~action energy~ is also implemented in an elastic way, without particular impositions.", "date": "2015-11-21", "grade": "8.5"}