{"name": "Il libro della giungla", "ref": "https://multiplayer.it/recensioni/159210-guild-wars-2-heart-of-thorns-il-libro-della-giungla.html", "text": "Since before its release, Guild Wars 2 has stood out in what was becoming an increasingly stale and predictable MMORPG landscape thanks to a multitude of factors. Firstly, it was the important legacy of a title that had made history and that had made the ArenaNet software house famous. Surrounded by a practically messianic aura, Guild Wars 2 had become a legend even before it existed: in the official and non-official forums, users literally slaughtered each other, dividing between those who looked at it with suspicion and those who were sure that it would crush the competition. Guild Wars 2 would not have imposed a monthly subscription and, moreover, would have said goodbye to many structural cornerstones of the genre such as the role-playing triad, mission leveling and vertical progression. We liked Guild Wars 2 very much, even if we recognized certain limitations, but over time it was ArenaNet that disappointed the expectations of its most loyal fans, implementing changes and solutions that betrayed the historic philosophy of the franchise. Waiting for an expansion that seemed to never arrive, the players had to settle for updates that over the months had become increasingly inconsistent and rarefied. The lack of stimulus and limited developer support seemed to have engulfed the success of Guild Wars 2, especially after the announcement that it would go from buy to play to free to play, but in reality a first expansion was really boiling in the pot that was busy any ArenaNet resource. We have finally played that expansion, Heart of Thorns, and we are about to tell you if the long wait has been concretely repaid. We explored the jungle of Maguuma in the first expansion of Guild Wars 2: Heart of Thorns Our job is to march... The narrative component of Guild Wars 2 was probably one of the most intriguing aspects of the game: despite ups and downs, it accompanied us for eighty abundant levels, telling us between crossroads and twists and turns the struggle between the free peoples of Tyria and the ancient dragon Zhaitan , awakened in the lost continent of Orr. Eventually we managed to get rid of the monster, but obviously the problems weren't over. In these three years, ArenaNet has developed the so-called ~Living Story~, implementing update by update new missions that evolved the history of the world of Guild Wars 2 and its inhabitants. While not fully convincing players, the Living Story changed the game world - destroying and rebuilding Lion's Arch, for example - and introduced new characters who gradually became almost more important than the protagonists in the Destiny's Edge guild. Heart of Thorns connects directly to the last chapters of the Living Story which saw the debut of Mordremoth, a new ancient dragon capable of controlling the less resolute Sylvari: this ploy allowed the writers to raise some social tension, without sacrificing the players who belong to the race in question or the important supporting characters such as Canach and Trahearne. The problem is that the new storyline does not delve much into the aforementioned tensions, and limits itself to following the adventures of our alter ego, busy looking for the members of Destiny's Edge captured by Mordremoth and imprisoned in the bowels of the Maguuma jungle. There are some interesting twists and turns along the way that delve into new and old characters and the mythology of Guild Wars in general, but they are short and interspersed with much less compelling dialogue and interaction. On the other hand, the musical accompaniment signed by Maclaine Diemer and Leif Chapelle, who replace Jeremy Soule, is consistently of quality, even if it does not reach his - however very high - standards. Furthermore, for Heart of Thorns, ArenaNet has abandoned non-interactive dialogues, preferring short cinematics - unfortunately super compressed - for important events and, more frequently, very simple comic dialogues during which it is possible to continue moving and fighting. The new solution seemed more attractive to us, but we missed the multiple choices and alternative routes: they exist, but they are much rarer. And the fault, probably, is also of the masters. ... and the jungle will cross... The story of Heart of Thorns takes place entirely in the four new regions that ArenaNet has implemented for the occasion, all in the heart of the mysterious jungle of Maguuma: although they may seem few and the context may suggest a narrow visual variety, the new areas have revealed to be truly surprising and rich from every point of view, once again demonstrating the talent of the American developer and his artists. Already the FrThe first Guild Wars 2 had accustomed us to these boundless maps that structured themselves in every direction, even underground and underwater, but already the first area of Heart of Thorns, Verdant Brink, risks making even the most tenacious explorers lose their heads among suspended wrecks, gigantic vines, ancient ruins, underground caves, treetop villages, secret passages, infinite precipices, and so on and so forth. The zones that follow it - first Auric Basin, then Tangled Depths and finally Dragon's Stand - each represent a different face of the Maguuma jungle. Auric Basin is the brightest and most verdant map, while Tangled Depths literally sinks into the bowels of the earth. Finally, Dragon's Stand is a bit of the summation of the previous maps, and literally develops in every direction, in a true triumph of level design. Exploring the new Guild Wars 2 regions, however, is no easy feat. First of all, the enemies are a bit more mangy than normal: the four regions are designed for level 80 players who have mastered the combat system and know how to dodge, counter negative conditions and fluidly switch between melee and ranged attacks. Then there are the masteries, the new progression system that basically turns Guild Wars 2 into a kind of ~metroidvania~ sui generis. Having reached level 80, the player selects one of the four masteries - in turn divided into ranks - and conveys every experience point earned into it. Once the bar is filled, you spend the mastery points accumulated by completing story missions or even just exploring to buy the newly learned mastery. At that point you can accumulate experience to unlock the next rank of the same mastery or change mastery completely. It is important to note that only the experience points earned in the Maguuma jungle contribute to its four masteries: in the ~old world~ it is possible to learn completely different masteries which allow, among other things, to craft the infamous precursor weapons. Maguuma's masteries, on the other hand, are really used to explore the jungle far and wide. Platforms that previously seemed unreachable will become so thanks to the ~glider~ that allows you to glide temporarily in mid-air and the successive ranks of this mastery will allow us to flutter longer and faster or take advantage of the updrafts to reach unthinkable heights. Another mastery will teach us to use the mushrooms scattered around the jungle as trampolines, yet another will allow us to sneak into certain underground tunnels to reach new locations or shorten the distances that separate two too distant ones. Still another will help us understand the language of the inhabitants of the jungle, so we can buy objects and materials that were previously closed to us. The mastery system is original, within the MMORPG genre, and works wonders: it encourages the player not only to explore every corner of the beautiful maps, but also to plan his progression according to a certain logic. As we said, it reminded us of Castlevania: Symphony of the Night games, where the discovery of a new gadget or a new ability unlocked new areas until the end of the game. Unfortunately, however, ArenaNet has ruined this splendid intuition with a truly controversial choice in our opinion. ... we don't know why but they tell us that... As we said earlier, acquiring a new mastery has two prerequisites: you must have accumulated enough experience points to unlock it and all the mastery points needed to purchase it. If mastery points are earned in various ways, experience points are based on discovering new areas or points of interest, killing enemies and completing missions that tell the story of Heart of Thorns. Even the new mini-games called Adventures allow you to earn a good number of experience points at least once a day, but none of these activities is enough to fill the fateful bar and the player is therefore forced to resort to the public events that take place continuously around the the maps. The jungle regions of Maguuma, in fact, totally lack the missions marked by the ~hearts~ that the developer had scattered throughout the areas of Guild Wars 2 and which could also be completed alone: Heart of Thorns pushes all the accelerator on the activities group, a bit like it happened in the last three Orr maps before the expansion came out, but this solution is far from effective. We have already mentioned that the difficulty in general has increased, but the chained public events that follow each other in each mapa are practically impossible to complete alone and always require a good number of players, especially the more elaborate ones who need a discreet collaboration on several fronts, especially at night when Mordremoth's minions become more tenacious and intrusive. As a result, a lot of time is spent chasing unfolding events, looking for the most populated maps to join the caravans of players frantically running from one area to another grinding enemies and counting down the seconds until the next stage. It's a chaotic activity that eventually becomes a bit boring and that clashes strongly with the wide and relaxed breadth that characterizes the exploration and horizontal progression of Guild Wars 2. If you are unfortunate enough to play at one point of the day less loaded, perhaps in a sparsely populated instance of the map, it is almost impossible to do anything and we might as well dedicate ourselves to the growth of another character: fortunately, the masteries are shared by the whole account and so it becomes easier and faster to progress in the meanders of Maguuma using multiple professions, including perhaps the new Revenant introduced with the expansion, even if only to unlock the new elite specializations that expand the arsenal of each profession in terms of weapons and skills, proposing completely new mechanics and strategies . Nonetheless, it is difficult to overlook the ~grind~ of experience points and masteries, also because some story missions force the player to unlock certain masteries before others, imposing a certain path even against his will. In any case, the acquisition of each new mastery is preceded by an exasperating repetition of public events which, regardless of the zone in which we decide to ~grind~ them, still force us to depend on the other players and on the whims of the server: considering that the most complex and spectacular events such as the final battle at Dragon's Stand require the collaboration of dozens of players, it is clear how the most unfortunate players who have little time to play risk literally wasting it without being able to conclude anything just because the map they are on finiti is sparsely populated. ... it's a military secret! Obviously Guild Wars 2 remains a very ~social~ game, otherwise it would have been called Solo Wars 2 and ArenaNet would have developed it differently; the guilds continue to have a certain importance in terms of synergies and content, thanks also to the new Guild Halls that can be unlocked and customized in the Maguuma jungle, but which unfortunately represent a truly prohibitive and unattainable goal for less substantial communities. This does not mean that Heart of Thorns, in terms of activities and wide-ranging content, leaves something to be desired. Beyond the features announced and not yet implemented, this first expansion does not add any new dungeons or Fractal and, in terms of itemization, ArenaNet has remained faithful to the limited vertical progression offered by the exotic and ascending qualities of the equipment. This means that if you were wearing Exotic or Ascendant armor before Heart of Thorns came out, you will most likely never change your equipment, unless you decide to lean towards different combinations of stats: each new blue or green weapon will end up in the hands of the characters non-players or decommissioning kits in exchange for a few silver coins or a handful of materials. In any case, the new items introduced with the expansion for old players will have mainly aesthetic value and will serve more than anything else to expand the increasingly vast wardrobe of the game. The most demanding players, for their part, will prefer to try their hand at the very first raids that ArenaNet has implemented with an update after the release of Heart of Thorns, but even in this case we are talking about ascendant equipment with a unique aspect in terms of loot, and therefore nothing really new, even if the progression in the new raids is fundamental in the climb towards the acquisition of the unpublished legendary armor: anyone who has tried to make a legendary weapon in the past will already know that a very long and demanding process awaits him which could take months and months of play. In short, from this point of view, Heart of Thorns is an expansion faithful to the original spirit of Guild Wars 2, in which long-term goals are the real endgame which, at least in theory, should keep players glued. It is evident, however, that this time ArenaNet has focused almost entirely on the PvE aspect, leaving out a PvP and a WvWvW that have only been kissed by the implementation of some new map or game mode: unfortunately it was not enough to resolve the sort", "date": "2015-11-19", "grade": "7.0"}