{"name": "Una galassia mai cos vicina", "ref": "https://multiplayer.it/recensioni/159203-star-wars-battlefront-una-galassia-mai-cosi-vicina.html", "text": "We are on Tatooine, in the heart of the Dune Sea. A puff of smoke billows from the muzzle of our rifle, as we stand petrified, staring at the bounty hunter in Mandalorian armor before us. Making his way through the remains of the Imperial soldiers we just eliminated, Boba Fett takes off with his jetpack and advances menacingly in our direction, probably undecided whether to char us with his flamethrower or electrocute us with a blaster shot. He chooses the latter, but when we give up for doomed, his laser shatters against an energy shield created out of nowhere. Behind us, Princess Leia arrived to our rescue together with two rebel guards, saving our skin and putting Fett to flight. It wasn't the only time the Star Wars fan in us felt like a kid again when playing Star Wars: Battlefront. During the event organized by Electronic Arts in Stockholm, we zipped through Beggar's Canyon driving an X-wing, skimmed the huge trees of Endor in a speederbike chase, brought a huge AT-AT to its knees using the harpoon of a snowspeeder, and tasted the power of the dark side as Darth Vader and Emperor Palpatine. And all this only in the short training missions that act as a tutorial for the actual game. We have finally reviewed the new Star Wars: Battlefront, star wars according to DICE It's not a clone war Since the first presentation of the new Star Wars Battlefront to the public, the developers of DICE have repeatedly reaffirmed their desire to create a multiplayer shooter that moves away from the Battlefield series, but above all that gives Star Wars fans the possibility and the tools to give their fantasies and stories set in the Star Wars universe come to life. It is no coincidence that the game's TV commercial shows two children in the midst of their action figures, using flashlights as if they were lightsabers, or transforming their bicycles into two improvised starfighters. Still, Star Wars: Battlefront isn't a sandbox, and inevitably comes closer to the Battlefield series than DICE cares to admit. In fact, the vast majority of the modes take up the more classic options of competitive online FPS, however declined within the ~Starwarsian~ imaginary. Blast (Elimination) is a typical ten-on-ten team deathmatch, where the first team to 100 points takes home the match. In this mode, as in others, it is essential to choose the most suitable equipment for the map using the blasters and Star Cards at your disposal: in a vast and open scenario such as the Jawa Camp, with its open spaces and high points, it might come in handy to use long-range rifles like the T-21, or equip a jetpack to get around quickly, or flee if things go badly wrong. Conversely, the Imperial Station on Endor or the Ice Caves on Hoth are labyrinths made of claustrophobic corridors: in this case it is better to leave the sniper rifle and jetpack at home to arm yourself with a CA-87 shotgun and a stun grenade. Drop Zone (Launch Zone) is instead a variant of King of the Hill, in which the objective of the two teams (each made up of eight players) is to conquer a series of capsules that land, one after the other, in different points on the map. Despite being among the least original options, Drop Zone is also one of the ones that works best: since the point of impact of the capsules is always random, players are encouraged to move continuously, never standing still and trying to communicate with their teammates to better defend (or attack) a particular area. Again, equipped Star Cards can completely change the way you approach a match, revealing unexpectedly deep gameplay: the jetpack allows you to quickly reach a hot area, the thermal detonator clears enemies too close, while the squad shield protects for as long as it takes to capture a pod. Quite similar, but certainly less interesting, are Cargo and Droid Run. The first is neither more nor less a Capture the Flag mode: there are no interesting ideas or particular twists, and the impression is that it has been inserted to number or, simply, because it is a common belief that it cannot be missing in an online shooter. Droid Run is instead the equivalent of Battlefield 4's Domination option: members of each team must move around in an attempt to gain control of all three GNK droids that slowly roam the map. The sense is missingof urgency and excitement which is instead strong in Drop Zone, but the fact that the three targets are not immobile creates more curious situations than those normally seen in the classic Domination: sometimes the droid you are trying to defend decides to move behind a cover or, conversely, in a completely uncovered place, forcing you to adapt and move, waiting for the most opportune moment to intervene and often making life difficult for those who want to ~camp out~ in a corner. The mechanics and rules of Cargo, Droid Run and Drop Zone are finally developed within Supremacy, an option that takes place in much larger maps and which sees the two teams facing each other to take possession of the entire territory , pushing the control points (and therefore the front line) more and more towards the opponent's base. It's an intense and vast experience, which sees the heart of the battle move back and forth throughout the match, but it's still an option that online shooter fans have seen in all sorts of ways in recent years. Luckily, those modes that draw the most from the Star Wars imagination take care of mixing the formula, including heroes, starfighters and huge walkers. Star Card The progression system of Star Wars: Battlefront is largely based on the possibility of unlocking additional weapons and new Star Cards by spending credit accumulated in the game. The latter are nothing more than offensive, defensive or support equipment to be equipped and used during a match. They range from explosives to protective shields, through jetpacks or droids that allow you to see enemies through walls. Each Star Card can be upgraded, and so you are encouraged to play to experiment with new cards and find out how they change your strategy in each mode. Between heroes and starfighters One of the most unique modes in Star Wars: Battlefront is undoubtedly Hero Hunt, where one player takes on the role of the hero while everyone else tries to hunt him down. When a hero is eliminated, the ~hot potato~ passes to the one who dealt him the last blow, and at the end of the match, whoever accumulated the most kills wins. Although the basic mechanics are once again quite derivative (it is essentially Halo's Juggernaut), the skills and powers of each hero make the formula more varied and unpredictable. With their lightsaber and use of the Force, Luke Skywalker and Darth Vader are devastating in close combat; Han Solo and Boba Fett are instead lethal from a distance, while Palpatine and Leia are support characters, able to recover part of the health in critical moments. The hero that is assigned is always random, and this means that the player whose turn it is has to adapt his strategy according to the character that happened to him. Being part of a small group of rebel soldiers desperately trying to eliminate Darth Vader is both a powerful and comical experience, but it is precisely in the hero modes that you notice how DICE has been forced to sacrifice the balance in favor of the fan service and the epicness of the clashes. If the lack of a real balance between the players is already noticeable in Hero Hunt (there are heroes with which it is much more difficult to accumulate kills), it is in Heroes Vs. Villains (Heroes against Villains) that it becomes a big problem. In this mode, the three heroes of the Rebel Alliance face the three of the Imperial faction, but due to the powers of each character, the battles often boil down to specific matchups. Luke is heavily disadvantaged against Palpatine, as (unlike what is seen in the trailer) he cannot block his electric shocks, but equally the emperor has no weapon capable of hitting Boba Fett and Han Solo from range. For this reason, regardless of each player's skill, the outcome of a fight depends heavily on which heroes are face to face at any given moment, and things are likely to only get worse with the arrival of additional characters who will be introduced through future DLCs. Although things seem to have improved slightly compared to the recent beta, some balancing problems also remain in Walker Assault, the now seen and revised asymmetric mode in which the rebel faction must stop the advance of the imperial AT-ATs. As in Supremacy, the possibility of entering the field as a hero does not clearly affect the outcome of a match, but in this case it is undeniable that the Rebels are the ones who sweat the most for victory, engaged in a mammoth job of multitasking which includes activating beacons, fImperial anti-war and bombing AT-ATs before they reach their destination. The last mode is the most atypical, but probably also one of the most successful: Fighter Squadron (Squadrone di Caccia) takes the battle to the skies, seeing two teams face off driving rebel and imperial fighters. Flying an X-wing around Jabba's palace and flying over Echo Base on Hoth immediately brings to mind the best moments of Rogue Squadron; you get carried away, and in an instant you find yourself chasing enemy ships dangerously skimming the surface, or performing evasive maneuvers to free yourself from the homing missiles. Season Wars At the time of writing, Electronic Arts has confirmed the content that will arrive with the four DLCs foreseen in the Battlefront Season Pass (besides the one called ~The Battle of Jakku~, which will be free and will link the events of the Old Trilogy to The Force Awakens) . There is talk of four new heroes not yet announced, but above all of four additional game modes and sixteen new multiplayer maps. We're willing to bet that the Death Star and Cloud City will be among the new locations, representing too much content for diehard Star Wars fans. Playstation 4 trophies Star Wars: Battlefront seemed like a relatively easy game to platinum. Trophies are mostly tied to actions you take in multiplayer modes (reach Rank 50, test all heroes, or take out 10 starfighters), so it tends to be a matter of time before most of them are unlocked. There is a bit to sweat on the other hand in the single-player modes, having to complete them at different difficulty levels and completing small objectives. Search within yourself If Star Wars: Battlefront had been any shooter, the different balances mentioned above and the unpredictability given by the Star Card system would have been enough to annoy an online FPS devourer. But the truth is that Battlefront is not just any shooter, and its target audience is not that of Battlefield or Call of Duty. DICE is a title for Star Wars fans, a love letter to the Old Trilogy, the most faithful graphic reproduction that the Lucasfilm franchise has ever had in a video game. From blaster burns littering the armor of Imperial stormtroopers to the spectacular explosions, Star Wars: Battlefront is a feast for the eyes. Of course, with Frostbite 3 the developers had to accept some compromises (especially on consoles), but the evident pop-in of the textures is contrasted with 3D models that are practically indistinguishable from the original counterparts; the limited environmental destructiveness is overshadowed by a dense and heavily overgrown forest of Endor. And then, if you pay close attention, you see groups of Banthas against the backdrop of Tatooine, Corellian corvettes escorting star cruisers, ion cannons firing at giant Star Destroyers, and mischievous Ewoks throwing rocks at nearby soldiers. There are many small details that can be overlooked, especially in the chaos of a battle, but which contribute to making each setting more authentic and believable, giving the Star Wars fan the feeling of being in lived-in places where he would like to have his adventures. All this while the historic music of John Williams is pressing in the background, supplemented by the work (sometimes successful, sometimes less) of the composers of DICE. But even if in some cases the transition from an original track to one created ad-hoc is noticeable, the goals achieved by the sound designers are remarkable. Ben Burtt's sound effects are magnified, and you can't help but feel a shiver down your spine listening to the metal whine of an AT-AT or the debris of a recently destroyed fighter strike the canopy of our X-wing. The new Battlefront, it should be clear, is in short one of the most engaging and spectacular experiences for a Star Wars fan, but the more than thirteen hours spent at the Stockholm review event have reinforced one of the fears that have emerged in recent months. The developers have tried to mitigate the lack of a true single player campaign with a series of missions to be played alone or in the company of a friend. Yet neither the battles (equivalent to Call of Duty's Kill Confirmed option), nor the Survival mode (a classic Horde in waves) seemed to us a particularly stimulating alternative for those who want to disconnect for a while and play solo . The Star Card system, the purchasable blasters, the faces to unlock and a small diorama designed for the ~completists~ give a minimum sense of progression to the game, but each of the", "date": "2015-11-17", "grade": "8.5"}