{"name": "Super Smash Boys", "ref": "https://multiplayer.it/recensioni/159134-super-boys-the-big-fight-super-smash-boys.html", "text": "Super Boys - The Big Fight starts from a very interesting idea, that of taking a nice handful of funny and weird characters, distorted versions of celebrities like Super Mario and the Transformers, jedi and superheroes, as well as a nice crossover with the biting strips of Cyanide & Happyness, and put them to battle in a brawler structurally very similar to Super Smash Bros., with multi-level arenas and both single and online multiplayer game modes, for up to eight participants. The system, in itself rather suggestive, is supported by graphics that are not faultless in terms of style and cleanliness, but capable in any case of doing justice to the concepts put in place and accompanied by a good mix of engaging music. All downloadable for free on the App Store and Google Play, according to the criteria of a freemium model that uses the traditional energy of action for each ~continue~, but which is practically never binding and therefore allows you to try your hand at the long singles tournament player or multiplayer battles for quite some time without having to stop. Of course, spending real money can lead to obtaining a greater number of gems and with them buying packs of potentially rare and powerful characters, but these are operations that can also be carried out for free, provided you have a little patience. Super Boys - The Big Fight is a fun Super Smash Bros. style brawler, shame about the controls Super Boys Don't Cry Once a warrior has been drawn by lot from among the over fifty available, to which we can then add a partner controlled by artificial intelligence (or by ourselves, by pressing a simple button on the touch screen), we will be able to try our hand at the single player tournament or, as mentioned, with the online multiplayer mode, in teams or all against all. Let's start from this last possibility, which works fairly well in terms of latency and responsiveness but which, as often happens with mobile titles, cannot count on a large number of available users. As for the single game, our task is to defeat a series of opponents and final bosses to climb a sort of tower made up of over one hundred stages, set within twenty different maps. Also and above all in the scenarios the references to Super Smash Bros. are evident, there is the ring-out which subtracts energy from those who fall off the edges of the level and there are platforms which allow you to implement different strategies, moving from one side to the other. another to intercept opponents or evade their offensive. Our repertoire has a normal attack, a charged launch and three special maneuvers: one is activated by pressing A and B at the same time, another by performing a crescent and pressing A, and finally the super by acting on the appropriate button at the top right of the screen, after loading. Playing as a crude giant inspired by the enemies of Double Dragon, this translates into things like throwing a boulder, a pinwheel a la Haggar from Final Fight and a mighty Zangief-style piledriver, but each warrior has different moves and discover them all that's part of the charm of the game. To dampen the enthusiasm of an otherwise truly remarkable experience there is unfortunately a cumbersome and imprecise control system, in particular due to the virtual stick, equipped with an unnecessarily long stroke and which at the moment cannot be adjusted in any way. if not in the sensitivity to the inputs. You get used to it, of course, but when the clashes are decided at the last moment it's never fun to end up KO because our character has moved rather than closing in defense, and this is a far from negligible aspect in a production such.", "date": "2015-11-14", "grade": "7.3"}