{"name": "Warhammer 40.000: Tacticus", "ref": "https://multiplayer.it/recensioni/warhammer-40000-tacticus-recensione-strategico-ios-android.html", "text": "The review of Warhammer 40,000: Tacticus projects us once again into the fascinating universe created by Games Workshop, in this case for a turn-based strategic experience designed for iOS and Android devices, therefore characterized by very fast action but not for this completely devoid of depth, on the contrary. In the context of a long campaign, we will in fact find ourselves controlling a team of powerful warriors, led by the head librarian Varro Tigurius and in continuous expansion through the unlocking of characters belonging to the most varied factions: from the Ultramarines to the Death Guard, from the Adepta Sororitas sisterhood to the Necrons, from the Astra Militarium to the Black Legion, and more. Gameplay Warhammer 40,000: Tacticus, a combat sequence As mentioned, the strategic gameplay of Warhammer 40,000: Tacticus has been designed specifically for mobile devices. The missions therefore take place very quickly (so much so that one of the objectives to be achieved in order to multiply the rewards is often to complete them within four rounds), within a small grid that forms the backdrop for a single direct confrontation. 'simplified approach, the experience has a minimum thickness which manifests itself in the characteristics of the various characters, in the special abilities available to each of them, in the differentiation between the boxes in terms of terrain and height, with the relative bonuses and penalties, and in the inevitable upgrades that are obtained by deploying units in a certain way. The touch controls reflect the immediacy of the approach thanks to a clear and easy to read interface, which uses the view in portrait mode, therefore with the device vertically, to allow us to control everything with just one finger. After all, just touch one of the members of the team and his possible objective to start the basic attack, or a box to order a simple move, and so on. In the case of Tacticus, however, the fun goes beyond the confines of individual battles and creeps into the management mechanics between one mission and another, given the exciting way in which the developers have rendered the traditional ~unpacking~ of the crates on the screen prize, the unlocking of new warriors and the huge amount of items that can be obtained to improve individual units and possibly promote them to a higher rank. Structure Warhammer 40,000: Tacticus, one of many unlockable characters If the quick fights of Warhammer 40,000: Tacticus are immediate and fun, regulated by an action energy that is however difficult to consume except in the context of fairly long game sessions, it is the very rich structure of the Snowprint title that makes the difference, thanks to its extraordinary abundance. obtaining extra resources and more. Exploring every single module will keep us busy for a really long time and add a bit of variety to the experience. Technical realization Warhammer 40,000: Tacticus, our units prepare to move It happens that even the best strategic systems are accompanied by graphics that are not up to par, especially when the characters are seen from above, but in the case of Warhammer 40,000: Tacticus the developers have shrewdly chosen to use a three-quarter view, enriching the visual sector of particularly fluid animations and excellent effects, so as to enhance what is happening on the screen. The sound accompaniment, made up of music, voices and sounds, immediately proves to be spot on with respect to the setting and atmospheres of Warhammer 40,000, naturally with the sentences of the various characters to play a central role and to reiterate the well-known character of this narrative universe.", "date": "2022-09-26", "grade": "8.2"}