{"name": "Una vittoria scontata", "ref": "https://multiplayer.it/recensioni/158935-football-manager-2016-una-vittoria-scontata.html", "text": "Insigne takes the ball in midfield, dribbles past two men and throws it on the edge of the area to Higuain, who executes a perfect control before extending it to Gabbiadini, who in turn fires a shot at the seven arriving on the run. It's minute number 27 of the Football Manager 2016 championship premiere, and the roar of the exultation of those in front of the monitor is heard throughout the neighborhood. What better way to start talking about Football Manager 2016 than by telling just one of the many emotions that this series has been transmitting for over twenty years to all football fans? Not surprisingly, those dodgy Sports Interactive have launched the We Are The Managers campaign in recent weeks, in which more and less famous characters have told their experience with the game. But we have gone too far in sentimentality and it is better to move on, because as always there are many things to say. Football Manager 2016 is a threat to the productivity of all football fans! Bugs for everyone Before proceeding, a service communication: keeping with the tradition of recent years, the Football Manager 2016 code provided to us for review is the same as the Beta downloaded by all players who have pre-ordered the full version. On the evening of November 10th, the Release Candidate version was put online, tested for a few hours before starting the final draft of the review. All this to tell you that the final edition available from November 13th may still be different in some detail than the description of Football Manager 2016 that we make in this article, especially in terms of bugfixes. Fantasy football 2.0 So from memory, we have to say that for the first time since the Football Manager series exists, among the game modes most awaited by fans there is one not linked to the classic managerial one. We are talking about the Draft introduced this year by Miles Jacobson and his team, thanks to which players can create a tournament completely separate from the simulation of real football. A sort of fantasy football without geopolitical limits, in which you can count on the huge Football Manager 2016 database to create your own team. After providing the name and other details on your invented club, the actual draft phase begins, proceeding in a snake between the teams introduced to allow each of the participants to choose a player, until the whole squad is composed. At this point the chosen competition begins, facing the friends who participate in the game: this opens up a more than tempting opportunity for those who have played Football Manager in multiplayer for years in the only possible way. In terms of actual play, the Draft mode has more or less the same components as the main one, allowing for example to manage training but eliminating the component dedicated to the transfer market. Even if we dedicated most of the time spent on the review to the classic mode, curiosity led us to take a test ride in Draft: the overall adaptation seems quite good, even if it needs to be refined both in the management of the initial phase , a bit too cumbersome overall, both in its optimization. Clicking around the menus, it even happened that the game returned to the desktop after a disastrous crash. Let's stay on the theme of modes, to remember that the ~reduced~ one seen in the last few chapters returns to Football Manager 2016, renamed for the occasion Football Manager Touch: the most appealing feature, in this case, is the ability to share saves with the Android and iOS tablet version of Touch, keeping the game going on the go. On the PC side, in addition to being incorporated into the full game, Football Manager Touch will also arrive later in a separate version, with a price that should be around 20 euros. For this reason we will not dwell further, perhaps taking advantage of the release for a more in-depth analysis. For the moment, it is enough to know that Sports Interactive has integrated some of the novelties of the main mode, such as data processing with Prozone, in addition to the inevitable series of improvements in the interface designed to be immediate to use even on mobile, embracing the simplification philosophy behind Football Manager Touch. Before going further, scrolling through the list of game opportunities we find the new Create a Club, thanks to which you can insert a team created from scratch in a real competition, composing the squad with players from all over the place and others created from nothing: too bad that the editor is only half an editor, since the club ~inherits~ some characteristics (such as the staff) from quechosen for replacement. Finally, there are the usual Challenges. Career coaches Beyond the rich contour inserted in Football Manager 2016, the main dish continues to always be the classic Career mode. Among the first novelties, this year we find a further step to define the identity of the player-manager within the game: it is the character editor, with which you can give your virtual alter ego a face and a body. The tool is similar to what we would expect to see in an RPG, but limited to a small number of features that allow you to change its look; even if it is the first experiment in this sense, perhaps a little more could have been done. The other available parameters allow you to specify some preferences from a general tactical point of view, to then move on to the screen where you can assign the points between the two branches ~Coach in overalls~ and ~Coach in jacket~, already seen last year. After the restyling operated in Football Manager 2015, the new chapter appears quite familiar in the interface, which also this year relies on the vertical menu on the left as the main hub. Browsing through the various sections, one gradually becomes aware of the other additions made by Sports Interactive: in particular, the screen dedicated to the overview of the staff is useful, from which one can obtain an overall evaluation of the managerial staff of one's company, together with in comparison with that of the other teams. Relevant changes also in the tactics editor, where the position of the players on the field is no longer represented by their shirts, but by a square in which various information is summarized, including the type of role played and the ability to satisfy requests of the coach in that position. The team instructions now have a large window, designed by the developers to be more intuitive also thanks to some graphic elements that represent the various suggestions to give to the team when they take the field: to do this, we find an entire package of data at our disposal on the last matches to sift through, thanks to the aforementioned collaboration with Prozone. Let's complete the view on tactics with the set pieces editor, where you can indulge yourself in the creation of schemes on corner kicks and free kicks, taking care of the defensive phase if you want: it is clear the intention of Sports Interactive to give players a dimension in which to get lost while playing Football Manager 2016, also exploring the less ~playful~ components of the coaching job. I have nothing to say Jos Mourinho hasn't been doing so well lately, but listening to the words he spoke during an interview dating back to the beginning of the month, it almost seems that the Chelsea manager has played Football Manager 2016. You may have understood that we are alluding to interaction with the media, for which the developers had promised greater dynamism and variety in exchanges. No doubt the situations proposed are now a little more varied, but the novelty effect does not last long: the need for the entire section to be redesigned appears increasingly pressing, even starting from scratch if necessary. At present, it is only a matter of time before the player gets to press the fateful ~Send the deputy~ button, after being harassed to boredom by the usual queue of questions to be answered by choosing the tone between the usual ~calm~, ~assertive~, and so on: a real cross. A more or less similar discourse is applicable to the interaction with the team, a clear sign of the way in which this question and answer mode has aged rather badly and has never managed to convince. But let's jump back to the beginning of the game (by the way, now you can choose to start the season from a certain moment between July and August) which allows us to immediately test the market phase, historically among the most discussed on online forums: in this case, there are lights and shadows. From the point of view of dynamism, in Football Manager 2016 things seem to have changed, allowing the player to create a lively market both in terms of entry and exit, provided he remains grounded in his goals. The real problem, at present, concerns the over-inflated evaluations of the players: at the helm of Napoli, by selling Zuniga and David Lopez we have collected almost 30 million. However, it must be said that the meter of abundance followed by the odds is quite uniform, but to safeguard realism we sincerely hope that Sports Interactive will remedy it in the final version of the game. Another fault related to meThe market is represented by the fickleness of the members of our squad, too often eager to leave as soon as an offer arrives from another club, not necessarily one of the biggest in Europe: we know that in modern football there are no more flags, but seeing Higuain, David Lopez and Jorginho complain at the start of the game about a rejected offer isn't the best of life, especially if you don't want to make revolutions on the list of players that make up the team. The complaints of the players then continue even during the season, with those excluded from the turnover almost constantly engaged in communicating all their unhappiness with the benches (or stands) of the last few days. Injuries cannot be missing from the list of hot potatoes for every Football Manager who arrives on the market: for the occasion, Miles Jacobson and his team have introduced a new management method, more similar to what happens in the treatment of ailments in the real world. The players are now examined several times during the recovery process, up to the fateful final visit in which the team doctor offers his opinion on returning to the field. At that point it is up to the coach to decide whether or not to risk the player, relying on the form and perhaps even on the determination of the individual person. This of course doesn't mean that there aren't injuries, so if you think there are too many in Football Manager then this won't be a chance to change your mind. Kick-off The interventions of Sports Interactive have not ignored the 3D engine of Football Manager 2016, the subject of some criticism a year ago due to an artificial intelligence that is not quite at the top. The games we played over an entire season have left us with the feeling of an overall improvement in the behavior of the players on the pitch, also thanks to a series of new animations that help make them look less awkward: we are still a long way from a complete fluidity, but the jump is appreciable. In graphic terms, the addition of a bar on the players' heads is more than welcome, to indicate the level of fatigue gained during the match, thus allowing constant monitoring in view of a substitution. Speaking of graphic frills, the 3D model of the coach created at the beginning of his career with the editor appears in the external technical area of the pitch, ready to wave to give directions to his team: it is obviously a pure aesthetic addition, given that the ~screams from the sidelines~ had already been around for some time. Some doubts continue to concern the latter, especially in terms of effectiveness to see the eleven in the green rectangle interpret our words properly. Results, posts and cards seemed pretty normal to us, even if after buying Fernando from Manchester City we had to see him sent off for three games in a row: fortunately it was an isolated case, but one that should be reported anyway. For the rest, there is a good variety in the actions and in the development of the game, where more realistic situations now appear: if you wish, you can also appreciate it through the synthesis tool introduced by Football Manager 2016, thanks to which you can access the highlights of the Sunday 90th minute style.", "date": "2015-11-11", "grade": "8.7"}