{"name": "Nuovi contenuti", "ref": "https://multiplayer.it/recensioni/158845-batman-arkham-knight-pacchetto-sfida-combattente-del-crimine-n-2-sfida-combattente-del-crimine-n2-e-n3.html", "text": "The batch of DLC for Batman: Arkham Knight continues, which Warner Bros. Interactive now releases on the market on a regular basis. In this review we will focus our attention on the Crime Fighter Challenge n.2 and Crime Fighter Challenge n.3 packs which, like the previous additional content with the same title, are positioned in an ideal ranking of users' personal tastes, in the middle road between a decent add-on and an unnecessary product. Apart from an option that we will discuss in more detail later, in fact, in purely content terms, both products offer only a series of clashes outside the main campaign. In detail we have in each DLC six new AR challenges for the Dark Knight and his friends, but nothing more. In Crime Fighter Challenge n.2, available on Steam, PlayStation Network and Xbox LIVE for free for holders of the season pass, and at a price of  1.99 for all the others, the challenges are focused three on fighting training non-stop and two to predator-style stealth raids. But let's proceed in order. Six new AR Challenges for each of the two new Batman: Arkham Knight Crime Fighter Challenge DLCs Go-go action Perhaps the most interesting element of this new package dedicated to Batman: Arkham Knight is the option that grants players the possibility to freely select the characters to be used in each single challenge, except for those of the couple. In practice, when deciding which AR starring a single character to face, you can choose a different hero from the one originally designated for the mission. So space for the various Red Hood, Harley Quinn, Azrael, Catwoman, Batman, Robin and Nightwing even where they weren't expected. Analyzing instead the offer in terms of bare gameplay, by accessing the appropriate RA screen, as mentioned in the introduction, six tests can be selected. The first available challenge is entitled ~Flying Grayson~, with Nightwing having to contend with a large group of opponents ready to do anything to make him skin. The one starring the paladin of Bldhaven is the usual fight to the death where waves of increasingly better equipped criminals oppose each other between the hero and obtaining the best possible score, in a scenario where consequently it becomes crucial to be able to make the most of the gadgets available together with the attacks and combos with bare hands. We must operate in the same way in ~Furia Felina~, this time however in the role of the sensual and agile Catwoman, and in ~High Interest~, where we have Batman who is on the roofs of the Kingston bank. Showing off all his skills in freeflow combat, the Caped Crusader must alternate the weapons available with his hand-to-hand techniques to resist the attacks of his opponents until the time runs out and thus obtain a score that statistically also takes into account enemies eliminated. As regards the challenges of a more strategic nature, within the offer we have the one called ~In the air~ with a wild Robin as the protagonist. The latter finds himself having to face the Militia patrolling Stagg's airship, to be eliminated mercilessly in the shortest amount of time possible. To do this he must act quickly and silently, but at the same time lethal. The scenario is similar to the one that was set in the Metrovision construction site in the first Crime Fighter Challenge package: here too, the conformation of the area pushes the user to act mainly from above, so as to optimize movements and ambushes to try to scrape together as many points as possible by taking out the enemies on guard. The Boy Wonder also returns in ~Uncontainable~, the other Predator challenge, where alongside the Dark Knight he must always get rid of the men of the Militia, also here in the shortest possible time to get the best score. By coordinating both heroes in this challenge, the gamer's ability to manage the situation becomes decisive, alternating the predatory skills of the dynamic duo. Especially taking into account that to have a good result it is also necessary to satisfy some requests, such as that of trapping an enemy in a room through the Bat Man, within which he must then be eliminated by Robin, or killing half of the contenders first with one character and then with the other. The last challenge proposed by the DLC is ~Armored Assault~, and is dedicated to the Batmobile, aboard which you have to speed through the streets of Gotham eliminating all the drones that in the meantime will place themselves in front of the car. By completing the route within 1:55 you will get the three stars, while for every second saved under this thresholdtime you will have a +1 bonus in terms of score in the general classification. Crime Fighter Challenge #3 Moving on to analyze the other DLC, also available on Steam, PlayStation Network and Xbox LIVE for free for holders of the season pass, and at a price of 1.99 for all the others, we have six AR challenges in detail, at start with the one entitled ~Guardians~. In it Nightwing and Batman have to contend with a large group of enemies on the rooftops of Panessa Studios. It's the typical battle where the enemies arrive in waves that are increasingly equipped and resistant to blows, and where the combination of attacks, gadgets and pair combos are decisive for getting rid of the opponents, gaining precious seconds and a better score. In the ~Central~ simulation, however, it is Robin who finds himself engaged, alone, outside the prison of the Gotham City police station. This training is also focused on freeflow combat and on the timing to get the 20.00 points needed in this case to earn the coveted three stars. With ~Chemical Reaction~ the scenario changes and the battle becomes more ~tactical~. The action takes place at the ACE Chemicals mixer, and the mission consists in eliminating the enemies on guard in the shortest possible time, trying not to be discovered by them and avoiding that they place turrets and anything else that could complicate the success of the enterprise. Batman and Nightwing participate in the latter as a couple, which must be alternated or made to act in combined action, but always in the shadows. To make things a little more difficult, there are also requirements to be met to further increase the final score, such as for example killing five enemies in five seconds, or eliminating the militiamen without ever using the detective mode. Vertigo As for the other challenges of a more ~strategic~ nature, we then have the one called ~Vertigo~ starring a wild Robin. The latter finds himself having to face the Militia in the financial district of Gotham City, and to do so he must act quickly. The scenario is quite interesting, if only because it provides a certain verticality in the action, in addition to the primary need to quickly get rid of the medical soldiers and what creates interference preventing the gamer from using the Robin's detective skills. Most interesting of all, however, is, in our opinion, ~Stage Fright~, which takes up the theme of haunted houses and terror. In fact, fear is the central theme of this scenario set on the Panessa Studios horror set: the player must in fact unleash this state of mind in the militiamen in such a way as to be able to then attack them with Terror KOs and get rid of them as quickly as possible. Nightwing's goal (or whoever you want, given that the option to be able to select other characters in single hero AR missions was introduced with the previous package) is therefore to act quickly by focusing on quick and painless, even if it is not easy. The playing area is fairly large, the opponents have a jammer who creates many problems by preventing the use of detective skills, and there is also a doctor who is ready to immediately treat downed companions. Here too there are particular conditions that serve to increase the final mark of the game session, such as the ability to perform a double Terror KO at a distance of sixty seconds from each other, or three Silent KOs from as many grates placed on the ground. The final mission in the pack, ~PT Cauldron's Runway,~ is a thrilling Batmobile race from Founders Island to Bleake Island, ideally completed in under one minute and fifteen seconds. Ultimately, as well as for the predecessor, the Crime Fighter Challenge n.2 and Crime Fighter Challenge n.3 packages are difficult to judge or recommend to all gamers without distinction. For die-hard Batman fans and those who love to spend countless hours trying to break records and pass certain tests, both could be appealing. For all the others, six AR challenges for DLC for  1.99 each, which among other things largely reproduce situations already seen and played in the main campaign or in other challenges, could be a small thing to be considered worthy of attention. Thus, as in the review of the previous DLC, for those who do not have the season pass, our advice is to buy the individual packages only if you really want to collect everything in the world of Batman: Arkham Knight or you want to have new, sensible ideas for go back even if for a few minutes. If not, you can just leave it aloneNone", "date": "2015-11-10", "grade": null}