{"name": "Black", "ref": "https://multiplayer.it/recensioni/black.html", "text": "Evidently at Criterion they wanted a change. After spending the last 5 years focusing on the Burnout series, with the real risk of saturating the successful franchise due to an excessive amount of close-range sequels, the British team has decided to move on to a completely different genre; temporarily storing the cars in the garage and shouldering sniper rifles and weapons of all kinds on the contrary, he has in fact chosen to enter the inflated genre of first-person shooters. With what results? A lot of smoke and little roast Unfortunately, it is sufficient to delve further into the Criterion effort, thus overcoming the spectacular and exciting approach, to find yourself faced with a series of defects and imperfections that compromise its goodness and overall evaluation, distancing it from the great exponents of the genre. The artificial intelligence of men controlled by the CPU is nothing short of laughable; the opposing soldiers, lacking organizational or tactical skills, in fact limit themselves to shooting the protagonist, occasionally making ridiculous escapes in the clumsy attempt to shelter from the bullets. Often one gets the impression that the enemies are blind or deaf; in fact, it is not uncommon to witness truly implausible scenes, to put it mildly, in which after having got the better of a soldier, one discovers that a couple of meters away is a companion of his, absolutely uninterested in the matter. The effect that the weapons have on the opponents is also very disappointing, almost impassive in the face of blows until the moment of capitulation. Of course, things change with rocket launchers or shotguns, but the projectiles in these cases are much more limited, making their use possible only in rare cases. The possibility of carrying only two weapons also overshadows the use of the ~less useful~ ones, which are obviously the most spectacular ones. The stylistic choice of blurring the view during the reload phases is intriguing, which introduces a minimum of planning in the attacks on the opponents. The level design, with some exceptions, is generally rather flat and uninspired; we simply find ourselves proceeding with our heads down, without particular emotions. The presence of secondary objectives does not help much in this sense, since the latter are in the vast majority of cases simply objects scattered within the settings, to be collected or destroyed. On the other hand, the variety of settings is good, all quite different from each other and always aesthetically valid. However, the flatness of the gaming experience manifests itself rather quickly, making progress in the game uninspiring and rewarding. The 8 levels that make up the EA production are relatively short, thus constituting a decidedly limited overall longevity; in fact, experts of the genre shouldn't take more than 6 hours to get to the end credits on the normal difficulty level. Regrettable the choice of trying to forcibly increase the duration of the game through the use of very few checkpoints, extremely distant from each other, which force in case of death to repeat even 15 minutes of a level with the player's great frustration. To this must be added the total absence of any multiplayer mode, both offline and online; Black was in fact conceived as a single-player adventure, and it wanted to stay that way. Comment Black is a product that highlights Criterion's inexperience in the Fps genre. Although full of good ideas and supported by a respectable graphic component, the Electronic Arts production suffers from a series of far from marginal defects, above all a truly modest artificial intelligence and a level design that is simply too linear. The lack of multiplayer and the very low longevity close the circle on a product that is so promising in anticipation of a sequel, but which needs a lot of work before being able to earn a place among the best exponents of the genre. Pros Great graphics and sound Very spectacular Immediate Cons Terrible artificial intelligence Flat level design Short longevity Fade to Black The writer does not hide that he has been among the most interested in the development of Black over the last 10 months, or since we had the pleasure, at the last E3 in Los Angeles, of attending the closed-door presentation of the game in question. At the time, a visibly enthusiastic Alex Ward (Criterion leader) described the first level of his product as a team member traversed in real time, pad in hand, through a city in full guerrilla warfare filled with wrecked cars, rubble and enemies armed to the teeth. The goodness of the graphics engine and the ehigh interactivity of the settings were undoubtedly the main points that allowed several of the journalists present to mark Black's name in their notebooks. Today that promising and ambitious project is available on the market, in PS2 and Xbox versions. What appears from the first moments of the game is the distinctly action address wanted by the programmers; the Electronic Arts production does not offer particular tactical or strategic cues, preferring on the contrary an immediate, spectacular and ~fracassone~ approach. The story that forms the background to the events is unfortunately extremely banal and narrated through full motion videos played by real-life actors, this rather retro choice. The game puts you in the role of a certain Keller, a Rambo-model special soldier, engaged in an interrogation with a government agent. The conversation is not particularly friendly, and mainly focuses on Keller's mission, which has just ended and which took place in the previous 4 days. The goal was to vanquish a gang of terrorist arms traffickers, together with their boss Lennox. Nothing particularly intriguing or original therefore, and if we add to this that the aforementioned interlude scenes (not skippable) are often and willingly even soporific, it is immediately clear how Black certainly does not find his strong point in the plot. Fortunately, the first approach to the actual game is of a completely different kind; aware that the initial impression is essential to capture the player's attention, the programmers of Criterion have created an exciting first level, which unceremoniously shows off the best aspects that the EA production can boast. We are referring to a first-rate graphic component, a splendid expression of a now complete knowledge of the hardware. Both on Xbox and on Ps2 Black is in fact a very, very nice game to see; with the exception of some slightly washed out and poorly defined textures, it is in fact difficult to move notes from a technical point of view. In fact, the engine manages to easily manage a huge number of polygons, with decidedly complex structures that appear in front of the player's eyes. All seasoned with many explosions, which represent the true hallmark of the title in question; the quantity of explosive elements scattered within the settings is in fact considerable (sometimes even too much to be credible), and the reproduction of the explosions is nothing short of exciting. Obviously the latter can, indeed must be used to the advantage of the player to eliminate as many enemies as possible in one fell swoop. The high interactivity with the environments is also extremely intriguing, which allows you to demolish illuminated signs, signs, but also even tear down colonnades and make a breach through masonry walls and so on. The sound component is also very good, both in terms of effects and music.", "date": "2006-03-09", "grade": null}