{"name": "Facciamo un giro", "ref": "https://multiplayer.it/recensioni/158827-beneath-the-lighthouse-facciamo-un-giro.html", "text": "We often found ourselves talking about Nitrome on these pages, and the reason is obvious: it is one of the most interesting teams on the mobile gaming scene, capable of creating extremely original and fun titles offered through one of the most honest freemium models absolutely. Like most of the games made so far by the London software house, Beneath the Lighthouse was also initially born as a flash title on the company's portal: in this case, however, the original - entitled Roly Poly - is even dated 2006, and it was a game characterized by a decidedly different graphic style. However, the formula is evidently the same, with very intriguing mechanics that adapt perfectly to touch screens. Beneath the Lighthouse is a clever, challenging puzzle game based on a very honest freemium model The lighthouse The plot, actually rather useless, tells of a spherical (?) boy looking for his grandfather. To reach it, however, it will be necessary to face about forty levels set under a lighthouse, hence the title. Beneath the Lighthouse is a puzzle game that takes place within circular areas that rotate on themselves to allow the protagonist to move through them, so as to reach the exit and then move on to the next ~room~. Obviously the task is not as easy as it seems in words, since the path is always dotted with traps and dangers to avoid in order to save the three precious lives you have available. Often and willingly then we find ourselves having to worry not only about the movements of the protagonist, but also about those of other elements of the level that suffer the force of gravity. In all of this there are two fundamental elements that determine the success of Nitrome's effort: the first is the control system, which fortunately and due to the common sense of the developers does not go through accelerometers and improbable rotations of your device. On the contrary, much more simply you have to use your index finger and act on the screen by moving the mechanism clockwise or counterclockwise. Nothing could be simpler then, and above all with a level of precision that is essential to comply with the formula studied by the programmers without adding further unwanted frustration. The second fundamental aspect is instead the puzzle design, which, despite the limits imposed by a basic mechanic that is always the same, manages to guarantee an absolutely remarkable variety of situations and puzzles. If the first levels are in fact almost a walk, it doesn't take long to reach a point where the gray matter and reflexes are put to the test, although it is necessary to underline how the challenge is calibrated in such a way as to almost always appear within the limits , in such a way as not to lead to frustration. The possibility of obtaining trophies (bronze, silver, gold) based on the time taken to complete the rooms also offers a further element of stimulus for the more experienced. We were talking about the particularly honest freemium system: in practice, the game can be downloaded for free and all its contents can be accessed without spending a cent. By accepting the  3.99 in-app purchase instead, you can remove the ads - indeed very frequent - and get infinite lives, so you don't have to start the group of levels again as happens in the free version when they get lost the 3 available. Beneath the Lighthouse is therefore a fun game, which also knows how to be appreciated for its aesthetic component: as per Nitrome tradition, pixel art has also been adopted in this case, however, with a rather distinctive style and able to guarantee a certain personality to the product . The audio component is also excellent.", "date": "2015-11-09", "grade": "8.5"}