{"name": "XIII Remake", "ref": "https://multiplayer.it/recensioni/xiii-remake-recensione-ps5-switch.html", "text": "History teaches that remakes of old video games can come both good and bad. XIII Remake had turned out badly, indeed very badly: perhaps you will remember a little all the controversy relating to its publication, which took place in 2020 on PlayStation 4, Xbox One and PC. In summary, it was a real disaster, between graphic glitches, interpenetrations, original dubbing recovered without any synchronization with the characters, and much more. Microids apologized and also promised that he would make it right. Time seems to have tried his bona fides. At the time of writing, XIII Remake tries again, returning to the market in what we could define as ~the remaster of the remake~. Basically almost every aspect has been revised, but not by the first development team, PlayMagic, replaced instead by the guys from the French studio Tower Five. It goes without saying that 2020 buyers will simply be able to download a magical update completely free of charge, to benefit from the necessary improvements, as well as a completely new online multiplayer game mode. The following is our review of XIII Remake, updated to the new makeover available from September 13, 2022. We took up arms on PlayStation 5, in a frenetic campaign in search of our memory and a very dangerous criminal organization. XIII Remake on PlayStation 5: practically a new game XIII Remake, today as then, is visually very pleasant Compared to the 2020 release, XIII Remake on PlayStation 5 is practically a new game. It is always the same title that was quite successful in the now distant 2003 on PlayStation 2, GameCube and PC, but updated - from a graphic and technical point of view - to 2022. This time, fortunately, in a more than satisfactory way. All the main and invasive glitches have been resolved: think for example of the blonde lifeguard who rescues XIII in the very first minutes of the game, whose eyes in 2020 rolled freely in a very grotesque way; or to insignificant objects that hindered the path of the protagonist; and again to the disastrous recovery of the dubbing, badly synchronized with the non-player characters. Fortunately, all this is a distant memory. Furthermore, the PlayStation 5 version of XIII Remake introduces 60 FPS, which is instead excluded on all the remaining consoles. Finally, the edition does justice to the ancestor of the early 2000s, with high definition capable of enhancing an artistic direction that draws heavily on the world of comics (there are numerous balloons and onomatopoeias, and not only during the films ) seeking an entirely personal style in the broader context of the cel-shading technique. Of course, not everything is perfect: by alternating the difficulty levels a bit, it seemed to us that the artificial intelligence was too aggressive in ~easy~ mode and a little too numb, however, in ~difficult~. Overall though, the level of challenge still makes more sense than it did two years ago. It would still be possible to intervene on small secondary graphic glitches, especially in closed environments, but we are sure that Tower Five will return to the issue in the near future. A discussion in itself deserves the introduction of the online multiplayer mode. On the one hand, everything that is introduced for free can only be appreciated by the players; on the other XIII Remake was probably one of the few first-person shooters that didn't need it. The whole experience is in fact based on a plot strictly designed to be enjoyed alone: the multiplayer sector is nothing but a mere filler, probably proposed to justify even the two years of work necessary to recover credibility on the entire operation. In itself it does what it has to do, but finding other players is not easy, nor does the mode try to achieve any original or captivating ideas. Gameplay still valid XIII Remake offers a good number of firearms ... and more XIII Remake sports, as of September 13, 2022 (and beyond), still valid gameplay. The restoration operation from this point of view made sense: in 2003 the title convinced thanks to a well-balanced mix between a satisfying game system and a perfectly cared for glance. Now that all the technical issues have been resolved, the same can be said of the remake. Use of cel shading aside, which you may or may not like, the production does everything to enchant the newcomer, from the very first moments. Part of the credit certainly goes to the plot: Agent XIII wakes up with no memory, in America shocked by the assassination of President Sheridan. Gradually the man discovers that he has been trained to survive all sorts of combat, and that he knows how to use very effectivelyicace and ~creative~ weapons and items available. It's up to you to discover all the secrets related to a mysterious military organization and to the same role played by XIII in the assassination of Sheridan. The plot of XIII will most likely keep you glued to the screen Returning to the gameplay, the latter is based on overcoming a series of linear levels (XIII Remake is not an open world) to be faced and overcome using any strategy that proves effective. Normally everything translates into grabbing the first firearms available by making a clean sweep of the enemies, but sometimes there are more particular missions, in which it is specified not to kill certain targets or to reach a certain location without being identified by those present . These variations help make XIII Remake as varied as possible, although it is still a first-person shooter strongly focused on the main narrative. We're pretty sure that part of the weapons have been modified compared to the 2020 version, making their use (in terms of damage and recoil) more similar to the 2003 one. And of course it's an improvement, from the point of view of the so-called gunplay.", "date": "2022-09-25", "grade": "7.2"}