{"name": "Una spina per la vita", "ref": "https://multiplayer.it/recensioni/157416-chibi-robo-zip-lash-una-spina-per-la-vita.html", "text": "We had spent just a couple of hours on it but the experience hadn't deceived us: Nintendo's approach to its minor franchises is confirmed unchanged, full derivation of the Wii and Nintendo DS generation. Kensuke Tanabe leaps from character to character with wacky versatility and even when effort infused doesn't match equal quality, we must ideally confess to the producer that time spent with Chibi-Robo! Zip Lash was overall enjoyable but not memorable. Upon the arrival of the robot on Nintendo 3DS, thanks to its platform approach, we approached it on tiptoe because the direction taken by Kyoto towards certain user (and price) ranges is so predictable as to reveal a large part of the DNA of a product even before you get your hands on it. And trust me, we're not arrogant: for those who have been following its evolution for years, Nintendo is like an open book. The new episode of Chibi-Robo is a rather simple title to complete, a little less to complete 100% but unfortunately unable to motivate to do so. We are talking about those extras for completionists who have now replaced the ability of the most refined game designers to make a level interesting and stimulating without necessarily having to fill it with other elements that are not platforms. Today it's all a balance between accessibility, frustration, computational power and complexity of the scenario: it is from the cauldron of all these factors that we understand what the craftsman who shapes the software is made of. And so what? Taking it as the sum of its parts, Chibi-Robo! Zip Lash has decent quality and little more The 3D effect Chibi and the side slide have a rather forgettable relationship; the depth improves the perception of the environment but is not enough to mask its technical modesty. On a playful level, little to declare. Green Robo So we feel sorry for Tanabe: we mention him again because it is with some regret that we re-read what awaits Chibi-Robo in case of an unfortunate fate at the box office. The basics of the gameplay, in the end, are all implementations already seen but not undeserving of mention: platform phases alternate with more typically arcade sections, with hints of puzzles that seem to bode well in the early hours and then founder in their own homework when the interest curve should mature. In the pleasantness of a homogeneous mixture orchestrated with discrete experience, however, they struggle to insert playful peaks: thumbs up for having been able to characterize each level with its own distinctive trait, both in terms of aesthetics and merely of play, the drama is that the Chibi-Robo! Zip Lash never goes up. There would also be irons in the fire but it is a conclusion that is reached after having exhausted it, not while. The whip-like plug with which to hit, cling, draw lines and break through blocks is good: you will do it for more than ten hours and sometimes studying refractions to calculate a trajectory more or less quickly will also be interesting and stimulating. The rest of the time, though, there's not much to remember. Then the incredible choice to insert, during the progress in the level board, a sort of random roulette and thus force the player even to commit himself and waste time for what represents a trivial and in the long run useless and annoying addition. Quantitatively, however, the game is there: six worlds of six stages each, various collectibles, trash to search and collect, completion objectives, costumes to discover and display on the Miiverse, the addition of the amiibo factor to have some aesthetic features in plus, all at budget price list. It is no coincidence that price and graphics go so nicely together. Half robots Let's not talk about polygons or textures: those, once in a while, are also pretty. The problem is the richness, the density of the environments, the frame rate, all aspects that should give each other a hand and instead inexplicably punch each other. The poor visual framework is fine (especially the enemy park) but at least we would have expected 60 frames to guarantee us exceptional feedback. Definitely not: a 30 system shows the side of numerous drops in the video stream, with negative peaks that denote poor optimization. The nature of a co-developed minor project comes out in all its clarity and the reflections on character control and actions are the main victims. Zip Lash is not a triple A Nintendo production and it can be seen with the naked eye: the response to the commands is not crystal clear, the relationship between the actions expressed by Chibi is not always as fluid as it should, resulting in sometimes incorrect deaths. Too bad because some aspects and sections are fromreward. The bosses, for example, are characterized by good gimmicks; the off-platform parts like the water skis aren't incredible but certainly refreshing in general; some puzzles, combined with the rush of resolution, manage to be enjoyable; the levels play well for the most part and stimulate the conclusion (except those with the submarine, really the lowest point of the product). We also include the possibility for Chibi to catch fire and freeze surfaces, two sporadic elements but able to enrich and strengthen some parts with particularities. In short, we would like to clarify to all Chibi-Robo fans that Zip Lash, although it completely changes the typical dynamics of the brand, is played willingly and accompanies the finale - moreover with excellent ideas but inexplicably inserted one-off - without however leaving who knows what sensations . We would like to reward it more than that to ensure its survival and evolution into something more suitable, but to date Zip Lash does not fully represent the desired build quality for the cute little robot.", "date": "2015-11-04", "grade": "6.5"}