{"name": "Il bello dello sparare", "ref": "https://multiplayer.it/recensioni/158435-afterpulse-il-bello-dello-sparare.html", "text": "Although it is undoubtedly one of the videogame genres that is worst suited to the characteristics of touch devices, that of competitive shooters continues to be an area in which many developers try their hand, often ending up having to measure themselves with great limitations as regards the technical sector and especially the control system. A bogeyman who does not seem to have scratched the ambitions of Digital Legends in the slightest, who with their Afterpulse intend to make the proverbial leap in quality to the genre in the mobile field. Let's see if they actually succeeded... Technical power Afterpulse is configured as a classic free to play shooter at least as far as the basic setting is concerned: there are energy units that are spent for each game played and which recharge over time, the in-game double currency system, rewards that are given for achieving certain objectives or for logging into the application on an ongoing basis, and so on. What distinguishes the Digital Legends title from most of its direct competitors in the first few bars is the amazing graphic impact, really impressive for an iOS product that is also free. Although based on a hackneyed military iconography, Afterpulse offers to the eye polygonal models of the characters solid and defined down to the smallest detail, inserted in well-constructed environments that excel in the quality of the textures and light effects, all at a frame rate rock that never gives signs of abating. A magnificence that obviously requires a price to pay, represented in this case by the fact that the arenas are few, modest in size and can accommodate a maximum of eight players, but these are still compromises that are more than willingly accepted given the final result. Once the intoxication for such a sumptuous cosmetic has faded, Afterpulse still proves to be a shooter that is not limited to appearances, although these undoubtedly remain the spearhead of the production. The control system offers three variants that revolve around the presence on the left side of a virtual stick to move the character and the main keys on the other side, while the gaze is managed by swiping the finger anywhere on the screen. A valid solution up to a certain point, which does not allow the player to have satisfactory precision when it comes to aiming: the developers have sought a compromise by equipping the software with an automatic target locking system, which on the one hand it makes things a lot easier, on the other it takes away the pleasure of searching for the headshot, making the firefights a little too limited and superficial. Even with amazing graphics, Afterpulse runs into the problems of almost all mobile shooters I'll kill you with bots Afterpulse is a game completely devoted to multiplayer, which does not even contemplate the eventuality of a single player campaign or something similar to it: after a couple of games with the bots necessary to gain experience, in fact, the necessary level is reached to be able to access to online battles against other players, and it is here that the real heart of the gaming experience can be identified. Unfortunately not everything goes as it should: at the moment there are only two modes available (classic and team deathmatch) and connection problems are the order of the day, with unresponsive servers, interrupted matches and a bit expensive old lag to complicate matters. Sins that could all in all be forgiven for a free title, but which take on a certain value if you look at the economy on which the Gamevil product is based, which does not save money on the microtransactions front: between new equipment, repairs, power-ups and upgrades various the money raised on the battlefield tends to run out quickly, leaving the player with the only alternatives to put his hand to his wallet or undergo a heavy grinding to scrape together some money. If we add to this a menu interface that is anything but exciting, unable to support the user's needs when he wants to manage his inventory or view and compare the statistics of the various weapons at his disposal, it becomes clear that Afterpulse tends to ask for more than he is actually capable of giving, at least in this initial phase of his life. The hope is that future updates will be able to correct what we could define as youthful sins, but at the time of writing Afterpulse is a beautiful shooter to look at but which objectively lacks a bit of substance.", "date": "2015-10-31", "grade": "7.0"}