{"name": "Lost Judgment", "ref": "https://multiplayer.it/recensioni/lost-judgment-recensione-pc.html", "text": "If it is true that the Yakuza series (pardon, Like a Dragon) has undergone a revolution in terms of gameplay, abandoning the action approach to fights in favor of RPG-style turn-based battles, by now it is clear that it will be the spin-off Judgment to carry on the tradition of the brand between spectacular combos, fight positions to alternate and devastating finishers. A choice confirmed with conviction in the sequel called Lost Judgment, which landed on PC Steam at the same time as the first episode and can be purchased on the Valve store both individually and in perspective of a convenient Collection, which includes in the price not only the two games, but also the expansion The Kaito Files - Kaito's Dossier, which alone would cost 29.99. So how does Takayuki Yagami's new adventure compare to the beginning? And how does it run on the Windows platform compared to last generation consoles? Let's unravel the mystery in the Lost Judgment PC review. History Lost Judgment, Yagami surrounded by unfriendly students Successfully filed the investigation into the serial killer who gouged out his victims' eyes (we talked about it a few days ago in the Judgment review), Takayuki Yagami and his partner Masaharu Kaito are having some trouble finding new clients, all while the streets of Kamurocho are filling up with gangs of criminals after the dissolution of the Tojo Clan. Luckily the two are summoned to Yokohama by their friends Fumiya Sugiura and Makoto Tsukumo, who have also opened a detective agency, but they need help for a difficult case of bullying that occurred within the walls of Seiryo private high school. Hired by the principal, Yagami and his companions will have to find out what is happening and who is responsible before another drama occurs. Yes, because the institute in question has become sadly famous over the years for a case of suicide among students and it seems that the recent developments on the discovery of the body of a school assistant have something to do with this story. This is revealed when an ex-cop, on trial for sexual harassment, intervenes in the courtroom after the conviction to defy the Justice Department and tell them about the man found dead, saying he got what he deserved. How can the harasser know all these details if at that moment he was harassing a woman on a train and both travelers and station cameras can confirm it? The issue is complex and is gradually enriched with new ideas, introducing new characters while Yagami follows all the leads of the case and ends up colliding with a group of particularly ruthless criminals. Structure Lost Judgment, the fascinating panorama of Isezaki Ijincho in the evening If the Lost Judgment structure takes up the action mechanics interspersed with narrative sequences that we had appreciated in the first chapter, and that characterized the Yakuza series up to the release of Like a Dragon, on the structure front this sequel is enriched thanks to the use of Isezaki Ijincho's scenario in Yokohama, the same one that forms the backdrop to Ichiban Kasuga's adventure and which is confirmed to be large, multifaceted and visually fascinating, especially at night. To move more quickly through the streets of the city, we can take advantage of the dear old taxis, present in greater numbers than just the ends of the Kamurocho map, or running and automatically activating the use of the skateboard, which is given to Yagami by his friend Sugiura precisely to cover the distances between one objective and the other more quickly. other. Naturally on the street there will be thugs and criminals who will challenge us at the first crooked glance, and who we will have to face. Lost Judgment, Yagami faces some bullies in the school gym The game's campaign is made up of a total of thirteen chapters, for a duration ranging from twenty to fifty hours, depending on whether you go straight ahead or try your hand at the novelty of School Tales: special missions that take place within ten subplots, in which Yagami will have to interact in various ways with the students of the Seiryo high school and their clubs, leading them to success as a special school assistant. The management of the side quests has also been changed: instead of randomly encountering characters who need the your help, you will have to use a special device that scans social media for specific keywords and investigate the areas of the city where these terms are used most often, reaching the place and thus starting any assignment. the inevitable side activities in the SEGA Clubs with Space Harrier, Super Hang-On and Sonic The Fighters, the flaming SEGA Master System II in the protagonist's office, the return of the VR Paradise and the new Gauntlet mode to grapple with increasingly difficult challenges. Kaito's Dossiers Lost Judgment: The Kaito Files, Masaharu on the sofa in the office The version of Lost Judgment that we have played is the one coming from the Collection and therefore natively includes the Kaito Dossier expansion, in which we will find ourselves playing for the first time in the role of Takayuki Yagami's partner in a compelling story that combines the his stormy past from Yakuza to his present as a private investigator. A package enjoyable from a narrative point of view, even if basically already seen in terms of mechanics: we talked about it in the review of The Kaito Files. Gameplay Lost Judgment, Yagami strolls through Yokohama As already mentioned, the gameplay side Lost Judgment reiterates what is the classic tradition of the SEGA series from which it was born, with exploratory phases that often lead to more or less random fights, to be completed in this case using not two but three different fighting styles: crane, tiger and snake, the latter designed to take advantage of the opponents' offensive through throws and joint grips. The formula still works, although by now it inevitably feels the weight of the years and despite a degree of challenge that of the campaign is inconsistent, further debased by the usual inventory that we can fill with pills and lunches in order to instantly recover the lost health in the event that the enemy on duty turns out to be more tough and dangerous than expected. Lost Judgment, one of the minigames from the School Tales The investigative mechanics have been partially rethought, with a greater emphasis on pursuits and observations, as well as the introduction of new gadgets for the drone, platforming phases regulated by a grip indicator and stealth phases in which Yagami must sneak around and use some gimmicks to distract any guards and go unnoticed. In short, exactly as in the first episode, we are talking about a side dish that is accessory and little more. The story of Racconti Scolastici is different, which between rhythm sequences and fights between robots, motorbike and skateboard races, Girl's Bar and photographic challenges offers interesting variations on the theme with respect to the basic system of Lost Judgment, which as already mentioned can also count on the collateral activities available in the maps of Kamurocho and Isezaki Ijincho. The PC version Lost Judgment, the graphics options of the PC version Lost Judgment is a graphically more sophisticated, rich and multifaceted title than the first episode of the series, but on PC the two games behave in an extremely similar way, therefore without the sequel being heavier and offering practically the same graphic options, albeit with the exception of the highest quality preset for the geometries. We therefore have the items relating to resolution, vertical sync and frame rate (settable at 30 fps, 60 fps, 90 fps, 120 fps or unlimited) which then leave room for advanced adjustments which include texture filtering, shadow and geometry quality, real-time reflections, volumetric fog, SSAO and anti-aliasing, as well as a scaler and support for AMD FSR 1.0 and 2.0. Lost Judgment, Yagami talks to a bullied student The game ran on PS5 at real 4K and 30 fps or at 1440p and 60 fps, but using all settings to the maximum with an RTX 3070 it is possible to achieve more: opting for 2160p and the best presets the game runs at 40-45 fps , while passing to 1440p you travel on 75-80 fps. There is even better: bringing the scaler to 80% of the resolution, therefore around 1800p, the 60 frames are stable and the definition remains excellent, but for simplicity it is also It's possible to switch the AMD FSR 2.0 to ~quality~ and get more texture, albeit at the sacrifice of a modicum of sharpness. Lost Judgment, Yagami and Kaito talking to Sugiura and Tsukumo The PC version therefore offers the best synthesis to enjoy the graphics of Lost Judgment, which presents slightly improved polygonal models but above all two different settings, the ever so rich and multifaceted one of Kamurocho and the relative novelty of Isezaki Ijincho, both truly evocative at night but pleasant to visit even in the morning or in the afternoon. Excellent sound sector, with engaging music to effectively accompany each sequence and excellently interpreted dialogues, both in Japanese and in English, as well as the presence of Italian subtitles confirming a rather accurate localization .", "date": "2022-09-22", "grade": "8.6"}