{"name": "Gli abissi della mente", "ref": "https://multiplayer.it/recensioni/158158-the-park-gli-abissi-della-mente.html", "text": "Funcom's return to graphic adventures goes through a particular experiment born of a handful of developers. With the world of MMO The Secret World as a foundation, the team built an amusement park complete with fully functioning attractions but they didn't do it in the name of lightheartedness. The Atlantic Island Park that we find ourselves exploring is not the one dreamed of by the eccentric businessman Nathaniel Winter, it is a dark place marked by tragedies that emerges through the eyes of the protagonist while remaining suspended between dream, memory and nightmare. Without going into details, given the importance of each element of the plot, we limit ourselves to saying that Lorraine is not a woman of action, she is a mother who is forced to follow her son among the attractions of Atlantic Island Park after the 'closing time. The pretext, a forgotten teddy bear, is the most normal but the situation is not at all between unpleasant sensations, dizziness and strange encounters. Then, when night falls, the suspicion that something is wrong turns into painful evidence. The Park tells us the intriguing story of a cursed park and a desperate mother Short but intense With explicit Lovecraftian inspirations and experiences such as The Vanishing of Ethan Carter in mind, Funcom has set up an adventure just a couple of hours long all focused on the psychological dimension of the protagonist. The first thing to do, the game itself tells us, is to turn off the light and put on the headphones to maximize the involvement, after which there is nothing left to do but find the courage to climb a long escalator, resist terror as the park turns into a nightmarish place and follow Callum's voice. The experience is strongly guided even if it is enriched by environmental narrative elements such as letters, newspapers or plates that constitute an important set of information to tell the terrible story made up of horrible accidents and mysterious deaths in the park. In all of this the actual gameplay comes down to simply walking or running and using the attractions to culminate in being able to call Callum in the hope of finding him. Lorraine's arsenal, you understood it well, is her voice which often trembles, cracks, flows into manifestations of pure terror while all around what was supposed to be a place of entertainment, turns into a nightmare. In Lorraine's utterances we relive the panic, in her jokes we experience the need to ease the tension, in her considerations we feel the love for her son Callum and the fear of never being able to hug him again. Callum is often a breath away from us but we never manage to reach him and the shadow of a disturbing being pursues us, while we take on the role of a Lorraine who sometimes falters, loses lucidity, reveals disturbing aspects of her mind. These factors, rather than the actual events, are the backbone of The Park which does not aim for big twists or surprises, limiting itself to some inevitable and often predictable ~scare jump~ to revive the tension. At the center of everything is the almost exclusively psychological nature of the experience which is immediately clear, as is the dramatic vein of a dark and adult narrative that drags us towards the inevitable aiming to involve us intimately. Matter of feeling The dubbing is of the highest level and it is not surprising that it is given the importance that Lorraine's voice holds in the Funcom title. The possibility of calling Callum and hearing him answer without being able to reach him plays a very important role in building the psychological tension that grows at a constant rate. But the atmosphere also passes through the effective environmental samplings, the distorted noises and the sound effects that give voice to objects, shadows and puppets, enriching an audio sector which, although without a real soundtrack, is decidedly well-finished . And the same is true at least in part for the visual sector whose style is based on that of vintage amusement parks, characterized by a fake look and far from the technological attractions typical of more modern structures. Pursuing Callum through Atlantic Island Park we find ourselves faced with simple plays of shadows, fairy tales transmitted by speakers and wind-up puppets that we still find today in the corners of the most famous parks, in traveling amusement parks or in two-bit museums with games of cheap light, styrofoam and Chinese shadows. Reassuring and familiar attractions but precisely for this reason capable of dragging us into the title and bringing us closer to Lorraine, thanks also to a rather good yield between reflections in real time, good level post processing and effective lighting guaranteeted from the work of the artists and from the Unreal Engine 4. Unfortunately on the technical side there are also elements that obscure the overall performance such as the poorly detailed models and the polygonal complexity which in some cases sinks. But overall the visual sector works and turning a blind eye to the cost-saving solutions, it is possible to enjoy a work that plays with a particular atmosphere suspended between vintage and nightmare starting obviously from the style, from the false hardcovers and from the disturbing statue of the squirrel that serves as the park's mascot. It is not possible to deny the obvious references to BioShock which do not make The Park shine from the point of view of originality and it would certainly have been possible to do more both technically and from the point of view of the dynamism of the experience and consequently of longevity. But we are still faced with an interesting narrative experiment sold at a more than acceptable price, which owes its compromises to the need to keep tension high while containing costs. However, the lack of Italian subtitles also depends on savings, which risk compromising the use of a title which, in the absence of a full understanding of the psychology component, risks being branded as a simple adventure seasoned with some scares of variable effectiveness. Instead what we find on our hands, despite the compromises, could be the beginning of an interesting narrative thread by Funcom. The adaptation in our language, however, could still come, at least according to the developers, but as for the future of this formula everything depends, obviously, on the success of The Park which is not to be taken for granted despite obvious qualities.", "date": "2015-10-27", "grade": "8.0"}