{"name": "Wild Arena Survivors", "ref": "https://multiplayer.it/recensioni/wild-arena-survivors-recensione.html", "text": "Far CryMobile? This was most likely Ubisoft's intention when it started the project of a new free-to-play battle royale for iOS and Android mobile devices, but then the idea was scrapped for some reason and it was decided to proceed without a high-sounding name behind the game. The formula devised by the developers to characterize this experience remains, which uses typical MOBA mechanics to give us a different gameplay than usual and not the usual battle with a first or third person view in which whoever remains wins I live. Well, actually the goal is still that! Has the interesting experiment of the French house therefore proved to be positive? We tell you about it in the review of Wild Arena Survivors. Gameplay: battle royale or MOBA? Wild Arena Survivors, the inevitable parachute jump As mentioned at the beginning, the most peculiar and characterizing element of Wild Arena Survivors is the gameplay, which does not limit itself to offering us yet another battle royale along the lines of PUBG: Battlegrounds, Fortnite or Apex Legends, but invents an approach in multiplayer online battle arena, MOBA for friends, as regards the movement and combat system of the characters.The latter are represented in the same way as the protagonists of a hero shooter: twelve survivors, each equipped with different skills and equipment, who are sent by a terribly Vaas-like villain, philosophical discourse included, on a deserted tropical island full of angry fauna. Within this map, which gradually shrinks, forty fighters must try to eliminate each other, collect as much loot as possible and perhaps remain the only ones alive at the end of the match. The controls are quite immediate, even more so if you are familiar with the aforementioned MOBAs: a virtual analog stick on the left side of the screen allows you to move the character, while a series of buttons on the right side start the attack, change the weapon, activate any special moves or the consumption of objects that can temporarily improve the strength, speed, resistance or health of our alter ego. The aiming system is basically that of a twin stick shooter, although it is possible to rely on the automatic aim single tap and see our character shoot as soon as we lift our finger from the screen. Fire is emitted on release: an interesting choice, no doubt, but which in the presence of even a minimum of latency translates into a systematic inaccuracy that makes the experience unplayable. Structure: these are the 40 Wild Arena Survivors, our character explores the island The structure of Wild Arena Survivors clearly takes up the tradition of live services, with a system destined to be enriched with the passage of time and seasons (we are still in the first one, incidentally), but which currently includes a single map and two modes : solo and duet. Let me be clear: the stipulations are enough to get an idea of the experience and understand its undoubted potential, but also the possibility of pay-to-win implications. In fact, unlocking all the survivors is theoretically possible even just by playing and collecting coins and crystals , therefore without having to buy packages or Season Passes from the in-game shop, the Clash Royale enhancement system immediately makes it clear that those willing to pay will be able to accelerate their progression and perhaps end up in a match against users who do not they have spent nothing and have less competitive characters. Wild Arena Survivors, a fight sequence It is the matchmaking that should make the distinctions of the case, but during our tests we happened to face very different opponents, and the thought inevitably went to this specific aspect of Wild Arena Survivors. Of course, we also happened to experience heavy episodes of latency, especially in match matches, and as mentioned this is a truly unfortunate eventuality for a game of this kind. The best approach is therefore to consider the Ubisoft title as a work in progress, after all the contents are still few and there is time to improve what the authors were unable to fine-tune during the soft launch. Of course there is also the concrete risk that the bulk of users do not have the patience to wait and abandon the servers, in which case decreeing the inevitable end of this interesting experiment. Technical realization: wild graphics Wild Arena Survivors and the excellent use of cel shading for the characters Closing Wild Arena Survivors would obviously be a shame, even considering the quality of the technical achievement it makes use ofa valuable cel shading graphics to outline characters, wild animals, elements of the interactive and non-interactive scenario, as well as the buildings that appear in the void of a generally desolate map. With the maximum graphic settings the game quickly brought the iPhone 12 to a boil Pro used for the review, but fortunately from the options it is possible to halve the frame rate (after all, 60 fps are not essential with this MOBA combat system) and possibly lower the details to lighten the load on the GPU. Little to say about the sound, which we found quite anonymous.", "date": "2022-09-20", "grade": "7.0"}