{"name": "Deathloop", "ref": "https://multiplayer.it/recensioni/deathloop-recensione-xbox-series-x.html", "text": "Let's face it - it was bizarre to see Arkane's latest shooter available as a console exclusive on the PS5 for a year, despite Microsoft's acquisition of Bethesda being officially announced just days after the game's release. Deals are deals. and the Redmond house has always said it would honor them, so Xbox users had to arm themselves with patience and had to wait twelve long months before being able to see the title directed by Dinga Bakaba and Sebastien Mitton land in the Xbox Game Pass catalog . Well, here we are now. Colt and Julianna are in great shape and the loop that traps the island of Blackreef is there, ready to be broken by someone skilled, brave and cunning enough to succeed in the enterprise: here is our review of Deathloop for Xbox Series X|S . History: I'm starting over Deathloop, the view from Blackreef beach We said, in fact: the mysterious island of Blackreef is the backdrop to the story of Deathloop, which takes place systematically over twenty-four hours: the loop lasts so much that for some reason it traps the scenario, making sure the same day repeats itself again and again again and again. Colt, the character we control, has every appearance of being a fighter and wants to put an end to this curse, but apparently his attempts so far have been countless and none of them have been successful.At the beginning of the game we wake up on a beach, without equipment but with the memory of what we have done in the previous loops, at least the last ones. As soon as we get hold of a radio, here is the voice of Julianna, a woman as good as and more than us at killing others, who for some reason is trying in every way to sabotage our mission, for example by appearing suddenly and killing us in the most disparate ways. The exchanges between Colt and Julianna (excellently rendered in the Italian dubbing thanks to the voices of Francesco ~Deacon~ Rizzi and Alice Bertocchi) undoubtedly represent the main strength of a brilliant and original narration, which feeds the story with new elements at every attempt to break the loop and lets us slowly discover the truth about Blackreef, its strange inhabitants and the small group of Visionaries that we will have to kill to complete the mission. To further enrich the narrative sector there are a myriad of documents and notes which we will be able to collect during the campaign and which will provide us with yet other ideas, demonstrating how careful, scrupulous and detailed the writing work carried out by Pawel Kroenke and Sandra Duval, whose praises we already praised in the review, was of Deathloop for PS5. Gameplay: Pure Arkane The ~theme park~ of one of the Deathloop Visionaries If it is true that the story of the Arkane title is gradually enriched with new elements, which, like pieces of a puzzle, make up the general picture by revealing the truth about where we are and the characters we are dealing with, Colt included, the same can be said of the gameplay which, in a decidedly innovative way, is introduced gradually, taking us by the hand and accompanying us on a path that will first see us uncertain and disoriented, just like the protagonist, and finally aware and determined. There is obviously a lot of Dishonored and Prey in Deathloop: both the combat system and the management of the stealth phases are practically a trademark of Arkane, a style that the studio (in this case the Lyon division) has been able to make clear from the outset and which is very easily recognizable, mixing with technical aspects such as graphics and sound in order to produce an experience that oozes personality from every pore. Not a simple result, in an increasingly homogenized and lacking ideas market. Deathloops, snowmen and ice sheets in a cold area of Blackreef Equip yourself with a first-person view, the ever-present dagger to call upon when necessary for silent eliminations or in rapid and violent hand-to-hand combat, a set of special powers such as translation that all too conspicuously recall the previous projects of the team and an arsenal that may not be particularly original, but well characterized (which after all is something that certainly matters more than just numbers), our goal will therefore be to break the loop before the loop ends. In practice, this means visit four different and large scenarios, during as many moments of the day, facing the bizarre inhabitants of Blackreef who patrol the streets and want us dead, in an attempt to eliminate the eight Visionaries who somehow control the technology thatkeeps the island trapped in this absurd limbo and gradually acquiring their abilities to become even stronger ... in the hope that Julianna does not suddenly appear to throw a spanner in the works. Deathloop, soothing messages left by Colt in his various attempts The funny thing is that the role of the girl gave the developers a nice idea: to base competitive multiplayer on it, making sure that someone (either artificial intelligence, one of our friends or a complete stranger) can dress her cloths and carry out a real invasion of our game, defending the loop and trying to kill us. A brilliant idea for an element that nevertheless remains an accessory. Returning to the gameplay, it must be said that on a behavioral level the enemies make the inevitable compromises of the stealth genre, therefore they are not very smart and often tend to throw themselves headlong into the false belief that we are immune to our bullets, but a certain degree of resistance and the obnoxious ability to inflict huge damage on us balance the situation, together with shrewd management of ammo (read: you will often run out of it) prevent us from clearing the streets of Blackreef like any DOOM Slayer, indeed often pushing us to prefer a silent approach also to take advantage of the articulated level design that characterizes the maps, full of more or less secret alternative passages. Structure: roguelike simulator Deathloop, one of the first gatherings we'll face... or get around The fearful caution that will accompany us during the first hours of the Deathloop campaign is hand-in-hand with the original structure of the game, which provides a decidedly different interpretation of the roguelike mechanics from the usual. Roguelite, on the contrary, given that at the end of each loop we will be able to use the ~residue~ obtained up to that moment to infuse certain weapons and objects (or sacrifice them, if we consider them of little use) in order to keep them for the next attempt. 'setting that makes you a little uncomfortable at first, losing in some ways the character of progressiveness that characterizes all the other aspects of the experience and putting us out of the blue grappling with the interface that can be consulted between one expedition and another, which does not miss details, background, clues and then again perks, upgrades, different classifications for Colt's equipment, together with a function to quickly switch from one phase to another of the day: one of the many mechanisms devised by the authors to allow us to explore the areas at different times and thus discover further secrets capable of extending the duration of the experience well beyond the sixteen, eighteen hours necessary to complete the campaign. Technical realization: between style and frames Deathloop, a ride downtown always looking over your shoulder We have previously spoken of the ~Arkane style~, which as mentioned we find overbearing in Deathloop also and above all as regards the technical sector. In fact, although the design of Colt and Julianna differs in many ways from the geometries of Dishonored to get closer to the works of MachineGames, the inhabitants of Blackreef, with their disturbing masks, clearly recall that type of aesthetic, which also owes a lot to the classic BioShock. The result is an undoubtedly fascinating mixture, even if it lacks technological solutions capable of establishing unequivocally how it was impossible to bring the game to PS4 and Xbox One. Of course, with the exception of the graphic modes, four also on Xbox Series X: ~raytracing~ for dynamic 4K at 30 fps with ray tracing, in fact; ~visual quality~ for dynamic 4K without ray tracing, prioritize quality and unlocked frame rate; ~performance~ for dynamic 4K without ray tracing and stable 60 fps; and finally ~ultra performance~ for 1080p without ray tracing up to 120 fps. Deathloop, the graphic modes of the Xbox Series X version Unfortunately, the ray tracing implementation only affects shadows and ambient occlusion, meaning you can do without it without missing it. However, it is better to opt for the ~performance~ mode, since using ~visual quality~ the frames per second reach sixty only in confined spaces, systematically dropping in the open areas of the maps and returning an inconsistent experience, also for the purposes of the precision of the controls .Finally, as usual, the audio, which, however, also deserves a better positioning from the point of view of this review. In addition to the aforementioned excellent dubbing in Italian and solid effects, Deathloop can in fact count on an absolutely amazing soundtrack, full of contaminations and daughter of the 70s, perfectlyable to accompany and enhance the various game sequences.", "date": "2022-09-20", "grade": "9.0"}