{"name": "Cannoneggiar m' dolce in questo mare", "ref": "https://multiplayer.it/recensioni/157753-world-of-warships-cannoneggiar-me-dolce-in-questo-mare.html", "text": "Even though they have been rendered almost obsolete by advances in warfare technology, warships are still a terrible and beautiful sight today. Armored monsters of tens of thousands of tons capable of unleashing incredible firepower, but also inhospitable places, dominated by an iron discipline in which one risked making a horrible death. Commanding a warship meant being able to calculate very quickly thousands of variables relating to course, weather, distance from target, gun elevation and opponent. Each ship had a specific role within the fleet and this is one of the first rules you need to learn to play World of Warships, the new Wargaming game which, after the triumph of World of Tanks and the uncertainties of World of Warlplanes , wants to conquer the seven seas with this chapter dedicated to the Russian, German, Japanese, British and US maritime forces that plowed the waves before, during and shortly after the Second World War. All in your seats, it's time to review World of Warships! Class is everything Compared to previous games, World of Warships features much sharper demarcation between the various classes. At our disposal we will have destroyers, cruisers, battleships and aircraft carriers and we will have to adapt the strategy based on the ship we have decided to deploy, because otherwise it will be the total defeat for us and our companions. Destroyers, for example, are unable to hold out for long under enemy fire, but they are fast and heavily armed, so they are ideal for surprising enemy aircraft carriers or reconnaissance and then escaping by launching a battery of deadly torpedoes. Cruisers are the backbone of the group and do quite well on their own, but still need destroyers or support aircraft to spot targets or defend against enemy fighters. The big battleships, on the other hand, can strike from miles away and do terrible things, but they are very slow and totally useless if someone doesn't identify where to shoot for them. Finally we have the aircraft carriers which are totally devoid of active defenses, i.e. the guns, and with which the game is transformed into an RTS in which we will have to decide where to send the bombers, where the torpedo bombers and who to protect with fighters. In theory they can do a lot of damage, but if they are not protected it is very easy to sink them. Understanding and playing each role is a fun and stimulating challenge because they are radically different from each other. With the smaller ships it almost seems like playing an FPS in which it is essential to understand when to flee and when to attack, while in the larger ones every move must be planned in time because the reaction times are very long and nobody wants to end up with the cannons unloaded in front to an enemy ship ready to fire. Steel symphonies A well-played game of World of Warships relies entirely on team chemistry and the ability of individuals to play as a team. Victory can be achieved in two ways: by eliminating every enemy ship or by maintaining control of certain strategic points. In battle, after all, each class depends on the others in order to be able to best express their potential. Bigger ships need someone to find their targets, smaller ones need someone to protect them when they retreat and when everything works perfectly it's a feast for the eyes. Playing in a good team, it is possible to admire the destroyers as they launch smoke bombs to hide the movements of the fleet and then surround their opponents to understand their position, launching torpedoes in the areas where it is easier for the enemy to pass. Meanwhile, the cruisers will advance cautiously in front of the battleships to eliminate enemy scouts, while the latter will aim straight at the aircraft carriers to prevent the pilots from taking off. Finally, our aircraft carriers will avoid going head-on into the fight but will remain a bit on the sidelines, using fighters to counter the attacks of torpedo bombers while bombers will force the enemy forces into desperate evasive maneuvers. Unfortunately, teamwork is a fascinating and frustrating aspect of World of Warships, because no matter how good you are, if the rest of the team is not at your level, it will be very difficult to win. All it takes is an incompetent captain to put the others in check and, as the matches are a bit longer than in other Wargaming games, there are times when the only thing to do is aim at the enemy vessel hoping for a glorious death , because the alternative is ten or fifteen minutes of hidingup between the islands, and all because the guy who piloted the destroyer got shot like a rubber ducky. The zen of the cannonball In World of Warships even the best strategy is useless if you don't learn how to shoot. Playing you spend about half of each game scanning the sea looking at the horizon through the viewfinder of our cannons and, although the approach of the title is more arcade than simulation, hitting the enemy is a much more complex job than in an FPS or to the other two titles of the trilogy. In the first few games everything is quite simple because beginners' warships exchange shots at relatively close range, so all we have to do is aim a little further than the enemy's bow and pull the trigger. The more you level up, the more complicated the situation becomes, until hitting the target becomes a strange mixture of mathematics, psychology, aim and lots and lots of luck. Yes, because the bigger the guns get, the more they hurt, but at the same time, the reload time and the seconds that pass before the bullets hit the target also increase. It can take up to ten seconds to hit the enemy and in that time the opposing captain can change direction, slow down the ship or hide behind an islet. So it's not enough simply to calculate where the shot will land, but you also need to understand what's going through the head of the man holding the rudder a few kilometers away. Sometimes it can take up to thirty seconds between one salvo and another, an infinite amount of time when the sea around you is full of people who want to sink you and you can't shoot. The same goes for torpedoes which are perhaps the most formidable weapon against any ship, but they are also very slow, so they should only be used when the result is certain, or at least plausible. After all, seeing one's shots fall into the water is frustrating, but when everything runs smoothly and the opposing ship lights up with the flashes of the explosions, it's a beautiful and rewarding moment, let alone when we can even take a second off to admire it as it sinks. . Speaking of sinking, the game is visually very, very beautiful, with extremely detailed models and equally worthy landscapes (especially the scenario in the middle of the icebergs). There is only one thing that clashes: when a ship sinks it does it in a rather woody way, a few more special effects would not have disfigured. A sailor does not give alms Another very nice aspect of World of Warships is that it doesn't betray its free-to-play game intentions with excessive requests for money or game mechanics that reward too much who opens the wallet. Wargaming has years of experience in this area and certainly hasn't built its fortune holding its hat in hand. Except for some ~premium~ ships, everything seen in the game can be obtained with hard work at the front. Of course, the path to get to the fourth tier ships is long, but maybe it's also right. And then, in any case, whoever decides to spend money to have the most beautiful ships right away will find himself faced with the problem of having to learn how to command them right away, whoever instead prefers to invest more time than money in the game will be able to get over the sea with the easier ships and gradually learn to handle the more complex ones. The only case in which we arose the mouth is when we realized that beyond a certain threshold it is necessary to have a premium account if we want to own many ships at the same time, otherwise we will have to sell the older or less used ones to make room for the most flamboyant models . This is a real shame because sometimes one doesn't feel like using the more complex ships, or wants to keep a few spare ships to use in case too many games go wrong.", "date": "2015-10-19", "grade": "8.5"}