{"name": "Costruttori avventurieri", "ref": "https://multiplayer.it/recensioni/157638-minecraft-story-mode-episode-1-the-order-of-stone-costruttori-avventurieri.html", "text": "Minecraft: Story Mode is a series consisting of five episodes. This is the review of the first episode, written and subtitled in English. Beware of spoilers. Try to squeeze the Minecraft cubes very hard and you will see that instead of a juicy narrative you will get new smaller cubes. That's because Minecraft is a builder's dream whose only problem is defending against monsters that spawn in the dark. That's why we were blown away when Telltale announced that a series of adventures set in the world of Minecraft would be released; from what narrative bases could they ever start to tell a story? Well, after playing the first episode of the series, we can say that there is a sensible story. The question is more whether it is aimed at an audience of adults or children around the age of twelve. Let's start with the setting. The game is developed with the Minecraft engine, which leaves an indelible impression on the Mojang title but which in the service of an adventure is far too humble. It would seem like the only possible choice for a game like this, but it shows that it gave Telltale the excuse to get lazy on the graphics. A kid who spends his days building phantasmagoric architectures in Minecraft will probably love the visual aspect of this adventure, and that's okay. To us it got tired quickly, for example. For the rest there are all the iconic elements of the Mojang game, i.e. chickens, pigs, trees, but also zombies, creepers and giant spiders, as well as obviously the real protagonists of the game, the dozens of colored cubes all different from each other. In Telltale's narrative world, however, there are also colorful cities and dozens of characters to meet. Jesse is the protagonist of the game (we decide whether male or female) but he is not alone in his adventure. Two friends and a pink pig named Reuben faithfully accompany him step by step. At first, Jesse's problem is relatively small. He and his friends have to participate in a building competition and try to win for once, in order to shake off the loser label. It soon becomes clear that the social context is compatible with that of a common high school. There are the classic smart but not very popular guys and the equally classic braggarts with a winning appearance. It must be said that Telltale digs a little under these stereotypes, showing us for example the prejudices of the ~losers~ and the open and generous mentality of what would seem at first sight to be a full of father's son. However, the construction contest soon becomes a thing of the past as a far greater threat descends on the city. Our friends therefore find themselves in spite of being the only possibility of salvation for the world. Their adventure begins as they search for members of the Order of The Stone, four heroes from the past who defeated the Ender Dragon. Except that the four fabulous heroes are actually five. And suddenly everything gets complicated. Minecraft: Story Mode is aimed at the youngest with a pleasant story without daring anything Goodbye creative spirit Having clarified the general context of this unusual narrative license, let's get to the actual game. There's something depressing about seeing buildings magically appear in front of us by pressing a key on repeat. If possible, Telltale has managed to trivialize the interaction even more than it has in previous series. And this has nothing to do with the age of the audience. Even the fights, already mortified by the game engine, are reduced to the usual timed event without stimuli. This becomes even more painful when the game puts the work table in front of us. In those moments we simply have to arrange the few objects we have with us in the correct order. In order not to waste time playing, Telltale offers us a handy recipe book that shows exactly what to do. Other elements of the original Mojang game are more or less imaginatively inserted into the story. There is, for example, a gelatinous cube to jump on to free chickens, a decent roundup of monsters and the inevitable mine carts that whiz inside lava-filled mountains. The excellent English dubbing raises the quality of the dialogues (always written in English), which are quite subdued by Telltale's standards. This happens because the game tries to win the sympathy of an adult audience without daring anything brave. The result is harmless irony that leaves no mark. The same goes for the story, which is pleasant, told according to all trappings, but too controlled. Like a ride on the slide in the neighborhood garden. If for some reason you were forced to play this first episode, probablyyou would let yourself be guided without putting up too much resistance until its conclusion. But we can't imagine a good reason why you should be eager to do so. Unless you're a little Minecraft fan, of course.", "date": "2015-10-16", "grade": "6.0"}