{"name": "Harmony: The Fall of Reverie", "ref": "https://multiplayer.it/recensioni/harmony-the-fall-of-reverie-recensione.html", "text": "Don't Nod, for many years now, has been synonymous with storytelling and freedom. Most of his works, with the sole exception of Remember Me, are based on allowing the player to make a series of choices to shape the progress of the plot in a more or less important way. This was the case in the narrative adventures Life is Strange, Tell Me Why, Twin Mirror and even in the RPG Vampyr. Also as editor (of Gerda A Flame in Winter) Don't Nod seems particularly interested in games where being able to decide the fate of the characters is a fundamental part. It will therefore not surprise anyone to know that Harmony: The Fall of Reverie is once again a product of this type. Available from June 8, 2023 on PC (version tested by us) and Nintendo Switch and from June 22, 2023 on Xbox Series X|S and PS5, this new adventure focuses totally on the power of choices, inserting various game mechanics completely based on exploration of the possible future of the protagonists. Like players, developers also have to make the right choices and we will tell you what their fate is in our review of Harmony: The Fall of Reverie. Atina and Reverie Polly, the protagonist of Harmony: The Fall of Reverie Harmony: The Fall of Reverie takes place in Atina, an island but more than anything else a sort of fictitious city-state positioned in the Mediterranean, with a markedly Hispanic cut. We're in the very near future, in a world you'll find instantly familiar if somewhat alienating, with its drones flying everywhere and sci-fi holograms within multicolored neighborhoods that hail from the late 1900s. Atina is in fact a mixed reality, which blends the old city with the more modern neighborhoods dominated by glass and metal skyscrapers of the 21st century. It is a mixture of those who remember what the quiet, sunny island was like when it had not yet become the headquarters of the multinational MK and those who, willy-nilly, have to bow to the economic and cultural dominance of this company. In the midst of all this is Polly, a woman who is also a fusion. Born in Atina, the young woman moved away from it about ten years ago to study on the continent, but also to escape from a difficult relationship with her mother and from this island that was too close to her. Now the protagonist is a daughter of Atina, but at the same time she doesn't know her anymore. Her return, caused by the need to go in search of her mother who disappeared into thin air, will force her to redefine her vision of this small island world which is actually the epicenter of changes that will determine the fate of all humanity. In fact, Harmony: The Fall of Reverie does not only tell us the story of Polly, her family and her friends, but blends everything with the story of Reverie, an alternative reality in which Ambitions reside, conceptual entities (but very alive and very active) who were born together with men on Earth. We speak of Happiness, Power, Bond, Chaos, Glory and Truth, of the quasi-gods who can influence the destiny of people but who are at the same time guided and dependent on them. At the beginning of the story Polly becomes the Oracle and travels between the world of reality and Reverie, learning about Ambitions and trying to understand what happened to her mother. The value of choices Polly often talks to Ambitions in Harmony: The Fall of Reverie The two realities are closely linked and the Oracle's task is to bring order to Reverie. As? By making choices in the real world to accumulate Egregore, an energy in the form of crystals, different for each Ambition. In fact, each of our decisions will be guided by one of the Reverie entities. Crystals are not only a narrative element but also a gameplay necessity, as certain choices are only accessible if we have the right Egregore. The power of this system lies in the fact that each chapter of the story will not be experienced as in Life is Strange, in a completely linear way, but will be explained in summary form on the Augural page. The Augural is the representation of the Oracle's powers of foresight. In narrative terms and even more in terms of gameplay we can get an idea of where our choices will take us, thanks to a series of icons connected to each other that anticipate what could happen in a few words. Furthermore, at the end of each Act (that is, the sum of several chapters), all the Egregore adds up and unlocks very important choices that will change the plot and make available or block future events. This pushes us to think in advance about the type of actions we want to carry out from phase to phase in order to be able to reach the very future that we think is most interesting. This is the Aaugural, the picks page of Harmony: The Fall of Reverie We realize that, said this way, it could almost seem as if the whole plot is revealed from the beginning or that the choices are just a mathematical game of ~what do I have to do to get the crystal I want~, but that is not the case . First of all, Polly's prescience is limited to the current chapter (and sometimes some parts of the Augural are invisible anyway) and therefore we never have a complete idea of what is about to happen. Each plot event has long-term repercussions and the possibilities are truly many. You can see for yourself what the Augural looks like in the image just above: even considering that certain sections are blocked, there are always many possibilities and we will have to find a balance between aiming for a long-term destiny and making choices that we find consistent with the our version of Polly. In our case, we experienced every choice in a very painful way, staring at the Augural for minutes and minutes to elaborate the whole range of choices, but also trying to understand if we are really ready to betray that character, agree with that other or listen to a certain Ambition in order to obtain the necessary power to bend the future in the directions we desired. Harmony: The Fall of Reverie manages to convince because the plot is able to blend the most everyday and ~simple~ moments, such as relationship difficulties with parents, lost loves, the sense of belonging to a place, then moving on to political themes and ideological, such as the overwhelming power of megacorporations that are no longer the sum of individual managers, but become faceless beasts. Everything then merges with broader concepts, such as the real composition of the human soul and what guiding principles define our entire species and what we would do if we could decide the new course of history. So we talk about microscopic and macroscopic at the same time, jumping back and forth as Polly goes from the real world to Reverie. Polly's allies all have their own specialization in Harmony: The Fall of Reverie The whole thing is also interesting also and above all because the characters of Harmony: The Fall of Reverie are exciting. Polly will be led by us, but it's not a blank sheet. It has a past to discover and to use as a reference to decide how to make it evolve. Furthermore, all the characters that revolve around them manage to intrigue the player, thanks to an excellent visual and narrative characterization. We will interact with them at all times, discovering a new side of them and being advised on how to act. Each choice will bring us closer or further away from them and, also considering the good amount of endings (three categories, with one proposing six sub-variants in turn), replaying Harmony: The Fall of Reverie seems almost an obligation, because it's a pity not seeing all it has to offer. The Augural does give us an idea of which alternatives we've discarded, but it can't replace an entire new game. In our case we needed ten hours to get to the credits, but we believe that a second run would take less time because a slice of the game is spent in the choices menu weighing the possibilities, as already mentioned. Rhythm, voice acting and art The Augural has various rules: some choices unlock others, in some points there are timers or events that become mandatory Spending one's time in the Augural to understand in which direction to continue the plot is part of the experience and it satisfied us not a little because in every moment we truly had the impression of having to make very important decisions. Furthermore, presenting the plot in this way is very clever, because it immediately makes it clear how much work is behind it, which is not understood with more classic presentations. At the same time, this also means that the progression of the plot is very fragmented. Sometimes a chapter isn't much more than a couple of dialogues that are broken into many small pieces and our every choice guides us in the dialogue, in search of the Egregore and the right future. If in a more classic and cinematic presentation this dialogue, even with various choices available, would have lasted ten minutes, with the transitions from dialogue to Augural and the time spent thinking about the choices, the duration doubles. The pace of Harmony: The Fall of Reverie is therefore much lower than the average narrative game. We believe that it is a perfectly balanced sacrifice and, thanks to the quality of the plot and the characters, we never got bored, but every gamer must understand if a certain slowness in progress can be a serious point against the game. ~Life is Strange~: it is impossible that it is not a quote volute, right? A sure point against will instead be the total lack of Italian. The game is available with English, French, Spanish and German text, with English voice acting only. The latter is of the highest quality and, especially in the case of Ambitions, is truly capable of giving more depth to the characters, making them emerge from the screen and expanding the limits of their two-dimensionality. Harmony: The Fall of Reverie is a visual novel-style narrative adventure, structurally very simple and with few settings. Overall though, even with a little Don't Nod was able to create a beautiful island. Atina, in its various glimpses, emerges overwhelmingly and almost assumes the role of an additional character, silent yet always present. By the end of our trip we have grown fond of this island, which has an important ancient history and is not just a beautiful background to see.", "date": "2023-06-08", "grade": "9.0"}