{"name": "Undertale", "ref": "https://multiplayer.it/recensioni/157604-undertale-combattere-o-no.html", "text": "There has been a lot of talk about Undertale since its release. Looking at the screenshots of it, it's hard to understand why. After all, it seems to be just a similar Japanese RPG, not too dissimilar to those that have flocked to Steam since the doors of Greenlight were opened wide. What will ever be different to deserve so much attention? When it comes to video games, one should always try to distinguish what appears from what is (one should also do it in life, but that's another story), i.e. it would be important to understand if the message inherent in the representation finds a counterpart in the system rhetoric created by game mechanics. Undertale has garnered acclaim for letting the player choose how to fight: kill or get the monsters to leave the battlefield peacefully? It's not a big dilemma, really, because the game goes out of its way to make us understand that fighting is for bad guys, while the dialogue is for good guys. But let's leave this topic for later and proceed in order. Basically we are talking about a Japanese RPG sprinkled with puzzles to overcome, many dialogues and enemies to face. The protagonist is a little girl who has to escape from a dungeon full of monsters, locked up by humans after a long war. At the beginning of the game Toriel, half cow and half rabbit monster with a maternal attitude, saves her from the evil flower Flowey and, after talking to her a little about the underground and its inhabitants, defined as peaceful despite hating humans for what they have done them, he takes her around explaining some aspects of the gameplay, based entirely on simple interactions centered on the use of a single key and movements. To say, there are buttons to press in a certain order, tiles to walk on to change their shape and create patterns that unlock doors, secret paths to follow to overcome chasms and so on. We have reviewed Undertale, the phenomenon game of the moment: masterpiece or hype? What I have to tell you As we mentioned, the combat system is the driving force behind Undertale's charm. When we face any enemy, including bosses, we can in fact choose whether to fight each other or to persuade them to lay down their weapons. In the first case it is necessary to carry out an attack by stopping a self-propelled bar in the central point of a force meter (the further one moves away from the centre, the weaker the blow will be), in the second case it is necessary to study the interaction options that are made available to us for figure out how to appease the monster on duty so as to end the fight. The enemies of them will try to kill us with their attacks. It is not an automatic system as in most JRPGs, but an interactive one. At the beginning of each fight, the girl is in fact transformed into a red heart, placed in the lower part of the screen inside a kind of cage. Here the enemy shots are manifested and must be dodged as if you were in a classic shooter. The important thing is to understand the different attack patterns and the function of colors, with white doing damage, light blue only affecting moving targets, green healing, and so on. The general rule to achieve victory, if you don't opt for the bloody way, is to study the enemy and act accordingly, avoiding actions that could make him furious. For example, an overly excited dog shouldn't be let play, but you will need to be indifferent to it and then caress it when it gets close, or to make a strange creature happy decorated in a ridiculous way by someone in the mood for jokes, you will need to de-adorn it. If desired, during the clashes it is also possible to use consumable objects to recharge lost energy or obtain other effects. In short, it is an articulated and well done system, especially if we think that Undertale was developed by a single person, a certain Toby Fox. What it looks like and what it is You will understand that it was easy for many to feel a certain sense of relief in the pacifist message that permeates the whole game. Finally a title that allows us to make active moral choices through its mechanics? Not even by chance. Undertale's relative limitation is its crystalline exposure. Pacifist choices are the hardest and sharply increase the difficulty of the game. In fact, killing an enemy yields experience points, which victory through dialogue does not offer. At first this is a minor issue, but as the enemies get stronger it becomes more difficult to survive. Above all the bosses become a good challenge, also because while for all the other enemies the non-violent mechanics are manifest, for them they are, so to speak, veiled. ClareWe know that every Undertale character can be defeated through dialogue, even those you can seemingly only fight against. In fact, each time it is a question of solving a puzzle while continuing to dodge enemy attacks to survive. This is where we get uncomfortable with Toby Fox's moral choices: they are not moral choices. They are, as already mentioned, puzzles to be solved. They are because we are perfectly aware that by fighting we will encounter negative consequences. Our only choice as players is therefore that of the ending, not to determine the moral path of the little girl. We know that by repeating a certain behavior we will certainly obtain the best result, while by choosing the other way we will obtain partially disappointing conclusions. Let's also add a further detail that makes us better understand what we mean: until you understand how the bosses work, it is easy to end up killing them because the alternative route is not suggested to us in any way. The systems inherent in these clashes are simply different from those used against normal enemies, but in this case they are not indicated anywhere, as if the good Fox wants to tell us that there is always a choice, even when it doesn't seem like it. Fine, but do you want to give me the tools to at least guess it? Also because, and this is an outright impropriety, the first boss with the veiled system, if killed while fighting, can compromise the rest of the adventure. In short, rather than a series of free choices, we are talking about coercions of meaning. In a sense we are judged by what we do. Not bad, given that the author may simply be interested in stating his vision, but in any case it is right to clarify what the real role of the player is.", "date": "2015-10-15", "grade": "8.5"}