{"name": "Return to Monkey Island", "ref": "https://multiplayer.it/recensioni/return-to-monkey-island-recensione.html", "text": "What must it be like to return after more than thirty years to something you thought you had left behind for good, even though you never really gave up? Taking up a story that you didn't think would ever be yours again and that others have worked on by putting their own effort into making you regret it? Over the years, many have gotten the idea that Ron Gilbert, author of the first two Monkey Islands, has never really managed to mourn the loss of control over Guybrush and co. Not so much because he wanted to continue writing about it for the duration of his life, but because he had never managed to close that story as he would have liked. Now he has been given the opportunity and, as you will see in the Return to Monkey Island review, he has used it to the fullest to come to terms with that terribly cumbersome past. Game mechanics and interface Guybrush is back, but his ship in Return to Monkey Island is not what it was before As expected, Return to Monkey Island is a classic point and click adventure, in which Guybrush Threepwood, the protagonist of the series, returns to try to get his hands once and for all on the secret of Monkey Island. The starting point of the story is Mle Island, where ours goes in search of a new crew and a new ship to attempt the enterprise. Having found the obstruction of the new local pirate authorities, Guybrush opts for an alternative strategy: to get hired in the crew of LeChuck, his sworn enemy, who is making supplies on the island just to leave for Monkey Island. In reality, the game does not start from Mle, but from the playground where the second chapter ended, in a tutorial sequence where the threads with the previous chapters are re-knotted, in a way that not only explains that cryptic ending, but also what the evolution, or involution, depending on one's point of view, of the series depended on. In terms of game mechanics and interface, Return to Monkey Island is in no way different from the tradition of the genre (verbs aside). So Guybrush's movements are handled with a point-and-click system, as is the picking up and examination of the interactive objects. Owned objects can be examined or combined in the inventory, or used with scenario objects. In terms of interface there are several simplifications, now standard for point and click adventures, such as the key to view all the interactive objects present in the scenario, the one to skip the dialogues, useful in case of repetitions, and the one to re-read the last dialogues , invaluable when you run out of ideas and have to go looking for clues. The dubbing is only in English, but it is possible to activate the subtitles in Italian, displayed on the screen at the head of the characters. Unfortunately in some cases, fortunately rare, the texts are so long that they end up covering the characters as well. Not bad, since it is a pleasure to read them. If desired, there are also a couple of extras, linked to specific objects (and Achievements / Trophies): a collection of quiz cards with questions related to the game (which we confess we practically forgot about after the first part) and a book of advice, which is practically the solution of the adventure in the form of suggestions of incremental specificity (they are vague and generic at the beginning, but with each request from the player they become more precise, until they reveal the solution of the puzzles), designed to support all those who don't like to get stuck. From this point of view, Return of Monkey Island appears to be a very modern game in not wanting to frustrate the player in any way (as stated by Gilbert himself). In addition to the advice book, in fact, it is also possible to select a simplified mode, like what happened in Monkey Island 2: LeChuck's Revenge, which practically allows you to follow the story without any hitch. By choosing the complete mode, however, you will have to solve the classic graphic adventure puzzles, as you will have understood from the description of the interface. Puzzle Friends, enemies, who knows... Speaking of the puzzles, we have never found them too complex or insurmountable, so much so that we reached the end of the game in about nine hours. In general they all follow a certain logic, easily recognizable with perhaps a few too many repetitions between keys to find and disguises to wear. However, don't expect the surrealism of a chicken with a pulley or a giant pad with which to clean the ear of a giant stone monkey, because Return to Monkey Island is in a certain sense much more linked to common logic, albeit with some welcome escapes towards the fantastic. So for example in uOne moment you have to figure out how to make fire burn underwater, or at another how to get an item from a ghost chicken. Where the Terrible Toybox game particularly stands out is in the situations and dialogues, aspects in which the hand of Gilbert and Grossman is very evident, even if one could say that we are more from Thimbleweed Park than from the Lucas period (which is not surprising more than that). Guybrush's ability to hold his breath underwater will come in handy multiple times in Return to Monkey Island Many references to real facts, including social networks and their distortions, even if always interpreted within the confines of the Monkey Island imagination, so as not to clash in any way with the rest. For example, at a certain moment, in order to convince two pirates to let him get on their ship, Guybrush will have to try to disguise the truth, removing scientific references from a certain text, because the two do not trust science, but only of what they have heard from friends and relatives. Be that as it may, the game is full of hilarious situations and brilliant dialogues, which alone are worth the ticket price and which bring you back to the glories of the genre, so much so that one of the reasons for replaying the whole adventure at least a second time is to select alternative answers in multiple choice dialogues to discover the effects on the interlocutor on duty. Tale of the tale There are also several mazes, all related to puzzles Return to Monkey Island constantly dialogues with its past, sometimes polemically, others with great melancholy. The narrative system itself is centered on a nostalgic and irreverent vision at the same time, in which the story starts from a re-enactment, because it is aware that it can no longer be lived in the present. Gilbert is aware that thirty years have passed since he last wrote about Guybrush and his stories and he proves it throughout the game, starting from the first twist. He as an author has profoundly changed and, necessarily, the character has too, even if he apparently doesn't show it. The video game industry is completely different than it was then, and so are gamers. Graphic adventures have become a marginal genre, loved by a very small niche of people, with new releases no longer causing any sensation. Mle Island is the same, but it has changed So all the characters around Guybrush are somehow different and have moved on, following their life path, where only the hero seems to have remained anchored to his youthful obsessions. For example, Carla has become governor of Mle Island, Elaine has abandoned politics to devote herself to social work, the pirate leaders have opened a fishmonger and Stan has to deal with his hunger for money. Paradoxically, but not too much, only LeChuck still shares the same objective as Guybrush (it is no coincidence that he is his nemesis), but he too is surrounded by a crew who are fed up with him and his search for the secret and who would like just spending time raiding the seas, leaving the whole fruitless affair behind. The mirror Guybrush is the gamer The story of Return to Monkey Island therefore works on several levels. On the one hand there is the search for the secret of Monkey Island, lived on the surface and which has something adolescent, if not childish (it is not for nothing that its highly destructive aspect is underlined), and on the other there is the relationship between the series, its author and the gamers themselves, which develops underground, almost shy, until it explodes in the final part. Guybrush transforms itself into the metaphor of the fan and his relationship with nostalgia and with the genre, in a continuous phrasing between story and meta story that could only end in a certain way (obviously we don't tell you how) that we really liked and that it seemed to us the only possible ending, where settling down on certain expectations, pampering them, would perhaps have been a bit pathetic. However, we realize that it could anger more than one in wanting to look beyond the screen at all costs, mirroring the gamer himself, even if this seems to be one of his main objectives. In some moments, for example in the close-ups of Guybrush, it is as if the authors wanted to show us our wrinkles, reifying them in those of the protagonist. In others the story becomes deliberately absurd, to underline its fictional nature. Some places from the first two chapters are also retraced The many quotes from the previous chapters are used in this sense, i.e. they often avoid the complacency of the fans to become dand moments of awareness, even playing with death. The initial twist and the final one thus become two ways to reconnect the series on the one hand with its troubled past and on the other with its present, focusing it in a broader and more multifaceted picture and enriching it with a meaning that is in a certain sense conclusive, regardless of the development or otherwise of new adventures with Guyrbrush and associates (which in any case are somehow hoped for, or feared, within the game) . In short, this seems to be the end of Gilbert's Monkey Island, not necessarily of Monkey Island as a franchise. Whether this is good or bad, we will only understand in the future. Graphic style LeChuck's beard looks like a cubist explosion The much talked about graphic style deserves a separate discussion, which in reality appears not only adequate, but also necessary for the entire game. Repurposing a style in pixel art wouldn't have made much sense to Gilbert. Having done it with Thimbleweed Park was a choice dictated by the desire to celebrate the genre and to say: we're back! Necessary choice to sell the project on Kickstarter to enthusiasts, making a certain culture immediately recognizable. Doing the same with Return to Monkey Island would have only been a conservative choice, which would have spoken only to the historical fans of the series, forgetting the years that have passed since then and the three subsequent chapters, including that of Telltale. Aiming for a similar, but more modern style, as done with the special edition of the first two chapters, could have led to anonymous, yet disastrous results, as indeed happened with the same ones (which are much more beautiful in the original version) , therefore it was preferred to opt for something unique, which reflected the nature of the series, but which also looked at modernity, a result that was both inspired and captivating, as well as characterizing. Despite the stylization, the various places that are visited during the adventure are not lacking in detail Frankly, after the initial shock, the graphics in the game start working perfectly. The angular style of the drawings, which gives the whole a vaguely abstract touch, stands out on more than one occasion, for example in the close-ups of the characters (especially LeChuck with that beard that looks like a cubist explosion), giving a strong expressive charge to some scenes, such as that of the ice castle or that of the court, just to cite two examples. Some people won't like it, of course, and rightly so. A lot depends on the ability to read the visual change in the broader picture of the reinterpretation of the franchise, which we talked about extensively above. We feel like praising him for the strong personality he gives to the entire game, as well as for the uniqueness he gives to some moments. The edgy style of Return to Monkey Island The same, if you like, can be said of the soundtrack, which takes up the classic songs, resounding them in a modern key and playing with them where possible.", "date": "2022-09-19", "grade": "9.0"}