{"name": "Sistema in shock", "ref": "https://multiplayer.it/recensioni/157315-system-shock-enhanced-edition-sistema-in-shock.html", "text": "There is a certain intellectual laziness, widespread in the world of videogame criticism, which relies on easy-to-grasp formulas when it has to describe objects that are only apparently similar to each other. For example, it is easy to find people who declassify the titles of the past as ~stuff for nostalgic~. The thesis is that old players project their memories onto the classics, assigning them a value they don't actually have. Feeling a certain envy for those who manage to completely ignore the past of the medium they claim to love, we are pleased to say, reviewing System Shock: Enhanced Edition, that when it comes to old titles, the attitude to take should be very different. It is true that memories can alter the value of a video game (as of anything, for that matter), but it is equally true that the ability to evaluate the historical significance of a work should be the basis of any critical discourse worthy of this first name. Making a comparison with the world of cinema, it is as if we erased all the films of previous generations, because the average audience no longer finds the right amount of entertainment in them, and we begin to consider only the blockbusters of the present as important, because they are the ones who sell. Obviously from the obtuse point of view of marketism it is like this, but every now and then it is right to try to curb the barbaric drift, technically speaking, which contemporary thought is taking, even when it seems to want to stop a tidal wave with an umbrella. Let's take System Shock: Enhanced Edition. Played from a modern point of view, it's a slow sci-fi first-person shooter with many RPG elements and an interface that's far too cumbersome (imagine that it was even in 1994). The graphics aren't great either. It is true that the team that shot it, the experts Night Dive Studios, worked well to implement a resolution that does not make it look too bad on modern monitors, pushing it up to 1024x768 (started from 320x200) despite the tiny textures and 2D sprites used for enemies. But can we stop there? Is it right to give in to the temptation to brand it as an outdated product for nostalgics just because the barrier to entry has grown thicker? Is System Shock: Enhanced Edition really a classic or is it the result of good memories of those who quote it? Orders of magnitudes We will not be guilty of this crime. Like all true classics, System Shock: Enhanced Edition shouldn't just be bought, it should be chosen. Once you have practiced with the interface, enriched by the mouse look that was missing in the original and by the possibility of redefining the keys, and once digested the twenty-one years that separate us from the first edition, what can this masterpiece of the never too late Looking Glass tell us? Meanwhile, it is easy to see the prodromes of a hybrid genre that we can currently describe by making the names of BioShock, Deus Ex: Mankind Divided, Dishonored and many others. Of course, here the levels are the classic maze of anonymous corridors and rooms that were in fashion at the time, above all due to the technical limits, and obviously it should not be forgotten that System Shock was in turn born from the success of Ultima Underworld, other little-mentioned titles but very important for the evolution of video games. But its direct progeny remains undeniable, also because some of the teams that made the aforementioned titles have ex-Looking Glass within them. Furthermore, the battle against Shodan, the crazed artificial intelligence that owes huge debts to some science fiction classics such as ~2001 A Space Odyssey or ~I Have No Mouth, and I Must Scream~, has a charm of its own that has not been lost despite the past years and which has also been an inspiration for titles of a different genre. Let's say that action narratives certainly owe something to System Shock, regardless of their sub-genre. In short, there are many reflections of that experience that have come down to today and it would be absurd not to give him credit because he is prey to a superiority complex with no concrete outlets other than vulgar self-satisfaction. Of course, as already mentioned, the important thing is that you choose to play with it. The approach cannot be that of research comfort or graphical amazement. You just have to be curious about an important piece of video game history. If you let yourself go, you will find yourself grappling with many problems to solve, the first of which is to find a decent weapon with which to face the crazed robots below the control of SHODAN. You will soon understand that the maps of System Shock are littered with items to collect and puzzles to overcome. There is no shortage of historic kink-hunting sequences in cyberspace, which made a huge impression at the time.", "date": "2015-10-09", "grade": "9.0"}