{"name": "Il basket secondo EA", "ref": "https://multiplayer.it/recensioni/157078-nba-live-16-il-basket-secondo-ea.html", "text": "There was a time, not too long ago, when EA Sports dominated the basketball simulation scene with its NBA Live series. But then technical difficulties, design errors and other factors led it to experience a deep crisis and the collapse of consensus, elements which, together with the skill of the competition, gave rise to the current situation: absolute monopoly by 2K Games and of his NBA 2K. Between cancellations and clumsy attempts to relaunch, only last season, with NBA Live 15, did the series seem to give timid signs of recovery and have taken the right path to attempt a difficult ascent towards a level in keeping with its fame. The game, in fact, despite having proved to be a product below expectations, has nevertheless launched some good ideas on the field, on which the Canadian company has also decided to lay the foundations for this new chapter entitled NBA Live 16. NBA Live 16 continues its arduous ascent, but still remains a long way from the competition Basketball for everyone Simplicity and immediacy seem to have been the two words that inspired the work of the development team. The result translates into gameplay oriented on the field, like last year, towards a more arcade than simulation style of play, lacking that depth and realism that characterize NBA 2K16, and therefore suitable for anyone who wants to try their hand at this sport (virtual) without ~getting lost~ in hours and hours of hard training. In this sense, the title can be fully appreciated almost immediately, also thanks to the possibility of using a series of options and slides to customize the experience. Whether this is good or bad depends on several factors, probably all on the tastes of the users. Having therefore established that the gameplay of NBA 2K remains unattainable and stylistically different, the touchstone for NBA Live 16 inevitably becomes its direct predecessor. Compared to it there are some improvements in the movements, actions and control of the athletes, but in general the strengths and weaknesses have remained almost unchanged. However, the playability is fluid all in all, the rhythm is good, apart from the overturns in front where everything happens with a certain underlying heaviness, and the movement of the ball returns a discreet sensation of realism. For their part, the digital samples are handled quite well with the pad, despite some latency occasionally in the response to the commands. Especially to those that require the combination of two or more keys to be performed: in that case the basketball players seem to be struck by sudden senile dementia and do not carry out (or do it halfway) certain orders. During our tests, in a couple of circumstances, for example, we happened to run towards the basket and, despite holding down the appropriate button, with a slight change of direction to disorient an opponent, our player no longer performed neither a shot nor a dunk. In other similar circumstances, however, everything went for the best, and the athlete we controlled performed real feats. Our feeling is that in some cases the graphics engine has to complete an animation that is too long before being able to start with the next one, and this creates some problems. As for the collective, the one managed by the gamer applies previously established schemes and strategies, or modified in real time during the game via the directional cross. Ditto when a specific order is given to the single player or a block is called by pressing the LT backbone. Without user inputs, the artificial intelligence instead alternates rational attack movements or defensive interventions, with others absolutely out of context, as if it did not always read the action well. When managing an entire team, especially on Superstar difficulty, he performs well defensively, but tends to adopt few offensive schemes up front. Strategies almost always aimed at forcing the maneuver with actions towards the center where, thanks to a few too many sleeps from the defenders not controlled at the moment by the player (the automatic passage from one partner to another is not always immediate, better to do it manually), some automatisms and the technical parameters of the most famous basketball players, often manages to get the better of it. Even from three points the artificial intelligence is almost infallible, especially if he has to come back or take off, and if he makes shots of this kind with some specialists, like last year he is capable of making nine baskets out of ten shots. From this point of view, NBA Live 16 at times seems to recall Konami's PES from some time ago, where Messi or Cristiano Ronaldo were almost ~unstoppable~ and practically never made mistakes, making it difficult totry to defend. Not that the gamer can't do the same: the new ~guided~ shooting system, which provides a sort of ~meter~ with a circle above it in which a white dot must be stopped in time to increase the percentage of achievement, helps enough. The advice is therefore to go to the options and set this function, choosing the one that involves the combination of shooting timing with the athlete's skills to determine the success of the conclusion, so as to make a basket less obvious. Xbox One goals NBA Live 16 offers players 33 goals for a total of 1,000 G, to be earned in the various game modes. For example, you need to create a squad in Ultimate Team where all players have an OVR rating of at least 78, block a dunk, score 100 points in a single game with only one player, or get a 100% try score from all three. points with an athlete, and with a minimum of 10 attempts. The rising star of the NBA Closed the parenthesis dedicated to gameplay, it's time to analyze the game modes offered by this 2016 edition of the EA basketball title. From this point of view, the product offers the usual, substantial outline of contents. Once you have passed the brief introductory phase, which brings to life a fragment of a match between the Oklahoma City Thunder and the Cleveland Cavaliers, you enter the main area of the game. From the classic window menu it is therefore possible to move quickly from mode to mode. These have remained substantially unchanged compared to the last edition, offering few and certainly not sensational novelties. We therefore have NBA Rewind, where it is possible to replay all or a portion of the most exciting NBA challenges of the past tournament, playing the role of a single player or those of the entire team, trying to recreate the key moments or rewrite the story . And then, in no particular order, online matches, head-to-head seasons and NBA Live Ultimate Team, which allows users to create their own ideal team by collecting current and past player-cards, as well as coaches, managerial elements and uniforms. Purchases and exchanges are based on a particular system of trading through coins that are earned in relation to team performance. Rising Star instead allows fans to take on the role of a rising basketball star, and to build his career: from the draft to the Olympus of the NBA with good performances. Compared to the 2015 edition, when creating your own virtual alter ego from scratch, you can use the new GameFace HD function, to put your face on that of the character. To do this, you can download an app, which is essential to scan your face before inserting it into the game from the Create a Player menu, and apply it to the young star. Since the first time we used it, the application crashed, while the second time, even if we managed to scan and insert the face in NBA Live 16, a monster came out, it is likely that our device does not was fit for purpose; we therefore invite you to take a look at the official EA website where there is a list of compatible ones. In technical terms, the developers have also improved the athlete leveling system, on whose technical and athletic development the role and style of play used weigh more, rather than random factors in the distribution of skill points earned. Its progression is also faster, even if the attribution (or subtraction) of AP in the game by the CPU is still too tied to predefined situations to be satisfied. Thus a penetration with an improvised finalization by the user is rewarded with a single point, compared perhaps to a more schematic steal in defense. Returning to the modalities, obviously the Dynasty one, which allows the user to impersonate a General Manager to manage an NBA franchise on and off the field. Even this year, while lacking the depth and completeness of the equivalent present in NBA 2K16, the mode remains fun to play, thanks also to the large amount of content offered as always by ESPN. Last but not least, we have LIVE Pro-Am, which allows you to use your own player created for Rising Star also in the LIVE Race and Summer Circuit multiplayer modes. With the first it is possible to join other users in challenges of five against five to 21 points in indoor and outdoor courts. With the Summer Circuit novelty, on the other hand, you have to put together a real team of friends and face teams made up of authentic NBA superstars in co-op, moving from time to time to the United States; from New York's Rucker Park toHoopDome in Toronto, up to Venice Beach in Los Angeles. This option is suitable for accumulating rewards, as the more difficult a race venue is, the better the reward in terms of skill points will be, or for buying new gadgets with which to customize your player. Despite some connection stability problems, our experience with this dual mode has been positive, and there is no doubt that LIVE Pro-Am has excellent potential that EA could refine and exploit in the future as well. The game like on TV Moving on to something else, let's take a look at the technological part. From a graphic point of view, NBA Live 16 takes further steps forward compared to the last edition. The partnership agreement with ESPN once again enhances the packaging of the product, with pre-race screens and on-field direction in perfect television style. The latter, between ad hoc shots, quick cuts on close-ups of the athletes after a basket or a foul, and the cinematic highlights of the best and worst actions between one half and another, help to immerse yourself further in the atmosphere of the match. In this sense, a key role is clearly exercised by virtual athletes, reproduced in a very realistic way in every detail: from tattoos to haircuts, from the jewelry they wear to the sweat dripping from their forehead, up to the personalized movements of the most famous champions . The animations seemed more convincing than those of the last edition, with the basketball players presenting more natural running and gestures. Despite this, we believe that for some types of movement some connection is still missing, and sometimes it happens to see athletes switch from one pose to another in a flash, depending on the change of action, or on the contrary, struggle to do so because first the engine has to finish loading the one in progress. As for the game arenas, they are well made and populated by a ~live~ audience, capable of visually restoring a credible atmosphere, as can be expected from a sports simulation of this importance. And this not only from a choreographic point of view: the crowd reacts to what is happening on the parquet, moving accordingly to a successful or wrong action, accompanying the maneuver and plays of their favorites even in terms of sound. The audio is overall good, even if not ~full~, with the different effects sampled directly within the game arenas. The buzz of the audience, even if not powerful, the applause, the shouts of encouragement, but also the music, the noise of the ball or that of the shoes screeching on the parquet, everything is faithful to what happens in a real basketball match. For the rest, without infamy and without praise, the commentary in English by Mike Breen and Jeff Van Gundy, given that it is practically identical to that of last season, except for the presence of a few new sentences commenting on the statistics relating to the past season and to the champion Golden State Warriors. Finally, the soundtrack is excellent, with sounds as always almost exclusively rap and hip hop, and which boasts among the authors artists of the caliber of Fashawn feat. Busta Rhymes, Your Old Droog and Jamie xx feat. Young Thug & Popcaan, present with the beautiful I Know There's Gonna Be (Good Times).", "date": "2015-10-05", "grade": "6.4"}