{"name": "Dungeon Siege: Throne Of Agony - Recensione", "ref": "https://multiplayer.it/recensioni/dungeon-siege-throne-of-agony-recensione.html", "text": "Armor of various shapes, weapons, potions, there really is everything available to our hero. Provided you know how to conquer them by facing hordes of enemies in interesting real-time hand-to-hand combat along the lines of other titles of the genre transposed to consoles. In these phases, with the Select key you call up the main menu, with Start you save it while with the front buttons you can give quick commands to the fighter (each key is assigned a particular action, for example to X that of a simple attack). Finally, with the backbones, it is possible to administer potions of mana (R+L) and health (generally L) to our characters. In these situations it is interesting to highlight how we will be able to count on a precious ally, an Avatar that we will be able to summon in combat to give us support and that grows in level exactly like us (each player can bring up to four non-player characters between support animals and travel companions - Ed). Once the traditional Exp points have been acquired, the main PC can be ~customized~ in some ways: depending on how we make him evolve by assigning the aforementioned ~points~ to certain characteristics rather than others (our virtual friend has many parameters and special abilities that make him distinguish) he can basically become good or bad. Furthermore, our hero can change class during the game (you can even get to 16 different Classes), with the consequent possibility of obtaining different endings and adding new skills to the Pg (six for the first, three for the second) in addition to the (fifteen) basic ones, for a total of twenty-four skills. The game features a multiplayer system to tackle the adventure in both cooperative and competitive modes with a friend. Obviously DS is not free from defects, especially as regards some aspects related to the control of the main character and physics. The interaction between our hero and the surrounding environment such as rocks or trees and other natural obstacles, in fact, is not always credible, just think for example that where there seems to be a gap, perhaps between two elements, in reality it is not possible to pass . The same goes during the clashes and the consequent, mandatory physical contact with the enemies: the blows inflicted on the opponents are not always successful even if you are in an excellent position to strike and the commands sometimes do not respond diligently to expectations. Mind you, it's not that these aspects prevent you from playing, they are simply annoying if you don't get used to it right away and you don't learn, with a lot of patience, to live with it. For the rest, in fact, DS: ToD likes. Even from an aesthetic point of view, the game defends itself really well. The engine shows well-characterized and detailed characters, well-built and well-kept cities, atmospheric, excellent light effects, especially in the execution of some light magic. Too bad that some dungeons are stylistically poorer when compared to the above elements, and that sometimes the loads between one area and another are a little slow (on average 15 seconds) but nothing special anyway. Finally, the phases in which we see films made in cartoon style instead of the classic CGI ones are beautiful. The audio sector is, in our opinion, one of the strengths of the game, and certainly DS: ToA can boast one of the best soundtracks ever heard in a video game. The music was in fact performed by an entire orchestra and at times they give something epic to the situations that confront us during the various stages of the adventure. Spot on. Conclusions An intriguing story, with a plot placed in between the two titles of the PC series, well-structured levels and an infinite number of things to do and items to find. So what's missing in Dungeon Siege to enter the Olympus of the best games for PsP? Probably a greater care of physics, a slightly more functional camera and a higher difficulty. In fact, the Supervillain Studios title does not present a level of challenge up to the fame of this series, and overall it is not a difficult adventure to tackle. Ultimately, a good game, which apart from these defects, not secondary but not such as to make it less than discreet, will not displease lovers of the genre and is certainly among the best exponents of the genre. Pros: Great depth. Story and epic music. Great variety of situations. Cons: Physics of the impacts to be reviewed. Check a little slow. Level design of dungeons not always inspired. The Dungeon Siege saga is probably one of the most loved in the videogame field, PC side. On a platform where Western-style RPGs abound, the Super Villain Studios title has in fact been able to conquerand widespread acclaim among the community of enthusiasts. Now DS is trying to carve out its own space also on (portable) consoles by focusing on some technical changes aimed at making it suitable for another type of audience. In Throne of Agony you find yourself guiding one of three selectable characters, Serin the Archer, Mogrim the Warrior or Allister the Mage, in a long adventure that will take you from the southeast coast of the continent of Aranna to the far North , through a plot that will unfold as the story progresses and that we do not reveal to you for obvious reasons. The choice of the Pg to play with and therefore of the relative class is not purely aesthetic, but important for the gameplay itself, as this choice will greatly influence both the battles and the very way of acting, of ~evolving~, as we will see in the next paragraph. As the title suggests, great importance is given to dungeon quests, but that doesn't mean that the game is limited to that. The dynamics of the latter is structured in a classic way, that is, you move on a very detailed map with an isometric view (in this case perhaps too close to the Pg) facing a series of primary missions to proceed in the adventure following the events, and secondary, almost always to Level-up or to discover some of the many, various special objects scattered in the areas. In the first case, the title offers a fair number of cities to visit, characters to interact with and houses or buildings in general to access, while in the second, there are many dungeons to explore and allow you to accumulate experience as well as collect an infinite number of useful artifacts , as mentioned earlier.", "date": "2007-03-01", "grade": null}