{"name": "Scalata al potere", "ref": "https://multiplayer.it/recensioni/156856-might-magic-heroes-vii-scalata-al-potere.html", "text": "With Might & Magic Heros VI the trust of one of the longest-lived and most faithful communities in memory has cracked between cooldowns, structural problems and other elements not implemented to the fullest. But the honesty of the developers regarding the problems of the previous chapter has hit the mark, reviving hopes for a seventh incarnation that has undoubtedly been developed with the fans in mind. In essence, having also removed the social dimension and eliminated the unwelcome extras of the sixth chapter, Might & Magic Heroes returns to the track, perched around the basic mechanics of the series embedded in a renewed narrative dimension. This still includes six factions, two of which have changed, but their representatives are members of a council in the service of Duke Ivan Griffin. Choosing one of the advisers opens a secondary campaign and facing two it is possible to access that of the Duke who, thanks to the events narrated by his supporters, can finally decide which path to take regarding the foundation of a new empire. This is the background and this is the element that immediately involves us, providing us with a choice and giving a rather strong context to the choice of the path to take. The six secondary campaigns are based on as many heroes who have made their rise to power in different eras and include a story of orc rebellion, a spoiled scion who realizes his responsibilities, a story of powerful magic, the dark path of the necromancer , the strength of sentimental ties and an unexpected destiny. Might & Magic Heroes VII takes us on a walk through the rise to power of six great heroes of Ashan I start again from seven Might & Magic Heroes VII restarts from the fundamental mechanics of the series made up of explorable maps full of creatures, missions, dungeons, magical objects, structures, resources and sanctuaries that allow us to grow our army to overcome the challenges and fight the bad guy who in multiplayer mode he is played by a real player. A turn allows you to move the character whose movement ability is determined by the characteristics and any bonuses as well as marking the passage of a day of the week with all the possible economic consequences dictated by the buildings controlled by us or by the opposing faction. When our hero's pawn meets an enemy, the tactical map intervenes on which you always play in turns even if in a board divided into squares with the two factions on opposite sides of the battlefield. But let's go back to the strategic map by premising that the CPU makes us wait less but is not always reactive, the glitches have decreased significantly but persist, technical problems abound and animations are completely missing during the dialogues between the Duke and his advisers. Inevitably these elements weigh on the final judgment even if, this must be kept in mind, they are largely solvable and it is said that this Might & Magic Heroes, like the fifth chapter of the series, is not destined to mature over time. But let's get to the content. At the base of the minor campaigns, all quite long and full of events, there is the collection of resources functional to the recruitment of troops that allow us to face groups of monsters, enemy armies or garrisoned strongholds. In some cases the resources serve as reagents to summon creatures to recruit, in others it is better to sell some of them to quickly have economic availability. In the first phase of his story the spoiled Tomas has plenty of time but limited resources while Imani is surrounded by deposits but must complete a series of challenging quests starting with a very small army. In this case, the collection of the seven materials takes us to the trading market which allows you to trade using any resource as currency and then acquire troops, magical items and so on. In all campaigns, however, time is destined to become, as in skirmish and multiplayer, a decisive factor in a series that does not allow the opponent to breathe too much. In essence, not losing shifts remains a cornerstone of the experience even if this time the economy seems to constrain the expansive possibilities of artificial intelligence more and we did not find ourselves having to face titanic armies after a handful of shifts. In case of too much pressure it is fortunately possible to calibrate the difficulty of each sector of the game by reducing, for example, only the one linked to the strategic phase in order to be able to calmly explore the map and devote yourself to the development of your own city without the risk of having to face too unbalanced battles or too simple. And in addition to the difficulty pwe also want to increase the speed of actions and animations and also in this case we can decide specifically which phases to alter. We can only speed up tactical gameplay so as not to change the experience on the main map or push everything to the maximum by distorting the atmosphere to cut waiting times sharply. Finally, the weekly modifiers, the alt key that allows you to see all the usable structures, the caravans for the transport of reinforcements that can be attacked, the shelters for the troops and the teleportation portals complete a picture which, although not innovative, works even if the heroes, all based on the same skill tree, do not shine for variety. Furthermore, the vaunted possibility of intervening on the scenario is reduced to a few pre-calculated moments but on the other hand we are talking about a turn-based strategy game that has very little dynamics excluding the climate and lighting. Ups and downs The management interface of the cities returns to being two-dimensional and takes us back in time compared to the last chapter. By building new structures the level of the settlement rises and thus it becomes possible to build more important buildings such as guilds, nurseries of powerful creatures and specific structures for each faction. The choice was probably dictated by economic needs but the yield, somewhat vintage, is good and it is also thanks to the evocative and rich soundtrack accompanied by an engaging narrative dimension even if plagued by shortcomings, problems and choices that are all too savings such as cutscenes limited to image sequences. Furthermore, some models, as in the case of the elementals, are not in step with the times and this is particularly evident in the combat phase. Fortunately, the strategic map at a glance partially compensates for it, the yield of which, net of some slowdowns, is more than valid thanks to an apt use of the Unreal Engine 3 which guarantees effects in quantity and a good yield of materials . In addition to reinforcing the already excellent atmosphere, there are fanciful details such as the zoom out of the game screen, in a fairytale movie style, when the save menu is called. But let's move on to the combat phase which is where the fates of each hero are actually decided. The interface is the classic one and is rather easy to decipher. At the bottom right are the options of the leader who stays out of combat, at the bottom left are those of the currently selected unit, and between the two are the order in which the troops will be able to act. The small icon at the top left leads to the diary of the moves made while dragging the cursor over an opposing unit it is possible to see the damage that can be inflicted by one of our contingents whose number of personnel is shown below the figure. By pressing the right button instead, the detailed characteristics come out which are very useful for formulating detailed strategies in a phase of the game which is inevitably influenced by the numerical factor of the troops but grants just as much importance to movement, attack and defense capabilities. All factors that can allow us to preserve fundamental troops to overcome the next battle or invite us to risk a decisive attack, perhaps hoping for the additional damage of a crit. Furthermore, some units have access to secondary abilities such as flying creatures that can carry out quick attacks and then return to their initial position and the possibility of attacking from behind or on the flanks not only increases the damage but leads the attacked unit to turn around for counterattack, however, conceding his back to the bulk of the army. The title also offers us numerous talents that influence every aspect of the fight and can make the difference like the spells with which the leader can heal, attack directly, inflict malus or guarantee bonuses. The other important element is represented by the protections scattered around the maps which do not stop the attacks but reduce the damage of the bullets and can be fundamental to cover the back avoiding the attacks from the shoulders which cause much higher damage than the frontal attack. And it is important to take this factor into account given that the enemy generally attacks the weakest units and tries, not always with lucidity, to exploit all the game dynamics even on normal difficulty. Obviously when the disparity of forces is very high artificial intelligence cannot do much and it is in these cases that the possibility of simulating most of the fights is useful but after having had the outcome of the simulation it is still possible to face them a secondtime, manually, and it is a possibility not to be underestimated since the CPU is generally less effective than an experienced player. On the other hand, it is always good to keep as many units as possible in a title that does not treat us with kid gloves starting with the total absence of tutorials which could be a problem for newbies. Leaving the boarding in Might & Magic Heroes VII means leaving our pens in no time even on normal difficulty and our advice is to start with the Haven campaign which is decidedly permissive in the first phase. In any case, we can say that the overall balance of the experience has definitely improved and we are faced with a solid experience even if in multiplayer the big problem of recovering after losing a fight remains. But in an equilibrium situation, with the heroes squaring off at a distance in rapid raids to gain control of resources, the tension is high and the formula works. Furthermore, the valid turn-based combat system makes duels quite fun, the hotseat mode allows two to play on the same machine and the LAN support avoids undergoing this concussion. Finally, we can't forget the editor which is decidedly intuitive and allows you to put your hand not only to the maps but also to the heroes and factions.", "date": "2015-09-30", "grade": "7.0"}