{"name": "Chi se ne FUT del calcio", "ref": "https://multiplayer.it/recensioni/156727-fifa-16-ultimate-team-mobile-chi-se-ne-fut-del-calcio.html", "text": "Continuing a trend inaugurated with last year's episode, FIFA 16 Ultimate Team is a free to play that you can download and play for free, but which only provides the mode that gives the application its name: forget about being able to choose your favorite team and command your favorites in leagues and international competitions, since here it is only allowed to build a personalized team through the now well-tested system of cards and packages which for some time now has become the real cue of EA with its football productions. Assuming that this is now the direction that the brand has taken, let's see if there have been any improvements compared to the imperfect 2015 edition... Wild Bunch On a structural level, little or nothing has changed in FIFA 16 Ultimate Team compared to last year: the player's goal is always to build the team of dreams using the stickers found in the packages obtained as a reward for their performances or purchased in the dedicated in-game shop. The logic of a collectible card game is combined with a managerial approach that sees the user committed to building a squad of players who are not only strong individually but who prove to be suitable for the chosen module and who are capable of building affinity with their teammates : the picture is completed by a whole series of collateral activities, such as the exploitation of special cards that improve a certain parameter or others for single use that guarantee specific bonuses for a certain amount of time, without forgetting the important section dedicated to the sale of unused stickers . As is now the case in almost all existing free to play games, a dual currency system supports the micro-economy of the game, with the coins that are obtained with various gameplay activities and the credits that are given extremely sparingly, essential for obtaining the most valuable packages and which in fact constitute the main commodity that can be purchased with real money. To these two values are added those of experience points, for an ecosystem that objectively can be a bit confusing for Ultimate Team novices and which is not made easier by an incredibly intricate and not very functional menu system: every action , even the simplest one such as replacing the players in pink, appears really cumbersome, further weighed down by a design that exceeds in indicators, microscopic writings and virtual keys whose functioning is difficult to understand. The proverbial icing on the cake then consists of the need for the application to always be connected to the network, with communication errors with the network which in our experience have appeared several times, interrupting our navigation in the menus. FIFA 16 Ultimate Team is a title in some ways inferior to last year's edition If the managerial component of FIFA 16 Ultimate Team has been overburdened to the point of making it even less enjoyable than the counterpart of the 2015 edition, as far as the action on the field is concerned, many things have improved both from a technical and gameplay point of view. Starting from the first aspect, now finally the title can count on a new graphics engine capable of reproducing truly credible polygonal models of footballers, decidedly more realistic than in the past (at least in relation to the most famous athletes) and equipped with fluid and varied animations. The price to pay is linked to some still rather sketchy boundary elements and to a frame rate that often gives in to some annoying hiccups that can even waste time for a game. On the purely playful front, the clear change compared to the past has undoubtedly borne some fruit: the control system abandons useless tactile gestures and relies completely on a set of virtual keys combined with an analog stick that allow you to manage the players in a rather satisfactory, while remaining a solution light years away from the comfort and responsiveness guaranteed by a physical device. The physical routines that regulate the movements of the ball and the contrasts between the athletes have also been improved, for a title that in any case struggles to be completely satisfying: the limitations in the controls force you to always set basic game actions, an aspect of which you feel the weight more as the difficulty level rises or when you engage in an online challenge against a human opponent.", "date": "2015-09-28", "grade": "6.8"}