{"name": "Rugby World Cup 2015", "ref": "https://multiplayer.it/recensioni/156526-rugby-world-cup-2015-meglio-un-placcaggio-nella-schiena.html", "text": "There are sports that are simple enough to turn into video games. Tennis is probably the easiest, which explains why Pong was one of the first video games in history. All in all, the same can be said of soccer, golf and perhaps even American football. Of course the movements are improved every year, everything becomes much more refined and accurate, but the basic mechanics are the same as the games of thirty years ago. With rugby, however, things are more complicated because it is a sport made up of complex mechanics and very different phases, not to mention that some of these, such as the ruck or the maul, experience situations that are practically impossible to faithfully replicate in a simulation and very distant from the fight that takes place on the line of scrimmage in American football. If we add to this the fact that a rugby video game is undoubtedly intended for a niche audience, it is immediately clear that a large studio will hardly be willing to finance a production with all the trappings and take the trouble to simulate it in great detail. The result is that often rugby games are either arcades devoid of any simulation ambitions or they are simply very, very bad. We reviewed the Rugby World Cup game and would have preferred a tackle in the kidneys The weight of the past HB Studios over the years has already ventured into oval simulations with quite fluctuating results. The last attempt in chronological order was called Rugby 15, but it was a really indecent product and the only goal it scored was to cancel the little good done up to that day by the developers. The players moved at random, the defense remained stunned waiting for our moves, it was practically impossible to pass a ball with precision, with situations that resulted in the comical. The graphics then recalled the first PlayStation... in short, it was a disastrous title, an offense to this noble sport and to the very concept of game design. Thus, when we learned that the official game of the 2015 Rugby World Cup had also been entrusted to the same studio, we immediately arose some doubts which have unfortunately been widely confirmed. Rugby World Cup 2015 is in fact basically the same old game with a new look, with updated squads, menus and jerseys, from which some of the main dramatic defects have certainly been eliminated, but unfortunately without this having influenced the overall judgment too much. On the other hand, if you have a lame horse you can also put a wooden leg on it, but it's always lame. From the first game, one cannot fail to notice the most evident improvements: finally the opponents move towards us, they don't wait to be overwhelmed and we manage to make at least three or four passes in a row without the ball taking strange trajectories. However minute after minute all the sensational flaws that anchor this game to the bottom of the barrel re-emerge. In fact, if it is true that the defenses are now rising, their disposition on the pitch is often absurd and far from reality, it is also possible to vary the position in attack and defense if desired, but this does not seem to have any impact on the progress of the match given that after shortly the players will tend to move around the field in a confused and often random way. What is most disconcerting is that the tackles are almost always decided at the table by the system and once the animation begins there is no escaping it. So it may happen to see a player slipping between the opponent's shirts, walking a few meters and then being suddenly reached by a sort of Superman who dives at his ankles and takes him to the ground. We also ran into a weird bug where, with each tackle, another player of ours would start running in circles around the tackled-tackler pair, as if they were all part of a rain dance, no doubt a very comical moment, but for other verses equally sad. However, we must also point out positive evidence such as the possibility of scoring by placing the ball in the designated area without necessarily having to dive, which in the previous chapters could lead to enthusiastically jumping off the pitch when trying to score and being too close to the line . Rucks and mauls The meeting point management has been revised and it's not bad at all. Basically to contend for the ball after the tackle you have to move the lever to a random position, wait for a bar to fill up, hope that it does before that of the opponent and press a button. Too bad, however, that the difficulty coefficient of this minigame is calibrated very badly. At easy level we will win every ruck, maul or scrum of the match, while at normal or difficult leveleverything will be so fast that either we will succeed by chance or we will almost always be losers, even when we use teams that are dramatically stronger than our opponents. Clearly this makes absolutely no sense in rugby as yes, there can be some quick rucks, but it certainly isn't a phase where luck can play a huge role. This without considering that it is practically impossible to get the ball out of the ruck quickly to catch the defense unprepared. Luckily, however, that will not happen too often, it happened several times to restart undisturbed with the scrum-half without any of the closest defenders doing anything to tackle him promptly. Instead, the really good thing about the ruck is that now we can make a close pass to a player in the scrum in full swing, so as to try to unhinge the defense, make it tighten, and then try to open the game. But even here the sore points: it is a pity that the game does not even explain it in the tutorial, it is discovered only by pure chance and that sometimes the scheme simply does not work. We could continue with the string of defects by analyzing the complex control system that in theory allows us to move players around the field, leaving the management of the ball to artificial intelligence. The game barely manages to line up a standard, hole-filled defense, let alone help us attack. Not to mention the defensive phase which is made even more difficult by the fact that manually selecting a defender starts a minigame called ~who knows which player I'm using~, because the system will rarely give us the privilege of controlling the one closest to the ball carrier. Or we can simply point out that visually the game is not worthy of sitting in the canteen of the next-gen, nor of eating from the leftovers of the previous one, showing an attention to detail and animations that brings the mind back to the good old days when sports simulations they had two-dimensional characters... The truth is that it no longer makes sense to continue this agony.", "date": "2015-09-23", "grade": "2.0"}