{"name": "Un voto per il Re!", "ref": "https://multiplayer.it/recensioni/156528-destiny-il-re-dei-corrotti-un-voto-per-il-re.html", "text": "We had already told you about the beginning of the second year of Destiny, with the publication of the awaited The Corrupted King, last week, telling you practically everything there is to know about the contents of the game, its updates, the news that Bungie wanted to insert to relaunch a universe that, amidst some controversy, has been able to conquer a solid slice of passionate users. In that article you can find what was, in fact, a review. A review which, however, lacked one important thing, namely the grade, which had to be accrued after having dug your teeth into the pulp of this new package and which would allow us to understand if Destiny was ready to face its second year of life. After finishing the campaign again and finishing most of the available companies, we went into the new raid, The Fall of a King, and we came out amazed, surprised, conquered. Getting there takes sacrifice, commitment and the willingness to fit into a series of mechanics that perhaps don't quite coincide with what players expected from Destiny, but which we recommend you try because it's simply worth it. Our review of Il Re dei Corretti, which marks the beginning of the second year of Destiny! If you already own Destiny and the two previous expansions, you can play the Taken King by going to this address and downloading it for 39.99 from the PlayStation Store, after logging into your PSN account. The PlayStation version contains the following exclusive content: New co-op strike ~Hall of Echo~New competitive multiplayer map ~Sector 618~New legendary equipment ~Hesperos~, ~Azoth Bend~ and ~Neuroghast~New exotic weapon ~Jade Rabbit~ Year 2.0 The new level up system works: more traditional, more understandable, well balanced. It would be foolish to say that this is the Destiny it should have been from the beginning, because those who have followed its evolution can clearly understand that it would have been impossible for this to be the case. In The Corrupted King Bungie has listened to complaints, requests, advice from a hard core of a few million players who have not stopped playing one day, or almost, this hybrid between first person shooter and MMORPG. A year later, we understand what Bungie meant by ~innovating~ with Destiny, that is, building a world around the mechanics forged over the years of Halo capable of providing a different and satisfying challenge every day, while also allowing itself the luxury of a mix of mechanics that no one had ever attempted before. Once the story is over, carrying out the various activities, talking to the characters between Atoll and Tower - who finally have their own identity, which certainly can still be worked on) - the Enterprises linked to PvP and PvE begin, which take the form of new assignments that dot the maps of the planets or in patrol missions with bosses that finally constitute a challenge worthy of the name, even once you reach the elusive maximum level 40. Challenging but accessible challenges that lead you to delve into the different weapons, subclasses and game modes, which slowly ask you to form teams of three to be completed and then groups of close-knit people. The saga that leads to clashing with Oryx lasts about five hours, but to finish all the main Quests and bounties you need more than twenty and if you add the new Incursion and goodies like the Court of Oryx, you get to a package more of fifty, waiting for the return of the Trials of Osiris or the Iron Banner, the two most successful modes of PvP, which we will return to later. The random loot system has been mitigated by an algorithm that takes into account what the player already has and the new economy is more functional, so that it is possible to grow without excessive frustration, at least in the short term. There are nice touches like the buy ticket that increases the odds of getting rarer weapons after killing a boss; there is the possibility of merging the weapons and armor of the same category to enhance one's favorite ones so as to offer a strategic profile also to the management of the paraphernalia; there is a new unique currency, the Legendary Marks, which allows you to accumulate resources by doing whatever you want regardless of PvP and PvE modes. Obviously, in the long run, the need to ~grind~ reappears and certain activities that force you to patrol the areas in search of materials come back to the fore, dampening the enthusiasm accumulated in the first hours of the game, but the new enemies, even in the areas unpublished, and their completely different attack patterns, change the cards on the table and represent a nice breath of fresh air. The Astbattleship After a year, Bungie greens up the old areas with the inclusion of new enemies, which we have already told you about in the evidence that in fact constitutes the first part of this review, and changes some clashes in the first year assaults, which can now be tackled, as well as those developed for this expansion, in the new playlist at 41. It then introduces, in addition to the story missions in the almost all new maps, the Dreadnaught, the Hive mega spaceship from which Oryx commands revenge for the killing of his son Crota. This location, in fact, represents a new planet, the only one in this expansion, which will make someone turn up their noses and brings back the theme of cost: to play The Taken King, having already all the expansions, you need 39.99. In the face of so many innovations, we feel like underlining the matter, but making it weigh up to a certain point. Certainly at least one other planet would have liked it, but the solution studied by Bungie is remarkable. In the Dreadnaught you get lost; patrol missions are carried out and new things to do are continually discovered, ravines to crash into, strange runes that one can guess what they can be used for, but to activate them there is a need to communicate, to deal with other players, to enter into a growing world. And still caves, damned knights who need to be killed in sequence to open doors and chests, strange spores that, perhaps, will be used for a mission or to forge weapons. It is a vast place, whose proportions crush the player and lead to spending more and more time looking for something that seems to be around the corner. There is also the Court of Oryx, an arena where up to nine players, always divided into groups of three, can cross paths, activating runes at three levels of difficulty, hoping to collect rare items and keys to use to open one of the countless chests scattered throughout the Dreadnaught. Most trigger new events and give away items that sometimes turn out to be perfectly useless, but it's hard to give up a game before trying to figure out what the next step of the Quest is taking place. The fall of a king Each of the three Guardian classes has a new sub-class, so that the Warlock now fires powerful beams of lightning, the Titan throws flaming hammers, while the Hunter fires arrows with void damage that slow enemies, inhibit their special powers and make causes each allied hit to turn into a crit, increasing the damage. After playing them for a long time, we were able to appreciate how each power adds depth and new possibilities to Destiny gameplay, offering more possibilities to combine talents to overcome the many different game situations. Both story missions and strike missions offer new solutions and introduce small changes to the mechanics that freshen up the world of Destiny. Nor was the mistake made, as with other bosses like Omnigul, of making encounters more difficult simply by giving them an infinite number of boring life points, and the missions are almost always a fair balance of things to do, which accompany the player to reach a level of Light equal to at least 285 so as to be able to face the new Incursion in a dignified way. The Fall of a King is set in the Dreadnaught and we understand that it is the real point of arrival for the competence that the Guardians have reached in months of play, learning various dynamics that must be put to good use there together with five other companions of travel with which a personal agreement is necessarily required. There has been a lot of discussion about the absence of matchmaking for Raid; on the need, therefore, to have friends to be able to face them and the need to dedicate the right time to be able to overcome them. Playing the new Incursion, however, one can only be amazed in several moments. We don't remember ever having seen anything like this, before, not even as an experiment, and we are certain that, a few years from now, this Incursion too, like the first one - namely the Vault of Glass - will be remembered as a shining example of game design, a real interlocking game in terms of gameplay. Platform elements in ghostly halls, crossed by spaceships and a palpable hint of death, mix with ferocious clashes, to be overcome by observing what is happening around us, which elements of the backdrop should be used to one's advantage and which are the weak points of the menacing bosses. opponents who at first seem unbeatable, while relying on the other members of the group of six and coordinating by calling times, interventions and super moves. An exhilarating, scary and engaging test to the point that anyonewant to deal with video games will sooner or later decide to experiment. Playstation 4 trophies The King of the Taken offers a total of ten trophies to obtain and almost all related to the completion of the main companies that are given by the characters of Tower and Atoll. An easily obtainable loot, linked only to the time to be dedicated to it. The situation is different for the two trophies that are obtained by completing the new Raid on a normal and heroic difficulty level. Here it will take a lot more effort, also considering that the heroic mode has yet to be released. The Crucible Eight new maps enrich the Crucible of Destiny: The Taken King, as well as two new modes. Where Pandemonium proves to be a confusing motion and a way to see the screen fill up with new supers, not worrying too much about your character's stats, Fracture is the more interesting of the two and the only one that will try to worry the popularity of the ever-green Control. However, all of them will have their moments of popularity thanks to the new bounties, simpler on average than the previous ones, at least among those who will continue to do the daily activities continuously to obtain the coveted Legendary Marks. The new maps work and some end up rightfully among the best ever, both for care in the graphic design and for their conformation. An in-depth special will be needed for this, but here it is interesting to report the good work done by Bungie. Concerns remain about the balance of some weapons because, if on the one hand portable cannons and pistols have been left among the strongest weapons but their range has been significantly reduced to differentiate them from snipers, for shotguns it seems to have been done too little, leaving them a strange hybrid; overly powerful, capable of killing even full health opponents with one blow when they are too far away. The other note is that it is still not possible to create customizable games after a year. There are only playlists, so it is impossible to play the desired mode and map. This fact, which might appear negligible, prevents the possibility of fighting Clan Wars, since there is no way that two teams of six or three players can fight each other. In practice, therefore, the clans, although provided for by the game structure, still have little more than the function of a mere ~aggregator~ of fellow players, necessary to unlock some trophies and achievements, when it would be enough to implement a mode that gives neither rewards nor experience. The feats and bounties linked to the competitive modes, however, confirm the renewed centrality of the Crucible which, starting from the House of Wolves, has become increasingly popular, pending the return of the Trials of Osiris. On a technical level, the engine has remained the same, even if the environments appear richer in detail and the light and volumetric effects, which embellish the Dreadnaught and the clashes with the bosses of the Incursion, are remarkable. While waiting to try all the exotics in store for the players, Destiny is confirmed as an excellent work from the point of view of the artistic direction. This time they also had to get busy with the dubbing in Italian, given the many lines of text inserted and the multiple dialogues that accompany all the companies and the story that now delves into many more aspects, giving a complete sense to what happens. It won't be a masterpiece, but finally almost all the narrative elements are contextualized properly.", "date": "2015-09-23", "grade": "9.0"}