{"name": "La prima curva  la tua", "ref": "https://multiplayer.it/recensioni/156532-raceline-cc-la-prima-curva-e-la-tua.html", "text": "We all remember the history of CSR Racing: the developers of the game had a fairly original idea, they were able to propose it effectively and they became rich. The extraordinary success of that title, as per tradition, gave way to a small invasion of drag racers on iOS and Android, more or less beautiful products that were able to introduce even some innovative elements within the vein remaining anchored to the original setting. The starting concept is very simple: two cars race, one wins. The race is linear, in practice you don't really drive but you only act on the gearbox and the nitro, looking for the winning cue between the folds of the gears and working with the upgrades between one race and another in order to aspire to money, glory and new unlockable racing cars. The ingredients are all there: immediacy, spectacularity, roaring engines, a control system perfectly calibrated for touch devices and a great sense of progression. Well, Rebellion has tried to offer something alternative to conventional drag racers with Raceline CC, basing the gameplay of its new title not on the precision of gear shifting, but on mechanics similar to those of the Temple Run endless runners. You are therefore riding a powerful motorcycle, whizzing through dense traffic that must necessarily be avoided in order to cross the finish line before the rival on duty, all using a first-person view. A winning idea? Raceline CC tries the difficult road of variation on the drag racer theme, but misses the mark Road Rash The premises of Raceline CC are good: once the game is installed, the client requires extra time to download the complete assets, but it is also possible to play immediately using ~raw~ models. Whatever the final quality of the graphics, indeed excellent, this factor does not affect the value of the experience, which in terms of the structure is immediately very rich and multifaceted, but unfortunately fails to offer a gameplay capable of involving if not for a limited period of time. Let's start with the positive aspects: while having to submit to the usual constraints of the freemium model, first of all the ~fuel~ which is consumed with each attempt and recharges over time, the Rebellion title offers a large number of events between races dailies, tournaments, career, and so on. You can therefore move from one side to the other, making the inevitable ~grind~ aimed at enhancing the bike smoother, which can be done through the purchase of upgrades that concern the engine, brakes, tyres, suspension, gearbox, exhaust and so on . However, the impact of each upgrade is minimal, in the order of tenths (if not hundredths), and this makes the path that leads to having a competitive vehicle a little too long and tedious. Beyond this aspect, however, it is the gameplay that disappoints, proving to be unable to offer a minimum of depth and variety after the first few races. Basically the same thing is always done, but while in CSR drag racers this factor is ~masked~ in various ways, in Raceline CC it collides (literally) against a limited concept, which sees the use of the swipe on the touch screen to avoid the traffic vehicles with the best possible timing to gain boosts, but which proves to be too rigid and random to reward the actual ability of the driver even against low-level opponents. In fact, it happens that the position of the cars is unjustly penalizing, because without perfect overtaking, the starting point needed to win is lacking, even after having bought a lot of upgrades; but above all it is the context that is always the same, aided by the first-person view (what's the point of customizing your bike if you can't admire it in action?), that soon dampens the enthusiasm.", "date": "2015-09-23", "grade": "6.0"}