{"name": "Centrocampo di fuoco", "ref": "https://multiplayer.it/recensioni/156455-fifa-16-centrocampo-di-fuoco.html", "text": "When we had the opportunity to have a close-range contact with PES 2016 and FIFA 16 in June, we came away with the impression that the two titles would compete for the palm of best football simulation on equal terms this year. If the Konami-branded game confirmed that it had finally found a route after years spent wandering aimlessly, that of EA Sports responded instead with an awareness of the mistakes made by its predecessor, touching on the elements of the latter that they had not convinced. All this adding some new features to the solid framework of the series, which over the last few years has allowed it to become the point of reference in the world of virtual football. From that moment, the summer then passed between further tests of the two games and sipped news from the respective publishers, fought at a distance with exclusive shots and other announcements intended to tip the needle of hype to one side or the other. 'other. In these days, we have finally arrived at the showdown: the first to discover the cards was Konami, which as we saw in our review of PES 2016 confirmed that it has set up an excellent gameplay, however undermined at the foundations by the double problem of tackles and referees. Upon his arrival, FIFA 16 therefore finds the side of an opponent with excellent numbers partially exposed: will he be able to launch the decisive attack? FIFA 16 puts gameplay at the center of its existence: Electronic Arts brings the series back on track New ways to play Before telling you what we've seen on the pitch, we must pay our attention to the novelties that FIFA 16 brings in terms of modalities. Compared to the edition of a year ago, the current one offers a series of new components, and it is no coincidence that EA Sports has chosen to use the slogan that gives the title to this paragraph to advertise them. The first addition is that of women's football, an element that has been talked about for a long time in recent months; a sign that in Vancouver they saw us well, at least in terms of advertising revenue. For the first time ever in a football video game, the fairer sex is represented by a selection of the twelve strongest national teams in the world (Italy included), usable in a limited set of modes with the limitation of not being able to clash against men's teams. Immediately expressing an opinion on the matter, we can tell you that we had quite a lot of fun trying to bring our blues to the top of the world, above all thanks to the variation of the gameplay compared to the basic one of FIFA 16. Women's football is in fact a little slower , with greater spaces in which to move and a series of modifications linked to the diversity of the woman's physique compared to that of the man, above all in terms of strength and explosiveness, without however affecting what may be high technical skills. The other important novelty is FUT Draft, a mode that falls within the world of Ultimate Team and with which EA Sports has introduced an alternative to obtaining rewards similar to the Hearthstone Arena: you pay an entrance fee (15,000 coin, 300 FIFA Points or 1 ~Spuffable~ Draft Token), you generate a team randomly and play matches until you lose, up to a maximum of four matches, to then get prizes related to the classic version of Ultimate Team . The formation of the team starts from the choice of the module, which can be carried out among five different tactics, to then put the players on the field in a similar way: for each position we are offered five possibilities, randomly generated among the many champions present in the database. Being a secondary mode of Ultimate Team, the Draft team is subject to the rules that define the amalgamation of the team, thus favoring formations that link the nationality or nationality of the militancy team of the members of our eleven: the player, therefore, the ability and the fun of putting all these pieces together. As for the prizes, these vary according to the level of difficulty chosen and the online or offline game, offering objects with an increasing overall value in step with one's successes. All of this is certainly not a revolutionary idea, since it draws on elements present in other games as well, and only partially succeeds in an attempt to give those who have never loved Ultimate Team a chance to try it: find a way to untie FUT Draft from the main mode would perhaps have helped more from this point of view. Speaking of Ultimate Team, we highlight the novelty that allows you to see the stars in possession of the opposing player, better preparing for the upcoming match. Let's close this initial roundup con Career mode, now a staple of the FIFA offline experience: the most obvious additions concern the summer tours, taken from the real world, together with the weekly training of the players in our squad. The latter can be seen as a sort of ~game within the game~, where you can try your hand at the FIFA 16 skill tests, giving a bonus to the statistics of the players involved if successful. The other novelties concern parts of this mode that contrasted a bit with real football, together with the inevitable tuning of the artificial intelligence that drives the simulation forward. As far as we're concerned, we continued to find it perhaps a bit too simple to start the match against Napoli, to sell players like David Lpez, Jorginho and Henrique at a price above their valuation, and then buy at an overall affordable cost a prospect like Rugani or a star like Rakitic. In the same Career, after a not exactly exciting start to the season, Belgium immediately called us on the national team bench: also in this case, it seemed to us a rather unlikely thing. As for the rest, the historic players of the FIFA series will have no difficulty in recognizing the modes already present in recent years, given that minimal operations have been carried out on the menus, changing shapes or colors here and there but leaving the already excellent feeling unchanged navigation. Xbox One goals FIFA 16 has a total of 48 goals, three more than the 45 of the previous edition, also thanks to the innovations introduced this year. In fact, there are objectives that reflect the gameplay of the more reasoned game compared to last year, such as the one that rewards a goal scored after about ten passes in the opposing trocar. A list of achievements dedicated to the FUT Draft mode cannot be missing, as well as to Ultimate Team in general: the objective that allows you to get more points is linked to this mode, which can be achieved by bringing a player to score 50 goals for his team . Women's football is invariably also included in the list of objectives, offering the player a series of rewards where we find the one obtainable by winning the category World Cup. Defense word The most insistent criticism leveled at FIFA 15 was related to the excessive efficiency of the fastest players, inserted in the context of a gameplay that was generally unbalanced in favor of attack. Having a striker with good sprint and intoxicating dribbling in the team could allow you to open any defense in the online game, especially in the Ultimate Team where some form values are modified compared to the basic ones: the result saw teams full of Doumbia, Ibarbo and the like , while people like poor Mertesacker found themselves unemployed for the whole of last season. Having become aware of the mistake made a year ago, for EA Sports with the new title the time has come to carry out a series of interventions intended to improve the general balance of the matches, returning if we want to the philosophy that also distinguished FIFA 14. great has been done for the defence, starting from an artificial intelligence which in general leaves fewer holes, managing to position whoever is in front of our goal in an optimal way. In fact, the mind of the virtual players has been given an excellent ability to read the opponent's attack, which allows them to place themselves in the middle of the passing lines to intercept the ball, make an advance on the occasion of a pass that allows it, or cover quickly a hole left by a mate. The differences from a physical point of view are now no longer felt only in favor of fast players, allowing the more rocky defenders to assert their size to make up for the difference in shooting with the opponent. If conceptually FIFA's tactical defense remains the one introduced a few years ago, in Vancouver they have also added a series of new commands, intended to increase the effectiveness of interventions: when making a slide, pressing once again the same key can tell the player to get up as soon as possible, thus continuing to follow the opponent without losing too much ground. Beyond the classic utility to clear the ball, this element also offers new ways of behaving on certain occasions: think of when our opponent is about to cross and we want to tackle, to prevent the ball from reaching the box. This was possible even before, but with the awareness that doing so meant permanently losing one of our defenders for the rest of the current action, which is no longer true now. By pressing the Y/triangle key it is inoIt is also possible to feign a sliding entry, thus trying to disorient the ball carrier to induce him to make a mistake. Let's not forget the goalkeepers: FIFA 16 full backs are more responsive than ever, especially on close shots where they are able to perform real miracles. Even if on the Internet there are those who swear that they have once again found ways to always score from a distance or from a certain angle, as far as we are concerned, we have not found elements of this kind that allow us to define the existence of a real problem like last year. If anything, a few too many mistakes can still be found in the outings: in the most striking episode, which remained unique despite the dozens of matches we played, the goalkeeper ran towards the attacker without then diving to the ground to catch the ball, becoming then pass easily while standing. Holly trains, with the FIFA Trainer Among the novelties of FIFA 16, we also find the so-called FIFA Trainer. It is a tool conceived by the developers to lend a hand to those approaching the world of football simulation for the first time, through a graphic element that accompanies the player we control on the field. At all times, we are offered a series of suggestions contextual to the phase of the game and the position of the player, such as the possibility of making a cross at the right time or shooting a shot. As regards the possible use by long-time players, for them the added value of the FIFA Trainer seemed to us quite small, if not zero. We go on the attack After what was described in the previous paragraph, you may have already guessed that FIFA 16 imposes a different style of play in the ball possession phase compared to its predecessor, especially if you were among those who abused the speed of the players. Finding spaces in which to slip into the race has become much more difficult than in the past, therefore making it necessary to maneuver a minimum in midfield to try to find the winning pocket. In response to this need, the developers have decreased the pace of the game, at the same time modifying the system that manages the steps, to avoid the so-called ping-pong passing. In the most difficult first touches to make, even the most skilled players can miss the pass, thus making it necessary to carefully evaluate the direction and timing in which the ball is being kicked in order not to risk losing it. What has been said so far could give the impression of a reversal of the gaming experience, i.e. unbalanced in favor of defense: to avoid this danger, EA Sports has given some new tools to the attack, represented primarily by a new type of pass tight and strong low shot. Its usefulness consists in allowing less time for the opposing defense to get in the path of the ball or to try to get ahead of the receiver. Like the other passages, this too must be used with due care, however, because the recipient must have enough space and skill to tame the sphere. The second new feature for attackers is dribbling without touching the ball, which consists of a series of body feints that can be activated by pressing the LB/L1 button: their use should allow the opposing defender to be disoriented, causing him to unbalance to one side or on the other. The new system naturally integrates with the existing feint system, offering the player a further possibility to overcome rivals, especially online or in any case against real opponents, given that the CPU proves, at least at the highest levels, that it is difficult to take our attempts. We take the opportunity to talk about the artificial intelligence of the opponents in FIFA 16, in our opinion still too immature despite the efforts of the developers: in fact, the teams controlled by the console always tend to play a game built on a dense network of passes, which can also go well when you face Barcelona, but it seems out of place when a small team is playing against us. Since this is a historical problem of offline mode, you will know what we are talking about, just as you will know the frustration that risks arising from the exaggerated tiki-taka opponent. Returning to the attacking phase, let's finally note the changes made to the cross system, to make the goal of the header viable again after FIFA 15 had made it almost impossible to score in this way. Lights at the San Siro The attention dedicated by EA Sports to the game dynamics of FIFA 16 is also reflected in the technical sector, where in terms of pure graphic detail we find few improvements compared to the", "date": "2015-09-22", "grade": "9.0"}