{"name": "Notti da campioni", "ref": "https://multiplayer.it/recensioni/156394-pro-evolution-soccer-2016-pes-2016-notti-da-campioni.html", "text": "Despite the advent of the new consoles, Konami, like the rest of the other companies, does not forget the still thriving market of the past generation, which can boast millions of users all over the globe, and also brings its Pro Evolution Soccer 2016 there. A game that, let's say it right away, does not present who knows what wonders or innovations, and which we could even easily define as a sort of upgrade of its predecessor, but still capable of giving the public a good gaming experience. Of course, Konami will still have to do a lot of work to get back to churning out gems like Winning Eleven 2000 U-23 Olympic on PlayStation, and Pro Evolution Soccer 2 on PlayStation 2, but as we have written on other occasions, the road taken by he Japanese company is the right one, at least on Xbox 360 and PlayStation 3. Let's see together why without forgetting to point out our review of the PC, Xbox One and PlayStation 4 versions. Even on old-gen PES 2016 it can give great satisfaction, even if it is never completely convincing Curiosity Konami has acquired the Euro 2016 license, which will guarantee the company in the future to exploit the official brands, names and logos of the competition and of the twenty-four participating national teams. The tournament, however, is not contained within PES 2016, but could arrive in the future in the form of DLC or in a standalone game. The season begins Before starting to sift through modes and gameplay in detail, let's talk about official licenses. In this sense, Pro Evolution Soccer 2016 can boast the absolute exclusivity of those relating to the UEFA Champions League, the Europa League, the AFC, the Copa Libertadores, the Copa Sudamericana, up to the European Super Cup and the Club World Cup. To these are added the full ones for the Spanish, Dutch and French championships, those of the Italian (except Sassuolo) and Brazilian Serie A for the teams only (both tournaments lack the official names and the Lega Calcio and Brasileiro logos), and so Street. The English tournament is still out of the running: although the players' names are all faithfully reported, the only team to appear with official names, flags and uniforms is Manchester United. Almost the same situation for the Portuguese league (three licensed clubs) and the Bundesliga, where we only have Bayern Munich, Wolfsburg and Borussia Mnchengladbach as officially licensed clubs. The same goes for the South American tournaments and the various B series. In any case, teams (rosters not updated, with Di Maria still at United and Pirlo and Tevez at Juve) and events are available in the various game modes selectable through the now classic mosaic interface. In addition to the traditional exhibition games and competitions available in all guises, there are free training sessions and specific ones where you can learn all the novelties of the gameplay in the best possible way through a complete tutorial. Then we have the Championship Mode, enriched by the presence of the second leagues of England, Spain, Italy and France, and within Mondo Calciatore the classic Master League, which has a similar structure compared to last year, but with the addition of some options and a restyling of the menus made clearer and more accessible. Likewise, Become a Legend is basically the same as in the past, except for a few tweaks here and there in the options. For online play there's myPes with its mix of manager and field play, then ranked matches, tournaments and community, but with more options to customize your matches against other players, lobbies and anything else. As for the older brother, also in this case we unfortunately were not able to thoroughly test the online modes, which is why we refer you to the special future, where we will try to properly evaluate the netcode, balancing and game structure of the individual offers. Team play Closed the large parenthesis dedicated to the modalities, let's now find out what the gameplay has in store for us. The playability, we say it right away, doesn't actually present any particular upheavals compared to the 2015 edition, but only some tweaks here and there. However, these adjustments make the game much more satisfying from a simulation point of view. The feeling you get after the first matches is that of having good control over the virtual players, more reactive to the ~orders~ received, and over what happens on the turf, at least using the manual settings (with the assisted ones it becomes otherwise simplified and a a little less satisfying). Shots, plays, passes, everything becomes more fun, above all because then there are teammates able to ~read~ and decently support the action thanks to good artificial intelligence, which therefore guaranteesi greater variety in maneuvering. In fact, at the level of collective play, the teams act in this way according to what happens during the match: in the attack phase, for example, it is possible to witness sprints, unmarking and overlapping functional to the scheme and strategies adopted by the user or by the opposing coach. In the same way, both the individual player and the group, understood as a defensive package, react more convincingly to dangerous situations in the cover phases, closing the gaps well or occupying the space between the ball and the possible trajectory of a possible pass. Of course, there are occasional drools, especially in the centre, as well as between the posts. From this point of view, goalkeepers tend to give more guarantees than in the recent past, but they still tend to commit some ingenuity in exits or during certain desperate attempts to recover the ball once they have been overtaken. In this sense, during our tests we witnessed helplessly Buffon who, in an extreme attempt to kick away the ball that was slowly rolling into the net behind him, threw it himself awkwardly into the goal. And then there are the champions. Because if it is true that in Pro Evolution Soccer 16, as indeed in real football, tactical organization and teamwork are fundamental elements to give the champions the opportunity to express themselves at their best, it is also true that these can make the difference at any time, inventing a play capable of solving the match. To ensure that this can also happen in the video game there is the Player ID, the technology that allows you to have the most important athletes of international football digitally reproduced, with their appearance, way of thinking and acting on the basis of parameters that reflect , or should, those of the real counterparts. Therefore, Cristiano Ronaldo's sudden accelerations, Messi's free-kicks from the edge or Pogba's shots from outside the area can also occur on the virtual pitch, and become useful solutions in particular moments of the match. But without exaggeration, given that the full-speed ball and chain buck are just a memory already from PES 2015, let alone here where the action is made more difficult both by the attention of the opponents, as mentioned before, better placed on the pitch, and by the new physics, which makes it difficult to escape a mark even with precision dribbling. Indeed, to say it all, when you find yourself in front of people like Chiellini or Benatia, that is athletes with a certain physical strength, it becomes really hard to pass. Unless you are called Ibrahimovic or Benzema, and therefore have a physique capable of withstanding the impact of two ~beasts~ like the defenders mentioned above. This is because PES 2016, while boasting an excellent collision system, seems too biased in favor of ~massive~ players, at least on the higher difficulty level. And considering that the referees often seem distracted and don't blow their whistle, this can be frustrating if you use teams that prefer technique and have smaller players on their roster. Xbox 360 goals There are a total of 40 achievements available in the game, for a total score of 1,000 gamerscore. To unlock them you need to meet certain requirements, such as winning the Champions League, becoming the best player in Become a Legend mode or climbing the different divisions of myClub. The show on TV Everything we have described so far is presented again with a direction worthy of a television production. The exultation of the players after a goal, which can also be managed directly with the pad (two that can be alternated in real time by controlling the player), the replays, the audience frame, everything is designed as always to enhance the aesthetic component of the game and give the typical atmosphere of a football event broadcast on TV in the best possible way. From a graphic point of view we have no striking changes compared to last year, it is true, nor the detail of the next-gen counterpart, but what is offered to us by Pro Evolution Soccer 2016 at 720p is still a good show. Especially for the reproduction of the faces of the most famous footballers and game uniforms, at least those covered by an official license. The work done by Konami is also good on the animations of the athletes, with particular applause for those of the most acclaimed champions. However, one cannot complain even for those of less famous players, who, despite not making people cry for a miracle, are still more varied and natural than in the recent past. The goalkeepers, like last year, seem to leave something to be desired in mid-height dives and kidney shots, where they seem to go down slowlymind. As for the weather, the rain effect is nice, which really affects the physics of the ball, making it a little more difficult to control the trajectories it takes, and the reproduction of most of the stadiums: as per tradition for the series, there are few, and there are some that stand out over the others for their beauty and fidelity to their real counterparts, such as Manchester's Old Trafford, Munich's Allianz Arena or Turin's Juventus Stadium, while others are more anonymous, and we're not just referring to generic ones. Too bad for the absence of the Spanish ones. The choreographies created in the corners by the fans, who interact with what happens on the field also with gestures and chants, are particularly apt. In this sense, the title offers a fairly complete and varied set of sounds, certainly such as to faithfully reproduce the typical noises of a football match. So there are choruses that don't jump out at random but always at the right moment, to accompany the home team with lots of applause during the hot stages of a match, perhaps while they try to blockade the opponent's goal to try to unlock the challenge or, vice versa, to underline the opponent's maneuver with heavy ~howls~ of dissent and fear. Dulcis in fundo, the commentary signed by Fabio Caressa and Luca Marchegiani, which continues its evolution by introducing new sentences and exclamations, making the gaming experience even more enjoyable despite some errors in the commentary and a not always constant rhythm. Final note dedicated to the soundtrack, really spot on with the revived and motivating We Will Rock You by Queen, which historical fans of the saga will remember being featured in the introductory film of Pro Evolution Soccer 2, or with the hits Clean Bandit by Rather Be ft. Jess Glynne and Broken Bells' After the Disco, to name but a few.", "date": "2015-09-21", "grade": "8.2"}