{"name": "Strategia e arte", "ref": "https://multiplayer.it/recensioni/156053-armello-strategia-e-arte.html", "text": "Launched a few months later than the estimated date, Armello is the classic independent project born under a lucky star, able to establish itself in dedicated fairs, brilliantly overcome the inevitable Kickstarter campaign and successfully land in the Early Access phase on Steam. The idea of League of Geeks, a small Australian software house, was so appreciated at home that it received substantial funds from a couple of government agencies, i.e. Screen Australia and Film Victoria, which in fact allowed a significant evolution both from the from an artistic and logistical point of view, also favoring the landing on different platforms (in the beginning it was born as a project for the iPad) and the translation into multiple languages, including our language added with the launch patch. The enthusiasm and support that surround Armello are at least curious, considering the orientation of the modern market and the fact that it is a sort of board game in which role-playing game elements and the tactical component of card games converge, nevertheless we are faced with a product with dark and fairy-tale tones capable of ensnaring the player with its refined elegance, supported by an excellent conceptual design and, above all, by a profound strategic soul. Easy to play but difficult to master, as the promotional motto stands out, the work of League of Geeks had also fascinated us in our previous test, and now we can only confirm its very good qualities. Elegance, passion and poetry in Armello, the fairytale strategy game created by the League of Geeks At the East Fair The proud and mighty king of Armello, a lion, has fallen ill with a dark evil power called Rot (Rot in the English version of the game), a physical and mental plague that has driven him to madness and will soon lead him to inevitable death . Danger and corruption sweep across the realm, prompting four powerful animal clans to send their best representatives on a noble and fearless quest to dethrone the ailing king and restore order and balance. This, in a nutshell, is the incipit of the plot that will lead the player to challenge himself and the other pretenders to the throne on the dangerous Armello board, full of traps and obstacles but also opportunities and treasures to discover. As specified, the title is rather complex to master due to the numerous ingredients that make up its solid strategic recipe; fortunately there is a substantial prologue divided into four acts, dedicated to the presentation of the main heroes and the introduction of gameplay dynamics. Each character is characterized by values that significantly differentiate him from the others, favoring one approach to the game rather than another. The basic characteristics common to all, but distributed in a specific way, are the number of dice that can be rolled in battle (Combat), the maximum number of cards that can be transported (Wits), the vitality (Body) and the Spirit, or the ability to cast spells through an affinity with the Wyld, Armello's magical aura that shares several traits with the Force from Star Wars. Thane, the sword-wielding wolf, has good combat value, for example, while Sana the bear is more oriented towards the Spirit and therefore in the use of spells. In addition to the aforementioned characteristics, each character has affinities related to their own clan, such as better effectiveness in acting by night or day, plus four other fundamental parameters in the global economy of the challenge: gold is the currency of Armello and can be spent, lost and gained in various ways, such as by exploring Dungeons and completing Quests; Magic, whose level is aligned every night with that of the Spirit, is the main resource for casting Spell cards; Prestige is obtained by performing various tasks - for example by defeating enemies - and is a critical value both for obtaining the final victory and for managing the so-called King's Proclamations, which we will discuss shortly; finally, the Rot represents the level of corruption of the player, which can also be managed to win the game. Before each session, the player can equip seals and amulets, which grant benefits such as better stats or greater effectiveness in overcoming certain obstacles on the map, such as mountains and swamps. To enrich the whole we take care of the cards, as specified linked to the Ingenuity of the character and divided into various types. Item cards provide useful tools in battle such as swords, bows or shields and grant additional dice in combat; Follower cards allow you tohave adventure companions, also of support during the clashes; Trick cards are linked to traps, special abilities (such as invisibility) and political moves; finally, the Spell cards activate various offensive and defensive powers related to magic. The cards can be applied to the characters or to the squares of the board, for example generating the so-called ~Dangers~ which must be faced exactly like battles, i.e. with the roll of the dice, whose faces have six specific symbols (Sword, Shield, Sun , Moon, Wyld and Rot) each with its own meaning. The Rot, represented by a worm, is for example the classic missed target, the shield is a point in defense, while the sword is a point in attack. The sun is an attack by day and a miss by night, the moon works exactly the opposite. Finally, the Wyld tree is the most powerful symbol and in addition to providing one point in attack, it gives a bonus dice to roll. Power struggle The single game, which lasts about fifty minutes, takes place through the traditional rounds, where the number of steps that can be taken on the board is linked to the so-called AP, the Action Points. The squares, procedurally generated at the start of each new game, are divided into different types and each of them has its own bonuses and maluses: swamps, for example, take away one life point from anyone who crosses them, mountains require two Points Action to be overcome but offer a defensive shield in case of attack, while the Dungeons can hide treasures or dangers. In addition to the opponents of the other clans, on the board you can also come across the Scourges, or creatures generated by the Rot, and the King's guards, which possess specific characteristics in combat. Each player can also follow their own Missions, simple dynamically created quests that are useful for obtaining gold, precious objects and the aforementioned Prestige, through a system of safe or risky choices. At the center of the board is the King's Palace, whose main tenant is affected by the Rot and is destined to die in nine days, which mark the eighteen rounds of the challenge. Because of his madness, every new day the King issues a so-called Proclamation, an edict that can have significant effects on the balance of the game. The most interesting aspect lies in the fact that the player with the highest level of Prestige at that moment is invested with the role of adviser, and will have to choose between one of the two proclamations proposed by the King, which could result in a monetary or Prestige duty for all contenders. The final victory in Armello is by no means easy, given that you have to think like in a game of chess and have a lot of luck (even too much) with the cards and above all with the roll of the dice to get the better of dangers and opponents. To reach it there are four different ways to follow: to obtain the Political Victory you must wait for the King to die due to the Putrefaction, while maintaining the highest value in Prestige among the contenders; Victory as a regicide is achieved by breaking into the King's palace and defeating the ruler in battle, a goal difficult to achieve without stats of a certain weight; the Victory of Corruption is similar to that of regicide but it is necessary to kill the King with a higher Rot value than his own (this will transform you into the Lord of Corruption); the Spirit Stone Victory, the most elegant of the lot, is linked to the collection of the four Spirit Stones scattered around the board, useful for purifying the King from Rot. The variability significantly increases the strategic depth of Armello, which also pushes you to take all the roads to achieve victory, given that by centering it with different techniques, specific jewels and amulets are unlocked for each of the eight characters present. The work of League of Geeks shows its best by playing against three other human opponents on the net, exponentially raising the challenge rate and the tactical approach to the game, with the possibility of also creating (ephemeral) alliances. Art at play Although it is not a particularly demanding product in terms of hardware (just read the box below dedicated to system requirements), we are dealing with a real work of art as regards the designs, especially those dedicated to cards. Handmade by artists from all over the world and often animated, they are characterized by a level of care and elegance even higher than that of much more famous and well-known products. The same can be said for the visual rendering of the battles, which are also characterized by curatissimi animated drawings that are somewhat reminiscent of the Disney style. The three-dimensional characters in cel shading are excellently modeled and animated, while the board where they move and fight is rather stingy with details, resulting overall not particularly captivating. This solution undoubtedly increases the visual understanding, however it is an aspect that clashes with the goodness of the elements in two-dimensional graphics. The sound effects feature very solid and impactful sampling, while the orchestral soundtrack is a significant added value, thanks to the melodies traced by artists such as Michael Allen, Jacek Tuschewski and Lisa Gerrard.", "date": "2015-09-15", "grade": "8.3"}