{"name": "Il calcio secondo PES", "ref": "https://multiplayer.it/recensioni/156019-pro-evolution-soccer-2016-pes-2016-il-calcio-secondo-pes.html", "text": "When launching the Blu-Ray (or the cold hard drive executable) of PES 2016 for the first time, one immediately perceives a sinking heart: the opening movie is accompanied by ~We Will Rock You~ by Queen, the same song that sanctioned the successes of that great title that corresponds to the name of Winning Eleven 2006 (and PES 2). This edition arrives in the year of the twentieth anniversary of a series that has delighted us for many seasons with undisputed masterpieces of fun and involvement within the panorama of football simulations: starting with Goal Storm which proposed Riggio and Coliuto instead of Baggio and Radishes, passing through ~artisanal~ online connections on PC for remote play, up to many other chapters that have marked a generation of videogame football enthusiasts; without forgetting the stainless voice of John Kabira in the Japanese counterparts. To then go through a rather long period of crisis coinciding with the arrival of PlayStation 3 and Xbox 360, and a lot of effort to get back on track while the competition gathered approval after approval, bypassing Konami's simulation in terms of criticism and sales. Last year, with a decidedly wise choice in our view, the developers decided to postpone the release of the game by a few weeks, in order to renew its foundations and make the most of the Fox Engine - the same graphics engine that ~ moves~ Metal Gear Solid V - capable of returning an important graphic sector and, above all, no longer suffering in terms of fluidity, which had also plagued the saga in its last iterations. Net of the endemic problems related to licenses and online play, Pro Evolution Soccer 2015 finally marked the trend reversal much desired by historical fans and enthusiasts of the genre; a successful and exciting return to the basics, which if you like has only scratched the surface of a gameplay capable of leaving an excellent aftertaste and foreshadowing great things for the following chapters. We put the 2016 edition of PES under the knife, between joys and pains of gameplay Roller coaster Last year's relaunch produced a long wave that PES 2016 tries to ride as much as possible, to put a patch on the few months available for development (remember that the 2015 version only came out at the end of November). Polishing up the new graphics engine and improving many aspects of the title, especially related to the gameplay and the feeling with the ball, required a good deal of extra work, but the response from the community was positive and so Konami went straight shaping with even greater accuracy a football simulation that is always fun and capable of offering a good degree of realism and depth. Once on the pitch, a couple of passes are enough to rediscover the flavor of virtual football from the Rising Sun intact, with the player's ability to dominate in creating complex and spectacular choral actions, without necessarily having to get the ball in the goal by performing in a series of twisted juggling commands. The reactive and precise controls leave it up to the player to make the most of the unique characteristics of each individual player which, however, must always be made available to the team if you want to overwhelm the opponent. Protecting the ball while waiting for a teammate to arrive, dribbling a defender to create numerical superiority and exploiting the spaces by sprinting deep with the right timing are actions that give satisfaction as well as requiring that skill we were talking about previously; not so much in frantically dancing with his fingers on the keys, but rather in knowing how to read situations and the behavior of the players on the pitch. The manual settings remain preferable to avoid the predictability of the game action, just as it is natural that the strongest players have an advantage in certain situations, but the balance has been further refined and if on the one hand the Player ID reproduces the most famous athletes, on the other hand there are a whole series of adjustments aimed at avoiding its overwhelming power. It's no news that Ibrahimovic makes the department alone, exploiting his physicality to make room for his opponents and allow his teammates to go up, but the defenders don't let themselves be asked when doubling, trying to limit him as best as possible. Let me be clear, when the winning cue is found with a deep pass or a high through ball, it remains devastating with shots from outside the box, which however gradually decrease in effectiveness as fatigue arrives. The excellent physics of the ball then plays a fundamental role in terms of rebounds and heaviness, complicating control especially in grapplingrain, present again in PES 2016. The slippery field accentuates the inertia of the ball which tends to splash away during dribbling, complicating control by players who are more awkward in their movements, but still reactive. In this sense, however, we have noticed an excessive tendency to slip on the occasion of restarts or changes of direction at speed, in some cases discovering defensive holes that are very difficult to heal even by calling on the pressure of a teammate to support. Furthermore, some automatisms remain during throw-ins or tackles, with the players who in the first case automatically run towards the ball remaining victims of inertia, and in the second they lose precious seconds getting up instead of sprinting to their feet and continuing to attack the ball. Another mole that has been reiterated for years and never completely resolved concerns the goalkeepers, who suffer from too many amnesia this year, especially when there are defenders nearby; if necessary, the possibility of managing them manually remains valid. We have noticed a good reproduction of the behavior of the most famous full backs such as Buffon or Neuer, who will not fail to perform daring plays outside the box; however, the problem of reactivity arises a bit for everyone, when the forwards fire their shot inside the area: goalkeepers tend to throw themselves to the side when the ball is already nearby, opening up the side - this is the case with say it - to pretty easy goals in these sorts of situations. Do we have whistles? With the lack of the notorious tracks, the ball control phases are tantalizing and congenial to the choral action, supported admirably by the excellent work done by the developers in creating a solid and recognizable team identity. Team ID is reconfirmed which, through complex artificial intelligence routines, tries to best reproduce the game philosophy of real teams, but it doesn't work only with the strongest clubs. In addition to the suffocating ball possession of Bayern Munich and Barcelona, the aggressive plays of Paris Saint German and the sparkling actions of the English teams, even the smaller teams have shown a good variety of dynamics based on the situation. Meeting a small team in the league almost certainly means finding yourself in front of a shrewd team, who bet everything on the defensive wall and counterattacks to put us in difficulty, doubling or tripling on the players who dictate the pace of the action to bring home the draw and one point in the standings. However, the same team will not be afraid to face us head on if we are talking about a qualifying round of the national cup, where the inside/outside situation leads them to be more offensive, only to then lock themselves in if they have an advantage. In the same way our companions constantly accompany the action, creating enveloping maneuvers embellished with triangles in the strait, potholes and accelerations to attack the open spaces. In short, a system that makes the collective react in a plausible and dynamic way, which can be customized from the management menu to give a more personal imprint that reflects your style of play, varying patterns, modules and position on the field of each individual member of the team. All this is favored by the pace of play, one of the aspects that we had most appreciated in the previous title, which in PES 2016 is slightly faster, translating into more frequent front changes and influencing above all in the phases of ball transfer in the center field, where playing horizontally or lowering the center of gravity can prove to be a double-edged sword especially due to a decidedly problematic collision system and refereeing. If the first practically always tends to favor the most powerful and vigorous players, the situation is aggravated by the fact that this year the whistles seem to be particularly silent and if Konami does not decide to intervene in this regard with a balancing patch, the controversies they won't be long in coming. Without mincing words, the two things put together tend to unbalance the gameplay and undermine the good things described so far, especially when you raise the difficulty level of the artificial intelligence or start playing against human opponents who exploit this flaw to their advantage of the game system. Controlling a physical team, putting a very aggressive pressure on the defenders almost always pays off given that with the double pressure of the X button the referee will hardly stop the game and the more performing player will always find himself with the ball at his feet, ready to strike the 'action. In a confrontation on paper that tends to be balanced like the one between Real Madrid and Barcelona, the Blaugrana are constantlyyou in possession of the ball, with Rakiti, Iniesta, Messi and company forced to bet everything on fast counter-attacks to surprise the opposing defense and create a goal-winning action. Prolonged possession of the ball, a trademark of the Catalans, is constantly annihilated by aggressive and unpunished tackles, and this happens whenever teams with different physicalities are faced: the bigger ones win. Likewise, the yardstick on tackles is too permissive, with tackles only called if they are serious enough to deserve a card. However, it also happened that the referees ignored blatant interventions on the ankles of the footballer, denying not only punishments but even penalties and related cards that would have inevitably marked the progress of the match. These painful edges are partly not exploited by artificial intelligence, but against real opponents (where, let's face it, we are all much more competitive) we are sure that the matches will soon become ~scuffles~ influenced by the lack of referee decisions, undermining some ' the fun. A pity because, never like this year, the collisions have an enviable precision and give a decidedly realistic sense of fullness in the contacts. Resolution issues We tried PES 2016 in the PlayStation 4 version at 1080p and 60 frames per second, but it is confirmed that Full HD has not been achieved on the Microsoft flagship, given that the vertical resolution has 1080 lines of pixels, but the horizontal one only 1360 per second. instead of the traditional 1920s. It is not possible to quantify the difference in terms of visual rendering without trying it firsthand, but despite the promises made by Konami on the indistinguishable quality between the two consoles, one wonders why they have not yet managed in the second year to do not match the pixel count on the two consoles, also given the decidedly affordable PC requirements. We will return to this latest version shortly to understand the difference in technical and gameplay terms compared to that console; to conclude the overview, PES 2016 will also be released on PlayStation 3 and Xbox 360 in 720p resolution. Licensed and not Even the walls know that Konami does not have access to many of the licenses linked to the major clubs and leagues, also due to exclusive agreements by the competition, but for the record, we cannot help but underline this from year to year, dreaming of a competition between the two football giants based more on gameplay than on the amount of content on the game disc. PES 2016 will arrive in stores thanks to the licenses relating to the UEFA Champions League and Europa League - both recently renewed until 2018 and the real strength of the game, thanks to a simply exciting atmosphere for all football fans - alongside the AFC, the Copa Sudamericana and the Copa Libertadores, with the relative participating teams. To these are added the Argentine, Dutch (Eredivisie), Spanish (Liga BBVA and Liga Adelante), French (Ligue 1 and Ligue 2) championships, all fully licensed both as regards the logos of the competition and the teams that are part of it . The Brazilian and Italian championships, on the other hand, do not have official names and logos, but all the teams are regularly licensed, with the exception of Sassuolo which has become Sansagiulo. In this case the names of the players are real, while everything else is the result of the imagination of the developers. The same goes for the Serie B formations and almost all of the other European teams. In the two divisions of the English championship only Manchester United is saved, while for Portugal there are SL Benfica, Sporting Lisbon and FC Porto. The Bundesliga is missing, with only Bayern Munich, Wolfsburg and Borussia Mnchengladbach representing the German championship, to which are added Zenith St. Petersburg, Olympiacos, Sparta Praha, Basel, Ghent and Dinamo Kiev to complete the roster of European teams. Also this year the squads on disc will have to be updated with the Day One patch available from 17 September, which will fix all the transfers of the transfer market. The Editor is back with the possibility of importing images into the game also on PS4, leaving the community free to indulge in the creation of logos and game uniforms to patch up the licenses that can be improved. Where Konami didn't particularly squeeze is in the graphic design of the menus and in the modalities, similar to those of the previous year. We have restored the mosaic interface divided into sections for the various careers and competitions, with the home screen collecting the most recent choices. In addition to the classic exhibitions and licensed competitions, cups and tournaments p", "date": "2015-09-14", "grade": "8.2"}