{"name": "Vivo o non-morto", "ref": "https://multiplayer.it/recensioni/155982-unkilled-vivo-o-non-morto-tu-verrai-con-me.html", "text": "It is not clear why the latest title from MADFINGER Games is called Unkilled instead of Dead Trigger 3, considering that we are faced with a product extremely similar to the one we tested a year ago. The main theme, with the invasion of zombies and the hero who is facing them, is the same, but above all the controls and the interface are practically identical, although there are more concessions to the freemium vocation of the game. Downloadable for free from the App Store and Google Play, the shooter uses mechanisms similar to those seen in Glu productions, with weapons to be constantly upgraded in order to access missions and the traditional two currencies, hard and standard, to regulate both the unlocking of objects that the timing relating to the application of the upgrades. All this is supported by the now classic action energy bar, which consumes one or more bars with each attempt and requires a few minutes to recharge, or to watch short advertising trailers. Let's say it right away: although from this point of view the guys at MADFINGER Games have pushed a little more towards monetization logics, Unkilled remains a title that can be played without problems even for free, provided you don't expect very long sessions, and therefore limiting yourself to relatively limited use. Unkilled is a solid and fun shooter with excellent controls and hundreds of missions I'll kill you again As already mentioned, the experience of Unkilled is completely similar to that of Dead Trigger, although considerable efforts have been made in terms of structure: there are three hundred missions (albeit in their brevity), there are more than fifty weapons obtainable and the stages boast a minimum of variety, ranging from those in which you simply move from point A to point B slaying zombies to those in which you must resist almost endless waves of undead until reinforcements arrive, then arriving at the missions spare, to those with ~fixed view~ and to the bosses. The automatic fire solution, which completely changed the cards on the table with the previous MADFINGER Games title, is confirmed as highly effective in guaranteeing dynamic gameplay, in which enemies can have a minimum of inspiration rather than stand still waiting for our bullets, and our character can in turn move within the scenario to adopt an approach that is not necessarily one of waiting or charging head on. The initial perplexities about the degree of challenge disappear in the more advanced missions, in particular due to the damage coefficient of our equipment, which must always be kept up to date, even at the cost of doing a little grinding by replaying already completed levels. Of course, there is a lack of substantial innovations, and this is probably the only great flaw of Unkilled. Technically, in fact, the game is excellent, thanks to the definition of the textures and a good lighting system for the surfaces, where the polygonal models often reveal a few too many edges.", "date": "2015-09-12", "grade": "8.0"}