{"name": "Idol per le masse", "ref": "https://multiplayer.it/recensioni/155473-idol-magical-girl-chiru-chiru-michiru-part-1-idol-per-le-masse.html", "text": "At first we thought we'd review the two parts of Idol Magical Girl Chiru Chiru Michiru individually, Front Wing's visual novel brought to the West by the usual Sekai Projekt. However, we soon realized that it was not possible to do it, because in reality it is a single work divided into two parts, which tells the story of fourteen-year-old Matsushima Michiru and her dream of becoming an idol, i.e. a very famous and appreciated young singer for her voice, her grace and her looks. If you are familiar with Japanese mass culture, you will know that idols and idols are a phenomenon that has been haunting the archipelago for years and that they are timidly trying to spread in our area as well. Returning to us, unfortunately for Michiru the situation becomes complicated almost immediately and, after a series of unfortunate events, she is invested with a role that is really close to her: the savior of the world from the forces of Chaos. Too bad Michiru is the laziest girl on the planet! Without going into details so as not to spoil the rest of the already slender plot, let's say that ours will have to deal with many dangers, but above all with many funny situations, along the thirteen chapters that make up the corpus of the visual novel, seven of which are visible in the first part , with the remaining six left in the second. The comedy tones of the story are also seasoned with very sexy situations (nothing pornographic, don't worry) and with a very light writing, which honestly does not honor the Fruits of Grisaia, of which Idol Magical Girl Chiru Chiru Michiru is a spin -off. In short, here the linguistic register adopted is more light-hearted and, despite the presence of serious moments, especially in the last chapters, one never goes beyond a certain superficiality of manner, a fact that will certainly disappoint those who love the deepest visual novels. The characters themselves are characterized by mimicking some typifications much loved by the Japanese and by fans of the genre, without adding or removing anything from formulas seen in a thousand other works (not just visual novels). In short, we are faced with what the moderns call ~fan service~, but which in general we can define as an extremely commercial product designed to satisfy its audience, with continuous winks at its most tested expectations. We reviewed Idol Magical Girl Chiru Chiru Michiru, a visual novel starring an idol A few more details There is very little left to say, given that in terms of enjoyment Idol Magical Girl Chiru Chiru Michiru looks like the most classic narrative visual novel in which the player's only goal is to read the texts, look at the drawings and follow the story. There is no form of interaction with the plot, which is completed in about ten hours. Obviously the duration must be calculated by adding both parts from which it is composed, parts that are strongly recommended to be taken together, since it really does not make sense to buy only one. In fact, one wonders why they have not been joined, also given the price at which they are sold ( 19.99 each). It is true that we are dealing with a niche genre and therefore it is not possible to sell similar titles at too low a price, but in this way one feels decidedly cheated, because it is clear that one part cannot exist without the other . For the rest there are all the comforts typical of the genre, such as the key to advance the texts automatically or the one to scroll them at great speed, but that's all. Ah no, actually there is one last caveat regarding the language of the game. It is certainly redundant to write it, given that those who follow visual novels know that they are usually not translated into our language, but it is better to underline the absence of Italian from the texts. In short, you have to know English to understand Idol Magical Girl Chiru Chiru Michiru, like almost all the other best visual novels on the market, in fact. In Italian there is very little.", "date": "2015-09-03", "grade": "6.5"}