{"name": "Sunday Gold", "ref": "https://multiplayer.it/recensioni/sunday-gold-recensione.html", "text": "How do you mix a graphic adventure with an RPG? BKOM Studios has decided to answer this essential, almost existential question, attempting an original, but not very easy way to go, for a half-successful result, as we will see in the Sunday Gold review. History Sunday Gold's graphic style is great Stylistically and narratively, Sunday Gold works really well. The story it tells isn't exactly very original and perhaps there is an excessive use of genre film clichs, but the choice to use such a style marked by a genre comic, which is reflected in every aspect of the game, is really successful and engaging. The story follows the story of three small-time criminals, Frank, Sally and Gavin, who have a brilliant plan to get rich: discover the secret deals of a billionaire. The story has been modulated on different tones and mixes satire and drama with great wisdom, seasoning everything with a pinch of black humor. The visual style helps in this sense, because it manages to connote the events more than the story itself (which is very linear). Also noteworthy is the amount of documents scattered throughout the areas, which reveal interesting details about the secondary stories that underpin the game. The three characters of them are not particularly brilliantly written, but they work very well as a team: Frank is the classic small-time criminal master of urban survival, capable of picking any lock; Sally is a woman of exceptional strength, while Gavin is a former employee, who wants to use his computer skills to frame his old employer. Their differences of views on the heist and on the world emerge clearly in the course of the adventure, also creating branches in the story that can lead to some interesting results. Adventure Some events are told in comic style The characters all have different abilities that they can use at various points in the exploration and combat phases. There are those who are more versed in hacking and can therefore more easily violate electronic systems, there are those who have great strength which they can use to move heavy objects (for example wardrobes) and those who are good at opening any door lock. The special abilities of the characters are linked to mini-games, such as Gavin's hacking, which requires you to discover the security code of the electronic system you want to break, or Frank's break-in, which requires some manual dexterity . The progression of the three characters can be managed with an eye to the role-playing game system, but always taking into consideration the adventure part. In this sense Sunday Gold turns out to be one of the most successful mixes of the two genres, although it fails to completely resolve some frictions in the different systems. One of the key aspects of the gameplay is time management. Each of the characters has a certain amount of action points to spend per turn, to do different things, be they scouting environments, using certain skills or performing scenario-related actions. The exploration phase works really well Considering the point and click interface, so far it might seem like we are dealing with a normal graphic adventure with RPG limits, were it not that the passage of time is marked by other occurrences, such as the so-called alarm level, which indicates the awareness that the security personnel have of our presence and that grows from shift to shift. This means that the more time we spend in a certain place, the more fights we will have to face. The idea itself works really well and adds a certain tension to the exploration phases, where you have to find the right balance between the desire to discover everything and the induced rush from wanting to avoid fighting too much. Thus, for example, every mistake is not paid only in terms of wasted action points, but also in having to then choose whether to try again or not, using other action points. Here another mechanic intervenes to complicate things: panic. Mental health One of the pages with the characteristics of the characters Each character has their own mental health bar which is altered by in-game events. A panicked character will have strange effects on gameplay. For example, he may have strange visions, including imaginary enemies, he will read distorted texts (and we with him) and he will tend to act in a reckless, often erratic way. On paper, mental health should add a level of complexity to the game, in practice it works in a much more superficial way than you would like, ending up being almost passable when you understand how equilibrala it without too much effort. Moreover, the game is literally full of objects that help to recover sanity, so much so that even when panic is used at a narrative level to create a particular moment, it ends up being buffered with consumables without too many problems. Role playing game We fight frequently If we were to judge Sunday Gold by limiting ourselves to what has been described, we would define it overall as an excellent game, albeit with some critical issues to fix. Unfortunately, the role-playing game mechanics take care of extinguishing the enthusiasm, which evidently cannot fully express themselves. Not that there's anything wrong, just that it's all too superficial, starting with the equipment, which doesn't offer any particular gameplay cues (you just have to select the one with the highest values and live happily). passing through the skill trees, which at a certain point in the game ~run out~. That is: having chosen a certain progression, we reach the end too soon and we are therefore forced to assign the subsequent points to skills of which we are not very interested, just to not send them to waste. The last problem, the biggest, is represented by the fights, which are very repetitive and too long, with the enemies that are real bullet sponges, capable of taking many hits before going down. The system mimics that of classic Japanese role-playing games, with the characters acting in turn according to the initiative, but it is much slower and more cumbersome, so much so that we often end up fearing the fights more for the time they waste and the tedium , than for the risk that some characters end up killed.", "date": "2022-09-13", "grade": "6.5"}