{"name": "Strada in salita", "ref": "https://multiplayer.it/recensioni/155494-the-walking-dead-road-to-survival-strada-in-salita.html", "text": "Anyone with the slightest familiarity with The Walking Dead series will certainly have heard of the figure of the Governor, one of the main antagonists of Rick and his companions: The Walking Dead: Road to Survival here is built around this figure, being set in the period that saw his arrival in Woodbury and his subsequent and bloody rise to power. All duly disguised behind a free to play that combines base building mechanics with a turn-based RPG-inspired combat system: will it work? Back to Woodbury The illusion that The Walking Dead: Road to Survival can tell a really interesting story runs out after a few minutes of play, when it turns out that the narrative component is little more than a pretext to connect the different souls of the gameplay: there are sequences of 'fixed interlude, dialogues between the various characters and even situations that require the user to make decisions relating to certain events, but these are intangible elements that seem to have no importance in a product that is too busy pouring all its content. As mentioned at the beginning, the essence of The Walking Dead: Road to Survival is that of a base building along the lines of titles such as Clash of Clans and company: it is therefore necessary to expand and administer the fortified town of Woodbury, building housing and infrastructure and collecting the materials, always keeping an eye on the resources at one's disposal and the needs of the citizens. In this respect, the title follows the dictates of modern free to play to the letter: each action is marked by a countdown that can be reset by spending the appropriate gold coins, given sparingly during the game and instead very easily purchasable with real money from the internal store to the application. In addition to speeding up the processes that gradually lengthen during the adventure, this currency is also used to buy extra content packages, which can include rare weapons or characters with special abilities drawn from the main protagonists of the comic. As often happens in similar titles, The Walking Dead: Road to Survival also does its best to fill the screen with indicators, notifications, objectives and so on: there are missions to complete, wars between other users' factions, messages, chats and the inevitable energy indicator which is dilapidated as you face the fights and which must be recharged by spending time or paying (again) with gold coins. Ordinary administration for free to play which, however, only makes the product indigestible to those who feel reasonably fed up with mechanics of this type. The Walking Dead: Road to Survival adds a few new elements to an all too tested formula Credit must be given to the developers of Scopely for not limiting themselves to trivially copying what has already been done by many (too many) similar titles, but rather for having paid greater attention to the combat phase, which rarely in base building games has been able to count on a appreciable strategic depth. So here on the battlefield The Walking Dead: Road to Survival turns into a turn-based RPG, with the user having to choose which characters to send into the fray based on their skills, the armaments in their possession and also the type of threat you have to face. Enemies and allies can in fact be part of four categories linked to each other by relationships of strength and weakness (the powerful character wins against the armored one but loses against the fast one and so on), an aspect that requires a minimum of planning in the clashes, especially in the more advanced stages. Testing the facts, then, the combat system also performs quite well: each character must take advantage of his turn to attack an opponent or use an object, and once a certain threshold of damage done and inflicted can unleash a special move that varies depending on his training. The latter is another aspect on which Scopely has decided to place a strong emphasis: each Woodbury refugee can be transformed into a fighter and shaped at the player's discretion, making him accumulate experience, providing him with new equipment or allowing him to learn new skills. All things considered, we can speak of The Walking Dead: Road to Survival as a title characterized by a strategic component with a complexity that is undoubtedly higher than the average of the genre, even if there is a price to pay in terms of pure and simple immediacy : this large amount of content and options obviously causes a real inonmenu action, settings and notification messages which in the long run prove to be a bit heavy and which increase the feeling (always present in titles like this) of being spectators rather than real players.", "date": "2015-09-03", "grade": "6.8"}