{"name": "Siete pronti", "ref": "https://multiplayer.it/recensioni/155286-super-mario-maker-siete-pronti-novelli-miyamoto.html", "text": "Imagine you are a teenager - or remember that, if you were - in the mid 90s. The Super Nintendo is about to end its glorious adventure and is about to hand over the baton to the Nintendo 64, with its three dimensions, its polygons and its alien pad. Most likely you have been waiting for years for the sequel to Super Mario Bros. which, after the explosive diptych made up of the third episode and the successor ~World~, has never been seen again: Yoshi's Island, exceptional as it is, is only part of the series through naming. The wait would have been sublimated into catharsis by Super Mario 64, which would have brought so much beauty, forever defined three-dimensional gaming and started a new adventure: an adventure, however, unrelated to the dear, faithful X and Y axes. Which with the Z, you would have understood it over the years, they don't have much to do with it. Super Mario Bros., the one in two dimensions, would only return in 2006 (on portable) and 2009 (on home console). But let's work our imagination a little more and go back to the beginning: we are teenagers in the mid-90s, Super Mario 64 hasn't been announced yet, we are waiting for the sequel to Super Mario World. Nintendo presents the launch game of the new platform, and it is Super Mario Maker: a potentially infinite platformer, a celestial editor, a revolution in the world of video games. Yes, had it come out at the time it would have been simply devastating, an unimaginable dream come true. But, concretely, it would not have been possible: it would have been possible instead, alas, about ten years later. Let's say, more or less, between 2006 and 2008. And even there it would have been epochal: the formal perfection of Super Mario Bros., which returns after so many years together with an innovative concept. But in 2015, after Little Big Planet and (above all) Super Meat Boy, Super Mario Maker can't be revolutionary, in any way: however it remains the only way to personalize, in a theoretically infinite way, the best two-dimensional platformer ever created. Possibly the most perfect gaming gear ever created. Creating internships is simple and challenging, but Super Mario Maker is also nice to ~just~ play online Create Let's specify right away that, with everything we write about the Super Mario Maker editor, we'll probably make it more complex than it actually is: so let's say right away that it's precise and extremely intuitive. The controls, as you know or could guess, are totally entrusted to the touch screen: it probably would have been possible to make this game for a past Nintendo console, but with a different control system it wouldn't have been so comfortable and accessible to everyone. Because this is actually what it is about: do you want to extend the internship? Grab the ~A~ for ~arrival~ on the bar at the bottom of the screen and drag it to the opposite end. Reverse path to narrow it down. Want to lift a flying koopa a bit? You grab it with the touch screen and raise it by one square (the editor is punctuated by a gray background). Think you pushed two blocks too far? No problem, press ~play~, test the stage and, if it is actually impossible to reach the new platform, you can decide to fix it as you see fit by observing Mario's trail. You will not have absolute freedom: you always start from the left (to get to the right), and the vertical development of the stage is wide but limited, so as not to dominate the horizontal one. However, the limits are few, given the abundance of content: enemies, platforms of various kinds, hidden blocks, coins, rotating shovels. It is even possible to insert elements historically anchored to a certain setting in a different one: jellyfish in the dungeons, underwater goombas (not that they move much), Baby Bowser in the open air. And they can be combined in a completely atypical way: columns of koopas, giant koopas, a series of Bowsers. Weird solutions, and it's a good thing that there are, but often the best feature to pursue remains overall harmony, much more difficult to achieve than a single effective gimmick. We can't enumerate every editable or insertable element, but know that there's so much choice, it's always easy to position objects and it's just as simple to change their size: just select them with the stylus and enlarge, shrink, move them. Instead, we would like to underline the Splatoon-like approach: not all the contents are available from the start, you will have to play (creating stages) for at least ten days, spending at least half an hour with Super Mario Maker for each of them: while questionable, it is an understandable choice given the amount of elements to be used. Rather, perhaps it would have been better to manage the introduction of the few elements that bring conceptual complications more gradually:the reduction of time, the rails for the platforms, the doors and the pipes for the sub-levels, perhaps excessively crowded in the last few days. But overall it's a commendable job: creating a nice Super Mario Bros. level is simple and fun, and the limits are few. The most annoying perhaps lies in the absence (in the currently available set, at least) of a checkpoint, which makes it necessary to start over even the longest stages from the beginning. NES in power There are four ~skins~ to choose from, and above all four engines: Super Mario Bros., Super Mario Bros. 3, Super Mario World and New Super Mario Bros. (so, generic, as if it were a single game and not a series) . However, there is no doubt that the greatest focus has been reserved for the first of these titles: Super Mario Bros. in fact has been polished, not so much for its appearance (60 frames per second, high definition and 16:9 are common to all episodes), as for the contents and setting. Scrolling is totally free (therefore it does not proceed only forward) and above all now it is enriched by all the objects that would have arrived later (rotating shovels, flying ships, moles, etc.), so that the quantitative gap with the other episodes is canceled . The same power-up missing from the list (the leaf in the third, the cloak in the ~World~) has been worthily replaced by the various amiibo costumes, which can also be unlocked in the game by completing certain challenges, which allow you to stay low but, at the same time, breaking blocks: it seems like a trivial thing, but instead it gives rise to totally new mechanics, especially in fast and dynamic stages. Another legacy of Super Mario Bros. lies in the absence of sloping terrain, but they have probably been eliminated mainly to simplify the level design (many will not notice the lack, we imagine). In short, unless you are madly fond of the look, control or power-ups of Super Mario Bros. 3 or Super Mario World, there are very few reasons to prefer them to the progenitor. A different speech however must be made for New Super Mario Bros. which, thanks to the polygonal engine, offers totally different interaction and dynamics: leaps from wall to wall, sudden braking, triple jump. The most popular skins therefore turn out to be precisely those of the progenitor and the latest arrival. To complete the discussion, we point out the presence of various settings: there is the open stage, the one in the basement, in Bowser's castle, the one on the flying ship and in the haunted house. Each of them is applicable to each of the games listed above, and at all times. The possible variants, you will guess by yourself, are truly innumerable. The only criticism we feel we can make in this area is that, apart from the sub-levels via tube, the settings cannot be mixed: it is impossible to insert a transient puddle of water inside an open-air level, for example. Ditto for lava, relegated to castles. Offline or online? Once you have finished your internship, upon completion as Mario, you can publish it online. Initially you will be able to insert ten levels then, based on the appreciation from the public, things could change: if it is not played a lot, a stage is destined to be eliminated in a short time. Conversely, if it were not only crossed but also received the approval star, the maximum limit of ten publishable levels would be expanded. Every time someone plays your stage - or comments on it, or praises it - you will get a notification, and you can check where people have ~died~ most often, the names of users who have gone through it, the total percentage of completion. It's really nice to know that someone, somewhere, is playing one of your creations - and probably enjoying it too. He's having fun both thanks to you and the exceptional raw material provided by Nintendo, the real secret of this Super Mario Maker: it goes without saying, but the pixel-precise interaction of Super Mario Bros., as well as the perfect control system with its jumps, the appreciable inertia and the changes of direction are the main reason why this game is able to ~have its say~ despite coming after the various Little Big Planet, Super Meat Boy and company. The material with which we have been allowed to joke, build and play comes directly from one of the most prestigious genetic heritage of the entire electronic entertainment. All through a simple but functional graphic aspect: as we have already specified, the old games have been made more fluid, brought to 16:9 and... in high definition. An aspect of the latter that is certainly pleasant, but which makes everything quasi vintage: there is no doubt that such a resolution emphasizes the sharpness of the pixels, and - for the old players - it takes some time to get used to. Nintendo made this choice consciously, underlining the substantial postmodernism of the operation by adding shadows to each individual object, as if they were scraps of paper placed on a larger sheet: a decision that increases the detachment from what those games were in past, and which, at the same time, emphasizes what Super Mario Maker is today. As for the soundtrack, the discussion is much simpler, and not as rich: the typical compositions of each game have been re-proposed, which change faithfully based on the chosen setting. An apparently obvious decision which however allows you to immediately ~find yourself at home~. Is it me, Mario? We have kept for last the theme that, before the game's release, had aroused the most doubts and questions: does it make sense to buy Super Mario Maker if you are not interested in the editor? The answer, quite simply, is yes. Obviously they must like 2D platformers and Super Mario Bros. but, if you fall into the category, it is a more than recommended purchase. And certainly not for the few levels made available offline. The version we tested has servers specifically created for printing, so the number of users is low, enormously lower than what will be reached in a few days: despite this, the internships are many, they are varied, and above all there are many beautiful. You can search for the most popular levels, the most popular ones, those recently added, you can also add a particular user to your favorites, so as to follow his publications. Alternatively, for a more classic Mario-like experience, there are three challenges - easy, normal and hard - which randomly select a sequence of eight (or sixteen) stages, with a final Bowser's Castle. It is true that some of the difficult levels are really too difficult, not so much for the skill required as for the senseless traps placed here and there, but it is equally true that there are normal stages that are fun and appreciable, and new ones pop up every day . To clarify what you will find online a little better, we have tested all ten levels currently with the most votes (not only those, of course): among these - surprisingly in our opinion - there are various stages to ~admire~. Yes, you got it right: paths where you don't have to press anything, or where you just have to run or walk. The cog of the stage then causes, throughout Mario's journey, the craziest and most unpredictable things possible to happen around him: en masse enemies who avoid him by a hair's breadth, pillars of fire that tickle his hat, etc. .. certainly pleasant levels, but which over time - in our opinion - will climb in the rankings of liking. There are also many creations that take the Super Mario Bros. engine and use it to become ~something else~: either a Donkey Kong-style platformer, full of vines, a level  la Metroid, focused on the use of power-ups and exploration, or a sort of side-scrolling shoot 'em up, with Fire Mario riding Baby Bowser's flyer. There's a lot of variety and a lot of creativity, and it's curious to note how only one of the top ten stages can be considered a classic Super Mario level: this shows how difficult it is to make them right, to find the right balance between the elements. But, to recap, we reiterate what was said at the beginning of the paragraph: if you love Super Mario Bros., we recommend this game even if you don't want to touch the editor with a finger. There are internships for all tastes, and there are new ones every day. Without claiming, of course, to be able to compete with an authentic EAD work: it is a radically different experience, composed of a sequence of ingenious single stages, not a balanced adventure as a whole.", "date": "2015-09-02", "grade": "8.8"}