{"name": "Sci estremo", "ref": "https://multiplayer.it/recensioni/155358-ski-safari-2-sci-estremo.html", "text": "Making successful games has undoubted advantages and can change your life, the problem is then to find an equally valid idea for subsequent projects. Sometimes the simple enrichment of the original formula works great, and the Angry Birds franchise is a prime example of this, but the loss of ~freshness~ is inevitable. Let's take the case of Ski Safari, the debut title of Sleepy Z Studios, capable of totaling a good one hundred and forty million downloads between the App Store and Google Play, and probably conquering the majority of users who have downloaded it. As highlighted in our review, the game had undeniable strengths, above all a different interpretation from the usual of the horizontally scrolling endless runner genre, the same one that gave birth to blockbusters like Jetpack Joyride. We played a game, and then another, and then another, remaining anchored to this immediate and fun experience, capable of offering something new every time. Three years later, here is the sequel, Ski Safari 2, which focuses on the ~more of the same~ by introducing a second character, many new mounts and above all three different scenarios to unlock using the coins collected during each attempt. We are talking about a premium product, sold on the App Store at a price of 1.99 euros (double the original), which therefore does not include strange freemium mechanisms, or expectations or content for which it is mandatory to make in-app purchases: the two extra locations, Jurassic Lark and The Canyon of the Tornadoes, can be purchased with relative ease, collecting credits within a few hours, while the rest of the objects are limited to aesthetic customizations. Ski Safari 2 introduces new characters, stunts and scenarios, but shines less than the first episode As fun as the first one? The gameplay of Ski Safari 2 has remained anchored to that of the first episode: an avalanche (or something else, depending on the location) is impending and the protagonist is awakened while his bed slides towards the valley, to crash against the first obstacle and reveal an uncommon quickness of reflexes, given that the hero has already put on his skis or snowboard and is launching into a desperate escape. The goal in each game is to get as far as possible, trying to increase the distance between us and the danger, perhaps while making jumps and aerial rotations to gain further momentum. In this sequel, the possibilities in this sense have multiplied, and drawing slides towards the four directions translates into as many stunts that multiply the score, and which vary from an aesthetic point of view depending on the situation in which we find ourselves. Yes, because one of the cornerstones of the Ski Safari series are the ~mounts~, i.e. strange animals, vehicles or objects that we can use to increase speed and resist one or more impacts that would otherwise force us to tap the screen quickly to get back on our feet before being reached by the avalanche. Finding yourself on the back of a yeti, on the back of a penguin or hugging a bird translates into different and fun animations, which however do not completely distract attention from a somewhat anomalous balance of difficulty. The boulders that act as an obstacle to our race are in fact placed on the course in a strange way, difficult to predict and in pairs, which makes it necessary to have a mount and proceed mostly in the air, through long jumps that make the I play the charm of the perfect landing. Certain features, such as the ~photograph~ that captures some moments of the game, are also purely ancillary, confirming the lack of a strong idea that can characterize this sequel and give it the freshness of the past. The technical sector is good: the colorful graphics are full of new characters and landscapes, even if sometimes the view expands a little too much and this ends up diminishing the glance.", "date": "2015-09-01", "grade": "7.0"}