{"name": "The Rub Rabbits!", "ref": "https://multiplayer.it/recensioni/the-rub-rabbits.html", "text": "A beautiful girl drives us crazy.. The Rub Rabbits begins on an escalator, where we are mindlessly minding our own business. So here on the other side a wonderful girl materializes who immediately attracts our attention and makes our hearts beat faster. The game starts from here and will see us as protagonists by challenging many contenders for her graces, attracting her attention, fighting against her indifference, creating unexpected triangles, in short, everything there is really to devise to impress the modern girls of our times. Each test is linked to the next through hilarious cut scenes that make the plot evolve and motivate its mechanics. Each test is linked to the next through hilarious cut scenes that make the plot evolve and motivate its mechanics A beautiful girl drives us crazy.. The new mini games are really fun and above all ingenious. For example, in one of these we will have to shoot our enemy-suitors with a blowgun, angling the shot with the stylus on the touch screen and physically maneuvering the weapon. At the same time, once we have the target in sight, we will fire with a quick breath on the screen: brilliant. The one where we will have to attract the girl's attention by turning around, and with the stylus to draw languid ~looks~ that distract her from the numerous boys who surround her, is also very nice. Some games will also exploit the good idea of having to rotate the console 180 degrees to get a deeper and wider area. But this review certainly won't take away from you the pleasure of discovering how Sega has managed to intelligently implement the NintendoDS features in its new title. Party games! Each of these mini games, once completed, will unlock a certain amount of hearts that will later be used to buy items and clothes for our beauty, all within the ~Maniac~ option. Here it is possible to change clothes, costumes, accessories, and even draw some with our pen, a truly amusing option that will see us at work with an almost fetishistic taste. Once you complete a stage you can replay it from the beginning to get more hearts, and therefore more points. In addition to the Maniac option there is also ~Hullabaloo~ which is nothing more than a Party Game to be played in two people in which you will have to find the rhythm by pressing the right keys in time. Time Attack, on the other hand, is the mode in which we are committed to completing as many levels as possible in the shortest possible time: in short, a classic. Some of the games we play in Story mode, once completed, will be available wirelessly. Certainly compared to the first chapter the game variety has been expanded and now Rub Rabbits is clearly a more ~complete~ product. Is it that easy to get a girl? Despite the additions, Rub Rabbits remains a collection of little harps and the feeling of not having a ~real game~ in your hands is strong. Surely the type of title is suitable for a portable console, and falls into the same category of video games like Wario: simple, fast, fun. The biggest problem with Rub Rabbits lies precisely in one of these three points: ease. It will not be a feat to complete the single player in the middle of the afternoon, or two or three hours. Once completed it is possible to start again with an increased level of difficulty, even if to tell the truth the change is not so felt. From a graphic point of view, this time the realization is polygonal in both screens, unlike Project Rub which used only one, and this feature is exploited by some tests such as precisely the one where you have to cast loving glances by turning three-dimensionally around to the girl. It will not be a feat to complete the single player in the middle of the afternoon, or two or three hours Is it that easy to get a girl? The general style of the game is very neat, colorful, and ~Jap style~, just like the predecessor was, and perhaps for this reason it loses some of its surprise effect. The audio sector does not give particular emotions. During the sketches before the real action, the console limits itself to emitting some nice complementary audio effects, while in the rest of the time fast, rhythmic and rather banal tunes will rage, certainly suitable for frenetic mini-games but absolutely devoid of originality and of freshness. Most of them are quick looping jingles made up of one or at most two sounds, in short, really nothing memorable. The work done by Sega is appreciable, compared to the old Project Rub a wireless multiplayer mode has been added and numerous objects andclothes to unlock, as well as three-dimensional graphics on both screens. Despite this, this new Rub Rabbits is a very, very short and easy game. Defect that detracts from the longevity and desirability of the package. Surely a greater number of minigames and a better calibrated difficulty could have made this title a must, unfortunately it remains a nice game with which to spend a carefree afternoon, nothing more. Pros DS features well exploited Added multiplayer Improved graphics Cons Very, too short Very easy More minigames were welcome Sega returns with its bizarre game of ~seduction~ of the fairer sex with the sequel to that launch title which was ~Project Rub~, much appreciated and played at the time. ~Feel The Magic XX/XY~, as the game was called abroad, was nothing more than a fun collection of mini-games in which we were engaged in conquering the girl of our dreams through numerous and amusing trials to overcome in order to attract her attention and make her fall in love with us. The concept of this ~Rub Rabbits~ does not differ from the prequel and proposes the classic theme of ~courting~, all through new and hilarious tests. The series has the advantage of being able to show many useful applications of the NintendoDS features, none excluded: the touch, the microphone and the double screen. Each of them is used in an intelligent, often surprising way. On the other hand, it was Project Rub that showed the world what that new laptop was capable of", "date": "2006-02-23", "grade": null}