{"name": "Il mondo pu bastare", "ref": "https://multiplayer.it/recensioni/155298-satellite-reign-il-mondo-puo-bastare.html", "text": "Perfect plans exist only in movies. In reality, a patrol changes its route at the last minute, a guard turns around when we least expect it, we forgot our sniper rifle silencer at home and the armored door has an additional security system that we hadn't foreseen. It would have been better to spend a few more credits to get extra information, but it's too late now. The support cyborg is too far away to scan the area and we have to hurry the hacker to find the damned device before the guards find us. Too slow, we got caught. In a second the whole base is a concert of sirens and bullets. We retreat, the hacker dies. Failed mission? No way. A new cloned body replaces the old one and our cyborg is back on track. The process took away some experience points from him, but now we know what we have to do: prepare better and buy new equipment. Then come back and finish the unfinished business. Maybe armed with rocket launchers. Because our corporation works day and night. And above all, he never gives up. This is the spirit of Satellite Reign, heir to the classic Syndicate, from which it takes the best aspects and then builds its own identity. There's some Commando, XCOM, and Shadowrun in this game, and for once, the new is better than the old. The aim of the game is still to grow the criminal corporation we belong to, but the plan is now more concrete. We have a gigantic city to dominate and we won't stop until we have it all under our control. The four boroughs that make up the metropolitan area are huge and magnificent to see. To access from one to the other you need to gain access to their respective checkpoints, but there is no rigid progression of the game, as we will see later. The first impact with Downtown is unsettling, you don't know where to look. Advertising screens cover the facades of buildings, cold neon trees illuminate squares invaded by stalls at the foot of towering corporate skyscrapers. Fluorescent lights shine everywhere and a light drizzle falls relentlessly from the invisible sky. You can zoom in and see the quality of the detail, which is surprising in such a huge game. The structure of the city is very complicated, full of conduits, secondary passages and bridges. It is also constantly monitored by cameras, mechanical dogs, armed guards and combat turrets. Dark alleys are the refuge of the homeless gathered around a fire, while tangles of stairs climb around buildings that seem to stand on top of each other to emerge from the city chaos. If chaotic and uncontrolled growth is a constant in every area of the city, the individual neighborhoods have their own spirit. Downtown is the classic cyberpunk crossroads where the desperate meet on the fringes of social life, the industrial district, dominated by yellow, is instead a loading and unloading area, while the grid houses many luxury complexes. However, big corporations arise everywhere, with their industrial secrets defended by platoons of guards and robots. Those corporations are our enemy. We have to beat them in pursuit, steal the credits from their vaults and crush them under our titanium heel. There is only room for one king in this city. And never mind if civilians get involved. Besides, we never talk to them. They're just meat to be scanned for new bodies to clone, scientists to bribe, or informants to pay. As long as they're useful, they're fine. Our team of cyborgs aren't interested in shopping or spending credits at strip clubs. There are no interiors to explore or stories to uncover like in Shadowrun. The action takes place outdoors, inside the protected walls of the Ronin, under the gaze of the bank's cameras, behind the armored doors of the Dracogenics. When an agent enters a building to steal something, we don't see what's going on inside. But after a few seconds we see it come out together with a writing that prints an evil smile on our face. We have what we came for. Now we just have to get out alive. An open city to conquer and infinite ways to do it, that's Satellite Reign Heartless cyborgs Our corporation works like an advertising agency. A cynical account passes us the missions and information we need, after which our team of creatives must find an original solution to the problem. The team is made up of four elements of different classes. It struck us that it is possible to cross the skills of the different classes while maintaining their respective specializations. For example the soldier can appmake infiltration skills, so as to leave the hacker free to invest in the offensive enhancement. Skill points get sweaty though, so these kinds of choices are always difficult. And by the way, we can create the ideal team for our style of play, but there is no perfect team for every mission. Indeed, Satellite Reign offers a real open city with a thousand possibilities, so it is impossible to predict everything. Sometimes what matters is the configuration of our team, in other cases it is the extra information that we have managed to find or how we have managed the resources that make the difference. Each of these aspects is then influenced by other choices made previously, and we are only talking about the preparatory phase. Once you enter a controlled area there is no way to predict the behavior of the guards, because the spaces are vast and complicated and our view is limited. When we are convinced that we have learned the tour that a patrol takes, something suddenly changes. There are also numerous entrances to evaluate, intricate security systems, rooftop transport cables and access permits that bar the doors. The beauty is that we can also force our cyborgs to perform an action for which they are not trained, but if we go wrong, the results are disastrous, like falling from a rope right in front of a camera or being electrocuted by a generator. The large amount of variables involved makes every choice a gamble and often forces us to improvise. The fact that you can't save yourself during a mission greatly increases the tension, such as during a game of XCOM in Ironman mode. Regarding combat, they feared it was the classic shortcut for those who don't want to think too much about missions, as happens in almost all games that include stealth elements. Instead, even in this respect Satellite Reign does not allow shortcuts. Each firefight must first be thought through and factored into a larger overall strategy, because the enemy, though lacking in artificial intelligence, is armed and up to the task. There is therefore no privileged style of play, so it is good to be ready to blow up a base when needed as well as to sneak unnoticed from one shelter to another. The order in which to undertake the missions is also left to our discretion. We can complete one district at a time or strive to gain access to a more advanced area, just to hack a few more ATMs and invest the credits obtained in the research of new weapons or devices. Choices, choices and more choices. There is enough to play for a long time, in short. Just don't expect anything else than the above. The city is inviting and full of quests to do, but they are all of the same type. You plan one assault, execute it, and move on to the next. In between there is little or nothing. However, if you are looking for a deep and detailed real-time strategy game, which forces you to evaluate every move, at least twenty hours will pass before you feel a little tired. And that doesn't necessarily mean it will happen anyway.", "date": "2015-08-31", "grade": "8.8"}