{"name": "Non frenare mai", "ref": "https://multiplayer.it/recensioni/155309-horizon-chase-world-tour-non-frenare-mai.html", "text": "The first interesting note of Horizon Chase is the country of origin: Brazil is not exactly one of the places that is usually associated with the development of video games, and the name of Aquiris Game Studios will be completely unknown to most. The team based in Porto Alegre, despite having been active since 2007, has in fact always been involved mainly in advergaming projects for large international commercial labels, and the leap towards the production of real games only took place this year. Horizon Chase is therefore one of the very first commitments in this sense, in which the South American boys wanted to condense all their passion for the arcade racing games of the 80s and 90s, with evident tributes both aesthetically and in terms of gameplay. If you've ever wondered what Out-Run would look like today, here's the answer... To the horizon and beyond In Horizon Chase the goal is to face races set in various parts of the world with the obviously aim of reaching the best possible final position. The start always takes place at the back of the grid, from twentieth, and consequently it is necessary to pass numerous cars before reaching the top. Overtaking is in fact the most demanding aspect of competitions in Horizon Chase, since it is imperative to avoid contacts as much as possible to avoid slowing down and wasting precious time. In fact, a few mistakes are enough to definitively lose hopes of victory, which is why accelerator management and quick reflexes are fundamental elements to be perfected as soon as possible if you want to aspire to glory. The driving model is as arcade as imaginable: the grip of the car when cornering is in fact always guaranteed, and there are few corners that cannot be tackled with the pedal to the floor. Then there are three boosts available, to be used carefully to take full advantage of them. To increase the depth of the experience a little, Aquiris has chosen to place blue tokens and petrol cans along the track to be collected by passing over them: the former are needed to be able to unlock content and continue the adventure, the latter are essential for avoid running out of water and ending your race prematurely. Even the possibility of obtaining new cars with different characteristics and buying upgrades helps to alleviate the intrinsic limits of such immediate gameplay, thus making Horizon Chase overall a balanced product capable of keeping the player's interest alive. However, where the effort of the Brazilian team shows the best qualities is in the graphic component, which recovers the low-poly style of titles such as Virtua Racing by inserting it in a style and in a general feeling that clearly recalls Out-Run and Top Gear. However, all updated on a technical level through the high resolution of the Retina display and the stable 60 frames per second, which help to strengthen the extreme sensation of speed that the game is capable of transmitting even with less powerful cars through scenarios with a variety really excellent. The result, therefore, on a visual level, is that of a product that combines a retro soul with the technical capabilities of modern devices, in a truly attractive mix full of personality. The attention and care of Aquiris has also included the audio element seen the involvement of the veteran Barry Leitch for the soundtrack, already author of the music of Lotus Turbo Challenge, Top Gear and Rush. It goes without saying that even in this respect the reference to the past is heavily influenced, as it is possible to understand from the very first notes. Finally, it is worth emphasizing that there are no in-app purchases or similar, thus making the purchase price of  2.99 the only payment that is necessary to be able to fully enjoy the game: another factor ~ retro~, one might say, but which we increasingly miss.", "date": "2015-08-31", "grade": "8.4"}