{"name": "Tanto vale guardarsi un hentai", "ref": "https://multiplayer.it/recensioni/155113-onechanbara-z2-chaos-tanto-vale-guardarsi-un-hentai.html", "text": "The beauty of the modern age is that there is room for everything. Practically every kind of story, idea, perversion or taste can have its outlet, almost always legal. Do you like dressing up as a cuddly toy and making piles with your friends? No problem! Want to see women in lingerie playing American football? You can do it! Do you want to annihilate your existence by watching trashy movies with anacondas fighting giant monitor lizards or a city devastated by a tornado full of sharks? We have it! And if you want to impersonate a vampire girl who fights the undead by dressing in a quantity of fabric sufficient to make just a pocket in a normal dress, the reference point is undoubtedly the Onechambara series. Despite a technical realization worthy of the offering basket, a laughable plot and a game mechanic reduced to the bone, this saga has passed as if nothing had happened not one but two generations of consoles, even allowing itself a passage on portable ones. As good ideas fell by the wayside and capable studios closed their doors, these bikini-clad vampires have continued to thrive on an unstoppable force: butts and boobs. A bit like the production company Asylum (or Troma), which deliberately produces trashy and splatter films, the developers of Onechambara are well aware that as much as the public loves well-made and thick products, there is always a little of space for vulgar entertainment, the one that rests the synapses and satisfies the basest instincts. Pure entertainment, without compromise. But is this Onechanbara Z2: Chaos really funny? Onechanbara Z2: Chaos, or rather bikinis, katanas and zombies for brain-dead entertainment Two clans at war Orienting yourself in the events that lead the protagonists to slice hordes of infernal creatures can be complex, because not all the chapters of the saga have been officially published in the West and the plot is not exactly a masterpiece of writing. There are two sisters, Aya and Saki, one is dressed as a schoolgirl, the other as a cowgirl in a bikini, who initially fight and then fight together because yes. Both are part of a vampire clan called Vampiric and later collide with two antagonists who look a lot like them, Kagura and Saaya who are instead affiliated with a clan called Baneful. In Onechanbara Z2: Chaos these four ladies will have to put aside their personal differences and work together to defeat yet another demonic invasion, making their way through the undead hordes using every possible exotic weapon and occasionally unleashing the fury of their blood power. This is obviously just a pretext to throw dozens and dozens of enemies against us, going from one fight to another with such a rhythm that in the end what little remains of the plot is diluted in the middle of some dialogue that precedes yet another absurd situation. For heaven's sake, not that other games of this type, from Bayonetta to Devil May Cry passing through Ninja Gaiden, enjoy who knows what writing, but here the level is truly down to earth and it is certainly not elevated by the repetitiveness of enemies and settings, not to mention talk about the dialogues that are in serious danger of depriving us of IQ points with each reading. What is surprising about the story is that, however convoluted it is, it does not shine for its longevity. If you don't pay too much attention to the final score of each level and hit keys at random, Onechanbara Z2: Chaos can be finished in about an afternoon of playing on a normal level. We're not sure it's the shortest action game ever, but it sure is on the podium. Swords without brakes... The most evident and perhaps only improvement of this new chapter is represented by the combat system. The more experienced will be able to ring together very long combos thanks to the possibility of choosing on the fly which character to use and in certain cases to summon all four swordswomen simultaneously. With a little practice it will be possible to start a combo using a character equipped with moves capable of making enemies fly in the air, jump and immediately pass to another warrior equipped with ranged weapons, to shoot them in mid-air and conclude all with an area-of-life finisher that kills survivors. Furthermore, in some situations we will be able to transform ourselves into particularly powerful demons, consuming part of our vital energy, but gaining an enormous damage capacity. Another fundamental aspect to consider is the fact that over time the weapons will get dirty with blood and will lose effectiveness, so it will be necessary to clean them by pressing the appropriate button, a feature that was already present in the previous chapters. As for fighting style, Aya and Saki didn't vary more than ttheir moves compared to the past. Aya uses two katanas, while Saki prefers melee, although in both cases it is possible to change the weapon for a different approach. The new recruits, on the other hand, show a completely different style. Kagura is probably the most versatile swordswoman, because her secondary weapons are reminiscent of Kratos' Blades of Chaos and allow you to keep many enemies under control at the same time, Saaya instead uses a chainsaw, which in addition to hurting can stun with lethal efficiency, opening the door at mileage combos. ...but above all meaningless However, everything we have written so far is practically canceled by a very simple concept: if the ~button mashing~ entry existed in the dictionary, there should be a photo of Onechanbara Z2: Chaos next to it. Many action titles are forgiving of those not particularly good at executing complex moves and allow for a degree of randomness, but here we are dealing with a game that could be completed by pressing just two keys: square and triangle. Sure, every now and then we can throw in some special moves or change characters, but the music remains more or less the same. To make things more ~difficult~ monsters vulnerable to a specific special power sometimes think about it, but all they do is make things more boring, because if that power is not available we will be forced to wait for its recharge, while casting useless shots. The craziest thing is that practically every fight, bosses included, can be completed simply by jumping and hitting randomly. This is because the enemies' hitboxes are unnecessarily large and do not detect aerial moves, so just go vertical to strike from a safe distance. To tell the truth, there is not even a need to use this glitch, because the artificial intelligence is on average very low, sometimes comical, and the attack patterns are predictable. The same goes for the structure of the missions: a series of corridors in which the passage is occasionally blocked until we have eliminated a few people and so on, until the inevitable confrontation with a larger monster, also devoid of particular genius. It is true that in Onechanbara Z2: Chaos we are dealing mainly with zombies, who are not particularly famous for their tactical acumen, but here we go too far! The apotheosis of fanservice The Onechanbara series has never been famous for its visual fidelity and this chapter certainly won't be the one to upset the tradition. From a purely technical point of view, the game seems to have drawn its assets from a mass grave in which the discards of the Playstation 2 era have been buried. The scenario is quite depressing, not only because the polygon count is dramatically low, but also because the color palette is sad and confusing, both as regards the background and the creatures, so much so that sometimes the latter cannot be distinguished from the former. However, as often happens with these cases, the game excels (or at least, improves) in the polygonal models of the main characters, who stand out from the rest like flowers in a minefield and are equipped with all the customization possibilities expected in the tight world of fanservice . The four heroines of the game can be dressed in ways that range from the absurd to the ridiculous, passing through very vulgar outfits which are basically a way to show nudity on the screen with some more texture. We don't know if this is what we usually look for in a game nor do we judge any particular tastes, but without entering into controversy on the representation of the female body and on the evolution of the videogame panorama... we might as well watch a hentai porn, right? At least you avoid the boredom of repetitive mechanics.", "date": "2015-08-26", "grade": "5.0"}