{"name": "Devil Kings", "ref": "https://multiplayer.it/recensioni/devil-kings.html", "text": "Technical aspect If Capcom's goal was to exploit the PS2 hardware in the best possible way to stage huge, extremely spectacular battles, with dozens and dozens of warriors involved at the same time... the goal has been fully achieved. While not counting on scenography rich in elements, but compatible in appearance with what could have been the typical scenarios of battles set in feudal Japan, Devil Kings makes excessive use of polygons to represent the numerous soldiers present every time on the screen, gifted soldiers of a good number of animations and that do not fail to move fluidly (60 fps? Could be). The thing that amazes most is the absolute solidity of the graphics engine, capable of managing all these characters and attached special attacks without batting an eyelid and indulging in a few brief slowdowns only in absolutely chaotic situations. An excellent result. As icing on the cake, there are the numerous animated sequences that intersperse the campaigns, divided between computer graphics (exceptional) and real cartoons (excellent). The sound sector tries not to be outdone, but it is difficult to achieve the same results: the music is ~epic~ enough and well suited to the atmosphere of the game, the effects are quite good but the speech is ~so-so~, recited in too ~rigid~ English by the usual voice actors to whom Capcom relies. If Capcom's goal was to exploit the PS2 hardware in the best possible way to stage battles of very far-reaching... the goal has been achieved in full. Comment Perhaps the most difficult thing about giving a ~numerical~ judgment to a video game is regardless of what genre it belongs to. Gran Turismo is a masterpiece when it comes to driving games, but fishing enthusiasts may not like it. Likewise, any basketball simulation, however accurate and realistic, will not appeal to an action game fan. Devil Kings is what all scrolling beat 'em up maniacs have been waiting for: twelve playable characters, each with its own story and ending to discover, with lots of weapons and attacks to unlock and try out, with something like eighteen different environments, with a level of difficulty that influences the number and quality of the objects collected and, dulcis in fundo, with an absolutely spectacular and enthralling representation of the fights. We are faced with a very valid exponent of the genre, a genre that however was born with limitations as regards variety and depth. So, as far as the ~literal~ judgment is concerned, Devil Kings is an absolutely must-buy product if you like/liked scrolling fighting games, but it's not the game for you if you're looking for plot, depth and variety of situations. As for the numerical judgment ... Pros: Spectacular Many characters, many weapons, many settings Progressive release of the elements, therefore quite long-lived Cons: It is not very varied and not very ~deep~ ... ... like any scrolling fighting game There is no mode game for two It took quite a while, but finally the third dimension was tamed. Capcom has been demonstrating, since the time of the first Devil May Cry, that the scrolling fighting game genre has not disappeared together with the 16-bit consoles, but has evolved in form and substance to represent on our screens a new generation of frenetic battles and spectacular. If Dante had to balance strength and cunning, find the way forward and develop attack plans when faced with a boss, all elements typical of action games but almost unrelated to progressive fighting games, in Devil Kings we won't have to worry about anything else than to dispense death and destruction. In industrial quantities, moreover. The protagonists There is an entire world to conquer, and six great warriors must battle it out to decide who will reign supreme over each land. These are not ordinary human beings, but something different: they literally fall from the sky towards the battlefield, they masterfully use weapons that a normal person could not even handle, they are virtually immortal and their attacks throw dozens of opponents into the air at the same time . They answer to the name of Red Minotaur (supreme leader of the red army, half bull and half man, uses a gigantic axe), Scorpio (general of Red Minotaur, master in the use of spears), Azure Dragon (commander of the blue army , fighting with three swords in each hand), Devil King (a ruler who sold his soul to the devil in exchange for enormous power), Lady Butterfly (under the orders of Devil King, she is a woman expert in the use of fire) and Venus (follower of Prince Frost, armed with two rotating blades). Completing the conquest with each of them will unlock six other characters: Frost (prince of ice, whose beauty is matched only by his combat skills), Hornet (a young follower of the Devil King, armed with a very particular bow), Iron OX (an invincible metal soldier under Irdene's orders), Puff (a girl who fights for the good of her people, armed with a giant hammer), Q-Ball (a kind of fervent priest, who doesn't disdain technological weapons) and Talon (a ninja under the orders of Red Minotaur). Although there is no difficulty in finding your way around the field, simply advancing towards the enemy leader is by no means the best strategy. Let the battle begin The main game mode of Devil Kings is Conquest. Once you have selected one of the available characters, you are faced with a map of the world and the armies that occupy it. It is therefore possible to attack neighboring territories to conquer them: a quick ~configuration~ of weapons and objects and we go into battle, where we will find hundreds and hundreds of enemy soldiers waiting for us. Thanks to a small map that is always present on the screen, we will be able to direct our assaults and gradually get closer to the head of the opposing army, defeated and the battle will be won. Although there is no difficulty in orienting oneself on the playing field, simply advancing towards the enemy leader is in no case the best strategy, as mowing down entire platoons is the only way to gain experience (upgrading the character) and items (weapons and various accessories). Each ~campaign~ is divided into various phases, often marked by the arrival of a particular warrior or by the presence of insidious ~timed~ missions, in which perhaps you will have to stem the enemy assault near allied positions or eliminate messengers, or even more. However, it is not possible to save the game until the battle is over, which proves to be a frustrating moment when perhaps we have almost managed to kill the boss of bosses. The fights, the real fulcrum of the game, boast one of the best systems so far made for what is the three-dimensional reality of fighting games. Weapons and control system Saving your progress is certainly not the only thing you can do between campaigns. Indeed, it is after collecting objects on enemy territories that the ~configuration~ of your character makes sense, as it is possible to assign him two extra attacks (which can be performed by pressing the R1 backbone and the Triangle or Square keys simultaneously), select the main weapon among those collected (there are six different types, each available with its own power level) and have him bring three special items (which increase defense or attack capabilities, provide greater effectiveness against archers and marksmen, increase experience points for killing enemies, etc. etc.). The unlocked special items will be common to all the characters you later decide to use: start the Conquest with Scorpio and you will be able to enjoy the same items previously collected by Azure Dragon, and so on. The fights, the real fulcrum of the game, boast one of the best systems so far made for what is the three-dimensional reality of fighting games. Eliminated the possibility of ~hooking~ one enemy at a time, in this case decidedly superfluous given the quantity of targets that can be hit simultaneously, Devil Kings allows you to perform combos simply by pressing a single button (Square), adding to it a series of alternative functions that often turn out to be not only essential to add a pinch of variety to what is already in itself a ~monotonous~ approach (typical of scrolling fighting games that have always been, mind you), but also to get by in particular situations . It is one thing to face a hundred soldiers simply making your way through with blows, above all because the elimination of the opponents is far from instantaneous, another is to first use a sort of ~stun~ attack with the Triangle key, an attack which in practice makes the most vulnerable enemies for a few seconds and which contributes to filling the rage bar. Although it can even be done without it for most of the time, the parry also represents an important element in the economy of the Devil Kings clashes: activating it the moment an enemy attacks us, it will have a ~bounce~ effect that it will make the opponent exposed to our counterattack. In the case of normal soldiers it is a negligible procedure, but it assumes some relevance whenbosses are faced, especially on more demanding difficulty levels or if we have little energy. Finally, when the fury bar is full, we will be able to activate a ~berserk~ mode for a few seconds (Circle key), in which we will be immune to any attack and will enjoy greater effectiveness for our shots.", "date": "2006-02-20", "grade": null}