{"name": "A Hideo Kojima game", "ref": "https://multiplayer.it/recensioni/155031-metal-gear-solid-v-the-phantom-pain-a-hideo-kojima-game.html", "text": "The three-year period 1997-1999 was fundamental for the videogame ~revolution~ implemented by three-dimensional games, with PlayStation and PC on the shields and the arrival of grandiose and unfortunate consoles such as Nintendo 64 and Dreamcast. An incredibly prolific period in which there was still the right mix of ideas, sustainability of development costs and enthusiasm within less pressing publication logics, foundations that still bear the weight of profoundly changed dynamics today. At the time, if you remember, the releases within the three large main markets - Japan, the United States, Europe - were even separated by several months and in these three years Half Life, Tomb Raider II, Gran Turismo, Shenmue, Xenogears and many others - a special article would be needed - have made millions of people fall in love to the point of converting them to the cult of playing. Metal Gear Solid, in our view, was the most disruptive title arrived in that period - mind you, not the best ever - the real leader of that revolution we mentioned earlier, because it was able to overturn the classics canons of the time and turn them inside out, adding a cinematic cut finally sublimated by the three dimensions, but also by many innovative ideas that had direct application on the mechanics of the gameplay. After two less ~media-oriented~ Metal Gears on MSX, the Solid added in the title indicated the name of the main protagonist and the creation of a full-bodied 3D world, which based its premises on a simple and linear plot, but which quickly overlapped with an anti-nuclear message, mixing real events with science fiction and throwing philosophy, morals, double and triple games into the plate: fully understanding the narrative substrate of the Metal Gear Solid saga is a difficult undertaking, but also for this reason it managed to excite millions of players. Solid Snake, initially with low (indeed, very low) resolution textures to depict his face, quickly climbed the ratings to become one of the most charismatic videogame characters of all time, and drag the Metal Gear Solid saga into Olympus of video game productions: in 2011 it was even elected as the best of all time in the survey compiled by the readers of Multiplayer.it. It was also the first title in which the creator forcefully flaunted his imprint, to the point of identifying himself with a double mandate - almost like a sentence - and becoming its father-master, overtaking any other collaborator and even Konami in the eyes of the players which ultimately owns the brand. And we say it with a little sadness, because as in a classic script already written, beautiful love stories can be destined to end, get lost in a glass of water due to misunderstandings and different points of view. We'll never know exactly where Kojima's ego and media preponderance overwhelmed Konami's lack of patience and foresight, but it's right to keep ~personal~ matters out of the conversation to focus on the finished product. Opera, we can assure you, which is the result of Hideo Kojima and his collaborators within Kojima Production. Metal Gear Solid V: The Phantom Pain represents a crucial and fundamental turning point for the saga, because it comes at a sidereal distance from the fourth chapter, it is completely new in structure and ambitious as always at the highest levels. Even if some of you smartass have already read the vote at the bottom of the article, it's time to dedicate a few thousand characters to the work of a developer destined to make history, for better or for worse. Our verdict on Metal Gear Solid V: The Phantom Pain, Kojima's last great work Playstation 4 trophies Metal Gear Solid V: The Phantom Pain offers 43 trophies, a good part of which are hidden because they are linked to the complex plot of the game. The others are definitely doable, but take hours and hours to unlock. In fact, to obtain the coveted Platinum, for example, it is necessary to complete all the tasks of all the missions, complete them with an S rank, build the Mother Base platforms in their entirety, develop 300 or more objects. A road that leads to many roads To fully understand Metal Gear Solid V, Peace Walker and Ground Zeroes can be a good starting point. Only as a spark, however, because the structure of The Phantom Pain literally explodes, increasing its scope and size, to the point of giving away gameplay, if we want, unprecedented for the series, undoubtedly more varied and satisfying, which has the difficult task of dealing with a narrative component always a trademark and with some choices forat least curious, which we will explore later in our article. Let's take a step back, however, because The Phantom Pain begins like the previous chapters, with a linear and hour-long prologue that ties back to the finale of Ground Zeroes, nine years later inside that hospital more times seen in trailers. We don't want to go into specific details, but we can safely say that we were faced with some of the rawest and most exciting sequences ever to appear in a video game, a concentration of emotions that put most of the key characters in the plot - but not all - on track. and completely overwhelm the player. They skilfully mix all the key ingredients for the perfect result, thanks to a riot of twists and the usual masterful cut in terms of direction, camera, visual power. Playing the prologue of Metal Gear Solid V: The Phantom Pain is a satisfying experience, to the point that you have to stop for a moment to metabolize it before throwing yourself on the undisputed and most evident protagonist of this fifth chapter: the sandbox nature of the gameplay and the possibility of facing the proposed missions with a freedom never experienced before. The correct wording to summarize it could be that of free roaming infiltration, because obviously all the variables offered are oriented towards this characteristic and the need to complete a series of tasks of various kinds. How is left to the player: day or night, silently or John Rambo-style, exploring and recovering materials or going straight to the point. Obviously the satisfaction will be different depending on one's aptitude and, as you will discover later, it is good and right not to underestimate secondary activities. This freedom of approach is magnified by the options in the main menu, which allow you to deactivate, for example, the aim assist, some elements of the interface and the reflex mode. The latter ~activates~ when you are discovered by a single opponent and provides a few seconds to hit him, slowing down time (obviously without making any noise!) before he warns his teammates. In the game economy it is a useful feature: better an element that slightly lowers the realism rather than transforming the mission always and in any case into a pitched firefight whenever you are identified. Also because Kojima Production for this fifth chapter has chosen a hybrid approach both in terms of realism and artificial intelligence, abandoning any ambition for complete simulation because it would not have been fun nor probably feasible. The result achieved represents a good compromise, in any case, in which it is necessary to rack your brains to face the objective successfully and possibly weaken the opposing defenses to bring the mission home. When sighted you have to lose track of yourself, or hide well when the alarm goes off, waiting for the state of alert to reduce and then end. There are no blunders and not even examples of incredible cunning, therefore, for a result that we consider satisfactory in proposing the right amount of difficulty without undermining the fun and guaranteeing some rather amusing ~poetic licence~. The center of operations is the Mother Base, which plays a fundamental role in the game economy: following the explosion of the old base and the mercenary organization created together with Miller, Ocelot and Venom Snake - whose body is tortured by fragments who reached heart and brain after the explosion - they created the Diamond Dogs, with the operational base in the Seychelles sea. From here you leave with your helicopter in Afghanistan - full-bodied initial setting, but not the only one - after selecting your equipment and the shoulder that will give support during the mission. In theory, any point on the map can be reached and as mentioned, you can decide whether to immediately tackle the main objective, also devote yourself to weakening the lines of communication or to exploration. The game offers great consistency in the evolution of the map, since there are no particular tricks such as the constant and indefinite arrival of opponents: in fact, when they are discovered, they will require air or ground support from nearby bases. To prevent this from happening, for example, it is possible to turn off the electricity, destroy the radios, shoot down enemy satellites, in order to make the situation easier to deal with even in subsequent missions, which are influenced precisely by what has been done previously . In theory, it is possible to tackle them in sequence without returningand at the base but by selecting them from the appropriate menu; there will be times when returning will be mandatory for narrative needs, in reality it is not infrequently recommended to do so because the activities to be performed within the Mother Base are many, the customizations useful or even just fun to try. Metal Gear Legacy ~Can I play Metal Gear V without trying the previous games?~ The answer is ~yes, no, boh!~ because the plot of Metal Gear is a real mess, so complex and on different temporal planes that it has given rise to fan-sites, discussion groups and even two books in an attempt to explain it. Obviously having played at least some of the main titles is a very important plus in terms of context and identification; we are also sure that the passage of time requires a smattering for most people. A minimal ~effort~ to do is to complete Ground Zeroes (among other things it was made free on both PlayStation 4 and Xbox One respectively in Plus and Games with Gold, on PC it is available at a lower price), for the rest we advise you to review the story at least by points, within the most complete pages dedicated to the series (in English): at this address there is that of Big Boss up to The Phantom Pain, at this other one, however, a complete interpretation. For the sake of completeness, here is a timeline of the main games dedicated to the series, in order of historical period narrated and not of release; maybe in the future we will come back with a dedicated special! Metal Gear Solid 3: Snake Eater (1964) Metal Gear Solid: Portable Ops (1970) Metal Gear Solid: Peace Walker (1974) Metal Gear Solid V: Ground Zeroes (1974/1975) Metal Gear Solid V: The Phantom Pain (1984) Metal Gear (1995) Metal Gear 2: Solid Snake (1999) Metal Gear Solid (The Twin Snakes) (2005) Metal Gear Solid 2: Sons of Liberty (2007/2009) Metal Gear Solid 4: Guns of the Patriots (2014) Metal Gear Rising: Revengeance (2018) An ocean of customizations Communication and interaction between Snake and the Mother Base takes place via iDroid, a sort of hyper-technological computer through which missions are accessed, to request equipment in the field, to upgrade the base itself. We will return to it shortly, in the meantime it is possible to recall it by pressing the bottom right of the DualShock 4 touch pad; in mission it also allows you to select one or more points to reach and possibly obtain additional information on the available objectives. The binoculars (associated with R1) is the fundamental gadget, because it allows you to have an overview of the position of the enemies and ~mark~ them with a red triangle permanently, so as to be able to better face the infiltration or combat phase. In the options it is possible to select an action control system and a shooter one, which in practice reverse the functions of the face buttons. We have chosen the second configuration: with R2 you use CQC hand-to-hand combat or you shoot in conjunction with aiming associated with L2; with X it is possible to crouch and then stretch out, with the square the Fulton system is activated to send objects and enemies to the base, bodies are transported and objects are collected; with the triangle you overcome obstacles; finally, with the circle, you run and jump forward to take cover. On horseback, which we take as an example as the first sidekick of the game, you can gallop quickly with the square button, you can use the weapons without problems and with X decide whether to position yourself on the sides of the steed to hide. The control system is quite fluid, it takes some time to memorize all the available variables but after a few hours we had no particular problems in carrying out all the actions we had in mind. However, there are some problems, for example when it happens to pick up nearby objects instead of bodies, or when the obstacles to overcome are not always automatically ~hooked~ after pressing the triangle button. Finally, we had some headaches in command of the tanks, given that the attack passes to the upper backbones by delegating acceleration to R2. When starting a mission from your base, as mentioned, you can select weapons, gadgets and shoulder support; on the battlefield instead ask for reinforcements in terms of ammunition and more, thanks to the expenditure of GMP funds. Fundamental resources in this sort of game within the game in which the Mother Base is expandable over time, thanks to a series of fully explorable platforms - full of goodies and mini-activities of various kinds - and fundamental departments for accessing new weapons, gadgets and customizations. We have among others the unity", "date": "2015-08-24", "grade": "8.8"}