{"name": "Devilish", "ref": "https://multiplayer.it/recensioni/devilish.html", "text": "Revenge of the Starfish Devilish is a game of the little-known Starfish and expands on the idea of the Paleolithic Break Out and Arkanoid. For those who don't remember the aforementioned titles, these are those games in which you maneuver a bar at the bottom of the screen which must reject a sphere which, by bouncing, destroys a series of colored bricks arranged in the upper part of the monitor. That simple but ingenious idea - like so many titles of that genesis period - is hilarious in its own way. The entire Starfish game is built on that foundation, which adds real levels to overcome, fills them with enemies and offers the possibility of using two bars. That's right, there are two palettes to maneuver, a classic red one placed at the bottom of the touch screen and locked there like its progenitor, and another much bolder, blue one, capable of moving on both screens when commanded from the D Pad -touch screen, microphone or other are not used-. Blue can also rotate on herself, by pressing L and R, in order to give a different angle to the ball according to the need for rebounding. Along the level there are always walls or objects to destroy and you have to make your way between them and the enemies to get to the end. After a certain number of stages you will have to face a final monster with a sensitive point to hit, always making the ball bounce on us. Add in a hackneyed story told through a few ugly static screens and you have Devilish. Ball Power! The idea recalls that of Odama, that is to build something more around a simple and old idea. Already from the introduction screen, however, one begins to understand that something has not gone so well. The botched graphics of the menus and the look of the protagonists - but in a title like this there must really be characters??? - somewhat questionable do not bode well, but it is when the real game starts that the low-production nature league makes itself felt. Let's start from a graphic that would look good on Nes formed as it is by infinitely repeated two-dimensional modules and a bad and monotonous isometric representation. Very few colors, designed light effects, monsters made with bad taste, detached from the context as well as animated in an approximate way complete the technical sector... And the beauty is that despite the paucity of what is shown on the screens, many times it manages to present obvious problems of update. Equally negative comments for the sound side with bad, uninspired and repetitive music. You can't play without muting the audio after a few seconds and the 380th time you've played the same digital guitar sample. Finally, the sound effects  five or six  are flat and badly digitised. Back to the past Perhaps by analyzing the playful side the results may vary? Of course not! If the underlying idea could also be nice, the mix of exploratory elements with those of puzzle games achieves far from good effects. Most of the time we find ourselves following the evolution of the ball without perhaps doing anything, wandering around without stimuli and reasons, without knowing where to go and collecting bonuses of dubious use. The many bonuses present, which give the possibility to widen the paddle or speed up the ball, etc. they are, in fact, almost completely useless in reaching the goal. The paucity and flatness of level design almost never offer the opportunity to learn refined control techniques. Then when you launch yourself into useless evolutions you collide with a control and shock system that is often inaccurate and decidedly not very intuitive. The ball, in fact, interacts with the paddle only if it bounces off it, you cannot, say, accompany it or adjust its trajectory. If on the one hand it reflects the original mechanics, on the other it degrades the depth of the game. It must be said that played on hard mode things improve a little, and the game becomes something closer to what it should have been. The greater speed of the ball makes everything more peppery ... pity that the slight enthusiasm soon fades into frustration and boredom due to a rather poorly designed difficulty curve. If you manage to overcome everything, you will still reach the end in an instant: the game is so short that in normal mode two / three hours will be enough to finish it and little more you are busy in difficult mode. Undoubtedly the idea behind Devilish is nice and with great potential, but it is also true that there are too many points against this title. Starting from a bad quality graphic sector, arriving at the boring music and passing through a style of the characters to say the leastquestionable, the light of the base is soon turned off. But it is the design of the levels that disappoints the most, practically never offering interesting cues or playful ideas and causing the game action to expire too often in complete randomness. However, many second-rate productions show a remarkable care in the realization. Devilish, on the other hand, is poorly finished and poorly designed, giving the idea that the game was made not only with little means but also with little desire. The numerous bugs that dot the whole are just one of the indicators that make us understand what is written above. Pro Immediate Suitable for short sessions Cons Bad technical realization Boring Game Design practically non-existent Reviewing a title unknown to most and poorly expected can be stimulating. When you unwrap the packaging of such a title, your critical sense, not clouded by the hype and completely ~white~, curiously begins to analyze secondary aspects such as the cover, the instruction manual or the ~how pretty it is~. the custody of DS games ~... The desire is to know if you have in your hands a hidden masterpiece to be disclosed to the masses - omnipotence mania???- or if instead the discovery will be only that of a mediocre production to forget quickly .", "date": "2006-02-17", "grade": null}