{"name": "The Swindle", "ref": "https://multiplayer.it/recensioni/154724-the-swindle-scuola-di-ladri.html", "text": "The intuition behind The Swindle is undoubtedly fascinating. In fact, we are talking about a predominantly stealth action platform, with a steampunk setting: an alternative London of the mid-nineteenth century. In the game we control a small army of skilled thieves and our goal is to rob a series of settings, set aside a substantial nest egg and use it to acquire ever new skills. The final mission that we will have the task of carrying out promises to be very difficult indeed: Scotland Yard is about to activate a surveillance device that could put an ~end~ to our nocturnal sorties, the Devil's Basilisk, and to prevent this from happening we have to act within 100 days and steal the device before it is operational. The plot is barely hinted at during the introduction, after which we find ourselves in the guild's balloon base with the possibility of consulting a computer to access the upgrades, which become increasingly more expensive, or of entering the rocket capsule to launch towards one of the five areas of the city, to be gradually unlocked through the purchase of specific upgrades. The maps are characterized by the presence of increasingly sophisticated guards, traps and alarm systems, but their connotation changes from attempt to attempt, given that they are generated by a procedural system. The same one that takes care of changing the appearance and name of the thief we take on the role of when he is eliminated in the middle of the action, thus consuming one of the hundred attempts before the ~real~ game over, the one that will lead us to start all over again from the beginning. The Swindle is a very interesting and beautiful to look at stealth-based platformer, but with some limitations Silence is easy The assumptions of the Size Five Games title therefore appear solid and, beyond a somewhat rough initial impact (mostly due to the lack of tutorials and indications that force you to try firsthand every maneuver and every operation to understand what it is), the concept of tempting fate in each stage, taking home as much money as possible, investing it to become more skilled and then returning to the fray is fascinating. There is no crafting and there is no loot (apart from money, of course), but the sense of progression appears clear-cut and evident, which spurs one to try and try again, perhaps robbing the buildings only partially to be able to put the sum obtained to be safe and avoid losing it if an alarm were to be triggered, an eventuality that would cause us to end up stunned by the police forces who arrived on the spot and would nullify the performance carried out up to that moment (in a chorus of explosive curses, of course). The calculation of the risk is one of the elements that are part of the gameplay of The Swindle, hand in hand with what has been described so far, namely the continuous search for the enhancement that can allow us to hack the crates or security systems, open armored doors or resisting falls from a certain height, double and triple jumps and being able to cling to walls to avoid falling or being noticed by enemies. But the skills available are really numerous and each of them adds something to the experience, drawing the picture of a gameplay that becomes more and more multifaceted and complex, while we become familiar with the mechanisms that regulate the stealth aspect to exploit them to our advantage. How do you change... As mentioned above, the scenarios change from game to game through a procedural system. On the one hand, it is an interesting feature, capable of significantly increasing the variety of a campaign that would otherwise remain fossilized on five fixed and immutable maps; on the other, it closes the door to a factor that could also have been part of the package, that is, the memorization of threats or enemies to prepare a strategy through trial and error. No, the developers thought that an approach based on randomness, on immediately adapting to different situations, trying to get the best out of them each time, was a better choice. We could also agree, were it not precisely for the randomness with which the procedural system places loot and enemies, sometimes defying the laws of common sense or, on the other hand, facing us with a very trivial, seamless challenge. However, there remains a strong characterization of the locations, substantially different from each other for the enemies and traps within them, as well as for the number of loots and their size. The stealth element has been implemented in a rather linear way, with the guards ~seeing~ within a range well indicated on the screen by a beam of yellow light, which sigit means that we will have to open or close doors, hide and, above all, always strike from behind to put the robot on duty offside and continue exploring. ...not to die The technical realization of The Swindle is excellent, both in terms of graphics and sound. We didn't fully appreciate the animations, but it is a precise choice, a ~puppet~ style that goes hand in hand with a really interesting and particular scenario and effects design, a factor that is anything but obvious of these times. The music also manages to effectively underline the most difficult situations and increase tension, for example when an alarm goes off and we have to quickly leave the stage to secure what we have collected up to that moment, before it's too late. All right, then? Unfortunately not, as two aspects of the experience left us perplexed. The first is the balancing of the difficulty, which generally appears hard but subject to blunders due to the procedural nature of the levels, with almost impossible situations that alternate with real health walks, the latter however quite rare. The exorbitant cost of the upgrades, essential to be able to unlock all the maps and, above all, have the minimum skills to be able to deal with them, then forces a real grinding on the initial stages, specifically the second and third. The second problem, perhaps even more serious, is the lack of precision of the controls, especially considering the performance required of us in order to complete the missions. It happens too often that the character sticks to the walls instead of simply jumping, frustrating the perfect moment to launch an attack, perhaps after several seconds of waiting for the situation to become favorable, and in the same way both jumps and the action of opening and closing the doors do not always produce the desired results, also giving rise to unfair and therefore very, very frustrating game overs.", "date": "2015-08-13", "grade": "7.5"}