{"name": "Uccelli di Rovio", "ref": "https://multiplayer.it/recensioni/154129-angry-birds-2-uccelli-di-rovio.html", "text": "That Angry Birds 2 is not actually the second episode of the Rovio series is clear and evident, given the amount of titles belonging to the main brand (not to mention the spin-offs) released over the last few years on mobile devices. However, it takes just a few minutes to play the game to understand that the nomenclature in this case is absolutely correct, and that we are in all respects faced with what a sequel should really be: an evolution of the original concept, a product capable to enrich the experience without distorting it or even revolutionizing it, going to improve its aspects but remaining in the path traced at the beginning. The know-how gained by Rovio (and by its by now numerous external studios) with other videogame projects, with merchandising and above all with cartoons, has contributed substantially to bringing the franchise to an unprecedented level of quality, which probably has not competitors on the App Store and Google Play for what is the beauty and quantity of the animations of the characters (set in the general framework of excellent graphics), the attention to the smallest details, the renewed strategic look of the gameplay and the enriched structure of the levels. Added to this, however, is a fairly limiting freemium approach, a factor that fans of the series were not used to. In fact, the five lives available to us recharge at a very slow pace, one per hour, and the exorbitant cost of ~continues~ and spells (we'll get to that shortly) represents a clear obstacle to progression. Of course, it is also true that this type of solution clearly rewards the skill of the player who manages to place the ~strikes~, that is to say destroy the structures of the usual green pigs with a single shot, seizing the usefulness of elements placed inside inside the scenarios which, once ~stimulated~, can do the dirty work for us and bring down the base on duty with a triumph of flying boards, exploding crates and the same enemies that end up ~smearing~ on the screen. Angry Birds 2 is a true sequel, a title of extraordinary value ... shame about the freemium approach Trider G7! Firebird! The assumptions of Angry Birds 2, as underlined at the beginning, are the same as always: the piglets have stolen the eggs and the birds have once again launched in pursuit, angry as never before. To the well-known Red, Chuck, the Blues, Matilda, Bomb and the huge Terence is added in this chapter Silver, a bird capable of diving on command, tracing a line perpendicular to the trajectory to hit targets otherwise out of reach. Silver's power is placed in the perspective of a repertoire that is particularly valued in this sequel: Red's ~breath~ can push very tall buildings to make them collapse on other pig positions, Chuck's shot proves to be particularly effective against wooden walls, while the ~doubling~ of the Blues proves devastating against ice surfaces, and so on. These are factors that take on an increasingly decisive role within the long campaign, currently made up of nine zones, for a total of no less than two hundred and forty levels. As for the renewed strategic look of the gameplay, which we mentioned above, it manifests itself precisely in the obligation to better manage one's roster of birds, exploiting their abilities to score ~strikes~ and keeping the units we deem necessary to tackle the next stages of each mission. Among the novelties of Angry Birds 2 the ~episodic~ structure of the levels stands out, divided into two, three or more portions which, however, must be completed relying only on the initial endowment of characters, even if playing one's cards well and unleashing hell allows to raise the score meter in the upper right corner and get important extra rolls. There has also been the adoption of a system that randomizes the components of the scenario, offering a different challenge with each new attempt, to the benefit of variety. Finally, in addition to the campaign, there is a tournament mode in the package in which we are asked, with a view to increasingly difficult competitions, to get as far as possible in a sequence of stages and compare our score with the other participants to get awards. Bigger, badder, birdier The boss fights (yes, there are those too!) best interpret the ~sectional~ philosophy we have talked about, forcing us to arrive at the battle with the commanders with still a few cartridges to shoot, in an attempt to cause them the necessary damage or make them fall off the platforms they are on. And how muchwhat can't be done? Naturally, game over occurs, with the possibility (timed throughout the day) of watching short advertising trailers in order to continue the game, get a life or a simple extra card. Freemium implications which, as mentioned at the beginning, however, appear much more binding than usual and are closely linked to the use of spells, special moves that can easily change the fate of a clash. Being forced to stop due to the temporary exhaustion of lives and the lack of emeralds (the game's hard currency) is inevitably frustrating, therefore the setting chosen by Rovio rewards skill but at the same time places a real barrier to our progress . Probably less experienced users with the series will suffer in particular from this choice, which ends up clipping the wings (it is appropriate to say it) to an otherwise irreproachable production, exciting for care in the realization and attention to detail, demanding and lasting. The hope is that the developers realize that they have focused a little too unscrupulously on monetization and decide to lighten the experience in this sense with the next, inevitable updates.", "date": "2015-08-04", "grade": "8.0"}