{"name": "Scathe", "ref": "https://multiplayer.it/recensioni/scathe-recensione.html", "text": "The Divine Creator and his brother Sacrilegious fight an eternal war whose balance has never been shaken. However, the Divine has a plan: to send his strongest hero, Scathe, to steal a powerful magic stick that will give him an advantage over his brother, giving him the victory. This is essentially the entire story that forms the backdrop to the action, the banality of which is the least of the problems that emerged while preparing the review of Scathe, a classic first-person shooter that would like to be a DOOM in a minor key, but that, simply, does not make it. There is some good Shooting is also fun Scathe immediately throws us into the action. After a few seconds of the game we pick up the first weapon, an assault rifle with infinite bullets, which will keep us company for the entire game. Then we will have to choose which of the three areas (a natural area, an industrial area and a temple) to face, of the labyrinth where the stick is hidden. At the beginning the action is decidedly satisfying: killing enemies is fun, blood abounds, the pace is fast and, despite some uncertainties of the artificial intelligence, between creatures stuck and others with erratic behavior, and the choice to entrust the narration to lines of dialogue that appear from time to time and which are frankly exhausting, also because poorly written, it all seems to work well for what the game aims to be. After all, we are dealing with a kind of Painkiller, so quantity certainly counts more than quality. In fact, if it were for the first few hours of the game, Kwalee's would be a great title, also by virtue of a not exactly brilliant, but still successful artistic direction. We are not at the level of DOOM Eternal, but turning demons into puddles of blood and guts in levels that seem to come from hell always has its charm. Moreover, the framerate is really stable, also by virtue of a well-made graphic creation, but certainly not very rich in effects and details. The level of challenge is really high: the player has a certain number of lives available, which he loses every time he is killed. When he runs out, he is taken to a special room, which forces him to retrace some maps (as we will see later, back tracking is a big problem). At the highest difficulty level, every mistake is paid for with one's life, which can be a significant stimulus for those looking for a challenging shooter, but you can still select a lower difficulty, adapting it to your needs. Or you can play cooperatively, sharing the suffering with someone else. So far so good, one might say. If it weren't that... Problems, problems, problems The crossbow doesn't work very well Unfortunately Scathe has many structural problems, which cannot be overlooked. The most obvious is that of game balance. Levels are designed as arenas where you battle wave after wave of enemies until you unlock exits to the next level. The designers' goal was certainly to make them more approachable in cooperative mode, but some choices were not well thought out. For example, in levels with the gates already open, you shouldn't do anything but run towards the exit, as killing enemies is simply a waste of time (there is an incremental score to look at, but it seems to be just an end in itself ). Instead, in those that require you to kill a certain amount of demons before being able to continue (classic arenas), you should find comfortable points in which to position yourself, attract the demons (which continue to appear without delay), kill them and continue until the exits are unlocked. The art direction isn't bad At that point the demons stop populating the area and you can also explore more comfortably, collecting all the hidden collectibles, in particular the Runes, which are used to unlock the six gates of the guardians. Playing in cooperative mode, little changes from this point of view, apart from the number of creatures that attack us at the same time. Often going on an adventure is more the result of boredom than a real need dictated by the game.Sempre speaking of levels, Scathe has an obvious backtracking problem. The forty-nine maps are connected by different outputs which in theory allow you to tackle the game in a non-linear way. Unfortunately it also happens to reach areas that are too difficult for our current state or in any case to have to go back to reach an area that was left out. The solution chosen was to leave the burden of retracing the levels already faced to the player. Do it oncelta may not annoy, but when, in the advanced stages, retracing one's steps becomes an all too regular practice, the weight of repetition is felt all right, also because many maps are not exceptional and the variety of enemies leaves something to be desired. Speaking of the latter, the developers have adopted a very classic approach: they are few and only change in color and some detail between the three biomes present. So no surprises, apart from the bosses. The latter, fortunately, are generally well done. Only one is a little understated, but that's forgiven, as the others offer an excellent challenge and have well-researched and challenging attack patterns. The weapons Great enemy do so much harm Another huge problem is that of the balance of weapons. Removing the crossbow, which for now has bugs that make it unusable (at least in our gaming experience), the others are well made and decidedly satisfying. For example, the shotgun performs very well, thanks to the gore effects that accompany each kill and when you discover it it makes you want to use it throughout the game. So, you may be wondering, where is the issue? Simple: apart from the starting weapon, a kind of assault rifle with rockets as secondary fire, all the others require you to go around looking for magazines. Unfortunately, very few of these are found around the maps, so you end up using the best weapons very little, always favoring the initial one, which allows you to shoot ad libitum and which, in any case, is not so less powerful than the others and it's fine for most situations. A similar argument can be made for the other offensive tools available to Scathe, i.e. spells that are recharged by collecting the mana left by the enemies in the form of small crystals: unfortunately some seem to have been placed only to make up numbers, while others are far too powerful and break the already shaky balance of the game. The three biomes are different from each other Even the dash ability, which allows you to quickly eliminate weaker enemies and become temporarily invincible, feels a bit too powerful, especially when you understand how to make the most of it. The end result is a shooter where the flaws end up take over the whole experience, eventually overshadowing the merits. Getting to the end and feeling almost annoyed for playing is not a good feeling. The disaster is definitely not total, but we were hoping for something really different.", "date": "2022-09-07", "grade": "5.0"}