{"name": "Il dramma della guerra", "ref": "https://multiplayer.it/recensioni/153783-this-war-of-mine-il-dramma-della-guerra.html", "text": "When, at the end of 2014, we reviewed This War of Mine in its PC version, we were fully satisfied by the excellent work done by 11 Bit Studios in revisiting the survival game genre in a perhaps not particularly original key as far as development is concerned of gameplay, but extraordinarily fascinating in terms of setting. In fact, the title of the Polish team allows you to take control of a group of characters in a town while the latter is experiencing the drama of an ongoing war; the most interesting thing is that the protagonists are not expert trained soldiers, but ordinary people forced to suffer a conflict that literally turns their lives upside down, forcing them to put the primordial instinct of survival as a priority. With all that this entails. Even on tablets This War of Mine allows you to reflect on the drama of a war experienced by civilians War in the palm of your hand This War of Mine is a rather simple title in terms of gameplay, which without too many frills is divided into two main sections: daytime and nighttime. In the first, in a sort of The Sims in a dramatic sauce, you find yourself managing the shelter of your characters by building objects, improving the structures, and in any case trying to ensure the safety of the inhabitants. The key aspects are those of nutrition, physical and mental health, which must be provided respectively with food, medicines and leisure. For example, one of the first things to take care of is undoubtedly the construction of the beds, because a bad rest can irreparably compromise the very fragile balance of the protagonists. The precariousness of existence is a concept that is always very clear in the effort of Polish developers, who manage to convey in an excellent way the dramatic impact that a war can have on the population. Even more so if the night phase is also taken into consideration, during which it is necessary to decide whether to leave the characters at home, perhaps to rest or stand guard, or whether to send one of them to recover resources and materials in other buildings. It is in this case that This War of Mine probably gives its best, since the exploratory element is accompanied by the need to avoid encounters that could easily take on dramatic tones. The very fact of stealing from other people in difficulty, or even finding yourself killing them, also brings with it moral implications capable of leading to depression and suicide of one's character. After a rather long conversion period, 11 Bit Studios has therefore released This War of Mine also on iOS and Android tablets at a price of  14.99, therefore even more interesting than the  18.99 of Steam. Obviously beyond the cost, in these cases the evaluation of the quality of the conversion and, above all, the adaptation of the interface to the touch screen is of fundamental importance. Fortunately, from this point of view, the result is undoubtedly more than convincing to the point that, without knowing the history of the product, one might think that the tablet version is actually the main one. This is because, as can easily be understood, it is precisely by replicating a type of mouse-based control system that touch screens are able to offer the best of themselves; all the more reason given that This War of Mine is not a particularly heavy or complex title from this point of view, with most of the commands that can be given with a simple touch and that the few menus are very clear and understandable. The only small problems we encountered occurred in the selection of elements very close to each other, perhaps even with the presence of an overlapping character; however, the general slow pace makes the problem entirely acceptable. The bugs still present in version 1.2 we tested are a little less understandable, capable of irreparably blocking the game on the backpack management screen during night raids and forcing you to restart the application losing your progress. No doubt with future updates the matter will be resolved, but at present we think it is right to underline it. Also from a graphic point of view, especially with recent hardware equipped with high resolution displays, This War of Mine manages to return an image quality that is particularly faithful to the PC version, with the stylistic choice of the effect drawn in charcoal being very apt.", "date": "2015-07-27", "grade": "8.2"}