{"name": "Il tormento dei giusti", "ref": "https://multiplayer.it/recensioni/153757-game-of-thrones-episode-5-a-nest-of-vipers-il-tormento-dei-giusti.html", "text": "This you are about to read is the review of the fifth episode of Game of Thrones - A Telltale Games Series. The complete series consists of six English-language episodes. The cost of each single episode is 4.99, the complete package 27.99. The following text is reasonably lacking in anticipation. Nest of Vipers is nearly perfect, and Game of Thrones is Telltale's best series since The Walking Dead season 1. Not even the timed events made us grind our teeth this time. Reason is the source material from which the series is based. If you want to make a video game where the only thing that matters are the narrative choices, Game of Thrones is a concentration of insoluble dilemmas, the perfect saga from which to take inspiration. The stakes are high, tensions always at the limit and morality a vast misty land in which everyone has lost their coordinates. Of course, you need to know how to write Game of Thrones, but the Telltale screenwriters assigned to this project studied George Martin's method in detail and managed to reproduce his literary deeds on the screen. The prime example of this knowledge of the saga is the credibility with which the original characters, such as Cersei, Tyrion and Ramsey speak. Considering that many players have also seen them in the television adaptation of the saga, they have become real in their minds. Slipping badly was therefore very easy, but no: the time to place the pawns on the chessboard and the game of thrones began to reap its bloodshed as expected, without a comma out of place. Only the graphics continue to detract from the quality of the game. Why this series hasn't been as curated in presentation as Tales from the Borderlands or The Wolf Among Us remains a mystery. It's a shame because as we've been repeating since the first episode, the artist direction is extremely spot on. We'll have to settle for the excellent dubbing. That, at least, lives up to the lyrics it recites. Oh, one last thing before we get into episode hell. The protagonists of the series, all members of House Forrester, are reminiscent of the Starks of Winterfell. We agree, but who doesn't love the Starks? Objection rejected. Two hours of breath-taking choices await us in Game of Thrones: Nest of Vipers I lunge to the heart Rodrick is the rock on which the Forrester family rests, as well as the best defined character of the series, at least among those that can be interpreted by the player. Unfortunately for the other family members, Rodrick is lame in spirit and body. Witnessing and participating in her helplessness is tough. Our words and choices carry great weight, but only negatively. It seems that whatever we do, the only result is to shed innocent blood instead of sparing it. Rodrick is also the character in the series who follows the clearest narrative arc, and in fact we saw him get back on his feet little by little, regain his dignity and, at the end of the episode, redeem himself by burning his stick to wear the armor. However, we know that things never go well when playing the game of thrones, and in fact a tragedy awaits us. Without going into details, let's just say that the shock follows one of those choices that makes you want to play the episode all over again to see how things might have turned out if we'd made a different decision. Gared and Talia have always been the vaguest characters of the season but, with the day of judgment approaching for the House of Forrester, their stories take on vital importance and give us the sense of urgency of those who must act as soon as possible to avoid catastrophe. Mira is more entangled than ever in the dangerous intrigues of King's Landing and is in danger of having her head roll into a basket. If we are so passionate about her story, which would seem the least exciting, it is because we recognize that it was our decisions that got her into trouble. Mira, and we with her, was the architect of her own destiny, be it happy or tragic. The same for Gared, ambiguous and standoffish, lost beyond the Wall in a desperate search for a mythical place that can save the house from ruin. Finally there is Asher, a bold mercenary, a mirror that reflects the light of his friend Bershka, one of the most charismatic characters in the series together with Rodrick. Asher finally takes the stage when he must convince the former gladiators of Meereen to follow him. Since this scene also includes nearly all of the episode's action, it's important to note that for the first time we've had timed events combat engage us. There is much more at stake than Asher's life and the fight logically follows the previous actions. Every shot anscored is a notch in favor of the Forresters and the tension for the outcome of the confrontation makes us forget that we are pressing keys on command. The same happens when we have to target a rabbit with Gared. In fact, we are at stake for personal respect in front of the girl from the Free People and therefore the possibility of continuing the search for the mythical place. In short, much more than a dinner. The developers were therefore able to overcome the limits of the interaction system with the weight of the stake. And this is an important merit. Now we can only wait with bated breath for the conclusion of the series.", "date": "2015-07-26", "grade": "8.4"}