{"name": "Il viaggio continua su PlayStation 4", "ref": "https://multiplayer.it/recensioni/153512-journey-il-viaggio-continua-su-playstation-4.html", "text": "Just over three years ago Journey represented one of the highest peaks ever reached by titles available for the PlayStation Network, both in terms of sales and in terms of feedback from critics and players. Third work of the independent development team Thatgamecompany and final vision in narrative and visual terms, before concluding the relationship with Sony and dedicating oneself to a new self-published project of which we do not yet know the platform and name. A game not for everyone, as often happens with titles that offer an introspective and intense experience, not very prone to action and with a very limited longevity in relation to the purchase price. A product, however, which if in its own right manages to give a memorable experience that leaves you truly satisfied, as happened to us during the review phase. Three years later, Sony has decided to bring the original title to PlayStation 4 as well, entrusting the conversion to Tricky Pixels together with slight changes regarding the technical sector. The good thing is that the game is free for those who have already bought the original digital version, while for new buyers the price is set at around 15 euros for the download, or 12 euros if you subscribe to the Plus service, until to 27 July. We tried Journey, after three years, in the ~new~ version for PlayStation 4 Playstation 4 trophies Journey offers the same 14 trophies of the original title but to be combined in gamertags, linked to the discovery of the secrets present within the game, to the rock paintings and to the interaction with other online players. Few but good nonetheless, certainly an incentive to replay the title to appreciate all its facets. The same emotions as then To find out what we think about Journey in detail, we refer you to the review of the original title, also because our opinion has not changed one iota nor has the game aged given its particular nature; in this article of ours we focus instead on purely technical aspects and on a couple of additional notes. Unlike the original, Journey on PlayStation 4 features 1080p resolution and 60 frames per second smoothness, as well as Motion Blur removal, with no impact to performance. The image is therefore even more defined (even if it must be said that the blur effect of the Motion Blur can be more appreciable in certain contexts) and the result is that of a graphic sector that highlights the excellent artistic side even more of the game, enhanced by the soft stroke, the play of light and the creation of the sand, with an image that now flows even more fluidly than in the past. Let me be clear, the impact is similar - contextualized - to that of the original title, and this is good because it remains one of the strengths of the production, together with the simply masterful soundtrack created by Austin Wintory, which we have seen at work also in The Banner Saga and The Order: 1886. In the new trial of the title on PlayStation 4 we were able to play almost the entire adventure together with another player, met by chance during the game according to a setting already seen, for example, in Souls by From Software, in this case without even the name of your partner. The only form of interaction was possible using the circle button, in order to emit a sound in an incomprehensible language useful for example to attract attention or invite him to follow us, a signal that can be interpreted according to his free will. An expedient that allowed us to appreciate even more the visual language chosen by Thatgamecompany for its game, sublimated by some figures that we drew on the sand before concluding the adventure together, a sort of seal for having lived it together. As already mentioned at the time, Journey's only small/big flaw is its brevity: our journey ended around two hours, a really short duration also in relation to the price, above all because it could have continued without excessively lengthening the broth . Two beautiful, exciting, entrancing and different hours from the usual... but still two hours, an element to take into consideration if you are not willing to immerse yourself completely in the title and in the narrative idea created by the Californian developer.", "date": "2015-07-21", "grade": "9.0"}