{"name": "Non se ne sentiva la mancanza", "ref": "https://multiplayer.it/recensioni/153346-godzilla-non-se-ne-sentiva-la-mancanza.html", "text": "We are willing to bet that you have not realized it, but it has been some time since the last appearance on the market of a title belonging to the Godzilla saga. The last in chronological order was in fact Godzilla: Unleashed, published by Atari in the now distant 2007 and at the time rather beaten by critics, both in the Wii version and in its PlayStation 2 counterpart. If the cinematic Godzilla has always been synonymous with rather extreme trash, since its inception, the one represented in video games has probably managed to take this definition even further and achieve embarrassing results, to say the least. It is not at all surprising then that this new chapter already has all the credentials to be remembered as one of the poorest titles of this generation and can compete on equal terms with many of the worst abortions churned out in the last fifteen years. Developed by the Japanese studio Natsume - best known for the Harvest Moon series - Godzilla is an arcade action that allows the player to take on the role of the beast, with the only plausible purpose of destroying anything in front of him. It all began sixty years ago, when Godzilla was first sighted in a Japanese town. Net of the disaster, the discovery of G-energy proved to be critical to humanity, while the G-Force unit was specifically created to handle plausible future disasters. Now, after decades of tranquility, Godzilla has returned from the depths of the sea, ready to chew on a lot of steel and reinforced concrete. Compelling, right? Not to be in the skin anymore! Action uninspired and made lazily, Godzilla does not honor the fans of the franchise Playstation 4 trophies There are 45 collectible Trophies, of which only 3 are gold and 11 are silver. The difficulty in obtaining them is not particularly high, but the very poor quality of the gaming experience still makes platinum a difficult undertaking. Embarrassment, so much embarrassment The main mode, called God of Destruction, allows you to land on the map as Godzilla or another kaiju on the roster - to be unlocked gradually - and the player's task will be to destroy as many buildings and vehicles as possible, taking particular care for the energy generators scattered throughout the map, which will gradually be razed to the ground. By doing so, through the absorption of an ever higher amount of G energy, you will have in your hands a more violent, thirsty for destruction and dangerous creature. Each level develops through a tree diagram and for each new area the direction to take must be chosen, based on which the difficulty of the next stage will also change. This evolution follows hand in hand the rotation of human leaders at the top of defense operations, who will be punctually replaced after failing in their task. Leaving aside the ~extraordinary~ caliber of the dialogues entertained in the heat of the battle between an anonymous G-Force operator and the Prime Minister on duty, effective above all for falling asleep in the evening, the almost total uselessness of the change of leader is at least clear and it is also one of the most absurd variables of this title. According to what is described in the early stages of the game, the substitution should in fact have more or less evident influences on the progress of the raids, create tactical variations, somehow put the player in difficulty. There's only one problem: we didn't notice it. Yes, because one of the many problems that afflicts this game concerns the general static nature of the situations that are experienced once you take the field. The movements of the beast are awkward, the changes of direction excessively slow and cumbersome, the attacks that can be carried out always appear the same, as there is no progression in the combos as you progress between one level and another. The appropriate Evolution section, in which the upgrades of each kaiju can only be applied after obtaining sufficient materials to unlock each slot, has not really been able to convince us. In fact, it would have been much better to insert a direct skill evolution system, already within the arenas, above all in light of the lack of interest that is generated in retracing the same stages over and over again. Moreover, this last consideration alone could already serve to decree the complete failure of the project: after all, if you take away the replayability from an arcade, what remains is very little. The idea used could have worked only in the presence of a qualitatively discreet title, which would entice you to retrace the medsth sections and would allow approaches of various kinds. As you may have already guessed, this did not happen at all and there are no leaderboards that hold, when a product of this kind is not able to entertain its user even for a minute of the time dedicated to it. Furthermore, even the clashes with the other kaiju guided by the artificial intelligence do not shine for dynamism and are never fun to experience, above all due to a bad balance in difficulty, to be attributed in the first instance to the embarrassing control system. If at an easy or normal level it becomes practically impossible to get knocked down and the incursion assumes first-rate narcoleptic proportions, by selecting the more demanding path one is instead punished in a senseless way, since there are no tactical alternatives at all - think, for example, of dodging or saves - which would be necessary to develop a winning strategy in an outnumbered situation. Monotony is a constant plague, exacerbated by the presence of tiny, anonymous settings, so ugly and with such a poor design as to be even annoying. The buildings seem to be made of plastic, they are repeated in identical rows, on a completely bare playing area of dimensions that defining cramped is an understatement. The only positive note in our opinion is the presence of 46 different creatures, inspired by Japanese television series and films, including SpaceGodzilla, Mecha-King Ghidorah, Hedora and many others. A detailed description is also provided for each of them, within a special section of the game, which contains various information regarding their first appearance and realization. Unlocked trophy: ~boredom boost~ As an alternative to the main arcade mode, Godzilla also offers the King of the Kaiju mode, in which you can face and defeat the other creatures on the roster, through 5 cumulative rounds. Defeating opponents is functional to unlocking the related descriptions located in the appropriate section that we have just described, but it really offers nothing else, apart from further minutes of slowness, predictability, pessimism and annoyance. And if the presence of a PvP multiplayer mode fills the already large quantitative-qualitative gap? Not for the idea, but what questions. In online sessions it is possible to decide to opt for a 2 or 3 player battle, even within private lobbies. Even on this front, the problems do not change, although the three-player mode seemed slightly more passable to us and, at least at times, a little more fun than the traditional one-on-one. However, these sensations do not last very long, we can guarantee it. While on the one hand the idiocy of artificial intelligence, repeatedly showcased in the other game modes, is missing, the enormous problems that this title also carries with it online remain, including the absence of worthy interactive variables to be exploited against another human mind, the excessive linearity of the combos and even more the laughable design of the levels. The constant slowdowns and very frequent lag problems complete the work. In closing, let's spend a few words also for the Diorama mode, which in hindsight can take home the palm as a superfluous section par excellence. Through this tool it is in fact possible to create static scenarios, which can be ~decorated~ using characters and material collected during the battles, with totally absent purposes and a deliberate rape of good taste.", "date": "2015-07-17", "grade": "3.0"}