{"name": "Le origini di Magic", "ref": "https://multiplayer.it/recensioni/153180-magic-duels-origins-le-origini-di-magic.html", "text": "After years of small but constant, sometimes even negative, changes to a well-tested and decidedly inward-looking game formula, there is no doubt that it was the cumbersome and violent entry of the giant Blizzard with its Hearthstone: Heroes of Warcraft, a finally convince Wizards of the Coast to rethink the presence on the gaming market of its most famous and profitable property from scratch. And so, after years of Duels of the Planeswalker, today we find ourselves talking about Magic Duels: Origins, the new formula devised by the Washington giant to offer all players in the world a version that finally lives up to expectations of its card game, exactly what has allowed the entire genre to establish itself on the market and which, especially in recent years, seems to be experiencing a renaissance especially on tablets and smartphones. This new product is clearly a starting point towards something greater that will probably reach maturity in the coming months, if not years, but which already represents a very tantalizing and pleasant pastime, albeit limited in its scope by a few understandable. But let's go in order and try to understand how much good there is in the new Magic Duels and obviously also what didn't fully convince us. Magic Duel: Origins marks the long-awaited rebirth of the card game, but it will have to evolve in the coming months Let's forget about the past Let's start immediately by saying that Magic Duels: Origins is a free to play, one of the good ones if you allow us to judge. The game can be downloaded without spending a euro and all its contents are available to the player without any type of in-app purchase except, of course, for the cards, as we will see later. Wizards' intention to offer with this title a real guide for newbies is still very evident, for those who have perhaps only heard of Magic but have never had the opportunity and the desire to embark on a hobby that it can become too expensive and overwhelming in an instant if you don't have a friend or shopkeeper next to you ready to hold your hand on the first occasions of getting to know the product. This Origins, just as happened in the past with the various Planeswalkers, is literally littered with tutorials and advice: all the basic rules and advanced tactics can be studied through small missions, called skills, which allow you to face pre-set scenarios to understand all the way through the strategy that underlies the game. And then, once you're in the game, you can access contextual help that explains the rules and special functions of the cards with just a few lines of text. Compared to the past, however, this time all this dynamic help system is just a pretext to continue making the digital version a sort of bridge between those who are beginners and those who already know Magic: The Gathering in depth and want to finally find a way to play a few games on the fly without having to carry around his favorite deck every time. Going into the details of the contents, Origins offers a campaign mode focused on the story of five different Planeswalkers that narrates their transformation from teenagers with supernatural abilities to real walkers between the planes, through five missions of increasing difficulty for each. These strictly single-player challenges will be based on pre-set, non-editable decks of a color directly related to the nature of the Planeswalkers themselves. From mission to mission, the deck will be automatically enhanced to allow us to face the next battle more easily. Outside of a couple of very difficult battles for a balancing issue, the campaign flows far too quickly and allows you to begin to understand what Magic knows and can offer in an instant. Archived this part of the game we can devote ourselves to battles. These are one-on-one challenges with artificial intelligence or human opponents, in the latter case with the possibility of choosing between friends or challengers chosen through a matchmaking which in reality, during our test, was never very clear. In fact, there seems to be a ranking system with levels assigned based on the amount of victories, but we are definitely far from Hearthstone's highly structured (and repetitive) system. It is also possible to play a game in the Two Headed Giant mode which finally returns to the digital version of Magic with this Origins. It is a two against two in which we can also play in split screen on the same computer with a friend of ours against human players or the inevitable computer. All battles can befaced exclusively with a deck built from scratch and this is where the cornerstone of Magic Duels comes into play.  they made us 'o mazz' tant pe 'll ave' Compared to the past in the Planeswalkers series, this time the game offers a completely free and extremely versatile deck building system. It will be possible to create a practically infinite number of decks (there is a limit of 30 but you will not notice it) simply by choosing the cards from your collection with the help of a whole series of extremely comfortable and immediate filters, which allow you to to study color compositions, synergies and of course mana curves. The autocompletion of the deck is also back, which makes it easier to understand the strategies that are the basis of the best library constructions, simply by choosing the favorite cards and leaving the artificial intelligence with the task of reaching the 60 units necessary to close the deck. Zero limitations also regarding the choice of lands. This is where the only payout mechanic in the entire game lurks. By completing the campaigns for the first time and winning the 1vs1 challenges (even against artificial intelligence), but also by carrying out the skill missions, we will earn coins that we can spend to buy booster packs: sachets containing six cards that will be added to the our collection once open. It takes 150 coins to buy a package and consider that each campaign ~gives away~ this amount of coins, while a challenge against a human opponent, if won, allows you to put 20 coins in your pocket (15 in the case of a battle against the computer at maximum level of difficulty). It won't be that difficult to unlock the entire collection simply by playing, as the coin donation seemed quite generous to us, but obviously it will be a long and tiring road. Naturally, the game will also allow you to spend real money to buy coins at the conversion rate of 1.79 for 150 coins (therefore a booster pack). There is also a small aesthetic function since it will be possible to spend small amounts to transform the cards in your collection, or an entire deck, into the relative shiny foil version. Precisely with regard to the collection we feel we can probably make the most important criticism of the game. Origins currently contains 251 different cards composed in part by cards from previous base sets and expansions (indicated by the Duels symbol) and in the vast majority by cards from Origins, the new core set of the game (indicated by its logo). It might seem like a lot but we guarantee you that, especially for those who want to devote themselves to particularly high-performance single-color or two-color decks, the choice is truly reduced to the bone. On paper, the Magic Duels project is extremely interesting given that Wizards intends to no longer release other versions of the game but to ~limit itself~ to updating this one constantly and completely free of charge both from a gameplay and modality point of view and, above all , with new cards as new expansions and future core sets release. This means that in one or two years we could find ourselves faced with an endless and extremely attractive number of cards, without ever losing our collection over time. At the moment, however, we feel like criticizing a decision that makes the freedom granted to the player appear rather limited. Why not already implement at least the latest expansion block released? Furthermore, for those who may have become accustomed to the mechanics of Hearthstone: Heroes of Warcraft over time, it must be emphasized that in Origins it will not be possible to ~break~ the cards found in order to build others. The only way to get them is to ~physically~ unwrap them. Although it must be said that compared to Blizzard's card game, Magic allows you to have a maximum number of copies for each card, depending on its degree of rarity. This is a small limitation that could make the most ardent fans of the Wizards card game turn up their noses but which on the one hand could also lead to several surprises in terms of meta-game (in fact, it will not be possible to have the exact same decks running in ~physical~ competitions due to this maximum number of specimens per card) and on the other it ensures that in the long run the collection is necessarily completed as it is not possible to continue finding duplicates indefinitely. Watching you learn There's still one last element of Magic Duels gameplay missing, the one that probably best highlights how well Hearthstone did Magic: quests. Just like in Blizzard's card game, it will also be possible in Originsle have up to three daily missions (with the possibility of discarding one every 24 hours) which, if completed, will give access to rich loots of coins. In addition there is also a community quest with very complex objectives but which involve the entire user base and last a week. On the same page there is also a small space dedicated to tournaments but, as in the case of the ranking and the total absence of a spectator mode, it is clear that at least in this phase the entire e-Sport component has been practically set aside by Wizards pending probably of better times and the first substantial updates. We close our review with a few small notes regarding the technical component of the game. With an operation already started on the occasion of the last two Duels of the Planeswalkers, Origins also offers a decidedly minimal and basic graphic aspect. The board is even more neutral and if possible anonymous, to give greater prominence to the cards, while the animations and effects that ~beautify~ the clashes and the various spells are particularly simple and in any case all can be eliminated from the settings if you don't like them these trappings. Magic Duels: Origins is a card game that evidently comes from a very strong physical counterpart and does nothing to hide its origin by detaching itself from Hearthstone and other card games that are much more elaborate from a visual point of view. We do not feel like judging this choice because it still represents a precise design choice that gives its best, obviously, in the tablet and smartphone field since the battery and the heating of the device will benefit from it. Furthermore, in the iOS environment, compared to its competitor mentioned several times, the game will be freely playable even offline, albeit with some limitations regarding the money that can be earned and the elements for unlocking the campaign. What made us turn up our noses were the small computer graphics sequences that underline the conclusion of the adventure of each Planeswalker and which appeared to us truly anachronistic as well as badly animated. Small note of demerit also for the musical accompaniment, repetitive and devoid of bite. Finally, the game is completely localized in Italian.", "date": "2015-07-14", "grade": "8.5"}