{"name": "WWE Raw vs Smackdown 2006 - Recensione", "ref": "https://multiplayer.it/recensioni/wwe-raw-vs-smackdown-2006-recensione.html", "text": "Portable Divas and Superstars On these same pages, at the end of 2005, we celebrated WWE Raw vs Smackdown 2006 on PlayStation 2 as the best wrestling game ever released on any format. Finally the time has come to present the version destined for the PlayStation Portable which promises to keep the greatness of the game intact in all its aspects. Did things really go like this? You will find out only by continuing to read this review. Even More Ways to Wrestle After the quick intro (which will alternately display the initials of Raw or that of Smackdown too bad they don't exploit the entire widescreen of the PSP, exactly like the images displayed during loading), we triumphantly enter the main menu of the game and giving a Quickly viewing the game possibilities provided, we quickly realize that Yuke's programmers have faithfully reproduced the game modes present in the PS2 version. In addition to the presence of all the possibilities present in the past editions (and therefore single matches, tag matches, three way matches, fatal fours, royal rumbles which will also allow the presence of 6 wrestlers simultaneously on screen, elimination chamber and many others) among the ~new~ we see the legendary ~Buried Alive Match~ (to understand each other, that particular situation in which you have to lock the opponent in a tomb ... a match clearly born with the arrival of Undertaker in the federation ...) and other variations on the theme such as Bar Brawl or the fullfill your fantasy (more elaborated version of the classic bra & panties match where the splendid WWE divas have to undress their opponent) and clear improvements as regards cages and ladder matches: in the latter, a much freer and more versatile use of the straight to really hurt your opponent. In general, all the modes have been positively revised (probably even after receiving feedback from fans): for example, in the Rumble it will be much easier to get out than last year, making the gaming experience more similar to the real counterpart. Yuke's programmers have faithfully reproduced the game modes present in the PS2 version and have given us some extra mini games Even More Ways to Wrestle As for the multiplayer, good and bad news: absent any possibility of playing online, we can still make up for it with the ad hoc mode, with which we can fight each other in the company of up to 3 other players. All types of matches are available and we will also be able to give away titles created specifically for wireless play in company. As if that weren't enough, the ~General Manager~ mode has also been confirmed on PSP, which can be considered as a reduced version of a classic management game such as Football Manager and the like, only that here we will clearly find ourselves managing one of the federation's shows and our goal the last will be to have a greater audience than our antagonist. We are not dealing with a product capable of contrasting the masterpieces of the genre but it is undoubtedly a ~plus~ that could excite many wrestling maniacs also because the interface and game mechanics are clear and simple to learn as well as being very suitable for use portable. Even More Ways to Wrestle And on PSP there is also the editor with all the excellent features already highlighted in the PS2 version. If we add to this the confirmed presence of the career mode (identical to the home counterpart) which can be transferred from one console to another without any problem (and the connection between the two machines will also allow you to unlock some exclusive extras) and the introduction of some exclusive mini-games for PSP (Texan poker, Eugene's airplane and WWE trivia: especially the latter is really enjoyable and fun), we can state that the Yuke's programmers have done a sensational job to keep the PSP (and in some ways increased) the greatness of Raw vs Smackdown 2006 in terms of game modes. And on PSP there is also the editor with all the excellent features already highlighted in the PS2 version The official guide to WWE Raw vs Smackdown 2006 Multiplayer.it Edizioni has launched in the best online shops and in all the cities of Italy, the official guide of the game entirely localized in Italian at the recommended price of only 14.90. The guide is fully printed in color with approximately 270 pages full of photos and details on all the wrestlers on the game's roster. The considerable depth, as reported in this review, of WWE Raw vs Smackdown 2006 and the many ~secrets~ to be discovered in thegame lead to warmly recommend the guide to really get the best out of the Yuke's - THQ pairing title and not miss any of the many features of the best Wrestling in PSP or PlayStation 2 format... or for both! The Roster The time has almost come to get into the ring, but first let's analyze another very important element in a Wrestling game: the characters available. WWE Raw vs Smackdown 2006 on PSP has the same roster as the PS2 version, updated to spring of last year with the presence of some wrestlers who are no longer in the federation (Jericho, Christian, Hassan, Charlie Hass, Spike Dudley and others) while not the latest stars of the WWE firmament appear such as MNM, Lashley, Misteeeer Ken Kennedy. In addition to signaling the presence of Eddie Guerrero ~forever in our hearts~ among the wrestlers, a massive increase in legends present (British Bulldog, Andr The Giant, The Di Biase, Rock, Mankind, Steve Austin, Jack The Snake and others) with Hulk Hogan even revived in the 80s version as a real american, and in the villain version (yours truly favorite) as leader of the New World Order (4 Life!). The Gameplay is there! Wonder of wonders, Raw vs Smackdown 2006 on PSP retains the wonderful gameplay we already celebrated in the PS2 version. If we exclude some minimal inconvenience of a ~material~ nature (for example, pressing the buttons quickly on the PSP is not very comfortable and the location of the select button is not exactly optimal) for the rest we can only confirm what has already been said for Wrestling in a home format. So here is a congruous number of minigames very suitable for particular situations typically from Wrestling, and game times slowed down decidedly to give a greater simulation depth to the title. Then forget the ~invented~ collisions and the incomprehensibility of some holds and counterholds (this time on the screen it will be possible to see which key to press to counter the opponent ... clearly you will need excellent reflexes): this time the gameplay is of absolute precision. wonder of wonders, Raw vs Smackdown 2006 on PSP retains the wonderful gameplay we already celebrated in the PS2 version The Gameplay is there! But the game, compared to previous years, has also been completely rethought in other important aspects such as the absolute novelty of the resistance bar which, shot after shot, will drop to zero, no longer allowing any movement to our wrestler until after pressing the Select key for a good amount of time. If the importance of this element is difficult to explain in words, when tested in the ring you will easily realize how this aspect will completely change the game strategy, giving RvS2006 an absolutely new tactical component for the series. The finisher loading bar has also been completely revised: the latter will load in direct proportion to the spectacularity of our moves. Above all, once available, the special move can be used instantly to cause more damage to the opponent but with the possibility of losing it completely in the event that it is not possible to execute it in a short time. The other choice is to keep it by pressing the L2 and L1 keys together and use it when we want, preferably with the indicator full for greater ~efficiency~ of the move which in any case will never have the results of the ~immediate~ finisher. The Gameplay is there! If you thought that the revolution had ended here, you are wrong since the Yuke's have done even more since, in addition to an artificial intelligence finally worthy of the name compared to past editions, within the options also in this PSP version we will be able modify a series of parameters both in the capabilities of the AI, and for the characteristics of the game itself (the loading speed of the finisher, the intensity of the damage of the latter and much more) thus allowing the user to customize through and through your gaming experience. Finally, it should be noted that the programmers have decided to continue on the path of realism as regards the relationships between the wrestlers: therefore forget about being able to do a body slam at Big Show with Rey Misterio just to be clear it should be noted how the programmers have decided to continue on the path of realism as regards the relationships between the wrestlers Finally music but We can only continue to praise Raw vs Smackdown 2006 in terms of graphics. We are undoubtedly facing one of the best productions seen to date on PSP: the three-dimensional polygonal models of the wrestlers are of absolute value with excelanimation bodies for each superstar. It must be admitted that there is a massive presence of aliasing in the outlines of the figures but for the moment it seems that this defect is congenital in every videogame creation on the Portable PlayStation. Moreover, there is not even one of the arenas seen on PlayStation and made with great care, without neglecting any detail. Due to the technical limitations of the portable console, the public has returned to being two-dimensional but still ~makes colour~ thanks to its dynamism. And not a small element, at least for the writer, on PSP instead of the commentary there are excellent adrenaline-pumping musical tracks to accompany us during our matches. Although the reason is probably due to a hardware limitation, the result for the end user is clearly preferable. an absolute masterpiece unfortunately tainted by a problem which, given the portable use, is even more felt Uploads... After reading these 9648 characters, you may have noticed that no defects have yet been listed in the THQ production. Unfortunately, before reaching any conclusions, we have to note a rather serious one: uploads. Yes, because if Raw vs Smackdown has always been on PS2 has never stood out for speed in terms of ~loading~, on PSP the problem becomes even more serious with truly frustrating waiting times that become unseemly in career mode. A real pity, an absolute masterpiece unfortunately tainted by a problem which, given the portable use, is even more felt. With WWE Raw vs Smackdown 2006 we are faced with the classic masterpiece stained ~only~ by a problem of no small importance. Yuke's programmers have managed to miniaturize all the game modes present in the PS2 version (and with the addition of some nice mini-games), have literally transported the superb gameplay and have managed to give an excellent visual appearance (aliasing excluded) complete with adrenaline-pumping musical accompaniment. The only thing they have failed to do is reduce the already long loading times which have become even more frustrating in this PSP version, even being devastating in the career mode. If you have the patience (a lot) to wait you will find in your hands one of the most beautiful games ever released to date on the Sony portable console. Pro All game modes from the PS2 version, with some extra mini-games! Gameplay at the highest level for a Wrestling game Excellent audiovisual level Cons Frustrating loading, exaggerated in career mode ~Massive~ aliasing in the contours of the Wrestlers Wrestlingmania on Multiplayer.it It would be really petty to reduce the whole wrestling phenomenon into a paragraph of a few lines. Better to give you some interesting links of the many articles with which Multiplayer.it has explored the subject. If you are interested in the Wrestling - Video Games report at this link, you will find a special insight into the subject, which goes from the coin-ops of the 80s up to today. Another fertile ground for fans of Wrestling on PS2 is undoubtedly that of the CAW (acronym which stands for ~Create a Wrestler~) with which we will be able to include wrestlers not originally featured in the title in our games. To find out everything about CAW click here. To conclude the study, a visit to the report that Multiplayer.it made in Rome for the first stage of the very recent WWE Tour with exclusive interviews with wrestlers Nunzio, Big Vito, Ken Kennedy and the general manager of Smackdown Theodore cannot be missed. Long. To visit the special click here. Finally, if you missed the review of the PS2 version of Raw vs Smackdown 2006, click here.", "date": "2006-02-13", "grade": null}