{"name": "Brividi sull'asfalto", "ref": "https://multiplayer.it/recensioni/152672-dirt-rally-brividi-sullasfalto.html", "text": "What can a pound buy? Little or nothing given the cost of living in perfidious Albion. And with 3 Euros? Without a doubt we can have a good breakfast in our area. Since we are talking about video games and not about home economics and small savings, we immediately tell you that these 3 euros more allow you to get your hands on a first substantial update (Pikes Peak aside) for DiRT Rally's Early Access. By subscribing to the jokes, these extra 3 Euros are for all those who now get on board the Codemasters racing cars. For those who bought DiRT Rally ~at launch~, Tarmac Terrors is just, in fact, a massive free update. Introducing the first massive update for DiRT Rally's Earle Access Better off-road! Our first encounter with the game, in late April, took us by surprise. Both for the announcement without any teasing or various leaks the previous days, and above all for the possibility of trying the game immediately with a substantial Early Access. A return to the origins for Codemasters, for a title that focuses entirely on realism, decisive but obviously not total, and which requires a lot of dedication to have the handle necessary to climb the charts. This time we won't go back to telling you about the ~basic~ content, the career structure and the possibilities for tuning the car and the team. For this we refer you to the previous article. It's time, therefore, to fly to Germany to get acquainted with the new content. The numbers speak for themselves: twelve new stages for the rally in the German military base of Baumholder (there is even a Tornado ~trackside~!~), tracks of various lengths where you race on concrete, asphalt and gravel, at night , by day and under water; five new cars, namely Opel Kadett GT/E 16v, Opel Manta 400, Lancia 037 Evo 2, Seat Ibiza Kitcar and Peugeot 306 Maxi, entered in two new categories Group B RWD and Kit Car Classes To flesh out the update we also find a new daily event and a new weekly event. Plus a whole series of updates and ~fixes~ under the hood. In short, three more euros well spent. Pad in hand (we confirm, as if it were still needed, the need for a steering wheel to enjoy DiRT Rally to the fullest) the new cars, especially the most recent and performing ones, are decidedly difficult to drive, even on those surfaces that they should guarantee ideally more grip. Even messing with the aids a little, it's easy to tail badly and in the first few bars it's almost normal not to hit a tight curve. The impression is that there's something to fix: it's as if we weren't dealing with a grip on concrete that has no intermediate values and that doesn't allow for mistakes, not even trying to choke the throttle as best as possible. The pad obviously puts its own into it, but these are the sensations. Furthermore, despite the feedback, even the physical model of the damage has not been revised, with the consequences of the impacts that are not always consistent with the mistake made. This is a design choice, given that hitting a tree or rolling over is the order of the day in rallying, but it would be nice if Codemasters inserted an ultra-realistic mode where mistakes really pay off, even with withdrawals and lightning-fast ~game overs~. Following the changelog, Codemasters should have also fixed the delay with which the return button appears, but it didn't seem very different from the first Early Access release. Visually there is little to say. Baumholder is a real show, with a ~track design~ that enhances the muscles of the graphic engine, between ups and downs, forests, improvised chicanes made with haystacks and long flat sections. Without forgetting that at night it is always a ~terrible~ sight, like when the streets are invaded by rain and very dangerous puddles. A definite highlight are the reflections on the windshield, which show the interior of the car depending on the position of the sun. In short, an updated Early Access that confirms trust in Codemasters, even if something should be corrected. On the other hand, DiRT Rally is a project in complete evolution: we assume, however, that fans will not be slow to report their feedback to Codemasters.", "date": "2015-07-03", "grade": null}