{"name": "Di nuovo in sella", "ref": "https://multiplayer.it/recensioni/152577-ride-di-nuovo-in-sella.html", "text": "After having thoroughly analyzed the PC version of the game, of which you can read our review by clicking on the following link, we are back on the saddle of RIDE's two wheels again, this time in its console version, in a sort of ~return to origins~ given that all of our tests prior to the market debut, which took place on Steam on March 27th, were carried out on a debugged PlayStation 4. For the occasion we put the digital version for Xbox One to the test, which confirmed the overall goodness of the work done by the Milestone guys, while showing some critical issues that do not allow it to reach the quality levels of the one for Windows systems . If you want to find out why, all we have to do is wish you a good read. Pros and cons of the console version of RIDE, Milestone's new effort Xbox One goals Milestone motorcycle racing offers the usual 1000g through 50 distinct objectives. Among the easiest to achieve, from 10g each, we find the purchase of a motorcycle of a specific brand, the achievement of the first placements in the World Tour and a whole series of ~firsts~, such as access to certain menus, the first connection, first processing, and so on. Among the objectives from 20g there are the conquest of a gold medal in the various game modes, reckless maneuvers to perform and placings in the ranking, while at 30g there are long-term objectives such as a certain number of motorcycles collected in the garage. The three highest goals, from 90g, are related to the credits to have in the bank (100,000), the victories in the Elite Trophy and the achievement of the first position in the World Tour. A long wait Before diving into the intimate analysis of this specific version, let's take a quick overview of the game's features, however, referring you to our previous examination for a richer and more in-depth reading. As you surely know, Milestone racing conceptually represents a sort of Gran Turismo dedicated to the world of two wheels, above all due to the number and variety of models available under licence, over one hundred translated by the world's leading manufacturers including Ducati, Yamaha, Suzuki, Honda, Mv Augusta, Bimota and some peculiar brands like Energica. In addition to the copious garage of motorcycles, divided into four main categories, namely Naked, Supersport, Superbike and Historical, in turn organized by engine size, country of origin and year of production, there are numerous aftermarket components - also under license - to customize both the two wheels and the centaurs themselves down to the smallest detail. The beating heart of the experience is represented by the World Tour mode which includes over two hundred events, made up of single races, team races, trackdays with overtaking, endurance and challenges against the clock. In all there are fifteen distinct settings divided into city routes (Milan and Miami), Countryside (Wales, Stelvio Pass, Sierra Nevada and Kanto) and real circuits, such as Imola, Sugo and Donington. The organization of options, events and modes is naturally the same in all versions of the game, however, as specified, there are some substantial technical differences between the console and PC versions. The first aspect that struck us negatively on Xbox One were the loads, so long as to be almost maddening, especially when starting single races with all the opponents present on the grid. Having to wait about a minute and a half between selecting the bike and the actual moment of going out on the track is really too much and the defect also occurs when switching between other menus and screens, such as those dedicated to tuning the bike and the simple exiting a session. Considering that the game is also installed on the console's hard disk, these are unjustifiable expectations, and it is no coincidence that an intervention by Milestone to stem the problem is loudly requested by the community. After all, From Software promptly intervened following the bitter controversy over Bloodborne's loading times, although on the exclusives the optimization margin is certainly higher. Fortunately, the problem of corruption in the saves, which created many headaches in the first days after launch, has been resolved; however, we have never had any problems of this type, even with the PC version of the title. Another substantial difference between the PC version of RIDE and the console ones lies in the number of frames per second, respectively set at 60 and 30. As specified several times, in a simulation racing game fluidity matters much more than in other genres in the precision and sensitivity of the response.placed at the controls, even more so in a very fast one like RIDE, where the best performing bikes such as the Superbikes and the prototypes derived from competitions reach crazy speeds, on tracks that push you to continuous and sudden changes of direction between millimeter folds and chicanes to brush. The transition from the 60 frames per second we were used to to the 30 was not painless, given that we had to recalibrate our approach to the driving model while using the same peripheral, or the Microsoft flagship joypad. Nonetheless, the result is always highly enjoyable and above all fun, thanks to the painstaking work done by Milestone in rendering the behavior of the various types of motorcycles, where weight distribution, set-ups, aerodynamics and pure performance are tangible between the individual models . Naturally, the greatest satisfactions are returned by setting the physics to PRO, but RIDE is also appreciable for the scalability of the dynamic model which makes it suitable for a large number of players. Through thick and thin Although the PC version of RIDE is not particularly avant-garde from a purely technical point of view, it still has some aces up its sleeve, such as the beautiful polygonal models of the motorbikes, most of which are derived from the official CADs of the manufacturers, and the rendering of some sceneries, especially the scenic ones like the Kanto in Japan and the narrow streets immersed in the greenery of North Wales. As expected, the overall result is visually inferior on Xbox One, however the motorcycle models continue to impress for their refinement and attention to detail. The settings have less engaging HDR and global illumination, while aliasing is significantly more pronounced, a series of elements which, paradoxically, make some Countryside tracks less attractive than the real circuits, significantly more bare. Some less defined textures in the surrounding elements and the absence of V-sync, with the consequent appearance of tearing, further spoil the cleanliness of the image, furthermore you notice more or less annoying clicks that occur especially in passages with many details at trackside, such as the urban sections of Miami and the villages of the Kanto. As far as animations, collision rendering, audio and artificial intelligence are concerned, the latter being particularly aggressive even at an intermediate difficulty level, the versions of the game are practically superimposable.", "date": "2015-07-03", "grade": "7.0"}