{"name": "Codename: Panzers Phase Two: Recensione", "ref": "https://multiplayer.it/recensioni/codename-panzers-phase-two-recensione.html", "text": "both in the cinematographic and videogame fields, the evocative power of the great world conflict, which profoundly marked mankind during the last century, is still capable of attracting the attention of the market and the projects of the producers Riding this wave of magnetic and irrepressible public interest in the theme, no more than three years ago CDV thought of investing in Stormregion for the development of a series of RTS for PC called ~Codename: Panzers~. A little over a year after the release of the first title (it was the last months of 2004) CDV is ready to launch the second chapter of this RTS trilogy on the market. Counting on the effect of considerable resonance produced by the predecessor, this ~Codename Panzers: Phase Two~ is preparing to lead us back to the ranks of the two great alignments of the Axis and the Allies. The Nazi-fascists, the allies, the partisans Going through the chronology of 2GM to follow the events related to the protagonists, the player is called to relive the battles of three very important scenarios at the forefront of the world war: North Africa, Italy and Yugoslavia. The game features two campaigns that can be played immediately; playing the role of the axis, the player is called to lead the Italian-German troops for the control of North Africa, instead following the fate of the allies starting from a reconquered North Africa you will have to organize the landing in Sicily and therefore the first real aggression to the main territories of the axis. Once both campaigns have been completed, it is finally possible to enjoy a third complete campaign which will see the partisans and the Soviet forces as protagonists in an attempt to regain control of the Yugoslav borders. Under the skilful make-up of the screenplay, the events narrated in the campaigns form a plot worthy of the most famous novelist. in a continuous succession of twists, comic and dramatic moments, the six protagonists of the story build a sophisticated embroidery of friendships, hatreds, courageous choices and heroic acts The Nazi-fascists, the allies, the partisans In a continuous succession of twists and turns, comic and dramatic moments, the six protagonists of the story build a sophisticated embroidery of friendships, hatreds, courageous choices and heroic acts; it is not difficult to identify with the characters of this story, accompanied by the skilful scenic construction that surrounds the actual game: films, verbally narrated briefings with the typical style of the diary or letter constitute an example of a skilfully constructed script with the intent to entertain the player for a long time. Dario, Barnes, Hans, Buck, Sasha, Wolf, six men united by a sense of duty towards their respective countries and by the stupor experienced in having to lead a senseless and extremely cruel war. When the script has depth If the plot of the script constitutes the essential backbone of a title that claims to be profound in every respect, the accuracy that underlies the practical realization of the game certainly cannot be overlooked. While not changing the essential gameplay structure already known in the first chapter of the saga (Phase One), the developers have managed to revive the title with the introduction of new armies and the accurate tuning of the artificial intelligence and the balancing of unit. For its part, the Gepard engine continues to lend a hand to the development of game frameworks. If on the one hand the depth of the game has been enhanced by giving space to elaborate plot interweaving, with truly compelling main and secondary objectives, on the other we can enjoy a respectable physical and graphic engine, capable of reproducing the scenes with extreme fidelity proposals. The effects of the passage of vehicles modify the scenario in an impressive way, knocking down telegraph poles, trees, light poles in an absolutely natural way. Each element of the scenography is subjected to the stresses of explosions and the passage of vehicles, truly making the idea of being immersed in the world that our graphics card is reproducing on the monitor. The game is this However, in order not to preclude anything from the reader who comes across Codename Panzers for the first time, it is necessary to retrace the peculiarities of this masterpiece of CDV production. As we have already had the opportunity to underline, this title is an RTS based on true events during the Second World War. The title that draws inspiration from the feared German armored units places the clash between the tanks that play a role of utmost importance at the center of the action. As history has taught us, this type of means has profoundly marked the development of militia tacticsary in large pitched battles, as well as in urban sieges. In Codename Panzers armored vehicles have a very important role, constituting the backbone of the attack column. Around the impressive firepower of these vehicles, the player is called to organize the meticulous work of the infantry units deployed on the ground or on fast transport vehicles; these units, decidedly weaker, but much more versatile, are often assigned the most difficult task: that of assaulting buildings, conquering positions and taking possession of heavy artillery pieces scattered on the map. To surround the attack column we find the means of transport and support, peculiarities of the title since the first chapter. as history has taught us, vehicles such as the Panzers have profoundly marked the development of military tactics in large pitched battles, as well as in urban sieges The game is this In fact, heavy vehicles can suffer different types of damage, they can overheat and lose efficiency. The damage is reported on the vehicle icon, located according to the area affected by enemy shots, in this way it is possible to manage the enemy offense by positioning your vehicles appropriately. The management of the clash must also be accurate from the point of view of the ammunition since the artillery shots fired are deducted from the effective autonomy of the vehicle in question. In these cases it is absolutely necessary to use the transport units capable of repairing the damage suffered and replenishing the ammunition. The camp headquarters provides the same support to units that enter its range. To conclude, we cannot fail to mention the possibility of calling upon the massive firepower of the heavy artillery placed behind the front or the opportunity to unleash aerial fire by upsetting enemy positions with rapid raids conducted by one's own aviation. This kind of interventions are extremely limited, but the strategic importance of a short but powerful well-aimed blow should never be underestimated, as it can bring the enemy rear to its knees. Peculiar potential Each unit gains its experience by confronting the enemy on the battlefield. Depending on this aspect, the player is called to make more or less prudent choices in order not to jeopardize the life of units developed with so much effort. By acquiring experience points, units can in fact enjoy bonuses in attack, improve the hit rate and suffer less damage under enemy fire, thus becoming invaluable resources for carrying out missions. Furthermore, once the assigned mission has been completed, the player receives prestige points, calculated on the basis of the statistics reported, the time used and the efficiency on the field; the prestige points can thus be spent between one mission and another to strengthen the ranks of one's army by requesting new means to be deployed alongside those already in our possession. While not new to the regulars of the genre, it is always a pleasure to find this possibility in an RTS. the ~tactical pause~ prevents a chronic decline in realism in the final stages of a mission, when, in order to reach the coveted objective, units would be sacrificed in an absurd last-man assault Peculiar potential In fact, this choice prevents a chronic decline in realism in the final stages of a mission, when, in order to achieve the coveted goal, the units would be sacrificed in an absurd assault to the last man. While maintaining the typical characteristics of RTS, especially as regards the management of units on the field, their movement and organization, Codename Panzers uses a typical tactical expedient to make up for the needs of managing scenarios that are often too complex to be conducted in real time: the player can in fact call up the ~tactical pause~ whenever he wishes. The tactical pause is an ~active~ pause, in the sense that it does not place the game in the classic frozen state in which it is not possible to do anything except restart the game, but allows the player to act on his own units, being able to explore sweep the map by issuing orders that will be immediately executed upon returning to normal game speed. Technique is not water From a technical point of view, Codename Panzers: Phase Two is solid and well structured. Strengthened by a massive use of all the potential offered by the Gepard engine, it does not fear comparisons with the other historical RTS seen up to now. Clean graphics, great level of detail, the camera moves smoothly delivering to the playerthe right view for every situation. Not infrequently it happens to be enchanted to notice the details, the effects of light and shadow, the smoke and the other particle delicacies of which the game is full. But the real novelty presented in the game is made up of night missions where you can really enjoy the atmosphere full of tension when tracers and explosions set the darkness of the desert on fire. The plays of light in these cases are wasted, with the lights of the headlights reflected by the metal sheets of the cars and the flames that burn illuminating the sand of the North African desert. Impossible not to mention the localization in Italian and the good realization of the numerous interlude videos, obtained by making the best use of the resources offered by the engine of the game itself. It is worth remembering that the package contains (in addition to the DVD support of the game) three useful finely crafted color manuals, a further point in favor of a production that wants to reward the customer with that extra pinch of substance that never hurts. impossible not to mention the localization in Italian and the good realization of the numerous interlude videos, obtained by making the best use of the resources offered by the engine of the game itself Technique is not water The dubbing is effective as is the soundtrack with the typical military themes to which genre cinema has accustomed us by now. A complex but very functional map editor, the same used by the developers for the construction of game maps, offers the opportunity to engage in the demanding but rewarding work of creating new scenarios, providing numerous palettes to be able to recreate infinite new game situations. Finally, the multiplayer mode offers the player the opportunity to measure his command ability with the other owners of the game scattered around the globe by exploiting the numerous servers available on Gamespy. Final comment Codename Panzers: Phase Two is the worthy new chapter of the CDV RTS saga that is holding court all over the world with its aggressive appeal and the strong strategic tactical experience it manages to offer to players. Strengthened by the use of an excellent physics engine (Gepard) it proposes a faithful reconstruction of historical battles of the Second World War enriched by the interesting plot proposed by the really well thought out plot. In our opinion, a jewel of the sector, and a must-have for all fans of military strategy and tactics. Really tasty! Pros Refined AI Graphically rewarding Excellent strategic and tactical experience Cons Sometimes the game situations get a little too complicated Infantry units that are not very differentiated between the sides The corner of the requirement The requirements listed for ~Codename Panzers: Phase Two~ are: 800 MHz processor or higher (Pentium III), 256 MB of RAM, a 64 MB graphics card (Radeon, GeForce 2, Intel i915g or higher), and 3 GB of space on the Hard Disk (Ouch, we know, there are many! But these are the times that are running...). The package sent to the editorial staff contained the game on PC DVD-rom support: it is almost superfluous to add that the appropriate reader is required to play. The game was tested on an AMD Athlon 64BIT 3500+ with 2 GB of RAM and a 128 MB DDR3 GeForce 6600 GT video card without reporting any problems; we are happy to assure you equally spectacular results on less updated machines. It is now a fact: the Second World War sells. Both in the cinematographic and videogame fields, the evocative power of the great world conflict, which profoundly marked mankind during the last century, is still capable of attracting the attention of the market and the projects of the producers. In the field of video games in particular, there is no genre, just as there is no platform, which does not boast at least one title explicitly dedicated to the war events of those passionate and terrifying years, either the conflict relegated to the background of the narrated events or the main scenario in which to project the action of the game.", "date": "2006-02-10", "grade": null}