{"name": "Pac-Man World Re-Pac", "ref": "https://multiplayer.it/recensioni/pac-man-world-re-pac-recensione.html", "text": "Some paths are not linear, but cyclical; still others even labyrinthine. Like those that have always distinguished the Pac-Man series, regardless of the places of use, which now range from old-fashioned cabinets to consoles, obviously passing through smartphones. These days returning from the past are certainly the labyrinths of Pac-Man World, re-proposed to players in the guise of Pac-Man World Re-Pac. It is a remake of a video game made from scratch keeping as a reference model at all times the Pac-Man World of the first PlayStation. Why? A matter of anniversaries, presumably, but players have been waiting for a return of this iconic character for a long time. And it always remains on the theme of birthdays: Pac-Man World was released on PlayStation 1 to celebrate the twentieth anniversary of the series, now Pac-Man World Re-Pac falls on the 42nd year since the birth of the yellow anthropomorphic ball (and accompanies the recent Pac-Man Museum+). It is, to be brief and clear, the same identical video game, obviously adapted to the technical, graphic and generically improving needs of the contemporary era. The Pac-Man World Re-Pac review below will provide you with all the necessary details, but we are sure that some of you will have already rushed to buy a title related to your childhood. The plot: Pac-Man and Toc-Man The family members of the protagonist, kidnapped in Pac-Man World Re-Pac The storyline of Pac-Man World Re-Pac is the same as the Pac-Man World of the first PlayStation; only the names of some main characters change, for negligible rights issues and various renamings. Bandai Namco, for example, now calls the ~old~ Ms. Pac-Man with the new name of Pac-Mom, and who are we to argue about this too? After all, the characters are still the same and have all undergone a graphic improvement in line with the new aspect linked, in fact, to the company's commercial needs. In any case: Pac-Man's relatives were organizing a birthday party for his own, very famous blood relative. Unfortunately they hadn't considered yet another evil plan of the Ghosts, who arrived on the spot and kidnapped everyone present on behalf of Toc-Man. The latter has the appearance of a gigantic robot very similar to an overgrown Pac-Man (his true identity will be revealed in the finale) and aims, in fact, to replace the real Pac-Man, stealing his identity. The ghosts, however, aren't too smart: they're supposed to kidnap the hero and instead capture his family members, presumably due to the practically identical appearance (although some questions should have been asked at least about the family dog). Thus, Pac-Man - the real one - begins a journey to recover everyone; the story is marked by the presence of six different worlds, in each of which Toc-Man has hidden a member of the Pac family. If you sweated a lot as a child before reaching the end credits, you will soon realize how much Pac-Man World Re-Pac is all in all a very simple 3D platformer today, because water and experiences have passed under the bridge in over twenty years... The remake: from PS1 to PS5 Pac-Man World Re-Pac is a 3D platformer, but very few levels really take advantage of the third dimension The writer has had the opportunity to complete the main adventure of Pac-Man World Re-Pac on PlayStation 5, therefore his considerations will be based on this specific version of the game, from which all the improvements and updates compared to that first Pac-Man World for PlayStation 1. The title that you are about to buy (or want to neglect) is a remake, the 1:1 revival of the ancestor from twenty years ago. The graphic detail changes (with the obvious introduction of high definition), the remastering of the soundtrack, some small improvements to the overall gaming experience, the style of the main characters; no new content to report, however, neither in terms of level design nor in terms of labyrinths that can also be used separately from the main experience, as indeed happened in the original.Pac-Man World Re-Pac is a 2D platform ~disguised~ by 3D in depth effects; but there are actually only a handful of levels that really use the latter as a real game environment, such as the boss level of the circus world or the chase in the cave world. On PlayStation 5 we found ourselves grappling with an always satisfying glance, with clear and colorful colors and polygonal models, even if from time to time some element on the screen had textures that were a little less defined or blurred than the surrounding ones, aboveall in the depths. Nothing traumatic, because during the adventure it is difficult to notice. On the other hand, the frame rate is excellent, fixed on 60 FPS. In Pac-Man World Re-Pac there is no shortage of classic mazes, but in 3D and with a top-down view On the overall quality of the re-proposition, which is generally valid, we would like to add a few more reflections. For example, the soundtrack didn't completely convince us: it's as if, instead of being reorchestrated, that of the first Pac-Man World had been directly recovered, with minimal improvements; in this aspect we notice the difference compared to the rest of the context. On the other hand, the management of the fixed camera has been partially revised and improved: it now clearly shows, in every situation, the entire section of the level in progress, allowing you to manage Pac-Man's movements well. The latter's moves have not been updated: the bouncy jump with which to hit enemies, the charged run and the explosive shots that consume the Points (the so-called Pac-Dot) remain; what changed instead were the sounds linked to the moves themselves, no longer those linked to the experience of our childhood, which the writer still keeps well impressed in the mind. Finally, overall, the whole experience is undoubtedly aged, but this certainly cannot be a criticism since we find ourselves dealing with a remake, and not with a sequel: whoever buys Pac-Man World Re-Pac will want to find Pac- Man World as it was, nothing else.", "date": "2022-08-31", "grade": "7.0"}