{"name": "Otto sotto un tetto", "ref": "https://multiplayer.it/recensioni/151274-lord-of-magna-maiden-heaven-otto-sotto-un-tetto.html", "text": "When the Neverland studio, famous for being the birthplace of historic brands such as Lufia and Rune Factory, went bankrupt at the end of 2013, a ~secret project~ was still in the works that was supposed to relaunch the company: the bankruptcy it was a bad blow, but fortunately another Japanese company, Marvelous Inc., decided to save the former employees of Neverland and, together with them, also that famous project. Developed in collaboration with Marvelous, therefore, Lord of Magna: Maiden Heaven finally arrives on European Nintendo 3DS, albeit only digitally. The western publisher, XSEED Games, has decided to deprive us of the beautiful American packaging, including the soundtrack on CD; a questionable move, of course, but also understandable if you think of the already small niche of lovers of the genre who could even mistake Lord of Magna for a spin-off of Rune Factory or Harvest Moon due to the signatures and the very cute graphics, when you it's actually a whole other story. Lords of Magna: Maiden Heaven is a small jRPG that oozes sympathy from every pixel Made in Heaven Lord of Magna immediately presents itself with a beautiful cartoon introduction, completely sung as if it were the opening theme of a Japanese anime, which introduces us to the protagonist Luchs Eduard and the seven ~girls~ who will soon turn his life upside down. And it's a fairly quiet life for Luchs, who spends his days looking after the inn bequeathed to him by his father together with his friends Bart and Amelia: his dream is to make his loved ones proud, welcoming customers as if they were his own family. The opportunity arises when Luchs, looking for crystals to sell to supplement the meager income of the inn, comes across a girl prisoner inside a cave. At this point, Lord of Magna begins to show off the most famous clichs of Japanese comics and cartoons: the chosen protagonist, the mysterious girls rigorously affected by amnesia, the evil empire that wants to capture them, the meddling supporting actors and so on. The Marvelous title, however, never takes itself seriously, and plays on stereotypes without really falling into banality. Charlotte, nicknamed Lottie, is only the first of seven girls Luchs will meet and who will end up living in his inn and working for him. Those expecting a kind of ~harem~ full of bouncing breasts and jokes with an erotic background, however, will be disappointed: Lord of Magna indulges on that border without ever crossing it, limiting himself to telling a romantic story without putting it at the service of the most vulgar fanservice. The characters, then, are all to be discovered: funny and well characterized, they are friendly to the skin and make the adventure more and more lively. The choice of pastel colors and the super deformed style contributes to creating this light-hearted atmosphere, among the darkest moments: the chubby and delightfully animated ~chibi~ characters interact on the screen, leaving the illustrations to depict them in detail. Each scenario, map or battlefield is colorful and full of details, framed by a soundtrack that is not exactly memorable but always spot on and by discreet dubbing, limited to the most important moments of the story. It is a pity, therefore, that the latter is really very short: Lords of Magna is completed in just under twenty hours and most of the dialogues are conducted with an exasperatingly slow pace that practically forces you to press the R key, which allows you to speed up the scrolling of the jokes and animations... risking, however, making us lose some in the eagerness to skip the umpteenth proclamation by Luchs on the importance of his inn. The 3D effect The stereoscopic effect does not affect the gameplay in the slightest, but it is well done and very pleasant, especially during the cartoon sequences. It is at its best in areas rich in details, making them stand out more. Waifu for everyone The acceleration function was added in Japan with a patch after the release of the game, confirming the feeling that the problems of Neverland had somehow affected the development of the title: our version of Lord of Magna arrives on the digital shelf of the 'eShop already equipped with the improvements implemented retrospectively at home, including the three difficulty levels selectable at any time. These two solutions, already alone, suggest the main problems that emerge on the surface already in the very first hours of the game. Yes, we said that the characters are so funny and nice, but the acceleration function exists precisely because the script is sometimes slow and heavy as a butswan. The fact that Lord of Magna offers several multiple endings, therefore, in this sense does not help much: perhaps it would have been better to allow players to ~skip~ some scenes entirely, given that - incredible to say - some are far too verbose even when they speed up. During the adventure, in fact, we will happen to face secondary and optional missions, some of which are marked by a big heart: these events serve to get to know the seven heroines of the game better, unlocking their special abilities while strengthening the bond with Luchs . Ironically, to see all the endings you will have to finish the game multiple times, and some side events will not be playable until the second or third game. For its part, the combat system is quite original, but even there the combined effort of the former Neverland and Marvelous has not completely borne the desired fruit. Lord of Magna is in fact a turn-based strategy that is played a bit like the recent Codename S.T.E.A.M., in the sense that we will control the characters directly during their turns, positioning them correctly so that their area skills hit enemies or help their allies. The twist lies in the fact that the weaker enemy units are usually associated with a much tougher ~chief~, the real objective of the mission, and one blow is enough to throw his henchmen away like skittles, perhaps causing them to collide against the their cronies and eliminating them all together. If the character manages to defeat at least ten units in one fell swoop, he immediately gains an extra turn. The idea is very cute and actually very funny, even if the physics implemented is extremely superficial: in short, don't expect to be able to calculate the angle of the rebounds with mathematical precision. On the other hand, important enemies can redeploy their henchmen practically every turn, sometimes extending the length of the fights too much. The first few hours thus tend to be fun but also a bit tedious, especially because most of the skills require you to stay still for one or more turns, and you need to unlock crafting to expand the characters' arsenal through chip making. which can then be equipped and swapped at will to give the various characters different spells and bonuses. For this reason, if the first missions seem like a walk, it is also true that, as the hours go by, the battles become increasingly long, complex and risky, bringing into play super attacks, environmental dangers and decidedly tough bosses. In short, the possibility of changing the difficulty level is a welcome thing, but it also testifies to the summary balancing of the same and, once again, the problems that occurred during the development of the game.", "date": "2015-06-12", "grade": "7.5"}