{"name": "F1 Manager 2022", "ref": "https://multiplayer.it/recensioni/f1-manager-2022-recensione.html", "text": "Writing the review of Formula 1 Manager 2022 is a real honor because, for fans of the top automotive and management category, the wait was nothing short of eternal. The previous officially licensed manager (excluding mobile titles) was the homonymous and forgettable video game by EA Sports, in 2000. The work of Liberty Media, the stars and stripes producer that has taken over the ownership of the circus for some years by Bernie Ecclestone, to bring Formula One to the levels of interest among the general public to which only Michael Schumacher and Ferrari had pushed it at the beginning of the millennium. Of course, the drivers are the real superstars, but also the team principals such as Toto Wolff, Christian Horner and Guenther Steiner have now entered the collective imagination also thanks to the Drive To Survive series. If one of your forbidden dreams is to sit in Mattia Binotto's place to torpedo Inaki Rueda on the first day of work, know that a) you are not the only ones and b) Formula 1 Manager 2022 is the game for you. Classic revisited Red Bull is the strongest team of 2022 Frontier Developments is a developer who has shown that he knows how to deal with management systems, from Planet Zoo to Jurassic World Evolution 2 there are many works that testify to the talent of this studio. For Formula 1 Manager was inspired by the great cornerstones of the genre, starting from the patriarch Grand Prix Manager and ending with the more recent Motorsport Manager. The game is divided into the classic two macro-phases: the race weekend, the details of which we will go into later, and the more properly managerial section. From the main desk you can access eleven sub-menus which concern the canonical aspects of an F1 team: from the management of the drivers, to that of engineers and mechanics, without forgetting the very important research and development area, where you can guess the updates for the own car. The system with which the current limitations relating to the budget cap have been implemented is very interesting, but perhaps too simplistic and guided: even if you are driving the most munificent team, you have to choose carefully which areas to intervene in, given that the regulation is very restrictive in terms of expenses and time allowed inside the wind tunnel. Obviously, the updates will be ~textual~ only, i.e. they will not lead to any aesthetic changes to the single-seater. Slightly less obvious is that even improvements to the stable structure, such as the helipad, are not rendered graphically, an option that was present in games over twenty years ago. The race weekend gives the impression of being the part where the efforts of the developers were most concentrated. You can personally follow all the preparatory phases in view of the Grand Prix (the three free practice sessions and the qualifications), or ask them to the CPU, which will simulate them in a few seconds. It is possibly possible to speed up the time, but not change the duration of the event and, far more serious, not even save during a race: before starting a GP, make sure you have a good deal of time available. The three hours of free practice (with the exception of the events in which sprint qualifying is held) are used, just like in Motorsport Manager, to set up the best set-up and learn about the behavior of the compounds and are therefore much less boring than one might think in the first instance. In addition to studying the strategies, during the race it is possible to change the driver's attitude by acting on three items: aggressiveness on the tyres, fuel economy (the famous lift and coast) and ERS management (the equally famous ~I need more power!~ of Hamiltonian memory). Long live the FIA An early stage of the Australian Grand Prix The official license from the FIA is clearly the crucial aspect of F1 Manager 2022, but paradoxically it also represents one of its main limitations. The impossibility of creating a team from scratch can represent an unforgivable shortcoming for many players, but even the liveries updated to the last Grand Prix have a price to pay: in fact, the option to change the look of the car is not contemplated, nor to deal with sponsors except for general objectives that do not concern a particular company. No mention of the supply of fuel or tyres, while some teams can change engines, but choosing only from the four active manufacturers. On the other hand, however, all the drivers and technicians can be hired, not only from the top championship, but also from the minor leagues Formula 2 and Formula 3. There could be discussions about the evaluation criteria for the drivers: those with the highest scores are Hamilton and Verstappen ( 90 out of 100), followed by Charles Leclerc (88): that's okay. It's a little specie, however, to see that Bottas (87) is on the same level as Sainz and Perez, but even better than Russell and Norris (86), Alonso (85, scandalous) and Ricciardo (84). Something to complain about the teams too: it is not clear why Ferrari (rated as the best single-seater) has a headquarters of the same size as Alfa Romeo which, despite being the fourth force on the grid, is the team with the most difficult level high. The formidable duo of Mercedes drivers Either way, all of these stats translate pretty well to the race simulation. We know how difficult it is to faithfully report the values on the starting grid. From this point of view, the work of Frontier Developments certainly represents a good basis from which to start. The under and overcut tactics work as expected, as well as the yields of the compounds are quite faithful. Setting up a strategy along the lines of what happened in reality very often turns out to be successful. At the same time, far-fetched situations such as mass withdrawals due to technical problems do not occur, and contacts have also been rather rare, at least in our simulations. However, there are some aspects on which more refinement is needed: for example, it is not at all credible that Bottas would nonchalantly overtake a tough guy like Perez or that two cars swap positions, taking advantage of each other's DRS, for twenty times in ten rounds. Not to mention the ~free~ spins of first-class drivers like Hamilton. Chrome Forever Sports Heart From a technical point of view, the title thrives on ups and downs. The representation of the race is undoubtedly the flagship of the entire production. Filming is from television and on more than one occasion you will have the impression of watching a race on Sunday. The Formula 1 cars mirror their real counterparts, and even the faces of the drivers are rendered with a good level of realism. Unfortunately, however, there are some flaws that spoil the general impact, such as the ~surrounding~ elements that give the impression of being a bit fake and lifeless. This is the case with the stationary Ferris wheels, but also with the total absence of mechanics in the pit lane. There are also some blunders regarding the cockpits, the interior of which is identical between all the drivers. A defect that is particularly striking at Williams, the only single-seater to have the display anchored to the bodywork and which in F1 Manager 2022 instead adopts the same approach as all the other teams. Some textures are clearly in low resolution (see the sponsors on the Halo) and the steering wheels are affected by an annoying blur: in short, the view from the airscope, while spectacular, is definitely perfectible. We found the camera on the front wing only useful for the show, the one on the rear more interesting as it allows us to understand how close the rider behind is and consequently give indications on the use of the ERS. An inside view of F1 Manager 2022 The audio is disappointing: an improbable commentary in Italian (we would have expected Vanzini and Gen) is limited to the presentation of the circuit and a few incoherent exclamations on the track exits. So it happens that a harmless cut of the track limits is commented as a clash on the barriers, with a lot of direction that frames the desperate mechanics. Even the dialogues between the track engineer and the driver are reduced to the essentials: push as hard as you can, save the tyres, increase the lift and coast, all greeted with a laconic ~Copy~. There is only one game mode (for the moment no multiplayer), but the most serious problem is that you cannot select a single event, so the only way is to embark on a career with all the tracks on offer in the same sequence of reality. There are also no ad hoc scenarios that would have been welcome to improve the variety of the offer.", "date": "2022-08-30", "grade": "7.0"}