{"name": "Toccalo ancora", "ref": "https://multiplayer.it/recensioni/151255-one-more-dash-toccalo-ancora.html", "text": "SMG Studio is a small Australian indie developer who has been making a lot of noise lately thanks to productions that are enjoying some success from the public, such as the tower defense OTTTD or the mega-hit titled One More Line. In this sense, One More Dash is the spiritual heir of this game, whose popularity it tries to exploit by re-proposing a conceptually not very dissimilar gameplay. In fact, the title does not reinvent anything but takes up the mechanics of the ideal predecessor, refining a couple of aspects with some tweaks here and there, to offer an immediate but at the same time not simple product. One More Dash entertains and engages in the same way, even if it gets a bit repetitive in the long run Timing is everything If in One More Line the primary objective was to control a stylized shuttle that proceeded only in a straight line, trying to exploit the various elements of the ~scenario~ to make it continue its route and avoid crashing it, here it is to launch a ball from one circle to another, from bottom to top, trying in a similar way to make it advance for as long as possible, avoiding those obstacles that could jeopardize its progress. One More Dash is therefore yet another game that tests the reflexes and patience of users by challenging them, in this case with a single touch, to get the aforementioned ball into circular boxes, within a series of difficulty levels. growing. Because this is easier said than done: if it is true that the player is ~only~ required to touch the display to launch, while directing the ball and calculating the force of the ~jump~ automatically takes care of the CPU, it is also true that to be successful you still need to act with the right timing, taking into account some factors, on pain of failure. The shifts, short but intense, as you progress, become more and more full of obstacles, in the sense that the circular boxes in which to send the marble have protections which, by rotating around them, can jeopardize the success of a launch. From this point of view there are buffers, that is, they send the ball far away, causing the end of the challenge, or backwards. In the latter case, if the digital ball returns to its starting point, the buffer barriers can be used pinball-like to one's advantage to quickly bounce it back to the goal. But the obstacles are also bristling with spikes, and there is little to do there since the small sphere can end up impaled, thus leading to the immediate game-over. As if that weren't enough, to make things more difficult there is also an indicator that marks the passage of time within which you have to touch to launch, usually a few seconds, after which you will fail and you will have to start all over from start. In case of success, i.e. arrival inside a circle, the user obtains a certain score which is calculated according to the time spent waiting for a safe opening through which to pass the ball, from consecutive number of hoops hit before a miss, and so on. To try to offer a few more elements and encourage the user to replay the levels, One More Dash allows users to collect a series of circles (which are the game's currency) which then allow you to unlock new combinations of colors and backgrounds . In this way, although the graphics are minimalist to say the least, it is still possible to select different alternatives. For the rest it offers nothing else and is confirmed, as mentioned at the beginning of the article, a game without excessive pretensions other than that of giving moments of fun without excessive frills, testing the reflexes of gamers.", "date": "2015-06-11", "grade": "8.0"}