{"name": "Il killer annoiato", "ref": "https://multiplayer.it/recensioni/151100-hitman-sniper-il-killer-annoiato.html", "text": "Fans of the Hitman series, rejoice: while waiting for the new chapter in the IO Interactive saga, the studio behind the excellent Hitman GO has produced a new adventure for mobile devices. Leaving aside the puzzle game mechanics, the most ruthless assassin in the world finds himself doing what he does best: killing targets from a distance while passing absolutely unnoticed. Not everything went right, however... Too little variety in Hitman: Sniper, which unfortunately doesn't fully convince Lots of smoke... As mentioned at the beginning we are faced with a sniper simulator in all respects: the setting is a pretty complex located in Montenegro where there are some targets that must be killed without attracting too much attention. Each mission consists of hitting a series of objectives, ranging from the achievement of a certain score to a perfect kill disguised as an accident; sometimes you have to wait for the right moment to fire a single shot that triggers a deadly sequence involving two or more characters - probably the most difficult objective on the first playthrough - while on other occasions you have to unleash a storm of bullets that hit the luxurious housing complex like the fury of Thor. Like any self-respecting killer, our infallible protagonist has the opportunity to use a large number of weapons that are gradually unlocked by continuing through the levels. At the beginning of the game you only have a decent shotgun that allows you to familiarize yourself with the game mechanics, then you gain the ability to unlock new ones that are not only more stable in aiming, but also have some bonuses: one allows you to have an x-ray view for a few seconds highlighting the subjects on the screen, another gives us the ability to hold our breath for a few more moments, still others allow bullets to penetrate a hard surface or kill any character with one hit. There are many of them and they are especially useful for certain tasks that will be assigned to us that would otherwise become almost impossible. There are two ways to unlock new equipment: the first consists in shelling out real money for purchases via in-app purchase, while in the second case you have to try to kill as many characters as possible among those who are considered ~VIPs~, to have the opportunity to unlocking weapon pieces in a sort of roulette at the end of the mission, a system that is anything but meritocratic and frankly too penalizing on certain occasions, which demonstrates the desire to push the player to spend money for a quick upgrade. The in-game currency, on the other hand, is useful when we need to update the characteristics of our rifle to make it more stable and therefore easy to use. By connecting to our Facebook profile, however, you can challenge your friends to a duel and fight for the first position in the standings; luckily the social side of the game is not intrusive and you are not forced or pressured to post statuses on the social network at every event. ... a little roast Graphically speaking, the Square Enix title presents itself very well both from the point of view of the atmosphere, thanks to the use of very realistic lights, and under the technical profile itself, with 3D characters and environments equipped with a high number of polygons - for a mobile game - which make it all very pleasant to look at. The same goes for the sound sector which is excellent both for ambient noise and for those of the various firearms, always impeccable: obviously to fully enjoy the experience it is recommended to use a good pair of headphones. The controls, in turn, are simple to learn and are adequate for a title of this kind: with a first tap you access the rifle optics, with a pinch you zoom in and with a further tap you fire the shot, while to reload it is sufficient to perform a quick quick time event. Technically, therefore, it is an excellent title that does not disappoint in any respect; unfortunately there are problems and they mainly concern the actual gameplay. Let's start from the first assumption: the whole game takes place always and only in the same - and therefore unique - location; there are no other locations and therefore the Montenegrin villa is the only location we will see for all 150 levels. While additions to this effect with future updates cannot be ruled out, we are forced here to evaluate the game for what it has to offer now. The NPCs then always and only follow the same pattern and after a handful of attempts it becomes all too easy to predict the moves of each occupant of the house; you basically end up repeatingalways the same crimes each time, with the only due exceptions in the event that the objective to be achieved requires some specific moves. Having understood the mechanism that leads to a high score - killings disguised as an accident, headshot and stealth executions - the player's task is only to repeat the same mechanism level after level to the bitter end. Unfortunately, although everything is quite fun for the first 30-40 stages, as soon as you get a certain familiarity with the repetitive patterns and objectives, boredom sets in quickly and the desire to continue for another game suddenly vanishes, simply leaving a bitter taste in the mouth for a largely wasted golden opportunity.", "date": "2015-06-09", "grade": "6.5"}