{"name": "Musica da correre", "ref": "https://multiplayer.it/recensioni/151105-audiosurf-2-musica-da-correre.html", "text": "Audiosurf had many merits and quite a bit of luck. It was 2008, Steam was not yet the chaotic colossus it is today, no one had yet given a playful function to the myriad of music files that were accumulating on hard drives and the concept of ~independent developer~ was much less mainstream than it is today . Dylan Fitterer, passionate about music and new technologies, simply found the perfect mathematical formula to give a collective meaning to objects that the industry had never wanted to bring together. The basic idea, which we also find unchanged in Audiosurf 2, was and is disarmingly simple: to create a playable audiovisual synaesthesia. As? The player simply has to select a piece of music that the system takes care of transforming into a circuit on which objects are distributed, whether they are bonus blocks to collect or obstacles to avoid. In the most played mode, the Mono one, the bonuses are stacked in a grid placed under the vehicle driven by the player, which varies according to the chosen graphic theme. When three blocks are lined up, a timer starts after which points are awarded based on the number of blocks amassed. The timer can be reset by collecting more blocks, so you can stack more and get higher and higher scores. The resulting gameplay is actually very meager, but other contingent factors enrich it. The first is the visual richness of the tracks, characterized by a fascinating psychedelic abstraction (at least for the integrated themes). The second is the challenge offered. In fact, each piece of music allows you to compete against anyone else who has used it to create a track, giving a competitive dimension to what remains an overall relaxing gaming experience. If you haven't figured it out yet, up to now the two Audiosurfs are superimposable. The second chapter, however, takes some decisive steps forward in certain fields, but equally decisive steps backwards in others. Too much case One of the major difficulties Fitterer must have encountered developing Audiosurf 2 is figuring out how to make it evolve. Unfortunately, the nature of the game does not allow for major revolutions, so he has tried to exploit the elements to create variations on the formula already expressed. The result is ambivalent, in the sense that Audiosurf 2 works where it remakes Audiosurf, but gets lost where it tries to go further. For example, one of the most criticizable innovations is the random generation of paths, which tries to remedy the lack of variety, but creates several much worse structural problems. In Audiosurf, by selecting a song and a level of difficulty, the latter possibility not present in the following, the same path was always created. As already mentioned, the variety was less than in the sequel, but the competition took advantage of it, because the challenge was homogeneous among players from all over the world. In Audiosurf 2 this is not the case and the ranking is evidently adulterated by the greater or lesser luck in the random distribution of the blocks. Sure, practice improves, but the doubt of a record made thanks to a particularly lucky game is always there like a stone guest to ruin the overall sense of the challenge. From this point of view, it matters little whether the circuits are more beautiful, the objects more colorful and the layouts more varied, even if only from a morphological point of view: where chance becomes an oppressive factor, the competition dies. Other not very successful novelties are the alternative modes, such as the puzzle in which you have to move the blocks collected while playing, or the Wakeboard mode, in which you accumulate blocks to prepare for spectacular jumps. In both cases, the problem is that the additional actions required clash with the speed of what is happening on the screen. In short, the action is overall difficult to read. The conclusion is that a few games are enough to go back to playing only the Mono mode and its variants, such as the Ninja one in which the goal is not to end up on the spikes, not penalized by the inevitable visual chaos. Will Audiosurf 2 have managed to keep up the name of its predecessor? Find out in our review The weight of failure Another problem, in this case not attributable to the developer, is the minor success of Audiosurf 2 compared to its predecessor, which translates into many songs without opponents. In fact, there are scores to challenge only in the most famous songs and in those offered by SoundCloud, integrated with the game (for those wondering, no Spotify). Unfortunately, Fitterer's new effort pays for being no longer an absolute novelty: in 2008 there was only Audiosurf, in 2015 there is still Audiosurf but also many clones and a decidedly hot market.mbiato. The appeal of the offer is therefore lower and many of the potential customers are saturated and uninterested in reliving the same experience. In short, Audiosurf 2 is perfect if you want to play alone with the music you prefer, but it is paradoxically limited by its new features that seem to have been put there more to justify the number ~2~ than for real design inspiration. On the other hand, someone might be attracted by the renewed graphics, much better than that of the previous episode. Not only are the integrated themes very beautiful and spot on from a stylistic point of view, but the integration with the Steam Workshop has already allowed modders to have their say, publishing new themes, some of which are particularly successful. In short, from this point of view Audiosurf 2 is a good discovery, which will surely reserve some surprises in the near future as well.", "date": "2015-06-09", "grade": "7.5"}