{"name": "In alto i calici", "ref": "https://multiplayer.it/recensioni/151009-massive-chalice-in-alto-i-calici.html", "text": "Broken Age and Massive Chalice. Two success stories on Kickstarter that have given Double Fine the opportunity to collect fine dollars with both campaigns: it is now superfluous to recall the record funds obtained from the first title, while the second, even without reaching the figures of its predecessor, has arrived still at 1.2 million. So similar and so different, given that we certainly wouldn't have expected to see the graphic adventure trudge through a problematic development period, culminating in the division into two acts and some delays, while the strategic game went through the Early phase perfectly Access on Steam, leaving a few days ago. An excellent result for the team working on the project led by Brad Muir, who perfectly respected the times previously announced: as far as we are concerned, we took advantage of the opportunity to return to the world of Massive Chalice and thus give a definitive opinion. To find out if the good impressions of a few months ago are confirmed or not, all you have to do is continue reading this article. Double Fine scores a double: shortly after the second act of Broken Age here is also Massive Chalice! Can you top up for me? For the benefit of those who don't know anything about Massive Chalice, let's briefly recall its setting: the borders of a distant kingdom are threatened by the so-called Cadence, a sort of dark force capable of corroding anything that comes into contact with it. As if that weren't enough, monstrosities of various types also come out of this, against which the sovereign (which is us, as Tot and Peppino would say) just has to send his most skilled fighters to try to stem the advance towards the heart of the kingdom. The condemnation would actually be inevitable, if the defense forces didn't have an ace up their sleeve: the enormous Chalice that gives the game its name, a very powerful artifact endowed with magical powers, capable of wiping out the Cadence but which requires 300 years to recharge its power after being activated. Every single game therefore takes place within this period of time, during which the player must ensure the survival of the kingdom before the Chalice does its duty. In terms of gameplay, Massive Chalice draws inspiration from two subgenres of the strategic universe: the so-called grand strategy, of which Crusader Kings is one of the most famous exponents, and turn-based combat appreciated, at least in recent years, especially in XCOM: Enemy Unknown . Over the course of the aforementioned 300 years, the two types of game merge to ensure that the kingdom has the recruits necessary to continue fighting the Cadence, once the veteran soldiers retire or die, also controlling the their fate in battle in the manner that we are about to describe. Free on Xbox One If you are considering buying Massive Chalice for PC and you also own Xbox One with a Gold subscription, pay attention to this month's free games: the Double Fine strategy appears in the list, which Microsoft wanted to give to its customers for the Games with Gold initiative in June. Then don't say we didn't warn you! Hold the line As already mentioned in the past, the comparison with Crusader Kings is certainly an exaggeration to describe the mechanics of Massive Chalice, but it gives a good idea of what the player can expect to find in the product developed by Double Fine. Once employed on the battlefield, the heroes accumulate experience and level up by acquiring new skills, as per tradition, but in the middle there is a lightened version of the grand strategy gameplay, where you can give the defenders of the kingdom a way to go in retirement, moving on to occupy important positions outside the battle. Being hit in a fight isn't the only way to die, given that the heroes get old and find themselves passing away, even for natural causes: sooner or later it's everyone's turn, and you need to have a long-term strategic vision to ensure that the DNA of our heroes continues to be passed down through their offspring. Among the roles that can be assigned to retired characters we find that of Lord, who controls a certain region, an excuse to pair him with a partner with whom to procreate to generate other heroes. Not surprisingly, among the traits that make up the figure of each character, the one dedicated to fertility also appears, allowing us to choose also on the basis of this who to leave in battle and who instead to have dedicated to other ~activities~. It is undoubtedly the most successful component of the game, simple only in appearance but in reality very delicate in its aforementioned need for a broad visionradius, able to guarantee continuity for three hundred years, ensuring that there is no shortage of heroes capable of responding to different characteristics, such as class, gender and character traits that can make the difference in battle. To be honest, it would have been useful to explain the importance of the various elements a little more within the initial tutorial, so as not to risk everything going unnoticed. Cadence I don't fear you At more or less regular intervals, the management of the kingdom is disturbed by an attack by Cadence, which sends its monsters to two of the regions controlled by us: it is up to us to choose which of the two threats to face, rejecting the sender the attack and gaining a specific bonus. In terms of gameplay, Massive Chalice adds little to what was seen in XCOM, compared to which it is rather simplified. Partial covers, for example, are not contemplated by the game engine, but it is above all the level of difficulty that does not give particular headaches. Compared to the Early Access version, a mode called Brtal has also been included, in addition to the Iron Mode where you can go ahead with a single save: however, the basic problems remain related to an artificial intelligence of the enemies that does not settle at the desired levels, combined to strange movement choices that often lead to an easy attack from us. There are essentially three types of heroes to take to war, even if by crossing them it is possible to obtain a mix of some traits belonging to them: the Caberjack is the classic tank figure, the Hunter is lethal especially from a distance and the Alchemist finally offers a deadly area attack ability, without disdaining close combat when necessary. As for the monsters, some interesting variants are worth mentioning such as the one that absorbs the experience of our heroes, even making them drop in level, or the one that causes them to age, until the character we control even dies of old age . A good idea is also linked to the possibility for the bravest fighters to transform their weapon into a legendary relic, to be handed down to their offspring to ensure that they too take advantage of its benefits once in war: another reason to keep lives the bloodlines, given that in the absence of heirs the family weapon is thrown away. To protect child labor, children must turn fifteen before taking action, another element to take into account when managing the kingdom. Finally, as regards the technical aspect, Massive Chalice does not show anything from which one can be particularly impressed: the design of the characters is confirmed as quite anonymous, just as the maps do not shine for details. The soundtrack is also negligible, while the spoken interventions of the Chalice during the match are amusing.", "date": "2015-06-08", "grade": "8.0"}