{"name": "Guilty Gear XX Accent Core", "ref": "https://multiplayer.it/recensioni/150965-guilty-gear-xx-accent-core-plus-r-inferno-o-paradiso.html", "text": "Needless to go around it, fighting game enthusiasts hold the Guilty Gear franchise in high consideration, and the reason is obvious: Arc System Works has created a surprisingly solid product, full of strategic implications, with a distinctly hardcore approach and therefore with in mind a certain type of user, the more savvy one, who grew up extricating themselves between a Hadouken and a Power Wave. There are no particular tutorials that introduce novices to the game mechanisms, and in fact from this point of view the entrance is a bit difficult and the learning curve not particularly accessible; however, once familiarized with some basic concepts, it is possible to deepen the knowledge with the various characters and find the square of the peculiar ~tactical~ gameplay of this match fighting game, which focuses heavily on calculated risk and on the construction of combos, as well as on of an effective but careful use of the ultras. Well, we were able to get our hands on the PC version of Guilty Gear XX Accent Core Plus R, which landed on Steam after a portable reduction for PlayStation Vita in 2013 (but never distributed in Europe), in turn based on an episode originally released in 2006, reworked and enriched over the course of the editions. A nice experience? Let's find out together. Despite the outdated graphics, Guilty Gear XX Accent Core Plus R is confirmed as a solid fighting game Nine years and not hearing them Let's start with the positive aspects of the production, starting with the aforementioned gameplay, which seems not to feel the weight of the years and immediately involves thanks to the solidity of the system. At our disposal we find a roster made up of twenty-five characters, and if there is one thing to say about Guilty Gear it is certainly that each of the fighters has been designed with great imagination, sometimes inspired by the collective imagination, and boasts a fighting style unique, the deepening of which in fact constitutes the bulk of the experience. There are the classic heroes, such as Sol Badguy and Ky Kiske, whose repertoire derives from that of the most famous protagonists of the beat'em-up genre, with also the inevitable alternative versions; but then the cast opens up to bold experimentation, for example the mysterious Faust (a tall man with a paper bag on his head), the witch/guitarist I-no, the possessed warrior Zappa, the vampire Testament and so on. The basic notions see the presence of four attacks (punch, kick, fast or slow slash) and various special moves that can be obtained with the traditional crescents, but there is also the interesting maneuver of the Roman Cancel (which allows you to reset an animation for speed up the insertion of further shots) and the two additional bars, which regulate the Tension and the Burst, respectively useful for executing a very powerful ultra and breaking the opponent's defense. Putting all these elements together becomes essential to get to the bottom of the single player modes, but also and above all to be able to be at least competitive in online multiplayer, which debuts on PC (it was not present in the PlayStation Vita version) and boasts a fairly good netcode invoice, which suffers a bit in the early stages of the games but then ~settles~ and guarantees good responsiveness of the commands. Cross and delight In addition to the large roster and solid and challenging gameplay, Guilty Gear XX Accent Core also boasts a decent number of modes. We have already talked about online multiplayer, but there are also a nice Story Mode with dialogues and crossroads (so that you have to complete each character's path twice to see everything), the classic Arcade Mode (rather long though), the Survival (in which you have to face an infinite number of opponents using a single energy bar), a mission mode with specific objectives to be achieved in each encounter and a gallery where you can admire the unlocked artwork. The Steam edition also includes the soundtrack of the game in digital format, which undoubtedly represents one of its greatest strengths: the songs are of excellent quality, between guitar solos and slap bass, and accompany the action as it couldn't be better, increasing tension and involvement. The sound effects, on the other hand, are decidedly less brilliant, which bring to mind the samplings of the era of 16-bit platforms, and go hand in hand with graphics that in the first place have not been adapted to the wide format (there are in fact two large bands on the sides of the screen), but which above all suffers from a very evident aliasing despite the adjustable resolution. Those who know Guilty Gear know well that it is a characteristic aspect of the first episodes, born to run on much lower hardware than the current one, mbut the problem remains and the poor performance of some scenarios does not help to revive a technical sector that is inevitably below average.", "date": "2015-06-05", "grade": "6.5"}