{"name": "Action Henk", "ref": "https://multiplayer.it/recensioni/150404-action-henk-aspettero-il-mio-momentum.html", "text": "Action Henk is a high speed crazy racing game. Instead of vehicles, however, grotesque action figures from the 1980s battle it out on the track. The context of the competitions are the places that almost all of us carry in our hearts from childhood: the domestic living room, the garden in front of the house, the beach, the amusement park. Complex tracks with dizzying descents and insane loop-the-loops await our plastic toys, busy doing the only thing that matters: maintaining momentum. If our runner stops, it means we made a big mistake. Never slow down in Action Henk, ever. Because the tracks are designed in such a way that they only work if you keep the momentum constant. Luckily, the physiological frustration you feel when you narrowly miss the next stretch of track is mitigated by two anti-stress systems. The first is the magic button that allows us to restart from the beginning of the track in a second, while the second is the ghost of our opponent, which we can set to run at the minimum time needed to win the bronze, silver or golden. In this way, you immediately learn what are the key actions to take to overcome the more complex parts of the track and you have a constant idea of the average time it takes to complete it. To all this are added convenient checkpoints for those who still want to complete the track and get to know it thoroughly before training to set a dizzying time. All this talk of speed immediately makes us think of Sonic, and by the way. In fact, we find the sense of euphoric speed transmitted by the Sega mascot in Action Henk, made even more impressive by pyrotechnic effects such as trampolines that shoot us into the air like cannonballs and rivers of sparks that our toy leaves behind when it consumes the his plastic bottom along slides worthy of the most terrifying roller coasters. On the other hand, the developers themselves are explicit about their sources of inspiration and those who bought the game in early access have in fact given a Sonic costume for the mustachioed Henk. However, if the pot-bellied protagonist doesn't meet your taste, you can always beat the enemy toy that awaits us for an extreme challenge at the end of each thematic series of tracks. If you're good enough to make him regret being out of the box, you'll find him among the selectable characters. Unfortunately, but it is our personal opinion, the action figures are all so caricatured and unattractive that we had a hard time keeping Henk on the bench, except for the need to record photos of the game. The alternative costumes are much nicer, but to unlock them you need to get a certain number of gold medals. And when aiming for the top step of the podium, you need to take Action Henk seriously, who knows how to be kind to rookies but ruthless like a Swiss chronometer with aspiring professionals. More agile than a trapeze artist, faster than Sonic, Action Henk is the new king of the track! With the turbines on my feet The tracks on which you race are the real protagonists of the game. There are ups and downs, vertical walls to climb or bounce off like ninjas and sudden chasms to be overcome with a prodigious leap. In addition, many tracks have one or two alternate routes that only the most skilled runners can reach and which guarantee a significant increase in speed. In general, the tracks borrow ideas from the reckless amusement park rides and traditional toy car tracks. If you too played with marbles digging paths in the sand as a child, it will take you little time to appreciate Action Henk's dishes. Although there are 50 standard levels and another 20 extra levels at the end of the credits (the latter really bastards), the game however ends within a couple of intense sessions, let's say four hours maximum. After all, Action Henk's goal is to maintain momentum, remember? So it would be illogical if it forced us to sweat hours on the same track. The game is painless, frenetic, to finish on tiptoe. Nonetheless, the impression is that it ends too soon. Replaying the old tracks is a pleasure to which you give in easily, but in a short time - or at least it was like this for us - you will forget about Action Henk. It was nice, you'll think, but something was missing. No doubt the presence of just one gadget was a missed opportunity. For example, the grappling hook that allows runners to hang and twirl like monkeys, increasing speed, gave us hope for other innovations in the course of the game. Unfortunately there are none. We would have liked to be able to try our hand at some acrobatics too pairborne personnel. The story changes if you are looking for the perfect time. In this case you can try to get all the gold to unlock the secret levels where you have to collect the coins scattered around the track, or even get to compete with the ghost of the first player in the world. However, Action Henk is not a selective title dedicated to hardcore players, therefore we prefer to evaluate it as a simple and refined living room pastime. Thus we arrive at the real discriminating factor of the game, the possibility of competing or not with other players. If you have friends with whom you can pass the joypad to each other to do their time on the same track and then compete with the ghost of the others, Action Henk guarantees hours of laughter between drinks and snacks. Those who do not have this possibility can still compete online with other players. Instead, everyone can enjoy the track editor and create their own, share them on Steam or try out ones designed by others. So if we exclude car games, Action Henk is the right title for those who love speed, even better if played in the company of a few friends.", "date": "2015-05-31", "grade": "7.3"}