{"name": "Lara giungi?", "ref": "https://multiplayer.it/recensioni/150668-lara-croft-relic-run-lara-giungi.html", "text": "After the extraordinary success of titles such as Temple Run, there was a flourishing of third-person endless runners on the App Store and Google Play. Some have limited themselves to cloning the formula of Imanji Studios, others have been able to enrich it with new facets (see the three lanes and the ~reasoned~ rhythm of Subway Surfers), but after a couple of years the market has inevitably reached saturation and the outputs have become rarefied. Lara Croft: Relic Run therefore arrives in a potentially positive period, because smartphone and tablet owners have dedicated themselves to other types of games and are therefore ready to try their hand at a running game again, without getting tired of it after a few minutes. Square Enix has tried to take advantage of the situation by fielding one of its most famous characters, working with the scenarios that have always characterized his adventures (forests, dungeons, archaeological sites) and introducing a series of interesting variations on the theme. Once the nice match recording function has been deactivated, which on the iPhone 5s unfortunately causes evident drops in the frame rate, the experience turns out to be fluid and frenetic, but at first it creates many difficulties due to the many details on the screen, which make the game chaotic ~read~ the situations and adopt the most suitable maneuvers. In short, it takes a while to understand when it is not the case to jump over an abyss because it is necessary to overcome it by running up a wall, or when a collapsed column must be jumped and when it is instead possible to slip under it. A series of trials and errors that invariably condition the initial impact with Lara Croft: Relic Run. Lara Croft: Relic Run is an endless runner with many variations on the theme, but the typical defects of the genre Lots of stuff Having become familiar with the mechanisms that regulate the gameplay of this curious Tomb Raider spin-off, it is finally possible to frame a structure which, while remaining endless, has recurring elements (see the ~room~ where you find yourself between a round and the other) and, above all, a large number of variations on the theme. Lara doesn't just run, change lanes (moreover in a not fixed but dynamic perspective, which varies according to the scenario), jump and slide, but sometimes she also has to open fire against evil lizard-men, she can drive of quads and motorcycles, clinging to a liana to run vertically up the walls of a structure (with inputs that are distorted, asking us to descend or ascend quickly) and even face a sort of boss, when a huge tyrannosaurus bursts onto the scene. The acrobatic maneuvers are emphasized by spectacular bullet times, which in turn highlight a fair care for the animations of the character, and there is no shortage of short fully automatic sequences, in which we passively witness aerial evolutions that lead Lara to jump from pole to branch ( literally) and then get back on track to continue their run. The control system uses only the touch screen and demonstrates a certain flexibility, avoiding an excessively meticulous approach as regards the timing of the gestures and thus leaving the player a fair amount of freedom of maneuver. Then there are the traditional achievements, bonuses and improvements that can be purchased using the virtual coins collected during each attempt, accompanied by in-app purchases that can make life easier but which are not mandatory in any way. After all, there are no refills to wait for, you can play as much as you want and the only slightly more complicated element to obtain are the Egyptian crosses, necessary to continue the game until game over. If we want, the limits of this production are ultimately those of the genre to which it belongs, which with Spider-Man Unlimited had challenged the concept of ~endless~ in favor of a structure equipped with real progression, and which instead takes a step back here remaining in the constraints of the endless run.", "date": "2015-05-30", "grade": "7.4"}