{"name": "Mario Slam Basketball - Recensione", "ref": "https://multiplayer.it/recensioni/mario-slam-basketball-recensione.html", "text": "The ball... The most surprising thing about this anomalous collaboration lies in the fact that it did not start from Nintendo: in the months following the presentation of the DS, Square Enix brought its project, a basketball game, to Kyoto and the executives were so surprised that they wanted to appropriate it, making it become a Mario-game, so that both would benefit from it, both qualitatively and commercially. The first thing to note about the game is that it is probably as close and at the same time as far away as ever to a basketball simulation: on the one hand the fouls that are totally absent, on the other hand the wonderful handling of the ball. As strange and unusual as it may be for a Mario game, there is a long tutorial in the title: although initially it seems useless and boring, it turns out to be precious and fundamental for learning and taming the complex control system. Slam Basketball represents what many players have always wanted from the DS, i.e. a complicated and playfully articulated title based mainly on the use of the Touch Screen: the character moves with the directional cross, with the left backbone you move the cursor from a basketball to a other, while the sphere is managed through the touch screen. The dribble has been treated with extreme precision: by touching the lower screen of the DS at any point, the player will move the ball to that exact position, even passing it under his legs if necessary. Mario Slam Basketball is probably as close and at the same time as far as a basketball simulation has ever existed The ball... Based on the frequency of your touches, the basketball player will also dribble at different speeds: however, it is not necessary to tap continuously on the screen, given that the player moves even by simply pressing the directional cross, but it is useful to do so to accelerate and hide the ball from the opponents by moving it around. Of course we can't tell you about every detail of the control system, but we assure you that it's decidedly revolutionary and above all it works perfectly: from the defensive to the offensive phases, there isn't a single element that hasn't been carefully developed. The only remark that could be made, wanting to look for a fault, is that the accuracy of the shot does not depend on the timing with which you release the ball, but on how long you remain in the ~charged~ position before throwing it: questionable decision but which however, given the arcade nature of the game, remains more of a choice than an actual problem. As regards the undoubted inconvenience of the requested position, the same as Metroid Hunters, or with only one hand used to hold the Nintendo DS, unfortunately we must accuse the design of the console itself; the problem could be solved by simply playing with the buttons, a possibility that has not been precluded, but doing so would only scratch the surface of the gameplay guaranteed by this title - using the buttons, for example, you cannot pass in any direction, such as instead it is possible through the stylus. ... and basketball The matches take place three against three, and you can compose your team as you like by choosing from time to time the characters you find most appropriate; the latter, taken from the Nintendo universe and in rare cases from that of Final Fantasy, are divided into five categories and differ a lot from each other: there are the powerful ones, the more precise ones in shooting, the more skilled ones at dribbling, the fast and those, as usual, good at everything and outstanding at nothing; although these differences may appear marginal, over time you will realize the importance of having a varied team in the most difficult and technical matches. As mentioned above, the title is certainly not a simulation: like every Mario game, it focuses heavily on immediacy - which, as we will never tire of repeating, is certainly not antithetical to depth - and therefore all types of fouls have been eliminated : no throw-ins, since you will play in a sort of ~cage~ just like in Mario Strikers, no free throws or two-handed dribbles. The same points, at least in official tournaments (in the exhibition you can deactivate this option), are managed in a rather strange way: there will always be the usual demarcation line between shots inside and outside the line, which will be worth twenty and thirty points respectively, but you can increase the value of a basket by collecting the various coins in the blocks scattered around the field - just dribble on them - as well as making a special shot of forty by performing a particular sequence of dribbles that varies from character to character: with Mario you will have to create twoM, with Bowser two B, and so on. The ~expert~ mode is the only one capable of revealing the depth of the gameplay of this title ... and basketball These special conclusions are inserted very well in the playful structure, provided you play at a certain level of difficulty: once you have become skilled they will simply represent an additional discriminant against a poor opponent, while they will do justice to your efforts if you score against weak opponents. Your Highness, opponents who will not let you dribble in peace but rather will try to hinder you in every way. Wanting to make a parallel we could compare these special shots to Mario Kart's Power Slides, but on the contrary that in the EAD game in Slam Basketball you will find challengers capable of hindering you even at an advanced level. There are four tournaments in all, each made up of as many stadiums; the various arenas not only differ in terms of aesthetics, but each one has certain particularities that enrich the playful experience: for example, in the underwater setting the movements are slowed down, in the winter one you slide on ice, in the casino there is a slot machine able to alter the outcome of the match; from this point of view the work was truly commendable. Once the four tournaments at the normal difficulty level have been completed, the advanced mode will be unlocked, the only one capable of revealing the depth of the gameplay of this title: finishing it will take a long time even for the most expert players. Longevity is enriched by the many objects and characters that can be unlocked by completing the secondary modes, excellent thanks to the control system although scarce in number (usually the opposite happens), and by collecting gold medals in tournaments, even if in this case, given the excessive difficulty really leads to collecting fetishism, a very common disease among the so-called hardcore gamers. The only moment in which the game system shows its side, perfectly balanced also in the administration of objects and power ups, is in the last challenges of the advanced mode, where the speed of the matches and the technical rate required is very high, and as a result, certain problems come to the surface that go unnoticed in the first few games. All the flaws concern the defensive phase and mainly the behavior of the teammates All the flaws concern the defensive phase and mainly the behavior of the teammates: rather than accurately marking the opponents, in fact, they will simply follow them, in order to give you the possibility of impersonating them in an appropriate position; if this mechanic works in slow games it is instead annoying in high level ones, since it will never happen to you that one of your teammates, alone, will anticipate or block a basket from the opposing team. This same problem will be more irritating when you have to block the other faction's special shots: in fact, at maximum difficulty, everyone's help would be needed to stop the opponent's offensive, which instead is relegated to the player alone, naturally unable to simultaneously take control of all those who, without exaggeration, can be defined as walking puppets for the field. Still with regard to the sections without the ball, it should be noted that when a member of the team comes across the ball, perhaps rolling on the ground after a rebound, he will not grab it unless controlled by the player. These are problems that arise only in the quickest games, which will probably only affect a part of the buyers, but which exist nonetheless. YYYY Friends wanted The multiplayer with a single cartridge, although it is extended to four users, is limited only to the challenges in the minigames which, however fun and well done (and they really are), cannot naturally hold a candle to a game in the traditional mode. To be able to face a friend on the basketball court you will therefore need to have two DS and two game cartridges, which in practice extremely limits the multiplayer experience, especially in light of the lack of support for the Wi-Fi connection. What is even more unnerving is the awareness that initially Wi-Fi should have been one of the strong points of the game, an awareness generated both by the company's statements and by setting up the user profile, far too complex to be completely alien to online purposes . There is very little to add, Slam Basketball as beautiful and fun as single gives (or would have given) the best in multiplayer, online or offline: the first mode is not present, the second is difficult to implement. The main shortcoming of quThis collaboration between Nintendo and Square is precisely this: after Mario Kart and above all Metroid Hunters, one cannot pass over such a title without noting the lack of online as a defect. Sinister Control If you are left-handed you will find in M.S.Basketball a difficulty that the others will not have: you will have to decide whether to use the d-pad with your left hand, which you have always done, or the stylus. In any case, your choice will lead to problems: you will find it difficult to use the right in both cases. As far as my personal experience is concerned, after an hour and a half spent using the pen I didn't have any more particular discomforts, while moving the character with the buttons created much more difficulties for me; whatever your decision, however, get yourself an anti-stress kit for safety, you will need it. Square Enix One can only speak well of the technical side, in every field, from the first to the last ingredient: Square Enix has done a masterful job. The game manages a large amount of polygons without the slightest uncertainty, proposing, among other things, splendid and well-crafted animations: undoubtedly among the best Nintendo DS games in this field, a true jewel endowed with grace and balance, which which confirm the great talent of the graphics of this company. The sound for its part is certainly not up to the visual beauty, but it has nothing to be hated. Mario Slam Basketball is a beautiful, revolutionary and complex title, aimed more at expert players than at the novice public who make up a part of the DS user. It takes time to fully appreciate, but gives great satisfaction once you master the amazing and well-crafted control system. The single player presents demanding challenges and many extras to unlock, but unfortunately the game does not facilitate the use of multiplayer, icing that costs more than the cake: the Wi-Fi connection is not supported and to challenge a friend - in a game, the minigames can also be played with just one card  two cartridges are required. There are also some venial flaws in the more complex challenges, the only cases in which the organization of the matches loses some of its balance, but despite this, the game remains an absolutely successful experiment that lays the foundations for a series with great potential: the supporting structure is exceptional, it must only be limited in any future episodes. Pros Revolutionary Immediate and precise controls Very skilled CPU Superlative graphics Cons Non-existent online multiplayer Offline multiplayer difficult to use The defensive part needs to be perfected Before the GameCube era, Mario games, whether platform or spin-off, were considered a guarantee; the situation has changed slightly since the plumber, starting in 2002, began to dramatically expand its range of action. Despite this, it must be emphasized that the judgment of many is negative a priori, as Mario games are often sunk more for such beings than for actual demerits: among all those that appeared on GameCube, most oscillate between good and excellent , with someone exceptional like Smash Bros.. Dancing Stage goes beyond this discussion: Mario Mix, a mere commercial operation that has absolutely nothing of the Mariesco spirit, and the wild ~sequelization~ suffered by Mario Party, a game that over time has given more and more importance to quantity than to quality. To create all the other titles, Nintendo turned to companies that were already experts in a certain sector, naturally not lacking their supervision, the latter often capable of making an already good game in itself excellent (as happened, for example, in case of Sega Soccer Slam and Super Mario Strikers, developed by the same team); therefore there was no lack of perplexity when it became known that Square Enix, famous for its j-rpg, was working on Mario Slam Basketball.", "date": "2007-02-28", "grade": null}