{"name": "Sulle orme di Portal", "ref": "https://multiplayer.it/recensioni/150444-magnetic-cage-closed-sulle-orme-di-portal.html", "text": "Since the arrival of Portal, many have tried to replicate its success by focusing on the formula of the first-person puzzle game more or less explicitly inspired by the Valve masterpiece. There are those who have been able to offer something new like the deep and cryptic The Talos Principle and those who, like Magnetic: Cage Closed, focus on a much more classic approach by limiting themselves to reworking some aspects without actually introducing something new. However, defining it as a clone would be somewhat reductive given that, thanks to some gimmicks, the title of the independent software house Guru Games still manages to build its own identity despite the fact that the genre has already been explored far and wide. The project was initially born as a student work developed in eight days. However, given the potential, the same guys who took care of its genesis continued to expand its horizons, transforming it into a real video game, so much so as to attract the attention of a publisher, Gambitious, which allowed it to debut on Steam. Magnetic: Cage Closed retraces the footsteps of Portal but this is not a title without good ideas Prisoner in the labyrinth Magnetic: Cage Closed is very cryptic since its inception. Without introductions or cutscenes, we find ourselves playing the role of a criminal serial number XE-47623 locked up in a maximum security detention facility, without even knowing what her fault is. However, a couple of seconds are enough to understand the bad air that blows between those bare and inhospitable walls. We have no idea how our virtual alter ego ended up in this mess, but the prison warden's words are enough to make us realize how serious our fault is: whether it is just or not, we are treated like cannon fodder, a guinea pig kept alive only for utility in the pay of scientists who are conducting secret experiments in prison laboratories. To encourage us to collaborate, we are painted with the faint hope of regaining our freedom if we prove ourselves equal to the situation by managing to pass all the physical, psychological and aptitude tests to which we will be subjected together with the other inmates. Forced to accept with the consolation of postponing the arrival of our last hour, we find ourselves taking up the gravitational rifle that gives its name to the title, with the aim of testing it in the various scenarios that will be placed before us, solving the puzzles of each room before moving on to the next one in a sequence that is not at all original, but well thought out. The prison is in fact a huge structure made up of rooms of varying sizes connected to each other by a narrow tunnel, which opens when we have solved a puzzle and then closes irretrievably behind us once we set foot in the next room. This trick means that cells and laboratories do not have an alternation set up by the developers but are ordered procedurally, with two important practical implications that are closely interconnected: the first allows for differences in the evolution of the story based on the player's choices, the second favors replayability. Obviously there are some narrative passages that are impossible to avoid, but all in all the idea convinced us, above all given the presence of different situations in which choices must be made, take one path instead of another or even just answer questions that will have concrete consequences on the continuation of the adventure. These will be posed to us by Karen Womberg, the psychiatrist of the structure who, together with the director, will animate the intercom allowing us to gradually understand something more about the plot, remembering not a little the GLaDOS expedient. There the voice was one, here there are two, but both will not fail to make fun of, mock, pity or encourage us. Attract and repel Beyond the narrative level, as we mentioned above, the real protagonist of the title is the magnetic rifle, the Prototype 27 which is nothing more than a weapon very similar to the Half-Life Gravity Gun, capable of interacting with the field electromagnetic radiation of the objects present in the various rooms and the only useful tool to help us find the way out. It works quite simply: with the right mouse button, an attractive force is activated which brings the objects towards which the weapon is aimed closer together, while with the left button, on the contrary, we push them away. We also have two levels of intensity for both, with the second, more powerful one, which we must actively use to reach otherwise inaccessible places. For example if we want to take longer jumps towards a platform with a gravity plateale, just set the Magnetic Gun on the attractive force and jump in the direction of the platform being literally ~sucked~ on the other side at high speed. The same goes for the jumps: if the platform is too high, we activate the repulsive force, aim the rifle at the floor and make a much higher jump than we are usually able to do. Although there are only these two simple mechanics, the title works well throughout the story thanks to the excellent design of the rooms and the balanced learning curve, which has the rare advantage of being able to introduce the various game mechanics along the I continue the five hours of the campaign without letting myself go into the actual tutorial phases. Each room has boxes to move, gravitational plates, switches, stairs or platforms that come out of the walls, columns to move and anything else that guarantees a certain dose of ingredients to create ingenious and fairly varied environmental puzzles. To add a little spice to everything, there is a whole series of threats such as toxic gases, flames and traps to watch out for while handling the rifle. If, therefore, from the point of view of gameplay, the mechanics work properly, the narrative part has left something to be desired which, despite the variety of choices, does not really manage to excite, resulting too hermetic and leaving out many inputs sown here and there by the narrative voices of the director and the psychiatrist that will remain unsolved. Despite this, thanks to the puzzles, the campaign is in any case quite replayable, also putting a patch on the approximate technical realization which on the one hand gives the impression of being in an aseptic environment with minimal rooms and devoid of any furnishings, but on the other flaws in the rendering of some textures and suffers from scattered glitches that we hope will be fixed as soon as possible.", "date": "2015-05-28", "grade": "7.5"}