{"name": "Imbratto di brutto", "ref": "https://multiplayer.it/recensioni/150379-splatoon-imbratto-di-brutto.html", "text": "Surprisingly announced by Nintendo during last year's E3, Splatoon immediately captured the attention of the fans of the Kyoto-based software house: it already doesn't happen every day to attend the presentation of a new intellectual property of the big N, if then it is a product strongly oriented towards competitive online multiplayer, then we can speak of an almost epochal event. As if all this weren't enough to inflame the spirits of Wii U users, the game itself then demonstrated a winning personality from its very first appearance, based on a gameplay idea that only the brilliant minds of Nintendo's designers could bring ahead: a team-based shooter in which two factions of squid-men go head to head with ink in arenas just waiting to be completely daubed with paint. In short, the prerequisites for a debut in grand style were all there: let's see if Splatoon was ready for the test of facts... A city for colouring The fact of having to deal with a videogame genre that historically has never been in its heart hasn't moved Nintendo's conventions one millimeter, which also with Splatoon has adopted the usual transversal approach capable of making the title immediately usable by both the most both experienced and casual. You can already understand it from the very first bars, when you are introduced to the central square of Coloropoli which in fact constitutes the main hub from which to select the various game modes: by directly moving the character on the screen or by tapping on the points of interest indicated on the GamePad display, it is therefore possible to access the Lobby for online games, reach the Octopus District to try out the single player campaign, enter the gym reserved for local multiplayer challenges or visit the shopping center to buy new items of equipment. The scenario is populated by the avatars of other online users with whom it is possible to establish the minimum wage in terms of interaction, since it is only possible to see their profile and any last message sent on Miiverse: despite being a game openly devoted to multiplayer, Splatoon does not make much effort to promote direct communication between players (especially thanks to the well-known absence of any form of written or vocal chat) preferring to let the gameplay do the talking. A stance that, if on the one hand testifies to how much Nintendo believes in the strength of the playful component of its product, on the other it can only leave you dumbfounded considering how Splatoon categorically refuses to perform even functions that would appear obvious in any modern online title : not only is it not possible to talk to other users, but it is not even allowed to create a game or change its parameters, and accessing the Lobby simply means being placed in a completely random way in the first available waiting room, with only mini-game displayed on the GamePad screen as a form of interaction to be consumed until the eight players required to start are reached. Luckily, the music changes when you step down into the arena... Splatter Arena The definition of team-based online shooter is very close to the multiplayer component of Splatoon: eliminating opponents with ink strokes is only part of a decidedly original, immediate, fun and obviously very colorful experience. Divided into two teams of four, players must move their character within the designated scenario, using the supplied weapon to cover as much surface area as possible with paint, while stemming the opposing team's attempts to do the same. Everything is based on an extremely simple control system, with the two analog sticks for moving and aiming (the default option delegates the latter to the GamePad gyroscope but it is frankly unthinkable), a button for jumping, one for center the view and the backbones reserved for fire with the main and secondary weapons and for transformation into a squid: the latter represents one of the pillars of Splatoon's gameplay, since it allows you to swim in your team's color to refill the ink tank as well as to move faster and be less visible to the eyes of enemies. And this is only the first in a series of features of the Nintendo title capable of giving online matches a depth that goes far beyond appearances: it is not enough to run left and right shooting randomly, but the peculiarities of the equipment must be taken into account.change in one's endowment, how and when to exploit the special move (which can be activated when a specific indicator is filled) and last but not least how to behave with the opponents. Points are accumulated mainly on the basis of the spilled ink, while the main benefit of eliminating a member of the opposing team lies in the handful of seconds necessary for him to return to battle, time which must be used to paint new portions of the scenario. The strategic component in Splatoon is more than a simple tinsel, as evidenced by the function of the GamePad display, which houses the map of the arena on which the movements of the other players and the areas colored by the two teams can be seen in real time: with a tap on the appropriate indicators it is also possible to reach the companions or the starting point with a super jump, in order to go and act immediately where there is more need. While boasting a balance between immediacy and depth that many online titles dream of, Splatoon also shows some obvious limitations resulting from some EAD 2 choices that oscillate between the naive and the inexplicable. First of all, the lack of a voice chat makes itself felt again, an aspect that thins a team game awkwardly reduced to two default messages of dubious use (~thanks~ and ~follow me~) that can be sent to allies using the arrows directional. But it is above all a certain disregard for the concept of matchmaking that gives rise to the greatest perplexities, with the software not only not bothering to bring together users of similar levels in a waiting room, but moreover distributing the members of the teams in a all random, leading to frustrating odds when higher ranked and geared players all end up on the same side. It cannot be excluded that things may change following the launch of the game, but the situation we tested highlighted these gaps quite clearly. Original, fun and frantic, Splatoon keeps its promises albeit with some ingenuity too many How hard is painting However, Splatoon's youthful sins do not stop there, and also involve aspects such as weapon balancing and equipment management. Although the choice of the EAD 2 developers to give the player the possibility of choosing between different types of main and secondary weapons was undoubtedly commendable, it is clear that some are much more effective than others: in this case, there are various devices with a rate of fire really too low to be usable in a fast-paced game like Splatoon, and which moreover perform very badly the main objective which is to spread large quantities of paint. A few raised eyebrows also arouse those secondary weapons that have a value of support for one's team, which find themselves a bit emptied of meaning in a title orphan of a communication system between teammates and the possibility of assorting team members and the their paraphernalia before matches start. The search for immediacy and simplicity at all costs has the proverbial downside also on the front of the equipment upgrade system: each item purchased has a main perk that is immediately visible and one or more secondary ones that are unlocked with experience and are randomly assigned, an aspect that makes everything very streamlined but which at the same time prevents you from choosing the improvements that best suit the player's style independently. As we have already said above, however, the strictly playful component of Splatoon has the shoulders strong enough to take charge of all these undoubted shortcomings without seriously compromising the enjoyment of the game itself: online matches are always fresh and fun, and the particular mechanics developed by EAD 2 mean that the fate of the matches can be reversed even in the last moments, guaranteeing a constant rate of adrenaline from start to finish. The progression model of the character through experience points is also absolutely spot on, with the achievement of a new level which unlocks further sets of objects that can be purchased in shops that help to shuffle the cards and remove the spectrum of repetitiveness. What is certain is that, at the moment, the amount of content is not exactly the greatest virtue of Splatoon: at launch there are only five arenas and two game modes (in the Mollusc Smash, the team that colors the most surface wins, while in Pro Matches, accessible from the tenth level, you have to fight for control of certain areas), as the stated goal of Nintendois to feed the user one piece at a time of a game that is probably already complete through free and continuous DLC support. Regardless of the subjective assessments of this conduct, the fact remains that for now we find ourselves with many beautiful promises and a product that is in any case a little too bare even in relation to its reduced selling price. Squid without net The wait for the various additional content can still be mitigated with the two offline components of Splatoon, namely the single player campaign and local challenges. Starting from the first, let's immediately clarify by saying that it is certainly not the spearhead of the play package, but that it has in any case been taken care of properly by the developers of EAD 2. Passing over an absolutely marginal plot, this mode allows you to face a whole series of levels that by setting are somewhat reminiscent of what was seen in Super Mario Galaxy: each stage is in fact divided into a variety of sub-zones, each characterized by a specific challenge to be overcome in order to move on to the next one. Compared to online games, the dynamics related to the spreading of ink change radically here: it is no longer a question of coloring every square centimeter of the surface, but of using the paint to eliminate enemies, overcome obstacles and solve simple but well-crafted environmental puzzles. Despite a rather low level of challenge, the single player campaign lets itself be played easily, also offering some decidedly successful ideas (above all some battles with the bosses) and a valid incentive to complete it, given that during the adventure you can earn blueprints that unlock weapon variants to take with you to online arenas. The judgment instead becomes more tepid as regards the local multiplayer, which actually tastes like a mere filler, currently being able to count on a single mode that sets the goal of hitting more balloons than the opponent within a time limit: reserved for only two users - one armed with a classic controller who turns to the TV and the other who plays using the GamePad screen - this component appears as a modest pastime which also forces you to come to terms with a frame rate halved compared to granite 60 frames per second of the other sections. Consideration that finally leads us to touch the subject of the technical realization of Splatoon, on which there is very little to object: beyond the extreme fluidity just mentioned, the Nintendo product is a little joy for the eyes, with the colorful paints that almost tangibly cover the surfaces of the arenas, which compensate for their non-extraordinary polygonal complexity with a design studied to the millimeter. The look of the Inklings and the elements of equipment are also highly sought after, the latter featuring an exceptional variety designed to satisfy even the most demanding palates in terms of customization. Also not to be underestimated is the sound accompaniment, which boasts captivating music, jingles that remain in the head and very clean effects. A second opinion The first time is never forgotten, let alone when the progressive pulpit comes from a conservative company like Nintendo. And if on the one hand you learn by making mistakes, on the other we have a user - and an industry - not very forgiving in the face of an abused genre that is known and by now assimilated. Thanks to an appetizing price and an innate charisma, Splatoon will sell and evolve - hopefully - into much more than a colorful experiment: game system, transformation into squid, fluidity, elements of which you will have read in the review, all qualities that are worth an affectionate wink to the young people of EAD 2 for idea and realization. The title is there, but something is missing that makes it fly higher than the others. When Nintendo produces, what comes out is almost always rare, valuable goods, able to rise above the competition; this time, however, there is the distinct feeling that Splatoon is missing some mandatory features taken for granted. The risk is that the free DLC support in the months to come will not only make it much more than it is now but will complete it, filling gaps in the face of which it is impossible not to remain dumbfounded. You pass the absence of the four-way split-screen - perhaps an unplayable chaos would have come out of it - but the voice chat at least for parties with friends, the balancing of weapons and matchmaking, the paucity of the proposed modes, the inability to use the Pro Controller for solo play and the small number of arenas are all objective defects that naively devalue strengths such as immediacy and freshness of the product, making the", "date": "2015-05-27", "grade": "8.0"}