{"name": "Il Custode", "ref": "https://multiplayer.it/recensioni/150476-the-evil-within-the-executioner-il-custode.html", "text": "The Evil Within: The Executioner is the latest DLC announced by Bethesda Softworks and Tango Gameworks. An additional content that this time focuses on one of the most disturbing and charismatic figures (perhaps also due to the similarity with the Pyramid Head of Silent Hill) of Shinji Mikami's survival horror. After experiencing new horrors through the eyes of the beautiful detective Juli Kidman in The Assignment and The Consequence , with this DLC it's time to do it through those of the terrible Keeper. In fact, the plot tells of a father and his attempt to extract the daughter who is inside it from the STEM environment. To succeed in the enterprise, however, the man must access it and eliminate all the other connected subjects, above all a multiple murderer indicated with the code CB-212, which by now is in turn dominated by the system, is destroying the girl's mnemonic processes. And here we stop, deliberately remaining vague so as not to spoil the pleasure of discovering the details for yourself. In The Executioner players take on the role of the Keeper inside the nightmare born by Mikami Violence in the first person The Executioner completely overturns the story and dynamics of The Evil Within and the previous DLCs. In fact, if there the gamer essentially played the good guys and had to do with a third-person adventure with stealth elements, here everything changes and the user plays a ~bad guy~ (and what a bad guy), in a sort of hack and slash with first person view and a bit slow gameplay. In any case it all begins, after the connection to the STEM, from the Victoriano estate, which acts as the initial background and nerve center of the adventure. From there, following in the footsteps of his young daughter, the protagonist moves around the various settings in search of patients to be eliminated in order to free the young woman. In the guise of the terrible Keeper, the user can thus begin the slaughter. The monster is armed with the usual hammer, which he holds in his left hand, and the blows are inflicted by pressing the R2 backbone. If pressed repeatedly, it performs a sort of combo, actually quite slow. By hitting enemies and stunning them, an icon will appear next to their head indicating the possibility of grabbing them by the neck by pressing the circle button, and then throwing them away, or that of inflicting a lethal blow. In these cases the framing passes for a moment in third person, the time to carry out the execution which takes place in a scripted manner contextually at the point where the creature is: if it is next to a wall the Guardian will smash its head, if is on the ground he will crush it with his foot, if standing away from walls or similar elements he will crush it with a hammer. Defeated enemies release a sort of ~coin~ (ditto some scenario objects that can be smashed or revealed using the mnemonic scanner, a power that allows you to detect mental imprints relating to some past events) which can then be spent in the small room where , in addition to the mirror to save the game, there is also a safe that allows access to a ~shop~ where you can buy various upgrades. In this sense, they range from some upgrades for the hammer or for the Guardian's running and resistance skills, up to traps and new weapons, almost always unlockable only after defeating the relative boss who uses them. These weapons can then be used in the game, but only for a certain amount of time, after which they will be unloaded and will always have to be reloaded in the shop. To get more coins, if you want, you can participate in a separate series of challenges in the so-called Execution Rooms, where in a nutshell you have to face different enemies in waves. Given the setting given by the developers to this DLC, the exploratory part is therefore reduced to the bone. Apart from the collection of documents relating to Mobius' directives, the pages of the diary of the girl you are looking for and a couple of Spirits to take out, there is little else. And everything is carried out according to the arrival of the clash with the most important enemies, namely the Sadist, the possessed Joseph Oda or one of the giant twins already seen in The Evil Within, to name a few, who also here have the function of end area boss. A big word since each area is very small. However, it is against them that the challenge level of the game rises a bit, since they are quite difficult to take down, at least if you don't waste a few more minutes enhancing the Keeper. In this case then everything becomes simpler and, thanks to the very tonnage of the protagonist, improving in particular the strength of the attacks and the resistance, a minimum of strategy is enough to take out the monsters, perhaps remaining close to those armed with long-range weapons or away fromthe strongest ones in hand-to-hand combat. Playstation 4 trophies The Evil Within: The Executioner offers users six bronze and three silver trophies. To get them you have to perform a certain type of specific kills, such as throwing an enemy against spikes, or collecting all the pages of the diary or unlocking items from the shop, and so on. Safe head As for the technical aspect, The Executioner is graphically slightly inferior to the two additional contents starring Juli. From this point of view, we notice above all the textures for environments and opponents that are not always up to a production for PlayStation 4, even if the particle, light and shadow effects tend in many cases to mask it. Better then the soundtrack, which once again offers music perfectly suited to the narrative context of the adventure, capable of underlining every moment of the story as it should, especially the more violent ones or the clashes with the bosses. Ultimately, The Executioner isn't bad, but it doesn't quite measure up to its two predecessors either. The story is linked to The Evil Within, and it is therefore possible to discover new details about some characters, especially the protagonist of the DLC, even if there is nothing shocking or particularly profound in this sense. On the other hand, the gameplay suffers in our opinion from a certain basic repetitiveness and from a level of challenge calibrated downwards. Not to mention the fact that the camera occasionally throws tantrums and it's easy to miss an opponent by missing with one shot. The campaign, if we can define it that way, is very short and even wasting a few more minutes in the challenge rooms to collect ~coins~ or looking for collectibles, files and so on, can be completed in just over two hours . Once finished, the title still allows you to relive the experience in a slightly different way, proposing the classic New Game Plus and some other rooms for challenges, but nothing else. In light of all this, we recommend this extra content exclusively to all those who already have the season pass, to fans of The Evil Within who want to complete their collection or to those who in spite of everything want to have some fun smashing heads in the role of a fascinating character in his own way.", "date": "2015-05-27", "grade": null}