{"name": "Un seguito riuscito", "ref": "https://multiplayer.it/recensioni/150403-magicka-2-un-seguito-riuscito.html", "text": "Did you miss the wizards in ~bathrobes~ and their mentor Vlad, the ~non-vampire~? The wait is over and Paradox Interactive takes us back to the world of Midgard with the sequel to a title that needs no introduction: Magicka 2. For those who have never played the original yet, which boasts something like more than a million copies sold, or the free spin-off Magicka Wars, focused on PvP between wizards and released some time ago, Magicka 2 is a fantasy action role-playing game based on Norse mythology from which it draws settings, characters and enemies. Although the development team has changed (in fact, the Swedish house made use of the collaboration of Pieces Interactive, a team that had already collaborated on some of the very numerous DLCs released for the first one) this sequel still owes its strength to the unchanged originality that characterized the first episode, where there was already the possibility of creating many spells by combining the eight elements present: water, fire, earth, lightning, ice, death, life and shield. Not surprisingly, the subtitle of the game is ~Learn to spell....again~ and, in fact, in the fun tutorial that acts as a prologue to the adventure, you will immediately become familiar with the basics of this way of creating spells. The winning formula is practically always the same, yet the leap forward is remarkable both from a graphic and gameplay point of view, pushing the accelerator on the hilarious and irreverent humorous component typical of the series. Magicka 2 does not overturn a successful formula but adds some interesting innovations From one to four During the introductory hat to the events of the second chapter, the narrator invites us to listen starting immediately with the quote ~Stay a while, stay forever~ even taken from a 1984 game, Impossible Mission, for the glorious Commodore 64: Magicka 2 is full of quotes or situations that more or less clearly recall other video games or films, it's up to you to find and recognize them all. In the summary of the events, however, the narrator underlines how Vlad, master of magic of the first episode and guide of both chapters, has been absent for 40 years and on his return, without revealing the details of the plot, is looking for from one to four wizards to face this new adventure. And it is precisely the cooperative multiplayer component that represents the funniest mode, now made even more engaging by greater interaction with the scenarios and situations specifically designed to be solved by multiple players. But be careful: as in the first chapter, there is no shortage of friendly fire, so not tearing apart the wizard playing next to you is anything but easy. ~Never cross the streams~ Egon Spengler said to Peter Venkman in Ghostbusters, contrary to what is desirable in Magicka 2: in fact, by crossing a magical stream with that of a friend you will obtain an even more devastating ray and this is just one example of the dozens of situations you can find yourself in by making your magical combinations interact with those of the other players. Color explosion The graphic aspect, while maintaining the 3D in isometric perspective of its predecessor and the comic style typical of the series, is a feast for the eyes, as it is very colorful and much cleaner than the first chapter, so much so that, even in the most tangled situations full of enemies with explosions and graphic effects in profusion, we have not noticed any bugs or slowdowns of any kind. This underlines the excellent work done by Paradox which for the first time brings this series to Playstation 4 as well. The settings are quite varied and range from forests full of lakes, rivers and waterfalls, to snow-capped peaks and caves. There is also no shortage of villages, ruins and castles. In each of them you will meet the most disparate and clumsy characters each of which will make you smile more than a smile with his language, also characteristic of the whole series, or a sort of ~Magickese~, a mixture of Swedish, English and other languages Nordic, which reaches its peak when Vlad speaks it by adding an Eastern European accent. The game areas are summarized in the map that is changing as you progress through the chapters, winking at the map in the theme song of Game of Thrones, as indeed Vlad had already done by singing a parody of it in the launch trailer of Magicka 2. Musically speaking, with a new arrangement, the main theme of the first episode returns, to which are added traces of Celtic and modern-inspired music that blend perfectly with the hilarious sound effects of enemy explosions. In particular, the disco music coming from the radio that the goblins have on the beach is very funny!More immediate gameplay You can control the wizard with keyboard and mouse or using the gamepad, and in both cases the controls feel very intuitive with each element assigned to a different key. You can cast spells in front of you, around you or on you, paying particular attention to the natural elements in conflict with each other: if you are wet, for example, it is highly discouraged to use lightning unless you want to end up roasted; similarly, using the earth element on yourself will cause a boulder to rain on your head. The combinations are many. Do you want to create a beam of fire or ice? Just cast it with the element of death and you will get a lethal ray. Although some very powerful spells have been eliminated, such as steam plus lightning (water plus fire no longer form the steam symbol as in the first Magicka but simply launch a jet of steam), four slots have been added for the more complex spells, the Magick, which can be recalled with a single key. These must be discovered or unlocked during the adventure or within the other modes, a bit like what happened with the books in the first Magicka: when you use the quick key to cast these spells you will have to wait for a cooldown represented by concentration; if you use the element keys in the right order, however, you will not have any waiting time to relaunch it. Another big difference with its predecessor is the ability to cast spells on the move, penalized only by a slowdown, the greater its complexity. As usual, the camera follows the character as he moves, centering the view on him and becoming fixed when you fight with groups of enemies: this way of managing the views works well but also maintains an annoying flaw in this second chapter that was already there in the original, in fact, in the numerous situations in which you will find yourself fleeing to the corners of the screen or when you will be thrown in that position by the effect of an explosion, the character will leave the field of vision, not making his position clear . Adventures, challenges and artifacts! The game is not very difficult in normal mode even if there are some boss fights that will require dozens of repetitions before being completed, however completing the nine chapters of the story and its not at all complex plot is just the tip of the game. iceberg. The longevity of this title is greatly increased by the possibility of replaying the adventure mode and the other two modes, which we will tell you about very shortly, through the changes to the rules of the game that you can make with the use of the artifacts. These objects will have to be unlocked just like the wizards' tunics or weapons and, when you customize the selected game mode using them, you will have the most varied effects: there are some that make you walk faster or slower, others that they will speed up the regeneration of the health of enemies or increase the damage caused or suffered, still others will prove to be fun like the one that adds applause and sit-com laughs. We tried more than twenty different artifacts but there are so many to unlock. The other two modes are Challenges, where you have to eliminate twenty waves of enemies in a pre-set scenario, and Trials, where you have a fixed objective such as killing enemies within a time limit. All modes are playable solo or cooperatively but, knowing Paradox, we will soon be inundated with the most varied DlC.", "date": "2015-05-26", "grade": "8.5"}