{"name": "I lupi di Destiny", "ref": "https://multiplayer.it/recensioni/150424-destiny-il-casato-dei-lupi-i-lupi-di-destiny.html", "text": "Destiny's path for the first year of life was marked from the beginning with a season pass that promised, to those who bought it, two expansions within the release of a phantom sequel or a more substantial update in the autumn of 2015 . This The House of Wolves, the second of the two promised DLCs, follows The Darkness from the Deep, released in December last year, and which had introduced a new raid, the only PvE mode for six players in the game, but it had so many issues with content quantity and content mismanagement that it left us wondering about Bungie's ability to listen to a potentially large but very demanding community. In short, in the long run, the bad Crota, the final enemy of the DLC, had very little to say. Therefore, there were many expectations for this appointment, above all to understand how the team would move to ferry players towards less used modes such as PvP and to provide a structure capable of entertaining its users until the advent of the second game phase, the one that should start in the period from September to October of this year. I'll tell you a story, or at least I try to The strength of Destiny is not the narrative, this is clear to everyone by now. The plot of the base game and even that of the first DLC is confused, little told and largely entrusted to reading the cards of the library that accumulate by completing automatic missions related to the discovery of Specters for the maps and killing huge quantities of enemies in the different settings . These, inexplicably, can only be consulted from Bungie.net or through the official application, causing very few players to decide to delve into everything. Finally, in The House of Wolves the short story, which unfolds for five chapters and a collection mission on Venus, has an intelligible meaning by anyone and tells of the Queen of the Sleepless who, during the wars that marked the ~death~ of the Traveler, she had allied herself with some of the families of the fallen, led by the Barons, and who now sees them turn against her in an attempt to dethrone her in a sort of revolt led by Skolas, head of the house that gives the game its name. Here the habit of populating the story is repeated with three settings already seen in the main game, only played in reverse, but also two completely new places are faced, with the last one being also one of the most beautiful locations in the entire game. The plot, among other things, is a coherent pretext to start the most awaited addition of the DLC, the Arena of the Elders, a sort of prison where all the baddest villains of the game are taken to face in waves of four levels of increasing difficulty, which close at 35 with the clash against that same Skolas who is captured at the end of the last level. In short, we're always talking about a game that has clearly put the gameplay at the center, but at least here what happens really makes sense and the missions go by fast, also bringing a new type of weapon as a dowry, a light pistol with arc damage, however, to be equipped in the secondary slot and which proves to be quite useful in the Arena and even in PvP. A new assault is also added, good for weekly activities and to fatten up the rotating playlist which now rises in its maximum difficulty level to 28, from 26, well structured and fun to play. Just maybe with a low challenge rate, especially for more experienced players. The House of Wolves expands the world of Destiny by bringing more PvP and shooting The Prison of the Elders One of Bungie's biggest mistakes with Crota's DLC was having shredded all the equipment collected by players since launch without introducing as many new items to take and as many new settings. Not only that, having never updated the equipment of The Vault of Glass, the first beautiful raid, this had in fact become an activity for fetishists looking for all the rarest weapons in the game but with little real use. With the House, a system is introduced to recover and max out any piece of armor and any weapon, both legendary and exotic, giving players many more equipment possibilities and the excuse to go and fish for items that no longer drop since the launch of the game. In short, those who have kept a now obsolete weapon with antediluvian statistics for affection could now find themselves with a jewel in the archive. For exotic weapons it is enough to spend an exotic fragment, which Xur sells every week, for legendary ones, as well as for armor, you need the Ethereal Light which you recover at caso in Cala la Notte or in the Prison of the Elders, the new PvE mode for three players, if played at level 34 or 35. Always remembering that 34 is now the level cap for the characters, a level that thanks to this new mode it is possible to achieve in less than a week with three characters, while still having a close-knit group of friends to play with. In this mode you find yourself in the center of a crossroads that leads to four different rooms, one for each race of Destiny's enemies, and in these you can meet bosses or simple enemies but with always different bonus and malus modifiers. Bungie's artificial intelligence does the rest by creating fun challenges, especially at the highest levels, with 35 ending with the very powerful Skolas. At level 28 there is matchmaking and in fact the Prison, even at 32, becomes the fastest way to collect exotics, given that when it ends a treasure room opens up in which there is a chest, to be opened with the keys that are collected in the patrols going on the hunt for particular groups of Fallen of the House of Wolves. These are the subject of the new bounties and each time they bring up a chest that can contain synthesis for ammunition, engrams for weapons and armor and, of course, the key to the Prison chests which always guarantee a legendary or exotic weapon. In short, the detail of the loot always remains random, but it is no longer possible, having one of the keys, to return to Atollo, the new social space parallel to the Tower, completely empty-handed. A big step forward. Every week, when the servers are reset, Bungie shuffles the cards on the table, modifying the malus, the enemies in the rooms and even the bosses, always promising new challenges to those who play. The Trials of Osiris The other novelty, also for three players, is Trials of Osiris, a new PvP mode playable from Friday to Tuesday that puts two teams in an arena, which changes once a week, in which there is no respawn but in which companions can resurrect each other. Each game ends when all opponents are eliminated or when, after a certain amount of time, one of the two teams takes possession of a flag in the center of the map. To participate you must go to a vendor on the Reef called Brother Vance who gives you a ticket with nine yellow circles, one for victory, and three red circles, one for defeat. After three defeats the ticket runs out and you have to buy a new one. After three victories you can buy random blue packages; after five a piece of Osiris armor good for level 34; six to eight, one weapon, and two Legendary Packs that grant you Aether Weapons and Light. The tension is high and the three victories weigh heavily on the rump of those who play, all the more so as by racking up nine consecutive victories without losing one we end up in a new area on Mercury where a flaming golden ark awaits us from which to take the same weapons as Osiris but with added elemental damage, as well as Ethereal Light. A good challenge with very exciting games and always on the razor's edge, aided by three parchments that can always be taken from Vance and which compensate for the first defeat, which give one before starting and which give two victories to the first one achieved. To buy these you need some coins that you get from the daily PvP mode and in the Osiris games themselves. In short, having to sum up, Bungie carries on Destiny by giving lots of activities to the players and does it in the right way, finally listening to community feedback, but with some vices such as the stubborn obstinacy in not providing new enemies or new more diversified settings. What is certain is that now to be able to do everything with three characters every week you really need to get organized because, precisely, with the Casato the possibilities increase and the right focus is also given to the PvP which was ending up in a corner. This leads us to another choice that can hardly be shared, namely the lack of matchmaking for practically all the new activities which, since they are three-player modes, however do not have great coordination needs or particular difficulties that cannot be overcome with a little of sane ~trial and error~. In fact, the House asks you to play a lot, to organize yourself with close-knit groups of friends (PvP is a tough nut to crack for many) and to stay connected often even to teams that by now made raids with four or five players and that can now be found having trouble organizing groups of three. It's an expansion that we feel like promoting because it's fun and with a lot of gameplay, but which is aimed at a specific audience of players, those who are usually called hardcore. With this DLC, those who used to play Destiny once in a while to go for a ride with friends will probskilfully two alternatives: resume forcefully or stop completely waiting to understand what the future holds for us.", "date": "2015-05-26", "grade": null}