{"name": "Mothmen 1966", "ref": "https://multiplayer.it/recensioni/mothmen-1966-recensione.html", "text": "When is an appointment ruined? When all the efforts made on one side to make it special seem useless and, indeed, underappreciated? When in the middle of the evening does a strange figure come out and start telling disturbing oddities? Or when you have to be able to save your life from an ancient and ferocious force? Maybe after so much effort you even have a son who turns out to be a goat. Was it worth surviving? The Mothmen 1966 review will try to answer this and other questions, before sending you to a couples counselor. Gameplay The graphic style is really successful Mothmen 1966 is a visual novel with a graphic style that follows the color palette of the old CGA graphics cards, in which the intertwined story of three characters is essentially followed: Holt, the manager of a gas station lost in a dense forest, Lee, a young historian who can't stand her beauty, for a reason linked to his relationship with his father, and Victoria, Lee's girlfriend and also a historian, who end up entangled in a kind of war between humans and creatures of an unspecified nature that it has been going on for centuries. When we say that you ~follow the story~, we really mean that most of the time you read the dialogues and descriptions. Decisions can be made from time to time through a classic multiple-choice selection system, but overall they are few and do not create branches in the story. At most they change some dialogues or unlock objects in the gallery, the latter accessible from the main menu. In addition to this there are mini-games, overall very simple puzzles, all managed via text prompts which, in case of errors, can lead to the death of one of the protagonists, with an attached game over. However, they can be repeated as many times as you want and certainly do not represent an insurmountable obstacle, given that the logic is usually understood after the first unsuccessful attempt. For example, in one case it is necessary to find the right order of actions to be performed to chase away coyotes, in another it is necessary to reconstruct a mechanism by turning tiles, in yet another one it is necessary to use a weapon by choosing which enemies to kill first, in order to don't get overwhelmed and so on. There's also an ~impossible~ solitaire game to try to solve, but it's completely optional. All this to say that the fulcrum of the experience remains above all the story, with the rest as a side dish. Style Victoria, one of the three protagonists Mothmen 1966 doesn't recreate a classic graphic adventure for PCs with Deja Vu or Talisman-like graphics cards will be greatly disappointed. The title of LCB Game Studio is really very short and linear. It is finished in about an hour and a half; two hours if you try to unlock all achievements. It is in fact a short story, very short, of which some elements of the writing are appreciated, in particular those relating to the relationship between Lee and Victoria, but which is somewhat lost when it comes to making sense of the fantastic elements, much more sketchy in their being explained in an all too direct way. The attempt to rely on pulp genre literature and comics is evident, but we confess that it is quite difficult to be surprised in the face of certain revelations, also because nothing is done to wrest them from rationality, making them concrete to the point that in some cases they seem take the plunge and arouse hilarity rather than horror or amazement. A date during a creepy night Some questions remain hanging, but they are of those to which the answer is not sought with who knows what ardor, unfortunately. Even the attempt to forcefully insert some contemporary themes, such as the role of women in male-dominated society, appears quite awkward and forced, as decidedly out of context given the story being told and the way it is thrown into the pile, to then be almost completely flown over. Ultimately, what remains is a nice experience, which showcases a well-finished and in its own way fascinating graphic style, but which does not seem to have much breath and is, ultimately, negligible.", "date": "2022-08-27", "grade": "6.5"}