{"name": "La corsa dei colori", "ref": "https://multiplayer.it/recensioni/150331-color-guardians-la-corsa-dei-colori.html", "text": "If you own a smartphone or tablet, you've certainly tried some endless runner from time to time. After all, there are really a lot of them, often very similar to each other, and the reason is obvious: it is a genre that works very well in the mobile sector, thanks to the immediacy of the gameplay, the compatibility with touch controls and the possibility to play short games on an impromptu basis. Technological progress brings ever more powerful terminals, capable of moving complex polygonal environments, and therefore several developers are trying to offer products with greater thickness on iOS and Android, albeit with mixed success. Well, what would happen if someone decided to do the opposite, namely to bring a purely mobile type of game to PC and console? We discover it precisely with Color Guardians, the running game created by Fair Play Labs for PC, PlayStation 4 and PlayStation Vita (in cross-buy, in the case of Sony platforms), which starts from the fundamental elements of this famous trend but soon tries to make its mechanisms more complex, giving rise to non-trivial challenges. Color Guardians is exactly what it sounds like: a mobile-style running game ported to console The color thief It all begins when Krogma, a sort of evil specter, breaks into the fairy world of Terra Color and steals its colours, leaving the landscapes gray and sad. Rod, Lia and Grock decide to do something to bring everything back to normal and set out in pursuit of the enemy, through five worlds each dotted with a clash with the same Krogma. The Color Guardians campaign therefore consists of fifty stages, plus five bosses and about fifteen hidden scenarios, which are unlocked by replaying missions already completed in order to find small creatures, for a total of over seventy levels. This translates into at least five hours of gameplay, which can however become many more due to a degree of challenge that is anything but trivial: beyond the first ~world~, which serves as an introduction to the game mechanics, the difficulty of the title developed by Fair Play Labs soon becomes evident, leading us to often repeat particularly complex sections in an attempt to prevent our fingers from intertwining. In fact, the authors have not limited themselves to bringing the structure of typical running games from mobile to consoles, but have tried to make the action more difficult by introducing a large number of pitfalls and obstacles along a path that is neither infinite nor random in the arrangement of traps, but which actually takes advantage of a couple of checkpoints (essential to avoid more intense episodes of frustration than those already present) and a ~trial & error~ style approach. On the one hand, this last factor gives coherence to the experience, allowing us to try and try again a stretch of road until we get the right combinations right, on the other it inevitably ends up breaking the rhythm and transforming a rather limited gameplay into something also very repetitive. The game of three shades We have said how Color Guardians tries to make the typical mechanics of horizontal scrolling running games more complex, so let's see specifically what solutions have been adopted by the developers. The three protagonists of the game, interchangeable at a certain point, are creatures capable of changing their colour, going from red to yellow to blue respectively by pressing the Square, Triangle and X buttons on the DualShock (but the commands can be customized from the options , if desired). Just like in the classic Ikaruga shooter, the tone we assume is functional to the interaction with the scenario, in this specific case both as regards the collection of spheres of the same color (necessary to obtain, at the end of each stage, the inevitable stars - from one to three, depending on the performance) both for the use of trampolines, fans and ramps, as well as for avoiding obstacles of the same colour. The action takes place along three ~lanes~ on which you can move using the left analog stick or the d-pad (better, for a matter of precision and reactivity), but it is not enough to become, for example, red to collect the red orbs scattered along the journey. No, you also have to press the relevant key at the same time, a bit like in rhythm games, and this leads to having to really create coordination and speed masterpieces if you want to get the three stars in the advanced stages. Moreover, already towards the end of the second ~world~ phases are introduced in which it is asked to make inverse reasoning, that is to say avoid guessing the colors in order not to activate the trampoline-mushrooms that would lead us to impact with the flying ghosts at the commandof Krogma. In short, the challenge is not really lacking and it is the bosses who disappoint at this juncture, who tend to repeat the exact same pattern by adding only further elements between one clash and another. Playstation 4 trophies Color Guardians includes forty-six Trophies, and to obtain them you have to complete rather varied tasks: complete a stage without collecting even one sphere, color the entire scenario, free all the Toki by replaying the missions, earn a variable number of stars, fall from a cliff a hundred times or even achieve a perfect score with the exception of a single object. Nice tint In short, Color Guardians boasts a fairly full-bodied campaign (although the levels are short-lived) and a considerable degree of challenge. So what's wrong with the Fair Play Labs project? Basically it is the starting concept that is weak: running games were born to make the most of the peculiarities of mobile devices and offer their owners impromptu entertainment, but bringing them to PCs and consoles is a bit like using a seven hundred euro smartphone to play with Snake. Nothing prevents you from doing it and you can even have fun, but from here to defining it as an appropriate use of the hardware goes a long way. True, the authors have tried to make the game mechanics more complex and you really have to work hard to pass certain missions by getting two stars, let alone three; but at the same time we remain bound to a very limited gameplay, which by its very nature cannot go beyond the change of lane and tone in a context based on reflections and glance. It's a pity, because a good job has been done on the technical implementation front: although the design of the characters is not crazy, the expedient of the scenario which is colored dynamically as we collect the spheres is captivating, the ~worlds~ boast a discrete variety and the musical accompaniment manages to capture the attention just enough.", "date": "2015-05-25", "grade": "6.0"}