{"name": "Tre biglie e un portale", "ref": "https://multiplayer.it/recensioni/150307-portal-pinball-tre-biglie-e-un-portale.html", "text": "If you have read our previous articles dedicated to Pinball FX 2, you will surely have had the opportunity to realize how this game has built a large part of its success on a series of external licenses, obtained from Zen Studios for the use of brands and characters famous: the last in chronological order, for example, was the one dedicated to Marvel's Avengers: Age of Ultron, released together with the film of the same name in theaters. A month after the arrival of the superheroes of the American publishing house, the developers have decided to take a little vacation from the world of comics, surprising us when a couple of weeks ago they announced new content dedicated to Portal. In a similar way to what was done with the table dedicated to The Walking Dead, the Zen Studios guys went beyond obtaining the license and were also able to count on the active collaboration of the external team that owns the brand. In the specific case it was of course Valve, which helped bring Chell, GlaDOS and all the other protagonists of Portal into this new guise, to the immense joy of its many fans. Portal Pinball is arriving in these days on the various platforms for which Pinball FX 2 is available, at the usual price of 2.99 euros. We remind you that the basic version of the game can be downloaded freely, to allow the player to choose individually what to buy. But let's get to the point and let's see what really awaits us in Portal Pinball, even if from our tones you have probably already understood what the outcome of the test was. For a pinball machine, Portal Pinball is as desirable by fans of the game developed by Valve GlaDOS against everyone Portal Pinball takes up the plot of the two masterpieces developed by Valve, adapting it as much as possible to its pinball nature. It does so by placing the player and his marbles in the role of the protagonist Chell, who is busy trying to get out of the Aperture Science labs. The air you breathe is the exact same as in first-person games: just to please, you immediately find yourself having to hit a portal in the traditional skill shot with which you throw the ball inside the table. From that moment, Portal Pinball will push us to complete all the tests proposed by the various test chambers, also inspired by Portal and corresponding to a series of objectives to be achieved between buffers and ramps: once all have been completed, we will arrive at the final battle against GlaDOS. It is a decidedly demanding experience but well balanced in terms of difficulty once the ice has been broken with some introductory games. In the creation of this table, Valve and Zen Studios have not forgotten the robots Atlas and P-body, protagonists of the cooperative mode of Portal 2, thanks to which they give life to what is the inevitable multiball mode. Like other tables, Portal Pinball takes advantage of its being a virtual instead of a real pinball machine, giving the player the possibility of accessing a minigame in which to try to find Ratman's secret hideout, or to the Turret Factory where to sabotage the GlaDOS turrets, for ensure that they arrive defective in the final showdown with artificial intelligence. The main objective of Portal Pinball is always to get as many points to improve your High Score, but the experience offered goes far beyond simply making the ball travel up and down, representing in all respects a great way to relive what is one of the most loved titles by many players. However, the table itself shows an excellent design, opening the game more towards the top compared to its predecessors: the result is a greater use of the ramps, accompanied by the presence of two additional flaps in the upper part of the screen, to be used wisely to get the bonuses. No one is missing To infuse the essence of the license into Portal Pinball, the two teams have also taken care of the graphic design with which the table setting was created down to the smallest detail: alongside the main fins we find Chell in her room, while the representation of GlaDOS and the Aperture logo dominate the pinball machine from above. The protagonist of the game then moves between the various platforms, activating the various animations that correspond to the available challenges. The other characters known in the game created by Valve also peep out, including the guide Wheatley who in this case also has the task of accompanying us during the game with his amusing commentary. In addition to our companion's voice, playing Portal Pinball it is possible to listen to a themed soundtrack, whose melodies change according to the various phases of the game. In conclusion, if you are avid Pinball FX 2 players you absolutely cannot miss this new table, provided of course that you are a Portal fan ready to spend hours and hours trying to escape from GlaDOS. Otherwise you will still be able to find an enjoyable and challenging table at the right point, only losing something in terms of involvement.", "date": "2015-05-25", "grade": null}