{"name": "Fuga dal Vuoto", "ref": "https://multiplayer.it/recensioni/150178-nihilumbra-fuga-dal-vuoto.html", "text": "Nihilumbra is neither the first nor will it be the last title to land on the digital store of the Nintendo home console after having already been made available on other platforms. The story of the platform signed BeautiFun Games began on portable devices, where it was very successful above all for the dark tones and the evocative atmosphere that made it a platform along the lines of Limbo far from the colorful and light-hearted canons typical of the genre . However, especially from a graphic point of view, all the limits of the independent Catalan team have come out, unable to fully exploit the potential of the title, stumbling into some graphic flaws that have inevitably influenced its evaluation. The solid gameplay drove sales and allowed the developers to also put in the pipeline a PC version with renewed graphics and one for PlayStation Vita which debuted earlier this year on PSN. Now it's time for the Wii U, let's see how it went. Nihilumbra arrives on Wii U taking full advantage of the full potential of the GamePad The power of the GamePad It only takes a few moments to realize the unconventional tones of Nihilumbra. The protagonist of the adventure is Born, a completely black little creature born from a mass of dark matter known as Void, from which he decides to escape to find out what the outside world has in store for him. The desire to leave behind the abuses and harassments of the world of emptiness is great, but soon we realize that most of the situations we will encounter will be anything but friendly. In fact, his escape is constantly marked by the pursuit of the Void who, through his henchmen, tries to put a spanner in the works as much as possible to bring Born back to where he belongs. Thus the protagonist begins a journey that will lead him to explore new and wonderful worlds, each characterized by a specific element that we could use to our advantage at any time. It starts from a cold winter scenario covered by a thick blanket of snow, to then get to explore volcanic areas, swamps, deserts and forests. The interesting thing is that with each change of setting a new color will enrich the color palette of Nihilumbra, gradually outlining richer and more evocative scenarios that grow in complexity hand in hand with the difficulty. In this sense, a power of our virtual alter ego is linked to each new color that we find in each setting, which allows us to modify the game physics and manipulate the scenario to overcome platform phases and environmental puzzles that would otherwise be impossible to solve. For example, ice corresponds to blue: dragging your finger on the floor freezes it and allowing Born to slide over it and gain speed to make longer jumps or by sliding enemies straight into a chasm or a trap. Similarly, green allows you to create elastic surfaces on which to bounce or brown creates a layer of sand that slows us down in movement but muffles any sound, allowing us to overcome enemies undisturbed. The use of skills is certainly the most successful aspect of this conversion on Wii U given the possibility of directly using the GamePad touch screen to ~paint~ the screen with the stylus. As the game progresses, things gradually become more complex, up to the second half where the difficulty curve rises considerably: the first half therefore turns out to be a long tutorial introducing the game mechanics, while the second largely more difficult and at times frustrating will test the ability and above all the patience of anyone who has had the tenacity to go so far. Once the adventure is over, a series of new mechanics and unpublished enemies are then unlocked that give new life to the title, as well as the exclusive possibility for Wii U to play it in cooperative with a player to command Born's movements via the Wii Remote and the 'more to manage skills through the touch screen of the pad. In this sense, the work done by the development team on this porting for Wii U was excellent especially in terms of commands that are always precise and intuitive to use, even when you have to move and use powers at the same time, even if it forces the player to keep your eyes fixed on the GamePad screen making it almost pointless to turn on the TV. In addition to the controls, the graphics have also been improved, as well as dubbing and environmental effects, but it is sad to see how the paucity of some scenarios and their repetitiveness remain unchanged.", "date": "2015-05-22", "grade": "7.3"}