{"name": "Robot in un quadrato", "ref": "https://multiplayer.it/recensioni/150125-ultratron-robot-in-un-quadrato.html", "text": "Beyond the value of the title you'll read about shortly, if there's one thing absolutely right about Ultratron it's that it exactly reflects the indie nature of Puppy Games, for better or for worse. Few elements, love of vintage, lots of pixelart: they are galvanized by calling them ~neo-retro arcade~, to us they simply seem to be multidirectional shooters like so many we have seen in recent years. And the boys have made other similar works, all equally characterized by a graphic style that mimics those arcade characters in suffering transhumance towards the age of forty. Ultratron has a very simple formula: give the player a brave little droid to fight against armies of killer robots. We have not summarized, the synopsis is really this because of the title, as a total arcade, what should interest you is the way Puppy Games will try to make you spend a few hours having fun in front of the GamePad. Or not? Amusing immediately, repetitive in the long run: Ultratron is a sufficient shooter but little more! Shoot all round A little, since the GamePad acts as a window for off-screen play and that's it. By now it is not pessimistic arrogance to say that we expected it: from a title - moreover a shooter - what to say multiplatform is an understatement we could not even remotely hope for a particular use of the GamePad, so we advise you immediately to go and recharge the Pro Controller, definitely the best companion against psychedelia of Ultratron. We are not at the levels of sacred monsters of the minimalist shooter genre and the Puppy Games product doesn't even try, in reality: the 16-bit approach offers models that, although alluding to a retro style, remain modern and up to date with the standards. Visually, the team makes a nice synthesis between a tribute to the past and the desire to fill the screen with as much playful adrenaline as possible, albeit with all the limited ambition of the case. The title offers 40 levels to complete, with a practically unlimited procedural end-game attached: each level is set in the same setting, stuffed for the occasion with more or less dynamic enemies who will make movement and shooting their threat proposal. Kills give coins to accumulate, but that's not all: robotic birds and mechanical fruit will intervene within the battle to provide bonuses to the quickest players. That's right, players. GamePads Puppy Games condenses the real use of the peculiarities of the GamePad into off-screen play. Could we have asked for more from a multidirectional and multiplatform indie shooter? All over again Thanks to the off-line multiplayer limited to two users at the same time, Ultratron is one of those products designed for couch-play, a concept that certainly helps to metabolize a rather spartan essence in the long term. You pass the end-of-level shop where you can spend the money on improvements and you pass the online leaderboard with records to compare with the rest of the world: the problem is that the arcade structure is merciless towards progress. Each death will start all over again and if this is the godsend that some have been waiting for, we do not deny that until the end we hoped for a gameplay terrain that was a little more evolved than mere shooting-upgrading-destroying. Also because every 10 levels there is a boss and we are not talking about epic battles at all; fun, of course, but trying and then trying again finding yourself having to constantly accumulate coins to spend them again, perhaps, in the same upgrades will appear as the worst dj vu. The total shooter mechanics work, managing to differentiate themselves from the rest of the offer but being frankly inferior in quantity and personality to a random Scram Kitty, which exactly one year ago landed on Wii U at least with a little level design. And we're talking about two products at the same price. With this we do not intend to dismantle what painstakingly brought forth by Puppy Games, simply to warn anyone who lets themselves be dazzled by some particle or chaos of lights on the screen that Ultratron is one of those titles that can be optimally inserted into an arcade context due to its immediacy, but which effort engages in a club eager for that sense of maintaining progress which is the exact archetype of the console world.", "date": "2015-05-21", "grade": "6.5"}