{"name": "Dex", "ref": "https://multiplayer.it/recensioni/150090-dex-sogno-o-son-dex.html", "text": "Although closely connected to the world of technology, strangely, cyberpunk has seen relatively limited exploration over time by the world of video games, within which the Deus Ex series can easily be remembered together with the recent Watch Dogs. Especially if you continue to dig into those not deriving from non-videogame works, noteworthy titles soon start to run out, and this is why cyberpunk fans at the time welcomed the news relating to the development of Dex, a game made thanks to the funds obtained through Kickstarter by Dreadlocks, in its first time on the PC platform. Over 30,000 pounds were raised at the time through crowdfunding, thanks to which the project was able to come to life even in an extended form compared to its original draft: given its youth, the Prague-based team naturally had to respond to the curiosity of those who felt attracted to Dex, bringing their game to Steam in Early Access some time ago, still in an embryonic state with an alpha version. Our previous encounter with this game dates back to this phase in recent months, which we can now review given its landing on the digital delivery platform in complete and (almost) definitive form. Is knowing if androids dream of electric sheep a doubt that grips you? Play Dex! As per the script The story aspect of Dex was one that had previously been hidden from us by Dreadlocks, as the version we tested a few months ago contained very little hints at the main story. Once again we naturally find the heroine who gives the game its name: in the initial stages, Dex is awakened by a mysterious character known as Raycast, while agents linked to the mega corporation known as The Complex are trying to raid in her house to kill her. What will soon turn out to be a legend in the world of hacking will briefly initiate her into the art of which she is a master, directing her for this purpose to a certain Decker, apparently a simple bartender. A kind of Matrix which, starting from the introduction, inextricably links its plot to the classic trend of the cyberpunk genre, drawing heavily on it to give life to elements such as the threat posed by the inevitable conspiracy, embodied in particular by the artificial intelligence Kether . To fight it we find an equally inevitable handful of heroes, who for a series of reasons to be discovered will put a large part of his trust in Dex; in the background the city of Harbor Prime, which with its places is somewhat reminiscent of the Los Angeles of Blade Runner. Although it is a story that undoubtedly seems to have already been seen for large stretches, the one told by Dreadlocks manages to be followed also thanks to a good cast of characters, which marries perfectly with the dystopian-type atmosphere, also a trademark of the cyberpunk genre. As regards the evolution of one's character, the growth mode is rather simplified compared to a classic RPG, but it is definitely appreciable: the player can choose to specialize in various disciplines, obtaining bonuses in aspects such as close combat or with weapons, hacking and more. It is also possible to exploit separate skills, such as the ability to pick locks (fundamental) and persuasion, capable of influencing the conduct of dialogues with non-player characters. Speaking of the latter, one can only applaud the work of the Prague boys: in fact, the amount of characters and situations shows a particular attention paid to the creation of a Harbor Prime that pulsates with its own life, where you can let yourself be accompanied in the main thread of history but even getting lost in some far from obvious secondary quest. Returning to Dex and his abilities, we also report the presence of an important system of technological systems, thanks to which to count on ~super powers~ such as higher jumps or resistance to elements that would otherwise be lethal. Hackers are born In terms of gameplay, what was missing in our previous test was the hacking system, already promised by the Dex developers at the time. Now that we know it, we can say that it is a minigame divided into two different parts, depending on whether you want to violate cyberspace or damage elements of the real world, up to even enemies. From the control of the protagonist you pass with the pressure of a key to the virtual setting, within which you control a sort of ~ship~ equipped with a laser with which to eliminate obstacles such as firewallsthat protect the most important units, or shoot the viruses that populate cyberspace, represented in the form of insectoids of various types and sizes. When one of these comes into contact with our entity, we end up losing ~focus~, returning to the real world with a small damage of 50 life points for Dex: a rather soft penalty, which offers the possibility to try again almost immediately to launch in hacking dynamics. Taken as they are, the latter are quite pleasant, even if you soon end up realizing that there are some tricks to be used to exploit a not exactly very advanced enemy artificial intelligence, a sign that what was one of the last components to be introduced in the game would have required a little more optimization. The firearms combat system present in the ~real world~ continues to leave us with a big question mark: contrary to what we expected, the choice to prevent aiming while moving was also confirmed in the final version, making the The use of pistols and the like is only a resource to resort to in case of desperate need, otherwise preferring close combat with punches, jumps and parries. The stealth mode also remains on the same wavelength, little publicized by the game itself, almost as if the developers had changed their mind about its presence once it was completed. From this point of view, we were surprised to see areas monitored by cameras that sounded alarms once activated, without further aftermath such as the rush of guards or greater attention from those present nearby. It is also necessary to pay attention to the bailout management policy, more similar to checkpoints: in order to effectively maintain all one's progress, one must in fact change district, but before realizing it, one risks losing game minutes. I <3 Harbor Prime For Dreadlocks' debut PC experience, Dex delivers convincingly on an artistic level. The interlude sequences are represented in a comical way using a style on the one hand that is now particularly inflated, but on the other able to show an evident attention to detail, also confirmed by the animated backgrounds made with a chromatic scale that stands mainly on the inevitable grayish tones. Harbor Prime also lives thanks to the diversity of the places that compose it, from the sewers in the downtown, passing through the port: at every corner it is possible to immerse yourself in history thanks to an excellently made dubbing, both in terms of quality and quantity, given that each character has its own voice. All this is supported by a themed soundtrack, linked to the various settings visited. Wanting to find something wrong, on some occasions some animation is missing in Dex's movements, while on the sound effects of the alleys something more could perhaps have been done to make the general experience even more engaging.", "date": "2015-05-20", "grade": "7.3"}