{"name": "Electroplankton", "ref": "https://multiplayer.it/recensioni/electroplankton.html", "text": "We are all artists What is surprising is that producing such an atypical title was not a small independent softco in search of visibility, but Nintendo itself which has made accessibility the common denominator of most of its games. Let me be clear, Electroplankton is absolutely a product accessible to everyone, but which will only be able to interest and intrigue a small circle of users. In summary, the aim of Iwai's work is to allow the creation of small audiovisual works in an immediate way and by breaking down any technical obstacle between ~artist~ and ~product~. In fact, everything takes place through an interface that uses the stylus (+ possibly the microphone), within ten different situations represented by as many types of plankton. In Tracy, for example, the lines drawn on the screen are crossed by small organisms that produce a sound, which varies according to the speed and direction with which the line was drawn. In Hanenbow instead, the plankton is thrown against a kind of aquatic fern, and the contact with each of the bouncing leaves of the latter generates a sound effect; by varying the angle of the leaves it is possible to change between the rebound trajectory of the plankton, and consequently the final composition. Rec-Rec instead allows you to record up to 4 sounds or phrases and then mix them together on the basis of a beat with variable speed at will. Beatnes, on the other hand, will bring tears to longtime Nintendo fans, since it allows you to create musical compositions using the sound effects of some great NES classics (such as Mario Bros and Kid Icarus). These are just some of the situations made available by Electroplankton, but they should still be sufficient to at least give an idea of what the product intends to offer. In principle, the results of the various sessions are resolved in audiovisual compositions with chill-out or vaguely new-age tones, and it is surprising to note how a really pleasant soundtrack can be born almost randomly. But on the other hand, this is precisely the essence and purpose of Electroplankton. An unfinished genius From a technical point of view, the Nintendo production offers a minimalist but extremely characterized and intriguing graphic style, destined however, like any artistic expression, to be liked or not based purely on the personal tastes of each individual. But that's certainly not the weak point of this bizarre DS experiment. Probably due to technical limitations, or due to a perverse will of Iwai himself, Electroplankton finds its enormous limit in the total impossibility of saving one's own compositions, thus clipping the wings not only of the desire to deepen the study of the various situations, but also of the same longevity already undermined by the lack of any development or progress. Spending time to give harmony to a tangle of sounds, finally finding the crux of the matter and finally creating a song worthy of attention turns out to be an effort that few will accept to make, aware that everything will be in vain once the console's power button is pressed. Comment Electroplankton is an experiment as interesting and intriguing as impalpable and ephemeral. Nintendo's production, commendable for its intention of proposing something really different and original, is first resized from a depth that is really too small, and then definitively compromised by the total impossibility of saving one's creations. Asking players to transform themselves into artists or aspiring artists, and then forcing them to throw away the fruit of their work, is a not too covertly cynical mechanism that very few will be willing to accept. Pros Quite original Intriguing graphic style Potentially very stimulating Cons Inability to save your creations Too shallow depth Limited Stop. Before you even start reading this article, you should know one thing: Electroplankton is not a game. There are no scores or missions, there is no end goal or bosses and enemies to take down, there is no character to control and there is no weapon of any kind. Electroplankton is an experiment, very different from anything else seen not only on Nintendo DS, but in general in the world of consoles. The author, Toshio Iwai, is a name far from known in the world of video games; in fact, he is not a game designer with proven experience, but a forty-four-year-old artist who has mainly expressed his creativity through computer-generated digital works and/or through largely experimental musical compositions. It is therefore clear that fromsuch a character could not be born into a product channeled into classic tracks, and Electroplankton takes an absolutely particular and innovative path.", "date": "2006-02-03", "grade": null}