{"name": "Gran Toren?", "ref": "https://multiplayer.it/recensioni/149954-toren-gran-toren.html", "text": "The cycle of life: a girl who takes her first steps and finds herself a teenager after a few moments, who is born and dies, and who manages to push herself a little higher with each new attempt. Her goal is to defeat the evil dragon who is on top of a very high tower, to fulfill the prophecy and restore the light of the moon. This is the incipit of Toren, the adventure developed by Swordtales and produced with the collaboration of the cultural department of the Brazilian government. It's always nice when politics takes an interest in our favorite medium and tries to promote it in some way, but if years ago this type of initiative resulted in the birth of the horrible Giovent Ribelle in Italy, it is clear that between saying and doing the proverbial sea is involved. And Toren, inspired by a classic like ICO for atmospheres and setting, immediately put himself in an awkward position, probably nurturing ambitions too big for what is the reality of a small studio with little experience. Let's see why. Toren starts from an interesting idea, but fails to turn it into a pleasant video game to play The atmosphere is... The lack of Italian and the idea of telling the plot through text screens doesn't help, so much so that you have to complete the game twice to have some concepts clear, but there is no doubt that the atmosphere and the narration are the points of strength of Toren. As anticipated at the beginning, the story of the game is a mix of metaphors, folklore and oneiric experiments, in which the protagonist is a girl who is born at the foot of an enormous tower, quickly passes from the condition of a newborn to that of an adolescent and begins to climb the structure with the aim of reaching the top and meet your destiny there, challenging an evil dragon with the support of a legendary knight, Solidor. There are phases in which you find yourself immersed in a dream, jumping from one platform to another avoiding traps and solving rather trivial puzzles, which simply require you to trace a symbol on the ground with salt in order to move forward. The management is lacking and at times hasty, the times are not always respected, but despite this the idea works and we proceed without major problems, apart from a few small bugs. In certain moments the death of the girl becomes inevitable, as indeed happens during the early stages of the game; and we find ourselves later, reborn, to take advantage of the progress made previously in order to overcome a certain obstacle, or perhaps to be able to get our hands on the enchanted sword which seems to be the only weapon capable of killing the dragon. Very valid and interesting concepts on paper, but which are implemented in a mostly vague and banal way, debasing the playful component of a product that turns out to be too easy in the end and is completed within an hour or so. ...but the rest is missing It is in fact in the transition from the project to reality that all of Toren's problems come to the surface, both from the point of view of the gameplay and from that of the pure and simple technical realization. Let's start with the latter, which rests on a fairly well-made lighting system, often the protagonist of the various sequences inside and outside the tower, but which is assisted by a mediocre polygonal modeling, low-definition textures (often framed in the foreground, for the series let's go find them...), by moments of panic from the virtual camera and by a general lack of connecting animations. The protagonist's hair is decidedly old-gen, and hitting the sprites crowding certain platforms with the sword almost creates a bit of embarrassment, given that not only is the collision detection what it is (and the physicality of the blows is almost nil ), but the monsters just disappear once touched by the weapon. The very fact of being able to wield the magic sword, from a certain point of the adventure onwards, does not materialize in the introduction of new gameplay elements, in this case combat. No, you get stuck inside terribly trivial, down-to-earth puzzle mechanics, which don't represent a challenge worthy of the name: you activate some mechanism, move objects, cling to the ground to avoid gusts of wind ( Never Alone docet, and in fact the two productions have a lot in common), fires are lit and from time to time we try to win with the dragon along the way, within short boss fights, taking advantage of a series of shelters when we are not in possession of the sword. The result is that one dies only when this operation is preparatory for the purposes of the narration: the girl is reached by the petrifying breathof his nemesis and turns into a statue, a statue that his next incarnation can use as a cover to get past that point; or the petrification takes place just when the protagonist is about to get her hands on the sword, stuck between the branches of the plant that grows in the center of the tower, and this causes the weapon to fall, which we can then pick up. It must be said that the musical accompaniment does not disappoint, on the contrary it manages to effectively underline certain passages and substantially enriches the experience, the limits of which are however too numerous (we have already mentioned the very short duration, yes?) to be able to aspire to an evaluation positive.", "date": "2015-05-18", "grade": "5.0"}