{"name": "La paura di una volta", "ref": "https://multiplayer.it/recensioni/149853-forgotten-memories-la-paura-di-una-volta.html", "text": "Video game clichs are a sort of Linus blanket, a sort of guarantee through which a developer can secure an ~advantage~ by touching on issues already known to users, familiar and appreciated. In the context of psychological survival horror in the Silent Hill style, the setting of the asylum, or psychiatric hospital, is one of the fixed points most often shared by those who have attempted to emulate its deeds. Last in the list, this Forgotten Memories by the unknown French-Canadian team Psychoz Interactive is now arriving on iOS, and in the coming months also on Android, PC, Wii U and PSVita, a title that has been in development for 6 years and which closely follows (or rather, from very close) precisely the atmospheres of the Konami series, more precisely of the second, splendid episode. The release period was not very lucky, to tell the truth, being practically contemporary with the excellent Lost Within which shares its genre and setting (yes, always the asylum): it is already difficult to push mobile users to abandon endless runners and the like for something more complex, let alone if there is to divide the cake between two similar titles and with premium prices. Closed the parenthesis, Forgotten Memories undoubtedly deserves some attention, if only for the production values: technical component and presentation are in fact at the console level, so as to provide an absolutely positive, if not downright surprising, first impression. But then? Forgotten Memories does some things well, others not, but the mobile environment doesn't seem to be the right one From the very first moments of the game, the extremely strong influence of the aforementioned sources of inspiration can be felt: the protagonist is the investigator Rose Hawkins, who for some reason wakes up wounded, with no memory and with the only memory of being in the looking for a girl named Eden. After getting back on his feet, Rose is destined to meet the mysterious Noah, a woman who speaks only through recorded messages and who promises to help the protagonist as long as she finds her nurse friend in the asylum. The entire structure is then inhabited by mannequins, at first disturbing but immobile figures, but soon destined to transform themselves into dangerous animated enemies. While certainly not standing out for its originality, the experience in Forgotten Memories can therefore be defined as quite successful: the atmosphere is in fact good, the plot unfolds slowly but with a certain amount of curiosity, and the characters are fairly characterized. It is also certainly evident how Psychoz Interactive has worked with passion, trying to create a quality exponent of the survival horror genre. However, the company was only partially successful, due to a series of problems that start from some game design choices that are difficult to digest. The biggest problem is that Forgotten Memories suffers a lot, if not too much, from adapting to the characteristics of smartphones and tablets; in this sense it is worth mentioning the fact that versions for PlayStation Vita and Wii U are also planned, consoles that are undoubtedly more suitable for hosting an experience of this type. The greatest difficulties are in fact undoubtedly deriving from the control system: the inability of a touch screen to replicate the functions of a pad has been discussed a lot in the past, but Forgotten Memories could be used as an example of how this component can really frustrate and completely ruin the gaming experience. The old school inspirations of the project translate into a character management model very similar to that of the various Resident Evil and Silent Hill of the PlayStation 2 era: woody controls, not very fluid movements and a certain general rigidity make the interaction via touch screen a kind of nightmare, within which a simply bad combat system stands out in a negative way. Beyond the intentions of the developers, we sincerely think it's an anachronistic and not very feasible way to play nowadays. To make the players even more prone to a nervous breakdown then the rescue mode takes care of it, which requires you to recover precious floppy disks to be used on computers scattered inside the asylum. Dying between saves means having to replay entire sections from scratch, quite simply. Then there is the torch, the only ally in the darkness of rooms and corridors, which however has a charge destined to run out rather quickly; in that case, special energy stations must be used, also scattered here and there. In its first version, Forgotten Memories was therefore an almost unthinkable game by modern standards. The developers have evidently collected a good number of complaints, since it was soon addedta an Easy mode that guarantees more energy to the protagonist, a torch that never runs out, the disappearance of floppy disks, more ammunition and weakened enemies. Therefore, unless you are a masochist, our advice is undoubtedly to choose the easy mode: by doing so it will be possible to appreciate the excellent - really - graphic component, the remarkable English dubbing (which can count on some of the actors from Silent Hill 2) the apt atmosphere and overall good general quality, even within the standards of the genre of ten years ago. Too bad, however, that everything runs out very quickly, with less than 2 hours needed to reach the far from exhaustive conclusion, which leaves the door wide open for further future episodes. Considering the development period, this is a rather disappointing aspect.", "date": "2015-05-15", "grade": "6.7"}