{"name": "Axiom Verge", "ref": "https://multiplayer.it/recensioni/149737-axiom-verge-talmente-retro-da-essere-avanti.html", "text": "Nostalgia is a powerful anesthetic, it dulls the senses and sometimes prevents us from seeing things for what they really are. This is why the film industry is plundering the imagination of thirty-somethings, this is why Instagram is so successful with its faux-old photos and we are haunted by a culture of recovery, remake, memory and postmodern reworking: it is much more It's easy to sell us something we already know and that maybe we connect to pleasant sensations from when we were younger. It would therefore go without saying to categorize Axiom Verge as yet another indie title with old-fashioned graphics that tries unashamedly to take you back to the good old days. Of course, the most malignant ones could speak of plagiarism, of blatant copying, but there is much more under its pixels. Axiom Verge was undoubtedly born in the sign of Metroid, Castelvania, Contra, Turrican and a whole genre made of exploration, millimeter leaps and secret areas. But behind a graphic design that will bring tears to the most experienced players hides a title with perfect mechanics, studied to the millimeter to be complex, without being impossible. It is a title with simple premises but with an impressive vastness, which risks stealing your time without you realizing it, level after level, boss after boss, in what is basically the wet dream of every retrogamer and hardcore gamer, indeed, more simply, of every player who considers himself such. Axiom Verge is a blast from the past that will entertain even those who have never played Metroid One man in charge The most impressive fact is that all this is the work of one man: Thomas Happ, a former Petroglyph programmer who worked on Axiom Verge in his spare time for five years, dedicating all his effort to it only in the last six months. If the project had been a toy train, Happ probably would have succeeded by now in creating a miniature transport system capable of connecting all of Europe. An impressive result that shows a portfolio of varied skills, ranging from game design to music production, and which allows Happ to show off a not insignificant videogame culture, which could earn him a great signing from any software house listening . Let's say that if Nintendo entrusted him with the production of a new (and highly anticipated) project on Metroid it wouldn't be a bad choice, so maybe the next game will take less than five years. But while we await the decisions of the Big N, we have everything that Axiom Verge has to offer, which is a story that begins with few preambles, many secrets and many things to do. A world of pixels to discover The usual experiment gone wrong makes us wake up inside a sort of egg. We have no weapons, we have no idea where we are and a mysterious voice tells us that we must help her. We go a few steps and find our first weapon, a little further on there is a platform on which, for now, it is impossible to get, near a wall that we cannot break, however we can climb some platforms, eliminate our first enemies and see what happens on the next screen. For longtime players, these few seconds are enough to understand the basic structure of Axiom Verge: like any self-respecting Metroidvania, backtracking and exploration are the masters and will be the key to developing our alter ego to the fullest. Positioned at the top, a self-updating map shows off and shows us the general structure of the levels. Everything is organized in blocks, vertical or horizontal, of variable size and connected by pipes. Almost every screen contains secrets, shortcuts, power-ups that we won't always be able to unlock during our first visit and that will force us to retrace our steps every now and then to finally overcome that strange door that seemed sealed, but that our new weapon manages to break through. Here and there are scattered save points that completely restore life points and to which we will return once killed. Be careful though, a bit like in Dark Souls, each save brings back all the monsters you've killed. Fortunately in this case not all enemies are equally tough. The main engine of Axiom Verge is discovery, the taste for the new; what is hidden in the next room? Now what do I do with this weapon? How can I exploit this new power over the environment around me? Getting bored, stuck and not knowing what to do is never an option. There's always a level we haven't explored, a boss we haven't cleared, a new power that can give us access to the next section. Playing with it is like finding yourselfin front of the buried dinosaur fossil that gets bigger and bigger as we excavate. The story itself, although starting from very simple premises, rolls up more and more in a narrative plot, not always very clear, which provides an excellent excuse to go on Weapons, bosses and lots to do There are nine areas, each with its own characteristic graphic and musical style, only the first is a direct homage to Metroid, while the others range from Indian, hi-tech, dungeon, jungle and open spaces atmospheres. The reconstruction of the NES or Amiga style is such that Happ has even reproduced the graphical glitches of the time, which occasionally peep out and can become an element of gameplay. In addition to a simple drill, with which to destroy certain types of rocks, among the tools at our disposal there is one called Address Disruptor which allows us to transform the environment around us, fixing bugs and unlocking secret and inaccessible areas. Putting it in the game was a great find because from the moment you get it you will start to doubt the reality that is in front of you and you will test it on every surface, to discover any hidden effects. Each zone also has its own roster of monsters, each with a different attack pattern, ranging from giant wasps to zombies, passing through all sorts of humanoid or animal forms capable of hurting someone. Even these creatures can be ~modified~ by the Address Destruptor, which can make them weaker or turn them into useful tools for our purposes. For example, there are some species of slugs that climb along the walls and shoot particularly harmful laser beams, however, once transformed, not only do they no longer hurt us, but I can break through some walls with their shots and reveal secret areas. If we then consider that at a certain point we will be able to pass through some walls and use a small drone, capable of slipping into narrow spaces to pave the way for us and face puzzles, it is clear that in Axiom Verge every single room can reward us with a puzzle to solve or a mystery to unravel. There are also bosses, which incorporate all the classics of the genre, from the huge one full of R-Type style cannons to the smaller and faster ones. Killing them is almost always a matter of cunning, planning and reflexes, or, more simply, it takes the right weapon. Speaking of weapons, you are spoiled for choice. All the typical arsenal of the world of video games is reproduced with a fidelity and abundance that makes Metal Slug or Contra pale. It all starts with a very simple shotgun, but soon we'll be able to get our hands on rocket launchers, pulse rifles, laser charges, fireballs, ricochet shots and much more. Not all weapons are equally useful (once you discover homing missiles it's hard to let them go) but they can all come in handy in that situation you just don't know how to solve, you just need intuition and patience. The only flaw is that to navigate the arsenal you have to use the right stick, which we usually use to aim. The force of habit can therefore deceive us in the most excited moments and, instead of moving the rifle, we risk interrupting the action to find ourselves on the weapon change screen. Difficult but right As for the difficulty, let's say that Axiom Verge is not a game that wants to hold your hand and comfort you for your failures during the approximately 30 hours it takes to watch the finale, but it won't throw too many low blows either. If you are inattentive even the smallest monster can put you in crisis, get distracted and you will lose a useful upgrade, be overconfident and rest assured that you will not throw that boss down. However, this does not mean that it is a draconian game like Dark Souls or like certain sections of Ori and the Blind Forest, the challenge is calibrated to make you sweat, without making you curse, provided you have a minimum of skill. The funniest side is that this title is not only old-fashioned in terms of artistic vision, music and mechanics, but it will unconsciously push us to approach it as we did with the games of the past: talking about it with friends. Of course, if we wanted we could find a practical solution online, but the beauty of Axiom Verge also lies in talking about it, comparing the weapons and the discovered sections, exchanging some advice on the bosses and maybe even a hand-made map on the squared paper, complete with marginal notes. And if you are a speed run maniac, know that there is a game mode made especially for you, in which there are no cutscenes, every possible random element is standardized and there is a stopwatch that shows not only how long you are putting in, but it allows you to compare your performancecurrent nce with previous ones.", "date": "2015-05-13", "grade": "9.0"}