{"name": "Le radici dell'Inferno", "ref": "https://multiplayer.it/recensioni/149488-project-root-le-radici-dellinferno.html", "text": "Designed by the Argentine indie team OPQAM, Project Root was favored by a favorable process: from its birth on Kickstarter to its arrival on multiple platforms, PCs and consoles. The game remains the same, an old-fashioned top-down shooter, but with a fully polygonal look that allows for isometric shots. Compared to the choreographic shooters of the old Japanese school, there is a new open approach, obviously functional to the simple essence of the production, with even a hint of history, narrated through text dialogues that can be read in the middle of the action. Unfortunately, these dialogues also represent one of the major problems of Project Root, but let's go in order. Between past and future The story sees us driving a futuristic shuttle, in the role of a heroic pilot eager to show the skills acquired during military training. Constantly flanked by a partner, the protagonist engages in a bloody battle against a mysterious corporation, leader in energy distribution in major cities around the world. The futuristic setting is without particular artistic flashes, with a classic design that refers to the old Amiga and 16-bit productions. The modern aspect is obviously given by the fully polygonal engine, which invests a large part of the resources to make a pseudo-3D sensation and satisfy the needs of the gameplay, which also develops in depth. The shuttle is in fact able to shoot both in a straight line and towards the ground, in this case with the help of a fixed sight, in the style of Xevious, an old Namco classic capable of startling the less young. To tell the truth, however, the inspiration for Project Root seems to come from another title, namely Desert Strike: Return to the Gulf, from which it recovers freedom of movement on the map. It doesn't take much to understand that our shuttle behaves exactly like a helicopter and is a pivot on which the whole scenario rotates, a ploy very similar to old racing titles. Instead of facing hordes of enemies on an already established path, Project Root leaves us free to explore the map at will, following the objectives indicated by our assistant on the radar from time to time. These vary according to the level: in the first we limit ourselves to achieving strategic objectives to be destroyed, or eliminating power plants to break down a protective barrier, but already from the second the register expands, also contemplating the escort of a military car. In this case it becomes essential to maintain the safety of our protg, under penalty of instant Game Over. I'll break you in two Project Root is a challenging title, designed to put our reflexes and skills to the test, to do this OPQAM has pressed the accelerator at worrying speeds, making our shuttle, at least initially, inadequate to contain enemy attacks. The levels are particularly crowded, both in the sky and on the ground, with a large number of shuttles, crawlers and turrets capable of spitting a worrying volume of fire at us. The bullets are wasted on the screen, often confusing with ours, making it essentially impossible to avoid them in certain situations and weighing dangerously on our shields. The most notable problem is the position of the shuttle, forcibly moved towards the bottom of the screen to aid orientation, but too close to the edge to be able to effectively prevent projectiles arriving from behind. As if that weren't enough, the excessively classic setting forces you to restart the stage once the three lives available (but they can be increased), a more suitable choice for a concise and frenetic title, less so in an open that can take away from thirty to forty minutes per level. After the initial bewilderment for such a punitive approach, one begins to understand how the keystone is to exploit the rotation of the shot to one's advantage, in addition to the rigorous cleaning of everything that appears on the screen - ignoring the enemies leads to near certain death - and diligently collecting the power ups dropped by enemy hulks. These are able to give us special shots but above all the restoration of energy, advantages thanks to which it is possible to conquer a certain margin of recovery in an extremely unstable and frustrating system. In general, the purpose described at the beginning of the paragraph fails, Project Root fails to stimulate the player to improve his skills, since it only ends up affecting his patience. Project Root enriches the spirit of the classic shooter with hints of the open world Xbox One goals Project Root pfeatures 21 objectives for a total of 1000 player points, the first to be part of your precious collection will be ~Baby~, which requires the simple completion of the tutorial at the beginning of the game, you just can't miss it. The rest present a considerable challenge, such as completing the various stages without losing a life (good luck) or with the higher difficulty levels. Path uphill The above problems certainly don't find an ally in the technical aspect, which unfortunately denounces the indie origins of the project. The graphics engine is clean thanks to the 1080p resolution and the use of sixty frames per second, but the frame rate is subject to heavy slowdowns during the most crowded stages and large explosions. The sound accompaniment is really bad, limited to a few uninspiring and uninspired songs. The title also suffers from various graphic glitches, such as shuttles getting stuck in the scenario, an eventuality that also affects our pilot and which almost always translates into dramatic situations that will lead to the outcome that you should have understood by now during this review : restart the level from the beginning. Another problem, as already mentioned before, is represented by the reduced size of the texts for the dialogues, relegated to the lower right corner of the screen, they are almost as illegible as they are important for understanding the objectives assigned by our assistant, risking fatally exposing ourselves - in the desperate attempt to read them - to enemy fire. Perseverance, as often happens, helps, once the end-of-level boss has been defeated, which is always quite spectacular, you have the possibility to upgrade the ship, thanks to the experience points gained. The levels can be repeated several times, with three different degrees of difficulty, in order to accumulate points and further improve resources. Completely absent online modes.", "date": "2015-05-08", "grade": "5.0"}