{"name": "Mighty Goose", "ref": "https://multiplayer.it/recensioni/mighty-goose-recensione.html", "text": "The life of a bounty hunter is not for the faint of heart, and it doesn't get any better when you're a space goose. This short dose of madness already gives a good idea: you are reading our review of Mighty Goose, a very particular (and, more importantly, very funny) indie soon available on PC and on Nintendo Switch. We got to try the second of the two versions, something that allowed us to take around the title developed by Blastmode and MP2 Games, which kept us company between the day's commitments. The result? We couldn't wait to have a handful of free minutes to dedicate to him: you'll soon understand why. Plot The plot of Mighty Goose is really minimal and an end in itself: after the first few levels, one even forgets how the story began and where it is headed. A bit like what also happened in Untitled Goose Game, in short. The protagonist goose is a bounty hunter who travels from one planet to another in the space system, trying to make ends meet. It goes without saying that from time to time honest workers come into contact with real criminals: this is the case of King Void, lord of the galaxy intent on dominating it with his army of robots, disgusting monsters and the like. But mostly robots. Mighty Goose and all his enemies on screen It is clear that Mighty Goose cannot allow it: and here after having saved a pig collaborator, right in the first level of the game, he begins his journey in search of resources and weapons with which to play them on the bad guy. The duration of the main narrative is not excellent, but it still keeps you busy for about eight hours. But it does so by alternating particularly successful and well-maintained levels with others that are a little more subdued, but still fun. However, in general longevity must take into account two other factors. The first is the difficulty: there is no specific indicator, but it will be a challenge to complete the more advanced levels with all gadgets, secondary characters and goose abilities deactivated. Mighty Goose: A good variety in levels The second: each world offers a final vote, which takes into account the time taken, the longest combos and the number of overall deaths. Getting the maximum score guarantees a certain satisfaction, given that it is not at all obvious to take it home simply by avoiding dying: instead you have to show off a certain skill, considering all the evaluation criteria present at the same time. Gameplay Mighty Goose is a run & gun shooter that clearly winks at the old cabinets: if you don't master the terminology, know that it is a title whose character runs at high speed in two-dimensional stages, firing on everything in his path along the path (and usually encounters many, many enemies at the same time). At the end of each level there is a boss who almost completely occupies the screen, a detail on which the developers have also insisted a lot, for some reason. Mighty Goose: Some enemies are gigantic Perhaps because many of these clashes are actually well-finished and interesting, also due to the strategy to be adopted to survive (which is never the same, you have to learn the pattern of the enemies). In the game philosophy and gameplay mechanics, Mighty Goose closely (very closely) mentions the Metal Slug franchise, so much so that numerous weapons, vehicles and some bosses seem to have been taken by weight from Metal Slug X and Metal Slug 4. And not it is only the tank that can be controlled by the protagonist goose, but also numerous enemy vehicles, weapons practically identical to those you will remember in the classic coin-ops, such as ~rocket launcher!~, ~heavy machine gun!~ and ~shotguns!~. You read them in the voice of the SNK franchise, admit it. Weapons and upgrades Mighty Goose and Metal Slug weapons Of course, apart from these references, however very successful, Mighty Goose has its own. For example, in the changes that can be made from the arsenal, freely available after completing the first level and then enriched with new elements with each new boss defeated. Here it will be possible to activate useful chips that make it easier to destroy all life forms (including robotic ones) in your path: the Pallamorph, for example, allows you to bounce on enemies by performing the goose roll. Perhaps even more useful are the secondary weapons which, unlike the (passive) chips, must be activated manually, with use linked to a variable cooldown. The Mighty Booster is very versatile, which allows you to immediately transform the Mighty Goose into a Super Saiyan goose: the Mighty mode makes it practicallyinvulnerable and much more deadly in any form of attack. However, the Mighty mode is not linked exclusively to the use of these bonuses, but represents a basic element of the gameplay: once you have eliminated a certain number of enemies on the screen, you can activate it with a simple key combination. It goes without saying that it only lasts a few seconds. Mighty Goose and devastating on-screen explosions, why yes Finally, you can also select a companion to take with you on missions. The title initially assigns a simple duck (literally called Regular Duck), completely useless in battle but no less nice to watch as it moves among the corpses of enemies. Much more strategic, however, the presence of Commander Vark (the pig mentioned above): once the ammunition for the machine gun is finished, he launches an additional supply on the screen. Given the number of enemies, they will never be too many.", "date": "2021-06-04", "grade": "8.0"}