{"name": "Battalion Wars", "ref": "https://multiplayer.it/recensioni/battalion-wars_a.html", "text": "What else is there? Erasing from the mind any point of contact with the aforementioned masterpieces for GBA and DS, one can therefore approach Battalion Wars with a certain curiosity, dictated by the desire to find out what the result of all these months of programming is and to find out if Nintendo has also in this case the decision to entrust an important project to an external team was right. The first impact is actually not particularly encouraging: the paucity of game modes available, which are practically limited to the main campaign alone, in fact seems to suggest a poverty which is then also confirmed by the menus and the first sequences in computer graphics, rather crude and unattractive. Once you have passed a few screens it is therefore time to face the real game, and fortunately on this occasion things improve; mind you, Battalion Wars is by no means an aesthetically surprising game, and indeed the graphics engine denounces the very long development period on more than a few occasions. The visual depth, for example, is not that great, and the frame rate often proves to be a dancer, while always remaining acceptable. But all in all, the overall result is pleasing to the eye, and the use of a comic and colorful style contributes enormously to making the experience much more pleasant than it would have done with a realistic setting. The sound, however, is not much, with very little incisive effects and music. The actual game, as we have already said, is based on a third person action game structure; in fact, control falls mainly on a soldier, with whom it is possible to move freely within the three-dimensional settings, jump, shoot and dodge enemy shots with a side dive. But aware of the paucity of this game scheme, the programmers have well thought of introducing some basic strategic-management elements, allowing you to have a small battalion made up of men with different armaments and characteristics under your orders. In fact, while continuing to directly manage a single character, the control system allows you to organize the troops alongside you by giving some orders, such as attacking an objective, following your alter ego or stopping and waiting for new commands on the spot. Far from offering a simple increase in firepower, this element of the gameplay on the contrary proves to be a fundamental aspect in the approach to the game, thus partially untying Battalion Wars from the concept of ~one man against all~ that characterizes most of the games of the 'action. In the effort of Kuju instead, the armament of the various troops (or means) plays a strategic role of great importance, since it represents both an advantage towards a certain type of enemy, and a disadvantage towards others equipped with different weapons. The basic concept is always that of rock/paper/scissors, so to speak, of proven effectiveness. Action Man The management of your teams of soldiers takes place mostly through the c-stick, in reality a bit cumbersome and not always immediate, with deleterious effects especially in the most excited moments of the game. In reality, a little practice is enough to get the better of this small problem, which in any case would have deserved greater attention given its importance in the game's economy. The missions, about twenty in all for a total of about 10 hours of play, are basically all based on simple objectives, such as capturing enemy command posts, eliminating certain objectives or defending your own, or even repelling the attacks of opposing armies. In addition to simple infantry units, the game also offers bombers, helicopters, tanks and jeeps; unfortunately the control of land vehicles, especially jeeps, is subject to very approximate physics, which often makes driving difficult and unrealistic. But the real weak point of Nintendo's production is undoubtedly to be found in the incomplete artificial intelligence of the CPU-controlled units, a particularly irritating factor in relation to companions and troops under one's command; the sensation is that of having automatons at one's command rather than soldiers endowed with a minimum of intellect. The worst comes during the most demanding firefights, and it is depressing to see entire platoons blindly heading towards the enemies without any flash of strategy. In this sense, the presence of fellow soldiers in some situations represents more of a burden and a concern than a real support. Finally, the targeting system is far from perfect, often locking on to your allies instead of enemies, or simply godo to lock the wrong target making the action excessively cumbersome and frustrating. Comment Battalion Wars is a product based on solid foundations and on an intriguing underlying mechanic, but which sees its value reduced by a series of imperfections that are truly impossible to overlook. The discreet graphic appeal, the good number of missions, the appreciable variety of objectives and the interesting micro-management aspects alongside the main action component must in fact deal with problems in the control system, in the pointing one and, above all, in the incomplete artificial intelligence of troops commanded by the CPU. All in all, Kuju's effort remains a title above the sufficiency, but qualitatively very far from the best games available for Gamecube. Pros Intriguing game structure Decent graphics Good number of missions Cons Not enough artificial intelligence Revisable control system No extras other than the main campaign Finally. It's been so long since the release of this Battalion Wars, and so many changes have been made in development, that we were honestly starting to think the worst. Yes, because the genesis of this Gamecube exclusive is rather remote, and must initially be sought in the Avance Wars series, so much so that the name by which it has been known for a long time has been Advance Wars: Under Fire. Although in reality, with the successful and excellent Intelligent Systems production, it has always had very little or nothing to do. In fact, apart from the ~theme~ of the war conflict represented in comic style, we are faced with a totally different game genre also developed by an equally different team. Nintendo has in fact entrusted this project to Kuju Entertainment, an English group with a rather stingy curriculum of high quality games. And far from being a turn-based strategy, Battalion Wars has instead chosen the path of the action game in the third person, thus moving away unequivocally from its alleged inspirer.", "date": "2006-01-25", "grade": null}