{"name": "Una strana Odissea", "ref": "https://multiplayer.it/recensioni/148899-battle-odyssey-una-strana-odissea.html", "text": "The hybrid between puzzle game and role-playing game has now lost the disruptive innovative charge it could have had at the time of Puzzle Quest, becoming to all intents and purposes a defined genre with specific characteristics. A somewhat successful genre, given that some of its variations have come out of the niche in which a strange mix like this seemed destined to remain in order to reach unpredictable peaks of success, as demonstrated by the Puzzle & Dragons phenomenon, which after conquering Asia it has established itself with good results also in the West, to the point of involving Nintendo itself with a specially customized version for the world of Mario. With the stabilization of the experimental formula in a defined canon, as often happens, Gameloft arrives to propose its interpretation, according to the typical modus operandi of the French label. So here is Battle Odyssey, which stages the story of a quiet fisherman who finds himself, through a marine vortex, projected into a strange exotic dimension in which he is forced to constantly fight to find his way home. The characters of the game, enemies and allies, are creatures related to the elements of earth, water, air, sun and moon, each with strengths or weaknesses depending on the contrast with the other elements, which represents an element of strategic insight to be taken into account during battles. These take place through the classic ~match three~ style puzzle, with the need to join together and make gems of the same type disappear, also relating to the various elementary powers of the characters. Each successful association translates into a blow inflicted on the enemies, which will be more powerful if the contrast between the different elements is exploited in the best way. This is the basis, tested and well-functioning, of the whole particular structure of Battle Odyssey, which for the rest tends to get lost a bit in streams of rules and even excessive complications but which still manages to maintain a good pace. Videogame eclecticism and sunny settings in Battle Odyssey, an experience to try Between Columns, Pokmon and Dungeon Masters Once you have chosen your allies for the party, obviously with their own specific characterizing elements, the story leads us to wander from one place to another in the world of Odera, an area characterized by islands, sea and more inland areas all particularly sunny and exotic, with scenarios and characters represented in a pleasant, if rather cheesy, pseudo-Japanese style. During the fight in the upper part of the screen it is possible to see a subjective shot of the setting, in a similar way to the classic RPGs such as Dungeon Master or Etrian Odyssey, but in this case the movement is preset, while the lower part is occupied by the gems , which must be touched and associated with groups of the same type or with various combinations, with attack power which obviously increases proportionally to the size of the combo performed. Once touched, the gems disappear and leave room for others, thus changing the structure of the puzzle and allowing for any new combinations. It is a well-known and functional system, which also gives an excellent feeling when you manage to ring chains of gems and launch powerful attacks. The other particularly in-depth area in the game is the management of the characters in the party, which can be continuously improved through the use of the cores of other characters conquered in battle or by carrying out real evolutions in different and more powerful forms, always if they have the materials and sufficient money to carry out the complex operation. This is an element of collecting characters and their evolution that particularly appeals to players and on which Battle Odyssey insists a lot, in fact providing many ideas to explore between one battle and another. Within all this, the reference to social elements is also linked, with the game that insistently requests to involve other users in battles and stimulates contact between players with additional prizes if the social aspects set are exploited, through Facebook and the like. The constant connection to the online database on which this Gameloft title relies can make loading rather long and cumbersome, especially in the opening phase, which clashes somewhat with the mobile nature of the game which is supposed to make access as fast as possible. As free-to-play, Battle Odyssey is not particularly intrusive in its requests for in-app purchases, with packages of rubies and money that become necessary only if you want to speed up the times with the evolution of the pcharacters, a process that can otherwise be performed through normal game progress.", "date": "2015-04-25", "grade": "7.8"}