{"name": "A caccia di pixel", "ref": "https://multiplayer.it/recensioni/148821-elliot-quest-a-caccia-di-pixel.html", "text": "No wonder Nintendo's recent open-mindedness and technology is convincing more and more indie developers to jump on the bandwagon. Wii U's support for the HTML5 standard guarantees a certain catalog completeness and ease of porting and Elliot Quest is a good representative of this. It is in distant Mexico that Ansimuz Games has prepared and at the end of 2014 released on Steam a sparkling bitmap adventure winking at the 2D platformers of the early 90s: built with the help of the Impact Engine, the JavaScript architecture goes very well with the 8 -bit adopted and the result was already very pleasant at the time. We take the liberty once again to showcase a team's choice to release their product on PC, Wii U and Ouya; in fact, we went to browse the kickstarter page of the work and there are no updates for any ports on other platforms, confirmation of how even in the indie magnum sea, which has always been synonymous with immoderate multiplatform, something is changing. Elliot Quest is an apparently simple product which, despite the clearly visible pixels, manages to communicate a certain desire of the team to push towards adventure and discovery, inspired without shyness by the system of Nintendo memory inherited from The Legend of Zelda II : The Adventure of Link. What journey awaits us? An 8-bit adventure with dungeons and bosses: Elliot Quest would be a real gem if it could only be explained better! Cursed This is the story of a young man who, after losing track of his wife and attempting suicide, discovers he is immortal, struck by a demonic curse that is transforming him into an evil entity. A simple but effective synopsis to make sense of our wild wandering in search of a Guardian who will have to free us from a weight that in playful terms translates into the most banal of assumptions: you die and return to the last checkpoint with a little less experience. Elliot Quest's approach draws from an old-fashioned platforming mentality of jumping, defeating enemies and using incremental equipment to break down obstacles and overcome environmental puzzles. In Elliott Quest, the sense of progression is everything: unlike the sacred monsters that inspire it, the Ansimuz product does not give indications on progress, guaranteeing pleasant sensations of experimentation and discovery with an undeniable sense of frustration that sometimes takes over. The absence of the most basic of indicators increases the sense of bewilderment and if this can certainly be considered a good thing for some, we do not deny that there have been various occasions in which the progress in a dungeon has been abruptly interrupted by an unsurpassable enigma in that state, frustrating and forcing us to mark everything in the hope that in the future we will want to go back and complete it. Elliott Quest makes backtracking its foundation but the level of style and quality of the most famous classics immediately show all the distance from the Mexican product: the level design forces you to go through the same areas over and over again, even completely free, perhaps only in the hope that the new object taken really serves to pass a point. GamePads The extra edge of the Wii U version compared to the PC version of Elliot Quest is certainly the good support for the GamePad: map, inventory, progression, choice of weapon and magic to use guarantee greater speed in carrying out the most frequent actions. We also tested using the Pro Controller and the GamePad wins hands down. Link's Quest? The goodness of Elliott Quest's playful offer is clearly subjective and depends a lot on how patient you are in trying, trying again and hoping to be lucky in immediately catching the correct places where you can enrich yourself with the inventory necessary to advance. If we had to weigh the experience, we are not afraid to say how the odyssey in the world of Urele fully repays the price spent on the downloads: five major dungeons, sixteen bosses and more to do and discover to complete in the best possible way. If you then add the time spent returning to the places visited and performing optional deeds, the counter rises considerably. The RPG components certainly help: each level will give away a point to spend to grow in one of the five values that will influence the attack strategy, although don't expect great depth in the patterns. Since after all it is still about ports, it is time to start talking about technicalities starting from the fundamental one: to increase its charm, the team has chosen to modify some sections, thus differentiating them from the PC version. A nice attempt to dye the Japanese son with uniqueness, if nothowever, a greater optimization effort would have been just as welcome: in some situations, the game engine loses frames even in substantial quantities, which clashes with the actual polygonal load on the screen. On the other hand, the acoustic work presented is good: the choice of instrumentation and effects skilfully follows that feeling of times gone by, also thanks to inspired tracks that go well with the fairytale world presented. A beautiful amalgam, enriched by a difficulty factor that keeps the attention bar high, although the bosses in the strict sense are nothing striking.", "date": "2015-04-24", "grade": "7.5"}