{"name": "Eroi in crisi", "ref": "https://multiplayer.it/recensioni/148865-infinite-crisis-eroi-in-crisi.html", "text": "The age-old question of alternative realities is addressed cyclically in the DC house, with mega crossovers in which usually quite a few superheroes die, sacrificing themselves to save the universe with a view to a cosmic level clash. The first time it happened in 1985, with the famous ~Crisis on Infinite Earths~ miniseries, when Marv Wolfman and George Perez thought it best to solve the ~continuity~ problems that afflicted many characters by drawing a nice line and starting from scratch. In the course of the saga, therefore, quite a few prominent figures have disappeared even if, as we know, in comics the concept of ~death~ is always relative. The same narrative device was subsequently re-proposed and Infinite Crisis, the new free-to-play MOBA developed by Turbine, does nothing but draw on that same source, proposing a roster that sees side by side heroes and villains belonging to alternative and different realities , who fight against the backdrop of an anomaly that threatens to destroy their worlds. Infinite Crisis is a traditional MOBA, but with an interesting cast for superhero fans So close, so far There is no doubt that the idea of using the many variations of the most famous DC characters is a winning one, especially from the point of view of fans. One of the champions we will deal with during the introductory phase, Gaslight Batman, for example comes from a sort of ~Victorian~ world, still in the midst of the industrial revolution, and is equipped with electronic devices that allow him to target enemies from distance. In addition to the standard sonic pistol, the hero can unlock skills that allow him to throw batarangs, explosive shots, energy emissions or to pull the grappling hook and perform a volley kick to destabilize the opponent. The concept of class is therefore well rooted in Infinite Crisis, but its contours are perhaps more nuanced than the traditional interpretation of MOBAs. In fact, we also have the classic Batman, who in the game belongs to the brawler class and prefers hand-to-hand fights, exposing himself more on the field but playing a fundamental role in the agitated and ~breakthrough~ phases. As usual, team balance is a key factor in winning, especially when the opposing team is close-knit, and solo actions generally don't produce great results. However, it is important not only to familiarize yourself with the characteristics and repertoire of the selected champion, but also to obtain those extra perks that can make the difference in a direct clash, such as strength amplification, invincibility, extra cue and so on . These bonuses, unfortunately, represent in many ways the realization of the notorious concept of ~pay to win~, in which precisely the users who put their hands on their wallets find themselves in an advantageous position compared to the others. Something old, something new After a few preliminary missions, also aimed at unlocking the starting characters (to obtain others it is necessary to ~grind~ and obtain virtual credits, or purchase one of the many packages available to proceed more quickly), Infinite Crisis allows access to a range of modes with relatively traditional connotations. In fact, it is possible to select a quick game or customize the search (albeit extricating yourself from an interface that is not exactly very clear), becoming part of a team of players who measure themselves against artificial intelligence or who face another human team in a frantic five-on-five. As in any MOBA, to win the match it is necessary to destroy the enemy positions up to their base, an operation that is not very simple because it requires the presence of the usual minions to act as a ~shield~ against the automatic defenses of the towers. The possibility of teleporting back to the starting point allows you to take a prudent approach and with a minimum of strategy, sinking your shots and then starting over to recover energy and take care of the inevitable equipment, to be purchased with credits that increase with the passing time and eliminating enemies, be they champions or minions. This part of the experience can be assigned to the settings recommended by the system, which certainly makes the character growth phase more agile, but in more complex games this convenience comes at a high price. It therefore becomes necessary to stop for a moment to reflect on the units that make up the opposing team and identify the upgrades that best match our tactics, in order to avoid arriving at a clash with a powerful but frail hero, who falls under the blows of the enemy in a few seconds.Where have I seen this place before? The gameplay of Infinite Crisis and its ~classic~ structure are placed within a set of maps that recall the imagery of the DC universe; starting with Crime Valley, a scenario designed for one-on-one that reproduces the place where Bruce Wayne's parents were killed. The other locations are instead larger, designed for five-on-five, with various control points and alternative routes that allow you to send small groups to annoy the opposing team, or perhaps to take advantage of the momentary lack of defenses to destroy some outpost . There is no shortage of hostile creatures controlled by artificial intelligence, which we can exploit for the leveling of our champion before confronting other players, as well as interactive elements such as vehicles, which by exploiting the super strength perk we will be able to lift and throw against groups of minions. The design of the settings is generally good and functional to the action, even if in some situations it shows the side of an ~old-gen~ polygonal construction. The characters are much better, well drawn and animated, whose traits are enriched by a not too marked and quite pleasant cel shading. However, the lion's share goes to the music, which is absolutely extraordinary: orchestral themes of cinematic quality, able to underline the epic nature of the clashes and dramatically increase the atmosphere and involvement.", "date": "2015-04-24", "grade": "7.0"}