{"name": "Red Matter 2: la recensione di un nuovo prodigio tecnico per Meta Quest 2", "ref": "https://multiplayer.it/recensioni/red-matter-2-recensione.html", "text": "When the developer Vertical Robot announced Red Matter 2 and with it all the technical improvements that the sequel would boast compared to its predecessor - we have to admit it with a little shame - we felt tenderness. The game has been available since August 18 on the Meta Quest 2, Rift and Steam platforms, but it was precisely the version for the Meta home viewer that left us perplexed. How is it possible that in a market like that of virtual reality, dominated by products of technical excellence like Half-Life: Alyx, it was possible to make a title for Meta Quest 2 that could implement a dynamic lighting system, ray tracing and all that that Vertical Robot had shown? Yet, against all expectations, the Madrid-based developer kept his promises, creating what is currently the most technically stunning experience for Meta Quest 2. Let it be clear, we are not facing a perfect game, and we will tell you about why in the course of the Red Matter 2 review for Meta Quest 2, but it is undoubtedly the new quality standard to be achieved on this platform. History and command interface One of the Soviet space stations from Red Matter 2 For those unfamiliar with the series, Red Matter is a sci-fi narrative adventure based on environmental puzzles, which tells the story of an astronaut intent on investigating mysterious events that have occurred on a Russian space base. Here the protagonist discovers the existence of an alien substance, called red matter, and all the secrets related to it. The first chapter closed with an unexpected and very well-aimed twist, which did not allow for the possibility of a sequel to be guessed at. The skill of Vertical Robot, on a narrative level, was to find a way to connect the events directly to the first Red Matter. The second episode begins, in fact, immediately after the end of the first: our protagonist, now aware of many more facts than in the past, is now looking for his old companion. The journey will take him to different space stations, where he will learn even more secrets about the red matter. Red Matter 2 is configured as a perfect more of the same, a term that we use here with a positive meaning. The game, in fact, offers everything that was already present in the first chapter, going to improve it as well as enrich it with new elements. The command interface has remained almost unchanged, with the protagonist who can take advantage of his faithful space suit. This is equipped with two multi-object tools positioned near the hands: they are nothing more than the two Meta Quest 2 controllers, however camouflaged perfectly within the game. This trick provides the player with a command interface that is always clear, legible and immediate, which makes immersion in the adventure even more likely. The suit comes with two tools identical to the Meta Quest 2 controllers On the left controller are equipped a four-finger hook, to simulate the grip of the hand (the protagonist will never touch foreign objects directly), a torch with a rocket launcher system, to shoot bright flares, and the scanner, useful for translating texts in Cyrillic scattered throughout the space stations. Also on the left hand is a removable plug, to be used with computers and electronic dashboards to hack computer systems. This procedure is often followed by a minigame consisting of a hologram of a three-dimensional space and one or more spheres. The goal is to place these globes in the correct position, identifiable thanks to a sonar: the closer you are to the exact point where to place the sphere in space, the more frequent the intermittent sound emitted by the sphere will be. This is perhaps the only puzzle whose operation is explained to the player, but we admit that the description provided the first time in the tutorial phase was not so clear. On the right hand, however, we always find a four-finger hook and, a novelty introduced by Red Matter 2, a laser gun. The presence of the gun allows you to have, from about halfway through the game onwards, some decidedly more action phases, which balance the pace of the entire adventure. The weapon overheats easily and the player will have to manually cool the gun by pressing one of the controller's backbones. This suggests to the player that he is not dealing with a real weapon: of course, it can and must be used for offensive purposes, but not only. The gun turns out to be very useful, if not essential, during the resolution of some puzzles, a suggestion that is given to the player in the early stages of use and which then becomes essential during the adventure. Let's admit that we got stuck in some sections of the game precisely because we forgot we were inendowment a useful tool not only in combat. So, if you want to play Red Matter 2, remember that the gun is your friend and it's not just for shooting down enemies! Gameplay and graphics Red Matter 2's puzzles are challenging but never frustrating These tools are all that the player has to move around the Soviet space stations, solving the numerous puzzles scattered throughout the adventure. The puzzles are, in our opinion, more complete and stimulating than those seen in the first Red Matter, but without reaching the brainy levels of other puzzle games in the Meta Quest store such as Shadow Point or The Room VR, some of the steps a must, if you are a fan of the genre. The puzzles of Red Matter 2 are captivating, but never frustrating and we especially appreciated the fact that they are better placed in the narrative context: mechanisms, doors, switches, all are linked to the context, pursuing a realism that drops the player into a problem mode solving rather than asking him to solve abstract puzzles. As mentioned at the beginning, however, what really upsets is the technical detail achieved by Red Matter 2. On this point we asked ourselves two questions: the first is how the Vertical Robot team managed to achieve such an incredible result. The developer, in a technical showcase published at the end of July, declared that he was using a heavily modified version of the Unreal Engine... given the result achieved, it sounds more like a witchcraft to us than a technical achievement! It follows that the second question is: how is it possible that a result of this type has been achieved by a small Spanish team and not by other much more famous developers with more resources? And there can be many examples, above all Crytek comes to mind, which dominated the market for years with that masterpiece called Crysis and which then, once it followed the path of virtual reality, was unable to match the results of the past. The quality of the details in Red Matter 2 is very high The fact is that the technical result of Red Matter 2 is as sci-fi as the story it tells: during our adventure there have been numerous moments of amazement and, although the alien and sidereal panoramas of space are incredibly fascinating, Red Matter 2 gives the best of itself in closed spaces, where it is possible to admire the work done on the lighting system. Volumetrics of light beams, refraction of light sources, soft and realistic shadows, hyper-realistic reflections on glass and glossy surfaces. The atmosphere has always been a cornerstone in the Red Matter gaming experience, but with the second chapter, one gets the impression of being immersed in a bigger and deeper world. The first chapter, while decent, appeared decidedly flatter in comparison. However, this great realism turns out to be a double-edged sword that the developer has perhaps slightly underestimated. Leaving aside some minimal deburring on the technical front, with the metal surfaces having a slightly more pumped-up ray-tracing than necessary, on more than one occasion we have struggled to understand the resolution of puzzles or even the direction to take because some elements were not sufficiently posters. Often, to understand if a platform was really viable or just a decorative element outside the limits of the level, or if an object was really useful in order to solve a puzzle, we lent ourselves to numerous trials and errors, trying and trying again because not always it was clear what to do, where to go, what to use. The developer has conducted research both from an artistic and design point of view aimed at uniformity and hyper realism: the choice made by Vertical Robot is not right or wrong in an absolute sense, but it can certainly displace the VR player, accustomed to a certain type of language. To give a practical example: it took us a long time to recover a fuse in a room, which had to be removed from a radio. We arrived at the fact that the radio was powered by an electrical system immediately, but the object was so well reproduced that it seemed only a decorative element; same thing happened to us in another scenario with books. It is often difficult to distinguish which objects are needed to solve a puzzle and which are merely decorative and the difference is not made clear to the player. movement system Walking on the surface of a distant planet in Red Matter 2 is truly beautiful If that of hyper-realism cannot be considered as an objective error, but rather falls within the field of authorial choices, a big mistake in reality Vertical Robothe did it, and it's on the move system. In Red Matter 2 the player has several options to customize his movement experience, but basically the choice falls on two distinct modes: free movement and teleportation. With free movement, you can move in real time, navigating environments with the left analog stick. Platforms above or below the protagonist's level can be reached using the spacesuit's jet-pack. If you don't suffer from motion sickness and vertigo this is definitely the best way to play Red Matter 2 and we can guarantee you that the rare walks in the open spaces are definitely worth the ride. If, on the other hand, free movement causes you problems with nausea and various discomforts, teleportation is the right movement system for you. With the right analog stick you can choose the point where to move and releasing the button the action will be activated. The indicator will turn blue if the selected surface can be walked on or red if it is inaccessible. In support of the teleportation there is also the so-called snap, which is the rotation on the spot in jerks that always avoids moving freely. The sore points for us are essentially two, the first linked more to movement and the second which borders on game design. Some stages require the player to crouch in tunnels, such as ventilation ducts or crawl spaces. In these sections the teleporter is not usable and if you suffer from motion sickness there is nothing worse than moving with the camera lowered, as if you were on all fours, in a narrow and cramped space. If you use the teleporter, these lasers will never be a threat Secondly, teleportation in Red Matter 2 is not balanced by any other design elements, making the player invulnerable to certain threats; a practical example is that of laser turrets. In different phases, the player will have to avoid being detected by defensive turrets, dodging the projection of the lasers; coming within sight range of turrets will clearly cause them to fire. If you're using the free movement system, you'll have to time yourself, sneak around, and duck to avoid detection. Teleportation breaks up these sections, allowing the player to teleport to a blind spot out of sight of the turrets, leaping from point A to point B even crossing the laser field undetected. Some VR games have overcome this problem by devising different solutions: in Lies Beneath the path of the protagonist in the teleportation phase is simulated, resulting in him being vulnerable on the way; in Cosmodread instead the range of the teleportation is gradually reduced jump after jump, as if to simulate the resistance of the character. In Red Matter 2 the invulnerability of teleportation is not mitigated by any element, suggesting that the developer has conceived the entire game experience to be approached with free movement, while providing little attention to the teleportation system. Positive note: this is less reflected in the fights, where being able to move freely helps a lot but, if you can't afford it, you can always find a strategic point where to position yourself and face the firefights as in a fight on tracks with a shelter system .", "date": "2022-08-21", "grade": "8.5"}