{"name": "L'esercito in una stanza", "ref": "https://multiplayer.it/recensioni/148663-war-for-the-overworld-lesercito-in-una-stanza.html", "text": "When the second chapter of Dungeon Keeper came out it was 1999 and many years have passed since then. Probably some of you were born even after that date, in others this period of time has aggravated the weight on your shoulders and dilated your belly. Be that as it may, Dungeon Keeper 3 has arrived... or rather what at the time should have been the third chapter of the saga has arrived. War for the Overworld is a spiritual sequel that we have already had the opportunity to talk about in recent months and which we return to now, a few days after its release from Early Access. War for the Overworld is the answer, at least in part, to all those nostalgic for Dungeon Keeper Lights and shadows A few things have changed since our first test to date, although there is a feeling that the game is not quite complete yet. Most likely if you choose the purchase you will jump into the single player mode, which has earned the War Table complete with a selection of the various campaigns, as in the titles that inspire it: just touch the desired area to see it levitate and enter the game . This game is perfect for all those who need an introduction to the world of RTS, with a God Game edge, given the wide possibility of managing your dungeons without too many stakes or limitations and leaving it up to you to exploit properly resources. Digging, every time you come across walls dotted with ~varicellous~ yellow dots, means fattening the coffers of the gold necessary to form the greatest army of evil. In fact, our actions affect the number of influence points, thanks to which we will be able to spend part of the accumulated experience to unlock new rooms, traps and all the tools useful for enhancing the dungeon's offense or defense mechanics. The tree branching of the various perks is as simple on paper as it is complex to manage. In fact, War for the Overworld, like its spiritual predecessors, wants to force you not to waste too much time increasing your army and resources, asking you to manage only what is essential to prepare. Once the first ~thematic rooms~ will be positioned, the first servants will arrive, we will have to take care of them with room and board, train and implement the refinement of their skills as much as possible, in order to prevent them from dying too soon in combat. Barring a few flaws, you could spend countless hours on the same levels just to find out ~what if~. Just for the sake of experimenting. Not much has changed in the other game modes: multiplayer is now also present, which allows you to connect to other games or to host them, which however is not very frequent due to the few players and a still not perfect net-code. If, on the other hand, you want to know something more about Survival mode, you will have to wait until the end of the year, when this part will also be unlocked. Once you have the instinct to say ~wow!~ and ~wonderful!~, just by listening to the voice of Richard Ridings, your mind will begin to cleave the ~fog of war~ that cloaks memories, to start showing the limits of a product which, unfortunately, is not yet what we wanted and, in part, it may never be. Perhaps it will be a nuance, with a hint of melancholy, but part of that ignorant irony that was so beautiful to see and hear is missing. If the introductions to the levels have in fact maintained the original spirit, the rebellious madness of our army of repugnant beings has been partly lost, just as the general atmosphere fails to tickle the perverse, very soft and over the top fantasy that Molyneux had brought to our screens. From a technical point of view, a valid job has been done, both for the textures and for the particle effects; it will be enough for you to zoom in close to realize the quality achieved, above all by virtue of very scalable hardware requests. There are serious flaws, however, which at the moment the development team is solving with almost daily patch shots, linked to an artificial intelligence in many situations that is approximate, to put it mildly. In some cases, in fact, it happened that both enemies and allies were frozen; other times they moved around not knowing how to behave or doing random things around the level. As we said, some problems have already been fixed, but for those who want a more refined product, the advice is to wait a moment or prepare to compromise.", "date": "2015-04-21", "grade": "7.5"}