{"name": "Un roguelike in prima persona", "ref": "https://multiplayer.it/recensioni/148609-tower-of-guns-un-roguelike-in-prima-persona.html", "text": "Princes, gunslingers, wizards in great stories there is always a tower. It is the symbol of the challenge to God and to man, of the ascent, of elevation, of a series of dangers that must be faced to reach the summit where the well-deserved prize awaits us. Now imagine a changing, unpredictable tower that is never the same as you last remembered it. Even the bravest of riders would have a hard time getting to the top, don't you think? Tower of Guns is a very interesting title that combines the most commercial of genres with the most indie; is in fact a FPS roguelike in which you have to climb to the top of a tower which, as you may have guessed from the title, is not filled with cream puffs, kittens or fiery lovers, but with weapons, many weapons, many weapons. And as the tradition of roguelike titles dictates, with each death you have to start over from the beginning, venturing into a completely different and randomly generated setting, after losing all the accumulated experience and power-ups. No narrative plot, no cutscenes, no character development, just turrets and pissed-off armed robots standing between you and the summit. It is therefore no coincidence that Joe Mirabello, developer of Tower of Guns, defines it as a ~lunch break game~. Its elusive structure and the simplicity of the mechanics make it a perfect hit and run solution for those who don't like to waste too much time chatting and just want to shoot everything that moves. Tower of Guns: A fast and fun FPS where no match is ever the same as the last! A hell of bullets Tower of Guns consists of five levels and five or six bosses, the number depends on the choices and how many secret areas you will be able to locate. The game has only two constants: the match always starts in an area called the Foyer and ends with the Logistic and Sanctum levels. The other two levels, as well as the internal structure of all the rooms, are totally based on a random combination of the hundreds of variables available to the algorithm. If you want, here and there some dialogues will also appear that claim to make sense of your gait, but you can safely ignore them. The essence of the title is enclosed in a subtle balance between a particularly intricate level design and a gameplay that harks back to the dawn of the first person shooter genre. Energy can only be recovered with medikits, covers are optional, survival is all based on the ability to always stay on the move, as happened in the glorious years of Quake. Bullets, both yours and enemies, tend to be quite slow and could be easily dodged. This is going to be easier said than done though, especially when you're in a room where half the floor is filled with lava, a dozen turrets are dumping all their lead at you, and a couple of spiked robots are now dangerously close. Then there are times when Tower of Guns feels neither like an FPS nor a roguelike, but like a danmaku, one of those Japanese shoot'em ups where there are more bullets than free space on the screen. Xbox One goals In total, Tower of Guns has 12 achievements, which are worth 1,558 points. Most can be obtained simply by playing many times, killing a certain number of enemies or beating the game. The baddest is undoubtedly the one that asks you to die while a boss is exploding. Old school to the core The old school charm is also felt in the level design. The look of the game is in fact totally devoid of the pretense of appearing real or sensible. Rather, you will find yourself faced with intricate architectures, full of secrets, jumps and walkways on which to bounce like in a crazed pinball machine. There will also be hidden areas that will require various skills to be reached. Sometimes a little observation will suffice, in other cases it will require the right skill, but often the good old method of shooting into a wall and hoping the shot doesn't ricochet will suffice. Even the difficulty of Tower of Guns is designed for those who long for the good old days. While it won't take more than a couple of hours to finish the game, getting there will be another story altogether. The enemies hit hard enough right away, especially the bosses, and although medkits periodically fall, it is not said that this is enough to get out alive. Fortunately, before starting, you can use some perks that are unlocked when certain objectives are achieved. Scattered throughout the levels, you will find more or less useful upgrades that will improve damage, health, speed, jumping ability, game difficulty and many otherswait. Furthermore, killing a boss will almost always guarantee the drop of further special items, such as lasers, rockets and other amenities. Not to mention that killed enemies will also release blue spheres that will allow you to improve the damage of your weapon. Be careful though because, if you get hit too often, you could suffer a downgrade of the damage. Finally, even if it is useless to repeat it, when you die you will start from scratch and, trust me, dying will not be such a rare event. Initially you will only have two weapons and two perks. Fortunately, to unlock almost all the other content, you won't have to go crazy much since, in most cases, it will be enough to kill a certain number of enemies or fire a certain amount of shots. Of course, the better weapons and perks will be harder to get. However, don't worry, one of the starting weapons, which launches buzzsaws, is more than enough for the first fun attempts. Tower of Guns is the titanic effort of one man and this is occasionally hinted at by some small bugs, some non-perfect collisions and bullets that don't always hit where they should. However, these are minor flaws that never spoil the overall fun atmosphere. Of course, when some interesting loot gets stuck in a wall and you can't reach it, or the cure you are waiting for disappears in the floor, particularly violent curses will start, but they are still quite rare cases.", "date": "2015-04-20", "grade": "8.0"}