{"name": "Cliccatori di civilt", "ref": "https://multiplayer.it/recensioni/148278-civcrafter-cliccatori-di-civilta.html", "text": "In case you have never had to deal with a ~clicker game~, the first impact with CivCrafter could be a bit destabilizing, with its icons and numbers (really small, however) to be kept under control by clicking . If, on the other hand, you have already tried some games that can be cataloged in the bizarre genre in question, decidedly trendy lately, CivCrafter presents itself as a very interesting declination of the clicker, equipped with a depth that is not easy to find in other similar productions. It is essentially a management system that takes the main characteristics of the genre and transports them on simple semi-static screens, summarizing the construction and maintenance of a virtual civilization in a few simple clicks, but still requiring a certain amount of attention to a good variety of parameters and variables. The interface is simple once understood, even if at first glance it doesn't seem the most intuitive, above all due to the fact of relying on images that are not too clear, with decidedly small icons and writing. It's just a matter of exercise because after a few minutes you can understand the basic mechanics, also because these open and expand gradually, giving you time to master the various facets. And this is how from the first simple clicks to get apples we get to increase the population of the group under our control, expanding its borders, increasing construction and strengthening a real civilization with a few touches on the screen. The purpose of CivCrafter is therefore to control and manage an enlarged community of virtual characters, increasing the population, increasing resources and conquering rivals. The game is free and contains microtransactions that allow you to buy gold, which can be used to speed up waiting times or buy special resources, but these are not invasive or unbalanced elements, therefore the general balance is not affected. Domination over civilizations is just a few taps away with CivCrafter Click and conquer It all starts with the collection of apples, wood and stones, which can be done by simply clicking on the corresponding icons in one of the interface screens. This is the starting point that allows you to obtain the first kinds of subsistence capable of maintaining the population, which can be expanded by simply clicking on the appropriate icon, but to be maintained it needs a constant supply of food and other materials. By associating various specific occupations with community members, automatic flows of resources can be obtained, allowing us to take care of other things, while as the amount of raw materials and inhabitants to control increases, the possibilities for building buildings, specializations for characters and special abilities that apply various bonuses to the performance of the parameters. As befits a pseudo-strategist, it is also possible to fight against other civilizations, which involves an inevitable expenditure of population members but can lead to substantial instant gains in materials. The advantage of CivCrafter, i.e. the possibility of keeping the progress of civilization under control through a few touches and a quick passage from one window to another, ultimately also determines its main limitation, because this simplicity, even if enriched by a certain continuous expansion of the options and possibilities offered to further personalize one's own population, also leads to a certain lack of sense of progression, always finding ourselves trapped between numbers and parameters which in part manage themselves and do not let us enjoy much more than built, an element that would be fundamental in a game of this kind. Even the choice to represent everything in an extremely minimalist way, with a small strip of ~panorama~ to represent what you are acting on and a large part of the screen occupied by indexes and parameters, is functional to the game but less to the sense of involvement. Adding the ability to join other players through clans is a great idea to increase competition within the online leaderboards.", "date": "2015-04-14", "grade": "7.8"}