{"name": "L'eroe di Noshrac", "ref": "https://multiplayer.it/recensioni/148279-son-of-nor-leroe-di-noshrac.html", "text": "The protagonist of Son of Nor is the classic predestined with amazing powers who have the thankless task of saving a humanity in disarray. Obviously Noshrac, the desert world in which our chosen one lives, is not a quiet place but a place full of monsters and ancient structures full of deadly puzzles. But the chosen one can exploit the power of the elements, he can shape the earth, he can increase his own power and combine these elements to overcome contraptions and dilemmas of all sorts. This is the gist of the action title developed by the boys of StillAlive, a classic indie team full of enthusiasm which, thanks to an interesting concept, immediately gained the support of several players. But are we sure that public trust and passion are enough to promote Son of Nor? That a good idea is always sufficient to justify any compromise? Son of Nor asks us to save humanity by putting ourselves in the shoes of a powerful elemental wizard Elemental Watson Put on the role of the hero of Noshrac we can immediately count on the control of the earth element and on the invaluable power of telekinesis. The first ability allows us to multiply or eliminate sand and use it to block enemies, annoy non-player characters and reach places otherwise out of reach. Telekinesis, on the other hand, is essential for interacting with different puzzles and allows us to directly attack opponents by hurling rocks, trees, giant carrots and various other objects with which it is possible to interact at supersonic speed. Getting the hang of the control system is a matter of moments and things remain pretty intuitive even as our hero progressively learns more magic that can be combined into a whirlwind of enemies that take off, crumble and catch fire. Thanks to this formula, Son of Nor is quite entertaining and reaches its climax when it asks us to use our powers to overcome various puzzles that sometimes have to be tackled quickly. And it didn't end there. StillAlive Studios' action can be tackled in cooperative mode, up to two players in local split-screen and up to four online, taking advantage of dynamics that give an extra edge to the experience. The union of several players allows you to move particularly heavy boulders, to combine multiple spells to create tornadoes of fire or other devastating amenities and to keep dozens of fiery objects in suspension to transform a room into a deadly trap. Among other things, Son of Nor is compatible with the Oculus Rift and the experience can be enhanced by exploiting some particular control systems. In fact, the title works with the Tobii Eye-Tracking, which replaces the mouse pointer with the player's view, and with the Epoch Emotiv which reads the electrical activity of the brain, allowing commands to be launched without lifting a finger. Having not played the game using these tools, we cannot say how much the experience is different, but we can assume that they increase the player's feeling of having direct control over the protagonist's powers, as well as allowing those with motor problems to still enjoy of the title. A difficult compromise In summary, we can say that the combinations of elements are delicious, some puzzles use them intelligently and the control system works quite well. The graphic design is instead sparse and clearly lacks inspiration but we can also turn a blind eye to this factor given the indie nature of a project entirely focused on gameplay. However, it is not possible to do the same for the overall quality of the experience which does not shine for the originality of the plot, qualitative constancy and finishing. Luckily some architectures are not too bad and overall the atmosphere, supported by a suggestive soundtrack, is good. But from a technical point of view the whole experience is a continuous ups and downs. The interlude scenes are negligible and the enemies do not shine in execution, variety or intelligence, ending up flattening a gameplay that could be exploited more effectively. Furthermore, the glitches are wasted and when the terrain is uneven the collisions leave something to be desired, producing negative effects on the gameplay. Fortunately, the scope of the spells takes care of partially saving the experience, which is really wide and gives an authentic feeling of power. Furthermore, the sand is made quite well, complete with credible physics, and we can immediately manipulate it in a massive way by modifying entire areas almost as if we were in an editor. But these elements are not enough to compensate for the sketchy animations they dothink of an incomplete title, a title that stands out for abundant but crudely applied physics. If we add to this a plot that is not very original and a structure of the levels that is certainly not memorable, it becomes difficult to promote it. Yet we get there anyway, even if the obvious defects weigh on the final judgment, because we are faced with a game that is able to say something. Despite the numerous defects Son of Nor is entertaining and is also to be rewarded for the adaptation of the texts in various languages including Italian and for the effort made in the dubbing in English and German which, although not showing off an excellent quality, is still appreciable .", "date": "2015-04-14", "grade": "6.0"}