{"name": "Gli Incredibili: L'Ascesa del Minatore", "ref": "https://multiplayer.it/recensioni/gli-incredibili-lascesa-del-minatore.html", "text": "A Kid's Game Needless to deny that The Incredibles is aimed at a less mature audience, a fact that is revealed more or less immediately, as soon as you hold the controller: the simplicity of the controls is unsettling, as well as the limited actions available to us. And yet, The Incredibles 2 features an extravagant mechanic that is sure to delight the little ones, allowing them to control both Mister Incredible and Frozen: the simple press of a button will allow them to switch between them, to adapt to the situation and use their different powers appropriately. Mister Incredible has a disproportionate strength on his side that makes him the main means of combat, on the other hand Frozen can freeze enemies and keep them at bay while his partner takes care of them. As the opponents are defeated, points (experience?) are earned, useful for enhancing the characteristics of the two superheroes and learning new special moves, up to the devastating super-moves. The game system is therefore intriguing, but the excessive linearity once again reveals the purely ~childish~ imprint that has been given to the entire game structure, in which the progression is not entirely dissimilar to a beat'em- scrolling up, with the consequence that for 90% of the short adventure, you take control of Mister Incredible, while Frozen is relegated to a sort of appearance, which becomes indispensable especially in moments when you have to face simple puzzles, mostly based about freezing something. The monotony that follows is therefore obvious, and however well done, all in all, one cannot fail to notice its repetitiveness and flatness. Technical realization The Incredibles 2 proves to be a product of moderate pretensions also on the technical side, where it does not shine for its spectacularity or visual originality. In any case better than the prequel, The Incredibles 2 stages quite detailed and chromatically varied polygonal models (despite the similarity of the enemies) and the player finds himself crossing splendid settings, unfortunately undermined by the excessive linearity of the game, which ends up emphasizing the journey fixed and tight in which you move to reach the end of the stage. On the other hand, the special and particle effects that characterize explosions and so on are noteworthy, certainly well done. From the sound point of view, it must be said that the recycling of some songs taken directly from the film was not a bad idea, given that it gives pepper and quality to a rather dull soundtrack, lacking in dubbing - as usual - least of all mediocre. Comment The Incredibles 2 was born as a medium-low budget project to hit the younger range of players, who loved the film and, perhaps, even the first video game. The target is partially hit, given that the little budding superheroes will probably appreciate this new adventure of their favorites without paying too much attention to its repetitiveness or technical shortcomings. The possibility of passing from Frozen to Mister Incredible and vice versa must in any case be kept an eye on, as it is an appreciable desire to make the title less flat at the risk of complicating the lives of small players, who will probably still prefer to beat up random enemies in the role of the nice super-breadwinner. Pros: It's the Incredibles Graphically decent Intelligent gameplay Cons: Linear Trivial Cross-platform The Incredibles is also available for Xbox and GameCube, and the differences are limited to a greater graphic cleaning for these versions, and a slightly more convincing graphics engine, but which does not change in substance. For several years now, Walt Disney's Pictures has left out the film production of animated drawings, in favor of the creation of feature films in computer graphics, mostly signed by Pixar. The first exponent of the genre was the unforgettable Toy Story, which was followed by a series of films made in digital graphics which achieved good success at the box office. After Dinosaurs and Finding Nemo (but also Toy Story 2), it was therefore the turn of a film that received enormous acclaim: clearly inspired by the Fantastic Four of Marvel Comics, The Incredibles tells the adventures of a family with humor and lightness of super-humans, grappling with everyday home life but also with the criminal threats that only their superpowers can counteract. Simultaneously with the release of the film, a mediocre videogame tie-in was produced, intended above all for the little ones; and once again The Incredibles appear on PlayStation 2 to face a new opponent, the evil Miner, together with Mr. Incredible's sidekick, Frozen.", "date": "2006-01-20", "grade": null}