{"name": "Fra dungeon e animali rari", "ref": "https://multiplayer.it/recensioni/148178-taichi-panda-fra-dungeon-e-animali-rari.html", "text": "Despite the recent release of Dungeon Hunter 5 and Blood & Glory: Immortals, there still seems to be room for action RPGs on the App Store and Google Play. In the case of Taichi Panda, however, we are talking about a title that already boasts over ten million downloads, having made a bang in China before landing on Western stores. The reasons for this success are not difficult to understand, and in fact just take a look at the messy game interface to realize how similar it is to many Asian MMO-style productions. ~Too many irons in the fire~ is a metaphor that fits perfectly to the product developed by Snail Games, if we consider the alternation of coins, diamonds, stones, bonuses of various kinds and action points that it is possible to collect from game to game, and that they serve to satisfy a plethora of needs that are often not compatible with a quick and impromptu use. No, Taichi Panda has its time and in fact the entire first ~world~ serves as a tutorial for what comes next in terms of challenges, missions and whatnot, following a path that unlocks new features as you level up ; see for example online multiplayer, both asynchronous and in real time, for up to six participants. There is a plot accompanying the adventure, but you will hardly pay attention to it, focusing rather on which of the four available characters to select for your raids. In this case we have two girls (one recently added, however), a traditional warrior and the panda referred to in the title, crude and powerful as one might expect from an animal as funny as it is not very graceful. However, we will not be alone in battle: we will be able to bring up to four useful pets with us, which act as support units and manage, among other things, to distract the most dangerous enemies to give us a way to hit them without taking damage. Taichi Panda proves to be a solid, fun and well done action RPG right from the start Who is tougher? From a structural point of view, Taichi Panda is quite similar to the aforementioned Blood & Glory: Immortals, with relatively short missions which, from a certain point on, tend to repeat themselves due to the inevitable need to do some grinding. so as to level up and be able to access the next ~world~. In any case, the first few hours go by like a pleasure, so much so that it is difficult to detach yourself from the game and it is even possible to appreciate the quality of the touch controls, also equipped with an analog stick that automatically repositions itself, as well as a combat system that manages to enhance the impacts very effectively, making an otherwise substantially repetitive gameplay more engaging and fun. On the right side of the touch screen are the buttons for the standard attack and for the special abilities, each with a certain ~cool down~ so that it can be reused. In this juncture, the developers have managed to guarantee a good variety and a certain spectacularity, further emphasized by the bullet times that accompany the breaking of the boss guard (which have a double energy bar for this very reason) or the coup de grace which leads to its defeat. In short, it beats very well, and the enemies are also quite numerous and well differentiated; but you have to get used to the lack of evasive maneuvers and parries, which often means having to make a simple speech of power to get the better of your opponents: if the character's level is low, it will be difficult to overcome an advanced mission. All the loot and crafting part works well, even if the interface does not make it very easy to operate in this situation, since there is no indicator that makes it clear immediately if a particular object is better than the one we have equipped. Fortunately, there is no shortage of time to experiment, and during the first hours there is a succession of ~level ups~ that reset the counters relating to the energy of the action, otherwise rechargeable over time. There are several in-app purchases in Taichi Panda, but the reality is that you can play for free without too many problems. Indeed, to be honest, there is even an automatic function that makes the inevitable grinding more bearable than usual, even allowing you to carry out an auto-looting in the levels already completed with the maximum evaluation. This system, traditional but multifaceted, is accompanied by a technical sector that alternates questionable choices (the aforementioned interface) with excellent in-game graphics, which lacks just a hair more fluidity (at least on iPhone 5s) to further stand out . The music and sound effects are well made, but occasionallyor you notice some annoying glitch.", "date": "2015-04-11", "grade": "8.0"}