{"name": "La storia di un pixel", "ref": "https://multiplayer.it/recensioni/147990-a-pixel-story-la-storia-di-un-pixel.html", "text": "It often happens that independent developers take the history of video games as a basis for their productions. In addition to reflecting on the medium itself, highlighting some aspects and problems, including the inevitable idiosyncrasies, it is also a great way to tell something they know well and experience on a daily basis, without venturing into areas that are not within their competence. The graphics improve as the levels and technology generations progress A Pixel Story by Lamplight Studios was born from this trend and immediately puts its cards on the table. The protagonist is the ball of Pong who is chosen for an anti-system mission. If you remember it was a white square. Extracted from her world made up of a black background and two white rackets, she obtains an anthropomorphic form and a mission: to destroy an evil program that wants to establish an IT dictatorship by controlling all the system's applications. There is no return and poor Pixel has no choice but to embark on a long journey, guided and aided by rebel agendas. Initially the hero can only jump, but as he passes the maps he will develop other powers. For example, in the second level he will get a hat that will allow him to create his cached copy, useful for overcoming some puzzles. All the developed powers will be linked to the headgear and will lead to an increase in difficulty, but also the possibility of reaching previously inaccessible areas. We will discuss this in the following paragraphs. However, let's assume that you have already understood that A Pixel Story is basically a puzzle-platformer game with ~metroidvania~ elements. So it's full of platforms to jump on, obstacles to avoid and puzzles to solve. Nothing too original on paper, were it not for some gimmicks that put it head and shoulders above similar titles. A Pixel Story brings the history of video game technology to life, and we reviewed it Puzzle what a passion But let's see some of the typical puzzles of A Pixel Story that help us understand how the gameplay was structured around a precise and thoughtful progression of difficulty. In the first world, a forest, Pixel must be able to pick an apple from a tree, as asked by a secondary character. The safe room, where you can save your game and rest a bit Recovering the hat is essential To do this he will have to pull a lever, run towards a rebounder that will make him reach an elevated platform where he will pull another lever and so on up to the top. Completing the puzzle requires not only good observation skills, but also skill with the controls, as you have to be very quick if you want to succeed. We specify, before talking about the second puzzle, that the average difficulty of the main missions is accessible to everyone, or at least to anyone who has played a platform puzzle game in their life. However, the Lamplight guys have also thought of those who want a greater challenge, distributing unlockable rooms for the maps by spending coins that are collected in the levels (no in-app purchases, don't worry). Entering it you find yourself in hell, that is, facing challenges worthy of the advanced levels of Super Meat Boy. Only to pass the first room did we struggle the proverbial seven shirts, between fireballs to dodge and lethal spikes to avoid. Challenge Rooms aren't mandatory, but taming them gives some satisfaction. Let's go back to the standard puzzles and give another example. As we said, Pixel's first power allows him to create a cached copy of himself. How can it be used? For example, it can be placed on a safe platform before facing danger, in order to have a sort of lifeline that is always active, or in many puzzles it is used to perform actions that would otherwise lead to certain death, such as pulling a lever placed on the trajectory of a cannon, or to bring down a platform that ends up against spikes. In some cases it is also very useful for reaching otherwise inaccessible platforms, such as in a specific situation where by pulling a lever there is very little time to climb onto a platform which is lowered by the mechanism. How to do? Simply step forward, place the hat on the ledge in front of the platform drop point, return to the lever, pull it, then summon the cached copy and step onto the platform. Even if we stop here with the examples, by now you should have understood how the gameplay of A Pixel Story works, which becomes more and more intricate as the levels go by. Generational issues One of the most interesting features of A Pixel Story is the technical side. In addition to being divided into levels, the gameplay is divided into technological generations. From pixels to3D the step is long That is, as the adventure progresses, the graphics evolve and go from being 8-bit pixel art style, to becoming a well-made 2.5D. In between are other styles of pixel art that reference the 16-bit era. In total, there are four technological generations, all very different from each other in style, but all made excellently for what the purpose of the title is: to be a ride in the technological evolution of the videogame medium. Even the soundtrack, made up of truly excellent songs, follows the same path, perfectly matching the graphic era represented on the screen. In short, we are faced with one of those cases in which the technical side really represents an added value because it is used as a tool for the growth of the gamer and not just as a way to satisfy his low instincts as a technological consumer. For the rest we are pleased to mention the excellent checkpoint system, which allows you to teleport from one part of the levels already traveled to another in order to favor the search for secrets and memories, the latter necessary in a certain number to continue (the remaining are linked to extras). Even in terms of duration, the Lamplight Studios title isn't doing badly: it takes about six hours to complete the main story, while the entire game takes more or less twenty hours to finish.", "date": "2015-04-08", "grade": "8.9"}