{"name": "Elementare", "ref": "https://multiplayer.it/recensioni/147925-the-trace-morte-misteriosa-elementare-pearce.html", "text": "When Warren Oakley, respectable owner of the award-winning company Oakley Classic Cars, is found dead in his workshop with his daughter kidnapped for unidentified reasons, Sam Pearce, detective of the Baltimore Police Department is left to do is put on the mandatory trench coat of ordinance, activate the futuristic integrated device for field investigations and launch into the investigation of the case. In The Trace: Mysterious Death Game we are therefore called to interpret Pearce in a particular investigative graphic adventure with a first-person view, in which we essentially have to solve the case by interacting with the scenarios, collecting evidence and answering questions. In games of this type, crucial elements are often the control interface and the structure of the puzzles and on both fronts The Trace performs decidedly well, presenting an excellent system of exploration of the scenarios and manipulation of objects, although the response to tactile inputs is not always flawless, and a very open handling of the puzzles that pushes the player to experiment and observe objects from various perspectives, although simple hidden object hunting is not completely excluded here either. Another typical problem of the investigative adventure is the relative freedom left to the player to develop hypotheses and reach conclusions, since the superstructure of the graphic adventure, usually closely connected to a well-defined narrative setting, often takes over and practically makes impossible to get out of the predetermined path by building new theories in the reconstruction of events. In this case the expedient elaborated for The Trace proves to be particularly ingenious and interesting, with the player called upon to arrange the evidence collected in the exploratory phase and in solving the puzzles according to a tree diagram, associating them with various crucial nodes in the solving hypothesis of the case and thus unlocking various sections in the reconstruction of events. Aspiring detectives will find something for their teeth in The Trace: Mysterious Death The crime scene The movement in the settings takes place through predetermined paths within 3D scenarios framed in first person, while touching the elements on the screen the interactive objects are detected and the question marks appear linked to the various key elements in the reconstruction of the events. All this particular schematic setting is justified by the use of an electronic device provided to detective Pearce which allows to scan objects, detect fingerprints, obtain real-time information from the base and connect the evidence to unlock the animated sequences that reconstruct the events in a rather ~stylish~ and coherent way, to tell the truth. The objects with which it is possible to interact can be manipulated to be seen from different perspectives, discover hidden details or any fingerprints, or hide further puzzles based on the combination with other objects and particular diversified interactions. Although many of these puzzles are rather elementary, several others can pose a considerable challenge, above all because the combination between the various objects is not always immediately deducible, even if it always maintains a rather iron logic at the base, justified by the realism of the setting. Once a piece of evidence has been discovered through the manipulation of objects or the solution of puzzles, one moves on to the parallel and always recallable phase of the tree diagram in which it is possible to order the pieces of evidence by associating them with the various hypotheses of the investigation and thus gradually discovering the solution to the case . Also in this case, therefore, the reconstruction of the case is not completely free, but if nothing else, the game leaves the player free in arranging the evidence, making him in some way the protagonist of the deduction work, albeit within well-established guidelines. The three-dimensional creation of the settings is remarkable, which are realistic and convincing, particularly interactive thanks to the various possibilities of manipulation even if not excessively inspired, also given the desire to maintain a predominantly realistic cut.", "date": "2015-04-08", "grade": "8.2"}