{"name": "Alchimisti in cel shading", "ref": "https://multiplayer.it/recensioni/147238-atelier-shallie-alchemists-of-the-dusk-sea-alchimisti-in-cel-shading.html", "text": "The Atelier role-playing game series by the Japanese Gust is one of the longest-running games in the world. In fact, starting from 1997 the titles that make up the saga have seen the light on practically all the most important home and portable consoles up to the present day, earning the sympathy of a good portion of the public of enthusiasts. Atelier Shallie: Alchemists of the Dusk Sea is in this sense the sixteenth product of the main franchise, and the final episode of the Dusk storyline trilogy, to see the light in stores. The story of the game kicks off ten years after the beginning of Atelier Ayesha: The Alchemist of Dusk and six after that of Atelier Escha & Logy: Alchemists of the Dusk Sky. Due to the sudden shortage of water, plants, animals and humans are on the verge of despair. This forces Shallistera, the daughter of the Lugion chieftain, to travel to the town of Stellard to try to understand what is happening and perhaps a way to save her village. Shallotte Elminus also lives there, an ambitious young woman who does everything to become a real successful alchemist through her workshop / laboratory, but while waiting she is forced to collect the garbage. At least until the lives of the two young women intersect and also involve other supporting characters, including some from previous games, such as Wilbell voll Erslied. From these premises, after a first introductory chapter in which the user is asked who he wants to play, in fact a long and varied adventure kicks off, where basically there are two separate events (apart from a couple of sporadic encounters) up to a certain point in the story, and a good number of things to do. Atelier Shallie: Alchemists of the Dusk Sea positively closes the trilogy of the Dusk series Alchemy and maidens Compared to the previous titles in the series there are some sensitive changes, including the possibility of collecting a wider variety of products and raw materials to be used for synthesis, but basically the game structure provides a classic scheme formed by explorations, non-causal fights and in turns, and experiments. Two are perhaps the most striking novelties of this episode: the first is linked to the possibility of being able to complete an assignment or collect materials with no more time limits, while the second has to do with the new camera that allows the user to rotate like the shot in the explorable environments, offering him total freedom of ~maneuver~. The adventure itself instead takes place in a way not unlike other titles of the genre, even if it is regulated by a system called Life Tasks. This provides a whole series of secondary activities, even a little strange, which can be carried out during the game by the chosen protagonist, such as exploring a certain area, collecting particular ingredients for some alchemical experiment, performing a certain number of jumps, and so on. Street. Completing Life Tasks improves the heroine's motivation, among other things, and tasks can be performed at will. Only after completing a certain number of primary and plot-related tasks, in fact, can the gamer decide to move on to the next chapter and therefore progress in the story. Exploring the various areas that make up the game world, there is clearly no shortage of enemies to face. These are visible on the screen and only after touching them can you enter a fight with them in a special screen. The combat system, characterized by shifts and character management through a special ~menu~, at that point provides that the user faces the battle with a party of six elements, three primary and three in support. Each of them, as per tradition for the genre, boasts different statistics, skills and moves, which then determine their reactivity and effectiveness on the field. The question of ~benches~, i.e. the use of the three reserve characters, therefore becomes very interesting. Following an attack, for example, it is possible to recall an ally from the rear to unleash a combo with him, or to carry out a prompt defense by making him take an incoming blow. Replacing a character is also useful for allowing the one who has just left to take a breather and recharge, which is why, for a new use, you have to wait a few turns. By inflicting a lot of damage on an enemy, it can be sent to Break, a status in which it remains practically stunned and helpless at the mercy of the opponents. By filling up a special bar, the latter can then unleash a series of chained attacks and give more strength to any final moves. However, much depends on the level of diinitial difficulty chosen from the three available, with the more advanced one offering a more compelling type of challenge than the two minor ones, and therefore more resistant opponents even to this type of move. Mind you, not that the title is particularly complex even in this case, but at least fans of the genre will have a little more bread for their teeth. Playstation 3 trophies Atelier Shallie: Alchemists of the Dusk Sea offers 39 Trophies, of which 24 are bronze, 10 silver, 4 gold and 1 platinum. While the simplest ones are obtained by completing the single chapters of the adventure, or the stories of the two protagonists, the more complex ones are conquered by elaborating a certain number of complex objects, by defeating a particular enemy or by scraping together a certain number of materials and recipes for one's own experiments. Go-go recipes For the rest, alchemy is obviously of great importance in the economy of the game, with a rather interesting crafting system that involves the use of recipes and various materials for experiments, even with variants of the same element to create increasingly powerful items and different, with the abilities of the protagonists increasing by synthesizing objects and potions. Increasing your level as an alchemist means learning new special techniques which will then affect the quality and effectiveness of the final products on a par with the quality of the original materials themselves. It's an incredibly engaging system, and once the user gets used to certain mechanisms they are almost driven to experiment, try new combinations of materials and spend a lot of time on these activities. Moving on to something else, and specifically to analyze the technical part, Atelier Shallie: Alchemists of the Dusk Sea presents a pleasant cel-shaded graphics, with well-modeled anime-style characters and very colorful settings, even if a bit repetitive and anonymous in terms of detail. On the other hand, the animations and the bestiary in general are only fair, where some monsters stand out among the large ones. On the other hand, what is more pleasing in the production is the sound, which can boast the dubbing in both English and Japanese (the better of the two), with the subtitles available only in the Albion language that occasionally show some translation errors, given that some lines of written dialogue do not correspond to the text spoken at that precise moment. The soundtrack is beautiful, among other things customizable, with a particular mention for the battle themes, especially those relating to boss fights.", "date": "2015-04-06", "grade": "7.3"}