{"name": "Kirby's Dream Buffet", "ref": "https://multiplayer.it/recensioni/kirbys-dream-buffet-recensione.html", "text": "On August 17, one month after the announcement, Kirby's Dream Buffet was released on Nintendo Switch (available only in the online shop). This is the second unpublished game in the series - which turns thirty - to be released in 2022, after Kirby and the Lost Land, which in just a few months has already become the second best-selling episode of the saga, and the first since 1992 to exceed the four million copies. We say all this both to contextualize Kirby's Dream Buffet, and to point out that, although it is clearly a spin-off, this game too was developed by HAL Laboratory, and directed by Kirby's putative father, Shinya Kumazaki, who takes care of the rosy ball - as creative director - for fourteen years. Kirby's Dream Buffet is an experiment focused on multiplayer, both online and offline, and quite clearly resumes, fusing them, series such as Super Monkey Ball and Fall Guys, with a spice of Mario Kart and Mario Party. It is a small and circumscribed work, but well cared for. This time Kirby doesn't walk or run, but rolls, and rolls in his dream context: paths made up of food of all kinds. Salty, sweet; hamburgers and various delicacies. The chubby hero challenges others of his kind in these courses where it is important both to finish first and to gorge on strawberries: two objectives that are only apparently antithetical, because the courses are full of them, and at the finish line there are three plates of fifty, twenty and ten strawberries , which alone are able to alter the outcome of the challenge. Basically, no matter how many strawberries you can eat by finishing last, you will hardly be able to balance the feast of the first (who gets fifty, as we said). And now let's delve into the structure of the game, in our review of Kirby's Dream Buffet. Gourmet Grand Prix Kirby's Dream Buffet: get ready to gorge yourself Before going into the various modes, a few words about interaction. The control system is precise, and Kirby's mobility is very particular: a lot of friction is generated with the ground, and rolling is not very simple, in the sense that the character, left to himself, will hardly find flat surfaces on which to rest. Physics management is simple, but functional: it acts just enough to make the character slightly unstable, so you don't have complete control. We were a bit disappointed by the jump, which is not basic but still important, because it is not declined in any way: essentially, by pressing the appropriate button, Kirby will always jump at the same height, regardless of the pressure exerted. Kirby's Dream Buffet: Power-ups help Kirby win the race The most important mode of Kirby's Dream Buffet, and from a certain point of view we could even define it as the only one in the game (we will explain this point better shortly), is Grand Prix Gourmet, which can be tackled alone against the CPU (a four difficulty levels, but even at the maximum it is not particularly fierce), two from the same console (split screen), four locally (with as many consoles) and, finally and above all, four online (with random opponents or, through a password, with friends). We immediately anticipate that, if the fluidity is perfect in split screen, online we have encountered some slowdowns: it does not seriously affect the enjoyment of the experience, these are rather rare cases, but we have nevertheless encountered them and, should you be interested in competing to win, in some moments may annoy you. The main activity of Kirby's Dream Buffet, as anticipated, is running. And in fact it constitutes two of the four rounds (the first and the third) that make up the Gran Prix Gourmet. We have explained to you before the objective of the competition, but there are some details that we have left out; first of all you always compete in four. Secondly, along the way there are Mario Kart-style power-ups (boxes decorated with a fork and knife) that help Kirby in his run: sometimes he transforms into a meteor, others into a donut, others still into a jelly ( there are seven in total, at the moment). They are important both to go faster and to damage the opponents' race, perhaps throwing them ~off the track~: should this happen to you, all you have to do is press ~A~ repeatedly, so as to get back into the race as soon as possible. By eating a few strawberries, recovery will be faster, in case you have swallowed several, it will be slower: a factor that is quite evident also on a visual level, given that Kirby tends to become larger and more voluminous based on the number of strawberries swallowed. There are many paths, but the quantity is unknown: it is not possible to understand the total number, and they are chosen randomly by the game. Surely it's more than ten, probably -for now - less than twenty; each element of the various tracks is made up of food. And this rule provides no exceptions. Need a slide? Bacon. A trampoline? Fried eggs. Rolling platforms? Donuts. Something that slows you down? Mustard. Sobriety is certainly not Kirby's main virtue, and given the colorful context even this disproportionate amount of calories does not clash. Kirby's Dream Buffet: the final weigh-in The second round of the Grand Prix Gourmet is a minigame: a platform of various shapes, with a top view, in which the various Kirbys challenge each other to collect more strawberries than the others; strawberries that tend to fall from the sky. The fourth and final test is the Battle Royale: it works in a similar way to the second, but in addition it is possible (through the use of power-ups) to throw the opponents out of the ground, thus depriving them of twenty strawberries. If the victory is fiercely contested, a recovery of about ten seconds is granted when the timer expires. At the end of the four specialties the four Kirbys are weighed, and the fattest one, and therefore full of strawberries, wins; in full Mario Party style bonuses are awarded, however rather light. If two rivals are at a short distance, the positions can reverse, otherwise not (it happened to us, from first to second ~thanks~ to the final bonuses). We appreciated the second and fourth rounds, but it's clear how minor and secondary they are compared to the race, which remains the most full-bodied and structured specialty. Longevity and content Kirby's Dream Buffet: strawberries everywhere! Kirby's Dream Buffet is full of stickers and alternative costumes to unlock, elements that become available by playing, accumulating points, improving one's ranking: the fact that they are present, however, does not oblige us to treat them expertly, because, however appreciable, they have no effective influence on the mechanics, skills and parameters of the game. We doubt that anyone, furious completionists aside, will play long to collect these items. The main problem of Kirby's Dream Buffet is precisely its scarce content, its limited modalities. And it's a shame, because the engine, the interaction and the control system, heart and soul of every action game, are well done: they would have allowed for much more than the title offers. At present the work is made up of two secondary sections (minigame and Battle Royale) and a main one, the race, in which the goal is always to arrive before the others, who together make up the Grand Prix Gourmet. The routes - as we said - are numerous, but we doubt they are diversified enough to constitute an incentive to play for a long time. Given the somewhat manifest inspiration in Fall Guys, perhaps it would have been better to copy to the end: create more ways, even simple ones, to vary objectives and challenges. Taking on a Grand Prix Gourmet not knowing what to expect would have been much more stimulating: the two fixed races are fine, but the collection mini-games and the Battle Royale are not deep enough to catalyze interest for long. We reiterate it, the engine would have allowed for a much different variety, and ~little~ would have been enough to obtain it. Kirby's Dream Buffet: there is nothing that is not edible Visually, the game isn't excellent, and it's not as well-finished as the main HAL productions (Kirby's ~face~ isn't animated during the roll, just to point out an exemplary detail), but it's decidedly pleasant, and certainly well done , both in the variety of materials (chocolate, sauces, sandwiches, cream, etc...) and in the general appearance, usual playful and hyper saturated. It is an excellent compromise between overall pleasantness and general fluidity, depending - we imagine - on the online use of the title.", "date": "2022-08-19", "grade": "6.5"}