{"name": "Riapre la caccia", "ref": "https://multiplayer.it/recensioni/147817-evolve-riapre-la-caccia.html", "text": "Evolve deserves credit for being able to clearly divide shooter lovers into two well-opposed factions thanks to its peculiar asymmetrical multiplayer. There are those who are having a lot of fun jumping from one side of the barricade to the other impersonating now the monster now the hunter, and those who have instead been burned by a mechanism perpetrated endlessly always equal to itself, without the slightest opening for some noteworthy variant. The contrast between the four hunters who must cooperate to kill a giant monster that evolves in three stages during the game, going from prey at the start of the match to hunter himself, constantly pitting players against each other, somehow follows the philosophy of Respawn Entertainment's unfortunate Titanfall: a ~multiplayer only~ title that was immediately fun, but which suffered greatly from the lack of content in the long run. That the same end awaits Evolve is a more than concrete hypothesis, but less than two months after its launch, the developers of Turtle Rock Studios return to the fray with the first DLC containing four new hunters and an unpublished monster. Will it be enough? Evolve is enriched with four new hunters and an unpublished monster: is it worth it? Hunting Season Pass Let's start by getting to know the four new hunters who will join the team of fearless survivors ready to risk their lives to free Shaer of his monstrous creatures. There are four, one per class, and unlike the previous ones that had to be progressively unlocked, these will be immediately available for use even if you haven't unlocked all three of the basic ones yet. Let's start with the attacker, Torvald, characterized by a red beard with braids, skin covered with tattoos and scars and a series of rather invasive cybernetic implants that became necessary after he was almost torn to pieces by one of the beasts. The trauma has transformed him into a death-dispensing machine desperate for revenge. No longer fully human, he enters the battlefield with both legs and right arm fully robotic and a very interesting arsenal. The primary weapon is an automatic rifle for short-range damage which is countered by a back-mounted mortar cannon for ranged damage, which is very effective on slower targets. This becomes particularly harmful if used in synergy with the trapper's harpoons, underlining once more that Evolve is a game made primarily of cooperation and balance between each member of the hunter team, an aspect that has not been completely distorted by the introduction of new arrivals. Finally we have a shrapnel grenade that places a series of weak points on the entire body of the monster, to maximize the damage of firearms and the inevitable personal shield, the trademark of this class. Crow is the new trapper, a shy type who has spent many years of his life in solitude wandering around alien planets. He doesn't take a step if he isn't accompanied by his inevitable battle companion, the tamed gobi mantastrello, a sort of alien bat capable of flushing out any creature in the vicinity. Gobi has proved to be very useful in open spaces as it allows us to discover further dangers hidden in the vegetation, but on the other hand he cannot stay behind the monster for more than a few seconds, managing to differentiate himself well from Daisy. As a trapper it is equipped with a portable dome with which to trap the monster in a relatively small area and a stasis gun to slow it down. This has a dual fire mode with bursts that slow the monster for a short period of time or, if charged, for a longer period. The most interesting weapon, however, is the kinetic rifle capable of doing high damage if used repeatedly or of penetrating the monster's armor by directly taking away its life points if you manage to load the shot. The latter is very useful in the final stages of the match, when the enemy may have restored his armor but has few life points. The fourth medic is Slim, a humanoid insect armed with a leech rifle that damages the target while recharging the healing discharge, the most important ability of this class since it keeps the whole team alive. This makes Slim a doctor particularly prepared for combat since the more he hits the target, the more the cooldown of the cures is reduced. This obviously exposes him more to the monster's attacks, requiring the player to have a certain dexterity to avoid dying quickly and leaving his team at the mercy of the opponent without the possibility ofno care. The secondary weapon is a spore gun very useful in close combat or if the monster is trying to escape, as it prevents him from sniffing out the prey to recharge his shield. Finally, our humanoid insect can launch a drone that heals allies or revives them once they die with the latter function much more appreciated than the first. The possibility of reviving a teammate without having to get too close is very useful, while the regenerated life points seemed negligible making us prefer the leech rifle mechanic which reduces the cooldown of the healing discharge to heal the team, especially in light of a artificial intelligence that drives the drone a little too roughly. The last of the group is Sunny, the only woman in the DLC, pilot and engineer armed with a devastating micro-atomic grenade launcher that inflicts large amounts of damage in the face of bad accuracy and rather long reload times. It is very useful in team play, given the possibility of deploying a drone that provides a shield to nearby teammates and to use a jetpack booster that increases fuel and flight speed. A bit 'little compared to other Support. In this sense, Sunny seemed to us to be the weak link of the package, less incisive and characterized than the other newcomers, but overall we can only be satisfied with the work done by Turtle Rock Studios which has succeeded in expanding the ranks of hunters with interesting characters and above all, well balanced. However, everything has a price and the complete package of the four hunters is 22.99, with singles available at the price of 7.49 each. The Colossus arrives But if on the one hand the hunters are renewed, on the other there is a new monster prowling dangerous for Shear: the Colossus. This mammoth beast, given its size, is particularly slow and awkward in its movements, so much so that it is completely unable to jump. It therefore offers a whole new perspective to the role of the monster, but fills this gap perfectly with the possibility of curling up on itself and rolling acquiring more and more speed. During the clashes this ability can be exploited to quickly escape from the most unfavorable situations or to roll directly on the hunters inflicting a good number of damages. In this sense, the roll becomes a particularly effective weapon if you manage to chain it with melee attacks of rare power. His abilities are equally geared towards long and short range attacks, and the increased energy and armor allow him to remain exposed even for extended periods of time literally slaughtering opponents with the four new abilities. The first of these is a lava bomb that throws an incandescent ball away imitating the Goliath with rocks, but with different effects: in this case less direct damage is inflicted but around the impact area it generates explosive mines that can be exploited to further damage hunters or to create safe areas for escape. Fissure, on the other hand, is caused by two powerful blows from the Colossus on the pitch that cause flames to erupt from the ground that continue in a straight line, throwing anything in front of it into the air. This is particularly useful not so much for damage but because it instantly interrupts medics' beam healing or support shields. As we have said, the weakness of the new monster is its slowness, which can be stemmed by using the prehensile tongue which attracts a single target to us, even going so far as to kill it instantly in the case of fauna. Definitely a very quick and effective way to recover armor, but also a necessary skill if we find ourselves surrounded by hunters positioned on a hill. In fact, the Colossus cannot jump and the only way to defend against this kind of attack is to attack in turn by attracting a hunter to it, or to use the rock wall as a last resort before fleeing. This can also be used to capture or isolate a lone hunter from the pack, underlining the suppleness of this creature which although at first glance may seem quite standard and limited, it turned out to be a great entry into the monster park, albeit slightly off-balance . However, if you have not booked Evolve in advance of the release by grabbing the Monster Pack, you will have to shell out the beauty of  14.99 to take the creature home as a single DLC. A decidedly monstrous price that will not fail to discourage the less passionate especially given the absence of new modalsty. The mechanics behind the game always remain the same and if you were burned by a first test of Evolve, these two new DLCs will not change your mind. However, the four hunters and the Colossus have proved to be very pleasant additions, capable of introducing each in its own way of small variations within the class to which they belong, differentiating themselves positively from the past. Sunny is perhaps the weakest of the group in this regard, and the Colossus now seems slightly ~overpowered~ compared to the other monsters, but nothing that can't be fixed along the way. The problem at this point is the price. The Colossus is definitely too expensive, but if you are an avid gamer you will not fail to take it home, as well as the hunters, which are less expensive and bring interesting news. For everyone else, wait for the discounts.", "date": "2015-04-03", "grade": null}