{"name": "Dark Souls II: Scholar of the First Sin", "ref": "https://multiplayer.it/recensioni/147690-dark-souls-ii-scholar-of-the-first-sin-anime-e-tormento.html", "text": "Dark Souls is without a doubt the most ambitious, demanding and therefore also promising project of From Software. A franchise that has been able over the years to win over a large and absolutely exalted group of fans, in love with its dark atmosphere, its game structure and above all its gameplay, attributable to the action-RPG genre with typically dungeon crawler elements, but with an above-average level of overall challenge. Of those perhaps not very sustainable for the average player, but able to leave enchanted, almost bewitching, the hardcore one, aware of the fact that a real feat is necessary to complete such an adventure, resulting perhaps more satisfying to face for this. It is no coincidence that the brand in question has now practically burned into the hearts and minds of many gamers as a synonym of complexity, as well as quality. Dark Souls II: Scholar of the First Sin brings From Software's challenge to the new generation of consoles in this sense, and does so with a re-edition of the second episode, launched last year on PlayStation 3, Xbox 360 and PC, characterized by the presence of new content, some technical tweaks and the three DLCs released to date, namely Crown of the Sunken King, the second, i.e. Crown of the Old Iron King and Crown of the Ivory King, the third and last. Dark Souls II returns in a more complete edition for next generation consoles and PC The Dark Odyssey of the Cursed Even if there are no substantial changes in the story and in the unfolding of events, these small implementations are enough to try to reinvigorate a title that fully reproduces that excellent peculiar gameplay we were talking about at the beginning, and that Scholar of the first Sin manages to further enhance. In this sense, an important role is played by the sixty frames per second of this edition, which, although not always remaining fixed, have a positive, and quite a lot, influence on playability. Thanks to them, for example, users can count on greater responsiveness to the commands of their alter ego, which is therefore technically controlled in the old way (the commands are mapped as in the original, apart from the call up of the menus delegated to the touch pad ) but better, with greater precision in blows, dodges and moments of escape, but also on greater general fluidity. The crux of the experience obviously remains the combat, to be approached by paying particular attention to an infinite number of aspects, including the attack patterns of the enemies, their characteristics and behavioral routines, and the surrounding environment. The scenario, in fact, in itself can be a valid ally to get to the bottom of the clash, but also a dangerous obstacle if it is exploited to one's advantage by the antagonists. So moving with circumspection, analyzing the environment or defending yourself and attacking with the right timing, perhaps from behind, are fundamental elements for surviving and collecting the precious souls as a prize, essential for buying weapons or repairing them, for obtaining new items, spells and more . Conversely, haste or approximation is the ~best~ way to push yourself towards frequent deaths. The areas are changeable, and to cross them successfully without forgetting anything, it is necessary to explore every nook and cranny in search of useful objects, but also of gadgets, switches and mechanisms to activate, especially in the vicinity of some bosses. What better occasion to get distracted for a moment and be attacked by surprise? Even less powerful enemies, in conditions similar to those just described, can be a big problem. From this point of view it should be highlighted how From Software wanted to make things more complicated, not only by increasing the number of enemies on the screen, but also by differentiating the positioning of several creatures compared to the original title. Where once there was a huge armored knight, now there is a three-headed Hydra, where there used to be a handful of undead, now there are a dozen, or they are joined by other creatures. This new arrangement of the antagonists, another key novelty of this edition, completely changes the gaming experience, especially since all those areas considered relatively safe by players in Dark Souls II are no longer safe in Scholar of the First Sin. Any gameplay sequence therefore becomes extremely demanding, more than the original, because you never know what might happen as soon as you turn a corner, which and how many enemies will be waiting for the protagonist, effectively forcing the gamer to be constantly on the alert. Mors tua vita mea As per ruthless tradition, it is just when one least expects it that a suspicious noise can suggest the involuntary activation of a trap, or the sprouting of a large monster, irreparably throwing the user into panic. And if that weren't enough, you also have to deal with a new invader called Forlorn. Controlled by artificial intelligence, it invades the game acting like a real opponent would in a PvP. But unlike a ~human~ player, the Forlorn can show up in multiple spots, tenaciously chasing the opponent without mercy. On the other hand, there is also an important new character, the Original Sin Scholar, with whom you can interact before a series of then more dramatic events, to learn new details about the story. The latter is much deeper than it may appear at first glance, and can be understood through the dialogues with the NPCs, old and new, the description of objects and equipment, which boast new and more detailed lines of text, even if not always such as to be very clear, and other clues. Even the setting tells something. The cultural identity of the lost kingdom where the game is set, although it sometimes seems to lack transition places between one area and another, appears in this sense as a set of agglomerations with multiple layers, rigidly characterized from an iconographic point of view and symbolic. In short, From Software's intention is to further expand the fascinating universe of Dark Souls II and offer new content even to those who have spent hundreds of hours on the title on the occasion of its release. Among other things, this second chapter, in its definitive incarnation on PlayStation 4, remains in our opinion a bit less complex than the first Dark Souls (this could depend on the experience or not acquired with the predecessor), but at the same time superior to the original of 2014. A perfect product for those users always eager for new challenges, who never get demoralized or back down in the face of dozens of continuous deaths, difficult opponents and moments in which one would feel like throwing the pad against a wall, except then hold back, compose yourself and start again with the iron will to overcome obstacles. Dark Souls II: Scholar of the First Sin will give all these users a thousand satisfactions, allowing them to enjoy one of the most beautiful games of recent years. Imago mortis The greater power of the hardware available to developers is reflected in some game design choices also for multiplayer, where now up to a maximum of six players can be played simultaneously, instead of the four of the past. Unfortunately, as often happens when working on a game before it was released in shops, we were unable to fully test the mode due to initially unavailability of servers, and subsequently the lack of users. For these reasons we will limit ourselves to illustrating the characteristics that we have glimpsed or that have been reported to us by the publisher, leaving discussions on the goodness of the new matchmaking system or on the depth of the gameplay to other occasions. However, a mention is due on the screen for rapid transport between the bonfires, which now highlights the three areas where it is more likely to meet players, and on the novelty of ghosts that will remain in the player's world longer, without returning to their own if time runs out during a boss battle. Thanks to a new item, the Ring of Agape, souls recovered from kills in online mode will be absorbed by the item itself and not by the player. In this way, users will be able to control the allocation of network games by limiting the total amount of souls obtained. For the rest we cannot conclude our review of Dark Souls II: Scholar of the First Sin without having reviewed it from a technical point of view. In this sense, as it was logical to expect considering the starting point, there are no graphic upheavals, but a series of small changes and optimizations to make the visual system more pleasant. The increase in resolution to native 1080p, a greater depth of field, the addition of a handful of new textures and some enhanced effects still improve the quality of the graphics, returning a more solid, defined general image, all to the advantage of those more evocative environments, such as Drangleic Castle or the Desolate Wharf, and those atmospheres adopted by the developers to recreate a fascinating, albeit terrible, world from an artistic point of view. The lighting system has also been revised, which does not make you cry out for a miracle but is capable of beautifying the exteriors by making them brighter. Many of the original surfaces such as rrocks, expanses of sand or ruins at a certain distance appear transformed by the new model that manages the light sources, taking advantage of a series of micro-contrasts of chiaroscuro even in small objects. Likewise, the interiors boast a good use of ambient occlusion and of effects such as the movement of the flames of the torches, which, driven by the wind, illuminate the ravines in a slightly more dynamic way, contributing to some interesting shadow effects. However, in contrast, several elements of the scenario appear to be lacking, suffering from angular lines and, up close, from the presence of fairly dull textures in the rendering, and the definition of other boundary objects. One example is water, which still has a too thick and oily appearance, and vegetation, which is often flat and anonymous, especially when it covers large spaces or, in the case of climbing plants, the walls of buildings. In short, aesthetically the game has certainly improved compared to the original title, but remains far from the potential of current consoles. As far as the bestiary is concerned, we can only exalt the beauty and variety of the enemies, whose design is inspired as always by Western fantasy imagery, even if often reworked with that typically Japanese taste for the fantastic. Everything then runs at sixty frames per second, with occasional and very brief drops only on a few excited occasions, but which do not particularly affect the general fluidity, nor are they annoying to the point of negatively affecting the gaming experience. The audio sector is beautiful, of great variety and atmosphere, which fits perfectly in every moment of the adventure, adapting to the most disparate needs, and proving to be of great versatility even during fights. Finally, the English dubbing is good, accompanied by Italian subtitles.", "date": "2015-04-02", "grade": "9.0"}