{"name": "Orizzonti criminali", "ref": "https://multiplayer.it/recensioni/147623-forza-horizon-2-presents-fast-furious-orizzonti-criminali.html", "text": "Quickly becoming a cult favorite, as well as the goose that lays golden eggs for Universal Studios, the Fast and Furious film series - seven main features, a spin-off and a couple of shorts - has given car enthusiasts a solid reason to return to the cinema, placing four wheels at the center of the stormy life of Dominic Toretto's ~extended family~, the wiry Vin Diesel. Although the original conception, based on modified cars and clandestine races, has veered in favor of a much more profitable (at the box office) action derivative in a Hollywood sauce, with explosions and improbable sequences not even James Bond, racing cars have always represented a main ingredient of the recipe, which has come to embrace even more exotic supercars. To promote the launch of the latest film, in Italian cinemas starting next Thursday 2 April, Universal Studios and Microsoft have entered into an interesting agreement, by filtering the spirit of the saga into the award-winning Forza Horizon 2, among the best - if not the best - arcade-style racing games never produced. To make things big, the two entertainment giants have not limited themselves to producing a simple themed DLC, as you see so many based on film licenses, but a real stand-alone expansion has been created, capable to express the remarkable videogame skills of the PlayGround Games work declined with the style of the film. For players, the most intriguing aspect of the aforementioned agreement is the distribution method, which provides for the free release on the Xbox store until April 10, to then move on to the more canonical 9.99 Euros. After taking a deep dive into it, here's what we think of the new Forza Horizon 2 expansion. The Fast and Furious 'Family' is asking the Horizon Festival for help New cars, same emotions Unlike the delicious ~Storm Island~ expansion, of which you can read our review by clicking on the following link, in the 15 GB of data that make up Forza Horizon 2 present Fast and Furious, unfortunately, there is no space for a new setting, but an taken from the main map of the game, about a third of the total (135 roads out of 315) which embraces the city of Nice, the provincial roads in the Saint Martin area, the port and the airport. In a nutshell, the French portion of Mediterranean land conceived between the real and the fictitious by British developers. The play base is practically the same as Forza Horizon 2, with the addition of a single, interesting novelty which we will discuss shortly, however, the player, instead of running to conquer fame, cars and bracelets within the Horizon Festival, is contacted by a member of the Toretto gang, for the recovery of ten racing cars linked to a mysterious mission. The shady figure mentioned above is none other than Tej Parker, a character played by the actor and rapper Ludacris, also voiced in the game by the very nice and competent Oreste Baldini. The cars, of course, are hand-in-hand with the film series, but beyond some models that have made the history of Fast and Furious, such as Dominic Toretto's Dodge Charget R/T and the Toyota Supra, they are all part of the ~cast~ of the seventh film. Among them we find the inevitable American muscle cars, such as the Plymouth Cuda and Road Runner, very fast exotics like the Nissan GTR, Bugatti Veyron and McLaren P1, the brand new and splendid Maserati Ghibli S, and a couple of ~armored~ vehicles complete with bull bar, or the Dodge Challenger R/T and a Jeep Wrangler Unlimited that looks like it just came out of a battlefield. Curiously missing is the Lykan Hypersport, protagonist of the film's trailers and one of the most expensive cars in the world (about 3.5 million dollars). It all begins on the sunny streets of the Cte d'Azur aboard a splendid Lamborghini Huracan, when you are contacted by the aforementioned Tej, who, realizing our skills as a skilled driver, wishes to involve us in the dangerous mission. To ~recover~ the various cars it is necessary to go through the disciplines that we have already appreciated in Forza Horizon 2, from simple clandestine races in the city, where the vehicles are raffled off in pure Fast and Furious style (at least that of the origins), to iconic Cross Country races, but there is no shortage of ~crazy speeds~ to be reached by passing in front of speed cameras, signs to be destroyed and so on. The challenges to conquer a single car can be divided into two or three parts before the owner puts them into play, moreover there are also peculiar modalities such as having to beat other means of transport (a classic of the Forza Horizon series) and the recovery of a so-called ~forgotten jewel~. Beyond the races linked to the main plot, with the good Oreste Baldini who accompanies us up to the spectacular final challenge, optional competitions characteristic of the Horizon Festival are also available, such as the destruction of twenty specific signs and some unmissable challenges, where it is It is possible to get behind the wheel of other cars not related to the film saga, such as the Lamborghini Huracan (official testimonial of Forza Horizon 2 on the cover), the Mitsubishi Lancer and the evil Ford RS200.In the expansion there is also an online mode that can be unlocked after recovering five of the ten cars, and works similar to the one in the base title. One more push Although the cars relating to the mission are taken from the movies and there is the constant presence of Tej Parker, the references to the film saga are actually few and rather diluted: for example, only on one occasion is one of the other members of the ~Family ~, a clear tribute to the figure of Brian O'Conner, the character played by the late actor Paul Walker, who died together with a friend in a frightening road accident on November 30, 2013 in California, aboard a very fast Porsche Carrera GT. The other citations present are linked to the soundtrack, with only the radio station (called Satisfy) broadcasting the songs from the film, and to the objectives, which sometimes have the same names as phrases that have entered the hearts of fans, such as the famous ~Vivo la my life a quarter mile at a time~ by Dominic Toretto. In this regard, we remind you that the thousand points of the objectives are easily conquered, furthermore the expansion is intimately linked to the Forza Hub App, contributing together with the main titles of the series to the so-called Tiers and related prizes that can be collected from time to time. much. As far as the actual gameplay is concerned, the only change compared to Forza Horizon 2 is the introduction of nitrous oxide or NOS (Nitrous Oxide Systems), a consumable boost to be used on the straights that adds an extra pinch of pepper to the challenges, paying homage to the beginnings of the film saga. Overall we are faced with a very interesting expansion, much more substantial than the demo released at the launch of the game and which will keep you busy for a few hours before reaching 100% completion. Missing it right now, while it's free, is a real crime, especially for those who don't yet own the splendid Forza Horizon 2.", "date": "2015-04-01", "grade": null}