{"name": "Funky Business 2.0", "ref": "https://multiplayer.it/recensioni/147560-the-sims-4-al-lavoro-funky-business-20.html", "text": "As we had anticipated with our tried and tested, this first expansion of The Sims 4 finally allows us to support our Sims in three unprecedented careers, scientist, detective and doctor, plus the possibility of managing our own business. Obviously, alongside these innovations, the multitude of new objects present in the Build and Buy modes and in the editor must be included, some available immediately and others that can only be purchased after reaching a certain level in active careers. After many hours of play, here's what we think of the offer contained within the package. Lots of new features and exciting additions with The Sims 4: Get to Work Active careers The active careers, with the necessary professional differences, are all structured in the same way, also presenting some additions to the game interface. In the upper right part an events interface has been added where the daily objectives will be reported: in fact, during each working day our Sim will have to perform a certain number of tasks which, once completed, will yield promotions and extra compensation and everything will go resolved in a limited period of time, although we will have the possibility, by clicking on the stopwatch to the right of the goal completion bar, to leave work early or stay late. This obviously involves moving from one lot to another (from home to work), but they won't be the only moves we'll make given that some situations envisaged by active careers will lead us to undertake others. In the lower left corner of the screen, however, we will continue to see our Sim, the list of shares and family funds, but with some small additions: if your family has more than Sims in it, you can still view all the members and by clicking above one of them give him the commands to develop a skill, take care of himself (in case the indicators of needs are not at the maximum) or you can choose to pass control of that Sim. Another important element in the interface is the notebook, available in the appropriate section inside the smartphone, where your Sim will write down all the notes necessary for the active career he is following and depending on the chosen profession, different notes will be marked. Entrepreneurs of themselves If on the one hand the three active careers do not present any changes or novelties compared to our previous experience made with ~Al Lavoro~, during the review phase we were able to delve a lot into the management dynamics of the store. First of all, it will be necessary to take possession of a shop, buying it or building it from scratch, and then transferring a sum to start the business: when your family owns one (the business is in fact ~registered~ to the family nucleus and not to a single Sim, this means that we will be able to have both a job and a separate professional career) a button will appear next to the sum of Simoleons in your possession that will allow you to transfer the proceeds from the shop to the family wallet and vice versa at any time because it could happen that the first sum for starting up the shop is not the only one that you will transfer from the family fortune to the shop coffers. In fact, this could happen due to bad management and a consequent indebtedness of the business: if you don't have the money to pay your employees or manage maintenance costs, your business will be closed immediately and reopened only after you have paid all the your debts. If you decide to sell an established business, the proceeds of the sale will automatically be paid into the family account, but if you try to get rid of a debt-laden business you will have to pay the difference out of your own pocket. The hub of all activity is the cash register and by clicking on it we will have the following options: set shop prices, i.e. decide whether to see the goods at a normal, high or sale price, buy advertising, choose employee uniforms , open and close the shop, activate or deactivate the ~for sale~ indication on all the goods (although we can decide to put or remove a single item from sale by clicking on it), manage employees, transfer shop funds and sell the activity. Managing employees is an extremely important task for the success of the business and it will be up to us to decide whether to hire or fire a Sim based on three fundamental characteristics: sales, i.e. the ability to relate to customers and convince them to buy, maintenance, then replenish the shelves of goods and provide for the order and cleanliness of the premises, and infine professional ethics, or the propensity to idle during working hours. Last important point concerning the management of the shop are the extras. Extra points are purchased by achieving a certain number of optional objectives in managing your shop and can be used to purchase bonuses, accessible from the ~Shop~ panel in the lower right corner of the screen. Some bonuses are permanent, such as the ability to increase the number of employees you can hire, while others are temporary: these only affect the Sims who own the shop and not the employees. Photographs, selfies and some problems Another very important object with its own functioning is the camera, which, however, deserves an in-depth study of its own. This object can be used by our Sims both for leisure and for work and the more photos we get, the more experience our Simmer will acquire: in the ~Entertainment~ section of our smartphone, we will find the ~take a selfie~ option, otherwise we will be able to use a real camera, which you just have to buy in the Buy section and put it in your inventory. By clicking on it we will be able to use our camera by switching to shooting mode, a first person view that will allow us to capture anything, allowing us to act directly on all the instrument's parameters such as inclination, zoom and flash. Combined with the background for photographs, the camera can become an excellent tool for starting an activity or it can become a very powerful method for recalling certain memories: in fact, photos can be converted into memories, to which an emotion can be associated and recall the mind the subject of the photo every time you look at it. It is also possible to convert photos taken with the C key on the keyboard and by selecting the item in the ~View commands~ menu at the top right. Unfortunately, as we had already ascertained in the testing phase, the community lots of active careers cannot be visited outside working hours and cannot be viewed in the three districts, therefore you will be able to see the whole surrounding environment but the special lots will never appear in the neighborhood, resulting in ghost buildings. Furthermore, the new district, Magnolia Promenade, has only four default lots, three of which are already occupied by shops, decidedly few for a new district: decidedly few for a self-respecting district.", "date": "2015-03-30", "grade": "8.5"}