{"name": "Ad un passo dall'eternit", "ref": "https://multiplayer.it/recensioni/147557-pillars-of-eternity-ad-un-passo-dalleternita.html", "text": "It's always fascinating to delve into and discover the background that sometimes surrounds software houses, publishers and more generally the development process of a video game. And the story of Pillars of Eternity, but above all of its developer, Obsidian Entertainment, is one that leaves you breathless. After making a name for itself in the industry by releasing, in just over ten years, a large number of role-playing games belonging to the best-known sagas, from Fallout to Knights of the Old Republic, via Neverwinter Nights, Dungeon Siege and South Park, the Californian company suddenly found itself risking bankruptcy due to a huge and expensive project canceled by its publisher a few months after its arrival on the market. And so, as bankruptcy was dangerously approaching, Feargus Urquhart, the founder, Chris Avellone and a handful of other industry veterans rolled up their sleeves and decided to offer the idea behind Pillars of Eternity to the public. , at the time Project Eternity, asking for support through a Kickstarter campaign. And there was the miracle. With more than four million dollars raised overall, compared to the single million requested, the project became the second most funded video game on the crowdfunding platform (behind inXile Entertainment's Torment: Tides of Numenera) and after two and a half years of development and a couple of betas, the game has finally and incredibly hit the market. And it literally kidnapped us. Obsidian's new RPG is as classic as we could expect. This is good! Is it all new?! We could write tens of thousands of characters to tell you what Pillars of Eternity is and above all what our experience with the game was but we will try, in this review, to be as concise as possible and to go straight to the point so as not to risk running into in spoilers or drag you too long on these pages. Let's start immediately by saying that Obsidian's new work is a classic, uncompromising role-playing game that tries to retrace the footsteps left in the history of the genre by the legendary titles made with BioWare's Infinity Engine: from Baldur's Gate to Icewind Dale passing for Planescape: Torment. Precisely with the latter it seems to have several points of contact starting from an enormous focus on the dialogues and the depth of the narrative sector and for the choice of a setting far from the classic Forgotten Realms. But if in the case of Planescape it was still a setting extracted from Advanced Dungeons & Dragons, in Pillars of Eternity the universe is absolutely new, designed and created by Obsidian himself. So a completely brand new story, real-time gameplay but where tactical pause is essential and used practically during every fight and dozens of hours of gameplay within a new fantasy setting but influenced by some classic canons of the genre. There is really no need to ask for more if your goal is to find yourself catapulted, in an instant, into a historical period where the plot was the master, you found yourself reading thousands of lines of texts and risked stay entangled for hours in a single fight or in an attempt to explore every corner of a dungeon or forest. In short, if it weren't clear yet, Pillars of Eternity is absolutely not a game for everyone, but those looking for this type of gameplay risk finding another title in their hands which, along the lines of what happened in recent months with Divinity: Original Sin and Wasteland 2, and for some also with Dragon Age: Inquisition, could give him great satisfaction and suck him in for dozens of hours. After a quick prologue that also serves as a tutorial, the story will develop unexpectedly and full of tantalizing elements and even with some twists. The story manages to adequately avoid the usual clichs of the genre, focusing on quite new elements such as the subtle and meandering war between science and religion that seems to permeate the entire Forest of Dyr, the region where Pillars is set, a terrifying curse that is making the entire population sterile leading to the birth of children without souls, and a special power that the protagonist will have to manage and which will allow him to investigate the past lives of the characters he will meet on his path and on events that took place in other eras. Risking madness and detachment from reality several times. What distinguishes the narrative of the new Obsidian game is, as written above, the great focus on dialogues which on the one hand allow you to avoid fights and hostile situations or to deepen determinThese elements of the plot and, on the other hand, allow us to define the biography of the protagonist through a process of character growth that we will be able to influence through the answers we will give to the numerous non-player characters and which, at the same time, will contribute to determining the attitude of the NPCs in our comparisons. A sort of iterative process that will stimulate us to maintain a real role, as happens with paper RPGs, aiming at the coherence of our alter ego. Furthermore, the Obsidian guys have seen fit to insert a little gem borrowed from the game books: during the scripted sequences or on the occasion of some interactions with the environment, the game will show us the pages of a book complete with hand-made drawings hand, offering us some choice options for the actions we can take to carry on the sequence. These actions will be determined both by the statistics of our characters and by any objects we have in the inventory and may also have negative results. Nothing is created, nothing is destroyed? And since we have mentioned some crucial elements of the gameplay such as statistics or inventory, let's talk in detail about the role-playing and more properly ~playable~ elements of Pillars of Eternity. Invariably the title opens with the character creation phase. Also in this case, as for the story, completely new and original elements are grafted onto the classic stylistic features of the genre. We will therefore find six races ranging from the usual humans, elves, dwarves, but also introducing the Aumaua, giants with vividly colored skin, the Orlan, the exact opposite that are so reminiscent of the halflings and the Deiforms, particular entities that half belong to the other races but have such deformities that they look like children of gods or, for many of the NPCs you'll meet, mutant aberrations to be exiled. The same can be applied to the eleven classes from which we will be able to choose and which include warriors, druids, monks, wizards, thieves and so on, flanked by more unedited archetypes such as the bard who sings during combat, enhancing allies and cursing his opponents or the cipher, a sort of cleric who can exploit the souls of enemies to summon powerful spells. The peculiarity of Pillars is that to differentiate the classes are only the special skills or talents, not the skills in weapons, fighting styles or armor: everyone can make and equip everything, simply some classes will have bonuses for certain types of attack or defense. Bonuses that can still be ~purchased~ during the leveling phase. Another element that highlights the originality of the Obsidian title and its nature as a new and entirely developed project without relying on pre-established universes is the particular management of the double system of statistics that determines the peculiarities of the characters. The six main ones concern the attack strength (there is a single value to determine melee, ranged and magical damage), the probability of hitting a target, the constitution and so on and they also have precise influences on all dialogues, but then there are five others that instead concern the ability to interact with the environment and to influence the resistance of the protagonists during the scripted sequences. For example, Pillars of Eternity implements a stealth system that allows you to outflank your opponents or find hidden traps and treasures, all values influenced by the stealth statistic, but it does not disdain to offer numerous closed locks and locked chests that can be broken into according to one's skill in dexterity. Or again, the athleticism and survivability values will make the characters, respectively, more resistant to fatigue and can have more benefits from the use of potions and food. But we could go on and on listing all the role-playing features implemented in Pillars of Eternity. The title, for example, offers two different characteristics to simulate a character's life points: stamina and health, with the first being consumed more quickly during combat and leading to the character's unconsciousness when it reaches zero, but it recovers in an instant at the end of the fight, and the second which instead can only be restored by resting in a tavern or by consuming a campfire (only a limited number can be brought and depending on the level of difficulty set), or by using specific consumables and determines the death of the character when it runs out. And then there are crafting and enchantments, accessible at any time of the game as long as atrue all the reagents required by the recipes, the possibility of managing various types of weapon sets for each character that can be changed on the fly during combat and also some quick-use items to be mounted on a limited number of slots since during battles cannot access inventory. Of course, there is also the management of the equipment for each character and there is a particular inventory system which is not linked to a maximum number of slots or to the weight of the objects but allows you to loot virtually any object found around the scenarios by depositing it in a chest or by keeping it handy in the bag, smaller and more limited, of individual party members. And the group represents a key element of the entire Pillars of Eternity experience given that its nature as a classic role-playing game so focused on the use of tactical pause naturally cannot do without the management of a party. In addition to our protagonist we will be able to bring with us and fully manage a maximum of five other characters who can be recruited with the continuation of the story or created at our total discretion within the tavern by paying a substantial amount of money. Incredibly much, maybe even too much In short, if you still haven't understood, Obsidian's new project is all about content: it's really huge and will be able to keep you glued to your monitors quietly for 60, 80 hours before you'll be able to complete it. Consider that, running a lot, it will take you no less than forty hours to reach both capitals of the game which act as collection hubs for an enormous number of quests that are divided between the main ones capable of carrying on the plot, the secondary ones and some, small assignments that can often be done within a single location. Pillars of Eternity is faithful to the titles with the Infinity Engine even in terms of maps. In fact, it is not an open world free roaming like Skyrim or like the next The Witcher 3: Wild Hunt but, as also happened with the recent Dragon Age: Inquisition, the game is divided into areas that must first be discovered and which can then be reached by navigating through a general map of the game world, after a short load. The peculiarity is that some of these areas are already known from the beginning, but most must be discovered by exploring a neighboring map and leaving one of the four cardinal points. We are talking about almost two hundred different locations and to these we also add a personal stronghold that will first be unlocked and then can be enhanced by paying hard cash and waiting for the passage of in-game time to have access to additional chests and small but substantial bonuses in case who decides to rest in the personal tavern. Furthermore, this area of the map also acts as an access to a huge dungeon, made up of fifteen different levels, full of objects and equipment and which ends with a fight with a very difficult boss. If we don't hurry to deal with it during the game, our stronghold will suffer constant attacks that we will have to keep at bay through specific constructions or by intervening personally. Pillars of Eternity can also be played with four different difficulty levels: the first three can be changed at any time, while the last, the most complex renamed Via dei Dannati, can only be chosen during game creation and never more modified. It is also possible to activate two options to make the gaming experience even more engaging and risky: on the one hand we have the possibility to eliminate any in-game help and overlays, on the other we find a sort of hardcore mode where it will be possible to use a single slot save game and if for some reason all party members die, the latter will be deleted, forcing the game to start from the beginning. Finally we have to talk about the level cap which is set at the twelfth level but with a particularity: Pillars of Eternity does not distribute experience for killing enemies and bosses but only and exclusively for exploration and the conclusion of quests making it very long the process of growth and above all the choice of the paths to follow is particularly reasoned. At this point in the review, however, it is necessary to stop for a moment and reflect on the negative points of the product, which have tended to remain unchanged since we talked about it during last year's beta. First of all it's always a shame to notice such a huge choice of variables regarding races, classes, stats and background", "date": "2015-03-30", "grade": "9.2"}