{"name": "Le Cronache di Narnia", "ref": "https://multiplayer.it/recensioni/le-cronache-di-narnia.html", "text": "Characters and control system Anyone who has seen The Chronicles of Narnia knows that this is not an action film, but the talented developers of the Travelers Tales team certainly could not produce a boring video game. And so the numerous filmed sequences, taken from the topical moments of the feature film, form the glue for a plot that is actually much more eventful than the one seen in the cinema: the Pevensie brothers will have to face all sorts of evil creatures, from simple wolves to dwarves, from orcs to minotaurs, from giants to werewolves. And they will not be small battles, far from it: as you approach the end of the game, the clashes will become really complicated. The player controls one of four characters and can switch at any time by pressing a back button on the pad. Each of the brothers has unique characteristics and special attacks: Peter is the strongest and is therefore more suitable for melees, Edmund has the ability to climb and has a good level of strength, Susan can hit from a distance (at first with balls of snow, later with a bow and arrow) and finally Lucy can heal others from wounds and can sneak into passages closed to others. It is possible to make two characters collaborate at the same time, creating even spectacular combined attacks: when Lucy and Susan hold hands, for example, they can cause a shower of flaming arrows to fall on enemies. Similarly, Peter can grab Edmund by the arms and spin him to hit opponents or even to destroy blocks of stone: that boy must have tough bones ... The most effective pair actions, as well as special attacks (obtainable through combinations of keys), can be purchased at the end of each level, by spending the money collected along the way. It is very important to collect all the coins when you have the opportunity to do so, because as you progress the game becomes decidedly less generous in this regard, not so much due to the amount of money present in the stages, but rather due to the impossibility of stopping at collect them when you have dozens of enemies on your tail. On the one hand, creating a tie-in ensures a certain amount of feedback, being able to count on the popularity of an upcoming film, on the other it proves to be a far from simple undertaking. Game structure On the one hand, making a tie-in ensures a certain amount of feedback, being able to count on the popularity of an upcoming film, on the other it proves to be a far from simple undertaking, in which failure is always around the corner. The obligation to make events coincide with what occurs in the original story can sometimes trap the player in situations that are far from desirable, but a great job has been done with Narnia. It certainly cannot be said that this title is free from the typical defects of videogame transpositions, but it is certainly one of the best exponents of the genre. The game structure, in this case, is far from linear and from time to time sees the presence of puzzles or skill tests: from the simple exploitation of the characteristics of the characters (Lucy who enters a narrow passage that leads her to dismantle an obstacle on the other side, for example) to real challenges against time (Peter who has to kill a certain number of enemies and then command the attack on the giants before they reach a certain area, with a sequence that repeats many times). To complete The Chronicles of Narnia a certain effort is made, not due to the number of levels available (average) but due to the increasing difficulty. Technical realization The qualitative level of the graphics is unfortunately fluctuating: the design of the titles and menus is decidedly mediocre, while what you see during the action is well made, with convincing and fairly detailed polygonal models, but above all with a great generosity in the number of characters moving simultaneously on the screen. This abundance, combined with the use of high resolution and a series of valuable special effects (lights and reflections), unfortunately has deleterious effects on the frame rate, which is stable but which probably does not reach 30 frames per second on PS2 ( the tested version). The sound sector uses the original music of the film (good, therefore), a series of standard effects and an excellent dubbing in Italian, which in some ways is even preferable to that of the film (or maybe you liked hearing speak Aslan as the Goldmember of Austin Powers). [C] Sometimes there are really bad encounters... Collaborating is the key to getting smarter solutions. effective. Better watch where you step on the ice... [/C] Multiplatform The Chronicles of Narnia is available for PS2, Xbox and GameCube. The version for the Sony console is as usual the weakest from a technical point of view, in particular as regards the frame rate and the definition of the graphics. Comment The Chronicles of Narnia is a well-made, playable and fun tie-in, which moreover is aimed at a more adult target than the film, given the difficulty of some passages. Technically almost flawless, unfortunately it suffers from some flaws regarding gameplay: collision detection is often problematic, and when you are literally surrounded by dwarves, minotaurs and giants it is far from ideal. Furthermore, in moments when the action becomes frenetic, there is a slow and not very faithful response to the commands. Apart from these drawbacks, the latest Travellers Tales title has proved to be a solid and pleasant product, which will not fail to involve those who have been fascinated by the story of the Pevensie brothers. Pros: Valuable technical realization Voiced in Italian Very engaging and challenging Cons: Collision detection sometimes problematic Response to commands not always ready Some passages are really hard To escape the threat of World War II, the Pevensie siblings (Peter, Edmund, Susan and Lucy) are sent to a distant relative. The four boys, however, would never have imagined that their new, large and cold house could hide inside, in the form of a wardrobe, the gateway to a fantastic and disturbing world: Narnia. It is the youngest of the family, Lucy, who is the first to discover the existence of the passage: having arrived on the snow of that place so cold and mysterious, she is welcomed by a friendly satyr named Tunnus, who ends up almost betraying her and handing her over to the Great Witch Bianca, who took the throne of Narnia without having the right, after the disappearance of King Aslan. By chance, soon Peter, Edmund and Susan also reach Narnia and are made aware of an ancient prophecy: only the arrival of Adam's two sons and Eve's two daughters will be able to drive away evil from the enchanted kingdom. And so there will be a lot of beating, you got it right.", "date": "2006-01-13", "grade": null}