{"name": "Soul Hackers 2", "ref": "https://multiplayer.it/recensioni/soul-hackers-2-recensione.html", "text": "When the award-winning Persona 5 Royal and its two predecessors also arrive on Nintendo Switch in the coming months, owners of the hybrid console will be able to boast a library that includes some of the best RPGs of recent years. Shin Megami Tensei V, however, for the moment remains an exclusive of the Nintendo platform and perhaps it is for this reason that Eiji Ishida and Mitsuru Hirata, who had already worked on Tokyo Mirage Sessions #FE, have decided to resurrect Soul Hackers.Originally between the sequels of Devil Summoner - also in this case it is a series born from a rib of Shin Megami Tensei - Soul Hackers dates back to 1997 and was only recovered in 2012 for a Nintendo 3DS edition. That seemed to be the end of it, when instead, surprisingly, Atlus decided to relaunch the brand, stripping it of any subordination. Whether this operation was successful or not, we tell you in our review of Soul Hackers 2, which we played in the PlayStation 5 version. A supernatural thriller Soul Hackers 2, Milady belonged to the Phantom Circle To understand and identify a title like Soul Hackers 2, it is important to look at the RPGs that have relaunched Atlus internationally, after years of niches and hard cores. Soul Hackers 2 is an absolutely autonomous product, which has its own dignity, but the matrix is so unmistakable that one cannot ignore it: the combat system - called Press Turn - is the classic one focused on the strategic composition of the party and on careful choice of vulnerabilities and resistances. On this skeleton Atlus has built a family tree of series and counter-series, which have found their maximum expression in the recent Persona 5 and Shin Megami Tensei V. They are apparently very similar titles that diverge in focus: Persona 5 is strongly narrative, so much so that could compare to a visual novel, while Shin Megami Tensei V sacrifices exposition at the altar of gameplay. Soul Hackers 2 carves out its place in the middle. The first Soul Hackers had already been conceived as a kind of detective story implanted in the backbone of Shin Megami Tensei: the post-apocalyptic setting gave way to more urban situations and a less philosophical and more science fiction drift, and Soul Hackers 2 faithfully resumes precisely these unique characteristics, which are perhaps also the ones that best distinguish him in his extended family. There is no need to know either Devil Summoner, or have played the first Soul Hackers; the new story is completely autonomous and very understandable in its own right, and takes place in an imaginary future in which technology has managed to encode myths and legends that the so-called ~summoners~ can call up to fight through electronic devices called COMP.When the sect of summoners known as the Phantom Circle begins a plan for the destruction of the civilized world, an artificial intelligence called Aion generates two charming avatars, Ringo and Figue, to prevent the catastrophe. Soul Hackers 2, not bad as a start There are two considerations to be made on the narrative of Soul Hackers 2. First of all, we immediately anticipate that we liked the plot in and of itself and also a lot. It's crazy in the right place, very disturbing, and full of unexpected twists. There is a real sense that Atlus has combined the mature and apocalyptic themes of Shin Megami Tensei with the more intimate and meticulous writing of Persona, while not exaggerating one way or the other. The problem is that the gameplay, as it has been structured, dilutes the narrative too much, limiting it in the spaces between the very long dungeons that mark the progression. Based on the rhythms and skill of the player - as a good megaten, Soul Hackers 2 is decidedly challenging already at the default difficulty level - several hours can also pass before the story resumes its course, especially if the plans of the Soul Matrix. Soul Hackers 2, the combat system is a variation of the classic Press Turn In fact, the summoners that Ringo will recruit in his battle are interesting and multifaceted, but their background can only be discovered in the Soul Matrix, an optional dungeon that is not exactly optional. Divided into three macro areas, each made up of various floors, the Matrix of the soul basically has two functions: it serves to unlock the specific skills of Arrow, Milady and Saizo, together with Ringo's Commander skills; and then it serves to discover more about the lives of the three summoners, and the vicissitudes that led them first to their death, and then to their resurrection by the hand of Ringo at the beginning of the adventure. The Soul Matrix may seem like a dungeon accessory sinceits appearance - the scenarios are essentially identical - but in reality you end up in it more often and longer than you would like, even if only to complete the side missions of Aion, find new demons for the Grimoire or, much more simply, increase the level of the characters. Soul Hackers 2, characters summon demons with weapons called COMP The way the progression is structured and balanced, it's not like the player has much choice. The Matrix of the soul becomes almost an obligatory passage between one dungeon and another, breaking the rhythm of the narrative to sip dialogues and information that should serve to better understand the protagonists of the story. The problem is that, putting aside the Matrix, we end up closing certain conflicts prematurely, and this greatly weakens the impact of some scenes which, if proposed in a more organic and sensible way, would have been much more convincing. From this point of view, Soul Hackers 2 ventures a Persona-style approach, but less rigorous: to continue in the Soul Matrix it is necessary to increase the level of Companionship with the various characters, choosing the most appropriate answers when possible or participating in social events such as drinking in company, which in most cases are reduced to amusing gags, but which sometimes offer moments of interesting introspection. On the narrative front, it is important to underline that the many secondary missions of Soul Hackers 2 suffer from the fetch quests. Supported by specious subplots, they only serve to make us return to the dungeons to achieve certain objectives and collect rewards ranging from consumables to yen, passing through new demonic Fusions or accessories of a certain quality. Demons and labyrinths Soul Hackers 2, Ringo and Figue are artificial intelligences materialized by Aion Though thought up by the minds behind the quirky Tokyo Mirage Sessions #FE, Soul Hackers 2 is closer to Shin Megami Tensei than Persona in terms of raw gameplay. The combat system is in fact much drier, especially if we compare it to the Royal iteration of Persona 5 and represents a more intuitive variant of the famous Press Turn, probably designed to bring even less experienced players closer. The underlying mechanics are the usual, good or bad: the player can associate each character with a demon who will give him various bonuses to statistics, vulnerabilities and elemental resistances, as well as a pool of skills that he can use in combat. The Press Turn mechanism takes over as usual, but there is one important difference: neither the player nor enemies gain or steal turns by exploiting elemental vulnerabilities. Soul Hackers 2, the Grimoire includes old and new demons The right spells do much more damage if the target is vulnerable, sure, but the player gets an added benefit from this dynamic. In fact, every time you successfully exploit a vulnerability, you also earn a Combo point. At the end of the turn, if even just one vulnerability has been exploited, Ringo automatically launches a Tregenda, that is an attack that hits all enemies - similar to the Persona 5 Assault - and which inflicts damage based on the accumulated Combo points and the number of targets in the field. As you progress in the game, you also learn specific skills that can influence the Tregende, for example by attributing negative conditions such as Poison or Fear to the enemies affected, and this already demonstrates the importance of a mechanic which, once learned and assimilated, allows you to end the fights much faster. Soul Hackers 2, Tregends deal extra damage The combat system is all here. The dynamics are quite static from the beginning, and there are no particular surprises as the hours go by, except for Ringo's Commander skills, which can be used within certain limits and guarantee some advantages, such as for example the possibility of changing demons associated with characters during battle. That doesn't mean it's a disappointing combat system; on the contrary, we are sure that megaten fans will immediately recognize its strategic value, embellished with new demons and completely new skills that are worth thinking about at the time of the Fusion. But once the first hours of the game are over, a sense of monotony certainly takes over. The problem is not caused by the combat system itself, but by the structure of the dungeons that make the experience unnecessarily tedious. The maps consist practically only of corridors and dead ends that pass through occasional small rooms, and it is not surprising that Milady learns an ability that allows you to speed upand Ringo's movements during exploration. Sometimes backtracking can be heartbreaking. Soul Hackers 2, enemies are more or less vulnerable to different spells There are no sharp details in terms of level design. Some dungeons try to put a spanner in the works with mild environmental puzzles, but the feeling is that of playing an antiquated title, in this respect, especially when compared to the virtuosity of the most recent Atlus RPGs. During the exploration - however spoiled by an annoying angle of the shot, which can only be partially adjusted - the enemies manifest themselves in the form of shapeless shadows that we can stun or reject in real time, if we wanted to avoid the fight or start it with a small plus. Not being able to know which enemies we will face in battle, Soul Hackers 2 practically takes us back to the era of random fights, which we thought we had long since left behind. The dynamics within the dungeons, unfortunately, also affect one of the funniest aspects of the megatens, namely the Demon Fusion. The player, this time, has very limited control over the recruitment of demons. Defeating one with the Tregenda increases the chances of encountering it, but fingers crossed. Soul Hackers 2, social events increase the fellowship Long story short, at the start of each dungeon Ringo will send his demons out to scout. We will therefore find them around the map, taking the place of the more traditional chests, but sometimes, instead of giving us money or consumables, they will present us with one of the demons that roam the dungeon, giving us the possibility of recruiting him in exchange for a small sacrifice. The recruiting system is far too random. We do not know if and when we will happen to recruit a demon, much less which demon our followers will introduce us to. This makes Soul Hackers 2's collecting - and strategic - component extremely frustrating. It is possible to mark the demons encountered so that the game signals the potential clashes in which we can face them, which is also very useful when there are side missions that send us on the hunt for specific monsters, but the fundamental mechanism could have been calculated better. Soul Hackers 2, merging demons is always a lot of fun Also because the recruitment of demons is reflected in two other aspects of the gameplay, namely the micromanagement of the COMP and the Magic Crystals. COMPs are summoner weapons. At a certain point in the game, you learn how to enhance these weapons with a series of bonuses that not only improve their effectiveness, but also grant more proficiency in the use of the different elemental schools, granting the summoner the possibility of equipping Magic Crystals of higher grade. The latter are instead of the accessories that we can equip and that enhance the different elementary schools. There are Magiccrystals that increase the damage inflicted by Fire spells, for example, or that reduce their MP consumption. And the Magic Crystals are obtained by growing demons who, once they have learned each spell, will give us one at random. At a certain point in the game, the possibility of exchanging excess Magic Crystals is unlocked, but it is clear that the limitations imposed by the abstruse recruitment system are reflected in a whole series of very interesting dynamics and, in the end, on the combat system as a whole . Technical compartment and DLC Soul Hackers 2, the neighborhoods of the city are full of details It is a pity that Soul Hackers 2 is betrayed by an antiquated and unreasonable structure, because the technical sector is decidedly more brilliant, if it weren't for a problem that we want to address immediately: the dungeons, again. They are just plain ugly. As we have said, they are composed of corridors that cross to form real labyrinths, but they are also not very inspired from a purely visual point of view. The urban setting certainly imposed limits, but the developer, in this sense, did not try very hard, and the result is a variety of environments that really leaves something to be desired, especially if we consider the time spent in these scenarios . It's a shame, because it's enough to stick your nose out of the dungeons, and perhaps visit one of the city's districts - accessible from a simple list map - to be catapulted into a riot of bright colors and minute details. Soul Hackers 2, the city map Closed this parenthesis, Soul Hackers 2 is a title that is certainly appreciated. Shirow Miwa's character design is convincing, and the demons of this iteration could easily be our favorites: they haven't changed their look, obviously", "date": "2022-08-18", "grade": "7.0"}