{"name": "A domanda rispondo", "ref": "https://multiplayer.it/recensioni/145999-trivial-pursuit-live-a-domanda-rispondo.html", "text": "After having cheered us with the discreet transposition of the famous Monopoly, of which you can read our discussion by clicking on the following link, Ubisoft and Hasbro are back on track again, together, with another ~big shot~ of board games, or that Trivial Pursuit which, for over 30 years now, has been putting a strain on the brains of millions of families around the world with its general knowledge quizzes. Among the most popular and famous exponents of the genre, capable of registering good sales despite the (voracious) video game market having literally exterminated many of its kind, Trivial Pursuit, for some, during moments of aggregation has turned into a real customary, similar to the aforementioned Monopoly or the more popular Christmas bingo. The executives of the French publisher and the American toy giant must have thought it was a good and right thing to translate it into a renewed digital version, like Monopoly: Family Fun Pack, and thus Trivial Pursuit Live! was born, a product exclusively designed for the digital market, with an affordable price and for all Sony and Microsoft branded consoles, both current and old generation. We put the PlayStation 4 version to the test and these are our impressions. The famous Trivial Pursuit translated into a curious and tight digital TV show! Different twins Do you know the Trivial Pursuit board, with its elegant colored cards, dice and iconic cake-shaped placeholders? Well, forget almost everything, because the video game transposition of the game created by the three Canadian boys Chris Haney, John Haney and Scott Abbott, conceived way back in 1979 after a close challenge to Scrabble, does not have the same dynamics seen in Monopoly: Family Fun Pack and Trivial Pursuit by Electronic Arts (2009), where painstaking replicas of rules and elements of the board game are re-proposed, but transforms the challenge into a sort of modern television quiz, without however including the cumbersome presence of the presenter, delegated by a punctilious female voice overs. Gone cards, dice roll and board, the only recognizable visual element of the Trivial Pursuit are the circular placeholders, in which, exactly as in the original work, the colored wedges conquered must be positioned by answering the questions exactly, divided into the classic six categories , or Geography (blue), History (yellow), Art and Literature (brown), Hobbies and Sport (orange), Entertainment (pink) and Science (green). The main menu looks very similar to the one already seen in Monopoly: Family Fun Pack, with a handful of items ordered in comfortable square and rectangular sections; among them there is access to the Hasbro Channel, the online rankings, an overview of the player's profile, the so-called achievements, the game options - where you can also consult a simple tutorial - and of course starting a new game. both offline and online. Playable for up to four players, with artificial intelligence (in three different difficulty levels) ready to replace any vacated seats, matches can be played in the best of three or five rounds, and the winner is decreed in based on the number of wedges won: whoever reaches six first wins the challenge directly, however, if the rounds end without a player being able to fill the cake, whoever has the most wedges wins or, in the event of a tie, whoever has the highest score. The questions are not proposed according to a single scheme, but in six different ways drawn at random, with the exception of the peculiar final round that closes all the games: in Scattista a sequence of multiple choice questions is proposed, where the correct answers earn more points when you give in series; in Swap Agoria players can take turns selecting the category relating to the set of questions, and you get more points by answering exactly those of your selection; Head to Head offers a list of items of different ~quality~, which must be selected and sorted according to a precise reference (for example, the countries with the most births or the cities at the highest latitude); finally, in Surprise Fishing, a board with eight correct and eight wrong answers is proposed, and one takes turns selecting one box at a time. Surprise Fishing Blitz and Head to Head Blitz are variants of the two basic versions, while the aforementioned Final Round offers a series of quick questions related to all six categories, in which it is easier to win wedges but also to end up out of the game if of incorrect answers. According to the official press release issued by Ubisoft and Hasbro, Trivial Pursuit Live! offers a set of over 1200 questions, more than enough to guarantee a good variety in the first few weeks of the game, nevertheless, as happens in all quiz games, whether they are digital - like Buzz! and Nat Geo Quiz - or in a box, over time questions already seen re-emerge, to be replenished with possible expansions. As specified, the title is playable up to a maximum of four players, and offline it is also possible to change hands even a single DualShock 4, although this solution involves some limits in the rounds that provide for simultaneous response. It goes without saying that Trivial Pursuit Live! you give the best of yourself playing with friends and family on the same sofa, even for a purely ~logistic~ reason; although online matches are rather fun, close and extremely competitive, the risk of drawing disloyal and incorrect opponents is decidedly high. In most cases, in fact, by keeping an internet-connected device at hand, you have plenty of time to do quick searches with Google, distorting not only the single game, but also the online rankings that can be viewed in the game's main menu. In short, as it is sadly known, the opportunity makes the thief, and given the diffusion of cheaters and unfair people who proliferate on the servers, this detail must also be taken into account, since it is impossible to control or prevent others from cheating. It should also be noted that, at the moment, the servers are not crowded with players, and often you end up playing one-on-one with other lone wolves. Finally, the absence of invitations in matchmaking and the impossibility of creating a private game to play with friends on your list are questionable, aspects that force you to face only strangers. For a handful of wedges Given the peculiar nature of the game and the rather low price, i.e. 14.99 Euros for the latest generation consoles and 9.99 Euros for Xbox 360 and PlayStation 3, we are certainly not dealing with a product that aims to show the claws of Sony flagship, like the recent and discussed The Order: 1886 by Ready at Dawn, nevertheless there is clearly too much lightness placed in its aesthetic component. If in Monopoly: Family Fun Pack we particularly appreciated the physics of the placeholders and dice, as well as the animated reconstruction of the game board, in Trivial Pursuit Live! the television studio that forms the backdrop to the challenge and, above all, the protagonists who populate it, not only sin for style and charisma, but also show the side to some rather evident technical criticalities. Beyond the annoying and inexplicable drops in frame rate that are revealed during the opening shots of the show, the models of the eight available characters are decidedly stingy with polygons, suffer from aliasing, have lackluster textures and feature woody and conceptually dated animations . Fortunately, however, these are side elements in a product of this type, and the screens relating to the questions are instead clear and quick to understand, even for those who have never held a joypad in their life. Too bad that the questions and answers, with the exception of very rare cases, are never accompanied by photographic documentation or video clips, as seen in other similar products; they would undoubtedly have enriched the spectacularity and personality of the playful experience. The technical picture is completed by simple but effective sound effects, a soundtrack worthy of a classic TV quiz and a decent Italian dubbing for the commentator, who emphasizes the various phases of the matches. The translation of the questions and answers is also good, and we only noticed a small typo on a couple of occasions.", "date": "2015-03-25", "grade": "7.0"}