{"name": "Il prezzo dell'immortalit", "ref": "https://multiplayer.it/recensioni/147150-blood-glory-immortals-il-prezzo-dellimmortalita.html", "text": "A few days after the Dungeon Hunter 5 review, here we are talking about another exponent of the action RPG trend for mobile devices, in this case produced by Glu. We are talking about Blood & Glory: Immortals, the last episode of a series that so far had grappled with a fundamentally different genre, that of Infinity Blade-style gestural fighting games, but which has decided for this new chapter to follow in the footsteps of the Gameloft-branded franchise , catapulting us into the scenario of an ancient Greece taken by storm by the same gods who should protect it. No dungeons, therefore, but completely open environments, organized in ~watertight compartments~, with walls of fire that stand in our path to prevent us from proceeding where there are still enemies to be eliminated. Walking between columns and long stairways, smashing barrels and chests to collect any objects, our goal in the game is to defeat all opponents and go from one mission to another, gradually accessing new areas and paying particular attention to crafting to get an improvement in the characteristics of the character. One of the advantages of Blood & Glory: Immortals undoubtedly lies in the possibility of switching at any time, from the options screen, to one of the three classes that can be selected at the beginning, namely warrior, sorcerer and barbarian. Inexplicably, it is the latter that has ranged attacks thanks to the throwing of a double ax, whereas the sorcerer beats his opponents with a stick and the warrior uses a powerful sword instead. Choosing one avatar rather than another actually produces big differences in the approach to matches, also because the warrior is the only one who can parry (complete with a devastating counterattack, if done with the right timing), while the barbarian and the sorcerer have a sort of ~teleportation~ which however turns out to be less reactive than the standard dodging seen in the aforementioned Dungeon Hunter 5. The touch controls of the Glu title are undoubtedly better, since they make use of a virtual stick which repositions itself every time we rest our left thumb on the screen, as well as a fairly large set of buttons on the right side of the touch screen. The sensation of impact is also better, with each blow being accompanied by a slight ~slowdown~ which makes the most of its strength and gives great satisfaction during combos. Then there is a whole system of special abilities, active or passive, which contribute to enriching the repertoire of the three characters, providing them with spectacular and devastating manoeuvres. An excellent action RPG, then? Unfortunately not. Blood & Glory: Immortals starts well, but after a while the limits of the freemium approach become evident Grinding madly The balancing of the difficulty of Blood & Glory: Immortals leaves much to be desired, with invasive freemium mechanisms that force an almost infinite and decidedly boring grinding in order to aspire to overcome even just the first ~world~. The initial missions run like a pleasure, the combos and counterattacks are appreciated, the yield of the shots is excellent and the system appears rather generous in giving coins, experience points, objects and new skills to learn. Just like in Dungeon Hunter 5, the weapons and armor collected in the scenarios can be equipped (where they are better than those in use) or fused to enhance the objects in our possession, which once a certain grade has been reached will instead be ~evolved~ through the use of particular catalysts. This part of the experience works well, using a fairly clear interface, even if the various swords and armor end up looking a bit too similar, to the detriment of visual variety. The problem is when it comes to clashing with the ~divine~ bosses and with the missions that require a certain level of experience, because at that point you are literally forced to repeat the stages already done dozens and dozens of times; dragging the opponents along like a speeding train, given the enormous imbalance that has arisen in the meantime, and obtaining less and less rich prizes, which clearly slows down the growth process and tends to create a lot of frustration. In short, one gets stuck in an extremely repetitive and bite-free loop, all to force the user to buy a pack of diamonds, unlock the traditional ~random~ chests and hopefully obtain some quality objects to use in order to to move on. It's really a shame that the developers have used such a limiting approach, because otherwise there is very little to say: in addition to solid gameplay and a fairly multifaceted combat system, Blood &Glory: Immortals also boasts a respectable technical sector, with stable sixty frames per second (on iPhone 5s) and an excellent level of detail of the settings, even if the artistic direction generally appears not very inspired.", "date": "2015-03-21", "grade": "6.8"}