{"name": "Generazioni di eroi", "ref": "https://multiplayer.it/recensioni/146710-oreshika-tainted-bloodlines-generazioni-di-eroi.html", "text": "It is always surprising to see how Japanese role-playing games manage to remain one of the most loved genres ever today, after so many years after their widespread diffusion in the West. And it is even more surprising to note the effort of some Japanese software houses in trying year after year to make them always attractive, even with small tweaks, without however distorting the classic stylistic features of jRPGs. Oreshika: Tainted Bloodlines by Alfa System, which comes to us only in digital format, falls in some ways into this category, since despite being a typically old-fashioned RPG, with turn-based combat and anime-style characters, it tries to add some perhaps not very original elements, but still good for varying the experience and making it different from the livable ones by playing other similar productions. And here between the creation of a clan with which to fight against evil forces for decades, the need to procreate children, the strange way of obtaining the rewards at the end of the battle and the refined artistic style adopted for the graphics, irons on the fire for defining the game as ~particular~ is enough. A clan of cursed heroes fighting in a medieval fantasy Japan: Oreshika: Tainted Bloodlines In saecula saeculorum The plot tells of a cursed lineage of warriors destined generation after generation to fight a fearsome demon to obtain revenge after a tragedy that struck them in the summer of 1118 in Kyoto. However, the group of heroes has a double, terrible sentence upon them: the first requires them to die after a maximum of two years of life. For this reason, in addition to always giving their best in every battle at any cost, its members must think about procreating heirs before their departure, in order to give continuity to the family. But here the second curse comes into play: they are unable to father children with other humans. However, there is the possibility of making them with the gods. Therefore, once the gamer collects the appropriate points, he can spend them in the so-called Rite of the Divine Union, an event that allows the characters of the house to marry with the gods of the opposite sex, largely inspired by Japanese mythology. The unborn children, who will enter the clan a month after their birth, will therefore inherit some of the characteristics of their parents, such as the physical ones, but also the elemental affinities, the special techniques and the personality. Much will depend on which part of the mother's and father's genetic heritage will be more dominant in the child. Obviously, as per tradition for the genre, training, the level of experience acquired over time by the hero, the equipped objects, and so on will subsequently also have their weight on certain parameters. The one just described is one of the two key elements of the gameplay of Oreshika: Tainted Bloodlines. The other is the passage of time, which affects the progress of the game. Months go by, seasons change, and everything you do on a given day, from exploring an area to traveling to another location, affects certain elements and future generations. Among other things, this parameter can be changed at the start of the game by selecting the difficulty level of the adventure. In fact, each of the five degrees present affects aspects such as the resistance of the enemies in a different way, the percentage of experience points obtainable after each battle, the aforementioned passage of time and so on, consequently determining the overall duration of the game , which can thus vary from a minimum of thirty hours to a maximum of one hundred. And since there are so many things to do in Oreshika, the user worried by the idea of having to manage and plan too many situations can rely on the expert hands of the nice Kochin, an anthropomorphic girl who in the clan headquarters, practically the hub of the entire adventure, acts as a guide and ~assistant~ to the gamer, and is always generous with useful advice. PSVita trophies The game offers 48 Trophies divided as follows: 38 bronze, 6 silver, 3 gold and 1 platinum. Surprise enemies with an ambush at least 200 times, bring a clan member to his maximum level, discover 500 treasures, defeat ten thousand demons or play for 100 (virtual) years are just some, in order of increasing difficulty, of the actions to be performed to get rewards. Art in motion For the rest, everything takes place in a way not dissimilar from the classic dungeon crawlers: you have to provide for the needs of the clan members, making sure you have weapons, armor, healing items and other useful material available, to buy around the game world, but also powerCreate structures essential for the life of the group such as temples, inns, shops and armories in your own village. And above all explore long dungeons where it is easy to get lost since there is no precise direction to follow, full of objects to recover, chests to raid and enemies to face. These are clearly visible on the screen and once you touch the appropriate figure that represents them (if it happens from behind you can initially attack them from behind) you enter the combat screen. There are four party members who can be deployed on the field at the same time (plus two on the ~bench~), placed in front of or behind the opponents, with the enemies placed in as many portions of the scenario. Depending on the class they belong to, party members can perform actions and attack opponents in relation to their weapon, skills, Secret Arts and position on the field. At the beginning of the game, in fact, the user is asked to create the first three elements of the group, including the leader, by choosing their name, gender, facial features (you can use the PlayStation Vita camera to model your face on it), and precisely the class among the eight available, which include among others those of Swordsman, Martial Arts Master and Demon Summoner. You must therefore pay attention to the characteristics of each individual of the party in correlation to the type of enemies and the conformation of the terrain if you want to get to the bottom of a battle. The battle system, while referring to the classic tradition of turn-based battles, as mentioned at the beginning of the review, however, introduces a very special feature. At the beginning of the fight, in the lower part of the screen, a horizontal menu appears that brings to mind a sort of slot machine in which the names of all the objects and coins owned by the Oni rotate: those on which the rotation stops could build up the user's loot in case of victory. ~They could~, because at that point, once the battle has begun, he must quickly decide whether to focus only on the enemy leader, in order to kill him and recover the items in question, or attack all the opponents to also get experience points and so on , but with the risk, if he fails to eliminate everyone in time, of seeing their leader flee with the booty. The player has the task of making the choice he deems best at the moment. Moving on to analyze the technical part, the artistic direction of Oreshika: Tainted Bloodlines is precise and quite spot on. From the very first image, the game screens bring to mind the works of Katsushika Hokusai, one of the masters of ukiyo-e, a genre of Japanese artistic printing on wood blocks that flourished in the Edo period between the 17th and 20th centuries, and those of some paintings by Toshinobu Yamazaki. Wandering through caves, dungeons, forests and desert areas, or watching the semi-static cutscenes on the small screen of PlayStation Vita feels just like observing a series of pictorial illustrations. In short, the style adopted by the Alfa System graphics fascinates, like the soundtrack that accompanies the various phases of the game, which is in turn strongly inspired by the classic Japanese sounds, with the addition of the spoken word in the original language. In this sense, it should be highlighted that the game is not localized in our language, not even for the subtitles, which could keep those who don't know English, French or German well away.", "date": "2015-03-19", "grade": "7.8"}