{"name": "Il tormento della colpa", "ref": "https://multiplayer.it/recensioni/147010-tormentum-dark-sorrow-il-tormento-della-colpa.html", "text": "Tormentum - Dark Sorrow throws in your face the cultural humus from which it was born right from the title, which also clarifies the main theme of the entire game. Playing the role of a faceless and nameless hooded character, tormented by guilt, you must reach a statue placed at the edge of the world in search of lost awareness. At the beginning what we will call for convenience the stranger is thrown in the cell of a nightmare castle awaiting the final judgment, accused of crimes that will be clarified only in the finale. Doesn't the visual style remind you of a metal cover? Impossible not to immediately notice the refinement of the graphic style, a very successful mix between Hans Ruedi Giger and the classic vision of metal record covers, with strong references to titles such as Dark Seed and a whole series of symbolisms that mix mysticism and surrealism. Dark and decadent environments alternate on the screen, supported by titanic figures whose origin seems lost in the mists of time. In short, what better scenario for a point and click adventure? The stranger has no great powers, except his wit. Exploring the various environments he will have to behave like any Guybrush Threepwood and get busy looking for objects, using them in some way and solving Professor Layton-style mini-games. There are two types of puzzles: the classic puzzles that require the use of objects, and the equally classic week puzzles, with codes to decipher, combinations to enter, images to reconstruct and so on. The difficulty level of the puzzles is medium-low and it is difficult to get stuck thinking about what needs to be done to continue, also because the various documents scattered throughout the game fill you with advice and often give the exact solution to the puzzles. In short, when you don't know what to do, you just need to explore new environments to find the solution we were looking for. It is an approach that veterans of the point and click genre will love little, but which makes the OhNoo Studio title truly accessible to anyone. We reviewed Tormentum - Dark Sorrow, a game that reflects on guilt and the search for redemption Moral choices It is clear that the goal of Tormentum is not to embarrass the player but, on the contrary, to allow him to follow the story told in the most fluid way possible, so as to fully experience the system of moral choices that characterize it. Tormentum is full of impressive creatures When it comes to moral choices in graphic adventures, Telltale's vast production immediately comes to mind, but don't be misled. As in the titles of the American software house, the choices made in Tormentum will have strong repercussions on the story, but when all the threads are re-knotted, one will realize that the goal they had was decidedly different. The ending, which will reveal all the secrets of the stranger's journey, will be born from the choices made, which however will be divided in two with the hatchet, sanctioning what is right and what is wrong. It's probably a less hypocritical way of dealing with the problem of moral choices, ie it doesn't leave the player with the illusion of having decided something, but puts him in the role of mere executor of an already written plot whose result is fairly obvious. Thus the choices lose their libertarian aura to turn into mere tests to be overcome, subjected to very clear judgment criteria, as becomes crystal clear if you decide to play a second time to see the other ending. In this sense, Tormentum doesn't try to transform its story into a unique experience, but explains exactly what the player must do to get the desired result. Moral choices are completely untied by the player to inevitably end up tied to the game, of which they become objects like others. Including the make-up, one can feel deceived and perhaps experience the final twist with heaviness, even though one understands its inevitability.", "date": "2015-03-19", "grade": "7.0"}