{"name": "Neverend - Recensione", "ref": "https://multiplayer.it/recensioni/neverend-recensione.html", "text": "Game structure What is immediately evident is the lack of general attention to detail; with discreetly created scenarios and barely passable three-dimensional models (it will take little to discover that almost all human characters share the same facial skin with very few variations); with forced and often badly translated dialogues (the game is completely localized in Italian, for the record) and with a script that leaks everywhere. But let's proceed calmly without rushing too much; we have far too much room for criticism and we certainly don't want to consume them all in the second paragraph. The control system is simple and intuitive. In addition to the keys assigned to the movement, there is one to perform all the actions, one for the inventory, one for the summary sheet of the character, one for the book of spells and one last to exit all the other screens. The use of magic is very simple: just find a parchment with a spell written on it and use it to write it on the book of magic. Below the transcribed spell will be indicated the runes needed to create a charge and the number of charges available. The combat system is instead a mirror copy of that of any Final Fantasy. You act on the basis of turns determined by the consumption of a blue bar next to the hit points of the characters (both those led by the player and the enemies... of course they could have put other references so as not to get confused when deciding who to attack). When the bar runs out for the first time, you can ~declare~ your action which will be performed after the bar runs out a second time, at which point you can also declare the next action and so on. The available actions are few and very classic: attacking with the weapon you are holding by exploiting its characteristics (different types of attack can be carried out depending on the weapon and the degree of specialization with it); use magic; vary the priorities of attack and defense; use an inventory item; escape from the fight. The dialogues often border on the surreal. The special effects of the spells are nothing special. They could also put a shred of map, in vast and anonymous locations like this one easily loses orientation. At what stage is the night? But let's get back to the actual game. During the first short section of the adventure, in addition to enjoying the first fight and creating the first two spells, we will be able to recruit a travel companion who will accompany us for a short distance. Leaving the camp where we had taken refuge with the group of bandits now dissolved, we will find ourselves in a forest. The view will change: from a third person similar to survival horror with detailed 2D locations and side-viewed characters, we will switch to a bird's eye view in which to move in a completely 3D environment. It will be by taking the first steps that the spell will vanish and the flaws of Neverend will show themselves in their most macroscopic and dramatic dimension. Neverend tries to mix the visual imagery of Western fantasy with an exploration and combat structure derived from Japanese RPGs. The end result, despite the good intentions, is devastatingly scarce. At what stage is the night? Every good role player who finds himself on a path that enters a forest does not follow the path slavishly but sets out to explore the forest. Every good RPG knows that exploring a forest can involve three situations: encountering enemies, finding treasure, and getting lost. In order not to fall into the third situation, the good role player always has his good more or less detailed map at his disposal. Unfortunately the developers of Mayhem (the authors of Neverend, of course) must not be good role-players since they didn't think of introducing a shred of map into the interface. But the enemies are there, one might say with a grin. The guffaw can be explained very quickly: encounters with enemies occur randomly and are so frequent as to be unbearable. Just to give an example, it happened that, going around a small rock, he met two groups of them. This is not only ridiculous, but it also quickly becomes rather boring, especially when, as you level up, the weaker enemies start to award few experience points. If we then decide to link the continuous encounters with the lack of a map, we would obtain that ultra-fragmented exploration easily leads to getting lost, especially in larger environments and with few points of reference. In addition to the random fights there are also some fixed ones that happenThey are especially when trying to get treasure. In this case the enemies we will face will be clearly visible a priori. Unfortunately, while the random encounters are fairly balanced and simple, the fixed ones are harder. Often too hard. Having very powerful enemies immediately available could be a good spring to push us to retrace our steps, when we will be able to face them. Even in this case, however, what appears positive at first glance is overwhelmed by problems deriving from how it combines with other elements. First, you can't know in advance the strength of the enemies who are protecting a treasure. This involves having to face them by force to know who is facing you. If the enemies turn out to be at our level there will be no problems in doing so, however if their strength is much higher than ours, we will almost certainly be wiped out before we can escape. What did it cost to equip the character with a way to know the level of visible enemies in advance? Why do I have to get swept away to know who I have in front of me? Why would I even come back to fight them later (with an adequate strength level), risking starvation since you will have to face dozens of low-level opponents crowding the area? And it doesn't end there To increase the sense of frustration and disgust there are other details of no small importance. In the first place there was talk of companions to bring along. Well, know that these are not directly manageable (except in combat) and that, once dead, they cannot be resurrected; this thing that will lead to reloading the last save made several times in order not to lose their help. Secondly, speaking of uploads, we come to another sore point: the instability of the game. What does the instability have to do with loading? Simply said: Neverend has the very bad habit of returning to the desktop without giving any warnings of any kind (at least, for the computer on which the test was carried out it is like this... something like this may not happen to everyone but it cannot be unreported ); you will therefore understand how the quick save option is necessary in order not to lose the progress made. I found myself saving after every fight for fear of seeing my desktop again shortly thereafter. Now... If it were up to me, I'd forget to talk about the technical side, so as not to further rage on a title that can be safely avoided and forgotten. For the sake of completeness, however, I must tell you about the mediocre three-dimensional models of the monsters (of those of humans I mentioned above), the bland effects of the spells, the very poor animations, the crackling and always inadequate sound effects, the anonymous (but let's say passable) music and who more has more to put. To save themselves are the fixed screens of the more adventure moments and some rather well-made textures. A little bit would be to say... The fixed locations are the best thing about the game. At the umpteenth random encounter you will shut down the computer out of boredom. To recover energy and spells, you can use it. sleeping in a tent (if available)... does that remind you of anything? Hardware boxes The requirements necessary to run Neverend are quite limited: a 600 Mhz CPU, 128 MB of RAM and a 32 MB 3D graphics card. The system on which it was tested is a 3.4 GHz P4 equipped with a Geforce 7800 GT and 2 GB of RAM. Obviously there were no problems with fluidity, even if, as reported in the article, returns to the desktop were very frequent. Final comment Neverend has no justification. Someone could appeal to the small production that doesn't have the means of the big ones, but this excuse would be minimized by the many shareware games released this year that are clearly superior. Only buy it if you are a masochist and have broken your cat o' nine tails. Pros Price Quite long-lived You might like the setting, even if very stereotyped Cons Game design Technique (graphics and sound in general) Add another among the many defects indicated in the article as you like If a good day starts in the morning Neverend tries to mix the visual imagery of Western fantasy with an exploration and combat structure derived from Japanese RPGs. The end result, despite the good intentions, is devastatingly scarce. The game begins with a (bad) movie made with the graphics engine, in which we see bandits celebrating in front of a chest full of gold coins. After the revelry everyone goes to sleep, except two who decide to steal the stolen goods and also to take a jewel in possession of what will be the protagonist of the whole adventure. With the awakening of Agavaen (the name of the heroine) you can begin to control the action by becoming familiar with the few necessary keys (there is also a very simple and practical tutorial that allows you to enter the game without any difficulty) and interacting with the other two remaining bandits in the field in order to find out what happened.", "date": "2006-01-10", "grade": null}