{"name": "Final Fantasy Type-0 HD", "ref": "https://multiplayer.it/recensioni/146801-final-fantasy-type-0-hd-un-altro-tipo-di-final-fantasy.html", "text": "Son of a long and complicated gestation, Final Fantasy Type-0 is another game signed by Square Enix which, over the years, has changed its identity several times. Originally dubbed Final Fantasy Agito XIII, the project directed by Hajime Tabata was supposed to be a spin-off of Final Fantasy XIII, being part of the same plan called Fabula Nova Crystallis as also the former Final Fantasy Versus XIII. But then Final Fantasy Agito XIII came out on PlayStation Portable rather than mobile phones, and changed its title, just as Final Fantasy Versus XIII became the next Final Fantasy XV for next-gen consoles, while Final Fantasy XIII earned two sequels that divided audiences and critics. In all this, Final Fantasy Type-0, despite the good success it had at home, never arrived in the West, and all hope now seemed lost until, last year, Square Enix did not intimate the group of fans who were preparing an amateur translation to cease all activity. In short, the creature strongly desired by Tabata, the same creator of the excellent Crisis Core: Final Fantasy VII and of a new line of all ~action oriented~ Final Fantasy, would also have arrived in the West, and not as a simple porting, but in remastered: a trend that nowadays seems to be spreading more and more among software houses and which occasionally allows us to play, or replay, real pearls. But does it also apply to Final Fantasy Type-0? Or did the decision to attach a playable demo of Final Fantasy XV to the first editions of the game only serve to push the sales of a title that would otherwise have remained on the shelves, despite the high-sounding name? It won't really be next-gen, but Final Fantasy Type-0 HD is an RPG to be reckoned with Nine, nine and nine The first ten minutes of Final Fantasy Type-0 HD are nothing short of unsettling, even for a veteran of the Square Enix series. The very long introductory film, in fact, presents us with a dramatic scenario: flames everywhere, destroyed buildings, corpses scattered everywhere. The land of Orience has been at war ever since the Empire of Milites, led by Supreme Commander Cid Aulstyne, launched an attack on the Dominion of Rubrum with the express purpose of seizing its crystal. Orience, in fact, is divided into four main nations that keep a crystal each: Milites and Rubrum, as mentioned, but also Concordia and Lorica. To put a stop to the massacre, Class Zero takes care of it, a special team of very powerful cadets trained in the magical arts inside the Peristylium of Rubrum, a sort of university that studies and protects the nation's crystal. The twelve members of Class Zero are also our protagonists, and they are soon joined by Machina and Rem, two students who do not know that they have much in common with Ace and the others. Well, mostly they don't remember, because the crystals of Orient cause the living to lose their memories of the dead, thus strengthening them by preventing them from being held back by regret and longing. Does it seem ruthless to you? Final Fantasy Type-0, in fact, is the grimmest, most violent and bloodiest chapter in the historic saga, and it is no coincidence that ample space is given to war in all its facets, almost more of a protagonist than the cadets of Class Zero. In fact, they don't all enjoy the same attention in terms of script: the Ace/Machina/Rem triangle is preponderant, needless to say, and some other characters manage to snatch a sufficient ~screentime~, but others have few jokes or a role very limited in the economy of the narrative, even compared to some supporting actors or enemies. The story, in any case, is one that is not easily forgotten, rich as it is in epic and shocking moments, embellished by the musical accompaniment of the talented Takeharu Ishimoto: naturally the war for the crystals takes a much more elaborate turn already in the first chapters, especially when the l'Cie begin to peep into the events. The use of the lore established with Final Fantasy XIII - for example, the crystals choose individuals and give them enormous powers, as long as they pursue the mission entrusted to them at the cost of their lives - at times it seems a bit forced, mostly because it is a less tested mythology than the classic one with the Espers and, precisely, the crystals, but in the economy of the story it works better than it did in the Lightning trilogy where, paradoxically, it was a key element from the first episode, although it is necessary to use the in-game glossary to better understand some key concepts. Finally, it should be emphasized that Final Fantasy Type-0 should be played at least twice, given that once the first playthrough is complete, it isblocks another enriched by narrative sequences that delve into the story and some characters, clarifying motivations and events that seemed inscrutable on the first go: it's a mechanism ~alla Nier~ that unfortunately works and doesn't work, alienating those players who maybe don't really want to start the adventure all over again. I thought I saw Zack When Hajime Tabata started designing Final Fantasy Agito XIII, he did it based on the structure of his previous Crisis Core: Final Fantasy VII, and made it possible to play it even in short time intervals. That's why Final Fantasy Type-0 does not follow the plot of the gameplay typical of many jRPGs or Final Fantasy in general, divided as it is into not too long missions and interludes that can be articulated at will. Everything revolves around the Peristylium, where Class Zero ~lives~ between one main mission and another: in these situations Final Fantasy Type-0 draws heavily on the culture of Personas and Ateliers, with a limited amount of free hours to disposal of the player, who can consume them by wandering around the world map, interacting with some characters or undertaking simple and repetitive killing or recovery missions. The secondary activities, needless to say, are used to earn experience points and collect objects and consumables, but also to deepen the knowledge of our supporting actors or the events of Orience. Once you've run out of free time, the alarm sounds and you have to tackle the next main mission, and this usually means getting out of the Peristylium and reaching - on foot, on chocobo horse or, later, on board an airship - the place where we will have to give them a thrashing to our enemies. From time to time, however, we will also have to conquer or re-conquer the cities of Orience in skirmishes reminiscent of real-time strategy and which, honestly, we could have done without: they have all the air of a hasty experiment, thrown out just for the sake of it. give some variety, which mostly shows inexperience. In these situations, in fact, we will have to engage the enemy units that move around the world map, supporting the allied ones and deciding the platoons to be deployed in battle through an inconvenient menu. Thankfully, as well as being frustrating, they're also short. The traditional missions are still the heart of the game, set in short dungeons that remind us of the original portable nature of Final Fantasy Type-0: they are segmented into loading micro-areas and corridors, in which we will face enemies as we advance towards the goal. This is not just any Final Fantasy, but a strongly action title, in which the player controls one of the three members of Class Zero deployed in battle, choosing in real time the actions corresponding to the joypad buttons: one key to dodge, one for basic attack (which can usually chain into a combo) and the other two for special attacks or spells. A convenient lock-on system allows you to lock onto one target at a time and follow it more easily while zigzagging from one point to another to avoid opponents' attacks as much as possible: the difficulty of Final Fantasy Type-0 is definitely above average even at the lowest level, which was added afterwards for this remastered version precisely because the players of the Japanese edition had complained about the particular ruthlessness of some clashes. The reason also lies in the leveling system, decidedly devoted to grinding: only the characters who defeat the enemies gain experience points, while those on the bench remain inexorably behind. The fact that you can change them at any time during the missions is relatively helpful, since alternating them is mathematical that everyone gains less experience, and focusing on a few characters in particular is equally harmful. The difficulty of the clashes, then, is calibrated upwards precisely to induce the player to replace the fallen fighters with those on the bench: although only three heroes are chosen, as soon as one is defeated - which occurs with alarming frequency, begin with the fact that, having accepted a secondary task, the price of failure is paid with death - it can be replaced immediately with a reserve, while an optional obscure option allows you to temporarily replace the deceased companions with anonymous students of the Peristylium who are practically clones able to offer temporary support when everything seems to fall apart. It is no coincidence, therefore, that the combat system, frenetic and sufficiently complex, relies on a key mechanism based on the player's timing:in the moment an enemy attacks us, in fact, for a very short moment an indicator will appear that allows us to defeat the target in one fell swoop, or to inflict very heavy damage in the case of the toughest bosses. At the beginning it is not easy to take advantage of this bizarre counterattack system, but in advanced missions it becomes imperative to abuse it in order to avoid exhausting the members of Class Zero ahead of time, in the most classic of Game Over. Fortunately, the cast is also quite varied from a gameplay point of view, since each character plays completely differently from the others. Ace, for example, fights at medium distance by throwing his tarot cards and preparing ~decks~ with the most disparate capacities. Eight, on the other hand, attacks enemies in melee with punches and kicks, in a slightly less elegant way than Nine, the current ~dragoon~ who wields a spear and can leap on enemies' heads. Even King and Cater, despite both using guns, have abilities and attacks that require different approaches, and the same goes for support characters like Deuce and Rem. In short, the variety in terms of skills and spells is enormous, thanks also to a dual upgrade system. The points earned by leveling up can be spent on buying new characters' abilities through a not exactly intuitive interface, to begin with: it's an upgrade system that is not particularly original, but it does its duty. The High Crystarium, on the other hand, allows you to consume the phantoms absorbed by defeated enemies to modify the various spells by altering their cost, range and other parameters. Finally, we add the Espers, or the traditional ~summon~ of Final Fantasy, which work here in a rather brutal way: summoning one means instantly sacrificing a member of the group. At that point, the creature controls itself as if it were any character for a limited period of time, and each Esper - including the inevitable Ifrit, Shiva and Odin - can be upgraded in turn, in order to prolong its presence or unlock new ones ability. Playstation 4 trophies To earn the platinum trophy you must first unlock 38 bronze, 9 silver and 2 gold trophies. Obviously most of it is obtained by progressing in the story and completing various main or secondary missions, while for others you will have to work hard, performing particular actions in battle. Re: mastered Anyone who buys Final Fantasy Type-0 HD must do so in full awareness that the game is by no means a next-gen title, despite running on PlayStation 4 or Xbox One. For the next-gen there is the Final Fantasy XV demo. The suffix HD is very clear. Relentless on the gaps in terms of graphics or gameplay would not make sense, so we will limit ourselves to judging the quality of the facelift operated by Square Enix which, to tell the truth, is a bit fluctuating. Aware that we were playing a PSP title, we never trusted in a miracle, otherwise we would have been talking about a remake, not a remastered. The low quality of some polygonal models, however sporadic, didn't break us down, especially if we consider that the Tabata team has adapted most of the models that appeared in the cutscenes in the PSP version, much more detailed, and has implemented effects and lighting based on Final Fantasy XV technology. In short, the result is an old-gen/next-gen hybrid that doesn't disappoint, but which sometimes betrays its origins more than necessary, especially in the field of textures, when it shows off some very low resolution ones that clash like a punch in an eye, for example in the bare and rough world map. It happens more often than we would have liked, and together with the not always very fluid animations of the characters, and the recycling of the enemies that we will face for the thirty hours necessary to finish the first game, one often feels suspended in time, but callus. The problem, if anything, is the schizophrenic camera that follows the action: too sensitive, it swirls around our character, when fully controllable, and causes a sickening blur effect in the background. During the fights it throws into total confusion, which is why it is good to immediately hook the enemies in lock-on and never let them go. We have already spoken about the extraordinary soundtrack, so it is worth spending a few words on the English dubbing, characterized by voices that are not always very suitable for the characters, and on the Italian adaptation of the texts, which is really excellent.", "date": "2015-03-16", "grade": "8.0"}