{"name": "Hai cotto il razzo", "ref": "https://multiplayer.it/recensioni/146760-flop-rocket-hai-cotto-il-razzo.html", "text": "Driving a rocket inside a cave full of obstacles and pitfalls is a bad idea in the real world, but vice versa it can prove successful in the magical universe of mobile gaming: or at least this is the hope of the Butterscotch Shenanigans development team - already authors of Towelfight 2 and Quadropus Rampage - who now present themselves with this Flop Rocket, or rather their very personal interpretation of the endless runner genre. From caves to stars To be honest, Flop Rocket cannot even be considered an authentic member of the category, given that the path that the player has to face has in effect a conclusion, which can be reached after going through the five virtual kilometers of a randomly generated gallery in each game. However, this does not mean that reaching the finish line is a walk in health, also thanks to a series of tricks made by the developers that make the premium content offered by the application practically indispensable to anyone who wants to try to see the light at the end of the tunnel. But let's go in order, starting from a control system that manages to prove to be sufficiently immediate while leaving the door open to a considerable depth: pressing your finger anywhere on the touch screen activates the propulsion of the rocket, while moving the appropriate wheel located on the left of the display defines the trajectory angle and therefore the direction. Although it takes a bit of practice initially, everything works more than discreetly and in a short time you can appreciate the different nuances of the vehicle's behavior, giving gas and moving to a horizontal position when speed is needed and maintaining a tilt of 45 degrees with quick and frequent taps on the screen if vice versa the situation requires more precision at the expense of speed. The level design does its best to push the user to vary his approach, proposing stalactites and stalagmites to be carefully avoided and monsters to be overcome as quickly as possible, without however giving him the luxury of stalling too much: the rocket has in fact a limited fuel autonomy, and it is necessary to move without delay to reach the first useful refueling station in order not to risk arriving at a sad game over caused by the tank running out. Flop Rocket is fun and original enough, but the premium content is almost essential For the rest, Flop Rocket follows the typical dynamics of an endless runner: the game therefore ends when you crash into an obstacle and along the way it is possible to collect coins which form a total that can be spent in the upgrades available in the special in-game shop. game. Here you can improve various characteristics of the rocket such as agility, the thrust of the thrusters or the capacity of the tank: there are also eight other development branches, which however are reserved for subscribers of a premium package sold at a cost of  2.99 and which offers a whole range of advantages. This is the elusive ~trick~ we referred to at the beginning of the article, given that the improvements that can be unlocked upon payment turn out to be the most powerful and fundamentally indispensable for anyone who wants to try to get to the bottom of the five kilometers of the cave. Playing Flop Rocket for free is still possible, but it is also undeniable that without using your credit card you end up with a crippled title, almost as if it were a sort of demo version. That of the developers of Butterscotch Shenanigans therefore turns out to be a rather clear choice of field and which will certainly make more than one person turn up their noses, but which does not, however, completely affect the possibility of enjoying the game for free, albeit for a period of time objectively rather limited: without the premium content you can try to go as far as possible, completing in the meantime the missions that are randomly assigned by the software, but it doesn't take much to find yourself facing an insurmountable wall if not with the disbursement of the amount described above. In this case, Flop Rocket is fun while it lasts, thanks to its particularly fast pace and the aforementioned control system that paves the way for a decidedly stimulating level of challenge.", "date": "2015-03-14", "grade": "7.5"}