{"name": "La mia citt", "ref": "https://multiplayer.it/recensioni/146498-cities-skylines-la-mia-citta.html", "text": "You look around and you see nothing but a large green area nestled in the inlet of a large river. It is the initial scenario typical of every city builder. There is your first city, which you still have to shape. It's a game concept as old as SimCity, which has been interpreted in very different ways over the years. The perfect city builder is not the one who asks you to build a city, but the one who expects you to know how to make it work. You have to start looking at its streets as veins where the blood that allows the buildings to live flows. One of the major problems of the most recent competitors of Cities: Skylines is that they have largely lost the spirit that animated the progenitor, stranding the gameplay in an aesthetic of growth as an end in itself, useful more for selling extra content than for putting try the player in his role as a virtual mayor. In fact it is ironic that the true heir of the SimCity series arrives on the market in the week following the closure of Maxis Emeryville, a studio sunk by the bankruptcy of the last chapter, the one that was to mark its relaunch in the social world. Colossal Order wins by stepping back, not in the sense that it has given up social functions for Cities: Skylines. Indeed, perhaps there are many more than in the title of Maxis. Wisely, however, he did not force his hand by raping the core invented by Will Wright and associates to insert functions harmful to the gameplay, instead he exploited all the means at his disposal to enrich a winning formula that indeed needed modernity, but in a modality that did not dismantle the characteristic elements of the genre. In other words, there was a need for a game that would allow the player's vision to be transformed into pulsating life, while allowing him to develop it in a natural and thoughtful way, i.e. through realistic growth mechanics and not lapsed into ~farmvilization~. The city I want We start by building the first roads, connecting them to the highway where our first virtual citizens run. The game interface, briefly explained by text tutorials, allows us to quickly create an avenue with two crossroads. Empty squares are visible next to each street. These are the building lots that are automatically generated with the communication routes. Reasoning by reading the interface we decide to create habitable areas, then to distribute some areas for commercial activities. With part of the remaining budget we take another route, forming a series of square lots away from the residential areas. It's the perfect place to build our first industrial core! It only takes a few moments to see the first home grow: a single-family house with a nice little garden. Then a second one is built, then a third one, accompanied by the first shop and so on. Even the industrial area begins to develop... but what are those flashing icons on the houses? Lightning and a drop. We immediately sense the problems: there is no water and electricity. Citizens, rightly enraged, express their complaints on the local social network, whose icon is clearly visible at the top of the screen. It is an apocryphal version of Twitter, completely managed by artificial intelligence, where we can read the complaints and compliments of the citizens we administer in real time. Before the situation escalates, we pause the passage of time and look around us. Let's start with the water supply. Let's build a pump on the river and build pipes to get the water to the houses. Then we place a sewage outlet next to it, which is also connected to the water supply by pipes. The game is done. Now we have to choose how to produce and distribute electricity. Let's try wind turbines, which make noise but pollute less than other solutions. Unfortunately there is very little wind in the surroundings and it is difficult to find an area adjacent to the small urban fabric that has just been created that allows a good production of wind energy. We therefore decide to rely on a more traditional and polluting coal plant, which however we are sure will guarantee electricity to everyone, at least at the beginning. We place the generator in the industrial area, which is already so polluted by itself, and we build pylons to carry light to the houses, shops and factories. Cities: Is Skylnes the true heir to the SimCity series? Find out in our review The invisible cities Cities: Skylines grows with the player. Once the initial problems have been addressed, others will soon arise, which will accompany the growth of the population. For example, a small group of houses will not have crime problems, but in a city of cinhow many thousand inhabitants the problem will have to be managed with more impetus, building police stations and police stations. Soon it will also be necessary to worry about the education of citizens, by building schools of different levels, or to take care of safety, investing in firefighters and in social policies to reduce the number of fires. To the few houses initially built, others will be added. Many others. Those already present will increase in value. Stores will start asking for skilled workers, as will industries. The roads will become more and more busy and the viability will become a central problem, with the small and narrow streets initially built which will no longer be enough to contain the new flow of cars. How to fix? By building bigger roads, certainly, but also by enhancing public transport with buses, subways and trains. If you have a body of water to exploit, you can also build a port. The budget available will grow, as will the expenses to be incurred. If necessary, a loan can be requested, to be repaid in easy installments, or to be repaid in full in a single solution, in cases of particular economic prosperity. The important thing, mind you, is not to end up in the red. The city can be divided into districts and in each of them different policies can be implemented regarding energy consumption, water consumption, waste recycling (certainly you don't want your beautiful city to be filled with landfills, do you?) and so on . As mayors we will be given complete freedom to choose how to grow our metropolis, but we will never be left on our own, given that we will always have handy summary screens available that will allow us to immediately identify where the biggest problems are that displease the citizens. The city alive Soon we will be able to admire our colossal work with all its ramifications, neighborhoods and problems. Leaving the game and making the necessary comparisons with the competition, let's think of SimCity, but also of the very recent Cities XXL, it is easy to indicate the strength of Cities: Skylines: there are no easy and decisive solutions. An apparently optimal neighborhood for living can become problematic over time. In the other titles this is felt much less, with the cities becoming large cemeteries, albeit full of beautiful buildings. Instead, the cities of the title of Colossal Order remain alive even where all the problems of the moment have been solved, as indeed happens in every real urban agglomeration. The player never feels forced into the role of interior decorator, but remains careful in his role as mayor. Of course, there is no shortage of decorative buildings, such as the unique ones that embellish cities by following their logic, that is, unlocking themselves according to the objectives achieved. To say, an ecological city will have unique buildings that are different from a more industrial one, precisely in honor of its conceptual structure (who would build a monument to ecology in a highly polluted city?). What is written above do not make you fear for the worst, because Cities: Skylines is complex, but easily manageable thanks to an excellent interface, enormously more functional than the more essential but too cumbersome one of Cities XXL, and even better than that of SimCity. In short, Nordic rationality can be seen entirely, even if it is well mediated by playful needs. The result is that after a few hours of play you can manage each problem in a natural way, even when you find yourself handling new buildings, whose connections are in any case easy to understand thanks to the summary screens. This does not make you fear trivialization of the information provided to the player, because it is not so. Not only is it possible to access dozens of useful data for city administration with just a few clicks, but by clicking on each object, building, vehicle or person, you will obtain small and invaluable summary windows that will allow us to better understand what the areas where the level of satisfaction is higher, and those where instead discontent spreads. The dead City In the midst of so much magnificence, Cities: Skylines, however, does not lack some flaws, especially from a stylistic and visual point of view. Let's face it: some buildings aren't beautiful and, in general, the feeling is a cut below that of SimCity, a title that however had an enormously larger budget and a much more substantial development team (and it cost even more, let's face it). The aliasing problems are also evident, which you can verify by looking at one of the images accompanying the article. Nothing disastrous, really, but you pay attention, especially when you tell themThe size of the urban agglomeration is heavily approaching the one million citizen mark. On the other hand, you can't complain about the fluidity. On the test system, played at the maximum level of detail, the Colossal Order title never showed any signs of slowing down in the frame rate, even with the co-presence of thousands of buildings. It is not a small technical achievement, given that the Cities XL series took five chapters to become fluid, not even completely succeeding. We also mention another weak point of the game, namely the soundtrack, made up of bad music and well-made environmental effects and nothing more. Don't worry, we won't let the party be ruined by mediocre songs. Let's lower the volume of the music, play a record of our liking in the background and enjoy the magnificence of Cities: Skylines without thinking about it, waiting to see the first works of the users who will flock to the Steam workshop as soon as the game is available to everyone , given the presence of an excellent editor designed for the most willing and creative players.", "date": "2015-03-10", "grade": "9.0"}