{"name": "Un mini per due console", "ref": "https://multiplayer.it/recensioni/146325-mario-vs-donkey-kong-tipping-stars-un-mini-per-due-console.html", "text": "Mario Vs. Donkey Kong: Tipping Stars is a sort of revolution for Nintendo: certainly not for the content in the strict sense, since it is a decidedly faithful episode to the dictates of the series, but rather for the fact that the puzzle game in question is in fact the first title of the Kyoto house to offer a cross-buy function between Wii U and Nintendo 3DS. To the sarcastic smiles of those who, albeit rightly, remember that it is a sales method already extremely tested on other shores, it must however be said in partial justification of Nintendo that its two consoles have had far fewer opportunities for contact and overlapping than those, for example, from Sony. Where PlayStation Vita is in fact expressly a tool aimed at replicating a large part of the playful experience of the home console, the Nintendo 3DS is instead something different from the Wii U, both in terms of technical capabilities and philosophy. And in the face of the sales data of the two handhelds, it certainly cannot be said that it was such a bad choice, all things considered. The fact is that, especially for some indie titles or ~minor~ products, the entry into the field of cross-buy can only be seen favorably by Nintendo users, in the hope that it will be a turning point destined to solve more pressing problems such as account management disconnected from the physical console. Mario Vs. Donkey Kong: Tipping Stars is an enjoyable puzzle game that adds almost nothing to the series Old friends Closing the parenthesis, however, let's dedicate ourselves to Mario Vs. Donkey Kong: Tipping Stars for what it has to offer in the strict sense. As mentioned at the beginning, it is an episode that fits without trauma or jolts within the mechanics of a franchise that is now quite run-in and appreciated. Described in two words, it is the version of Lemmings in Nintendo sauce. Elaborating a little more, what is required of the player is to allow mechanical puppets with the appearance of Mario, Peach, Toad and company (the Minis) to reach the exit of each level safely. The main problem lies in the fact that you don't find yourself directly controlling the characters, who on the contrary in a totally reckless way limit themselves to continuing their path regardless of anything that comes before them; on the contrary, the gameplay requires you to manage a whole series of objects (self-propelled belts, trampolines, pipes, platforms, elevators, etc.), to be manipulated and placed correctly on the path of your precious friends, so as to pave their way to the door . Obviously everything is much easier said than done, because the levels are made in such a way as to make the task anything but easy: traps of all kinds and enemies to avoid or eliminate must be constantly taken into consideration, with a mental effort destined to grow as the progression brings with it ever more complex and elaborate situations. The greatest value of Mario Vs. Donkey Kong: Tipping Stars lies precisely in the gratification it offers to the player, in the sense of satisfaction once the maximum evaluation has been obtained in an area that has just been passed. This is because the puzzles, while not necessarily having a single solution, need precise planning to be completed in the best way, the one then rewarded with ~three stars~. The first phase of the game, that of study, analysis and elaboration of the level, must then be followed by a subsequent phase of rigid and scrupulous concentration in order to execute all the planned operations in the right way (and often very quickly). The puppets cannot be stopped, and the passing of time is a determining factor in the composition of the final evaluation; moreover, the collection of coins and tokens scattered around should also be considered, because they too are essential for obtaining the maximum score. In short, Mario Vs. Donkey Kong: Tipping Stars is a game that, behind a colorful aspect that recalls children's themes, on the contrary reveals itself to be complex, challenging and sometimes even frustrating. An open construction site Alongside the main mode, capable of offering a hundred levels of increasing complexity between standard and bonus worlds, Mario Vs. Donkey Kong: Tipping Stars also brings with it the editor - called Shipyard - already appreciated in the past and which is well suited to the context of the game in question. In fact, through it, it is possible to create your own more or less diabolical levels from scratch, to then be shared online with the Miiverse community. An interesting option which, if well managed and above all adequately supported, could significantly lengthen the legs of the product. To provide some stimulusin addition, in this sense, Nintendo has chosen to integrate a ~tip~ system through the stars previously earned in the main mode (hence the subtitle, in fact). In fact, you can give stars to other users as a reward for the quality of your creations, and the collection of these allows you to unlock further elements of the editor in a sort of shop. All in all an interesting idea, even if not very effective in the test of facts. We were also talking about cross-buy: in reality in Nintendo's vision, and also due to the current account limits, this function does not happen automatically. In practice, by buying the game for one platform, you receive the download code for the other. There is therefore no obligation to use it for yourself, indeed you can, for example, give it to a friend. Owning both versions allows you to access your editor creations from both Wii U and 3DS, while the absence of cross-save prevents you from maintaining progress in the main mode, thus reducing the value of the final result. For the rest, the two editions are practically identical, with the obvious exception of a greater visual cleanliness on the home console. Overall, however, Mario Vs. Donkey Kong: Tipping Stars seems to lack a certain ambition, the courage necessary to get a series off the ground that has experienced several second thoughts in the past, earning flattering evaluations without ever being able to reach absolute peaks of excellence. Having put aside the platform formula of the 2004 Game Boy Advance debut and also forgetting the ~Pipe Mania~ parenthesis of the more recent Minis on the Move, this last chapter returns to offer therefore what were evidently the mechanics most popular over the years, and therefore also those most strongly associated with the franchise. A coherent choice without a doubt, but which also underlines Nintendo's modest willingness to invest in the growth of the brand: Mario Vs. Donkey Kong: Tipping Stars is a very pleasant product that is worth the money it costs ( 19.90), but everything appears all in all predictable, unable to surprise or leave a deep mark.", "date": "2015-03-06", "grade": "7.0"}