{"name": "Il principe degli esagoni", "ref": "https://multiplayer.it/recensioni/146034-auro-a-monster-bumping-adventure-il-principe-degli-esagoni.html", "text": "The vast majority of developers engaged in creating a puzzle game for mobile devices always try to reach the fateful compromise between the immediacy of the mechanics and the depth of the game system: those of Dinofarm Games evidently do not belong to this category, given that with the here Auro have staked everything on a decidedly complex play structure by industry standards, thus addressing that niche of users willing to ~study~ before being able to enjoy the actual gameplay. A bold choice of field, which according to our judgment brings with it equal doses of disadvantages and benefits. Study now love later The first thing that catches the eye of Auro is its strong predisposition to outsourcing, with all the ancillary functions to the playful component that must be used through services external to the application: the introduction and the tutorial video can therefore be viewed via YouTube , while the manual that explains the game mechanics must be consulted by connecting to the title's website, from which it is also possible to access the community dedicated to advice and suggestions. An evident testimony of how Dinofarm Games is little interested in details such as the plot, which in fact is barely sketched: the protagonist is therefore the spoiled prince Auro, engaged in the traditional rite that marks the transition from adolescence to adulthood. Little more than an excuse to put the user in front of a puzzle game with roguelike characteristics, which however requires considerable preparation before being tackled. Just to clarify, the video that illustrates all the rules lasts a good 15 minutes, the online manual is made up of eight different sections and the tutorial mode is divided into 31 levels: an extraordinary complexity for a context traditionally devoted to immediacy like the mobile one, and which represents a real barrier to entry for anyone intending to approach the Dinofarm Games product. To put it very bluntly, if you're not willing to invest a couple of hours just to figure out how to play, Auro is definitely not the puzzle game for you; conversely, if demanding challenges are your daily bread and you don't disdain a playful chess-like setting, then the following paragraph will undoubtedly stimulate your curiosity. Auro is an intelligent and complex puzzle game, but with a very steep learning curve The game develops on a grid made up of hexagons, and the aim of each level (which, as in any self-respecting roguelike, is randomly generated) is to reach the portals that act as an exit while eliminating the monsters that appear in front of us to get a bonus in the score: to do this it is necessary to go on the opponents to make them bounce backwards, with the aim of making them end up in the water surrounding the stages. Easier said than done, given that the title offers a multitude of different enemies characterized by the most disparate abilities and resistances, various variables that condition one's movements on the grid and above all a turn-based system that forces the user to think about all his own moves: every move of Auro by one square corresponds in fact to an equal action by all the other characters arranged on the chessboard, making necessary a mental setting capable of preventing or in any case directing in the right direction the movements managed by the intelligence artificial. However, the protagonist's offensive abilities are not limited to shoving, and there are a handful of spells which, however, can be cast in limited numbers and must therefore be used with caution: another strategic factor which - together with many others which we must avoid describing synthesis - helps to make Auro a very dense puzzle experience, recommended for this reason only to true fans of the genre. Also because from a technical point of view, the Dinofarm Games title does not field values capable of surprising: the graphics are a tribute to the 16-bit era without any concession to modernity, and the sound offers rather limited and tedious music and effects in the long run. period.", "date": "2015-03-02", "grade": "7.7"}