{"name": "L'amore davvero", "ref": "https://multiplayer.it/recensioni/145997-staying-together-lamore-davvero.html", "text": "The idea behind Staying Together, the delightful platform-based puzzle game developed by Naquatic for iOS and Android, is simple but very effective. Within each stage, a man and a woman must overcome pitfalls, eventually collect the fragments of a heart and find themselves in a specific point on the map in order to move on to the next level. The peculiarity of the gameplay does not lie in its platform mechanics or in the management of the double jump to avoid chasms and spikes, but in the fact that the two characters must be controlled simultaneously and act in a specular way; which means that it will not be enough to simply cover a route, but it will be necessary to calculate times, distances and ~symmetries~, making sure in the end that you find yourself in a specific area in order to successfully complete the mission. It is one of those cases in which it is more difficult to explain the functioning of a mechanism rather than experience it firsthand, because Staying Together also has a gradual and refined balance on its side, which goes from the banality of the first levels to the complexity of the more advanced ones. dividing the substantial campaign into a total of three seasons, spring, autumn and winter, each made up of twenty stages and accompanied by a hardcore mode that is unlocked, however, only by obtaining a certain number of hearts. The game can be downloaded for free from the App Store and Google Play, but the package natively includes only the first of the three zones: to get the other two you need to make an in-app purchase for 1.99 euros. Without any other monetization mechanism, without advertising and without subterfuges of any kind: you will be able to complete the first twenty levels and, if the experience convinces you, invest the sum just indicated to enjoy the campaign in its entirety. Staying Together is a fascinating title, which starts from a simple but terribly effective idea Through the mirror As mentioned, Staying Together leverages an original ~mirror~ gameplay, with the two characters reacting in opposite ways to our directional inputs but sharing the execution of the jump. The control system is quite simple, with two virtual arrows on the left side of the touch screen and jumping assigned to the right side. The map is divided by a split screen when the man and the woman are distant, but it is possible at any time to touch an icon placed at the top to view the scenario in its entirety and grasp its characteristics, perhaps by doing a quick mental calculation on the path that we will have to follow to arrive with the two protagonists in the final area and move on. Collecting fragments of heart is not mandatory in order to continue in the campaign, but as mentioned it becomes necessary to access the hardcore mode, which guarantees further duration to an experience that is already quite long-lasting in itself. In addition to a greater complexity of situations and traps, in fact, the game introduces new elements depending on the season: autumn sees the presence of switches that activate mobile stations, which move horizontally or vertically depending on the case, while winter also adds to this factor the possibility of ~freezing~ and ~thawing~ one's partner, perhaps using the block of ice to reach a very high platform and taking advantage of its immobility to move more casually. Wanting to find the proverbial hair in the egg, we had the feeling that the very issue of freezing ends up making the third part of the campaign easier than we expected, but maybe it's a question of points of view. On the other hand, the graphics, stylized and essential but capable of proposing successful and elegant chromatic combinations, seem objectively pleasant and well designed, while we found the musical accompaniment too slow and devoid of bite.", "date": "2015-02-28", "grade": "8.0"}