{"name": "L'ultima frontiera", "ref": "https://multiplayer.it/recensioni/145894-homeworld-remastered-collection-lultima-frontiera.html", "text": "In 1999, players had already explored space. They had ventured into the stars through simulations, adventures, and role-playing games. Nothing was missing from what we have today, maybe bigger, more refined and graphically impressive. In reality a frontier remained unexplored, that challenge faced it, winning it, Relic Entertainment. Until then, no one had attempted to transport the gameplay of any real-time strategy into the third dimension. Not at least with those ambitions. Suddenly battleships and fighters gained an axis of movement, new maneuvers and possibilities opened up to the player. A door that remained open during the time of the first Homeworld, the Cataclysm expansion and its sequel, before closing forever in favor of other more accessible and immediately expendable experiences with the general public. Someone has tried to take a partially similar path, Stardock and Sin of A Solar Empire above all, but no one managed - and wanted to try - to replicate exactly that same formula, leaving us orphaned for a long time of the same exceptional sensations of the time. At least until the bankruptcy of THQ, the acquisition of the rights by GearBox and the release of this Homeworld Remastered Collection. Homeworld Remastered Collection is a wonderful tribute to space strategy enthusiasts Light years later Let's start from the basics: Homeworld Remastered Collection includes the original and the sequel, both in the versions that we played more than ten years ago, and in those that GearBox has packaged in the last year of work revolutionizing the audiovisual component. Just run the executable and choose which one to load. The Cataclysm expansion, on the other hand, remained in a distribution limbo that did not allow it to enter this collection and from which it will probably never come out again. Whether you decide to take a dip into the past using the versions of the time or you prefer the updated ones, the playful substance is almost the same. The two campaigns tell of a space journey to find a new home, a last chance before oblivion. It's hard to rationalize why the story works, basically it's told through some semi-static cutscenes and a bit of dialogue, but Homeworld has never been just gameplay. The sense of loneliness and impotence that is perceived carrying one's own strength from one mission to another, the splendid backdrops and the size of the enormous, empty maps that repeat themselves similar to each other manage to immerse us just enough to convince us, still today, to learn mechanics that are not immediate at first. Compared to other strategic ones, the micro management of the units has a secondary role as does the technological growth phase, which is important but not complex. Building new units and developing technologies that give access to further options is relatively simple, leaving us free to plan the movements of the forces at our disposal through the double map, the one that shows us the battlefield and the other tactic, from which to plan the strategy. Moving the units in three dimensions requires a little practice, above all because when things get more complex the risk of losing some pieces is high, but the satisfactions are considerable. The use of the keyboard to recall the control groups has never been so important, even in the relatively staid single player, but after the first moments of bewilderment, gratifications are obtained that no other title has ever managed to replicate. From game to game you learn how to use the different formations to take the enemy by surprise, you try daring maneuvers by attacking from multiple directions and you experiment with new ways. Homeworld remains, still many years later, one of the few strategic that manages to be fun even after the third or fourth time you try a mission precisely because each new attempt allows a different approach to the problem. Or at least manages to give this illusion. One could argue about the quality of Homeworld 2 not perfectly in line with that of the original, but if you accept that a sequel does not have great innovative ideas and is satisfied to build on what the predecessor has already done, it is difficult to complain. Let's say that the second episode loses something in terms of narrative and adds something else in terms of mission design. If in single player the changes are very limited - for example there is no longer fuel as a second resource in addition to minerals, as was the case in Homeworld - multiplayer has undergone profound changes. Gearbox has carried both chapters on an updated version of the engine of the second, a move that has egallowed to optimize a single engine and, in the case of competitive play, to unify the two experiences. All factions - Hiigaran, Kushan, Taiidan and Vaygr - are now under one roof, a leap that obviously couldn't be painless and suggested launching the multiplayer component still in beta. In this sense, we must trust and hope that the feedback from thousands and thousands of games will be used in the best possible way to balance it. Too bad that to play you have to register on the GearBox Shift platform which adds very little to the experience and represents just one more step. How to do a remastered It's useless to waste too much time describing a unique gameplay, sometimes a bit ancient but still splendid. It is worth the unconditional advice to try it and get an idea for yourself. The most interesting aspect of this Homeworld Remastered Collection to analyze is certainly that relating to the quality of the technical work done by Gearbox. Whoever writes the original remembered it as wonderfully detailed and suggestive, a memorable journey into the depths of space. Relaunching it today is endearing, the images on the screen are so primitive and lo-fi. Almost miraculously, the work done on the updated versions manages not only to make a great impression but even to do justice to that memory. Starting from spatial backdrops of incredible depth and taste. It is far from unlikely that while playing you will want to stop for a moment to capture an image or two to reuse as a screen saver. The spaceships have kept the style of the past but are now dressed in incredibly detailed textures, designed to natively support up to 4K. Each screen is a riot of neon colors, bright tones and wonderful contrasts between the darkness of the vacuum space and the hyper-saturated palette used to paint the battle fleets. Technologies refined over time such as normal mapping guarantee substance and credibility for every mining vessel, fighter, frigate or simple tow. The laser beams that start from the guns and cross the cosmic void are projected onto the surrounding surfaces while the light trails of the reactors intertwine in the air with each new collision, forming an intricate, beautiful festival of lights. The sound in the first versions was loaded directly from the game CD, in streaming, while here it has been resampled using the original uncompressed recordings. The result both for the music by Paul Ruskay and for the dubbing, performed again, is fully convincing. Just to get an idea, the two original Homeworlds took up just over a gigabyte of space while this remastered takes over twenty-two. The interface has only been partially kept in the lower part of the frame in favor of a better distribution. In this sense, the possibility of scaling its size based on needs and resolution is greatly appreciated, even if perhaps a further effort could have been made to make it even more clear and usable. The result is that certain icons are not immediately understandable and at first you have to go to the options menu several times to understand which key or combination corresponds to each function. Overall, however, we are in the presence of a really well done remastered, which for around thirty euros guarantees dozens of hours of play and for once is not only aimed at nostalgics and retro gaming lovers, but winks at anyone is looking for an excellent real-time strategy game.", "date": "2015-02-27", "grade": "9.0"}