{"name": "Stella cadente", "ref": "https://multiplayer.it/recensioni/145729-midnight-star-stella-cadente.html", "text": "A very few moments in front of Midnight Star are enough to feel the enormous similarity on an aesthetic level with the world of Halo, to the point that it becomes almost natural to wonder where Master Chief is or why the soundtrack does not follow the famous theme of the Microsoft series. However, the connections are deeper than the simple quote or inspiration, since the CEO of Industrial Toys, the team responsible for Midnight Star, is that Alex Seropian co-founder of Bungie and co-creator of Halo. The ambitious goal of the company has been, since its foundation in 2012, to create hardcore titles for mobile platforms: a sort of music for the ears of users looking for an alternative to the vast majority of casual productions that dominate Apple's stores and Google. The development times of Midnight Star have also even exceeded three years, a conspicuous period even for a console game, let alone for the smartphone environment. It is therefore a pity that these promising premises have finally translated into a product that is so interesting, but unable to really leave a mark on the market. Midnight Star is a title with good ideas, but the realization of the gameplay has several shortcomings The plot is a little more than the usual almost impalpable device used to connect the various levels: in this case it is the discovery of a hostile alien race that has practically brought mankind to extinction. The protagonist is Lieutenant Charles Campbell, destined to transform himself out of necessity from a simple communications expert to a sort of declination of space marine. The desire to create a robust and engaging background prompted Industrial Toys to also produce a delightful graphic novel illustrated by DC Comics and Marvel artist Mike Choi, also available on the App Store. The extraterrestrial settings, as previously mentioned, are strongly reminiscent of those of Halo, with rugged locations among rocks and debris without any type of vegetation, alternating with futuristic structures in which metal and cold colors are the masters. If talking about plagiarism is probably excessive, it is however evident how the stylistic figure is strongly influenced by the Master Chief saga. However, where a marked detachment can be found is in the game mechanics, or in the pure gameplay: although from the images Midnight Star may appear like a normal first person shooter, in reality the formula chosen by the team based in Pasadena revolves around a more close to that of Namco's Time Crisis, so to speak. In fact, the player is not in charge of managing the movements of the protagonist, who on the contrary follow precise predetermined tracks, but rather must ~simply~ worry about the combat phase, thus substantially eliminating all the enemies present on the screen. The only concession is linked to the possibility of rotating with respect to one's position, by pressing the arrows on the sides of the screen. Compared to Time Crisis, however, there is no cover system, but a shield to be activated by touching with two fingers simultaneously. This lack of dynamism in the action, combined with a remarkable static nature of the enemies and very repetitive and basic movement patterns, make the progression in Midnight Star rather predictable and boring. In an attempt to create gameplay suitable for mobile devices, Industrial Toys has ended up oversimplifying the mechanics, creating an annoying gap between the expectations created by the graphic component and the reality of the facts. Some game design choices are then questionable, such as for example the pinch that allows you to bring up a reticle together with a modest zoom to favor headshots: an impractical operation and essentially useful only to improve your score, given that the elimination of enemies happens more than easily by shooting them normally. The availability of a vast arsenal of purchasable weapons is also not very incisive, the need for which declines in part, however, in the face of the great effectiveness of the rifle supplied from the beginning, and through which the main adventure can be completed without problems at the level of standard difficulty. In contrast to the simplicity of the game itself, instead, all the management of the pre and post mission part is placed, which takes place within a central hub represented by one's operational base. Inside, one can initially feel very easily lost in the face of the flood of menus, statistics and options available, which basically concern the growth of the character, the development of structures and the purchase or upgrade of weapons and accessories. Most operations sare subordinated to the use of the three (!!!) in-game currencies, but credit must be given to the developers for not having overplayed the freemium factor of the game: Midnight Star is in fact playable without major problems, avoiding spending a penny , limiting ourselves to accepting some more or less reasonable waiting times.", "date": "2015-02-24", "grade": "7.0"}