{"name": "Digimon Survive", "ref": "https://multiplayer.it/recensioni/digimon-survive-recensione.html", "text": "There was a time, more than twenty years ago, in which Pokmon had to contend for fame with other equally endearing little monsters, known as Digimon. Now, having intervened the right temporal distance, the dispute seems almost ridiculous: in fact they were different creatures, of series - except for some points in common - very distant from each other. Certainly, however, in the world of video games Pokmon have enjoyed an unstoppable success, not even remotely comparable to that of their distant cousins. Despite this, Digimon Survive shows how gamers continue to leave a special space available, in their physical or digital (and certainly never as in this case would the second be more appropriate), for the adventures in that of the Digital World. The development of the title was not easy: it went from the budget of an indie to that necessary for a more substantial production, the graphics engine was modified (finally replaced by Unity) with the need, at a certain point, to restart the you work almost from scratch. Finally, how can we fail to notice an almost suspicious press blackout on the day of publication? Driven both by justifiable suspicions and by the boundless love for one of the names that have marked our (and your) childhood, we have embarked on a memorable tour de force to offer you the review of Digimon Survive. It will serve to clarify the fundamental and more dubious aspects of production, in order to understand whether or not it is right for you. A real visual novel Could Agumon be missing in Digimon Survive? He is practically the influencer of Digiworld Digimon Survive is a real visual novel. It is important to immediately and forcefully underline this aspect, which instead seems to have passed on the sly. If you had in mind a game in which it was possible to immediately take the field and lead your hands by deploying teams and teams of Digimon, perhaps exploring the surrounding world in complete freedom, this is not it. We are not exaggerating, on the contrary, when we tell you that we saw the first Digimon almost an hour after the opening credits, while the first fight (the tutorial doesn't count) came perhaps even further. The fact is that Digimon Survive proceeds very slowly, because the developers care that the player can identify completely, perfectly in an unknown world, accompanied by a very subtle but constant feeling of anguish. We would not hesitate for a moment to better define the production as a visual novel for teenagers or perhaps even for adults, certainly not for children, who would get bored immediately. Nor does the Hyde team care to make any kind of discounts in relation to the management of narrative rhythms: thus, the prologue has been accused, for example (also in other forums, even by users) of being excessively long and tedious. But on closer inspection, this is how visual novels proceed, which after all are nothing but interactive novels, screen stories that continue by slow accumulation of dialogues, many and many lines of text. Fortunately, in addition to the Japanese dubbing, all the texts are in Italian, apart from some words left during the fights, it is not clear why (probably due to an oversight), in English. The localization, apart from this, however, is complete, and allows the use of the title without problems. The progression is what you can easily imagine: the dialogues between the characters are read to the bitter end, a new area is reached (identified by an equally unprecedented backdrop) and it starts again. Why should any of this matter to Digimon fans? Because, for the first time in this specific genre, they are the main theme. An unedited and mature story Digimon Survive's story is surprisingly mature and captivating (as well as unedited) That of Digimon Survive is an unpublished story. Kazumasa Habu and Tsuzuki Katsuaki have decided to introduce human protagonists never seen before in the various anime series; accompanying them, on the other hand, are both some of the Digimon you've probably come to love for decades now, and relatively new faces. Impossible not to recognize, for example, Agumon and Gomamon, while perhaps you will meet the more recent Falcomon and Labramon for the first time; the latter, for example, debuted in the third anime series, Digimon Tamers. In total, along the way you will meet about a hundred different Digimon, a fair number but still limited compared to video games released in the past, such as the full-bodied Digimon Story: Cyber Sleuth. Apart from the companions of the protagonists, the other Digimon can be recruited during the fights, by means of a curious mechanic that requires you to dialogue with theenemies, guessing their personal tastes in the midst of battle. Interacting with environments and characters is essential in Digimon Survive As for the plot of Digimon Survive, which must necessarily take into account personal taste, our opinion is positive. We didn't tear our hair out for the revelations along the way or at the climax moments, but we still appreciated the mature tone, sometimes even able to arouse feelings of anxiety and unease. The fact is that Takuma and his friends find themselves catapulted into a parallel world, suddenly, in a very different way from what has been seen in the past in all the animated series. Here the dangers are real, the evil Digimon have no qualms about attacking and killing humans, you always have limited information, it's not clear where your friends are and how to get home. Not even the support Digimon know exactly what happened between that world and Earth. The greatest mystery will be revealed, of course, by continuing in the narrative, and by defeating some very, very dangerous enemies one after the other. The structure: exploration and turn-based combat The Digimon Survive turn-based combat chessboard Without prejudice to the pre-eminently narrative (and slow) nature of Digimon Survive, all that remains oscillates between free exploration and real combat; as you can see, the latter occupy only a minimal part of the product, and not even the fundamental one. The ominous parallel world, similar only partially to the real one, hosts different areas: the initials consist of an old school and its surrounding forest, but soon the temple, the dam and so on are added. Continuing the plot is very simple, as you are constantly guided by the developers: it is even enough to interact with the surrounding environment (or with the characters) until you look for the red indicator marked with an exclamation point. The latter in fact allows you to unlock the dialogue necessary to move forward Some possible choices in Digimon Survive, to convince enemies to go over to our side In some moments, however, you will be truly freer: so much so that you can choose certain paths over others, as well as dialogues with specific characters at the expense of the remaining present. The choices will influence some later aspects of the adventure, such as the trust of the co-stars in Takuma (even, certain choices in the final stages will come to determine the survival or otherwise of some characters). Furthermore, when there are multiple opportunities for dialogue, one must be careful to select the left, central or right one, because this affects the ~morals~ (or karma) system. That is to say: not only on the relationship with that character, but also on the transformations of Agumon, Digimon who, depending on karma, can unlock alternative (and irrevocable) paths. In our case, Agumon has become Tyrannomon, but he could easily have transformed into Greymon. We would not be able to say specifically which choices influenced evolution; what is certain is that, even if the karma system appears very forced in its implementation, it will favor great replayability in the future. Each Digimon has its own parameters, level up, transform, carry items The analysis relating to the fights remains: it was left for last because, somewhat with regret, we have to recognize in Digimon Survive a very, very simplified turn-based strategy. Digimon fight by moving around a board, can attack (and defend) in four directions, talk to human partners during battle to get a stat boost, evolve to become stronger (but losing mobility points in the surrounding area). Apart from the boss fights, however, it is really difficult to see the Game Over screen. Takuma's smartphone (never empty) allows you to interact with the surrounding environment, identifying enemies or objects In reality, one always has the impression that the fights themselves are an almost unnecessary implementation, due to the need to at least partially avoid the passive use of the title (but in reality they too provide a mode with ~autopilot~). Sure, Digimon gain experience points, level up, get items that modify some of their parameters; but one always has the feeling that one choice, in the end, is worth the other. After all, even if players can use Takuma's smartphone to find hostile Digimon in the various environments (thus entering combat) the really mandatory battles to continue are few; to work around the problem, there is the free battle in the menumain.", "date": "2022-08-08", "grade": "7.5"}