{"name": "Jak X", "ref": "https://multiplayer.it/recensioni/jak-x.html", "text": "Krew's crew The pretext for the spin-off of the series is offered by the death of Krew, all his enemies / friends are invited by his daughter for the reading of the will. A hologram of Krew warns them that, ironically, instead of getting their hands on a rich legacy, the participants in the event find themselves contaminated by a slow-moving poison and forced against their will to participate in (and win) the championship of Kras City, and thus realize the dream of the deceased Krew to be able to save his life. Throughout the game, between one race and another, a series of cut-scenes will entertain the player by breaking the frenetic pace of the races and to reveal other details of the story and take the player towards the final unknown. The mode on which the entire game is based is in fact the so-called adventure, in this mode the player following predetermined steps will have to complete a series of races in four different cups (which correspond to respective levels of difficulty) which will allow him to complete the game. Depending on the race selected, there will be various rules to follow: in fact, Naughty Dog has decided to spice up the competition with normal grand prix by slightly modifying the approach to the races by inserting limitations, objectives and shedding of bolts. A first mode is that of the frozen race which looks like a particular race against time where the success of the test is also given by the player's ability to know how to handle the vehicles to recover a series of bonuses along the track that will literally freeze the weather; the tactical component of the track consists in the simple fact that the collected crystals do not regenerate over the two laps and therefore it will be up to personal wisdom to leave bonuses scattered around the track in anticipation of the second and decisive passage. The second mode is the so-called mortal race, daughter of the burnout traffic attack, where the only objective is to destroy as many opponents as possible in the allotted time. The 'rush hour' race differs slightly from the latter where, as the name suggests, you will find yourself driving against traffic in an attempt to hit and destroy as many vehicles as possible (depending on the color of the vehicle, a score corresponds to more difficult cars it will be necessary to exhaust the turbo to destroy them and thus be rewarded in a lavish manner). The turbo shot mode closes the series of track races, a normal solo grand prix where the goal is to win against the clock and the only way to do it is to keep collecting turbo crystals to then spin at excessive speed without a moment of breath at every point of the track. The common tracks are joined in the game by real deatchmatches in arenas where the objective in turn is either to destroy the greatest number of opponents (and whoever reaches ten first wins, a typical legacy from racing in the gardens) or to collect before the others a series of artifacts arranged randomly within the environment that hosts the race. The solitary adventure is accompanied by the classic multiplayer which is enriched by the online mode to challenge opponents from all over the world. Echo boosting The real fulcrum of the races is the management of the echo crystals, these are divided into four distinct categories based on their use: the blue crystals accumulate in the boost bar and can be activated by pressing R2, they are especially useful in some tracks with ramps and help the player to overcome the most critical points; the red crystals are defensive and serve - depending on the type - to create protective barriers, deflect missiles launched from behind or simply leave a trail of bombs behind; the yellow crystals are reserved for attacking other machines, again depending on the type they are distinguished in guided missiles, machine guns or electric discharges which, once launched, directly hit the player in the head; finally there are the green healing crystals that completely restore the cars damaged by the opponents. Unfortunately, it must be said that the management of the items is too dependent on the outcome of the race: there will be races always in first position and a simple rocket on the finish line to lose, just as whoever has more boost at the end of the races will have an undoubted advantage on the final sprint ; doing so actually decreases the credibility of the races which are reduced to a mere inconclusive use of weapons and turbos. Pimp my Van Between one race and another, like any good self-respecting car game, you can get your hands on the features of your car both in terms of bodywork colors and the parts that make it up. Depending on the results obtained in the race, you will be awarded special prizes and money to buy spare parts. The fleet of cars is also completely dependent on the progress in the game: at the beginning there will be only one vehicle inside the garage, continuing to unlock cars useful for racing in the arena and others perfect for whizzing through the streets of Kras city . The Naughty Dogs, instead of also taking on the responsibility for the design of the cars, preferred to rely on an external collaborator specialized in car design who created the whole fleet of cars and its related modifications from scratch. The settings proposed by this Jak X, in addition to the continuous references for the aficionados of the series, are well structured and elaborated, even if due to the considerable speed (and confusion) of the game, very little will happen to notice the details on the side of the track. The tracks, very wide, are well suited to the game structure and are designed in such a way as to give the player enough freedom both in terms of driving and escaping from enemy missiles. The game engine holds up very well the efforts to which it is subjected by the 8 fire-breathing cars in the race and does not show particular hesitations even in the most critical situations. The sound sector does not experience particular moments of glory if not in the presentation with the now classic Queen of the stone age in the background (a couple more games and the videogame producers will have to go and sift through the first demos of the group...) and nothing more , just a series of electronic backing tracks that pass without leaving a mark. The dubbing, completely in Italian, however remains of excellent workmanship and performed by professionals in the sector related to the dubbing of cartoons and animated films (to say that Dexter's voice is recognizable is probably an understatement) The game, although well made and fun, does not add anything new to the productions of the genre. Sometimes you almost think it was a move more linked to tradition than anything else (for those with good memory, Crash Team Racing was released on the first Playstation after three platformers, on ps2 after three action/platformers this Jak x is released). The big flaws of the game are all in fact linked to the use of echoes, even in the best race ever, a single missile will be enough to send you back four positions, just as in multiplayer a player with a minimum of turbo experience will suffice to turn the session into something very close to boredom. However, there remains the awareness of a fun game, well made and with an enjoyable plot for racing games. There are currently reports that this Jak x will have ties to Daxter for PSP, so we'll just have to wait and see how this strange universe expands. Pros: Fun. Long lived. It is one of the few racing games with a credible story. Cons: Sometimes very confusing. Not very innovative. The management of the echoes and their weight in the race need to be reviewed. Nine years and two generations of Sony consoles have passed since the first Crash Bandicoot, Naughty Dog has grown as a software house and abandoning the world coveted by Doctor Cortex has given birth to Jax the blond elf with a green goatee and his talkative companion Dexter. After the abandonment of Jason Rubin at the helm of the Naughty, the Americans have not lost heart and before throwing themselves headlong into the production of ps3 titles, they boldly launched themselves into the racing world by creating Jak X, a product that temporarily puts aside the typical mechanics of the series, to create a crazy car game that turns out to be a crasis between elements of Burnout, Twisted metal and Mario kart. It remains to be seen whether such fundamentally different approaches to driving will lead to a worthy product, for this and other questions we just have to continue reading...", "date": "2006-01-04", "grade": null}