{"name": "The Book of Unwritten Tales 2", "ref": "https://multiplayer.it/recensioni/144846-the-book-of-unwritten-tales-2-millumino-di-fantasy.html", "text": "Let's face it, this game was born under a lucky star. Building on the success of The Book of Unwritten Tales and the prequel The Critter Chronicles, it made a splash on Kickstarter and was patiently backed through its long gestation in Steam Early Access. KING Art Games therefore enjoyed two rare privileges: time and money. Luckily, the talented German team has always kept their concentration high, and now we can confirm that the wait has paid off. The Book of Unwritten Tales 2 is an immense graphic adventure. Over twenty hours of gameplay spread over five chapters and four playable characters, not counting the supporting characters that we will briefly take over, such as Timmy the mouse. The Book of Unwritten Tales 2 contains a variety of creatures to interact with worthy of a Philip Pullman in full form, overflowing with puzzles and enjoys an almost flawless technical realization. With a breath of energy worthy of a musical, The Book of Unwritten Tales 2 is yet another confirmation that German electronic fiction is alive and growing. However, if you haven't played the previous titles, it is worth summarizing what the spirit of the series is, because we can speak of a cohesive work with a well-defined personality. A single creative intent that has been refined and strengthened. Central to it all are four characters: Nate, Critter, Ivo, and Wilbur. Nate is an adventurer in love with the beautiful elf Ivo, from whom he separated under unclear circumstances. Critter is his mute and inseparable companion, the only one who can tolerate the rant. At the moment Nate is not doing well, because a pirate holds him hostage and forces him to narrate non-stop like a Shahrazd with a beard. Princess Ivo still thinks of her bearded love, but her mother won't allow marriage to a wild human. Unfortunately for her, the fact that she has recently discovered she is pregnant is added, although she has never had sex with her beloved. Wilbur, on the other hand, has been promoted to teacher of magic at the Seastone school, but a plot is underway in his academy to oust the current rector and put a madwoman in charge who seems to have come out of Maria De Filippi's public. Let's assume that the triggering force that will force the four to cross their paths again is an old archenemy of the group and we have all the elements for an initial explosion that sets in motion an epic story. The Book of Unwritten Tales 2 is the graphic adventure we should all be playing this year Heavy themes, light tones The stylistic feature of The Book of Unwritten Tales 2, but also of the previous chapters, is humor. If a player doesn't find the game fun, in the sense that he can't sympathize with the characters and enjoy untangling their troubles, he's already finished playing, there's no point in insisting. Luckily we are convinced that this game can put a smile on the face of the majority of players. First of all, the characters are characterized very well, and not just the main ones. Each gives voice to a distinct personality and stands out for its own idiosyncrasies. As always, seeing someone fight to get what they care about in the face of difficulties has us rooting for them, and in The Book of Unwritten Tales 2 there are dozens of ever-greater obstacles to overcome. Anything that can go wrong for our heroes rest assured it will go even worse. Luckily the quartet tries hard, and we with them, solving one puzzle after another. But what makes the game irresistible is the comedy atmosphere that avoids both demented humor and elitist irony, instead having fun making fun of the characters and pricking them on their weaknesses, laughing with them instead of at them. In short, the developers have done an excellent writing job, enriched by an impressive amount of quotes, ranging from John Lennon to Vernor Vinge. Anyone with a culture of video games and the worlds connected to them, or who has been tuned into the pop reality of the last twenty years, will find more than one opportunity to test his memory. We don't want to say that everyone may like the style of the game, which is rounded, fabulous, sometimes sugary, but it is difficult to remain indifferent to its charge of hilarity, which under cheerful tones allows itself to deal with important issues such as social equality and freedom of expression. With more than one mischievous joke. And speaking of jokes, another point that can be discussed is the length of the dialogues. There is a lot and often talk in The Book of Unwritten Tales 2, even if the pace of the game remains unusually brisk for such a long adventure. Someone may object that sometimes the game becomesverbose, while there are those who will defend the right of adventures to be text-rich. In this case we can say that at least the content of the dialogues makes sense and enriches an already vast world. On the other hand, graphic adventures have a lot in common with the theater, and the exchanges that take place are often the only way for us to imagine the reality that lies outside the screens. And in any case, just press a mouse button to jump directly to the next bar. Devilish things to lose your head If you are one of those who derive satisfaction from conquering challenging goals, you will be pleased to know that The Book of Unwritten Tales 2 sows its screens with puzzles. The basic setting is the classic one, with objects to be combined with each other or with a sensitive point of the screen, but from these simple premises the developers draw all kinds of variations. In some cases we have to use an object while a character performs a certain action, or perhaps perform a series of moves in the right sequence. With a lot of common sense, the game prevents us from combining the correct objects together without the character having understood the reason, so as to discourage the inevitable frantic click that tempts everyone when we struggle to solve a puzzle. On the other hand, it is enough to reflect on the objective, listen to what the characters say and observe them in action, or think about the description of the individual objects to arrive at the solution, which is never obvious. In fact, when we are certain of a result, the game displaces us and adds a new passage, so that the conclusion of a chain of puzzles is both surprising and satisfying. The variety of puzzles is remarkable and often after a section of intense reasoning, one of greater breadth follows, with macro puzzles that perhaps require you to collect fewer objects. To all this is added occasionally the need to make two or more characters collaborate with each other, exploiting their respective characteristics. Another element that helps keep frustration and the risk of blocking under control is the ability to work on multiple puzzles simultaneously. That way you're less likely to get discouraged and you can rest your head when a problem doesn't come to your head. However, the game has been designed in such a way that we immediately know clearly what the objectives of each section are, therefore it is difficult to lose course. And between one puzzle and another we have the opportunity to meet two-headed ogres, cosmic creatures, pink hippogriffs and a slew of other curious, awkward, sometimes touching characters. With a high-level voice acting and the music of an orchestra that accompanies the action as in a Disney classic. Such an abundance of content that is thoughtful and in service of the player experience is rare nowadays. Better take advantage of it.", "date": "2015-02-17", "grade": "9.0"}