{"name": "Jetpack o gommone?", "ref": "https://multiplayer.it/recensioni/145151-ramboat-jetpack-o-gommone.html", "text": "Eight characters, ten vehicles, ten different weapons to use and scenarios that change as we proceed in our endless run. Does it remind you of anything? This is the formula that in 2011 decreed the phenomenal success of Jetpack Joyride, the horizontal scrolling endless runner developed by Halfbrick Studios. A little over three years later, the guys at Level App Studios have tried to grasp the same inspiration, however reinterpreting these mechanics to adapt them to a movement ~in width~ rather than ~in height~, that of a motorized dinghy driven by a soldier who is very reminiscent of the protagonist of Metal Slug; and that in the same way he loads all the enemies that come within range with bullets, whether they are opponents parachuted from above or other boats, helicopters, planes or even submarines. The system is regulated by a control system very similar to that of the aforementioned Jetpack Joyride: a simple pressure of the screen for our character to advance to the right, whereas the release instead translates into a return to the left, in any case with a view to a continuous movement. Added to this are two further maneuvers that can be performed via upward or downward slides, which allow you to take a leap or immerse yourself in the water. The fire is instead automatic, and is activated when you are within shooting distance of the target. It is a setting that immediately reveals itself as particularly immediate and precise, allowing us to dodge the bullets that rain down on us, in an attempt to preserve the three hearts that make up our vital energy for as long as possible. Ramboat is an inspired and fun endless runner, capable of offering unexpected variety On a mission for Uncle The alternation of scenarios, the gradual tightening of the difficulty, the flood of new enemies undoubtedly give the game a certain sense of progression, but it is the weapons that are collected along the way and above all the achievement system that represent the reason why Ramboat assumes in many ways the connotations of the traditional ~video game drug~. The default pistol can in fact be replaced with machine guns, flamethrowers, shotguns, missile launchers and more, using the classic ~timed~ system that we can enhance by spending the coins earned with each game in the in-game shop, i.e. the virtual currency , buying upgrades that allow us to have a more present arsenal, with a higher rate of fire or effectiveness. In the same way it is possible to buy new characters or boats, according to a scheme that favors in-app purchases, albeit in a non-limiting way. Moreover, a single purchase will be enough to eliminate advertising forever. The impact of the freemium element actually concerns only the notorious ~continue~, which allows you to resume the game at game over, albeit with a single little heart available (perhaps hoping to pick up another one in the running), and which must be paid with the emeralds, the hard currency of the game, at a high price. However, the nature of Ramboat is not that of an experience to be made more docile by spending real money, but a test of skill that manages to keep the involvement high thanks to the aforementioned achievements and even the nice poker hand with which we can try our hand at end of each stint, with very interesting prizes to collect if the cards are right. Technically very well done, with personality to sell, a style similar to that of Jetpack Joyride and some spectacular bullet times to enhance the ~aerial~ maneuvers, the title of Level App Studios confirms itself in short as solid, fun and well finished.", "date": "2015-02-14", "grade": "8.5"}