{"name": "Spogliati a morte", "ref": "https://multiplayer.it/recensioni/144627-akibas-trip-undead-undressed-spogliati-a-morte.html", "text": "Visiting Akihabara is every self-respecting nerd's wet dream. For the uninitiated, it is a huge district of Tokyo where electronics, videogames, comics and action figure shops are mainly concentrated. Mecca of collecting, harem of extravagance, Akihabara is a must on the itinerary of anyone spending a few days in Tokyo, if only to immerse themselves in the culture of Japanese consumerism. Which means that it is also and above all a neighborhood visited by the younger ones, the favorite victims of the Synthisters, mysterious vampire-like creatures that feed on the vital energy of others. The problem is that the protagonist of Akiba's Trip is also a Synthister: he has been transformed into a monster by the Magainomo Corporation and, after managing to escape, he fights to save Akihabara - and the whole world! - from this terrible threat. We will obviously put ourselves in his shoes, surrounded by friends, enemies and shops. Does it seem interesting to you? Akiba's Trip is a wacky fighting game that could have been much better Exploring Akihabara Published by the usual NIS America, the Acquire title does not hide its true nature: it is a game for voyeurs, in which the story and the gameplay are almost a side dish. At least, we want to hope that the intentions of the authors were precisely these, because the mechanics that accompany the bizarre idea behind Akiba's Trip are so badly designed that it could not be otherwise. The game is a kind of free roaming in the sense that the player is free to explore the Akihabara district in the third person as he travels from one destination to another, following the development of a rather predictable plot made up of conspiracies, sci-fi and skits comedians. Already the narration, in itself, leaves something to be desired: not only is the story extremely subtle, but the dialogues leave you amazed by the discrepancy between their very serious tone and the events that take place on the screen, especially when a dramatic moment follows an ironic or sexual joke. The supporting actors then respect the canons of Japanese comics and anime, but this is not exactly a defect if we consider the setting and spirit of Akiba's Trip. The ~world~ of the game, in fact, is certainly the most refined and important element: Acquire has meticulously reconstructed the Akihabara district and its shops, and even if they have not managed to peep out all of them, probably for rights or more, it's hard not to be impressed by the realistic imprint that has been given to the scenario. The cacophony of colors and signs makes the exploration almost documentary, even if a careful look will immediately notice the similarity between the textures that represent the goods on sale in the windows of the various shops; however, the possibility of entering some of them and wandering through the alleys of the well-known district probably fulfills the desire of those who have not yet been able to make that trip to Japan. Playstation 4 trophies Akiba's Trip is giving away 46 trophies divided into 32 bronze, 10 silver, 3 gold and the coveted platinum. To get them you will have to undress enemies like crazy, upgrading weapons and equipment to the maximum and completing most of the side missions. Samurai... undress! Different speech, however, for the inhabitants of this virtual Tokyo: decidedly few, if you make a comparison with the crowded reality, and almost all represent the most famous Japanese stereotypes, from goth girls to depressed otaku. Many of them are actually Synthisters, and after recognizing them, just push them to start the fight. Despite its RPG elements like inventory management, multiple-choice dialogues, and swappable equipment, Akiba's Trip is, at heart, a real fighting game. Or at least try to be, with unsatisfactory results. The type of weapon equipped by our alter ego significantly changed his fighting style (light weapons allow fast combos, heavy ones allow powerful but very slow attacks) but something is wrong in the basic balance and arithmetic, because despite the upgrades you he has the impression of not really improving. The battles, then, all aim at stripping the opponent: being vampires, the Synthisters are susceptible to sunlight, which is why it is necessary to tear their clothes off them to destroy them definitively. The equipment is in fact divided into three parts, and the combos aim to destroy each of them, leaving our target's beauties increasingly exposed, whether they are prosperous breasts or male buttocks. It is a disturbing and disturbing solution at the same timeknow, since the most effective combos allow us to undress one or more enemies in an instant thanks to particularly spectacular shots that highlight their bodies. Despite its extravagance, the combat system is terribly simple and flat, and the bad collision system certainly does not contribute to making it more fun: if anything, boredom takes over soon, testing even the patience of the most curious players. Too bad, because from a technical point of view Akiba's Trip is a beautiful sight, thanks to the fluid animations and cel shading which gives everything an incredibly cartoonish appearance, perfectly in line with the themes and the setting.", "date": "2015-02-10", "grade": "5.0"}