{"name": "Wasteland 3: La Battaglia di Steeltown", "ref": "https://multiplayer.it/recensioni/wasteland-3-la-battaglia-di-steeltown-recensione.html", "text": "It's been almost a year since we reviewed Wasteland 3 and, we admit, we hadn't learned how to play a bit: it took us to stretch our fingers before tackling the new problems that have decided to afflict the Patriarch, in the first DLC entitled The Battle of Steeltown. These are five hours of content that not only bring with them a very interesting plot segment but also new objects and above all unpublished mechanics that embellish the combat, enhancing its tactical aspect even more. As you can well guess, the whole story takes place in and around the Steeltown industrial complex and you will be busy solving a more delicate and multifaceted issue than it seems. Will you be able to restore order where chaos reigns more sovereign than ever? The Patriarch is counting on you but not only that, the hopes of those who have found a new life in Steeltown, despite its ups and downs, also weigh on your shoulders. It is therefore of vital importance that the complex remains standing however, as always happens in Wasteland 3, the company is far from simple. The minimum level to access it is 9, however, considering the delicacy of certain discussions, we suggest you start the DLC with an intelligent, determined team and even ready to smooth the fur a bit when needed: with brute force alone you won't go far. Here is our review of Wasteland 3: Battle for Steeltown. Workers' revolt As always, let's start from the narrative premises. You are sent to Steeltown to investigate because production, so important to the Patriarch, has suffered an inexplicable slowdown. A quick tour of the site is enough to begin to understand the seriousness of things: due to the inhuman conditions to which the workers are subjected, a real revolt has broken out on the lower floors of the complex which sees the workers use the hard way against the manager Karl Ludow. Knowing how things go in Wasteland 3, you will have to investigate how things really are in order to then make the decisions you deem appropriate and confront yourself all the time with whoever created Steeltown and now directs it: Abigail Markham. The balances are as subtle as they are fragile, one wrong answer is enough to light the fuse of a bomb now close to exploding. Abigail's interest in not killing the workers, limiting herself to knocking them out, is the basis for the introduction of one of the new mechanics: it is the suspension, a condition whereby those who suffer it are knocked out without dying . With the right weapons, which will appear in the game at this specific juncture and will be precisely non-lethal, you will be able to apply a suspension field: once accumulated up to ten times it will shock anyone who has suffered it, making it harmless. If at first glance it may seem useless to you, in a short time you will learn that it is not only an excellent fallback to quickly get rid of annoying enemies but, above all, an essential requirement for your reputation: to spare civilians who, even with the hard way, are protesting for something they owe will put you in a good light in the eyes of all in Steeltown, even making some bargains easier. Wasteland 3: The Battle of Steeltown To all this are added the elemental shields, a rather explanatory name in itself: humans and robots alike will be able to apply, to themselves and to their companions, protections that will greatly minimize the damage and can only be broken by attacking them with the respective element - or by waiting for the permanence turns of the shield to run out. Again, Wasteland 3 adds a small piece of strategy to its already well-thought gameplay, forcing you to review your strategies by virtue of these new mechanics: we did not find them invasive, the enemies do not use them at every turn and it was rare to see more than three protected by a shield at the same time. This is because, however, the firefights throughout the course of the DLC are always on a large scale and the shields are just one of the many fish to fry that will touch you; in fact, just as you can apply the suspension, you can suffer it in the same way and once the maximum value is reached, not only will we be paralyzed, unable to act, but we will also be at risk of submission by the enemies. Translated, we will be knocked out regardless of the amount of lives and trust us, it will happen more often than you would like. The Battle of Steeltown does not just offer a rich narrative sector, new mechanics, weapons and even elements for your headquarters, if you will be impeccable enough to earn them, but also an unprecedented material: tellurium. Not this namen should be new to you, as there is a mine on the map where you can start a secondary mission, but until the DLC it was not possible to obtain it or, obviously, exploit it: from now on it will be available to build new equipment or modd weapons, but keeping in mind mind that this is a material in very limited quantities. You won't be able to build everything, so choose carefully how to invest it and don't exclude the possibility that you will still be able to recover some armor along the way.", "date": "2021-06-03", "grade": "8.0"}