{"name": "Lo squadrone supremo", "ref": "https://multiplayer.it/recensioni/144768-super-galaxy-squadron-lo-squadrone-supremo.html", "text": "Funded on Kickstarter with just twelve hundred dollars, against a goal of only two hundred, Super Galaxy Squadron stands as a small but significant tribute to the genre of classic vertical scrolling shoot'em-ups, from Raiden onwards, with many bullet elements hell, two modes (campaign and endless), as many difficulty levels, fourteen different ships and some interesting ideas. All in a package that is sold on Steam for 7.99 euros, but the proceeds of which will be donated to the Child's Play foundation. The plot accompanying the game might seem rather trivial at first glance, but it hides some original facets and a minimum of insight. But what matters is that an intrepid pilot, driving a small but powerful spaceship selected from those available, will have the task of facing the threat of an entire alien army from the perspective of six increasingly complex stages, each accompanied by a final boss and with an extra challenge to conclude the adventure. Super Galaxy Squadron is a small gesture of love towards the vertical shoot'em-up genre Shoot what happens to you The mechanisms that characterize the gameplay of Super Galaxy Squadron are quite simple and traditional, although there are aspects of the experience that differ from the classic vision of the shooter genre. In the first place, it is the choice of the ship (and its pilot) that influences the action and its development, as well as the style that we will be able to adopt in battle, given that each vehicle has a unique arsenal and special attack, as well as different values for speed, stamina, ability to deal damage, and so on. Once catapulted into the action, we will be able to resort to the usual autofire to wipe out everything that moves on the screen, in a context that develops vertically as mentioned and which therefore only uses a portion of the screen (but in the future a update for landscape view). However, the collection of three types of enhancements will not define the conformation of our fire, because that depends exclusively on the spaceship we pilot. The number of bullets fired will therefore change, as well as the frequency of primary and secondary fire, the latter represented by traditional homing missiles, which perform a very important function when it comes to hitting targets that are on the sides or below the our location. The interface shows, in the upper left part, the amount of vital energy available, which clearly drops when we are hit, but which can be restored by collecting any repair kits. The problem with taking damage is that when this happens we will simultaneously lose the last power-up acquired, which will begin to float in space waiting to be recovered, an operation however not always possible during the battle with a furious boss. This type of solution makes it difficult to recover ground when things start to go wrong, but at the same time it provides an essential balancing factor with respect to a setting in which, perhaps, our equipment should always remain fixed and untouchable. Everything changes Using a fully supported Xbox 360 controller, Super Galaxy Squadron's control layout is as simple as imaginable, with the left analog stick deputized for shuttle moment, any of the main buttons activating main fire (auto , as mentioned) and any of the back buttons to launch the special attack. This element also implies substantial differences between one spaceship and another, because there are specials that work like traditional smart bombs, giving us a moment's respite and clearing the screen of enemies (or at least trying), and others that instead work like real own direct attacks, very effective against the bosses but not equally capable of making us avoid some damage. In reality, the game behaves in an ~understanding~ way when it comes to dodging the many enemy bullets, causing damage only when the blow hits us in full and thus allowing us to perform incredible pixel-perfect dodges. Situations that repeat themselves with great frequency and which constitute the fulcrum of the gameplay for the title developed by Psyche Studios, capable in such situations of making the player feel like an unbeatable war machine, a ~great little videogame wizard~ with a bionic eye , setting record after record in one of the many smoky arcades that raged in Italy in the early 90s. Contributing to the sense of nostalgia is clearlythe technical sector in its entirety, bearer of a pixel art that is not always impeccable (especially for the backdrops, generally anonymous) but pleasant, accompanied by a soundtrack also in 16-bit style, capable of involving and getting into the head. In the end, Super Galaxy Squadron does not introduce particular innovations nor does it mark the possible return of a genre that has unfortunately had its day, but offers nostalgics and enthusiasts light, fun and genuinely inspired entertainment.", "date": "2015-02-06", "grade": "7.0"}