{"name": "Affari di famiglia", "ref": "https://multiplayer.it/recensioni/144676-game-of-thrones-episode-2-the-lost-lords-affari-di-famiglia.html", "text": "This you are about to read is the review of the second episode of Game of Thrones - A Telltale Games Series. The complete series consists of six English-language episodes. There are lethal spoilers in this second review. After the chilling finale of Iron From Ice, Ethan leaves the throne to Rodrik, who returns from war more battered than ever. The second episode of the series takes your breath away, perhaps even too much, as if waiting for the eldest son of House Forrester to heal from his wounds. On the other hand, it consolidates the position of the main characters on the board, defining the playable cast once and for all. On the one hand there are Rodrik and Asher, well characterized, with whom it is easy to sympathize. On the other hand, there are Gared and Mira, with an anonymous face and a malleable soul. In terms of gameplay, this means that the dialogue options granted to Rodrik and Asher do not allow us to move away from the personality that has been established for them, while with Gared and Mira we play characters with split personalities, ready to go from courage to cowardice with as easily as opening and closing a window. The result is that they consistently seem treacherous, even though that's not their nature. They just don't have one. It would have been nice if the game had recognized the way we wanted Gared and Mira's personalities to develop by gradually changing the options in the dialogues, but it doesn't. So even though all four characters fight for House Forrester, it's undeniable that we prefer to spend more time with Rodrick and Asher. Around these four protagonists, the supporting cast does its part well, and with the first episode behind us we know who we can trust and who could prove to be a problem instead. Once again, original characters from the Martin saga appear on the scene, perfectly centered in the lines of dialogue and behavior, so much so that this Telltale series increasingly resembles a mini-season of Game of Thrones. Whether all of this is good or bad is up to everyone to decide. The Lost Lords is a long weaving job that asks us to be patient until the next episode Looking forward to a better tomorrow In The Lost Lords we find the same production limitations found in the first episode. The apt painterly effect suffers from the clumsiness of the game engine, and the edges of the models are fuzzy and flickering like mirages in the desert. The environments, partly already seen in the first Iron From Ice, are sparse and unadorned. Just take a look at the acronym, which incorporates that of the television series, to realize how crude the technical realization is. Does it count? Does not matter? In our opinion, in this case it has a weight. We are not here for the substance, but for the narration and the illusion of choice, so we want to enjoy images that remain etched in our memory. In The Lost Lords there would be at least the funeral scene, with the beautiful voice of Molly Stone singing in front of the corpses of Ethan and Lord Gregor, which would have deserved more visual care. The writers on the other hand have worked hard to give an authentic flavor to their series, and so far they have done a great job. Unfortunately, however, there are several scenes without tension, especially those involving Gared and Mira, which tire the story, which is roughly a couple of hours long. Asher has the task of making us swing the sword in the inevitable Quick Time Events, full of blood as befits an episode of Game of Thrones, but for the moment he remains a character still to be explored, therefore his part of the story also us keeps waiting. What prevents the episode from taking off is above all the fact that too often we are given the floor in the course of insignificant exchanges, which perhaps shed light on some nuances of character but which do not even swing the needle of the balance of the post in game. The Forrester characters seem like victims of fate with little say in the fate of their lives. Perhaps it is a desired effect and we will appreciate it only by continuing with the series. On the other hand, this is the limit of a review in progress. By the end of the episode, however, the story has managed to plant the seed of vengeance in our hearts, and a mild curiosity about the fates of the characters. Just enough not to disdain the next chapter. On the other hand, the conviction has strengthened in us that if you are not a fan of Martin's saga, from printed paper to the television screen, this Telltale series will hardly touch you. But we reserve the right to change our minds. With four more episodes to go, we can still reverse the verdict. If not in the series, at least in the reviews, the ending is yet to be writtenNone", "date": "2015-02-05", "grade": "6.9"}