{"name": "Angeli custodi provocanti", "ref": "https://multiplayer.it/recensioni/144664-sakura-angels-angeli-custodi-provocanti.html", "text": "Kenta, the protagonist of Sakura Angels, is attacked in broad daylight by a demon, but two guardian angel girls come to his aid, who in addition to having clothes that leave little to the imagination, above all because of the immeasurable breast attributes, are also his longtime personal protectors. Although Kenta is the perfect visual novel medioman, it seems that fate has reserved for him a fundamental role for the future of planet earth. Guardian angels by the sea The two don't introduce themselves immediately, but Kenta finds them in the classroom (obviously he's a student), dressed as strappers in uniform. Here he will meet them, learn their names: Hikari and Sayaka; and he will find out more about his fate, except that he is a dull person. Soon he will also meet whoever wants to kidnap him (obviously he wears the fifth and turns with his breasts out), he will witness fierce fights between girls and he will run into every kind of sexy accident imaginable always having two similar girls around, in pure film style sheep of the 70s. Meanwhile, with one hand on the mouse and the other free towards paradise, the player will watch impassively the succession on the screen of soft erotic images framed by trivial situations, with the latter seeming to come out of the manual of the genre. Winged Cloud, the developer, to whom we owe the bad Sakura Spirits, the mediocre The Guardian's Spell and the good Pyrite Heart, all visual novels, falls once again into the trap of focusing on the beauty of outsized female forms without deviating a millimeter from most overused narrative clichs. The problem is not eroticism itself, which can be there in visual novels and, indeed, in some cases it is fundamental: unfortunately in Sakura Angels, in addition to the breasts, only a desperate lack of creativity can be glimpsed, which is compensated in minimal it starts from the beautiful drawings and the conscious use of the syntactic of the genre. Nothing relevant Throughout the story, which can be exhausted in a matter of hours, the player's intervention is minimal. A fight on the edge of the loincloth The characters that make up the cast are three plus the protagonist, while the possibilities of altering the plot are nil. At most, you can make obvious choices that allow you to unlock different artworks (for the record: just play a couple of times to unlock them all and live happily), but the narrative progression is identical in any case, with only a few lines changed. It would matter little in the face of well-written texts and truly intriguing situations, but this is not the case. Then the problem is not just the clichs, but the demonstrated inability to rework them. By now there are dozens of translated visual novels, at least in English (this one too does not have Italian), some of them even very beautiful and well written, so it is easy for fans of the genre to have the appropriate cultural means at their disposal to make the necessary comparisons. In short, falling in love with girls aside, there are few reasons why anyone should choose Sakura Angels over other titles. For example, Nekopara Vol. 1 costs the same price, lasts longer and doesn't hide its desire to show undressed girls with big boobs behind an adventurous story (in that case there is also the eroge version, but let's not digress too much ). Furthermore, it is also technically better. In short, Sakura Angels on his side has very few cards to play, cards that are not enough for him to rise from the crowd. Despite the boobs, Sakura Angels can't get beyond the clichs of genre visual novels", "date": "2015-02-05", "grade": "3.5"}