{"name": "Cogito ergo tubero", "ref": "https://multiplayer.it/recensioni/144524-potatoman-seeks-the-troof-cogito-ergo-tubero.html", "text": "It took the Hitchhiker's Guide to the Galaxy supercomputer seven and a half million years to formulate the answer to the Ultimate Question about Life, the Universe, and Everything. A disproportionate amount of time, especially when you consider that, seven and a half million years later, the electronic brainiac's response was a terse ~Forty-two.~ I don't know if the characters born from Douglas Adams' pen reacted by cursing and throwing their smartphones in the air, but after finishing Potatoman Seeks the Troof, the most instinctive reaction is exactly that. Pixeljam's game tells the masochistic epic of a little potato-man in search of the truth, an adventure that ends in a mocking way after a journey full of impossible obstacles and infamous traps. Yet there is a well-known travel aphorism that states: the important thing is the journey, not the destination. And Potatoman's was certainly an intense and cursed journey. Difficult and almost sadistic, Potatoman Seeks the Troof will strain your nerves Potato truth Released a couple of years ago on PC and only recently landed on mobile devices, Potatoman Seeks the Troof is already told through the name. In fact, the protagonist is an anthropomorphic potato (more like a little naked man, actually) who sets off on a long journey in the hope of finding the truth. What truth, however, is not known: it could be the real reason why a tuber should have eyes, arms and legs, or it could be a response to the meaning of life. To the player, the task of interpreting. Potatoman Seeks the Troof fits into that niche of deliberately sadistic and extremely difficult games, in which the user has to learn a few simple rules (you move and jump), but is continually thrown to the ground by the developer's tripping. One thinks of The Impossible Game and, above all, of Cat Mario. In a level set in the desert, Potatoman teaches that cacti are deadly and can be avoided with a jump; as soon as the concept has been assimilated, we suddenly find ourselves in front of cacti that leap, stretch, multiply and move treacherously. It's a small example, but it's also the only one we allow ourselves, because the whole experience is based on the continuous and unpredictable pitfalls that the developer has prepared for the player. From egg-throwing birds to mischievous squirrels, through crazed cars and shark geysers, all the way to the fiendish final level. Unlike Super Meat Boy, the difficulty lies not in overcoming traps and enemies, but in predicting their behavior and anticipating the author's moves. Which is almost impossible, and so you die and die and let yourself be fooled until you can memorize every pattern and every catch. In a similar way to what was already done with Dino Run, the team of Miles Tilmann and Rich Grillotti has also created Potatoman using 8-bit graphics that openly refer to the Atari 2600 games. of a poor or sketchy style. Each setting is unique in tone and color, and the game is chock full of little visual goodies (an example is the protagonist's idle animation). A note concerns the lack of extra content compared to the version of Potatoman Seeks the Troof released two years ago. It is true that there is no shortage of refinements and additions (such as the alternative color palettes for each game over), but the levels present are the same as in the original game, with the result that it is possible to complete the adventure in less than two hours . Provided you have a lot of patience and steady nerves, of course.", "date": "2015-02-03", "grade": "7.0"}