{"name": "Un plagio monumentale", "ref": "https://multiplayer.it/recensioni/144285-skyward-un-plagio-monumentale.html", "text": "During a class assignment, students usually fall into three categories. There's the brainiac, who goes on quickly, without hesitation, knowing deep down that his commitment will be repaid with a good grade. There are those who get by as best they can, cursing the time wasted watching TV series and hoping to get away with it. And then there's the smartass, the one with an innate ability to find the most strategic place not to be seen while copying from the nerd sitting at the front desk. Here, KetchApp seems to fall with flying colors (so to speak) in the latter category. After replicating Flappy Bird with Don't Touch The Spikes and trying the big shot with a clone of Threes! (which is ~inspired~ by 2048 and is called 2048), this time the Italian company sat behind the ustwo counter. Sure, replicating a game like Monument Valley isn't easy if you don't have the time, resources and talents, but maybe with a few tweaks... Skyward is a kind of unoriginal mix between the graphics of Monument Valley and the pace of Flappy Bird Maybe they fall for it A glance at the app icon is enough to get an idea of what the ~philosophy~ behind Skyward is. From the font used to the gradients of the backdrops, passing through the graphic style of the structures and the perspective from which you look at them. Aesthetically, the game is so reminiscent of Monument Valley that in the first moments we even doubted that the color palettes were the same. However, it takes less than a minute to realize that no, although it is an obvious attempt to mimic the work done by Ken Wong and the ustwo artists, Skyward is not even remotely comparable, in taste and refinement, to the small mobile pearl that Apple has awarded as last year's best iPad game. The choice of colors, the use of gradients or the shape of the architectures demonstrates, on the part of KetchApp, a poor and sketchy job, without an expert graphic designer behind it. Everything is then further soiled by the continuous advertising banners, which are not only invasive and always present, but also impossible to remove: unlike other free-to-play titles, there is no paid option in Skyward to remove internal advertising, and it is not clear whether it is a clumsy oversight or the desire to convince Apple to launch, alongside the awards for the most beautiful games of the year, even those for the most frustrating. However, it's one thing to copy a graphic style, it's another to replicate a gameplay that relies entirely on perspective changes. Precisely for this reason, the attempt to emulate Monument Valley stops at the stylistic component alone, with the game mechanics taking a completely different direction. In fact, Skyward is a simple reflex-based arcade, in which you proceed along a path using the movements of a blue and a red circle. One of the two circles remains stationary, while the other rotates around it, and with a touch on the screen the roles are reversed. In this way, touch after touch, you try to take small steps being careful to proceed with the right timing: in fact, you have to touch the screen when the moving circle is on a platform, otherwise it falls on deaf ears and it's Game Over. Complicating matters is the fact that each hoop can perform a maximum of two rotations at a time, an addition that gives the player a sense of urgency and keeps them alert. There is also a minimum of progression given by new obstacles, bonuses and maluses that are unlocked as certain scores are exceeded: there are those that slow down or speed up the movement of the circle when you end up on it, others reverse the direction of rotation , still others move the platforms and create gates and elevators. While far from original, this idea wouldn't even be too bad, were it not for the fact that the developers do nothing to avoid boredom: on the one hand it lacks the essentiality of a Flappy Bird, on the other it presents malus and variations in absolutely uninspired levels, which affect so little as to not stimulate the player to move forward.", "date": "2015-01-29", "grade": "4.5"}