{"name": "Pathway to Glory: Ikusa Islands", "ref": "https://multiplayer.it/recensioni/pathway-to-glory-ikusa-islands.html", "text": "The war continues Aware of the goodness of its franchise, Nokia therefore did not want to miss the opportunity to exploit it properly, immediately putting the Red Lynx developers to work on the predictable sequel. Pathway to Glory: Ikusa Islands, as it is called, maintains the same setting in terms of the war period and event, but shifts the spotlight from Europe to the Pacific. The game mechanic has certainly not been distorted, on the contrary it has remained particularly faithful to the first chapter; also in this case it is a western-style turn-based strategy, which is inspired by the unforgettable Jagged Alliance by proposing an intriguing and complete management of a small platoon of soldiers employed with the aim of achieving different kinds of pre-established objectives. Each of them has a certain number of action points, which must be spent carefully deciding which actions to make them perform. These can be walking, crouching, crawling, shooting (with varying degrees of accuracy), throwing grenades, using medkits and items, or driving various vehicles. The number of action points available at the beginning of the shift is inversely proportional to the weight of the equipment that the soldier is forced to carry, also making it necessary to plan in the set-up phase before the actual mission. The camera, raised a few meters above the ground, allows you to have a good view of the settings, which are also very rich in detail and truly gratifying to look at. The interaction with the buildings, plants and objects distributed is essential in order to find shelter from the visual cone of the enemies, the latter being particularly quick and able to punish naive and not very patient players. Artificial intelligence is in fact certainly one of the best features of the Red Lynx effort, and contributes to making the missions extremely engaging and challenging even if (almost) never frustrating; yes because defeats always and only derive from planning errors, from some move performed lightly, or from an excessive and extremely inconvenient haste. Ikusa Islands, like its predecessor, is a game for lovers of reflection, strategy, therefore inadvisable to those looking for hit and run or in any case lighter experiences. The cell phone works As mentioned, the aesthetic component of the Nokia production is certainly of great value; realistic, well-kept and extremely detailed settings are accompanied by well-characterized soldiers with excellently reproduced movements. The graphics engine is that of the first chapter, slightly retouched. But it is also the contour that underlines the goodness of the programmers' work, as well as the care given in every aspect of the game; the missions are in fact introduced by short sequences and briefings that place them in the historical context, obviously faithful to the reality of the tragic Second World War. In the same way, the sound component is excellent, which finds in the certainly not sensational N-Gage speakers the only limit to orchestrated pieces, diversified effects for each weapon and, last but not least, various digitized sentences in the original language that the own and enemy soldiers do not they will fail to pronounce. The care in the multiplayer aspect is sensational, which allows you to create games of up to 6 players; in addition to online via N-Gage Arena, unfortunately prohibitive for us due to the costs of telephone operators, there is the possibility of challenging other owners of the Nokia laptop via bluetooth, whether they own the game or not. In this case, of course, the never praised enough game sharing takes over, already appreciated in a good number of Nintendo DS games. There is also the option to play multiplayer on a single console, passing it from hand to hand to the various participants in the challenge in relation to their turns. Comment Pathway to Glory: Ikusa Islands does not revolutionize its appreciated predecessor at all, limiting itself to improving practically every aspect in a more or less evident way. However, the care with which it was packaged appears self-evident in every moment of the game, and the goodness of the mechanics studied by the Red Lynx programmers proves to be truly capable of delighting lovers of the genre. A truly leading product, therefore, which manages to snatch the palm of best game for N-Gage from Pathway to Glory. Pros Solid game structure Technically excellent Curated in every respect Cons Often marginal improvements compared to the predecessor Initially cumbersome control system Nokia itself confirmed it: N-Gage was not the success they would have expected. Evidently paying for inexperience in the field and a series of choices even in the same design of unhappy hardware, the console / mobile phone of the Finnish giant has not reached the pre-set sales goals. Nonetheless, there was no lack of titles capable, by themselves, of justifying the purchase; Pathway to Glory undoubtedly stands out in this category, an excellent turn-based strategy set during the Second World War and still the best game available for the N-Gage.", "date": "2005-12-30", "grade": null}