{"name": "Viti e bulloni", "ref": "https://multiplayer.it/recensioni/144046-rovercraft-racing-viti-e-bulloni.html", "text": "Do you remember the fun Banjo-Kazooie: Screws and Bolts for Xbox 360? Or, to stay on the mobile side, of the brave Bad Piggies? Both titles had the element of construction in the field, that is, they posed a series of challenges that players had to face by creating from scratch a vehicle suitable to overcome them. Thus we went from imagining rough structures, refining them through trial and error, and then adding engines, blocks, protections that would allow us to go beyond the most critical points of the shift scenario and arrive at our destination successfully. Here, RoverCraft Racing is precisely this type of game, and although it does not include flight among its mechanics, limiting itself to driving a space vehicle on planets with different conformations, it manages to conquer after a few minutes and take on the connotations of a real and own gaming drug. The reasons for the extraordinary degree of involvement that this title is capable of stimulating lie precisely in the binomial constituted by the construction phase, with many new objects to unlock and upgrade, and by the purely action one, in which you have to drive your vehicle along impervious paths, precisely dosing accelerator and brake, avoiding taking damage and memorizing obstacles to learn how to avoid them in the best way. RoverCraft Racing invites players to use the experience gained with each failed attempt to improve the vehicle, try new approaches, arrange the blocks differently and more. An exciting prospect for those who have had or still have some interest in LEGO or similar products. Fancy building the perfect space exploration vehicle? Then try RoverCraft Racing A piece here, a piece there RoverCraft Racing is a freemium title, therefore it can be downloaded for free from the App Store but includes a series of in-app purchases to get more quickly the gold coins needed to buy and upgrade components, as well as to unlock most of the seven scenarios available. With a little patience, and by punctually grappling with the daily challenges, it is however possible to raise virtual money without major problems, thanks to the lack of any timer to limit our attempts. An honest and sensible approach, therefore, that allows you to literally spend hours experimenting with new solutions to overcome a particular problem point and set new records until each level is completed. The grid for creating the vehicle is practically identical to the one in Bad Piggies, and equally easy to use: just drag the cockpit with the pilot and the various blocks onto the boxes to assemble the vehicle and then test its performance. At our disposal we will have more or less resistant or heavy frame parts, energy accumulators characterized by a different degree of efficiency, wheels suitable for the most disparate surfaces and even devices capable of providing us with extra abilities, such as the boost (useful for overcoming steeper) or the sensor that prevents the vehicle from tipping over after a jump. Once on the ~track~, it is then necessary to make the most of the opportunities that present themselves, collect the gold coins and the fuel refills that allow the vehicle to continue its race, wisely regulating the brake and accelerator to better face climbs and descents, jumps and obstacles of various kinds. This system, so simple but terribly effective at the same time, is supported by a good physical system (although in some cases the objects tend to go ~crazy~ after a collision) but by an only discreet technical sector, which does not shine either as regards graphics or sound. Luckily, in the case of RoverCraft Racing, it is more the substance that counts.", "date": "2015-01-24", "grade": "8.3"}