{"name": "Sceriffi su Marte", "ref": "https://multiplayer.it/recensioni/143908-space-marshals-sceriffi-su-marte.html", "text": "Going through Pixelbite's curriculum, it is clear that the Swedish team has a predilection for driving games, present in preponderant numbers in the catalog of titles published so far and are headed by a successful series such as that of Reckless Racing. Evidently eager to try their hand at a different genre, the Nordic developers have however preferred to avoid going to swell the ranks of the action and puzzles that crowd the mobile device stores, instead making an almost counter-current choice: here comes this Space Marshals, action adventure with an isometric view which, without slavishly mimicking the playful experiences offered by home consoles, manages to guarantee a decidedly deeper and more original gameplay than the average. New Wild West In an unspecified future, a spaceship with the function of a maximum security prison is hijacked by a group of criminals and all its occupants are freed: since there are no forces of order within a radius of thousands of light years, the artificial intelligence of The complex decides to wake Burton, a former sheriff placed in stasis for disciplinary reasons, from his cryogenic sleep and restore his credentials so that he can hunt down the escaped prisoners. This is the simple but intriguing premise of Space Marshals, which effectively transports all the typical iconography of the old West into a futuristic setting, complete with ugly, dirty and bad outlaws and vigilantes with imposing mustaches and cowboy hats perpetually in head. After a first mission that serves as a tutorial, the player finds himself in a base camp where he can choose his equipment, replenish his ammunition, check his progress and choose which assignment to take on. Settings and objectives differ substantially, giving the game a good sense of variety, even if basically it is always a question of going through the scenarios eliminating enemies and collecting clues and bonuses to then reach the signal indicated on the map. However, we are not talking about an arcade shooter like there are so many on the App Store, given that the emphasis of Space Marshals is clearly placed on the stealth factor: just tap on the screen to switch Burton's approach between aggressive and stealthy, with the first which allows for greater speed of movement and the second which allows you not to be perceived by your opponents. Following the teachings of Metal Gear Solid, enemies are displayed with a visual cone and various icons that determine their alert status, with the user having to try to exploit all this information to avoid direct confrontation as much as possible (which often leads to defeat) favoring the use of traps and attacks from behind. The gameplay thus takes on a particular flavor that makes it decidedly pleasant, exciting and also rather challenging, especially in the more advanced levels: the - negligible - downside is that precisely because of its nature, Space Marshals does not prove to be the ideal title for some quick game in spare time. Space Marshals has personality and good ideas, proving to be an enjoyable and rather challenging title Even the control system adopted by Space Marshals is evidently designed to favor reasoned behaviour: Burton moves with a virtual stick placed in the lower left corner, while shooting with the supplied weapon by keeping your finger pressed on the appropriate icon and dragging it in the direction of the desired goal. Pistols and shotguns have limited ammo and long reload times, and enemies have enough artificial intelligence to notice if a fellow enemy is hit nearby, so some planning is a must to succeed. However, the title provides the user with all the tools to adopt the approach he prefers: by completing the missions you can choose which new items of equipment to make available, whether it's hats or armor that improve Burton's physical characteristics, weapons with different peculiarities (range, power, number of shots, silence, etc.) or throwable objects ranging from explosives to various gadgets useful for distracting or incapacitating opponents. In short, a really excellent job by Pixelbite, who had an intelligent eye also with regard to the replayability factor: at the end of each level you get a prize based on the evaluation obtained, and from the base camp it is possible in any time to replay the stages previously addressed to improve. Good news also from comptechnical limb, which performs its task in a truly excellent way: the polygonal graphics are very colorful and cared for down to the smallest details, and the isometric view is undoubtedly the most appropriate choice, even if from time to time you feel the lack of a zoom function. The sound accompaniment is also valid, for a product whose only real flaw lies in the voracious consumption of the battery of the iPhone 5S on which we carried out the test.", "date": "2015-01-22", "grade": "9.0"}