{"name": "Guerre preziose", "ref": "https://multiplayer.it/recensioni/143681-gems-of-war-guerre-preziose.html", "text": "Puzzle Quest certainly had the merit of giving a jolt to the match-3 style puzzle game genre, inserting RPG elements into the gameplay and making the experience deeper and more interesting. In fact, the objective in the game was not limited to the elimination of gems of the same color, but also and above all to the combination of shades and skills, essential for the execution of moves that served to defeat the opponent on duty. Almost eight years have passed since the debut of the Infinite Interactive classic, but there have been clones and variations on the theme, all capable of exploiting the same idea without, however, introducing substantial innovations. The authors of the original game have therefore decided to try their hand once again with this type of production and to bring Gems of War to PC and mobile, a freemium title that starts from the solid foundations of Puzzle Quest to build a story of liberated and defended kingdoms, with groups of mighty elemental warriors vying for supremacyand to rack up a few more gold coins. Moving on a map that reflects our progress in the adventure, since each new kingdom must be unlocked and purchased, using the experience and money earned in battle, the game offers a significant amount of increasingly complex battles, an inventory where any new weapons are stored and a slot system for organizing your team. Going to fish among the defeated warriors or among those conquered by obtaining chests, we will have to develop a competitive and balanced quartet, able to exploit every useful opportunity to inflict the greatest possible damage on enemies. Gems of War presents itself as a solid and fun puzzle RPG, but uses a very limiting freemium system How much gold would I give you Let's get the bad news right away: the freemium mechanisms used by Gems of War are particularly invasive and limiting, and this inevitably undermines the enjoyment of the experience. Instead of using the now classic points system to play each match, in fact, the game asks us to spend gold coins every time we face a new opponent, then earning much less in case of victory. If mathematics is not an opinion, therefore, even the most skilled players after a series of games will find themselves with empty chests and the need to purchase a package of credits via in-app purchase, moreover at rather high prices. The only way to remain free is to wait for the conquered kingdoms to produce gold through the taxation of their inhabitants, so as to give us a nest egg again that we can use to move forward. In short, a questionable system that goes hand in hand with a real ~paywall~, which manifests itself once you reach the tenth level of experience, with enemies who become stronger and are able to better exploit the opportunities to ring combos and to inflict damage on us. After all, it is clear that there is a luck component in the gameplay and that artificial intelligence sometimes has an advantage. That said, the rules of the game are the usual: you have to match at least three gems of the same color (if there are four you get one more move), filling the elemental indicator of each of our team members. When the bars are full, it is possible to take advantage of the turn to release a move and hit a specific target or the first opponent in the hostile formation, causing him to lose hit points until finally eliminated. In short, a classic base with some relatively original ideas, which will undoubtedly involve fans of the genre and which includes an asynchronous multiplayer mode of some interest, but which is supported by a technical sector that is not convincing at all, due to visual solutions immature and sometimes even amateur level (see the ~explosions~), as well as a largely forgettable soundtrack.", "date": "2015-01-17", "grade": "6.5"}