{"name": "Need for Speed: Most Wanted - Recensione", "ref": "https://multiplayer.it/recensioni/need-for-speed-most-wanted-recensione_a.html", "text": "Here we are at what can be defined as the third chapter in the Need for Speed ~tamarri~ saga. Most Wanted includes the usual clandestine races aboard the most souped-up cars on the planet, but this time the police force returns, having been absent from NFS: Hot Pursuit 2 and eager to have their say. The plot this time sees flesh and blood actors (especially actresses) who will show you the objectives and guide you to the climb of the ~Blacklist~. Basically the list of the most wanted of which obviously it will be your aim to become first. The various characters are amusing, among which the cursed black policeman stands out who travels on a super-prepared Viper complete with sirens... The game offers vast freedom of choice: you can go around the city in search of competitions or embark on a series of challenges to overcome in order to be able to confront the members of the Blacklist. Also present this time is the convenient GPS, which if activated will guide you quickly towards the pre-established destinations, avoiding the risk of getting lost in the huge metropolis in which you will run. An important new feature is the slow tempo, which can be activated with the appropriate button. Pressing it slows down the view along the lines of Max Payne and it is possible to better focus on the curves or important indicators. Being chased by the police brings up a capture indicator which if it reaches the limit will see you landed in jail; vice versa, the more you manage to escape, the more the bounty on your head increases. The aim is to make it rise in order to be able to challenge particular opponents. The more you manage to resist arrest, the greater will be the commitment of the guardians of the law to stop you, who will arrive with tanks and even helicopters! This mode is certainly the most fun of the entire game because it allows for great destruction of cars and structures and a lot of satisfaction in escaping dozens of cops! In addition to the classic circuit races, we find the following possibilities: Sprint (from one point to another), Shot (whoever changes better wins), Elimination (every lap out of one), and the new ~Speed cameras~ and ~Race between toll booths~ . The first requires you to pass at high speeds on certain points, the second to reach the toll booths within the set time. Most Wanted gives us a taste of next generation 1/68, 2/68, 3/68... As if the long career wasn't enough, the EA programmers have added the challenges menu: 68 competitions to face with the most varied objectives. The beauty is that every time you will have a different car and you can immediately race with fast vehicles. Passing some tests will lead to the unlocking of cars and tunings. Lots and lots of longevity and low number of boring rides. The Fantastic 15 The artificial intelligence of the opponents is adjusted according to the difficulty: the first challenges will be very simple, and then gradually become more and more demanding, especially in clashes with the most powerful cars. Civilians' cars will try to avoid you or they will honk your horn while the police will try to stop you first with encircles, then with ramming and head-on! Then all the opponents can make mistakes, perhaps colliding with the truck on duty, it follows that even repeating a race you are practically never faced with the same event. Next generation inside The very first thing that immediately catches the eye is the graphics. Most Wanted gives us a taste of the next generation by offering highly detailed cars full of reflections, depth of field, and moments of photorealism guaranteed. The title is also one of the first (the second after Half-Life 2) to introduce HDR, in other words a lighting system that simulates the real gaze towards the sunlight, with a truly realistic blinding-focus effect ! The setting is the classic fictional city of enormous proportions, with different types of neighborhoods. We go from the center (with its skyscrapers), to the industrial area (run down) to the periphery (with the typical air of American villages) which includes roads through the woods. During the races it is possible to take advantage of short shortcuts but also to use objects present on the route: in addition to the destruction of particular structures that block the police, it is possible to bump, for example, trucks carrying logs, so as to overturn them on the road and block the opponents ! Or better yet go under the trailers! Notion about the movies: these are made with actors on blue screen (and then glued to the background), and put on video with a slight blur and an oil color type effect. Beautiful to look at (even if the acting is what it is) and the tutorials and presentations of the characters are wonderful (with the image that is composed in a puzzle style, a must see!). The sensation of speed is not what you would expect+ car = - accessories With NFS: Underground 2 the changes that could be made were truly a large number. This chapter has taken a big step backwards. For example, the bumper and side skirt kits can only be taken in blocks of the same type, the neon lights, lights and mirrors have disappeared, just to name a few. A real pity, only partially compensated by the greater number of cars which, however, sees some frankly exaggerated cars (like the Lamborghinis) which are then caught up by the police in a chase Too bad! EA Trax Hats off to EA for the sound: as in all games there is ~EA trax~, a collection of songs (about thirty) made by more or less famous artists, to act as the soundtrack of the title. The interesting thing is that when the police intervene, an all-action piece of music will come out, very similar to that of the film ~Speed~ which will greatly galvanize the chases. Unfortunately, even this time it is not possible to customize the playlist by adding songs and, strangely, the key used for changing tracks only works in the menus. The in-game side is fantastic, with the noise that changes according to where you run, and has a good dubbing in Italian, even in the cutscenes. Rumbles, skids, accidents, they are all in the right place and do their job very well. Of course, it's not that you feel much difference between one car and another, but it's something you'll pass on. The noise of the air trail when you pass near a car or an object is also nice, but you hear it less than the previous Need for Speed. Note: The horn is also missing on this NFS! hearing others play it and we don't irritate...Grr! The desire for 360 Compared to the other versions, the edition for the new flagship from Microsoft is undoubtedly the best in every respect. The bump mapping on the asphalt is excellent, as is the cleaning of the textures really high, not to mention the quality of the effects such as the refraction of the sun and the reproduction of smoke, just to name two examples. Furthermore, the polygonal models of the cars enjoy a considerable increase in polygons in this incarnation, which has made it possible to reach extremely appreciable levels of detail. It's a real shame therefore that Most Wanted on 360 has to lend itself to an optimization that can be improved to say the least of the frame rate when used on hdtv. In fact, at 720p the game is a real splendor when stationary, but in motion it suffers on several occasions from the unpleasant phenomenon of tearing, with the image being transported to the video in a jerky and not very fluid way; for heaven's sake, the product remains absolutely playable, but it remains a real mystery why EA did not want to pay more attention to this important aspect. The Xbox Live component, on the other hand, is not very developed, still allowing fun challenges for up to 4 players at the same time. Goals In Most Wanted, points to increase your gamerscore are tied to winning against blacklisted challengers. It starts from a measly 10 points all the way up to 350 for the leader board, Razor, for a grand total of 1000 once you complete the game in its entirety. Comment Most Wanted on 360 is a product that deserves to be considered by owners of the new Microsoft console. In the face of a purely arcade but fun and not without depth game mechanics, EA has in fact built with care and attention an episode of the series that is well balanced, extremely long-lived and characterized by a very personal style. Of course it is neither original nor without defects, and in the long run it risks becoming a bit repetitive, but it remains a good starting point for a next-gen development of the American giant's brand. I only regret having to note the lack of attention in optimizing the frame rate on HDTV, which should on the contrary be the workhorse of all 360 games. Pros Fun from the first minutes of the game Excellent graphics component Very personal style Cons Frame rate imperfect at 720p In the long run repetitive For some too arcadey", "date": "2005-12-29", "grade": null}