{"name": "Pinball FX2", "ref": "https://multiplayer.it/recensioni/142500-pinball-fx2-venom-biglie-al-veleno.html", "text": "The guys from Zen Studios with their Pinball FX2 have been able to set up an excellent mechanism, it must be said. After publishing the game for various platforms, the development team has in fact concentrated on its expansion, gradually adding other tables born from close agreements with other subjects inside and outside the gaming world, linked to particularly famous intellectual properties. Among these, we find the recent The Walking Dead and South Park, but also a series of contents dedicated to Star Wars and the Marvel superhero universe. To the latter belongs the character Venom, rival of the famous Spider-Man: for those who do not know this character, it is Eddie Brock, a human journalist who, as per the script, was mad at the most famous spider in the world, before an alien symbiote latched onto him to give birth to the creature in the famous black ~suit~. The new pinball machine created by Zen Studios is dedicated to the historic enemy of Spidey, which we are going to discover today: having made the necessary introductions, we just have to understand if it is really worth spending 2.99 euros to buy it, the standard price for the additional contents by Pinball FX2. Venom is on Pinball FX2 with a table of his own: guaranteed fun with Spidey's historical enemy! Greater commitment The tables created by Zen Studios have different levels of difficulty: from pinball machines with simpler game dynamics it is in fact possible to move on to others that are a little more complex, a type to which Venom Pinball certainly belongs. For this occasion, the developers wanted to have fun in creating a particularly challenging table, in which not only Venom appears, but also Spider-Man himself, creating amusing interludes with his enemy during the game. To the cry of good things come in threes, by activating the right combination inside the pinball machine a third guest also comes into play: it is Carnage, against whom Spider-Man and Venom find themselves forming an alliance to be able to annihilate its threat. Translated in terms of gameplay, the component dedicated to Carnage opens one of the mini-games that have become a hallmark of Zen Studios pinball machines, within which we are called to relive the origins of the evil creature, escaping from Venom's prison with marbles shoot at targets. Returning to a more high-level view of Venom Pinball, we can say that the lower area of the table offers very little in this case in addition to the part dedicated to multiball, thus enticing the player to send the balls to the upper area, where it can be activated most of the modes offered. Also for this reason, as we said, it is a less simple pinball machine than, for example, the one dedicated to The Walking Dead, but this does not mean that it is not fun: a pinch of extra challenge is certainly pleasing, and there are possibly other pinball machines in case you want to switch to something less demanding. Fantasy never hurts One of Zen Studios' most appreciated skills in Pinball FX2 is linked to the ability to create tables with realistic elements, often supported by components that go beyond the possibilities of real pinball machines that can be found inside bars. In Venom Pinball there are several such elements, such as for example the one dedicated to the special Spider Sense: when the ball ends up in the outside lane, it is possible to give a ~hit~ to the pinball machine to try to bring it back inside the game, thus avoiding losing it. If you believe that with this new table the guys from Zen Studios have neglected the technical component, you are far from the truth: Venom Pinball indeed offers a remarkable glance in its overall vision, particularly standing out in the presence of extremely detailed models for Spider-Man, Venom and Carnage. The three are an integral part of the various modes present on the table, entertaining the player with their animations. Their dubbing, carried out in English, is also of excellent workmanship, while the rocking soundtrack is certainly the one most appropriate to the context of Venom Pinball. Moving towards the conclusion, we can tell you that this table is perhaps one of the most demanding of the add-on contents that we have had the opportunity to test for Pinball FX2, but this absolutely does not mean that you cannot have fun: on the contrary, it will be one of those where you will have more fun hitting the maximum score, competing with yourself and with your friends. You will obviously find an extra gear if the world of Spider-Man and Venom is familiar to you, but we would like to recommend Venom Pinball even to those who don't knowand life, death and miracles of Marvel characters.", "date": "2015-01-12", "grade": null}