{"name": "Redux: Dark Matters", "ref": "https://multiplayer.it/recensioni/143239-redux-dark-matters-dal-dreamcast-al-pc.html", "text": "Redux: Dark Matters looks like the classic fairy tale from which everyone expects a happy ending: born as a project for the Dreamcast, it is a classic shooter funded from the bottom up on Kickstarter capable of collecting more than double the amount initially requested, it comes out on Sega's dead console ignored by the masses, but ends up on the lips of many enthusiasts for its pleasant gestation. After a few months the developers decide to bring it to PC by distributing it via Steam, thus hoping to obtain a minimum of commercial success. All that is missing is the kiss of true love in this heartbreaking story made up of love for an old console, resorting to the pueblo to find cash and landing on PC to face the real market. We'd like to close it here by stating that KTX Software's game is an absolute masterpiece that everyone should play, that it's the R-Type clone that was missing in this part of the universe, or even that it's the only product capable of wiping out the shadows of oblivion from a genre now loved only by a niche of gamers. Unfortunately we can't because the truth is that the excellent premises were followed by a decidedly mediocre realization. But let's go in order. Challenge ~Normal~ As already mentioned, Redux: Dark Matters is a classic horizontal scrolling shooter, inspired by the R-Type series in graphic design, from which it actually also takes some gameplay elements. Once the game has started, the game only allows you to choose between two difficulty levels, one defined as ~Normal~ and the other as ~Hard~ (Veteran). There are no additional modes to unlock, so you have to make do. Not bad, except that... Let's start by selecting the most affordable difficulty and off we go. The first level runs smoothly between waves of enemies wiped out with the powerful weapon of our spaceship, aided by the many power-ups to collect that literally armor it, leaving very little room for enemy bullets to try to knock us down. In short, when you are surrounded by defensive pods and bursts of fire capable of disintegrating almost any hostile creature with a few shots, accompanied by highly effective missiles, the situation is not one that can be defined as challenging. The first boss himself, a large robot that protects its central core with what appear to be two large claws, can do nothing against our firepower. We tell ourselves that it will improve in the next levels. After all, there are seven in total, and shumps usually never start by hitting too hard to keep the players from fleeing. Vain hope. To make you understand the discouraging ease of Redux: Dark Matters, it is enough to say that we finished it in half an hour, finding some relevant obstacles only in the seventh level, a difficulty created artificially thanks to some design ~tricks~, such as the removal of bonuses present in all other levels. Fortunately, or unfortunately, depending on your point of view, so many extra lives accumulate in the first six stages, thanks to the points obtainable from the carcasses of the enemies, that sacrificing some of them in the last one is almost a pleasure. Redux: Dark Matters first came out on Dreamcast and then PC in 2014. Can it be bad? Challenge ~Hard~ Had it been up to us, the practice Redux: Dark Matters would have been buried after the first game and not only for the extreme ease, but also for the stylistic poverty of the scenarios and enemies, all very similar and uninspired, including bosses, with these the latter all have the same ~wall~ structure, i.e. they are large walls positioned on the right side of the screen. Obviously they have different attack patterns, but the substance changes little. If we wish, we can also add to the problems the paucity of the explosions, comparable to short farts. It is useless to compare them with those of the classics of the Japanese genre; the Japanese masters know how to make the flames rage and fill the screen with molten metal, setting the pace for the destruction. Here even the bosses rather than exploding seem to disappear into thin air. Unfortunately we decided to play again, selecting the other difficulty level, in hopes of finding a greater challenge... we found it. Redux: Dark Matters is as easy to play on 'Normal' as it is frustrating to play on 'Hard'. It's not a matter of increased resistance from enemies or more complex attack patterns. The greatest difficulty derives from the use of a different spaceship which lacks all the protections of the one of the easiest level: before we were flying battleships, now we are like Duck Hunt's ducks. The difficulty rises so much that just to overcome the first boss we have sweated the proverbial seven shirts, due to the large amount of fire thatand shoots at us and the design of the section in which the fight takes place which tends to trap us all the time. Let's not talk about the second level, which from an easy walk to a ~Normal~ level, at a ~Hard~ level becomes a hell of enemies and bullets coming from everywhere. Unfortunately we are sorry for the romantics, but we are not talking about a justly difficult challenge, but one created artificially and due in part to the design flaws of levels designed to be tackled with starships equipped in such a different way. In short, we are not dealing with a Radiant Silvergun, a Raiden, an Astebreed or any Darius Gaiden, just to mention difficult but fair shoot'em ups. In Redux: Dark Matters it seems to be constantly victims of a mediocre design, which not only leaves us no way out by repeatedly eliminating us, but which does everything to make us desist from playing.", "date": "2015-01-09", "grade": "4.5"}