{"name": "Kao Challengers", "ref": "https://multiplayer.it/recensioni/kao-challengers.html", "text": "The controls respond more than well and the levels are wide and qualitatively detailed. The clashes are generally all quite simple, except those against the bosses at the end of the area. While not offering the gamer a high degree of challenge, the latter nonetheless present such a personalization and originality that defeating them will require a fair level of planning since, to beat them, it becomes more appropriate to use less force and more logic. And in this sense, both for the observation of the target and for the control of our hero in boxing gloves, a fully user-controllable camera has been implemented with the 4 directional buttons, which together with the telescope that can be activated with the L key really allows to scan everything that surrounds us and therefore, in the case of enemies, to evaluate well how it is appropriate to face them. Without forgetting that with this system you can also enjoy the view of a respectable aesthetic sector. The graphics are in fact the best seen so far on PsP. Colorful, detailed, fluid, with a constant frame-rate, Kao can actually count on a solid and effective engine, if we except for a few bugs scattered here and there, such as certain ~holes~ that appear in a couple of locations, probably the result of a certain haste in closing the creation of the game within the times set by the production. The main characters, whether they are the protagonist or the enemies, are made with a good number of polygons and covered with well-made textures. The weak point of the game is the sound. While presenting discreet music and valid environmental effects, Kao Challenger offers an Italian dubbing that is not quite up to par, due to the unpleasant PCs' voices and an adaptation that is not faithful to the original texts, with some visible differences between speech and subtitles. Last note on the Wi-Fi multiplayer mode: beautiful, well packaged. Up to 4 players can compete simultaneously in 3 different Deathmatch modes with more than 20 weapons or even in crazy races along 5 tracks. Element, this, which gives the game a further enrichment. Conclusions Atari's first platformer for PsP, developed by Tate Interactive, is a game which, despite some weaknesses, is a candidate to be counted among the most interesting platformers for this console. Perhaps also because, together with Medievil, it is the only exponent of the genre at the moment... However, despite its simplicity, Kao Challengers is a good platformer that is very fun to play alone or with friends, and capable of offering a fairly decent level of entertainment. The confirmation that, sometimes, simplicity and tradition are not synonymous with old-fashioned and boring. Pros: Completely in Italian, even the spoken language. Fluid and colorful. Appreciable multiplayer. Cons: A bit repetitive. No particular ideas Created specifically for the Sony portable console, not very original, indeed, not at all, Kao Challengers is an interesting platformer full of humor, fun and with a high degree of replay value due to the many extras that can be unlocked once the game is completed. The structure of the game is the classic one of every title of the genre, and consists in carrying out various missions divided into different levels (and sub-levels), complete with final challenges to the Boss on duty, until the adventure is completed. The gameplay is therefore a mix between action and platform, and basically it almost seems like a cross between Crash Bandicoot (to which our cute kangaroo looks a lot like) and Jak & Daxter, but less profound. The clever young kangaroo will have to save the world of animals from the hands of an evil hunter and his evil henchmen. Through a journey that winds through 20 highly detailed and colorful levels divided into 5 universes, from the Arctic to Australia, we will guide Kao in his adventure, during which we will be able to count on the help of his friends, including fireflies and parrots, who they will do everything they can to support him and complete his difficult task. To move quickly from one scenario to another, more or less improvised means of transport will be available such as catapults, pelicans, snowboards and a jet ski, also good for being used in turn as an unconventional weapon or for performing some races at time to collect rings and other bonus points. During the game, scattered along the way, you will have to collect purple Crystals and Gold Stars, useful respectively for gaining access to five mini-games in the Cursed Pier, and for acquiring upgrades for physical abilities. Some of these power-ups can even be hidden in secret areas. Other items to be collected in the various levels are the Ducati, necessary to corrupt the wicked. Kao inmoreover he is able to ~evolve~ almost like a Pg from Gdr. During his journey, in fact, the kangaroo will be able to learn as many as 7 different fighting techniques that will allow him to better face every situation or boss that will appear in front of him. In this way our virtual friend will be able to launch devastating attacks against the over 30 types of enemies present in the game. To take down his opponents, or simply survive the pitfalls present in each level, Kao will be able to alternate with melee moves (such as the terrifying tail slap), even the use of weapons such as a boomerang, just to give an example.", "date": "2005-12-29", "grade": null}