{"name": "Banana Kong 2", "ref": "https://multiplayer.it/recensioni/banana-kong-2-recensione.html", "text": "Ten years in the gaming field are definitely a long time, but for Banana Kong it seems that time has stopped: the first episode, released in 2013, offered an endless runner experience halfway between Donkey Kong Country and Jetpack Joyride, focusing in particular on variety of situations and scenarios, generated in a strictly random manner with each new game. Well, today we are grappling with the review of Banana Kong 2, a sequel that arrives after almost ten years, but right from the start it appears decidedly conservative, renouncing to introduce who knows what novelties compared to the beginning of the series and indeed ending up sacrificing something on the altar of a more refined technical realization. Gameplay: oldschool, baby Banana Kong 2, the protagonist runs while being ~chased~ by an avalanche of bananas If you've spent a lot of time with the original Banana Kong, you won't have any trouble familiarizing yourself with the formula of this new episode, as it's basically the same. The gorilla protagonist of the game finds himself having to flee from the collapse of a mountain of bananas that he himself caused, a bit like in Alto's Adventure, but he will have to avoid the many obstacles along the way. From rocks to barrels, passing through a series of more or less dangerous creatures, we will have to use the jump (executable via a simple touch of the screen) to dodge the pitfalls and continue running, or ~glide~ hooked to a large leaf (press and hold) to overcome large distances, or still project us downwards in correspondence with flowers that allow us to bounce and reach unprecedented heights. Not happy with the avalanche of bananas behind us, we will be able to collect more during the game and use them between one attempt and another as a bargaining chip for the purchase of aesthetic objects or upgrades, whether they are temporary or permanent. That's not all: just like in the original Banana Kong, we will be able to fill an indicator which, once charged, will allow us to make a powerful leap forward and recover ground. In the meantime we will see the scenario change often and willingly, through makeshift passages and vehicles that we will discover to be de facto mandatory. Some will lead underground, others to the bottom of the sea, consequently modifying the gameplay and introducing new mechanics both in terms of the platforms to jump on and the dangers to avoid. Banana Kong 2, one of the underground stages Banana Kong 2 is a freemium game, therefore it is possible to download and use it for free, without particular limitations: sometimes advertising trailers appear which, however, can be skipped, but an in-app purchase of  14.99 is available if desired, which eliminates the ads and deliver different rewards. Frankly, the figure is a little high, but we are talking about microtransactions that are anything but mandatory. Beyond the lack of concrete innovations compared to the debut episode, unfortunately there is a problem with the responsiveness and precision of the touch controls, which sometimes they do not understand our inputs well, especially as regards the forward shot, and this often translates into undeserved game overs (after all, an impact is enough to die), giving rise to inevitable episodes of frustration. Technical Achievement: Better or Worse? Banana Kong 2, a snowy scenery From a technical point of view, Banana Kong 2 tries a bit to reinvent the style of the series, completely redesigning the graphics of the protagonist and eliminating the two-dimensional approach of the beginnings, which however many appreciated. The final result is a bit controversial, in the sense that there are certainly more animations and details, but the sensation is of having lost the charisma of the origins. A discussion that extends to the sound sector, again purely functional and not very original, of solutions that for some reason remain in the head, but above all emptied of some of the nice audio effects of the first episode. However, the bongo and xylophone music is cheerful enough to accompany the action.", "date": "2022-07-27", "grade": "6.5"}