{"name": "Redenzione fetida", "ref": "https://multiplayer.it/recensioni/142909-lisa-redenzione-fetida.html", "text": "While the writer tried LISA to review it, he happened to delve a bit into the PC version of Final Fantasy XIII as well. Obviously the comparison is very forced and we reiterate that it arises from chance, but we would like to share with you a first impression that has become certainty with the hours, which well explains the greater quality of the Dingaling title and, in general, how much the production values are indifferent to the capacity expression of a video game. Final Fantasy XIII has a very long introduction, which lasts for long hours of gameplay full of cutscenes in which we get to know the mechanics, environments, plot and characters. The spectacle it delivers is as superb as it is empty, with these perfectly modeled 3D dolls playing their parts flawlessly, yet failing to convey anything but the economic power that made them possible. After many hours spent in front of the screen, one realizes that there is little that is memorable and that it is still difficult to connect emotionally to anyone. Square Enix's kaleidoscope of cosmic dust is counterbalanced by the poverty of LISA who, with her few minutes of introduction, manages to emotionally involve the player to the point of no longer allowing him to detach himself. Not much actually happens: in the first sequence we see a little boy, called Brad, being beaten up by a group of bullies. Back home, his alcoholic father insults him, throws a bottle at him for letting himself be beaten for the umpteenth time and sends him to his room to sleep. In the next sequence we find Brad now an adult wandering in an arid and desolate scenario. The world is the victim of some catastrophe of which we know nothing yet. Brad finds a little girl on the ground and, after making her fall by mistake, decides to adopt her by taking her to his shelter, where she lives with other men. We therefore discover that there are no more women on Earth and that the suckling is the only hope for the human race. If the scum that still populates the planet knew... Brad decides to keep it hidden. With a game of ellipses and flashbacks, in which we see the torments of the protagonist, who can't forget his father figure, and those of the little girl, who would like to see the world growing up, we arrive at the first real game sequence, where Brad saves a strange character by a wild animal and, accompanying him to his home, he discovers that his companions have been brutally massacred and the girl, now almost a woman, has disappeared. The man then decides to go in pursuit of the kidnappers to save her. Black humour No long movies, no 3D graphics, in twenty minutes of story we are already lost in Brad's head, a rough-looking but psychologically fragile character who wanders in a grotesque world where humanity lives mad and deformed, capable of carrying out any possible brutality. To help him there will be some strange but absurdly nice characters, also in tone with the setting, such as an old man who defines himself as the only historian left alive, but who is only able to speak of the contempt he felt for his wife and envy of his neighbor. There is blood everywhere in LISA's world, but also so much humor used with such skill that it leaves you speechless. The entire game is full of absurd gimmicks and over the top moments, all the more amazing if you think of the author's ability to compose everything in minimal pixel art graphics, with very few animations. Even more amazing was discovering how much LISA has deep and articulated mechanics and how vast the explorable world is. We sincerely expected a title that would last a handful of hours, of which we wouldn't have complained, and instead to finish it, it far exceeds fifteen hours and you can replay it several times to experience all the crossroads, some of which are really hard to digest, with extreme situations that could shock more than someone, such as the possibility of starting a fire in an orphanage, the use of very powerful drugs to beat enemies, the possibility of losing party members playing Russian roulette (without being able to resurrect them ) and many others. LISA is a title full of spectacularly fetid moments, always told with a paradoxical taste, which leaves no one indifferent. From this point of view it is also an exceptionally varied title, which always tries to propose something new from the beginning to the end, succeeding fully. We have reviewed LISA, an indie role-playing game that is surprising in some ways More complex than it seems Speaking of pure mechanics, we can define LISA as a classic Japanese RPG, with a very varied combat systembased on various attacks, skills and powers. For example, some characters can use their gab to obtain various effects, such as arousing fear in opponents or enhancing the defense of a companion, while some attacks activate a system of combos complete with super moves that are performed using the WASD keys (the first sometimes you need to practice a little, but then you get used to it). There is no shortage of special clashes in which you can only win using some key objects, or which require particular strategies. As a genre has it, by going around you can buy extra pieces of equipment that allow you to improve the characteristics of the characters. There is no shortage of elements in the metroidvania, with power-ups to be found (such as the bicycle) to reach otherwise inaccessible places and move forward in the plot. As we specified above, the world of LISA is very vast. The exploration proceeds by connecting areas, which are usually connected to other sub-areas that contain the objects necessary to move forward or some objectives to be achieved. There is no real map to help us explore, even if getting lost is really difficult since the action is framed from the side. Of course, in some cases you can find yourself lost, but we imagine it is part of the developer's project not to help the player too much, given that overall LISA is a difficult title. Not impossible, but not a walk in the park either. It soon becomes clear that you have to learn to use the available resources well, especially the healing ones, and that even resting to recover health and energy, the latter necessary for special attacks, can prove dangerous. For example, we have fallen asleep in front of a bonfire and found ourselves waking up with one less partymate, but with one more ransom note. Arrived at the hideout of the kidnapping gang, we were asked to pay immediately to get our friend back. Not having enough money and being curious about the possible developments of the situation, we refused. The result was brutal: our friend had his throat cut and we had to face the whole gang. Sublime.", "date": "2014-12-31", "grade": "9.0"}