{"name": "Un mistero nero come il petrolio", "ref": "https://multiplayer.it/recensioni/142821-sunset-overdrive-the-mystery-of-mooil-rig-un-mistero-nero-come-il-petrolio.html", "text": "The first Sunset Overdrive expansion has already arrived and brings with it all the load of references deliberately anchored to an out-of-fashion past, irreverent jokes and nonsense of the main experience. The gameplay is what anyone who has faced the main experience knows well and is made up of parkour tricks, big jumps, monsters with extreme mobility, large mutants and improbable weapons. This mix is extremely fun once you get carried away with the various commands that are not always intuitive, and which also leaves room for the evolution of skill by enhancing the combinations of combat and acrobatic moves with multipliers, additional points and rewards. The Mystery of the Mooil Rig, however, also adds something to the overall narrative of Sunset Overdrive while dragging us outside the confines of Sunset City to lead us to the exploration of an oil platform which is the core of the expansion. The new building can also be seen from the city but unfortunately it cannot be reached freely and the attempt to approach it empty leads us to bump into an electromagnetic barrier that has no qualms about making fun of us. Although desired, it is a false statement compared to the absolute freedom of movement of the base game but the story, if nothing else, also involves the main characters and there is also a mission that asks us to return to the city acting as a link between the two areas. The expansion, in essence, is physically disconnected from the base map but, while not involving anything shocking on a narrative level, it is not a sterile addition, resulting in a coherent and engaging spin-off. In addition, the update also introduces two new mechanics related to water, an element in which we find ourselves wallowing during some of the new missions. The first novelty is the slide on the water, a mechanic already present but revised and more effective because it can be chained, with the aim of traveling greater distances and escaping desperate situations, with the super jump that allows us to quickly emerge from the waves with a mighty leap and to perform a powerful bomb dive complete with a rotation in full Tania Cagnotto style. Both mechanics will also be implemented in the base game, at least according to the developers' statements, and therefore the expansion should not be needed to be able to use them, but it is clear that the full sense of these innovations can only be obtained through the new contents that have been designed precisely to include and enhance new moves. Sea, a large octopus and liters of oil are the cornerstones of the first expansion of Sunset Overdrive Xbox One goals Mystery of the Mooil Rig brings with it 250 points, most of which can be obtained by advancing from mission to mission until the sprawling final boss is defeated. To get them all, however, a pinch of skill is required given the need to beat the developers' score and to survive the Chaos Squad mission with at least 2000 Chaos points. Octopus salad with a garnish of petroleum To begin with, the already well-known Bryllcream takes us to the platform, a guy without arms and legs who struggles a lot to get on his new mech in a skit suspended between the ironic and the disarming. Shortly thereafter we find ourselves defending him in the skies of Sunset City with the aim of helping him save his little sister. To do this, however, we have to face new creatures, hybrids of those already present in the game, born from the fusion between the fearsome mutant drink Overdrive and the equally fearsome, albeit in a more subtle way, oil. But before being able to reach the oil rig, which is located southeast of the city, it is necessary to go to the FizzCo Caf and in order to access it, it is mandatory to have first completed the ~Find a Friend~ mission which is part of the main storyline of Sunset Overdrive. Once the formalities have been completed, it is therefore necessary to lend a hand to Bryllcream who is first tossed around the city and then dumped on a beach full of new explosive mutants made even more dangerous by the fact that their detonating bag is full of oil. Thanks to our more than supplied arsenal, we solve the problem in a matter of seconds and then find ourselves in the sky, aboard our highly advanced combat helicopter. At this point, once you have easily knocked down a handful of flying creatures, the fulcrum of the expansion appears before you, represented by a huge sea monster full of tentacles. Ruthlessly cut down we find ourselves facing the second mission that recalls the famous film Tremors, that of the underground worms, here revised in an aquatic version. And here we are finally arrived at the oil platform whose peculiarity is to further enhance the verticalityof movements. Obviously, there is no shortage of railings to travel at high speed but there is not that sense of freedom that one feels crossing Sunset City at high speed and the platform loses its charm even in stylistic terms, inevitably resulting in more rigorous colors and less rich . Despite this, the huge structure that stands out in the center of a small archipelago is a beautiful sight, especially from a distance, and gives us nine good quality missions, enhanced by the new mechanics and a couple of original ideas. Let me be clear, excluding the two aquatic moves we are talking about a full-blown ~more of the same~ and this means that if Sunset Overdrive has tired you it is unlikely that you will find new stimuli in this expansion despite the two new weapons, the new upgrades and the final boss which is a pleasure for the eyes but like the missions it does not offer a noteworthy degree of challenge. Otherwise, if you still want to jump around and detonate monsters with explosive teddy bears, the new oil poppers are waiting to reward you with liters of sewage poured everywhere. To be able to face them, the price to pay is 9.99 euros for the single expansion or 19.99 for the season pass which includes the weapons package already available on the marketplace and subsequent expansions.", "date": "2014-12-30", "grade": null}