{"name": "Cantami", "ref": "https://multiplayer.it/recensioni/142709-elegy-for-a-dead-world-cantami-o-diva.html", "text": "It seems strange that in an era where everyone is constantly writing to friends, acquaintances, passing users or the whole world, someone has felt the need to create a game that invites people to tell stories. Yet there is a difference between the text that was once intended for the private diary, and which we now shamelessly make public, and the telling of a story, which must overcome the biographical experience to speak to as many strangers as possible. Elegy for a Dead World is a framework for the latter type of writing. As an astronaut we can explore three two-dimensional planets, walking or flying. If we like we can also sit and simply admire the view. From time to time, the symbol of a quill pen signals to us that there is a place where we can write our words, letting ourselves be inspired by our surroundings. At the end of the journey we will thus have a story of our journey to publish online and share with other users. The stories are all short enough to read quickly, and the texts are accompanied by images of the planet we have explored. Readers have the ability to report stories to other readers, so that a story born within our home walls could reach the smartphone of a Japanese player standing inside the subway train. If you're afraid you don't know where to start, don't worry: for each of the three planets, the developers have prepared narrative frames which, in addition to the incipit, provide a common thread for the story, offering sentences to complete for each block of text. Obviously we are always free to delete the sentences prepared by the developers, but usually having stakes is the best way to stimulate creativity, which needs some limits to take root and take shape. Thus we find ourselves telling the story of a colony of living beings that cannot find peace, or writing a long love letter to our partner in which we tell why he or she would love that planet too. The incipits are very varied and also include texts designed for those who want to learn the English language. If, on the other hand, you already have a clear idea of what you want to tell, or you prefer the images alone to inspire your words, nothing prevents you from landing without a guide and starting to write as if you had a blank sheet of paper in front of you. Elegy for a Dead World is an invitation to find the best words to tell what we imagine Flashes of inspiration The three explorable planets are named after three great poets of the past, Byron, Keats and Shelley. Each planet has a very defined atmosphere which differentiates it from the others, both in the choice of colors and in the background music. What unites them is the presence of remains of buildings that belonged to some civilization of the past. Sometimes, during our wanderings, we can enter a building of some kind and thus discover a library, alien machinery or the head of a gigantic statue. A sense of decadence permeates the three planets, and it is difficult to escape its influence when writing, just as the science fiction setting penalizes those who prefer a story closer to everyday life. However, it must be considered that the structure of Elegy for a Dead World above all encourages the writing of fragments with a lyrical tone, as if they were prose poems, if not actual verses. On the other hand, the names of the three poets and the decision to offer desolate but suggestive environments is a clear indicator of what the will of the developers was, more interested in stimulating the creative gesture than in training new writers. We cannot therefore blame the game for a limitation that defines its identity. Therefore, if you want to write stories with a plot, and therefore with conflict, you may be disappointed. The real problem for us lies in the choice of language. If you don't want to write in English, all the incipits supplied with the game are useless and you can only try your hand at free writing. Even in that case, however, it will be very difficult for those who speak and write in an uncommon language such as Italian to find a sufficient number of readers with whom to share their texts. On the other hand, with the funds raised on Kickstarter, Elegy for a Dead World could not aim at a large audience, and must therefore be content with being an important starting point. However, the message was written and launched. Now let's see where the current will take him.", "date": "2014-12-24", "grade": "7.0"}