{"name": "Fantasia di zappe", "ref": "https://multiplayer.it/recensioni/142499-rune-factory-4-fantasia-di-zappe.html", "text": "Born as an offshoot of the Harvest Moon series, Rune Factory is one of those titles that immediately releases the most classic archetypes of the Rising Sun. It is probably the only saga that blends the most typical routine actions of an Atelier or an Animal Crossing with those with an action-like attitude typical of Y's or the Mana series, and it does it in an ideal way. It is no coincidence that the historical producer Hashimoto has ideally approached ~a Harvest Moon with weapons~. And if it is true that in the most artisan tradition in passing from swords to ears of corn the step is rather short, the charm of Rune Factory 4 is undeniable, hand in glove with the iron will to remain attached to one's own structure, polishing some corners. Everything returns, even the treatment reserved for publication in European territory, this time however - unlike Shin Megami Tensei IV - Nintendo of Europe has nothing to do with it in any way. This is in fact the sad story of Neverland Co., a developer who in 1993 carried out a personal and successful idea of a simulation applied to the action role-playing game system, mixing elements of agriculture, fishing, cooking and social relationships. Rune Factory 4 was released in July 2012 in Japan, where it also received an excellent result at the box office, to then be released in October 2013 in the United States. Unfortunately, Neverland went out of business due to bankruptcy in November 2013, dashing any hope of seeing it in the Old Continent; European users had to wait for an XSEED-Marvelous AQL deal to get their hands on the title. On one condition: the title was released only in digital format, then forget any localization, lines of text and audio are completely in English. This, unfortunately, is a problem; between dialogues, technical terms and tools, a sound translation would certainly have helped a title that makes its potential audience niche. Shoulder hoe. So much to do and a kingdom to manage: Rune Factory 4 is confirmed as an excellent exponent of the saga Accidental prince The narrative pretext is quite simple: during a journey by airship, the protagonist - the player chooses the male or female character - finds himself involved in a scuffle in which he loses his memory, including the important reason why he is travelling. Not only that: dazed and confused, he slips on the edge of the vehicle, swooping towards the ground. It is by landing on the back of a dragon - a sort of divinity - that misunderstandings begin about the role of the presumed messiah who came down from heaven, mistaken for the prince of the territory and therefore invested with the relative responsibilities. A clich, of course, but the omnipresent and by now well-known self-deprecating lightness of the Japanese dampens the forcing of the plot, thanks also to the Arcadian climate in which settings and buildings with floral motifs give a pleasant fairy tale flavor. The city of Selphia has to be managed, and it's up to us to do a little bit of everything; when we write it all down, we mean it. Hoeing, planting seeds, watering them, organizing events, solving problems, chopping wood and maybe doing some dungeoning in the meantime. There is much more, but Rune Factory 4 requires a little effort at a time, given that the amount of quests and routines to be dedicated to depend on a counter - the Rune Energy - which empties with each action. This is a title that must be studied, taken calmly, without fury; the in-game days will pass quickly, but it must be said that the game returns a fair sense of satisfaction. Like any advancement based not only on mere fighting, the peasant tradition from which the franchise takes its cue offers beautiful moments in which to get lost in the field, in the kitchen or perhaps on the lake, fishing. Light, delicate and never boring, also thanks to a screen update of 60 frames per second which conveys a certain dynamism and stimulates you to always perform a new action. The long initial tutorial - much above average, no less than ten hours - that the title shows in all its characteristics has passed. More of everything The combat part is only a fraction, but this does not hide a painstaking care in guaranteeing it its own dignity. Taking advantage of the lower screen of the Nintendo 3DS you can always keep an eye on the direction, maps and position of the supporting characters, so as to never get lost. The title allows you to assign the use of weapons and magic to the four buttons, providing a sub-menu where you can show the rest of the inventory. The interface is not very comfortable, indeed, rather cumbersome; we will have to get used to it a bit to better manage the backpack slots and avoid filling everything after a few areas and a lot of collecting collectibles. Although not as thorough as pure action,in its small Rune Factory 4 has it all: dungeons, puzzles, bosses, treasure chests, backtracking, a fast but non-trivial combat system and a constant sense of growth in related skills. Completing quests gives Prince (or Princess) Points, or points that we can spend for classic progress: organize events that will increase tourists, increase backpack capacity, build new shops and increase their supply. The system works and stimulates the completion of new missions, which will thus guarantee new lines of dialogue, often very funny although clearly inspired by shojo. Here comes another great parenthesis that inherits its peculiarities from Harvest Moon: relations with NPCs. Selphia's characters are interesting and characterized, both aesthetically and psychologically, unfortunately there aren't too many; it will still be pleasure and curiosity to deepen their relationships, go out together as two lovers and in the last appeal convey to the wedding. And if humans really aren't for you, don't worry: with a little effort and the right bait, it will take a moment to have trusty monsters by your side with which to set off on an adventure, or perhaps exploit them to cultivate the field for you. The 3D effect The many two-dimensional artworks make the parallax practically useless, relegated to a mere filler to enrich the depth of some sections in the dungeons. Not having particularly interesting implications on the gameplay, the activation or otherwise of the right slider depends exclusively on your desire to increase the credibility of the parts of the map created with the game engine. Inside the fairy tale Carefree and engaging, if you manage to get into its mechanisms Rune Factory 4 will be able to keep you company for dozens of hours. Selphia is a self-contained world, where each character has their own routines, tasks and houses to enter, making the game world a place that is alive and never predictable. A good technical aspect and sound hold up well over the years but fluidity is the real panacea for all those routine actions that can get boring in the long run. The latest effort of Neverland is the culmination of the saga that began 8 years ago, but it is necessary to point out a now clear emphasis on quantity rather than depth. There are many actions to be carried out and to be carried forward, albeit playfully poor if compared to other more specialized exponents; is not a criticism, but rather an observation of how the product makes versatility its strong point, relegating each fraction of its offer to a filler that blends harmoniously, forming an unassailable whole as a whole, but which certainly leaves room for a certain superficiality in the moment in which one would like to really delve into every aspect of it. Excellent work done by XSEED in peppering the title with hilarious lines of dialogue, capable of entertaining and always providing one more reason to talk to everyone - thanks also to an above average dubbing - continuing one piece at a time in the story, certainly not the strong point of the title.", "date": "2014-12-19", "grade": "7.5"}