{"name": "Sweet dreams are made of Beans", "ref": "https://multiplayer.it/recensioni/142455-bean-dreams-sweet-dreams-are-made-of-beans.html", "text": "The first Beans Quest had already managed to emerge from the chaos of mobile productions, despite its modest size production and the poor visibility that could derive from this, thanks to its greater qualities: a clean and colorful look, which closely resembled the golden era of 16-bit platformers, in particular with a graphic rendering that somehow referred to the times of the Amiga, and a simple but well-studied structure and above all perfect for control via touch screen. Certainly the action could be monotonous and even excessively simple, but the intuitive mechanics and those bright colors, complete with a copper-like sky in perfect Amiga style, could not leave one indifferent. The nostalgic aesthetic is reaffirmed in this new chapter, but the reference to a retro style is not to be deceived: the game in question is anything but an attempt to emulate old glories of the past, presenting itself instead as a particular interpretation of the perfectly suited platform in the mobile context, capable of combining the depth of certain historical productions with the intuitiveness of a game specifically designed for touch screen controls. In Bean Dreams the original concept reaches a remarkable maturation, distilled through the various experiences lived by the Kumobius team from that first debut title to today until it assumes a more complete and balanced form. Leaving aside the sketch of an unpretentious story that characterizes the first chapter, in Bean Dreams we immediately immerse ourselves in the action, with our heroic jumping bean who simply finds himself wandering through different dreamlike settings characterized by themes and different atmospheres, without too many logical connections to pull the strings of the discourse, just the desire to move forward to discover new levels. The structure is substantially the same but there is greater care in the level design, designed to be enjoyed even in small doses through short levels, which lends itself to different approaches thanks to the stratified objectives that stimulate replayability in particular, setting increasingly challenging goals while never presenting a challenge high enough to frustrate the player. All this, incredibly, by simply requiring taps to the sides of the screen. Being a jumping bean is actually a lot better than it might seem Dream bean dream For those unfamiliar with the original, Bean Dreams is essentially a platformer with puzzle elements and multidirectional scrolling which has its main feature in requiring only two inputs from the player: lateral movement to the right and left. The protagonist bean is perpetually jumping, which determines a whole particular mechanic in the control between platforms, with the need to dose the lateral thrust in order to make him go exactly where he wants within the levels, avoiding traps and enemies and reaching the bonuses and the finish line at the end of the level. It can be seen as a sort of cross between the characteristics of Doodle Jump and a classic platformer, but with puzzle implications in the precise calculation of the movements to be made. Each level offers a series of objectives to be unlocked of varying difficulty, requiring the collection of all the fruits scattered within it, the special hidden Axolotl (or in any case positioned in particularly difficult to reach areas) and above all the smallest possible amount of jumps. Each bounce of the bean is in fact constantly counted and the greatest challenges are precisely posed by the objectives linked to the least amount of jumps made to reach the end of the level: in this case a rather different style of play is triggered from that aimed at collecting bonuses , all striving towards the perfect performance through the precise calculation of times, movements and bounces so as not to waste jumps (note that killing enemies with the typical head jump gives a bonus bounce). The various objectives achieved at the end of the level (picking fruit, conquering the Axolotl and returning to the maximum amount of jumps foreseen in three difficulty levels) grant stars, which are essential to reach the various game worlds that make up the map, each characterized by a certain amount of stars required to access it.", "date": "2014-12-19", "grade": "8.5"}