{"name": "Tra follia e realt", "ref": "https://multiplayer.it/recensioni/142080-the-old-city-leviathan-tra-follia-e-realta.html", "text": "There are games that leverage our emotions, laying the foundations of the narrative structure on a dichotomy that splits the plot of the story in half: between fantasy and reality. The Old City project, unlike many others, is not completely original, but in a sense the way we will experience it manages to be. Difficult to be able to describe it precisely, but if in the next chapter we will reveal some of the key elements of this journey, in this one we will tell you the titles from which some parts seem to have been extrapolated. The basic idea is that of Dear Esther, that is to go around environments useful for evoking the ghosts of the past or recalling objects that can in some way help you unravel the doubts you have placed on a deliberately incomplete plot. Your central hub, from which everything starts and in which you are often called, is a child's room, which is also very small, using the same expedient as Silent Hill: The Room. Once you open the only door in the environment, intertwined paths will open to you, all very different, but linked by some symbols and by the story that will guide the direction of your research. It's a universe that seems to come out of Kevin Levine's mind, because everything moves slowly, to let you savor the view and allow you to find the clues scattered in every room. The Old City is an interesting if not fully accomplished narrative experiment Notes of a survivor Unfortunately, as mentioned, it is not possible to reveal too much to you, because we would pollute your experience. We will then exploit the same pretext of the game, so that you can draw any conclusions by evoking certain moments. The narrative voice that welcomes you is warm, yet reveals the uncertainty and fear of those who do not understand, like you, what is happening around them. The cell shading graphics, while not very detailed, do not leave out any detail useful for your involvement. Even the environments, very different from each other, are modeled and colored so that you always feel part of the plot. You move by walking, between streets and corridors, in and out of various structures; you will visit oriental palaces and fairy-tale places, from the decadence of devastated structures to sad faunal areas immersed in a climate of total isolation. You feel lonely and wonder why. On the ground you will find the remains of rifles and sandbags, and you will think of a war, yet there are residues of what appears to be a disease that has made human beings mad. Traces of blood, torn bodies, star maps, esoteric paintings, titanic beings, like the gods of an ancient civilization. You will fall off a cliff without dying, you will feel the will to run further, to move as quickly as possible, because behind a door there may be the solution or the answer to your questions. Despite all the merits and good intentions that we have underlined, it is still important to add that to complete the adventure, with some crossroads and the discovery of related secrets, we stopped the clock at exactly fifty-seven minutes, before seeing the end of the eleventh chapter. Surely you could at least double the time necessary for the conclusion, for those who want to carry out painstaking searches in every nook and cranny. The ability to visit each unlocked level individually at the end of the game is the perfect reminder to recall the suggestions of The Old City, but still remains a bit thin in terms of overall longevity.", "date": "2014-12-11", "grade": "7.5"}