{"name": "Cuori con le ali", "ref": "https://multiplayer.it/recensioni/141941-if-my-heart-had-wings-cuori-con-le-ali.html", "text": "There is a strange feeling following the story of If My Heart Had Wings. Of course, there are many characters who give life to really well written touching scenes and excellent drawings and beautiful animations follow one another on the screen, which show the high level of this Japanese production. Everything is too beautiful and well done, including the masterfully played soundtrack, so much so that it makes me want to forgive some badly translated passages that don't make the quality of the original texts. The relationship between Aoi Minase and Kotori Habane, their dream linked to the re-foundation of a school club, and all the other stories that are created around them, pigeonholing themselves harmoniously in the main plot, with which they soon become one, create a incredible feeling with the ~reader~, making the barriers fall, despite a few too many stereotypes, due in part to the school setting. In short, we confess that the events taking place in the beautiful suburban district of Kazegaura, located on the outskirts of Tokyo, have even moved us to tears (don't worry, we'll spare you the swollen eyes and blown noses), with their load of broken dreams and poetic digressions, towards the conquest of heaven. You will understand that we basically liked If My Heart Had Wings very, very much, but even by enjoying it ignoring some aspects we perceived real holes in the weaving of the plot, which we could not explain. That is, what happened was clear to us, but we had no idea how deep the censorship shears had gone. If My Heart Had Wings is one of the most moving visual novels on the western market. Let's find out. Deep censorship The biggest problem with If My Heart Had Wings is precisely the large amount of content cut from the game to make it suitable for an underage audience. The original has a lot of adult content which, unlike other visual novels, is well integrated into the story. Cutting them was not a painless operation and the moments in which the game appears truncated are too many. Honestly it is not clear why you choose to distribute a similar title without at least providing that you can decide which version to buy. It is true that some fans have worked on an amateur patch to reintegrate all the lost contents, but the officially available version, therefore the one to be reviewed, is the affected one. For you to understand better, among the cut contents there are images, animations and many lines of text. All the direct sexual references have been eliminated, however leaving the winking moments and the softer images in their place, probably because they do not lead to an increase in the rating. Sure, the story remains enjoyable even in the gutted version, but the deprivation effect is really too strong in this case, because in the original sex was not an accessory component put so much to attract the adepts of the five fingers clenched into fists, but a key part of the characterization. In short, if you want to play it, download the amateur patch and restore all the contents. Only in this way will you have If My Heart Had Wings as it should be and you will be able to fully enjoy the splendid drawings and all the implications of the plot. In search of lost content As specified in the body of the article, the western version of If My Heart Had Wings has been heavily censored to make it suitable for a minor audience. Fortunately, some fans of the genre have not given up and have produced an amateur patch that allows the reinstatement of cut content. You can download it here. We warn you that the patch is not yet final, as a second one is in production which should complete the job.", "date": "2014-12-09", "grade": "7.0"}