{"name": "L'ultimax battaglia", "ref": "https://multiplayer.it/recensioni/141300-persona-4-arena-ultimax-lultimax-battaglia.html", "text": "That of overhauled fighting games is a bad trend that Capcom launched many years ago and which today is so widespread that it is now taken for granted, in fact, however embarrassing we always fall for it. When Atlus and Arc System Works proposed Persona 4 Arena, we all knew it wouldn't end there: after all, we're talking about the developer who has produced a barrage of titles - and DLC! - for the Blazblue brand, so we weren't surprised when Persona 4 Arena Ultimax was also announced. There is, however, a substantial difference between Arc System Works and many of its competitors, and it is the visual novel component that characterizes the single player mode of practically all of its fighting games and which also in the revisions offers a considerable slice of new story of mint. Persona 4 Arena Ultimax finally arrives in Europe: were we right to wait for it so long? Epilogue Sure, there are those who would say that playing a fighting game for the plot doesn't make much sense, but in this case we're talking about Persona, a cult jRPG that players have always appreciated for the story and the characterization of its protagonists. Elements that Persona 4 Arena Ultimax outlines even better than in the past, given that it is proposed not only as a direct and official sequel to Persona 4 Arena and, consequently, to Persona 4, but also as a sequel to Persona 3 and an epilogue for both games. In fact, some new characters from Persona 3 join the roster of the previous episode, which already included Akihiko, Mitsuru, Aegis and Elizabeth: Yukari Takeba, Junpei Iori and Ken Amada, the latter accompanied by the faithful Koromaru. They are not the only new entries, however, since it is also possible to select Rise Kujikawa, Margaret, Marie and Tohru Adachi, even if the last three are DLCs (unfortunately paid immediately, given that Europe had to suffer this mistake , not enjoying the possibility of downloading them for free in the week of launch as happened in America and Japan). One last character - fortunately free - is the unpublished Sho Minazuki who, together with the robotic Labrys introduced in the first Persona 4 Arena, represents the fulcrum of this new adventure. The story begins a week after the conclusion of the previous spin-off, and is divided into two main sections, divided between the cast of Persona 3 and Persona 4, plus a third bonus that focuses on a very particular fighter. One way or another, the various characters will find themselves trapped in Tartarus and will have to work together or fight to discover Sho's true intentions. We immediately anticipate that, no, no progress is being made on the ~Minato~ case (those who have played Persona 3 will know what we are referring to) but Persona 4 Arena Ultimax puts a stop to many outstanding issues and opens a window, which we could safely consider conclusive, on the future of the various protagonists. Reading between the lines, one also catches sibylline references to what could be the story of the next Persona 5, but... exactly, you have to read, and read a lot, because the story mode is a real visual novel: pages on pages of texts that could be indigestible to those who just want to fiddle with the joypad or do not understand English well. Playstation 3 trophies Unlocking the 61 trophies will not be an easy task. They are divided into 49 bronze, 8 silver, 3 gold and platinum, and require a whole series of joypad feats: you go from simply completing the story mode to achieving excellent results in the other modes. Shadows and lights When we reviewed Persona 4 Arena about a year ago, we turned up our noses at the few fighters to select, very different from each other but still quite small in number. Persona 4 Arena Ultimax will not boast a mammoth roster like that of the most recent Capcom titles, but it defends itself well not only thanks to the new additions and the particular mechanics that distinguish them from the other characters, but also to the Shadow counterparts of almost all the wrestlers, variants with parameters and mechanics that are not too different but still interesting. Arc System Works, as usual, has been able to diversify the new characters so that they do not appear too obvious or trivial (just think of the way Ken ~controls~ Koromaru, not unlike the puppeteers of Blazblue, or the explosive notes of Rise) and fans of the previous episode will find that they have to work hard to learn how to control them effectively. Persona 4 Arena Ultimax, in fact, decisively treads that fine line between casual and hardcore players: it is an apparently chaotic fighting game, simple to play thanks to the few buttons offered and thetions granted by the automatic combos, but also very deep, very rich in particular mechanics that allow the ~pro player~ to literally overturn the fate of a match by tactically chopping up the SP indicator which governs, in addition to the aforementioned maneuvers, also the super moves or the new empowered attacks. The developer has carried out a balancing work that has filed some more controversial mechanics and streamlined an already excellent but still frenetic combat system, in pure Arc System Works style and, therefore, designed for its large community of fans. Apart from the new characters and the unpublished mechanics, there are not many new features, and the guys from Arc System Works have focused more on improving what was already at stake. The game modes are practically the same as Persona 4 Arena, but some have been revised and corrected: it is the case of the Score Attack, for example, which now sports various levels of difficulty from nervous breakdown, while the Golden Arena is completely new, a sort of ~survival~ mode with RPG elements in which our fighter levels up and acquires new upgrades. There is certainly no shortage of variety for those who like to play alone, and the Story mode requires several hours to be completed one hundred percent, but there are also some pleasant innovations on the multiplayer front, starting from the waiting lobby between games at the netcode which hasn't shown us the same uncertainties it had a year ago. The problem, more than anything else, is that Persona 4 Arena Ultimax arrives in Europe quite late compared to the American and Japanese releases, not to mention that it is a niche game: therefore, be prepared for long waits when looking for an opponent online.", "date": "2014-12-04", "grade": "8.5"}