{"name": "Tra luce e ombra", "ref": "https://multiplayer.it/recensioni/141617-shadows-heretic-kingdoms-tra-luce-e-ombra.html", "text": "Introduced a few months ago with the highly tested Early Access system on Steam, Shadows: Heretic Kingdoms immediately garnered the interest of critics and passionate users for various reasons; in addition to being a real sequel to the good Action RPG Kult: Heretic Kingdoms, released about ten years ago, it in fact offers some intriguing playful solutions like the double parallel universe (Shadow and Light) to be explored dynamically and the unprecedented management of party and hit points, which strengthen its personality, as we already specified in our previous test. Developed by the guys from Games Farm and published by bitComposer Games, the title had a rather troubled genesis with several second thoughts, however once the balance was found and the definitive setting was decided, the work was carried out with competence and passion, up to release of the so-called ~First Book~ - consisting of three chapters - which took place last November 20 on the Valve platform. The work, in fact, is designed to be a trilogy, and the release of the second part is already scheduled for next year. If you loved Baldur's Gate, you are a fan of Diablo and you appreciate other action RPGs such as the Torchlight series and The Incredible Adventures of Van Helsing, here we tell you why not miss out on the latest effort from the Slovakian software house. Shadows: Heretic Kingdoms is an interesting RPG built on the legacy of many classics Lost souls Like any self-respecting role-playing game, the plot plays a rather important role in the global economy, and that of Shadows: Heretic Kingdoms is fascinating, articulated and full of narrative crossroads, although different nuances can only be grasped by those who have played the original chapter of 3D People, being a real sequel. Without going into too much detail, here we limit ourselves to saying that the fragile truce reached between the main warring factions in the game universe, namely the Inquisitors and an order of religious fanatics, both driven by the thirst for power, is jeopardized by a powerful threat from the ~Dreamworld~, the realm of shadows where souls and demons dwell. To deal with the aforementioned danger and avert a collapse of the universe, in the incipit of the game a mysterious hooded wizard, whose identity you will discover during the adventure, is forced to ask for help from a Devourer, a powerful demon in able to take possession of souls and control them like puppets. This sequence is preceded by a cryptic and very short prologue, in which, at the commands of the warrior Clarissa, in addition to having a first taste of the various commands with all the upgrades and skills unlocked, we come into contact with the nemeses of the moment. The real adventure begins by playing the role of the Devourer, who, thanks to his ability to control souls, is led by the aforementioned magician near three tombs, where the bodies of three legendary warriors lie; Kalig the King of Thole, treacherously killed by his son Nemek to usurp his throne; Jasker, brigand during the reign of the Theocracy but valid officer in the victory against Taymuria, and finally Evia, nicknamed ~Daughter of Fire~ and princess of the Garulian Empire, who died mysteriously for over 300 years. The three, of course, represent the traditional classes for an action RPG - i.e. warrior, hunter and mage - influencing not only the way you play, but also part of the story, as each character has specific side quests, which deserve to be tackled replaying the campaign several times. In addition to the three main souls, as you progress through the adventure, you can unlock several others, such as the goblin Urshak, the Taymurian warrior Zaar, the reptilian wizard Sebekan or the colossus Ironclad Zombie, each with their own abilities and relevance to the story. In fact, based on the choices that are made during the dialogues, it is not certain that all the available souls will join the party, and this can significantly influence the continuation of the adventure. About halfway through the game, to cite a case in point, you have to cross a Taymurian field, but to reach it from the main path you need to have Zaar in the group, which must be ~unlocked~ by making a specific moral choice. There is no doubt that the elasticity from this point of view favors the replayability of the Games Farm title, whose main plot, however, abruptly stops after about twelve/fifteen hours (depending on how you play) making it necessary to purchase the future ~ Second Book~. Hits and spells As specified in the introduction, among the most interesting aspects of Shadows: Heretic Kingdoms, there is the possibility of switching between the two floors ofi existence dynamically and instantaneously, selecting the Devourer for the realm of shadows and one of the ~sentient puppets~ for that of the living. Each universe is inhabited by specific enemies, and very often it is necessary to switch from one world to another to solve the various environmental puzzles that appear before the player during the adventure. The party can consist of a maximum of four members, including the demon, and to make the replacements you must reach the so-called ~Cenophat~ portals, which also allow you to teleport from one area of the map to another and restore health. Speaking of hit points, their management represents one of the specificities of the Games Farm game, since, beyond the inevitable potions, they can also be recovered in real time by pressing the space bar and consuming the blue soul indicator, which fills by killing enemies. Each character is characterized by a specific skill tree, which at the passage of each level allows you to enhance or unlock one of the many available skills, relating to weapons but also to attack spells and shields, involving classic elements such as ice, fire, wind, lightning and so on. With the Q, W and E keys you perform the aforementioned skills, while with A, S, D and F you instantly switch between the various elements of the party; a system that favors the tactical and strategic approach to the clashes. There's a good variety of enemies - although they tend to repeat themselves a bit too much in certain areas - which represents a decent level of challenge, especially starting from the desert setting of the second chapter. There are several bosses such as griffins, demons, powerful wizards and other magical creatures, which require a very careful and studied use of skills and energy, given that the difficulty is calibrated upwards even by selecting the intermediate level. To help the player there is also a very rich inventory, with numerous powerful weapons and armor to buy in shops or unlock by killing the strongest enemies, as well as potions, amulets and ingredients to use when necessary. There is, among other things, a crafting system and the possibility of collecting rare recipes. Overall everything works very well and, despite a rather traditional combat system without particular flashes, even from the point of view of the spectacularity of spells and magic, Shadows: Heretic Kingdoms is always solid and fun. The secondary quests often involve the simple collection of objects to bring back to the non-player character on duty, however it is thanks to them that it is possible to arm yourself fully (as well as level up) to face the crucial points of the main story. Few but good From a purely technical-artistic point of view, the Games Farm title is quite enjoyable, although it lacks a little in originality in the style of the characters and, at the maximum detail, it is far too heavy, even on a very high-end configuration. Fortunately, there's a decent selection of items to handle in the advanced graphics menu, in support of scalability; among the most interesting, the ability to switch from DirectX 9 to 11, with a significant visual upgrade, ambient occlusion and lighting. Too bad that for some options, such as the antialiasing filter, you can only put it on or off, with no intermediate options. The level design is also good, where the three main settings, namely desert, catacomb and forest, are rather inspired and are characterized by good textures, as well as numerous elements on the screen. The polygonal models of the characters are less convincing, a bit poor and equipped with simple animations, but still able to perform their task very well, even considering the variety of armor and weapons capable of distorting the appearance. The audio accompaniment is good, both for the soundtrack - at times really catchy - and for the sound effects, while for the dubbing, completely in English unfortunately also in the subtitles, the interpretation of Tom Baker (Doctor Who) in the role of of the hooded wizard, which surpasses that of the other extras. Finally, remember that the title can only be used in single player.", "date": "2014-12-03", "grade": "8.0"}