{"name": "Eroi dei due mondi", "ref": "https://multiplayer.it/recensioni/141444-call-of-duty-heroes-eroi-dei-due-mondi.html", "text": "Despite the decidedly successful experiment of mixing first-person action and tactical planning of Call of Duty: Strike Team last year, Activision has decided to change the cards on the table for the latest mobile title dedicated to its flagship franchise. By definitively removing the weapons from the hands of the player, in fact, the present Call of Duty: Heroes is dedicated to pure strategy, offering gameplay that is certainly new for the series. Starting from the basics Instead of trying innovative solutions, Call of Duty: Heroes follows the easy path of emulation, taking as an example that Clash of Clans which has been making real havoc on the mobile market for months. The idea, although questionable from a strictly creative point of view, is far from wrong on a conceptual level: uniting one of the best-known brands in the gaming world with the most successful gaming system of the moment on smartphones and tablets is a move that any sensible software house would try to do it. Activision has faced the commitment seriously, trying to convey in Call of Duty: Heroes all those elements that made the success of the blockbuster developed by Supercell. The title is therefore configured as a strategic one that places great emphasis on the construction and administration processes of one's base: by exploiting the two main resources (gold and oil) the user is continually encouraged to expand his headquarters with new buildings and fortifications or to upgrade existing structures to make them more efficient. Then there is an inevitable combat phase in which duly trained units are deployed on the field to try to destroy an enemy base, an operation that can be performed both in the campaign mode and by searching online for another human player's outpost. In a playful architecture that is fundamentally indistinguishable from that of Clash of Clans, Call of Duty: Heroes adds its personal touch to the role of heroes: they are famous characters from the saga (Price, Soap, Harper and others). who can be recruited throughout the game and deployed in battle to benefit from their special abilities. Call of Duty: Heroes avoids any risk and limits itself to being a good clone of Clash of Clans As often happens in copy and paste operations, Call of Duty: Heroes is very skilled in replicating the merits of its source of inspiration but equally diligent in reproducing the same identical defects. The major criticalities of Clash of Clans are therefore also present in the Activision product, starting with the fundamental weakness of the combat phases, given that the troops cannot be directed towards a specific objective but simply attack the first target they encounter in their path. Call of Duty: Heroes also suffers from a very heavy incidence of countdowns that mark the execution of certain actions: it doesn't take much to get to the point where practically everything requires the user to wait several minutes ( if not hours) to complete, paving the way for the inevitable in-app purchases. In addition to packages of virtual currency and shields to protect yourself from attacks by other users, the game shop also offers doses of Celerium, an indispensable resource for purchasing certain items and above all for completing processes immediately. For all these reasons, continuing without spending anything becomes a rather difficult undertaking - and certainly very little fun - that only players with above-average patience could sustain. Another aspect that is not entirely convincing is the overabundance of information, menus, points, statistics and various parameters that the user must take into account, which makes the gameplay a little less immediate and fluid than it should be. At least, Call of Duty: Heroes defends itself well from a technical point of view, an aspect in which Activision has always proved to be up to speed even in the mobile sector: the entirely polygonal graphics of the product shines especially for the attention to detail of structures, units and side elements, but some nice visual gems also come during the execution of the heroes' special moves, often genuinely spectacular.", "date": "2014-11-29", "grade": "7.0"}