{"name": "Fuga tra le vignette", "ref": "https://multiplayer.it/recensioni/141414-framed-fuga-tra-le-vignette.html", "text": "Certainly it is not so immediate to associate the development of video games with Australia: between kangaroos, beaches, surfing and beautiful girls, the common idea is that those who live on the other side of the world have other preferences and attitudes. In reality it is a stereotype that hides fertile ground also with regard to electronic entertainment especially in the field of mobile gaming, with Halfbrick (Fruit Ninja, Jetpack Joyride) and Firemonkeys Studios (Real Racing) leading the way with millions of download the ranks of programmers and artists. Among the independent Australian teams that have gained attention in recent months has appeared Loveshack, a studio made up of just 3 people and founded a couple of years ago. The trio's first work responds to the name of Framed: a title that will not be unknown to fans of the indie scene, since it was able to collect around twenty awards in a whole series of festivals around the globe. A load of considerable expectations therefore for a debut, which were further strengthened when Hideo Kojima, through a tweet, elected Framed his personal game of the year 2014. It is therefore really possible that right among kangaroos, beaches, surfing and beautiful girls has such an extraordinary product been made? Framed is a noir-tinged puzzle game that demonstrates the great talent of the Australian team Loveshack Framed is a noir-tinged adventure supported by an extraordinarily original basic idea. The setting is instead the most classic for the genre: between trench coats, cigarettes, guns and mysteries, everything revolves around a daring escape to hell of three main characters intending to contend for a briefcase with mysterious contents. In reality, the title of Loveshack says nothing, at least in words: in fact, there is not even a single line of text that explains who the protagonists are, what the premises are and why that briefcase is so important. A actually winning narrative choice, which avoids adding superstructures to what is in fact a situation voluntarily built on the typical clichs of the dark novel. Framed's winning intuition is actually in the gameplay compared to a simple solution on paper, but in reality extremely intelligent and which finds its ideal completion in its correct implementation. In practice, the action takes place within the tables of a sort of comic, made up of a series of animated cartoons: each of them represents an action, a character or a glimpse of the setting that the protagonist will go through and that in fact it constitutes a kind of piece of a puzzle to be put together. In fact, the cartoons can be moved, dragging them with your fingers to change their order as you like, with the exception of the first and last. However, there is only one correct solution, and it is necessary to have observation skills and put some gray matter into operation to be able to understand what their exact order is. The formula is introduced gradually: if the first tables are in fact very simple, the more advanced ones require a greater effort to be completed successfully, naturally increasing the satisfaction at the moment of success. However, mistakes are not punished: making a mistake only means having to repeat the table from the beginning, experimenting until you get to the well-deserved success. Framed is therefore essentially a puzzle game, but cut and sewn around the capabilities of touch devices: a game in which form and substance are perfectly balanced, giving a completely tangible sense of completeness. The graphic style is then very personal, between silhouettes of the characters and dominant chromatic tones that outline fascinating settings. But what stands out above all are the animations, extraordinary in their realism and fluidity. Observing Loveshack's work is as beautiful as playing it, for sure. The overall duration is undoubtedly short: it took us just over an hour to get to the final credits, but even considering some hitches in the progression it doesn't take more than a couple. Little? Without a doubt, but the feeling is that it is exactly the ~right~ time to be able to fully enjoy Framed, without the experience having to drag on and avoiding the risk of repetitiveness. The audio component is also excellent thanks to a perfectly themed and very catchy soundtrack. Framed is therefore in essence simply one of the most interesting indie titles of recent months, which demonstrates once again how this kind of game is absolutely essential to guarantee a real alternative to the repetitive and (often) boring formulas adopted in large mass productions.", "date": "2014-11-28", "grade": "9.0"}