{"name": "Il patto dei lupi", "ref": "https://multiplayer.it/recensioni/141338-joe-devers-lone-wolf-hd-remastered-il-patto-dei-lupi.html", "text": "Exactly one year has passed since the debut on the App Store and Google Play of Joe Dever's Lone Wolf, the curious mix between RPG and gamebook that marks the return of a much loved character in Italy too, Lupo Solitario. Last survivor of the ancient order of the Kai Knights, an extraordinary warrior capable of wielding the powerful Sword of the Sun and using superhuman abilities to get the better of his opponents, Lone Wolf has been the protagonist of various sagas and the plot narrated in the video game, completely unpublished and written by Joe Dever himself, it is placed chronologically between the events of the third and fourth books. The game manages to capture the atmosphere of the author's work and catapult us into the cold streets of Rockstarn, a village suddenly attacked by an army of Giak and Drakkar, who massacred the population and set the houses on fire. forcing the survivors to flee into the mines. Lone Wolf, lord of the valley, arrives too late on the scene of the crime and can only swear revenge, pursuing the invaders together with a mysterious girl named Leandra, who remained alive thanks to her ability to use the crossbow, but Alone. In fact, Leandra plays a central role in the story, and only by overcoming various challenges, exploring inhospitable scenarios and going into the heart of hostile lands will we be able to discover what secret lies behind the attack on Rockstarn. A compelling and particular experience, which now also PC users will be able to try thanks to this remastered version, which includes all four acts released on mobile and some pleasant extras. Pages in high definition As mentioned at the beginning, Joe Dever's Lone Wolf is a particular mix of RPG and gamebook. The adventure is to all intents and purposes narrated like a Dever novel, with its highly recognizable style and the ability to really put us in the shoes of the protagonist; and we have to leaf through its pages to read it, until we are asked to make a choice. At that point there is a real crossroads or, simply, the possibility of exiting a situation in a positive or negative way, an eventuality to be realized by choosing an action among those available, based on the characteristics of the character we created at the beginning of the adventure by answering some questions about his character and providing him with certain equipment (sword, ax or war club) and peculiar skills. It is possible that the choices involve the expenditure of a part of our Kai power or stamina, the energies necessary to perform special attacks or wield the weapon and shield, or even that a wrong decision results in the loss of some Health. However, when enemies are encountered, the game leaves the context of the gamebook to offer us a turn-based RPG-style combat system, with a timer that regulates the actions we can perform and four different ~hot spots~ located at the level of the head, hands, legs and feet of Lone Wolf. Clicking on one of them opens up a range of possibilities relating to attacks carried out using the Sword of the Sun, the standard weapon, throwing knives or the crossbow or, finally, the Kai powers. Based on the characterization of the character, the latter can allow us to launch a psychic attack, call a wolf that pounces on the opponents, predict their moves to counterattack without suffering damage, recover health in various ways and so on. Many possibilities, all of which can only be explored by carrying out different walkthroughs, which opens up a very substantial replayability factor, which also includes the crossroads we mentioned earlier. Joe Dever's Lone Wolf HD Remastered also brings the immersive adventure of Lone Wolf to PC Make your move The fights in Joe Dever's Lone Wolf quickly acquire a certain strategic depth, given that even the first troops of Giak and Drakkar can prove lethal for our character. It is therefore necessary to make the most of one's turn and inflict as much damage as possible on a single target, so as to limit the attacks that we will inevitably suffer when it is up to the enemies to act; unless you choose to raise the shield or use the Kai power to predict the blows and counterattack, operations which however are not always possible, also due to the ~cool downs~ necessary to reuse the potions or the same special moves. When more tough and dangerous opponents burst onto the scene, things get even more complicated and it becomes essential to make the best use of the resources available for crafting and purchasing new items, both operations that can be carried out at certain points on the map. On purposemap, once a fight is over, you can choose to proceed to the next stage, possibly choosing between different destinations (and also triggering crossroads here), or stop to meditate and thus recover all the lost vital energy and vigor. However, remaining still in a semi-conscious state presents risks, and some Giaks could interrupt your rest, forcing you into a difficult defense. The PC version On mobile devices Joe Dever's Lone Wolf boasts a technical sector of excellence, which has been brought to PC by carrying out the necessary resampling procedures as regards textures, resolution and effects. Clearly the context is different, and if on iOS and Android the title of Forge Reply stands as an undoubted point of reference under various aspects, on the Windows platform it has to deal with various top-level productions; although the price of 14.99 euros protects it from a direct comparison with the triple A and lets you turn a blind eye to some shortcomings that are revealed in their evidence on a wide screen, such as some edges in the polygonal models, textures which in close-up shots turn out to be less defined than expected or animations that are not always sophisticated during the ~fatalities~. However, the graphics hold up, the artistic figure is remarkable, the scenarios are sufficiently varied and boast a certain personality, as well as the music and effects, which manage to accompany the adventure with the right amount of ~epicness~. We had doubts about the adaptation of the interface and the gamebook sections, doubts that unfortunately remained basically unresolved during our test. Indeed, the feeling is that something of the ~intimate~ atmosphere of the mobile version has inevitably been lost in the transition to a larger screen, since leafing through the pages of the book using the mouse is not the same as doing it with your fingers. We also found playing the quick time events less appealing, probably even more open to making concessions in terms of accuracy. Elements that constitute a price to pay fortunately not too salty, and that do not affect too much the value of a production that remains really interesting, certainly a must for fans of Joe Dever and his characters.", "date": "2014-11-27", "grade": "8.0"}