{"name": "Un incubo a occhi aperti", "ref": "https://multiplayer.it/recensioni/141226-escape-dead-island-un-incubo-a-occhi-aperti.html", "text": "It sometimes happens that products of modest quality arrive on the Multiplayer.it test bench, which for one reason or another have difficulty in comparing themselves with the current videogame offer. Often these are games with technical or design problems, but which hide something good behind a very negative first impact or a slow start, elements that perhaps can be appreciated by purists of the genre or by fans of a particular franchise. In these circumstances it is desirable to escape the traditional practice of pigeon shooting and to underline precisely these positive aspects, so that the reader can have as complete a picture as possible of the product and possibly evaluate its purchase. Unfortunately it also happens that the title under test, gutted in all its contents and observed from any angle, actually confirms the bad preliminary impression, in which case one can only take note of it and draw conclusions. In short, we didn't like Escape Dead Island at all. The idea of making a spin-off of the series created by Techland in the third person, at Dead Rising, on paper was not bad; and in the same way the prequel-style setting was intriguing, which would have tried to clarify how the virus had spread on the island of Banoi, infecting its inhabitants and transforming that tropical paradise into a real hell, a zombie apocalypse capable of swallowing anyone. However, these ideas have been implemented in a mediocre way to say the least, giving us a very limited, technically backward and poorly designed experience. Escape Dead Island is a poor quality product, looking two generations old Flashbacks and flashforwards The first sequences of Escape Dead Island see us control the special agent ~Kilo Two~, in charge of infiltrating the Geopharm laboratories on the island of Narapela and eliminating a mole. Soon the operation takes on unexpected connotations, given that the virus produced by the multinational company has begun to spread and transform people into undead hungry for human flesh. This escalation puts an end to the agent's adventure, which basically served to introduce us to the game's control system and, in particular, its stealth mechanics. Six months later, here we are back on the island in the role of the real protagonist, Cliff Calo, a daddy's American boy (literally) with a sleeveless hooded sweatshirt, cropped pants, a set of tattoos on his arms, the inevitable hairstyle boy-band style and a college puffball attitude. Having borrowed the expensive boat of his father, a famous journalist, the boy sets off with two friends, Linda and Devan, to make a report on what seems to be happening in the Banoi archipelago. However, when the three land in Narapela, things immediately go badly: Linda is bitten by a zombie and Cliff is forced to race against time to find a possible cure for the infection, wandering around a scenario teeming with the dead. living. More often than not, events take an unexpected turn and the protagonist wakes up somewhere, convinced that he had dreamed but still in possession of objects that testify to what happened previously. Let's say that the Fatshark developers have tried to write an interesting plot by contrasting reality and states of alteration, but the result is modest, full of narrative holes as big as houses, which, moreover, are not even clarified in the ending. Playstation 3 trophies The fifty Trophies (plus Platinum) of Escape Dead Island combine linear operations (complete the individual levels and the game, get hold of all the weapons) with others that are based on mere numbers of experience, such as elimination of a certain number of enemies and the collection of files scattered within the locations. You zombie, I don't zombie In Escape Dead Island it is not possible to jump. A factor which, in connection with the design limits that afflict the island of Narapela, creates situations that are difficult to propose today, even more so in view of a freely explorable setting. The character climbs a height of one meter and cannot descend except by retracing his steps, he climbs a roof and cannot jump off without using ladders or ropes, there are invisible walls everywhere and this does nothing but underline the antiquated nature of the production, so much so that the sensation is of being faced with a concept born a couple of generations ago, on PlayStation 2 or Wii, and conveniently transformed into the game we are dealing with today. The poor quality of the scenarios, with even the pop-up of the grass that seems to be growing at the moment, will unfortunately accompany us FrFor all six hours of the single player campaign, given the extensive backtracking, which you will inevitably try to limit by running like crazy from one objective to another. Everything in Cliff Calo's adventure tastes old; starting from the technical sector, with polygonal models full of edges and even unable to move the mouth decently during dialogues, devoid of connecting animations that lead the management to opt for comfortable fades to black if there are particular events to tell, through the 'use of cartoons (drawn by an artist who also worked for Marvel, but whose name escapes us at the moment) in which the protagonist's appearance is different from the in-game graphics. The application of cel shading manages to mask only a minimal part of such littleness, but the top is reached in the improbable transitions from light to dark (it happens to look at the inside of a building that appears illuminated and that suddenly ~darkens~ when we access it) and, above all, in a frame rate that often trudges despite the low polygonal count and the low resolution textures. The audio sector does not contribute in any way to improving the situation, due to dialogues (in English, subtitled in Italian) spoiled by a bad level of acting, especially as regards female voices, and a trivial and anonymous soundtrack. However, the biggest problems of Escape Dead Island lie in the gameplay, which tries to propose an alternative to Dead Rising (by also sticking the camera into it, a pity that for practical purposes it is useless) in which the zombies are much less numerous and therefore the fights they don't end up being trivialized, indeed there is room for stealth eliminations (silently approaching an undead from behind and then hitting him by surprise with a screwdriver) and for a degree of challenge that is anything but trivial, especially in the stages advanced, when all types of enemies are introduced (from spitters to jumpers, from ~mermaids~ to zombies with claws) and maybe attack at the same time. However, the fact that the clashes can be challenging is not enough to raise their quality, given the shortage of maneuvers available (actually a single combo, to which is added the ~fatality~ if the opponent is on the ground) and, above all, a particularly unfortunate collision detection, which smooths out one in three shots and too often exposes us to counterattacks that we had not deserved to suffer. Furthermore, a character growth system that goes beyond the equipment is completely missing, as well as an effective solution for quickly switching from melee weapons to pistol and rifle, very inaccurate and almost unusable tools from a short distance.", "date": "2014-11-26", "grade": "4.8"}