{"name": "High-malaya", "ref": "https://multiplayer.it/recensioni/141275-far-cry-4-high-malaya.html", "text": "Laughing and joking, 10 years have passed since the birth of the Far Cry series. Looking back, however, rather than a series one thinks of a ~concept~. The original chapter had an open and sandbox structure, based on a formula that mixed pure action and tactical reminiscences, all against the backdrop of a heavily photoshopped postcard of the island of Cabatu, in the role of a scoundrel who found himself unwillingly on an adventure daring with an exotic and supernatural flavor, between mercenaries, mutations and a beauty with whom to have the classic conflicting relationship (elements that Naughty Dog seems to have liked a lot, when he defined several traits of the first Uncharted). With the abandonment of Crytek, which brought the cabin and engines with it, the series was entrusted to Ubisoft Montreal and a new technology, the Dunia, marking a substantial break with the past, at every level: via Jack Carver and his Hawaiian shirt in bad taste, away with the 80s action movie tone and the horror and sci-fi drifts, making way for a plurality of protagonists to choose from and with the naked, raw but also feverish reality subject to existential reflections a la Conrad of a war-torn Africa. And a fully free roaming structure, which includes typically RPG elements and simulation instances (the flammability of vegetation, the day and night cycle, a first experimentation with fauna). With Far Cry 3 another round another gift: bandits, sadness and neorealism, we return to the bright SEGA colors of a tropical archipelago to breathe an air of adventure, albeit reflected in a kaleidoscope of tones and values, in the role of a single protagonist struggling with a formative story in its own way, which is very reminiscent of that of Di Caprio of The Beach. In addition to several fundamentals, the fully free roaming nature of the second chapter is maintained plus something else good (such as the ~heal on the fly~ system, which made school) to reshape it with a playful and crackling sandbox nature, in which everything is pulled in, not least a complex fighting system and wild beasts, in their debut. A dimension that seems to be the one in which Ubisoft's intellectual property can finally be recognized in a stable manner, as demonstrated by the fact that Far Cry 4 adopts the same approach, sanctioning an unprecedented type of continuity for the main episodes of the series, one step from the mere variation on the theme. But if you want to get an idea of the actual level of freshness and personality boasted by the game and, more generally, of the goodness of its playful, narrative and structural aspects, you are invited to consult the review we published a few days ago, regarding the console version. In this one we will focus on the crux of the PC edition. We played the PC version of Far Cry 4 - is it really that badly optimized? Graphics, graphics, graphics That Far Cry 4 is a direct derivation of its predecessor can also be seen by looking at it in purely technological terms. The Dunia Engine has not been subjected to the heavy reworking it was subjected to in the transition from the second to the third episode, which had fully justified the adoption of a ~2~ next to the engine name, appearing instead as a more continuous evolution. The game, however, offers certain new graphic solutions and general enhancements and visual refinements, even if there are some historical Achilles heels and even some steps backwards (as we will see below). Coming to the specifics of the PC version, it cannot be said that Ubisoft has not committed itself. If the differences between the Personal Computer and console editions of Far Cry 3 were more than due, due to the abyss that existed between a good 2012 gaming system and the hardware of PlayStation 3 and Xbox 360, for a episode aimed at newer platforms such as PlayStation 4 and Xbox One there was a risk that the developer would settle for a 1:1 transfer job. And instead compared to its cousins (in particular PlayStation 4, with which the writer was able to conduct direct comparisons), on PC you can count on more defined textures, more sophisticated shadows and ambient occlusion algorithms, some sprinkling of tessellation (in particular on trees ), a more elaborate field blur and a less aggressive LOD. In short, on Windows systems the game is more detailed and harmonious, without certain own goals of the living room counterparts, such as the new technique developed for the fur of animals and certain items of clothing whose quality is compromised by the dirt generated by the shadows coarser and the ambient occlusion techniques less persuasive, while here it is instead valued properly, although not 100% on the sidelinesro from similar problems. To this should then be added the exclusive features for those who have an Nvidia video card, whose partnership in this case has even resulted in the preparation of a family of dedicated settings. In addition to the various Low, Medium, High, Very High and Ultra already seen in Far Cry 3, in the Video menu there is an entry ~Nvidia~. Among its characteristics, in addition to the notorious HBAO+, the PCSS shadows (Percentage Close Soft Shadow, localized in Italian with a questionable ~Software Shadow~), the Hair and the Crepuscular Rays, already seen elsewhere, but which deserve a word of more. The latter are certainly the most disappointing aspect of the matter: with the exception of specific, particularly suggestive conditions, they don't seem to do much better than the more classic solutions that have been around for years, even the barely decent god rays seen in Far Cy 3, on the contrary, unlike them they are not even generated by direct exposure to the sun (to understand: look at it by moving the shouldered weapon and try to notice what does NOT happen). Not only that: by opting for the basic volumetric solution (or playing on the console) the rays conduct less light than in the past and in various cases they seem to have been completely eliminated, as if Ubisoft had decided to cut them from the ~smooth game~ to enhance the nVidia exclusive. The PCSSs are also controversial given that they fulfill their mission (blur the shadows as the object that projects them is further away) in an excessively sudden and artificial way, often rowing against the objective of offering a more natural glance, while even if sometimes a little ~poetic~ the Pelo establishes a clear step forward compared to the one seen in Call of Duty: Ghosts, placing itself in the right direction towards the well-known wolf of The Witcher 3. Owners of an Nvidia card, finally, they will also find TXAA, which together with SMAA complements the usual MSAA, as we will see better below. Ok, but how does it run? Starting from the high-class thrust given to the pirates, since the release dating back to just over a week ago, the PC edition of Far Cry 4 has rocked the Web. Many users have reported problems with stuttering, graphic glitches, black screens , poor performance, bad mouse acceleration and more. The situation is such that there are those who have idealized the memory of the launch of Far Cry 3, which between bottlenecks, ballots between DirectX 9 and 11, between HDAO and SSAO and various shadow profiles, macumbe on Alpha Coverage, the the zero-time proliferation of changes to the .XML file and the microstuttering that accompanied it for a long time, in reality it was not exactly idyllic. A skein that we absolutely cannot unravel, except with reference to the microcosm of our configuration, of which you can find the hardware characteristics in the appropriate box, where the only real anomaly found was mouse acceleration, really annoying, even with the recent patch 1.4 which explicitly aimed to remedy it, and which we have managed to remedy with one of the tweaks with which the community is promptly responding. Coming to the actual performances, with Nvidia settings at 1080p the game travels there at an indicative average 55 frames per second. Provided we use the SMAA, which in addition to being the most drinkable solution in terms of performance, without further aggravating the situation, is the one that according to our taste is best suited to a title whose glance is particularly prone to suffer of ~sizzles~, due to the high amount of foliage on stage. Neither the MSAA, which from this point of view seemed to us to be worse than Far Cry 3, perhaps due to some changes in the lighting level, nor the TXAA which here confirms its proverbial tendency to mix the quality of the image, they perform the task of mitigating the jumble of ladders that nestle between grass and trees very well, paying attention to the quality of the image. However, in addition to not representing a particularly exciting value in the light of what is shown on video, in these conditions the frame-rate seems to us to be somewhat engulfed. We are not talking about stuttering or micro-stuttering, which fortunately we do not suffer from, but about something similar to the typical feeling of having the ~handbrake~ on given by V-Sync and Triple Buffering, which we do very well without, thanks to the fact of having a 120Hz monitor, with which we save ourselves from having to activate it without generally having to take on the tearing. We found the optimum by setting everything to Ultra with the HBAO+ activated and the SMAA always tight, where the indicative average frames per second barely rise, around 70, but everything flows in a much more velvety and pleasant way. i knowsubstantially smoother and more responsive. In the light of the technological values expressed and the traffic of video stuff even in these conditions we continue to think that the game could run better, but at least it has a natural behavior, making us arrive at the obvious deduction that some nVidia features bring with them the necks of bottle, somewhere in the render pipeline. To season Far Cry 3 had launched with the most offensively welfarist and invasive user interface ever to appear in a first person shooter and it had taken weeks for the developers, following the barrage of complaints especially from PC users, to agree to the players the possibility to lighten the load of help and notifications on the screen, ensuring that everyone enjoys an experience more in line with their individual sensitivity, whether in terms of involvement, or in terms of sense of direction and above all ability to manage the relationship with the enemies and their movements on the battlefield. Thankfully, the lesson seems to have been learned and this time a detailed network of options is immediately foreseen through which to decide which elements of the HUD to keep active rather than tying everyone, without distinction, to such a depressing lowest common denominator. Pointer acceleration aside, the work done in terms of controls is also good, with the usual possibility of resorting in the case of the mouse and keyboard to a plethora of hotkeys for the direct selection of weapons and objects, which complement the typical console-derived wheel, while a special item has been inserted that allows the controller to compensate for its lower effectiveness in managing the gaze, especially in daring situations, through a new type of assistance that helps to target opponents while driving . Finally, steps forward and steps back for the multiplayer infrastructure, once again carried over from the console version. On the one hand it is nice to see the introduction of a match browser, through which to bypass the slow and limited lobby system and get straight to the point, although logic would have suggested that in the event of a failed connection to a match being sent back to the same screen instead of being diverted to the playlist selection screen, with the obligation to make new menu rounds and perhaps miss the opportunity to crash into an alternative game. On the other hand, it is surprising to note that only voice chat is present, while the text chat has been eliminated, both in the waiting rooms and in-game, seriously affecting communication between users. But the aspect that puts the biggest spokes between the wheels of a competitive sector that is in itself well thought out and fun is the netcode, improved compared to Far Cry 3 in terms of latency and hit registration, but still plagued by the lack of autobalancing and host migrations, which are often not even successful. Agreed that on certain things the evolution goes to prawn, but it's something unacceptable in 2014, even more so on PC.", "date": "2014-11-26", "grade": "8.3"}