{"name": "I conigli pi tremendi mai esistiti!", "ref": "https://multiplayer.it/recensioni/141107-rabbids-invasion-lo-show-televisivo-interattivo-tornano-i-conigli-piu-tremendi-mai-esistiti.html", "text": "The cutest and most irreverent bunnies in the history of video games are back on consoles, this time with a title based on their cartoon television series. Rabbids Invasion: The Interactive TV Show is finally available in stores with a very attractive budget price. The episodes of the first series, which were scheduled worldwide last year, met with such great success with the public that the French production company has not only planned a second series (coming this winter), but also a dedicated video game. And it's perhaps the first time we've covered a tie-in based on a tie-in since Street Fighter: The Movie for PlayStation and SEGA Saturn or Dragon Ball Evolution for PSP. More unique than rare cases, but which make you understand the exceptional nature of the event and the importance of the brand. The new Rabbids title, as can be seen from the name itself, more or less re-proposes the contents of the episodes made in computer graphics that aired recently, with the addition of the interactive component typical of any video game. It is a title designed and built for the little ones, the young audience who appreciate the intuitiveness of the Kinect and the sympathy of these funny rabbits. The camera for Xbox One is in fact a predominant element in the construction of the gameplay of Rabbids Invasion, basing each single episode on the detection of the body, position and voice (the relative version for PlayStation 4, in fact, requires PlayStation Eye to work) . The game works both alone and in company, a mode in which it obviously knows how to give the greatest moments of hilarity. Once the game disc has been started, the main menu appears as the first ~step~ showing each area of the world that can be explored, where in each of them it is possible to start different activities and games, each unlockable by increasing one's score, adventure after adventure. Initially we only have access to two chapters, but completing them will unlock all the others like wildfire up to a total of 21 mini-games available on disc. Ubisoft has already released some statements regarding the ~season pass~, i.e. the subscription for all the DLCs that will be released: from day-one in March there will be another 15 episodes unlockable through 5 different packages, coming out one a month from here to spring up to a total of 36 different activities. We purposely call them ~activities~ because, rather than a classic video game, it involves interacting with what is happening on the screen as if we were participating in the television show together with the Rabbids and performing a series of movements that refer to what appears in front of we. The Rabbids are back directly from the dedicated TV show: Invasion! The hilarity of nonsense Rabbids Invasion: The Interactive Television Show was born as an entertainment product that distances itself both from all the other classic party games and from the same previous chapters concerning the Ubisoft bunnies. Each of the twenty episodes included contains in turn as many activities and mini-games, for a total of almost 400 different things to do. The skill and creativity of the developers was evidently all concentrated in trying to propose a certain variation in the use of the camera and in the way of managing the interaction between player and screen, succeeding fully. Everything we do in the Rabbids episodes is always different from what we experienced in the previous ones, always being varied and attracting the player's curiosity to unlock new levels. The Ubisoft title is a concentrate of everything that can be done with Kinect, what has already been done and perhaps even some ideas for the future, with many innovative ways to play and which sometimes deserve a better study. The ~classics~ are obviously present, for example one of the most popular episodes is that of the ~Rabbids Dance~ where you can dance and go wild alone or in company. Then there is ~Copy the pose~ where we have to try to recreate live the postures that the rabbits take on the screen. One of the first activities that we find, however, is that of the photographic set, where we can take photos by choosing a setting among the many available and then saving everything in a personal album of memories. There are also ~fighting~ sessions such as ~Battle of Eggs~ where we have to try to hit as many Rabbids as possible, or ~Quick Drawing~ in which we are asked to color pre-drawn elements on the screen simply by passing our hand over them, such as it was a brush. Speech recognition technology has also been exploited in some mini games: in one of these we have to try to shout the classic motto ~Bwahhh!~ the loudest of all, nin which obviously the more points are taken, the greater the decibels produced by our uvula will be. Great importance has also been given to the augmented reality that Kinect can produce with images of our living room, and vice versa us inside the television screen. There are dozens of activities in which, by recreating the images of our home on the TV, we can see the white bunnies literally invade our spaces, within which we can interact with them by touching them, giving them a few smacks on the head, or a peaceful selfie all together. Other times we will instead be the ones to interact with the virtual spaces created by the developers, continually finding ourselves in new settings such as beaches, virtual television studios, playgrounds or on the street. Xbox One goals As per tradition, even the latest Ubisoft effort gives gamers the canonical 1000 points to unlock, through 41 objectives that are quite easy to obtain. Most are unlocked by simply progressing through the game's episodes and getting good scores. Some objectives are tougher, such as the one that requires you to collect 100 objects, but in general this game certainly won't drive you crazy to get to the fateful ~1000 points~. Ubi's rabbits don't bite Although Ubisoft's work in the direction of greatly diversifying the activities present in Rabbids Invasion has succeeded with excellent results, we cannot however say that the same games are always the best of fun. The desire to create something new has often failed even in the attempt to make it pleasant to play, resulting in some events being quite trivial and obvious. The title is obviously dedicated to the very young and for this reason the general difficulty level is extremely calibrated downwards, transforming the whole game into a sort of exercise for using the Kinect rather than a real competitive title. There is no exact match between our skill and on-screen results, meaning that each participant gets roughly the same scores as everyone else. Multiplayer competition is leveled and doesn't really allow for someone in particular to ~stand out~ from others and rise thanks to their skills. Kinect detects movements very well but is very permissive, forgiving gross errors and often not exactly exact postures. For example in the dance game we noticed that it's easy to get good scores even by moving in other ways, without carefully following the moves of the rabbits on the screen. This command input method is dictated, we believe, by the desire not to discourage the little ones from continuing and not to frustrate them with too negative scores. The consequence is that the game flows very smoothly and quickly, however having some lack in terms of the sense of challenge and the ~bite~ in general. Being a title devoted to multiplayer with other players, Rabbids Invasion offers its best moments in company, where often the fun is not so much in the activities offered by the game but in the interaction with the other participants. Here, to fully enjoy the experience offered, it is absolutely necessary to participate with the highest number of friends: four on Xbox One.", "date": "2014-11-25", "grade": "5.5"}