{"name": "Eyes in the Dark: The Curious Case of One Victoria Bloom", "ref": "https://multiplayer.it/recensioni/eyes-in-the-dark-the-curious-case-of-one-victoria-bloom-recensione.html", "text": "Having a coherent idea behind your project is essential. As is the influence of the personal cultural baggage of those who put these ideas into practice. But don't let your intuitions overwhelm you. There is a limit, a demarcation line that marks the maximum point of a peaceful coexistence between these and other elements within one's work. Beyond this border, the tower collapses. The temptation to get ever closer to that ultimate limit is a constant that distinguishes any type of author-craftsman grappling with the creation of a work of genius. Many approach it without overdoing it; others cross that line, crushed by their own creature. Still others, on the other hand, stop exactly above it, unleashing a combination of unique, invasive, haunting emotions and sensations that are forever embedded in the mind of those who witness these results. The latter are man-made creations that will stand the test of time. This preamble serves to start a discussion concerning a small independent game, developed by an equally small Croatian studio, Under The Stairs, based in Zagreb. Let's see if this team has managed not to get carried away by enthusiasm and aim as much as possible close to that line in this review of Eyes in the Dark: The Curious Case of One Victoria Bloom. A luminous roguelite Eyes in the Dark: Light is a fundamental weapon Going out on the market with a title that doesn't have at least a minimum of roguelite mechanics seems impossible for new independent studios eager to establish themselves. Eyes in the Dark is also no exception. In fact, while presenting itself with a narrative structure in chapters and an audiovisual style that would suggest more of a linear adventure, the game turns out to be anything but. We know the structure of the genre: our goal is to reach the ~final boss~ without dying, otherwise we have to start over, albeit with some help at our disposal that will allow us to advance with ever greater ease within the hostile world gameplay.Eyes in the Dark takes these dynamics and adapts them to a very ~restricted~ map, given that the adventure is all set inside the villa of the Blooms, a family of inventors, researchers and scientists. Impersonating little Victoria Bloom, our task is to explore the nine areas of the gloomy abode (unlocked three at a time along the course of as many narrative chapters) to find our grandfather, kidnapped by mysterious dark creatures that move in the shadows . Here comes into play what, in a certain sense, is the ~protagonist~ of the game, namely the light. In fact, a flashlight will be the weapon with which it will be possible to defend oneself from the deadly arthropods that infest the villa. If initially it's just a normal battery-powered flashlight, it's able to quickly transform into a real firearm, thanks to upgrades that allow you to modify this and the other two components of the equipment: the slingshot and the shoes. Each upgrade grants stat improvements and elemental effects (as well as differences in the approach to the fights), but at the cost of a few slots to be filled (expandable up to a maximum of five). The excess improvements are still useful, since they reward you with a handful of Sparks, the game currency with which you can buy items from the crow Edgar, or the merchant, present with his traveling emporium in every area of the villa. Each area has several rooms and three doors: the shop door, the ~upgrade~ door (where you have to face a challenge and then be rewarded with an item of your choice from three) and the boss door. Only after defeating the latter will it be possible to proceed to a choice between the areas adjacent to the one in which the player is located. Before crossing the threshold, however, you will be prompted to select a pair of bonuses and incidents that will remain active until the end of the game. Eyes in the Dark: bonuses and unexpected events can drastically change the tide of the game As you progress, the enemies will become more and more aggressive and areas that may be overcome easily because they were previously faced at the beginning of the game could become your new obstacle (it must be said, however, that the game is not difficult at all; indeed, it would not have spoiled a slightly higher level of challenge, given not so much by the presence of multiple enemies on the screen, but by an effective general complexity attributed to individual opponents). After killing all the Guardians of the chapter or meeting defeat , the game starts again, but with a changed plan of the villa and some points from spgo to the ~Library~. Here it is possible to choose whether to invest in random items to be selected immediately before entering the villa or whether to purchase upgrades or bonuses which will then appear during the course of the game. Generational differences Eyes in the Dark: the screen that introduces the Insector's room, the first Guardian faced by the player Eyes in the Dark has a truly superb and clean audiovisual sector, which should set an example for all those who intend to communicate a gaming universe through image and sound. It's just a pity that these two elements follow two divergent trajectories. From the very first seconds, the visual influence exerted by silent cinema, on the one hand, and the gothic ~ la Tim Burton~, on the other, is evident. The interlude scenes contain the essence in an excellent way, catapulting the viewer into a world with a well-defined atmosphere... at least until the actual musical commentary comes into play, which draws hands full of 80s video games. The two universes, while working on their own, never really manage to come together harmoniously. The result is a sense of detachment from what is proposed, so much so that it doesn't seem far-fetched to think that there will be those who will anxiously await the gameplay parts and those who, instead, will look forward to returning to the atmosphere of the interlude scenes, such as it doesn't even seem rash to foresee the unanimous displeasure in finding in a product of this kind, which seems so well cared for and technically clean, a certain amount of minor bugs and glitches, which do not really affect the game's flow, but which certainly devalue the overall experience.", "date": "2022-07-21", "grade": "7.8"}