{"name": "Vainglory", "ref": "https://multiplayer.it/recensioni/141108-vainglory-i-nuovi-eroi.html", "text": "As we have said in the past, the genre of multiplayer online battle arena, for friends ~MOBA~, goes very well with touch control systems. In fact, they are titles that derive from real-time strategy, therefore with the characters who move indirectly (you have to touch a point on the map to order them to move in that direction) and attack their opponents following a semi-automatic approach: once the 'input, they proceed to strike anyone within range, unless given a different specific target. To hear it this way, it would seem like a solution worthy of a casual production, but fans of the genre know very well that things are different, and that indeed MOBAs represent in many respects the most hardcore available, both on PC and consoles as well as on devices mobile. In fact, in this type of game it is not enough to charge headlong: you need to have a strategy and put it into practice in a choral way, composing the teams so that no key category is missing for the success of the match. Strengthened by these assumptions, several excellent exponents of this trend have sprung up in recent years on iOS and Android, in particular Heroes of Order & Chaos, Solstice Arena and the recent Fates Forever. Well, now it's the turn of Vainglory, the debut title from Super Evil Megacorp, presented to the public no less than during the keynote where Apple revealed its latest terminals and new Metal libraries. Technically stunning, solid and addictive, Vainglory is probably the best MOBA on the App Store Pumped graphics, but not only The most striking aspect of Vainglory is undoubtedly its technical realization, further enhanced by the aforementioned support for the Metal libraries, which however require a latest generation terminal and which we therefore could not appreciate directly. In any case, on iPhone 5s the game performs very well, always maintaining excellent fluidity and showing off a high level of detail, which does not lose quality when zooming in. If we really want to find a fault with the production, it must be said that the touch interface is sometimes not very reactive and precise in the transitions from the shop to the map. To the positive aspects of the graphics is added another particularly significant one, that is the excellent design of the characters, who draw as much on the Western as on the Eastern tradition to propose fairly original styles and features. At the moment there are ten heroes available, although it is possible to use only some of them during the games, according to a rotation principle also common to other free MOBAs. There are the traditional tanks, i.e. the slow but resistant units, comfortable with close quarters, as well as the more balanced middle ground or the ranged, the characters equipped with weapons that allow them to attack from a distance. The freemium mechanisms appear quite elastic and accessible, so much so that after just a few games it is possible to definitively unlock a first member of the roster and regardless of the preset selection. Of course, nothing prevents you from buying a few packages of hard currency and getting all the warriors right away, but in the same way, those who want to enjoy the experience without shelling out money can do it without problems, especially as there are no limitations on the duration and quantity of matches. The only requirement is perseverance. Three against three the old-fashioned way From a gameplay point of view, Vainglory follows the more traditional dictates of the multiplayer online battle arena genre, while introducing a couple of interesting variations. After completing a double tutorial (but there are also various explanatory videos for beginners), the game allows you to start single player matches or three-on-three online multiplayer matches, which take place within the same map, a scenario characterized by a long main course but also by many junctions that lead to the heart of a forest full of both pitfalls and opportunities. The goal is always the same, to destroy the enemy base; however to do this it will be necessary not only to get the better of the opposing team, but also to eliminate the fearsome towers that are found along the way and which are able to annihilate us in a matter of moments. It therefore becomes essential to proceed only if escorted by the inevitable minions, and also in this way pay attention to what is happening around the character, because an ambush could be triggered at any moment. To increase the variety of the action we find three original elements. The first is represented by the possibility of gaining control of a gold mine, so from aQuickly increase reserves and allow for faster character progress. In fact, the classic in-game shop allows us to buy upgrades and objects useful for the traditional growth of the hero, which however remains linked to the single match, according to a typical MOBA approach. The second element concerns the conquest of a minion mine, which makes our troops faster and more effective in their continuous pour into the enemy area. Finally, in the sixteenth minute, there is the possibility of capturing a huge Kraken which, once defeated, we will be able to send towards the base of the opposing team to end the match in a spectacular way. These are features that do not revolutionize the experience, but which certainly add a further strategic substrate to an already terribly solid and engaging package in itself, a must for fans of the genre.", "date": "2014-11-22", "grade": "8.6"}