{"name": "Capcom Arcade 2nd Stadium", "ref": "https://multiplayer.it/recensioni/capcom-arcade-2nd-stadium-recensione.html", "text": "Retro gaming will never die, rather it will evolve in new directions. Capcom has understood this for some time, as has also understood the ever-awakened interest of players for the titles of the glorious cabinets of the past. We had a first test of it last year, when the first Capcom Arcade Stadium arrived on all consoles and on PC; we have a reconfirmation of it in these days, now ready for the debut of Capcom Arcade 2nd Stadium. Which presumably represents the second stage of a larger operation, perhaps destined to continue with two, three, who knows how many packages. No particular preambles or digressions are needed: the Capcom Arcade 2nd Stadium review will briefly explain which new games are ready to return from a now very remote past for our sector, and above all in what form. We tried it on PlayStation 4, but the substance shouldn't change much on all the other platforms on which the game will be published. The contents: 32 titles from the arcade era SonSon is now free with Capcom Arcade 2nd Stadium If you have already had the opportunity to try the first Capcom Arcade Stadium, you will already have clear how this new operation of the publisher works, on the content side. In short, anyone will be able to download (starting from July 22, 2022) the ~general container~, that is the virtual arcade with all its beautiful arcades, known precisely as Capcom Arcade 2nd Stadium. You will even find a free game waiting for you, namely SonSon. You may already know it, given that in recent years it has also reappeared on Virtual Console for Nintendo Wii: it is a horizontally scrolling platform video game, starring a little monkey who is very determined to eliminate all the enemies along his way, based (but very freely) on the Chinese novel Journey to the West. Nothing is ever thrown away for free, so you might consider downloading Capcom Arcade 2nd Stadium even just for this proposal; after all, if we remember correctly, the first Capcom Arcade Stadium had also given everyone another video game, but certainly a better one: Street Fighter. Now, it is clear that SonSon represents the mere tip of the iceberg in this nostalgia operation. Because besides him, there are thirty-one other names ready for you, for a total of thirty-two titles. Only that they will have to be purchased and added to the games room, in order to be enjoyed: and here you can opt for bundles including a certain number of cabinets or for single choices. Be careful though, because buying a cabinet and then immediately after a bundle that already includes it does not entitle you to any refund. It is advisable to study the list of titles and their subdivision in the store of your console (or Steam). On the quality itself of the thirty-two Capcom-branded proposals, the discussion becomes more complex. Probably many of you will have memories related to some specific names, and this could already be enough for a possible purchase. For those who are completely unfamiliar with the history of cabinets, it must be said that overall we are dealing with a varied chessboard, both in terms of the years of publication and the genres of reference. Lovers of fighting games will not necessarily be able to stay fasting, since there are (among others) Street Fighter, Street Fighter Alpha, Street Fighter Alpha 2 and Street Fighter Alpha 3. But the Block Block puzzle is also appreciable, which perhaps you will remember with other names and other places: you have to throw a ball upwards, break as many bricks as possible, and then receive it and send it back to the bitter end, without letting it end up on the ground, using a platform of limited length. It seems that an attempt has been made to satisfy all tastes and genres a little. In fact, in addition to the vast majority of titles based on horizontal and vertical frantic shootings (the aforementioned SonSon, Savage Bees, Gan Sumoku, The Speed Rumble) and names that stand out with their notoriety over all the others (Megaman The Power Battle, Black Tiger, The King of Dragons, Darkstalkers) there is no shortage of much less well-known productions, but no less able to entice certain players. And we think, in this regard, of Capcom Sports Club, Three Wonders and Pnickies - the latter, probably, the member of the Puyo Puyo family that everyone forgets to invite to birthdays. Personalization is everything If desired, it is possible to play Capcom Arcade 2nd Stadium titles with a real screen cabinet As with other operations of this type related to retrogaming, also in Capcom Arcade 2nd Stadium the main objective of the developers was not only to offer the most fluid and effective emulation (in any case not abwe have encountered problems or distortions of any kind) as much as allowing to modify at will each single element that constitutes the context of the emulation itself. In other words, customization is everything, and it affects the gameplay, the game view, the cabinets and the surrounding environment to varying degrees. Let's try to better understand what it is possible to do, review, change. First of all, the appearance of the screen can be changed at will, and for each individual title in the collection. For example, those who like to have the sensation of being right in front of a cabinet, will be able to maintain their presence in 3D on the screen; those who want to go straight to the point, will simply want the game window, without other frills to distract the viewer - and we know how important concentration is for old arcades. Furthermore, the number of filters available is considerable: for example, they allow you to add, modify or remove scan lines, in a simulation that is more faithful than in the past or adapted to modern times. Some possibilities include adding CRT scan lines, RGB grid for LCD screen, or general pixel softening. The rotation of the screen is also curious, which now allows you to enjoy traditionally vertical shoot 'em ups even horizontally. And vice versa, if you want... Capcom Arcade 2nd Stadium doesn't skimp on puzzle games either As well as the general appearance, the gameplay can also be modified to your liking. Apart from invincibility, which can still be activated by the settings of the individual cabinets, you can change the general difficulty, the number of lives, the damage inflicted by (and to) enemies. Perhaps, for those who want to train and then seriously test themselves in old-school experiences, Rewinding will be very useful. It is a feature that allows you to turn back time almost completely at will: in case of death, therefore, you will be able to understand what you did wrong, and perform a different action. Maybe that jump was too short, or the punch against the enemy had to be thrown not up but down, or even your plane had to deviate to the left instead of to the right. ~Practice makes perfect~, as they say: Rewinding is the practical application of the saying in question.", "date": "2022-07-19", "grade": "8.0"}