{"name": "Grand Theft Next", "ref": "https://multiplayer.it/recensioni/140783-grand-theft-auto-v-gta-5-grand-theft-next.html", "text": "It was September last year when the fifth chapter of the series that defined the concept of free roaming arrived in the editorial office to suck up all our free time (and also our working time) with the aim of transporting us to a credible and incredibly engaging Los Santos. At that time we had shouted at the masterpiece and we had felt in great company with practically all the sector press and a few weeks later our opinion had also been confirmed by the incredible sales of the game. More than a year after that event, Rockstar is ready to return to the scene by proposing a Grand Theft Auto V aimed at the so-called next-gen: PlayStation 4 and Xbox One. The PC, at the moment, is still out of the game since we will have to wait until the beginning of next year, but nevertheless what we are facing is not a simple high resolution remaster but something much more substantial. Let me be clear: the structure, the plot, the gameplay and the game world have obviously remained unchanged and perfectly faithful to what we saw on PlayStation 3 and Xbox 360 just over a year ago but among the graphic and technical enhancements, the incredible addition of the first person view and an endless amount of small but new contents, it is really difficult not to appreciate the work done by the software house in this period of time. Also for this reason, the article you are reading is completely focused on the novelties of this re-edition and we refer you instead to the original review published on the site if you want to know what GTA V is and what it has to offer to those who turn to it for the first time. this series or comes from the previous chapter. GTA V arrives on the next-gen and is immediately, once again, a masterpiece! Grand Theft Duty Let's start immediately with the key novelty of this re-edition: the first person view. The guys at Rockstar have used a large part of the time available to them in the development of GTA V next-gen to transform the game into a real FPS. But it was not a matter of simply moving the camera to ~make it enter~ the various protagonists given that in order to achieve this important change of perspective in the best possible way, it was necessary to create an astonishing quantity of new animations (we are talking about 3000 concerning the myriad of actions that it is possible to perform in the game) and of course rethinking from the base most of the controls of the game. By simply pressing the PlayStation 4 touch pad it is possible to change the view on the fly at any time with the exception of cutscenes and to meet every taste, Rockstar has created a whole series of alternative configurations of the controls and has implemented a new set of options to make the experience even more customizable. First of all, it is possible to separate the view on foot from that on board cars and aircraft but it is also possible, for example, to enable or disable the so-called headbob, i.e. the movement of the head while walking, as well as modify the camera when somersaults or movements are performed sharpness of vision. A further level of aim assist has been added to make target locking less automatic and as if all this were not enough, the game allows you to manually alter the field of view, the field of view to want to use technical terms, increasing or decreasing it according to your taste. Even the cover has been redesigned with the use of the right backbone which now allows you to ~hook~ on any obstacle and then lean out with the classic left trigger. There is even blind fire or, very clever and useful, the possibility of quickly throwing a grenade while using the view from the viewfinder. Testing the facts and in the light of the almost ten hours with which we put GTA V next-gen to the test, we can safely say that the first person view works really well when on foot but it didn't fully convince us while is driving due to the very nature of the game experience which, being far from any simulation nature, tends to favor those with the widest view, especially when you are in the air or driving through the streets of Los Santos . Nonetheless, being able to play the title as any FPS seems to have greatly enhanced the online sector with some modes, primarily the team deathmatch, which now seem to really join any Call of Duty in terms of frenzy of action and gameplay involvement. Among other things, during the match configuration phase, it is possible to force or not a certain view so as to leave any assessments on the balance in the hands of the host. Wasinteresting to note how this substantial addition to the gameplay has in fact forced Rockstar to retouch a whole series of surrounding elements. All video contributions and most of the posters and windows have obviously been converted to high resolution while all the characters have been enhanced with a swarm of new facial expressions and a compartment of often brand new textures. Furthermore, every single means of locomotion has been enriched with a dashboard complete with functioning elements, indicators and lights precisely to meet the finally implemented view from the inside. Even the cell phone and its use have been completely revised to be comfortable and easy to use while walking through the streets of Los Santos observing the city from the eyes of the protagonist. And that's not all That's right because next to such a substantial novelty there are a myriad of small ones and which concern the content part offered to players with a particular focus on those who have chosen to return to Los Santos after having already visited it on the previous generation. It consists of a couple of new vehicles and as many new weapons, a hatchet and a devastating experimental rail gun, but also a series of new activities such as the possibility of identifying animal species in Franklin's shoes to unlock a small vehicle from divers, some new stock car races, and the chance to track down a bunch of graffiti from a street artist that eventually unlocks some monkey costumes. For all players, old and new, the two most interesting additions concern a mission for Michael that will lead him to collect all the macabre clues to reconstruct a crime and at the end to activate some Noir-style graphic filters that can be turned on or off at any time. our discretion and the implementation in the campaign (and obviously in the online) of all the eleven updates released in recent months, including twenty-nine new vehicles and twelve absolutely new weapons, just to mention the two most prominent elements. But even in this case there are several other smaller but equally interesting ones such as the possibility, finally, of crouching while driving to dodge bullets or some tweaks concerning the mini map now able to show more road and indicators too in the default zoom. Rockstar has not failed to make full use of the two pads of the new consoles either: on Xbox One it ~limited itself~ to implementing the vibration of the triggers while driving, while on PlayStation 4, in addition to being able to use the touch pad to select flight weapons and radio stations, you can listen to phone or car conversations through the controller speaker. Furthermore, the luminous LED will change color based on the controlled character but, above all, it returns a decidedly spot-on flash when being chased by the police which, on several occasions in the dark, made us smile. We conclude this roundup of news with the part relating to Grand Theft Auto Online, an essential element of the GTA V experience but which, at the time, struggled to get noticed due to a series of stability problems and a lack long-distance pleasurable content chronicle. As we said just above, all the contents released up to now have obviously been implemented (therefore dozens and dozens of brand new vehicles, weapons, clothes and accessories) and it is also possible to bring your own character with you through a quick conversion procedure that allows , among other things, to recreate it aesthetically after the transfer. This is because GTAO now offers a much more versatile and powerful creation editor which, while remaining anchored to the original concept of largely automated facial features based on parental choice, now offers numerous additional presets and various sliders to retouch physical and facial elements most important. The maximum number of players that can enter the game has also been increased to thirty with two spectators, compared to the original sixteen. There is no doubt that we too trusted and hoped for the addition of the blessed robberies that we have been waiting for since the original release but at least the developer did not sit idly by. Make way for the technicalities In addition to the content aspect, where GTA V has undergone major changes is obviously in its technical sector given that the new consoles, and in the future the PC, are equipped with a lot of additional brute force compared to the previous generation. First of all, the game now runs at 1080p at 30 frames per second, with the computer being able to be pushed up to 4K resolution(but there we will have to see the optimization work done in due time). The fluidity is certainly much higher than in the past, although we cannot deny that in some situations, especially when driving during the day in the busiest parts of Los Santos, the frame rate is not that stable. At the same time, the work done to practically completely eliminate the pop-up and pop-in phenomena - the appearance of elements on the screen and the loading of textures on them - which have always distinguished Rockstar titles, is exceptional, increasing the visual horizon at the same time. Unfortunately however, also in this case wanting to go and look for the proverbial hair in the egg, despite the excellent work done with the implementation of a couple of anti-aliasing and anisotropic filters, in the larger and more breathing scenes the ladders they are still there and are also noticed rather easily. Absolutely nothing to say instead as regards the increase in realism of the various weather conditions, with winds that now have credible repercussions on the vegetation and on the waves that break in a much more realistic way on the elements of the scenario, while the puddles that to form in case of rain show extremely realistic reflections and refractions. It is immediately evident how Rockstar has worked very hard to dramatically enhance the management of the lights and their sources (which are now even tripled compared to what was seen on PlayStation 3 and Xbox 360) and which have repercussions on the general quality of the whole scenario, making it even more impactful, almost cinematic, the sunrises and sunsets. Also thanks to a general increase in the number of cars and passers-by who now populate the streets and who exhibit themselves in activities and situations capable of making Los Santos and its suburbs even more alive. The particle effects have also increased dramatically and even involve the volumetric fog that ~envelops~ the scenario when night falls and the light pollution creates that typical big metropolis effect where you notice a general diffused light over the distance. We close the technical roundup by spending a few words also on the models of the protagonists who have naturally been enriched with high-resolution textures and a brand new sector of new facial animations to underline the various acting moments. It's just a pity that passersby and secondary characters have remained decidedly anchored in the past and now detach in a negative way from everything else while some elements of the scenario show the side of much lower quality textures than all the rest, probably due to a work of optimization and upgrading that did not cover the entire game world. Just to nip any optimistic hopes in the bud, GTA V remains fully dubbed in English with only English subtitles while the soundtrack has also undergone an incredibly massive boost with a total of 150 brand new songs and a whole host of commercials. absolutely unpublished dialogues and comments.", "date": "2014-11-17", "grade": "9.7"}