{"name": "Un Link per Mario Kart", "ref": "https://multiplayer.it/recensioni/140774-mario-kart-8-un-link-per-mario-kart.html", "text": "Before going into the scrupulous examination of the contents proposed by this DLC, we can only write a brief preamble on what this operation represents. With the exception of New Super Luigi, practically a sequel and even published separately from its older brother, and excluding Mario Golf: World Tour because it was developed by Camelot, this is the first authentic DLC created by EAD. And, we tell you right away, there could only be a better debut. First of all because Nintendo has always - rightly - refused to make two Mario Karts per platform, both because they wouldn't be different enough, and because it's one of the few titles that, at least ideally, once released should sell until the last days of the console . This solution expands the original game - and the basis of the eighth episode was already very solid - and in doing so allows it to regain the limelight months after its release and to corroborate that evergreen nature we mentioned earlier. If DLCs arrive in the future for Super Mario and The Legend of Zelda, or for any other series theoretically ill-suited to host them, then we will discuss their usefulness; in this case some controversies seemed sterile and inappropriate. Also because, in addition to fitting perfectly with the nature of Mario Kart, this first update is rich, of quality, and comes at a low cost compared to the offer (8 euros if purchased individually, 12 euros in a bundle with the other package provided for May). Link and Hyrule, Mute City, the Blue Falcon and Excitebike... but what game are we in? Well, in a nice one! Elf, cat and proc... tanuki There are three characters implemented with this Pack #1. The first, as you surely know, is Link: we will talk about this choice later, at the moment we limit ourselves to stating that the model is good - it follows that of Skyward Sword - and above all it is animated adequately. During the stunts the collisions with the car are precise, and the legs, while driving the kart, are placed realistically on either side of the steering wheel: the only anatomically realistic character, perhaps the first of its kind to appear in the history of the series, proposed a graphic challenge that was abundantly exceeded. The other two pilots are represented by as many ~costumes~, one of which is legendary - and therefore sensible - or Mario Tanuki (mistakenly, amiably raccoon for friends). The usual winning reference to Super Mario Bros. 3, this time supported by two touches of class: the ~Ottobittian~ noises of the horn, and above all the rapid metamorphosis into a statue at the moment of the stunt. The other new entry is Peach cat version, directly from Super Mario 3D World, probably the only unhappy choice. Obviously the charm of the new costume is not comparable to the tanuki one, but other than that four versions of Peach seem frankly too many - with all due respect to the princess. Going beyond the judgments on charisma and appearance, we point out a feature of these new drivers noticed by few, first specifying that in this Mario Kart the characters are not divided - as we too had erroneously indicated in the review - into three categories as in the past. Or rather, the subdivision still persists (light, medium, heavy) but now the three sections are further declined within them, with slender characters even more slender than others, mediums tending to large and so on. In this context, Link is placed in the - already well represented - heavy category, but in the lighter range (like Donkey Kong and Waluigi, to name two). More interesting is the fate reserved for Tanuki Mario and Peach Gatto, both middleweights, both representatives of a new class. The feline princess reinvents herself as the missing link between light and medium runners, the beloved tanuki instead of arrogance imposes itself as the center of gravity of the game, between the light intermediates and the heavy ones. More tracks please! This pack revolves around the Zelda brand, so it's no surprise that themed items have been included such as tires signed with the Triforce, a (remarkable) hang glider with Hylian decorations, and above all the Hyrule Steed, a heavy bike that vaguely resembles the form of a horse: cute but quite vulgar, let's hope Aonuma didn't mean it seriously when he said he wanted to see her in an episode of the main series. In addition to Zelda, the Fulmine kart returns, symbol of Mario Kart DS, beautiful and finally useful, given that at the time those who wanted to win necessarily had to choose light vehicles. The Turbotanuki is an off-road vehicle halfway between a kart and a quad (in terms of statistics), while the Blue Falcon, the historic and most famous F-Zero vehicle, certainly dominates the scene among the newcomers. Do thehis debut in Mario Kart as a medium vehicle, comparable to the standard car, and not among the heavyweights. Well, we have finally reached the highlight of the DLC, without which the good things said so far would have been insufficient: the eight new circuits, divided into two tournaments (Egg Trophy and Triforce Trophy). In the selection screen they are placed immediately after the standard ones, and not by chance: these tracks are more demanding than usual, or at least as complex as the more complex initial ones. The Pack 1 trophies also differ from the canonical ones because they contain both unpublished tracks and remakes, without sectorialisations. Mario Kart 8 was already - and undoubtedly - the polygonal episode with the best circuits, and this pack only increases its caliber: all eight new tracks are (at least) pleasant and, in the best cases, in addition to quality they bring also variety. Perhaps the least inspired is the Excitebike Arena, dedicated to the old Nintendo success: faithful to the original, it looks like a ring, as classic as it is requested by some enthusiasts. Requested because there has always been a track of this type in the last few Mario Karts: however, for experts deprived of ~snaking~, the interest would not have been much. The solution adopted is remarkable, that is a circuit with a random arrangement full of ramps: a fight to be fought making mistakes as little as possible, because recovering is very difficult. The Pista Polare is divided into distinct plots with rare intersection points, during which it is possible to switch from one lane to another without too much effort. The road isn't wide, and it's icy. A challenging ride that seems to be full of hidden potential - much of its success will depend on the usefulness of the shortcuts. If the (difficult) cuts don't prove fruitful, then a well-drawn path will remain, but nothing more. The Hyrule Circuit, unsurprisingly the most awaited by fans, plays it safe: both as a setting, with the castle separating two dirt parts of the Hyrulian lands, and as a conformation. Worthy of note, in addition to the replacement of coins with rupees, is the central ramp, which manifests itself only by impacting three switches: a simple idea but with complex dynamics, given that its appearance is temporary and that different pilots can hit the activation. The Muraglia del Drago is a serpentine ride typical of Mario Kart 8: a circuit that is beautiful to look at, elegant, with an exemplary change of central direction - especially for those who perform ~Frogging~ - and a discreet vertical development. It will probably not be anyone's favorite, but at the same time, no one will find it unpleasant. Pista Arcobaleno, one of the three remakes, comes directly from the SNES: technical and meticulous as only a flat track can be, it complicates everything with sudden jolts that undulate the ground. Clean and very classic, it was right to include it in the DLC to represent the category. Also from the past, this time recently, Wario's Gold Mine: the most beautiful to see, with the wooden floor and the warm tones enhanced by the lights of the dying sun. In Mario Kart 8 it finally finds its ideal place: no more obstacle course - bats and carts aren't that harmful - but a fast track and, in the two new cuts and the redesigned dish, even technical. We've left the two best courses for last: starting with Yoshi's Circuit, which with this edition on Wii U becomes the first course to appear in three different Mario Karts (initially on the GameCube, then on the Nintendo DS). And not by chance. It is one of the best tracks in the series, perhaps the most beautiful ever: it offers soft and technical curves, traced on the perimeter of the plump Yoshi-like silhouette. Even those who know her well will be surprised because, as a lady who exalted snacking as she was, she doesn't give up a crumb of her glory even in this new guise, with a half-way chicane - this time not avoidable - to scream. We close the discussion with Mute City, the circuit dedicated to F-Zero, the most brilliant of the unpublished works. It could have been blasphemous, but instead it's just a beautiful act of love towards the original series: because never like this time in Mario Kart do you run fast, up and down until the sidereal jump that precedes the final straight. Each track is also available online, so if you like racing on the net and don't want to be left out - anyone who doesn't have them plays separately - the purchase is almost obligatory. Super Smash Karts There is one last, further detail that we would like to discuss, namely the colonization of Mario Kart by the other series - even if, in the case of F-Zero, the opposite path is more credible. Leaving aside the amiibo, supported more for dedication thanwith conviction and limited to a few costumes for the Miis, characters from alien brands arrive for the first time in the saga. So far the only lucky ones who had sneaked in had been apes, however in a limited way and conveyed by that Donkey Kong who, conceptually, has the presence of law in the series (he hosted and named the first title with Mario, after all). This time it's something of an invasion, both with Link and with the dedicated tracks, and things will progress further with the next Animal Crossing themed pack. In our opinion it is premature to argue that in the next iterations the saga will become comparable to Super Smash Bros., therefore without a main reference brand: however, we are sure that it will not remain an isolated case, for two very specific reasons. First point: the Mario saga in recent years has struggled to produce new successful content, and this is unfortunately a fact. With the notable exceptions of Rosalina, two or three particularly inspired settings from Super Mario Galaxy and - exaggerating - the Cat costume, there is little recognizable left to steal and reinterpret with Mario Kart. Some of you might comment that the use of content is purely instrumental, but it's not entirely accurate: first of all, reworking is - basically - easier than creating from scratch, and furthermore an initial reference can help to conceive an interesting track. See F-Zero, which made Mario Kart racing like never before. The second reason why the series will constantly propose these hybridizations, much more important than the previous one, is that Iwata has finally started what was announced at the beginning of the year, or rather a more dynamic use of intellectual properties. Only time will tell if this will bring benefits in the long run, but we'll have to get used to these operations: Mario Kart sells a lot, so it's an excellent vehicle for making other characters known and popularized - not unlike what was done with Monster Hunter or Bayonetta, to name two. The ~outsiders~ however, at least in the near future, will hardly be numerically comparable to the ~Marieschi~ characters... but they will be there. This attitude probably benefits Mario Kart, less clear if it will somehow bring prestige to historically more sacred and little (so far) exploited brands such as Metroid and Zelda.", "date": "2014-11-17", "grade": null}