{"name": "La Vendetta di Garruk", "ref": "https://multiplayer.it/recensioni/140448-magic-2015-duels-of-the-planeswalkers-la-vendetta-di-garruk-garruk-si-vendichera.html", "text": "For all those who are not fond of card games, we remind you that the Magic: The Gathering series has imposed and revolutionized this game world thanks to customizable decks of thousands of cards with a simple but very profound game model. It is difficult to say where the collecting ends and where the challenge begins, but certainly, even in this digital version of the Wizard of the Coast title, the importance of the gameplay and of the cards cannot be overshadowed. Garruk's Revenge is the first expansion to benefit from the update, released a few days ago, which changed the gameplay of Magic 2015 - Duels of the Planeswalkers. Even without directly purchasing this new DLC, through the free update, the developers behind the aegis of Wizard of the Coast have decided to eliminate one of the most contested features, the premium booster packs. In this way it is possible to directly unlock the cards present in those digital containers simply through multiplayer challenges by earning ~Battle Boosters~. Obviously, all those who had already decided and purchased the Premium Booster packages should not despair given that in Wizard of the Coast it was decided to reward user loyalty with some exclusive content currently not yet announced, but we are sure, even in a perspective of recognition of the sacrifices made by users to support the product, which will be valid and fitting prizes with respect to the overall gameplay. In fact, one of the great problems that afflicted Magic 2015 - Duels of the Planeswalkers was the now sad and well-known problem of pay to win; nobody ever likes paying to win, and in this case decks made up of important cards (more than 40 to be exact) were made unavailable. Here, the real strength of this update is precisely this, surely the developers have been able to listen to the criticisms of the users. Magic 2015 - Duels of the Planeswalker is back with a new DLC, is it really the change we've been waiting for? You face the game in the role of Garruk Wild Tongue, the most famous of the hunters of the Multiverse and with his deck available it is possible to challenge all the opponents present. In reality, the Campaign mode, with a story that does not actually reveal any mystery while remaining rather obscure and inconclusive, is divided into only four new challenges, demanding but not too much. Subsequently it is possible to unlock the exploration of the area which makes the game much more interesting, resulting in the added value of this DLC, since it offers the possibility of unlocking all the new cards (up to a maximum of 51). Therefore, remember that through the update you will have the possibility to unlock the Premium Booster cards simply by playing, but with the expansion you will have many more available. The battles all take place in Alara and as with the other areas encountered in the Magic series, each location equals different sets of unlockable cards. Apart from the possibility of using Garruk's pre-built and closed deck throughout the expansion, this new digital content does not change what are certainly some shortcomings highlighted by the basic product released a few months ago. Forget the preconstructed decks, and we emphasize created with quality and balance, from past editions. Card management and deck construction is not immediate at all, the cards themselves are too limited as are the online multiplayer options. Certainly the price of Magic 2015 - Duels of the Planeswalkers: Garruk's Revenge is not exaggerated and gives you the possibility to increase the number of cards available even if in a limited perspective, because for example not allowing the use of the deck of Garruk online?", "date": "2014-11-14", "grade": null}