{"name": "Aiuto", "ref": "https://multiplayer.it/recensioni/140610-dragon-age-inquisition-aiuto-arriva-linquisizione.html", "text": "It is never easy to review an RPG and least of all when it is developed by the software house that made the history of the genre and helped to spread it first on PC and later on consoles, proposing hybrid ideas that, between ups and downs, have led to the numerous evolutions we have seen made and implemented in recent years. And it can even risk becoming a dramatic situation when it turns out that the title can easily take more than 60 hours to complete while leaving out a substantial percentage of secondary content, and you have very few days available to try it and write about it. In any case, what follows is our judgment on the mammoth Dragon Age: Inquisition; an assessment that, we are sure, could leave you doubtful at first but which, we hope, all the video coverage of these days and the text that follows will be able to motivate and explain in depth. Dragon Age: Inquisition is a rich and mammoth title but unfortunately it is far from perfect Once upon a time The story of Inquisition opens just a few weeks after the epilogue of Dragon Age 2. Hawke, the hero of Ferelden, is gone; mages and templars are slowly trying to materialize an alliance thanks to the intervention and effort of the Divine Justinia V. Suddenly, an incredible explosion literally pulverizes the place where the conclave between the two factions was being held and all that remains it is a greenish gash in the sky from which demons and our protagonist, distraught and unconscious on the ground, begin to emerge. We will be the only survivors of the catastrophe and we will awaken with a strange power capable of closing these portals between dimensions. A power that at first will attract the ire of the people ready to accuse us of being the reason, the instigator or more simply the perpetrator of the explosion but which will soon become an essential element for us to gain a respectable position in the newborn Inquisition and be summoned as the Herald of Andraste: the chosen one of the main deity of the Dragon Age universe. From that moment on we will be transported into an extremely full-bodied plot, which will see us become familiar with dozens of different characters, many of whom are well-developed in terms of character, discover numerous different places and even witness a couple of very tantalizing twists that they will lead to evolutions of the game world (and of some aspects of the gameplay) and which will arrive, surprisingly, after having already invested dozens of hours in the title. Where such great narrative goodness runs out and is poorer than necessary is in the definition of our nemesis: the bad guy of the moment is in fact rather simple and linear, almost two-dimensional in his being obvious and devoid of bite. His motivations are clear from the start and in his appearances we will immediately know what to expect from his behaviors. At the same time it is clear that BioWare has struggled quite a bit to pull all the strings of a universe that has become so vast and cumbersome over time. In Inquisition there is really a lot to read and listen to and sometimes it will be too tiring to follow the story that is told to us. One easily gets lost in secondary subplots that are often interrupted without having been able to deal with a real epilogue and it takes a moment to be overwhelmed, almost submerged by all this narrative. Let it be clear that we are not complaining about an element that will certainly delight those looking for a particularly complex and in-depth role-playing game from the point of view of history, but for those who perhaps want to follow only the main quest or in any case have just the indispensable information to follow the overall narrative arc, it will be hard to digest the fact that many things will only be hinted at and will not be understandable without facing hours of dialogue and hundreds of written lines. Among other things, as per BioWare tradition, Inquisition is a sequel that can only be truly appreciated by those who have also played the previous two chapters of Dragon Age. It is obvious that it will always be possible to start with this episode but, for once, we almost feel like not recommending it since the title from the beginning will put you in front of many concepts, notions and characters assuming that the player knows them perfectly with the risk of displacing the novice and making his first few hours of play very difficult. After all, it is what also happened in Mass Effect with all the pros and cons of such a choice that is certainly very bold in today's panorama. We end the paragraph on a small, absolutely positive note for the splendid creation editorof the character that will allow us to create our alter ego with incredible depth for all four available races: humans, elves, dwarves and qunari. Big and fat If there's one thing you immediately perceive about Dragon Age: Inquisition, it's that it's gigantic. We are convinced that we do not risk being proved wrong when we say that in terms of content and its variety, this new work from BioWare will become a reference point for the genre. There is simply so much, perhaps even too much to do between side quests, collectibles of all kinds, side activities, materials to collect, exploration for its own sake and much more. It is precisely in this vastness, as well as in its combat system - but we will come back to it later - or in some graphic and artistic choices, that we immediately perceive how Inquisition seems to have been inspired by the MMO tradition rather than the classic RPG concept . The exploratory structure remains the typical one of the series: not free roaming but a subdivision into areas that can be discovered and unlocked based on the choices and decisions we make during the adventure and which we can access by selecting them from a map of the entire world of game. Once inside them, we will be able to roam freely around the area, worrying only about whether our level is suitable for the threats we are going to face and in total freedom to discover and collect at our discretion, the dozens of quests scattered around the location. It is practically impossible to walk for more than fifteen seconds without coming across something to do and, even if these areas are particularly fluctuating in terms of extension (we go from microscopic to giant with the bulk represented by medium-sized ones), the common denominator is precisely the density of activities that can be carried out. Activities well grafted into particularly varied stylistic and artistic scenarios ranging from forests to deserts, swamps and mountains, coastal and city locations. We must say that we have perceived the absence of a large city like the Kirkwall of the second chapter but completely forget the recycling of settings that characterized that episode. Wanting to go deeper into the role-playing structure of Inquisition, it is evident that there is a substantial difference between the main quest, where BioWare's stylistic and writing skills are pushed to the highest levels and the player feels truly in control of his choices and consequences they will have on the state of the game world, and side missions or interaction with other non-player characters. In the latter case, in fact, there is a certain linearity that clashes with the tradition to which the Canadian house has accustomed us. To put it briefly, The Witcher is quite another thing in terms of the weight of the decisions made. It is true that once again there will be many characters to recruit in our party, which as usual will be made up of a maximum of four members, but a certain underlying linearity is always evident, made up only of multiple choices in the dialogues that minimally take into account about what we've done in the game, about our class or race or even about the bond we've created with these characters. This does not mean that they are poor at the level of character or writing, on the contrary, but only that we have always felt we were spectators of an evolution of the relationship between the protagonist and the other non-player characters which seems to be on track and which can at most reach inevitable sex scenes or a few handfuls of side quests. AAA Wanted Inquisitors The central focus of the new Dragon Age chapter is obviously related to that Inquisition which also gives the game its subtitle. In fact, the evolution of our protagonist and his adventure moves on several levels. On the one hand we have the classic experience collected by performing practically any action and which allows us to change level (the cap is set at the twentieth) and therefore to spend the skill points earned in the various skills that populate the four branches of talents that make up each of the three available classes: warrior, thief and mage. The system recovers heavily from what we have seen in the past of the series with active skills, other passives and a series of unlockable upgrades. On the other hand, it will never be possible to alter the basic statistics which will be directly linked to the class and can be upgraded through the equipment worn. Then there are the power points that can be earned by completing quests or completing the activities that the game offers us: they are used to have access to the main missions, or in any case to thatthe most important ones for the plot and to unlock the reachable locations on the world map. Finally there are the levels of the Inquisition. These are earned by increasing one's influence in the organization which, as for the experience of the characters, grows as we complete quests and activities but also by completing the supplies: real missions of pure collection of objects and materials present in the various game areas (the saddest part of the whole offer since it reminded us of the silliest quests, in perfect grinding style, of MMOs). By increasing the level of the Inquisition, you earn points to spend on real perks, divided into four skills and which represent further passive upgrades ranging from discounts with merchants, to various bonuses to experience related to combat or the search for lore for reach up to additional slots for potions or an increased search radius of interaction points on the field. There really is something for all tastes. The system may seem complex in this explanation but it is actually perfectly blended into the gameplay and guarantees great freedom of action in the player's work who will thus truly find himself in control of his own path within the game world. As if this were not enough, by consulting the war table in Haven or Skyhold, our strongholds where we will have access to crafting benches and the possibility of interacting with all the non-player characters that we have convinced to follow our cause, we will also be able to send our three main agents - Cassandra, Leliana and Cullen - to complete a series of timed missions that will allow us to earn bonuses and items along the lines of what happened in Assassin's Creed with recruited assassins or fleet management. We limit ourselves to pointing out that as regards the inventory or the quest journal we are faced with very classic choices for the RPGs of these last generations with a maximum limit of transportable objects in the first case and a very traditional slot subdivision of the various pieces that can be mounted on each character and a list of missions divided by location with the possibility of having an active one to follow in the case of the newspaper. In full respect of the BioWare tradition, it is also essential to underline that all the secondary characters that can be included in our party can be completely managed manually as regards their inventory and their level increase with consequent unlocked skills. The multiplayer Dragon Age: Inquisition also offers a multiplayer mode completely unrelated to the main campaign. It is a classic horde where we will be able to choose pre-packaged characters and make them grow wave after wave and game after game to unlock better equipment and ever more powerful skills. There are three maps available and they concretely represent the only way to make real dungeons given that the classic dungeons are missing in the single player settings. There is also a small real-money microtransaction component that will allow you to quickly buy high-level equipment and skills without participating in all the grinding phase related to growth. It is important to underline that the multiplayer is completely an end in itself and will not lead to any kind of bonus or enhancement as regards the single player mode unlike what happened, for example, with Mass Effect. The cross and the delight The developer's choice to offer a specific game interface for PC and another that instead caters to the console public or who prefer to use a joypad to move their avatar on the screen is certainly to be appreciated. In the first case we are faced with a HUD very similar to that seen in an MMO with a bar dedicated to the eight favorite skills, a space for potions and a whole series of shortcuts to quickly command the other party members or to access the various game screens. If you decide to use a pad instead, the game largely reuses what was seen in Dragon Age 2 with the front buttons and RB dedicated to the use of skills and a second set accessible by pressing the right trigger. Everything is always very intuitive. But after so many words written to explain and tell a game of this vastness, it is also right to highlight where BioWare's work, in the opinion of the writer, shows a soft side to criticism. And many of these are related to combat. Inquisition tries to combine what has been seen in the previous two chapters of the series by offering a hybrid system. The title can be", "date": "2014-11-13", "grade": "8.8"}