{"name": "Lo scatto senza scatti", "ref": "https://multiplayer.it/recensioni/140205-call-of-duty-advanced-warfare-lo-scatto-senza-scatti.html", "text": "Between Call of Duty and the PC something broke, irreparably, with the release of Modern Warfare 2. Infinity Ward was ahead of its time and in 2009 spilled a nice ice bucket on the platform that gave birth to the series, the first recognitions and the prerequisites for trying your luck even in the broader context of consoles, making them achieve their stellar success. An icy shower, the kind you never forget, but which, on the contrary, also ended up ushering in a bad trend. Do you remember? No more dedicated servers, replaced by a totally armored peer to peer system, IWnet. No more mods. No access to the console and RCON commands, thanks to which to manage basic utilities that have always been taken for granted in the multiplayer environment, such as adjusting the field of view. Limited number of players, with paradoxes such as the remake of the popular Brecourt (Wasteland) which played far worse than the original. No possibility to play in LAN. No more free additional maps via patches but only through DLCs, sold at the expensive price of 15 euros. Death of the competitive scene. All justified with lies that were neither in heaven nor on earth, such as the one aimed at defending the new direction as aimed at protecting users, first of all fighting against cheating, when the system had been hacked a few days after its launch and its life has turned out to be among the most scourged by crowds of losers who really need to go and buy some ~skills~. In short, instead of extending the solidity, flexibility and quality of the gaming experience guaranteed by the traditional and tested PC infrastructure to Xbox 360 and PlayStation 3, it was decided to impose medieval limitations on the latter. That's right: a bit like certain science fiction stories in which we suddenly find ourselves in a future where Evil has won. Not to mention that such an excellent precedent ended up inspiring many other developers, reaping excellent victims (try to think of the ~evolution~ undergone by the direct or spiritual sequels of highly appreciated multiplayers such as F.E.A.R., Wolfenstein: Enemy Territory, Operation Flashpoint , Crysis Wars and Far Cry...) and risking leading to the definitive establishment of a dark era for online gaming on PC, of which fortunately we are beginning to see signs of exit from the tunnel. A season of cold showers almost a generation long, inaugurated five years before the one that raged on social networks last summer. Precursors, we said. If this premise may seem long and perhaps a little out of place, you are wrong: since then on PC every Call of Duty is essentially an unknown factor, even when the launch is preceded by reassuring official statements, and until you see it running in front of your eyes, installed on your system, nothing can be ruled out, especially bad surprises. Just think of the disaster of the first Black Ops, launched in a pitiful state, which lasted for weeks, or the half-disaster of Ghosts, launched in a less pitiful state but with other problems, which decreed its premature death. And because, as we will see in the following lines, the wounds generated by that affaire can prove to be far from healed, ending up backfiring on the reality we would like to play today. But first another dutiful, quick premise: this review intends to analyze the specifics of the edition for Windows systems. If you are interested in learning more about the nature and goodness of the strictly playful offer of the first chapter of the saga created entirely by Sledgehammer Games, we invite you to reach this address, where you can find the review of the PlayStation 4 and Xbone One versions, both of which are identical in content to the PC one, or to launch the player that you find below, which summarizes the salient features in video format. Reviewed the PC version of Call of Duty: Advanced Warfare. How is this year going? A new old engine It is certainly one of the most popular topics of the ~Sports Bar Internet~: has Call of Duty changed its engine this year? To help us see each other a little clearer is the PC version, confirming that certain disputes are sterile and some definitions mere product labels. Cap of 91 frames per second in multiplayer, like Modern Warfare 2 and 3? Different executables for each game mode (Campaign, Multiplayer, Exo Survival)? Model of the Bulldog and some other weapon practically the same as they appeared in Ghosts? Moans of pain of certain female characters usable in multiplayer substantially identical to those of last year's debutantes? Usual tripartition of the qualities of the texture in Texture Resolution, Normal Map and Specular Maps, with the usual presets? Ragdoll that appears loose but also disjointed like the one introduced since Modern Warfare 3? Need to reload the scene when making changes to graphics settings? They are all traces of previous technology, on which the game undoubtedly relies. How much of the code is actually old and how much actually new, however, is difficult to say, on the other hand, as even illustrious names like Kevin Levine teach with reference to the Unreal Engine, it often makes absolutely no sense to talk about ~UE2.0~, ~UE2. 5~ and ~U3.0~, but it would be appropriate to speak of ~EU and that's it~: in fact, several developers work on a certain technological heritage, transfiguring it over time, even radically, through a continuous flow in which it makes little sense to identify a break, for which certain nomenclatures are often coined mostly in terms of communication with third parties. There is certainly a trace of the id Tech III, the engine christened by John Carmack with Quake III - Arena, in 1999, which the Call of Duty series has been using since its debut, which took place in 2003, just as it was reworked, year after year, often heavily. And that this autumn is strongly modified. Yes, because you can also launch all the j'accuse you want, pretend that every shooter contemplates environmental destructibility or a free-roaming setting, even when perhaps it would only be distorting or, worse, even harmful to its formula, but Sledgehammer Games deserves credit for having done a simply brilliant job of updating technology. There is so much, so much new in Call of Duty: Advanced Warfare graphics, to the point that it could mislead even those who know the saga quite well. Starting from a trinomial through which we tend to identify the aesthetics of this first phase of the new generation (of consoles): lighting, material rendering and image quality. In reality, these are aspects that the saga had already been working on for a couple of years, with the DirectX 11 improvements of Black Ops II and some innovations that Ghosts tried to introduce, dispersing them in an overly schizophrenic technical/artistic direction, but which here they are far more refined. The lighting is more vibrant and sophisticated, thanks to an HDR that probably can count on a greater breadth of color space than in the past, certainly on a more natural look and behavior. The skin of the characters appears more credible than ever, due to a sub-surface scattering among the best ever seen outside a tech demo, while elements such as wood, metal and stone are happy to show off all their body thanks to screen discreet space reflection. To season and harmonize a depth of field of exceptional quality, already superior to the excellent Bokeh seen in the last episode edited by Treyarch, and a motion blur up to par. In short, the look and feel becomes extremely close to Crysis 2, a real forerunner of certain ~next-gen tpoi~, and to Killzone Shadowfall. It must be said, however, that as deserving as it is (sometimes also in terms of textures), Advanced Warfare is also very ~smart~, tending to beat on certain factors to maximize the impact, when in reality under others it is clearly noticeable how much ~familiar~ and limited. All of this, in a nutshell, on PC translates into an overall good job. Certain margins of superiority compared to the console versions since the regular episodes have become multiplatform with Call of Duty 2 (definition of shadows, textures, anisotropy, image quality) are always present, while the commitment made on the front of types of anti-aliasing. An even more unusual implementation of a solution of excellence and little ~ mainstream~ such as Supersampling. Very appreciated, seriously, but perhaps at this point something in between like good old MSAA could have been added. For the rest, nothing in particular to report, not even on the front of the Nvidia exclusives, which last year belatedly marked their visit with the dynamic fur and a few more splashes of APEX/PhysX, while today they limit themselves to HBAO+ and the possibility of doubling the rendering resolution via DSR. In a nutshell, all this translates into almost flawless performance. The rather exorbitant system requirements and an even more ~PlayStation 4/Xbox One centric~ processing than Ghosts, where what remains of Infinity Ward (very little apart from the name, judging by the facts) was probably practicallylimited to brutally importing the One development environment to PC, generating catastrophic bottlenecks, they really feared the worst, but the team led by Glen Schofield has fulfilled its duties, offering performance well matched to what is put on video . Letting the numbers speak, on the test system, at 1080p with everything maxed out and FXAA in the Campaign we have an indicative average of 130 frames per second, while in Multiplayer we hardly get away from 91 frames. Adding SSAA up to x4 things remain extremely satisfying, averaging 90 and around 70 frames per second respectively, and were equally satisfying when we tried to ~scale down~, with fluidity appearing to gain significantly. congruous and proportionate to the waivers that we have gradually tried to apply, for pure scruple of tests. On the other hand, the drawback represented by the fact that the beginning of the interlude films are characterized by a rather annoying stuttering, which does not seem to disappear even by fiddling with the Shader Pre-loading options and the Caches dedicated to Shadows and Solar Rays, while it does especially seeing the much-hyped selector to adjust the field of view included only for Multiplayer and Survival, when there is no rational reason why unnecessary surplus in Campaign should be considered (and the sense of constraint and lack of self-determination in the playspace that you try every time you switch from one of those two modes to the single one is there to confirm it). Let's play? Activision had already tried last year and is trying again today: as with Ghosts, the presence of servers has also been declared for Advanced Warfare. Words that shatter like a crystal glass crashed to the ground when playing online it happens to remain packed for a few seconds, until the message ~host migration in progress~ appears. Therefore, if we can speak of servers, we can at most refer to those relating to the management of profiles, certainly not dedicated to matches, which seem to have all the features of a classic peer to peer communication. If nothing else, at least compared to Ghosts a connection status indicator has been reintroduced, after the absurd exclusion last year. The rest of the multiplayer infrastructure follows, with various updates in terms of layout, graphic presentation and customization options, the device developed by Infinity Ward in 2009, which was mentioned at the beginning, without even granting the possibility of switching to managed servers by the community in unranked encounters, as was done with a strange but welcome compromise in Modern Warfare 3. A push and pull that after all these years seems to have broken the patience of PC players, once and for all. In fact, Call of Duty: Advanced Warfare boasts the unfortunate distinction of being the first episode of the saga not to have reached even the tenth position among the best sellers on Steam, neither in the days before nor in the days after its launch. The same average peak of daily users speaks for itself, describing an unusually worrying situation for an exponent of the saga at the beginning of his online life (just over 30,000, when once there were 200,000 and beyond). As already noted in the review of the console editions, to which we referred above, the game is solid, fresh and well-finished, overall more than worthy, both in Multiplayer and in Exo Survival, and is satisfactorily adapted to the PC also in fact of controls as well as in audiovisual terms (although there are those who complain about the acceleration of the mouse, which doesn't bother us, regarding which work-arounds are circulating in any case), but it is a title that is coming to the Windows platform frequented by a user that is one step away from being considered niche and which, barring twists and turns, will only tend to further stabilize downwards in the near future, with all that follows for the concrete enjoyment of its patrons ( desertification of playlists, slowness of matchmaking to combine matches, balancing of matches, loss of interest on the part of developers to make corrections and much more suffering that every militant experienced in online arenas should have experienced on his own skin). It is certainly a pity, because the user has decided to ~pick it out~ with a Call of Duty that certainly deserves more consideration than its more unfortunate but fortunate predecessors. Seriously consider it, in case the idea of launching yourself into heady clashes between a dash and a double jump tickles you.", "date": "2014-11-06", "grade": "8.0"}