{"name": "Balzo in avanti", "ref": "https://multiplayer.it/recensioni/140022-call-of-duty-advanced-warfare-balzo-in-avanti.html", "text": "Advanced Warfare isn't your usual Call of Duty, it's a real game changer for the Activision franchise. There are three factors that lead us to this conclusion, and they all concern a ~first time~. For the first time, a new chapter had a three-year development cycle instead of the usual two; for the first time we are facing a real, new graphics engine, totally next-gen, and for the first time there has been a significant enrichment of the mechanics, comparable in some ways to the transition from the ~classic~ Call of Duty era to that Modern Warfare. Are we therefore faced with that step forward so coveted by users? In some ways the answer is yes, and paradoxically the sector that has benefited the most from the desire to overturn the usual schemes is the riskiest one, the most difficult one to touch without breaking the balance and granite mechanics, multiplayer, whether competitive or cooperative. It is a pity therefore that the campaign has instead remained practically anchored in the past. But let's go in order. Call of Duty: Advanced Warfare is a significant and successful step forward for the series Power changes (almost) everything We are in 2055, a not too near future in which there has been the long-delayed invasion of South Korea. We take on the role of Jack Mitchell, a strong and motivated Marine, ready together with his team to ~parachute~ on Seoul using sci-fi pods , to try to put a stop to the onslaught of North Korean men. The battle is without neighborhood, house by house, between huge avenues at the foot of skyscrapers full of neon and small alleys. A classic setting that allows us with great choreographic and directorial effort to familiarize ourselves with the abilities of the Exo suit, from the double jump to the ~automatic grenades~. But at the end of the mission, when we are asked to destroy a giant flying gunship, fate plays a trick on the protagonist and his companion Will. The latter dies clinging to the flying vehicle with the C4 in his hand, while Jack Mitchell remains lifeless on the ground, more dead than alive and with his limbs reduced to stumps from the splinters of the gigantic explosion caused by his friend's sacrifice. The war for the United States is over for Mitchell, but the future for him is not that of a veteran with post-traumatic stress. His partner is in fact the son of Jonathan Irons, the head of the largest and best-armed private military company in the world, high-tech mercenaries, called by the nation states when the dirty work has to be done or it is simply not possible to deploy the practice in the field. Irons sees him as his lost son, nurses him back to health and gives him a job, new limbs, and a brand new Exo suit. His task: to fight the KVA terrorists led by Hades. Therefore, it is no longer a question of exporting democracy to the rest of the world, but of carrying out ~police~ operations in the guise of private citizens; do what the United States (or more generally, politics) can no longer do due to blatant ineptitude. A future in which multinationals and private companies are in charge, and not the states. The campaign, divided into fifteen missions, and completed in exactly five hours at a normal level, therefore follows a classic plot, showing everything that the franchise has staged in recent years, alas, but without too much conviction. We don't want to fall into dangerous spoilers, but it is immediately clear who will be the main antagonist and what his motive will really be. What in theory should be an important twist is immediately called, thus canceling any desire to surprise the player. Mind you, we all know who the bad guy is, but despite having the face and voice of Kevin Spacey in the House of Cards version, he has zero charisma, his motivations and the staging of his revenge plan are like a real bad guy of series B. It's a shame, because we would have expected a more cerebral figure, a sort of charming, cynical and ruthless Wall Street white collar, while instead he is ~only~ a furious madman with a desire to exterminate due to a family trauma . Nothing to do with the power of the lucid madness of Menendez in Black Ops 2. In short, the story is not exactly the strong point of Advanced Warfare, which on balance is a sort of Call of Duty bignami, in which never before feels a strong sense of deja vu, mitigated however by missions that work despite a whole series of classic limitations, perfect as a showcase of what the franchise is. The pace, however, is decidedly good, there are no clearly discarded missions, nor bad sections on vehicles such as the one aboard the tank in Ghosts. The scriptit is therefore the same, a linear and scripted campaign beyond belief, practically always glued to someone's back, in which nothing is to be thrown away, but also where the moments that stand out are very few, in which next to a few truly impactful moments (the ~cold~ mission is a good example of this) we find some frankly not very credible solutions, most likely the result of a cut and sew in the script, where internal coherence has been sacrificed on the altar of (alleged) spectacularity. Why not dare all the way? Such a direction clashes terribly with the potential of Exo suits, which unfortunately are underused on balance. The vertical expansion, the main feature of a very successful multiplayer, is set aside for an all too classic setting, in which there is little room for freedom of action. Before each mission, a screen warns us what type of Exo we are wearing, each with different abilities, such as double jump, magnetic gloves, grappling hook, sonic bomb, invisibility and so on. We use them practically only when the diligent companion Gideon tells us to use them, and only in rare cases the structure of the mission allows us to exploit them freely as we want (the double jump is not common to all...). We are talking, for example, of the destruction of the fixed positions in the assault on New Baghdad, of the first phases of the conquest of the nuclear power plant or in a real night stealth mission in Thailand. As it happens, all phases in which the environment expands, giving rise to small ~sandboxes~ full of possibilities to decode and put into practice. In short, many corridors that clash with the plus of freedom given by the Exo. In this sense, even the in-game challenges, such as headshots, grenade kills and so on, which allow us to increase the suit's statistics before going on a mission, do not seem to have tangible consequences on the gameplay. In short, Sledgehammer Games has really pushed as much on multiplayer as little on the campaign, still too anchored to the abused styles of the past. A well done homework, better than Ghosts without a doubt, but not as disruptive as it should have been. In closing this long examination we talk about artificial intelligence and the level of difficulty. Our advice is to immediately set Advanced Warfare to difficult, in fact you die a few times, and those few times are often related to the best moments of the game, that is, when the spaces widen and where therefore you are not forced, sorry for the game of words, in narrow spaces characterized only by the push forward, watched closely, indeed commanded by the diligent Gideon. In short, when you are surrounded, the player is forced to give his best, taking advantage of all the paraphernalia at his disposal, including the environment. We have not identified particular deficiencies in the behavior of the opponents, outflanking and cover-in-cover movements do not seem to be missing, especially by raising the level of difficulty, but we should not expect particular tactical refinements. Big leaps Multiplayer, on the other hand, is the exact opposite of the campaign. Fast and frantic perhaps more than usual (probably for this reason you don't go to the ground with just two, three hits), but thanks to Exo's skills he is capable of overturning, or rather expanding and expanding, years of well-established mechanics. So much so that playing (if you will) in classic mode without all the ~advanced~ features simply does not work, given that the level design is tailor-made for both horizontal and vertical navigation of the map. The first impact can be really unsettling because it is hard to realize that hiding behind a structure can be useless given that the structure itself can be overcome by a double leap from the opponent, who can thus take us by surprise. In the same way, crossing the map from side to side acquires a double dimension: intricate and full of blind corners at zero altitude, but ~linear~ passing through the roofs. The developers have therefore been very good at creating roads, defiles and alternative routes even at several meters in height, effectively doubling the possibilities given to the players. Such a setting is particularly appreciable in the more open maps since the smaller ones seem to be close to the Exo, limiting the gameplay a bit; more generally, the new abilities and the level design push gun play decisively forward, making everything profoundly ~new~ even if perfectly grafted into the usual mechanics. The skill is therefore crucial, like reflexes and good aim. And it is notonly the double jump: the lightning-fast strafe on the ground or in the air, lateral or back-forward can be the perfect way to win a duel, but also carry out a sort of area attack to stun the opponents with a heavy ~crushing~ land can be a lethal tool in the hands of experienced players. Really exciting, all to the detriment of the much reviled campers, not very present in our numerous matches in the review session, and also of the Scorestreaks, numerous and also highly customizable, which in fact seem to play a not so predominant role in the economy of the matches, many and very varied are the ways to die quickly before reaching the very high scores necessary to cast them. This, in short, is the multiplayer philosophy of Advanced Warfare, renewed and expanded, but in the wake of a strong tradition. Among the thirteen maps present at the launch, undoubtedly one of the best is Instinct, set in a Mayan archaeological complex, dominated by a huge pyramid, behind which there is a mine. It is not a particularly intricate map, on the contrary it is decidedly airy and open, its strong point is that it is completely uphill, with a considerable slope underlined by the steps of the ancient building. One can therefore imagine how the double jump is enhanced in a situation like this; similarly the huge ranges of fire favor sniper and assault rifles. But it must be said that a central temple without a roof (a ~constructive~ feature present in many maps), perfectly at the top of the steep slope, becomes a perfect ~killing box~ for close-quarters battles in a mode like Hardpoint. Recovery is an open map full of buildings in which it is possible to enter, passing through the stairs but also above all by making powerful double leaps towards the windows on the upper floors. Here the various heights of the buildings and buildings allow us to move easily by jumping and thus avoiding the dangerous bottlenecks on the ground. In the same way, another urban map like Comeback, ideally less airy than the previous one, turns out to be extremely rich in possibilities thanks to the numerous ~jump~ places, which are however paired with smaller and closed areas made especially for objective modes . The smaller maps therefore ~suffer~ a little from the potential of the Exo suits. The Greek postcard village, setting of Terrace, with its narrow streets is a good example of this, the same thing is the oriental resort of Retreat, decidedly too anonymous and with few Exo ideas. Riot, on the other hand, set in a Baghdad prison, could be half a disappointment and instead surprises for how it alternates between ~close quarter combat~, open spaces and long shots. We close with Defender, probably one of the best maps of the lot. We've seen it before and told it before, but we like to point out that the huge ruined bunkers, tunnels and near-trenches at the base of the Golden Gate are the perfect Advanced Warfare playground. In short, a level design that is never trivial, which then adapts perfectly to all game modes, including obviously the new ones, such as Uplink, already included in the category of e-sports and Momentum game types. The first is damn fun and starts from the spirit of the Blitz mode (and why not of Capture the Flag) only now one of the two teams must collect a sphere and ~score~ into the opposing net (a circular portal in the air), passing the ~ ball~ to his teammates or attempting a solitary escape. Coordination, teamwork and respect for roles come first, so there's no room for lone wolves. Momentum is a kind of remake of ~War~ from World at War and sees a team engaged in the conquest of five key points positioned in a linear fashion. A sort of tug of war that rewards those who play more attack making it faster to win the next points. This is also a nice addition, decidedly well thought out from the point of view of team play. So much to choose from In terms of customization, the choices of Sledgehammer Games are by no means trivial. It starts from the bases of Treyarch colleagues, or the Pick 10, to enlarge it in Pick 13, all grafted onto a classic path of unlocks as you level up and completing numerous challenges of using weapon after weapon. Each piece of your equipment has a ~weight,~ displayed visually in base thirteen. Once the ceiling has been passed, we can only eliminate something, replace it with something else and so on. It goes without saying that the system worked in 2012 and still works allowing you to create your own alter ego as we want, favoring weapons or perks, thus working to the max thanks to the wild cards that allow us to field special configurations no", "date": "2014-11-03", "grade": "8.5"}