{"name": "Carte a canestro", "ref": "https://multiplayer.it/recensioni/139749-rival-stars-basketball-carte-a-canestro.html", "text": "Almost a year after the release of Flick Kick Football Legends, the PikPok developers have decided to create a variation on the theme set in the world of basketball. The same freemium model with the now inevitable ~action points~ to limit the duration of the matches, therefore, and the same casual approach in which you have to act on the touch screen through a series of gestures to intercept the ball and score fine passes. The difference lies in the sport that is represented on the screen, using in this case well-made, fluid and convincing cel-shaded graphics, instead of the not always very pleasant visual solutions that characterize the episodes of Flick Kick. So let's try to understand what this Rival Stars Basketball offers. The basic structure is that of strategic cards with collectible cards, to be drawn and purchased using virtual tokens or real money, in order to compose a team of excellence, which is able to compete against any opponent. Each athlete is distinguished by the role and the values of attack and defense, values that can be enhanced through the traditional expedient of ~fusion~ of unused cards, an operation that is necessary to be able to aspire to victory already after a few matches. Winning a tackle, however virtual, is in fact a mere matter of numbers: within the four quarters of a game you are called to carry out offensive or defensive actions, pitting a card against the one drawn by your opponent and scoring points in the moment in which our attack or defense values should be higher. In addition to this simple opposition there is then the real action phase, in which we return to the ~flick~ philosophy of stealing the ball using the right timing, making passes and shooting for two or three points. Rival Stars Basketball is a nice variation on the ~flick~ theme, but with too many limitations I'll make you the deck The single player campaign of Rival Stars Basketball, which currently has eleven short tournaments (but will be enriched with the next updates) and which is supported by an ~asynchronous~ online championship, offers matches of increasing difficulty in which, as mentioned, almost exclusively the numbers shown on the cards in our possession count. In short, it is a rather simple system to which a minimum of thickness is added thanks to the aforementioned ~fusions~ and first-person actions, even if the latter soon become quite repetitive. It must be admitted that substantial progress has been made both in terms of visual impact, as already mentioned, and in terms of precision: the trajectory we draw on the screen is respected and in the same way the speed of the movement is perceived, to say that a shot can also be directed well to the basket but if it misses the cue it will not reach the target and will transform a potentially positive maneuver into a setback. The matches therefore become rather hard-fought, especially when the values on the pitch are similar, but a properly strategic vein is missing to make the difference and increase the variety of a formula that still works well today, of course, but is starting to feel the weight of time and the lack of viable outlets. Furthermore, the restrictions of the freemium model are not the least bit helpful in smoothing out these rough edges: the action points required to participate in each match are a bit excessive (generally you can play four games in a row, so you have to wait a few minutes for restoring energy), but above all it becomes almost impossible to buy rare trading cards if not using real money. Isn't that overdone?", "date": "2014-10-30", "grade": "6.8"}