{"name": "Sonic Rush", "ref": "https://multiplayer.it/recensioni/sonic-rush.html", "text": "Let's face it: the Sonic Team is certainly not going through its best period. The leap into 3D has in fact put one of the most creative groups of programmers of the 8 and 16 bit era into crisis, so much so that its main franchise, Sonic Adventures with related spin-offs, has never managed to establish itself with products that are truly destined to remain in the hearts of gamers. Shadow the Hedgehog is unfortunately the latest testimony of this trend. If the merits of great titles such as Nights, Samba de Amigo and Phantasy Star Online are there for all to see, so are missteps such as Billy Hatcher, Astro Boy (Ps2) and the overrated Feel The Magic XY/XX, as well as the questionable collections of old glories or the use of the figure of the blue hedgehog in a whole series of unforgettable productions. Never give up Thanks to the inclusion of a new move, namely the Rush of the title, Sonic can gain a further increase in speed, which also coincides with a frontal attack capable of eliminating enemies and obstacles that stand in front of the blue hero. However, the rush must be carefully dosed, since it draws on a bar which, obviously, empties. To fill it, it is necessary to perform tricks, or evolutions during jumps, which can be performed by pressing a button. In practice, things change little, but it remains a rather successful and appreciable addition. The boss fights, huge machines produced by Eggman's evil mind, largely maintain the classic approach of the series, varying on some occasions with different perspectives from the normal side shot. This is thanks to the use of the polygon for the creation of Sonic himself and the bosses, with interesting benefits in terms of technique and spectacularity. The technical aspect of Sonic Rush is certainly excellent, confirming the great fluency with which the DS manages 2d; the stages and characters are rich in detail, colorful, and the action always takes place at a constant frame rate that suffers practically no drops worthy of mention at any time. The settings are instead, unfortunately, always the same; we understand that you want to keep the style of the series, but we find it really excessive that every single 2d Sonic game has to have the forest level, the submarine level and the one aboard a flying ship. The level design is variable, going from very good to just sufficient on some occasions in which promptness of reflexes and speed of action are not sufficient, on the contrary requiring a mnemonic knowledge of the steps to be performed which does not coincide with our idea of fun. Rather, out of frustration. Lastly, a two-player mode should be mentioned which allows you to challenge a human companion in a race of speed on who reaches the end of the level first. Pleasant, but nothing more. Comment Sonic Rush is an excellent exponent of the two-dimensional trend of the series created by Yuji Naka. Having said that, it should also be emphasized that it does not deviate almost from the classic themes that have distinguished its predecessors, introducing minimal or marginal innovations in an absolutely run-in gameplay. This means that those who are still hungry and want a very traditional but well done game with the blue hedgehog will be able to spend the money needed to bring Sonic Rush home with great joy. Those who have never loved its gameplay, or those who are bored with the indisputable repetitiveness of the now innumerable exponents of the series, will certainly not change their mind with this episode for DS. Pros An excellent 2d Sonic chapter Very good graphics Intriguing boss fights Cons Very faithful, too much to the series Sometimes frustrating Useless second character Run Sonic, run Where Sonic gives his best, we all know by now, is in his habitat of origin, or the platform in two dimensions. And this is, fortunately, the formula that the team led by Yuji Naka has decided to adopt on the occasion of the debut of its mascot on the new two-screen laptop from Nintendo. Sonic Rush, this is the name of the game in question, was actually programmed by the Dimps, already authors of the valuable Sonic Advance series on GBA. The underlying story is, as always, a mere and banal motivation to link the various levels together; again there are the chaos emeralds and dr. Eggman, so to speak. The main novelty in this sense must be found in the second playable character, Blaze the Cat, with which it is possible to face the levels as an alternative to Sonic; in reality the differences in pure gameplay are almost imperceptible, so as to overshadow the idea of repeating the game with the new co-protagonist. The structure of the game does not differ at all fromoriginal formula, thus putting speed and spectacularity in first place based on loops, loops, jumpers to jump high and so on; crossing the entire levels without interruption therefore becomes a challenge, based mainly on reflexes and the speed of executing commands. Yes, because this has always been the distinctive element of platformers starring the blue hedgehog, or rather offering a different approach to the genre. Slowly advancing, eliminating all enemies and exploring the various environments is simply not fun. Or rather, it's not playing Sonic the way it was intended. Going full throttle with the pad pressed all the time to the right, that's playing Sonic. This means accepting the simplistic  but not simple  nature of Naka's gameplay. The potential of the Nintendo console has been exploited in a rather marginal way; almost completely ignored the touch screen, with the exception of the not very incisive control in the bonus stages inside the pipes, the two screens were on the contrary used to vertically increase the viewable game area. This is resolved on numerous occasions in the passage of the protagonist from one screen to another: perhaps one can start a descent from the upper one, to conclude it in the lower one obviously without a break. An absolutely irrelevant gimmick in terms of playability, but nice to look at.", "date": "2005-12-21", "grade": null}