{"name": "Restauro digitale", "ref": "https://multiplayer.it/recensioni/138987-gabriel-knight-sins-of-the-fathers-20th-anniversary-edition-restauro-digitale.html", "text": "Gabriel Knight: Sins of the Fathers 20th Anniversary Edition has arrived on Steam, and it's as if time has never passed. On the other hand this is a real restoration work dedicated to all the players who have lost the original, and since the original was a classic, its value has remained intact. However, it is known that the gamer has a visual tolerance that decreases as the pixels increase. Today his greedy eye loves high definition, but can't stand the screens full of big pixels that were all the rage in the 90s. So Gabriel Knight creator Jane Jensen has joined the forces of her studio with those of Phoenix Online Studios, and with great dedication has raised her best work to exacting contemporary standards. The result is that now anyone can play the first Gabriel Knight effortlessly, contributing with his purchase to the creation of a new chapter in the series, already ready for years in Jensen's drawer. It would be nice to see the shadow hunter grappling with a new case. Let's think about the present anyway and try to understand what has changed in this version. First, the graphics are high resolution. The developers have exploited the power of the new graphics cards to enrich the environments with objects or architectural details that allow us to discover something more about the atmosphere that reigned in New Orleans at the time the game was created. In addition to being faithful to the original ones, the new screens are very beautiful, sometimes glorious in their evocative force, especially the iconic rare book shop that Gabriel Knight owns. Compared to the original game, the characters then gained the third dimension, fortunately maintaining an acceptable fluidity in their movements. Above all, the quality of the faces stands out when they are framed closely during the dialogues. Both Gabriel's face and that of the supporting actors are pleasant to see and believable in the various emotional expressions. The voice of Gabriel has changed, but the new actor, as well as those who voice the other characters, have all done a great job and fans of the series will not regret too much the beloved Tim Curry. Gabriel Knight therefore presents himself in line with the expectations of today's players without losing the touch he once had, and we wish him to continue to do the same figure in another twenty years. We just have to look under the dress and see if something else has changed (and we're not referring to Gabriel's lovemaking skills). Gabriel Knight dusts himself off and all graphic adventures are at his feet again When women were all Gabriel's The puzzles have remained the same, as have the story and dialogues. Little extra steps have been added, and a couple of events, like visiting Gabriel's grandmother's house, have been moved forward in time. But the substance does not change. Gabriel Knight is as exciting today as it was twenty years ago and we are convinced that new players, thanks to the renewed graphics, can realize how even today it makes a clean sweep of almost all graphic adventures on the market, which hide from the classics of the past behind more or less successful polygons. Jane Jensen has written a long and well-crafted story full of details about voodoo and the city of New Orleans. This attention to detail places the player in a plausible context, but it is above all Gabriel's freedom of movement that gives the impression of being inside a breathing world. Graphic adventures usually have too few screens and often look like theatrical comedies with actors performing from time to time in front of different backgrounds. In this case, however, the amount of places to visit is considerable and there is always something new to discover, thanks to the amount of possible dialogues on even everyday topics. Now the relevant topics to advance in the story are highlighted in yellow, and this is certainly a facilitation, but at the same time it offers the possibility of interpreting the character Gabriel. Since over the course of the days we will speak several times with the same people, keeping aside a few lines of conversation allows us to exit an unsuccessful search with the feeling of having brought something home anyway: news, a joke, an anecdote of an old friend's past life. Another notable aspect of the game, very rare in adventures, is the evolution of the main character, from an egocentric on the run from responsibilities to a shadow hunter ready to embrace his destiny, with one last, difficult decision to make. Perhaps new players could find some passages from the Thurco a little complex, but thanks to the new interface, the help system and the diary notes, progressing in the investigation should be a task for everyone. However, there is one last reason to choose to buy this edition of the game, and that is its historical value. In fact, on any screen you can access extra content relating to the screen itself. These extras contain sketches, commentary and interviews with the creators of the game, telling how they modified that part of the game or what inspired them. It is therefore a precious documentation, very difficult to find in relation to the birth of a video game. So it doesn't matter if you played it when you were very young or if it's the first time you hear about it: Gabriel Knight is still a game for everyone.", "date": "2014-10-16", "grade": "9.0"}