{"name": "Harry Potter e il Calice di Fuoco", "ref": "https://multiplayer.it/recensioni/harry-potter-e-il-calice-di-fuoco_a.html", "text": "The Goblet of Fire For those who have never read this volume of the seven that make up the Harry Potter saga (the sixth will be released in Italian in January, the seventh Mrs. Rowling has yet to finish writing), here is a brief summary. This year, before going to Hogwarts School of Witchcraft and Wizardry, Harry is invited by his friend Ron Weasley's family to attend the Quidditch World Championship. However, a dramatic event upsets the festive air of the event, when the Death Eaters, servants of the late and evil Lord Voldemort, begin to wreak havoc among the spectators. It is only the prelude to what will happen later: Hogwarts in fact for this year will host the students of two other schools, Beauxbatons and Durmstrangd, who will compete in the age-old Triwizard Tournament. Only three students, one per school, chosen by the Goblet of Fire, can face the trials of the tournament, and when the Goblet inexplicably rejects even the name of Harry Potter, it is clear that something strange and dark is afoot. Reluctantly forced to compete in the Tournament, Harry will have to face not only the three tests, but also an even more terrifying threat: what if the Tournament itself was a trap to kill him? The New Harry Potter As mentioned, this fourth videogame (actually fifth, considering also the bizarre sporting title Qudditch World Cup) with Harry Potter as the protagonist differs from the previous ones precisely because... Harry is not the only protagonist: in fact, the player will be able to choose whether to also control Ron or Hermione. The group moves together in the vast levels that make up the adventure, and the player only controls the character he has previously selected, while the other two are handled by a not always particularly sharp CPU. We're talking about levels, because that's the biggest difference from titles like The Chamber of Secrets or The Prisoner of Azkaban: while the prequels had a free structure, which allowed you to explore Hogwarts far and wide while completing the various objectives, in The Goblet of Fire lacks this freedom, in favor of a rigid and linear progression by stage. If on the one hand the lack of immersion granted in the three prequels is definitely felt, on the other hand there is certainly no lack of constant framerate drops which, for example, affected The Prisoner of Azkaban due to the massive amount of graphic data managed. just as you no longer have that sense of dispersion that afflicted The Chamber of Secrets, when you walked around Hogwarts admiring the landscape but at the same time finding very little to do. Harry Potter and the Goblet of Fire is therefore a pure action-game, where very few simple puzzles get in the way of the player: the game is in fact focused on the fight against the various creatures that oppose each other between Harry and his friends and their goal, against which a large repertoire of spells will be available. It is interesting that while in the prequels the right spell had to be selected at the right time to face certain opponents or solve particular puzzles, now the management of spells is context-sensitive: by pressing a key we will cast a spell, the CPU will choose the right one to us, according to the moment and the situation. This choice definitely speeds up the game, but on the other hand it makes the adventure less engaging and ultimately tremendously easy: there's practically no need to use your brain, the game does everything by itself. A bizarre choice, considering that from this point of view it clearly seems a title intended for young people, just as the story of Harry Potter and his friends enters an adult, dark and bloody phase. It's Magic EA's choice to make The Goblet of Fire a linear action-game, divided into levels, setting aside the free exploration of the three prequels, as mentioned, has partially relieved the load on the graphics engine, which now moves without hesitation at a constant 30 fps. The slowdowns that ruined the gameplay in The Prisoner of Azkaban are therefore a thing of the past, and the modeling of environments and characters has also benefited: the graphic restyling, and the abandonment of the vaguely cartoonish in favor of greater realism. Harry, Ron and Hermione look just like Daniel Ratcliffe, Rupert Grint and Emma Watson, who play the three young wizards in the cinema: their models enjoy a high number of polygons and natural and fluid animations, as well as in the case of the various enemies that will have to be addressed. Despite the mediocre textures, the various locations enjoy a good visual and chromatic variety, and are extremely accurate and full of details; nevertheless, what jumped the mostto the eye is the realization of the spells themselves, which squeezes the capabilities of the PS2 to make them visually imposing, spectacular and gaudy, thanks to the clever use of luminous and particle effects. The soundtrack is good, which mostly takes up the themes of the film, and the dubbing is mediocre - as always, unfortunately. The idea of changing the mechanics of the series of games inspired by the Harry Potter novels/films is not completely condemnable, given that already in previous years we have tried nothing but clones of the same title: it changed the hardware, but not sure the game. However, the decision taken by EA does not seem to have achieved the targeted objectives: The Goblet of Fire is an extremely linear game, simplified to the maximum, directed mostly to a very young audience which is certainly not the one to which the novel / film itself is addressed. With a first-rate technical sector, especially in the visual rendering of the spells, it will certainly be a nice Christmas present for the little ones, or for the hardcore fans of Rowling's novels. Pros Faster and more immediate game system Graphically very good It's Harry Potter Cons Too linear Too easy Too short Cross-platform There are no particular differences between the various versions of the title, apart from a slightly better frame-rate in the X-Box version and sharper graphics on both the Microsoft and Nintendo consoles. PlayStation 2 and GameCube also do not support Progressive Scan. While the new film based on the fourth novel by J.K. Rowling starring the most famous wizard in the world, our consoles find themselves hosting yet another tie-in. It must be said that video games on the Harry Potter literary and film series have never been poor, perhaps mediocre, but never poor: Harry Potter and the Chamber of Secrets, for example, remains a real gem. However, this year EA Games has decided to change the cards a bit, even in a somewhat inexplicable way: Harry Potter and the Goblet of Fire, in fact, has lost the adventure imprint of ~Zeldian~ memory, in favor of a much more action-oriented style. Probably due to the change of tone of the story itself, which from innocently fairy-tale becomes, with this fourth episode, much more raw and violent, this corresponding transformation of the play system has considerable pros and cons. Let's find out which ones.", "date": "2005-12-20", "grade": null}