{"name": "Come balla lo smartphone!", "ref": "https://multiplayer.it/recensioni/138882-just-dance-now-come-balla-lo-smartphone.html", "text": "Just Dance is part of the very small group of titles that have managed to survive the bubble of casual gaming on consoles, the latter phenomenon which, once exhausted, has instead left the corpses of many games, development studios and even peripherals on the field. For Ubisoft's ~dancing~ series, however, the future seemed far from certain: either due to the modest penetration of the PlayStation Camera, or due to the downsizing of Kinect, or again due to the not excellent sales volumes of Wii U (Wii was in fact the leading platform for the franchise), the tangible risk was that Just Dance was destined to shut down slowly but inexorably due to ~force majeure~. Aware of this, the French designers then reflected on where that aforementioned casual audience had gone, and on what was the most appropriate path to follow to keep such an important brand alive and well in terms of revenues. The answer? You have it in your pocket... Just Dance Now is an amazing first step in bringing Ubisoft's series to smartphones Just Dance Now is the name behind which lies a new version of Just Dance specially designed for Apple and Android smartphones. Attention: we are not talking about a companion app or something similar, but the real experience that has made millions of people dance all over the world. The idea is simple but ingenious: every smartphone has an accelerometer inside, just like the WiiMote. Did you do 2 + 2? The solution of the French publisher is therefore precisely to transform your portable device into a controller, capable of detecting movements in exactly the same way as the Nintendo remote control, thus making the gaming experience completely comparable to the original. Mission successful then? Well, one would say yes, even if it is evident how the gameplay of Just Dance lends itself rather easily to the purpose: the absence of a real game over, the mild level of challenge and the spirit decidedly more ~party~ than rigorous of the experience offered by Ubisoft make the experience very accessible by anyone without too many problems. We therefore confirm that Just Dance is perhaps currently the true and only casual party game, in the best and most positive sense of the term. It is true that dancing at breakneck speed to the pressing rhythms of the Just Dance play list with your smartphone in hand is not exactly the best of security: Nintendo itself was forced to implement and constantly suggest the use of the wrist strap to avoid disasters and injuries households due to WiiMotes taking flight, and it's not too hard to believe that there could be a similar risk here too. This time, however, it will be the exclusive interest of the owner of the precious device to keep the grip tight and firm. Closed the parenthesis on the controller, however, the question of where to display the image of the choreographies to follow and imitate obviously opens up: also in this case Ubisoft has found an intelligent and decidedly accessible solution by anyone in just a few steps. In practice, it is sufficient to visit a special site (justdancenow.com) with any object equipped with a decent internet browser (desktop, laptop, tablet, smart TV and so on) and enter the same code on the mobile phone to thus enter the ~room~ dedicated. That's all, just a few seconds, after which you can select your favorite song from the screen of your smartphone and then go wild on the dance floor. Through the video camera you can also record videos of your performances, to bring the sense of shame to a level rarely touched before. Just Dance Now also succeeds in overcoming some of the limits imposed by the console versions, such as the number of players that can be involved: in this case, in fact, there is no real limit imposed. As if that weren't enough, the cross platform nature of the structure designed by Ubisoft allows iOS and Android users to play together without any problems. Certainly it should be clarified how, compared to the last episodes for consoles, the level of Just Dance Now's offer is not comparable at the moment: the options available are very few and for example a multiplayer mode is completely missing, and even the social functions appear reduced to the bone. As for the price, the French house has chosen to adopt a free formula with rather intelligent in-app purchases: in practice, without any expense, you can access 5 songs (from the total list of 56) which are rotated daily. However, those wishing to extend their gaming sessions will be able to access the entire catalog via VIP Pass by spending a variable amount based on the desired time.derate: you can go from 99 cents for an hour up to 49.99 euros for an entire year (a pity there is no purchase with unlimited access) passing through 24-hour, one-week, one-month or three-month passes.", "date": "2014-10-11", "grade": "8.5"}