{"name": "Hackattatevillo!", "ref": "https://multiplayer.it/recensioni/138493-hack-n-slash-hackattatevillo.html", "text": "There are ideas that can only come to independent developers, both because they are free from the figures of an increasingly oppressive market, and because they are able with their imagination to carry forward designs that may seem bizarre at first glance. A project like Hack 'n' Slash, for example, could only come out of an initiative like Amnesia Fortnight, during which the Double Fine Productions team puts a series of prototypes made from their own elements to the vote every year, to then elect together with the online fan base what will be taken over by the studio to become a real game. With a mind like that of Tim Schafer to pull the strings, over the last few years we have seen all the colors coming from the creator of Grim Fandango and his boys, with proposals regarding titles of various genres and settings. Among the craziest ideas we certainly also find the one behind Hack 'n' Slash, as crazy as it is brilliant: the game was conceived in 2012 by its creator, Brandon Dillon, to teach the basics of programming to gamers and all those who they ask what could be behind it that gives them hours and hours of fun, turning everyone into budding hackers. Previously available in Early Access on Steam, Hack 'n' Slash has finally blossomed in recent weeks, thanks to the publication of the final version: with our USB sword in hand, we went back to work to draw the final conclusions. Are variables and functions your daily bread? Don't miss the appointment with Hack 'n' Slash! A hack to save the world The protagonist of the game is an elf called Alice, accompanied by a nice flying creature named Bob: two names that are not at all random, given that they are the placeholders normally used to create examples such as ~A sends a message to B~ , present in many technical documentation to facilitate reading. Curiosity aside, Alice is initially shown inside a cave, where she manages to find a mysterious weapon: it is in fact a sword which, once broken, has a real USB plug at its end, which makes it able to physically connect to most of the objects present in the scenario. The elements with which it is possible to interact are in turn distinguished by the presence of a USB socket, on which it is necessary to make our ~slash~ to open the dedicated hacking menu: the title is nothing more than a play on words, so be careful not to be misled into thinking you'll find action in droves. Hack 'n' Slash is on balance a puzzle game, where you find out how to move forward in the ways we are about to see: the first example is immediately offered to us by a closed door, for which it is possible to change from ~false~ to ~true ~ the value of the ~open~ parameter, to see it magically open. There is very little magic, at least in this case, since what we did was directly modify the parameters that are managed by the source code of the engine that moves the entire game. In the absence of a real tutorial, Hack 'n' Slash initially presents us with some simple-to-solve puzzles, with a fairly limited number of options to be able to modify: going on with the adventure, however, we find ourselves changing almost entire portions of code, with the need therefore to be at least aware of what one is doing. For example, the USB sword can also be connected to enemies, to modify everything that distinguishes their behavior, thus offering the player space for a series of different solutions: we prefer to make an enemy harmless, lowering his level of perception to zero in our do you compare? Or vice versa, do we want him to become a sort of protector of ours, making him even stronger but simultaneously siding him with the good guys? Be careful not to make mistakes, however, because you could instead forget to set a flag correctly and see a super powerful turtle coming at you at full speed. In a scenario like this, in which everything becomes possible, Double Fine has fortunately also provided a way to go back: in fact, it can happen to find yourself blocked by your own actions, trapped by something without being able to move forward, or worse, making the game practically unplayable , because a bug just happened. Contrary to what happens elsewhere, all this is obviously not to be considered a defect of Hack 'n' Slash which is instead a somewhat awkward inventory management, sometimes dispersive maps and not exactly very precise controls. Workshopwe do everything A title like Hack 'n' Slash could only support de modsgamers, thanks to Steam Workshop. On the Valve platform there are already some creations of the online community, for the moment mainly concerning the translation of the texts, originally available in English. The good news is that by digging into the section of the workshop dedicated to this title, it is also possible to find the Italian translation, to be applied to the game to obtain dialogues and descriptions in our mother tongue. However, Steam Workshop support allows Hack 'n' Slash to potentially enjoy additional elements of modification to the gameplay, thanks to the mods that the online community will want to create. Alice or Link? All Alice's effort to change those around her with the USB sword is aimed at fighting the evil wizard who dominates the world of Hack 'n' Slash. In fact, the elf will find herself freeing imprisoned characters with magic, or remedying damage done by the enemy within the scenario: to do this, in addition to her main weapon, she will be able to count on a series of artifacts such as the one already mentioned above for go back in time. The most characteristic is certainly the Hat, thanks to which Alice obtains a Third Eye, through which to see elements that would otherwise be invisible to normal vision. Although she is not offered the possibility to modify the code at this stage, it is a real debugging tool, which legend has it also used Double Fine during the development of the game: in addition to allowing the player to see any platforms hidden, the special hat also gives him the opportunity to see the source code behind some elements, thus being able to better plan the next moves. Returning to the plot, we are not dealing with something articulated at all, but fortunately the sympathy that Tim Schafer and his followers put into everything they do manages to mitigate the problem of excessive linearity. From a graphic point of view, the sense of dj vu is strong: the fairy-tale world of Hack 'n' Slash closely reminds us of some titles from the past, presenting itself with a very evident link with the old Zelda games for the NES, given that the protagonist Alice is practically identical to Links. The soundtrack is also good, offering us catchy background tunes as we carry out our amazing hacking operations.", "date": "2014-10-09", "grade": "9.0"}