{"name": "L'inverno sta arrivando anche su iOS", "ref": "https://multiplayer.it/recensioni/138671-the-banner-saga-linverno-sta-arrivando-anche-su-ios.html", "text": "The Banner Saga was in many ways one of the most interesting games of this 2014: the Stoic Studio title arrived at the beginning of the year on PC, making itself known above all for its ability to involve in its atmospheres also through a great touch artistic, both in terms of graphics and sound. Since the beginning of the development phase, following a great success on Kickstarter, the developers had also promised a mobile version of the game, which just recently arrived on the iOS ecosystem: The Banner Saga has in fact been available for a few days on the App Store. for iPhone, iPad and iPod touch. We therefore more than willingly took advantage of this second youth of the game, to get our hands on the version for the Apple tablet and thus return to the world populated by Men, Varl and Dredge, fighting for their own salvation. An experience that at the time of reviewing the PC version left us more than satisfied, but now all to be verified on a portable system: obviously, we're here to tell you how it went, so no more talking. The Banner Saga on iOS offers the same immersive experience as the PC version: full marks! What time is the end of the world? The story told in The Banner Saga is deeply inspired by Norse mythology and the collective imagination linked to the Vikings, to whom the appearance of the Varl clearly refers, large beings with human features equipped with long horns and an average life span which goes far beyond that of men. The latter are their allies, even if sometimes badly digested, in an atmosphere of apparent calm that is soon disturbed by the return of the Dredge: the beings similar to robots, defeated in the past by the other two races, in fact return to be seen by their exile in the deep north, with a momentum that seems to leave little chance for Men and Varl. Meanwhile, the whole world seems to be heading towards its end, following the disappearance of the sun and the emergence of some omens. Our introduction to the plot stops here, because it is an integral part of The Banner Saga experience, where the player finds himself having to deal with multiple variables: our choices - even the smallest ones - can in fact influence the evolution of history, obtaining unimaginable repercussions. A role-playing component that is also the main one of its type, given that, as verified in the past, the customization elements of the characters can be counted on the fingers of one hand. The other ~heavy~ gameplay component of The Banner Saga is instead the turn-based combat, based on a double system of armor and hit points to which some special abilities, specific to the individual characters and the ~classes~ to which they belong, can be added . For all the details on these issues, we refer you to the review of the PC version, focusing instead now on the gaming experience on the iPad. Finger or mouse? The game dynamics of The Banner Saga lend themselves quite well to a conversion for tablets: the interlude phases, in which there are in fact only dialogues and a few other options, impose practically no difference on the player compared to the PC version, allowing him to easily choose with your finger which of the roads at your disposal you want to travel. A slightly different discourse should instead be made for the fights, where between the various selection phases concerning the characters, their skills and the targets it would be necessary to have the utmost precision: seen at a high level, the work carried out by Stoic Studio on the game code to support the touch interface proves to be quite valid, even if it can happen that you accidentally select one unit rather than another, or see it blocked on your selection, requiring a few additional taps on the chessboard that makes up the battle area, to be freed . Otherwise, everything we saw on PC was reproduced perfectly on the iPad, where The Banner Saga presents an interface that is in fact completely identical to its home edition. The size of the screen that iPad is equipped with contributes significantly to the possibility of enjoying the game, which is why it is really difficult to imagine playing satisfactorily on the iPod touch or iPhone, even if the screens of the latest models of the latter they could help in doing so. Since it doesn't need who knows what hardware to run properly, the hand-drawn graphics and animations (all in 2D) can also be perfectly represented on the tablet, even if the third generation model we used for the test on certain occasions has struggled a bit in terms of frame rate: nothing major by the way,indeed we imagine that on the most recent iPad versions the problem is attenuated or absent. Also on this platform, The Banner Saga allows you to fully enjoy the splendid drawings made by the illustrators of Stoic Studio, enriched by parallax effects and zoom functionality implemented thanks to the classic gesture on iOS, essential above all for fights. The excellent soundtrack composed by Austin Wintory, very probably the most talented artist in terms of videogame music, is also very appreciable with the use of headphones: in fact, he is also responsible for the songs of Journey and flow, just to name a couple.", "date": "2014-10-08", "grade": "8.8"}