{"name": "Il mio Club  meglio del tuo", "ref": "https://multiplayer.it/recensioni/138631-driveclub-il-mio-club-e-meglio-del-tuo.html", "text": "We have to be honest, when we tried DRIVECLUB during E3 2013, in anticipation of the release together with PlayStation 4, we were quite worried about the quality of the product, first of all in technical terms, but also in actual gameplay. Wisely the Japanese manufacturer has decided in concert with Evolution Studios to postpone the release, and even if we would have preferred a few weeks of further development, due to some shortcomings and inconsistencies, DRIVECLUB is now another game, distant relative of the initial one. We have stripped the title for several hours, completed the career and played an indefinite series of challenges, multiplayer games and more together with our Club, so we are ready to express our opinion. First things first, DRIVECLUB is a racing game with mainly arcade features, which puts you in control of some dream cars to compete in five different settings (Chile, Canada, India, Scotland, Norway) for a total of 55 tracks between variations and mirror versions of the main ones. Some offer a certain number of laps to complete, others a single path to complete with the percentage expressed at the top right; the types of races range from the classic challenge against eleven other opponents, to drift tests up to the solo race to get the best lap time. But this is only the beginning: within the main single-player mode, called Tour, each competition offers two or three stars to obtain, up to a maximum of nine for those that sanction the transition from one level of difficulty and category to another. These stars are linked to a series of conditions, and it is almost never required simply to win, on the contrary, it is enough to reach the podium and reach, for example, a certain maximum speed, a lower lap time than the one proposed, an average speed higher than the one indicated , drifting in a particular curve, and more. To continue in your career you need to obtain a minimum number of stars and for the last competition you need 165 out of a total of 225, a nice nest egg that does not allow you to snub the internal objectives of each competition. After a long wait we played DRIVECLUB for dozens of hours, here is our verdict Life is a constant challenge Even if the tour can be easily tackled offline, the Evolution Studios title strongly asks the player to be connected to the Internet, in order to access a whole world made up of rankings for each individual aspect, but above all of constant challenges while competing against other players, whether on your friends list or not. We told you about the ones that allow you to get stars, right? If connected, the game actually offers many more during the game, of the same type but with some additions and indicating the score of the person to beat. It is therefore easy to understand that in DRIVECLUB there are many excuses to play and replay single events, also because any activity completed allows you to obtain fame points, necessary to level up and get cars that can help a lot in more advanced races. To seal these numerous possibilities, the game stores all the history of what has been done, and through a convenient option it is possible to send challenges to other players for the best time or for the greatest drift. This part has a dedicated menu that indicates those in progress, sent and received; when they expire, you get fame points based on your placement. Dulcis in fundo: the Clubs, made up of a maximum of six people; this number had initially left us perplexed but in reality it works well: your team has a precise identity, has its own level to whose fame everyone contributes while you also play alone, has dedicated rankings and allows you to access additional machines, like the Pagani Zonda R which allowed us to win the last race of the Tour. Each Club has a crest to be created thanks to a myriad of combinations and textures that are unlocked as you progress, and provides a rather deep livery customization between primary and secondary colors, gradations, stickers, textures and more divided by categories. Just the import of external files is missing, but it could arrive with a future update. The Club basically represents the extension of everything present in single, including the additional internal objectives that reward the use of a producer and more, with the possibility, as mentioned, of being able to contribute not only in multiplayer, but also asynchronously. A myriad of things to do outside the race, therefore, gathered in a dynamic menu perfect for usability, with the PlayStation 4 s Touchpadalways used to return to the main menu and a series of boxes that allow access to all the aforementioned options, including an impressive amount of statistics ranging from performances to cars, passing through the challenges and the most used tracks. Finally, with the triangle key, you access your notifications and game session, in case members of your club are connected at the same time. Currently the multiplayer is quite basic, there are a number of playlists offered by the developers based on specific conditions, and it is not possible to create your own. Oddly enough, the voice chat is only available when you register for an event and enter the appropriate room, we would have liked the possibility of being able to dialogue with club members at any time when present in our session, also because it is difficult to organize and understand who is available or not. Playstation 4 trophies DRIVECLUB offers 37 trophies, divided into two categories because the five of the Tour are indicated in a separate section, as if it were a DLC. The latter are obtained by winning all the competitions that sanction the passage of category, up to the last one, called Legend. The other trophies are related to maximizing praise for each category, winning online races, reaching a certain Driver and Club level, completing a minimum number of challenges. There is something for all tastes, we have exceeded 50% of the trophies available after several dozen hours of play. On the track you run fast There are 50 cars available at launch, all European, with our Pagani, Alfa Romeo 4C, Ferrari FF, 430 Scuderia, 458 Italia, 599 GTO and F12 Berlinetta, and are divided into five power classes, enhanced by the fast and indomitable Iper . Each racing car is characterized by four parameters, which concern acceleration, speed, handling and drift, which combined together give a feeling with the different driving system. If at the beginning it is rather simple to tackle the track and the curves, with powerful but still ~quiet~ compact cars (Mini, A1), when you get to the heavyweights things start to get complicated, because these four-wheeled missiles have the tendency to spin (especially those with low handling and high drift) and need better cornering and acceleration management. The DRIVECLUB driving model is in fact certainly arcade in setting, but it returns a good degree of depth and satisfaction thanks to these parameters; Among other things, the game suggests clean driving with few flaws, if you hit heavily against other cars or noticeably cut corners, there is a penalty of a few seconds during which it is not possible to increase speed. To signal the difficulty of the curves there is not the classic trajectory line which indicates, among other things, when to brake, but an interesting and elegant solution represented by trackside indicators of different colours, from green to red. With a Pagani Huayra you can rest assured that the slightest carelessness will cause you to crash even in less demanding corners. The design of the courses is more than good, with the ~track~ layouts that evoke memories typical of Ridge Racer in the search for the perfect lap, and the open ones that are more fascinating in aesthetic and structural terms, with rapid changes of direction, challenging curves and points where it is possible to whiz at crazy speeds: our desire to constantly improve the time to climb the rankings is a clear testament to a decidedly successful driving system. However, this pleasant track design creaks during races against other contenders: the width of the tracks is always quite small, especially the open ones, and overtaking can become a nightmare in close-up views. Even on the straight, where the opponents always keep the ideal line and it takes really too little to hit and lose precious speed, even spinning in the most extreme situations. Also because the artificial intelligence is decidedly aggressive, the trains of the first races leave room for a large tussle in the advanced ones, with opponents who overtake each other, end up off the tracks or roll over. Which is positive on the one hand, excessive on the other when you are in first position, where it is almost impossible to get a certain gap because the game ~cheats~ by always keeping the pursuers within easy reach of overtaking: perfect laps and track records can easily be ruined if they miss the last two corners. We reasoned on the fact that by driving cleanly, without exaggerating with braking and accepting the fact of overtaking your opponents only in ~safety~, the gameplay is satisfying and follows the igoddess desired by the developers. But all this goes down the drain in races against other human opponents, where there is total chaos, and on occasions where we have lost a race or a star for the clean lap to killer opponents or confined spaces. We were talking about driving visuals, DRIVECLUB offers a total of six in addition to the possibility of completely disabling the on-screen information. The one that gives the greatest sense of speed and identification is obviously the view on the asphalt - our choice for most of the time - while the one outside and inside the passenger compartment allows you to appreciate the excellent work done by Evolution Studios in the creation of the cars. The technical sector of DRIVECLUB is in fact largely exceptional, thanks above all to a surprising lighting system, which in some situations returns an image similar to photorealism. The cars are exactly the opposite of plasticky, a riot of polygons kissed by dust while racing and by aesthetic damage following contacts (but not mechanical, as to be expected given the nature of the game). In the internal view, the sun's rays reflect on the glass and together with the shadows are calculated in real time; the dashboard has excellent detail, the presence of races at dawn, noon, dusk and night, together with the dynamic day-night cycle, allow you to appreciate some truly impressive views, with the rendering of the image different depending on the conditions light. Before starting each race there is an overview of the track, and especially the mountainous and snowy ones have an excellent visual distance, many elements in the background and in general an impact of the highest order. There is no shortage of particle effects and little gems such as butterflies during the day, fireworks at night but also rainbows, leaves that rise when opponents pass, dust on the asphalt and everything that makes the race more ~alive~ from the point of view aesthetic. It must be said, however, that not all routes enjoy the same quality level, especially those on the track, within which the outline is more meager and some infamous structures robbed of the polygons can be seen. A lot of graphic beauty is paid for with thirty frames per second, which honestly weigh little as we are faced with an arcade game and with excellent response to the commands, and with a graphic cleanliness that is not always commendable, especially in the asphalt view when a little aliasing and the fiery lighting effects make it difficult to read the next corner in some races, requiring you to memorize the track and not just for the sake of improving your time. A pity because the one on the asphalt is the best view for having fun, but also the most difficult to manage compared to, for example, the one outside, in which the camera is positioned higher, the image is cleaner and the sense of reduced speed allows to think more easily. In this context, the absence of the weather conditions at the launch - which from what we have seen during the fairs are incredible and will give rise to new single races - as well as the complete absence of replays, which do not allow you to review your performance and admire the landscape in which the cars compete. On the other hand, there is no criticality for the audio part, often snubbed in the driving titles: in DRIVECLUB the roars of the engines are exceptional and enhanced by a good stereo system, the sound changes based on the view and perspective, and is really diversified from car to car . Obviously we cannot be sure of their 100% accuracy, having not seen almost all of the racing cars present even with binoculars, but the result has left us quite satisfied. The music does its honest job in the menus and we deactivated it immediately in the race as per the good and right thing, final note dedicated to the pre-race loads, which go from five to a maximum of fifteen seconds before starting the race, and they never bother. Wheels, Companion App and the PlayStation Plus edition DRIVECLUB officially supports only two racing wheels at launch, both PlayStation 4 and both Thrustmaster: the T80 and T300RS, with the previous generation T500 having no Share functionality; we would have expected something more or a few weeks of further development to have greater steering wheel support. The Companion App, coming out right now for iOS and Android, weighs the beauty of 450 Megabytes and allows you to consult all the statistics, launch challenges and see how the members of your club are competing in the future, but we have not been able to test it in time. On the other hand, the free edition for is commendable", "date": "2014-10-07", "grade": "8.5"}