{"name": "Nei panni dell'eroe", "ref": "https://multiplayer.it/recensioni/138546-cho-dengeki-stryker-nei-panni-delleroe.html", "text": "Cho Dengeki Stryker is a visual novel developed by OVERDRIVE, a studio that most won't say much about but to whom fans of the genre owe titles such as Kirakira, Deardrops and Edelweiss. The western version was edited by MangaGamer, a small publisher specializing in the English translation of visual novels, dating simulators and Hentai. For those four who know the original Dengeki Stryker, let's say that this version is not its official sequel, but it is precisely that title with three more narrative arcs and a general technical overhaul, net of adult content removed due to distribution problems on Steam (read the dedicated box to find out more). In total they make about fifty hours of narration, but the overall duration varies greatly depending on the speed of reading and the desire to re-read the parts already read when starting again to try an alternative ending. Let's say that the fifty hours are for those who don't want to miss even a nuance of the visual novel, while the others will take much less. The protagonist of the story is Yuuki Yamato, a boy raised on bread and superheroes, madly in love with his best friend, Haruna, who tries to defend against bullies and dangers with often catastrophic results. One day Haruna confesses to Yuuki that she is about to move and that she would like to see him one last time to say goodbye (a very common theme in Japanese culture), but the boy, his pride hurt, doesn't show up. In the grip of the deepest sadness, he meets an old man, known as the Memory Collector, who offers him a wish in exchange for a memory. Yamato asks to become Dengeki Stryker, his favorite hero, and starts fighting against the villains on a permanent basis. Some time later, an army of cyborgs from the Balbora Empire appears in the city where Haruna lives. No one is able to stop them except Dengeki Stryker. Cho Dengeki Stryker is a visual novel that also tells a little about our childhood Why ~version for all ages~? Cho Dengeki Stryker's version reviewed is the ~All ages~ version. What does it mean? The full version of Chou Dengeki Stryker includes hentai scenes that have been cut from the ~All ages~ version to allow it to be distributed on the Valve store. As you know, games with pornographic content cannot be published on Steam. If you wish, you can buy the Hentai version on the MangaGamer website, which will also give you a code to download the Steam version. Choices, designs and resolution As we said Cho Dengeki Stryker is a visual novel, moreover of a very classic nature. So don't expect big interactions, which on the contrary are limited to making some choices to direct the plot. Sometimes the decisions only serve to impress some girls, even if in reality the dating simulator mechanics are bare-bones, but in most cases they give access to some alternative dialogue that is worth reading (otherwise visual novel would you be?). However, there are more relevant choices, which give access to alternative narrative strands or unlock some of the new content. Obviously we will not delve into the plot for the obvious reason that we repeat every time we talk about visual novels: this is the core of the experience and it is not appropriate to treat it explicitly. However, it is important to underline some general aspects. Meanwhile, the drawings were made by Katakura Shinji, an artist much loved by fans for the aforementioned Edelweiss and KIRAKIRA (not for nothing two of the biggest successes of OVERDRIVE), very capable of representing moments of struggle with dynamism, as well as with taste and delicacy the more reflective and profound ones. Furthermore, as usual, the Japanese developer managed to go beyond appearances and was able to outline a really beautiful story, with original and profound twists like you don't often see. Fortunately the English translation is really good and allows you to enjoy the narration to the fullest. It's just a pity that the game resolution is really poor and goes a bit to penalize the beauty of the drawings. We are talking about just 800x600 pixels, a good resolution for the late nineties, not for today. On smaller monitors the qualitative loss of the drawings, by putting the game in full screen, is not very significant, but on the bigger ones some graininess of the image appears evident, very marked in the videos (although excellently made). Obviously those who have a monitor with a 16:9 ratio will also see two large black bands appear on the sides, which are never nice. Given that visual novels with much lower production values are presented in high resolution, it is not clear why for Cho Dengeki Stryker, a title of a very different caliber, yesmade a similar choice.", "date": "2014-10-06", "grade": "8.2"}