{"name": "Dalla parte dei cattivi", "ref": "https://multiplayer.it/recensioni/138545-anomaly-defenders-dalla-parte-dei-cattivi.html", "text": "We were among those who praised the originality of the ~tower offense~ approach of the Anomaly series, confirmed in the episode set in Korea and then in the sequel proper, in which the developers also introduced transformations for the vehicles. We therefore expected a slap-up conclusion to the saga created by 11 bit studios, even if the idea of playing the role of villains in Anomaly Defenders certainly didn't help create enthusiasm around this release; enthusiasm further diminished when we learned that we would return to a traditional tower defense setting, controlling the alien towers on their planet, attacked by humans but without a shred of plot to accompany this interesting narrative aspect. The PC version of the game, released last May, has been placed in the archives, here is the now traditional mobile reduction to confirm the strengths and weaknesses of a solid but conventional system, as mentioned, devoid of the involvement that would have been legitimate to expect from the final episode of a saga that strategy enthusiasts have undoubtedly appreciated. The mobile version of Anomaly Defenders confirms the strengths and weaknesses of the latest episode of the series Destroy all humans The twenty-four missions that make up the Anomaly Defenders single player campaign, characterized by an increasing degree of difficulty and an excellent duration, see us gradually unlocking new and more powerful towers, as well as the relative upgrades, with the aim of stopping the advance of convoys sent from Earth to destroy our launching stations, last chance for salvation for the aliens. In each stage, therefore, one or more ~entrances~ appear from which hostile units will arrive, following the shortest route to get to the launch site and destroy it. To prevent this from happening, we will have to place our towers in the appropriate areas, adjusting the speed of the action using a selector at the bottom of the screen and waiting for nature to take its course, given that the devices work automatically and the attack is carried out as soon as an opponent is within range. However, our direct intervention is not only possible, but also necessary: firstly, to collect the resources left on the ground by destroyed human vehicles; secondly to activate special maneuvers that can change the course of battle, in this case the restoration of life energy, EMP pulses, energy shields and so on. All elements that enrich the gameplay of Anomaly Defenders, giving it dynamism even in the face of somewhat imprecise and ~hard~ touch controls when there is a need to quickly select a tower or a bonus to collect. We found a good progression, a degree of challenge that is anything but trivial and the feeling that the experience has been expertly chiseled by the developers, but unfortunately those detachment elements that constituted the real strength of the series, i.e. the offensive gameplay, are missing instead of defensive and the strategic management of the routes. Without them, and without a narrative support capable of making sense of the story, the latest effort by 11 bit studios looks like a good tower defense but nothing more, made with competence from a technical point of view (which stands out particularly on mobile) but lacking the inspiration that had characterized the previous episodes.", "date": "2014-10-06", "grade": "7.5"}