{"name": "Guerrieri minimali", "ref": "https://multiplayer.it/recensioni/138443-minimum-guerrieri-minimali.html", "text": "Minimum is an online third-person shooter with MOBA elements from Human Head Studios, the developer to whom we owe Rune and Prey among others. At first glance it is clear that it is a kind of last resort for the team after the failure of Prey 2, a project that completely disappeared into thin air, and the problems with Bethesda. How do you understand this? First of all, from the choice of a minimal graphic style which, despite its undoubted pleasantness, is also synonymous with savings in terms of production costs. Not that Minimum lacks special effects related to weapons and motion capture animations, only one cannot hide that making 3D models using only cubes and parallelepipeds is a fairly cheap style. Not bad, since we had the foresight not to exploit the expedient in an approximate way, but to base a real aesthetic around it, clear right from the title of the game (as intelligent people know, limits can be transformed into merits with a minimum of skill and reflection). Having clarified that Minimum is not a title that burns graphics cards, but it is still nice to see, let's find out its fundamental characteristics. We reviewed Minimum, a third-person shooter as original as it is full of problems Clash of the titans Minimum has been on the market for more than a few months now. Initially released in Steam Early Access, it came out almost immediately despite the developers not considering it finished yet. Before reviewing it, we therefore preferred to wait some time, to check if in the meantime some problems that afflicted the first versions were resolved, especially those concerning game balances. As already mentioned, it is an online third-person shooter, whose main mode compares two teams that have to defend a titan, maneuvered by the CPU, to make it reach and destroy the enemy base, after having knocked down the opposing titan and some barriers defensive. In case you are on the side of the defeated titan, the goal becomes to knock down the enemy one as soon as possible. With the second titan on the ground, the second phase is activated, which requires you to collect the resources necessary to enhance the new beast that will replace the old one. In the meantime, it is possible to use some of the materials found while wandering around the maps and killing enemies to buy and upgrade one's armor, which can be selected from the two standard ones that are given away with the game, or from those that can be purchased with real money which we will discuss in a dedicated paragraph. The other two modes In the review we have chosen to address the topics that seemed most decisive to arrive at the final judgment. Instead, let's use this box to give some additional specifics about the other two game modes. - The team deathmatch we believe does not need too many explanations: there are two teams that collide and whoever reaches the required number of frags first wins. - The cooperative mode is instead the classic defense to the bitter end from waves of enemies of increasing power (dinosaurs, ninjas and so on). Too bad you can't fight the titans. Let's say that the death match mode is more developed from a gameplay point of view, even if it has nothing exceptional compared to the death matches of other titles, while the cooperative mode is pleasant, but still in its infancy, with few game options and no dedicated map. War balance Players fight each other using firearms (machine guns, plasma grenade launchers, shotguns, sniper rifles, and so on) and swords for melee combat. Contrary to what one might think, the most powerful weapons are not firearms, but swords. Yes, in Minimum slicing enemies is more practical and faster than shooting them, partly because once you get close to an opponent with a weapon in your hand, a couple of hits are enough to bring him down, partly because it is difficult to escape from those has reached you and is trying to cut you, and partly because the swords activate special powers that give enormous advantages such as very rapid forward darts or super jumps that allow you to quickly reach high passages, where perhaps unsuspecting opponents are found. Let's also say that swords, like firearms, are upgradeable up to five times (they are upgraded by collecting modules from the corpses of enemies and return to the base level every time you die) and that a blow from a level five sword charged at most it can almost instantly eliminate an unarmored enemy, or one with low-level armor. In short, there are many on the servers who complain about the imbalance between the weapons, which is less evident when playing in the scointro between the titans, but much more marked in the team deathmatch mode (it is also true that many use the joypad and then complain if those who use the mouse and keyboard slice them at the speed of light, while they still haven't figured out what's happening). However, it will seem strange to you, but Minimum's worst imbalances are not the weapons, also because they are accessible to everyone. The omnipotence of the credit card As we had already mentioned, Minimum offers the possibility of buying equipment using real money. Not bad, one might say, given that in any case the game comes with a rich crafting system that allows you to create your own arsenal using the collected materials received at the end of the game and those collected in the game. In reality this is not the case, because the extra armor must necessarily be purchased and some really give immense advantages. After a few hours of play we noticed the same situation repeating itself: the strongest players all have the same equipment that increases health and reduces healing times (in Minimum the energy recharges by itself after a few seconds without receiving damage) . It is a huge advantage that gives almost certain victory in a direct hand-to-hand fight, gives more time to flee and allows you to get back into action faster than your opponents. Moreover, the greater resistance decreases the risk of death, allowing you to keep level five weapons with which to mow down newly reborn players. Let's put it this way: if you want to play Minimum you can spend the money of the base price and go crazy, but if you want to excel you have to buy the armor for a fee. It is not an excessive expense, mind you, since we are talking about a few euros, but it is still right to point this out. It's also true that many players frustrated with being slaughtered by walking battleships may decide to quit the game, instead of spending extra money in hopes of catching up to the level of others. This is a theoretically tolerable situation, if you think about the low price paid to play, which becomes much more annoying if you consider that there are free-to-play titles with much more balanced in-game purchases than this. Wouldn't it be better to charge a few euros more on entry and at least guarantee the possibility of choosing free additional equipment, leaving the rest paid for?", "date": "2014-10-05", "grade": "6.0"}