{"name": "Un grande tributo", "ref": "https://multiplayer.it/recensioni/138468-alien-isolation-un-grande-tributo.html", "text": "Indisputable icon of sci-fi cinematography with a horror flavour, the saga of Alien (1979), despite the tarnishing of the latest films, still has millions of fans all over the globe today, conquered not only by the memorable script and the interpretations of the beautiful Sigourney Weaver, but above all by the charisma of the creature shaped by the mind and hands of Hans Ruedi Giger, with the collaboration of our Carlo Rambaldi. Defined in a cult sequence from the first film - by the android Ash - as a ~perfect organism, whose structural perfection is equal to its hostility~, the xenomorph has established itself in the collective imagination as a symbol of terror towards the unknown, a slender and monstrous macrocephalic figure capable of annihilating other villains on celluloid on an aesthetic-emotional level. It is no coincidence that admiration, despite the absolute ferocity and cruelty, represents one of the common and conflicting feelings that the public has towards this imaginary creature from space (take a look at the controversial Prometheus if you want to know more about its origins) . The magnetism of the alien, solitary and unstoppable in Ridley Scott's film, or multiple and overwhelming in James Cameron's, was rapidly transposed into our media, obtaining mixed results from a purely qualitative point of view, but with very few titles capable of standing out from the commercial flatware. Among them certainly does not include the recent Alien: Colonial Marines, the result of a wicked production process which, in the long years of gestation, has transformed it into a worse nightmare than the one it should have staged. Archived by critics and the public as a colossal flop, complete with judicial aftermath, the GearBox software project has dealt a huge blow to the brand's videogame appeal, after years of half-missteps and only discreet games, unable to grasp the essence of the original cinematic work. Mind you, riddle waves of aliens - when well thought out - can be hilarious, however fans of the saga, more or less secretly, have always dreamed of a survival horror capable of transmitting the same disturbing emotions as Ridley Scott's film. The announcement of Alien: Isolation by Sega, which took place at the beginning of the year, was definitely a surprise, not only for the proximity to the release of the forgettable Colonial Marines, but above all for the developers engaged, namely the guys from The Creative Assembly known for the epic strategy saga Total War. Fresh from Attila's announcement, the British software house allowed itself the luxury, the privilege and even the burden of creating a product forced to revive a large intellectual property in difficulty, without specific experiences in the first-person survival horror genre. Want to know how it turned out? We can tell you right now that the nightmare has become a dream. Here because. Alien: Isolation is a splendid homage to the original film and a very successful survival horror What's new, Mother? In the final sequences of Alien, the commercial tow ship Nostromo explodes in a cloud of dust and debris due to the self-destruction process initiated by Ellen Ripley, third mate on board and the only survivor - together with the cat Jones - of the unfortunate crew. The so-called Special Order 137 of the Company, executed with ruthless skill by the android Ash, provided for the recovery and transport to Earth of the xenomorph at any cost, including the life - defined as expendable - of those present, already deceived by the infamous ~rescue~ signal which repeated every 12 seconds. The plot of Alien: Isolation combines perfectly with the final events of Ridley Scott's film, calling into question Ellen's daughter - Amanda - who, 15 years after her mother's disappearance, learns of the discovery of the Nostromo's black box . Organized with two other members of the Company (the Weyland Yutani), for which she works as an engineer, the girl embarks on the ship Torrens in the direction of the Sevastopol space station, where the crew of the ship Anesidora has transferred the extremely precious find, in which Amanda he hopes to find some clues about the fate of the courageous mother. This, broadly speaking, is the incipit of the plot of Alien: Isolation, the development of which gives the player and, above all, the fan of the film saga, a new story intimately connected to that of the film, where there is no shortage of twists and the chance to retrace some iconic moments from the film with your own eyes. Although in some ways nestled between the classic of the space disaster and the fan service, the narrative plot of the work of Thand Creative Assembly performs its task admirably, accompanying the player in a nightmare experience (deeply survival) where the alien plays the role of a very bad antagonist, constantly saturating the atmosphere with anguish and terror with his ferocious predatory nature. Amanda is not alone when she arrives on Sevastopol, however she will be alone for almost the entire adventure, despite her encounters with other figures - not exactly charismatic - who will appear and disappear until the spectacular epilogue. As the name of the game states, the experience of the protagonist is intimate and personal, and especially in the last hours the narration literally evolves in her struggle for survival, in her ability to face the inhuman adversities that stand before her, in a succession of emotions that will remain imprinted in the history of this medium. The themes embraced in the course of the game are many, in an intertwining of corruption, ruthless greed, power games and even economic crisis, factors that have already converged in the film saga and which also here mark the depth of the nightmare into which we are slowly pushed, always more in depth. Orbital apogee As specified, Alien: Isolation is a (pure) first-person survival horror with some distinctive features and classic elements that the guys at The Creative Assembly have amalgamated to pack a very long and exciting adventure. In fact, the longevity of the main campaign stands at around twenty hours of gameplay at a rather sustained pace, the one we had to keep to reach the end credits and take care of the analysis you have before your eyes. Wanting to explore every nook and cranny of the huge space station and collect all the collectibles, perhaps constantly playing with a low profile (the wisest approach), it is likely that the story can last even much longer. Furthermore, in Alien: Isolation, you die very often, and in some circumstances it is necessary to repeat the same session over and over again to achieve your goal (fortunately, the saves are almost always well distributed). Although it may appear a frustrating situation, it is not at all thanks to the xenomorph's incredible artificial intelligence: it is not in fact a predictable enemy, that you always know where and how to find, but an almost omnipresent evil entity, which surrounds you and keeps in check from the ducts or circulating freely in the levels, forcing you to approach the few meters of a gloomy corridor in a thousand different times and ways, to be overcome. Walking crouched, making as little noise as possible and sneaking between one shelter and another is the best way to move between the various areas of Sevastopol, but in many cases it is necessary to rely on cunning and ingenuity, taking advantage of the precious tools available to Amanda. The interesting crafting system involves the collection of materials such as ethanol, sensors, injectors, batteries and anything else which, combined with the pieces of metal, can give life to very useful objects such as loudspeakers, medical kits, Molotov cocktails and grenades of various kinds (EMP, flash, smoke and explosive tubes), provided of course that you have sufficient material and the relative project. The loudspeakers, as well as the rockets (flares), are among the most interesting and effective tools to distract the alien and move him away from your path, but they can also be used to create havoc among hostile survivors, attracting the lethal beast. In fact, the xenomorph is not your only concern on board the Sevastopol, but there are also armed humans and implacable Z-class androids, resistant and very dangerous especially when they are in a group. Engaging in a firefight is anything but a smart move, as it almost systematically attracts the alien's unwanted attention, so the best way forward is through evasion, circumvention and at times sneak attack. Unfortunately, the fascinating artificial intelligence of the alien is counterbalanced by that of humans and androids, which had seemed uncertain to us since our previous tests. The behavioral patterns are extremely simple and in some cases it is possible that they cannot see or hear you close to their noses, even by activating noisy doors a few decimetres away; however, fortunately, they play a very marginal role in the global adventure economy, with the exception of some specific but limited phases. In truth there is a rather long (and boring) sequence in which we deal above all with androids, undoubtedly the one with the least bite of the whole experience, but which padoxically it is also the one that introduces the most exciting and incredible phase of Alien: Isolation. In addition to the aforementioned gadgets, Amanda can also equip guns such as a revolver pistol and, later in the adventure, a shotgun, a bolt action dart gun and above all the iconic flamethrower: the latter turns out to be a extremely effective tool against the alien who, just like any other animal, is frightened by the fire and runs away from it. But be careful not to abuse it; in fact, the xenomorph becomes more and more enterprising and can take you by surprise even while you try to oppose him with flames. Don't even think about shooting at him; this is the fastest way to attract him towards you and make a very ugly and painful end. During the adventure, however, there will be moments in which you can make your small but very efficient arsenal sing freely. However, the most useful tool in Alien: Isolation remains the iconic motion detector which, once collected, you can quickly equip by pressing the RB button on the joypad, while with the left trigger it is possible to decide whether to focus on its screen or the background. To proceed in the adventure, as per survival tradition, it is necessary to overcome doors, access terminals, collect tiles, restart various types of systems and so on, all supported by a series of simple mini-games or keystrokes to press to complete the game. 'action. The very useful crowbar, more advanced than the ~classic~ one supplied to Gordon Freeman of Hal Life, can be used as a blunt object or to remove the so-called bolts on the doors (devices similar to jaws), while the ion torch, gas or plasma it acts as a blowtorch and is necessary to undermine safety systems and hatches; finally, the tuner is an electronic device - updatable like other tools - which starts graphic mini-games to be played in a given time interval. The most interesting aspect in using the tools and in completing the actions is the physicality, the coherence of Amanda's gestures and what follows from them: it is, for example, a real show to observe the start-up of some systems, where machinery and gears come into operation with obsessive attention to detail. The downside is of course related to the time required to complete the procedures, effectively making us vulnerable to attacks and therefore adding further pathos and tension when being hunted by the alien. Even the simple save, which takes place with special analog machines strategically scattered on the map, takes some time to start working, and there will be many times when you will pray or curse during the seconds necessary for the actual start of the procedure. The exploration of Sevastopol, equipped with a shuttle system comparable to that present on USC Ishimura in Dead Space, can be favored by collecting map updates from special terminals, however, due to the presence of the alien, you will often give up and (mal )willingly visit certain rooms, risking leaving any plans for new tools, crafting components or simple collectibles such as badges and messages in place. The presence of backtracking, never an end in itself and always ready to open up new scenarios, can still help Amanda retrace her steps and recover precious resources. It is up to the player to decide whether to jeopardize his own safety or proceed quickly towards the main objectives, although the artificial intelligence of the alien can in some circumstances represent a psychological deterrent that is really too strong to overcome. When you meet him the first few times you will be literally terrified of him, and it will take several hours of play to ~get used to~ his distressing and menacing dynamic presence, which will give you a hard time, evolving, until the end of the game. Naturally, there is no shortage of scripted sequences at the service of the screenplay and narration, with some twists - also from the point of view of gameplay - that fans of the film saga will love madly, thanks to the very strong emotions they can give. If the long main campaign isn't enough for you, you can embark on survival challenges, where, within some specific areas of Sevastopol, it is necessary to complete certain objectives (such as sealing doors or collecting badges) and of course surviving as long as possible. obtaining a score with relative online rankings. Without forgetting the Last Survivor and Crew Expandable missions set on the Nostromo with the protagonists of the film", "date": "2014-10-03", "grade": "9.0"}