{"name": "Neverending Nightmares", "ref": "https://multiplayer.it/recensioni/138376-neverending-nightmares-sulla-soglia-della-depressione.html", "text": "Matt Gilgenbach has never hidden his problems with depression, accentuated after the failure of his first title published as an independent, that Retro / Grade as original as it is ignored by the general public. It is easy to say that Neverending Nightmares, his new title, tries to represent his relationship with this disease, narrating it through a series of images and events that create strong unease and empathy towards the main character, Thomas, resembling in a not too amazing way to Gilgenbach himself. Some moments are disturbing Unfortunately it is not possible to separate the game from its 'inspiration', for the simple fact that it is a very personal work, in which months of suffering and reflections have been sublimated in videogame form. Only starting from here is it possible to understand the nature of certain controversial choices and some manifest and never denied limits of the gameplay. Neverending Nightmares never tells its story to the end, making it live like a long series of nightmares from which there is no escape. Not that I don't have one, quite the contrary. It just doesn't clarify it in any way, leaving it to the viewer to connect the pieces. We know that some people like to be led by the hand and to hear everything explicable explained but, above all when one has to do with dream matter, going too far into explanations risks impoverishing rather than enriching, because there is always a basic pedantry that perhaps it calms down simple minds, but it does nothing but close in a box what evidently cannot be closed. Neverending Nightmares tries to make the horror of depression into video game form Fear or tension? The control of the unconscious is an illusion, Gilgenbach knows it well and proceeds on his way taking responsibility for sinking the player into something dark in the broadest sense of the term. At the beginning of each chapter, and when he is killed, Thomas wakes up in his bed. He's in pajamas. Upon getting up, the slow exploration of large and terrifying environments begins, the details of which only degrade from dream to dream, in a perverse descent towards madness from which there is no return. One of the cute monsters From a playful point of view there is little to do, except walk and interact with some objects, such as paintings or dolls, which are simply to be looked at. The sound of Thomas's footsteps is enormously accentuated and soon we realize that something is wrong. There is no real horror, but a very strong tension that permeates every step and that echoes in every sound. The more you walk through the empty corridors and gloomy rooms, the more you realize you are getting closer to something, but this something never seems to come. At first, literally nothing is done. Later, enemies will emerge, of all three types, which will be eluded in various ways (by slipping into wardrobes, making as little noise as possible or simply fleeing), but the first few minutes of the game are a slow walk without a why. If you want you can run, but Thomas is short of breath and his sprint runs out in a few seconds, followed by a pause to catch his breath (a cause for tension when being chased by some monster). Many complained about the lack of more pronounced horror moments, i.e. jumping on the chair in the face of sudden danger or other similar gimmicks. In reality, their absence is programmatic, in the sense that the goal, fully achieved, is to create a strong state of anxiety and tension in the player, not to scare him with the appearance of monsters. There are some concessions to the youtuber scream and there are splatter moments, but it's little stuff. Basically a choice similar to the one implemented in Amnesia: A machine for Pigs was made, decidedly not very profitable on a commercial level, that is, the construction of the atmosphere was favored over the spectacularity of the horror. Edward Gorey The visual aspect of Neverending Nightmares was its strong point right from the start. Many players have approached the Infinitap Games title simply after admiring the game images, in which the bright red of the blood often acts as a counterpoint to a design with a childish stroke, made up of sharp and contrasted lines. The drawing style is also reflected in the lighting effects Gilgenbach has always openly stated that he was inspired by the works of Edward Gorey for the graphic style of Neverending Nightmares, so we are not revealing anything mysterious to you. It remains to be understood whether it is an aesthetic choice for its own sake or if it makes sense in the economy of the playful experience. The red of the blood tears through the drawing, opening gaps in an immense childhood illusion now in pieces. The Houseof Usher is collapsing, releasing all the monsters hidden in the ravines that pretended to be closed forever, and the protagonist can't do anything to stop it, he can only flee and try to understand, mourning for the difficult entry into adult life. Sleep is no longer a safe haven, but an incubator of terrible nightmares that haunt Thomas and prevent him from forgetting his traumatic past. The immense house does not protect, but imprisons. From nightmare to nightmare, everyday objects take on an increasingly decadent and disturbing aspect. playful issues To understand Neverending Nightmares you need to unlock all the endings (three in all), which don't clarify much, but which precisely in their vagueness show how much the story in this case is just a pretext for the representation of that endless nightmare that is life . The interaction is often limited to observation At this point, however, it is urgent to clarify a couple of purely playful issues. Meanwhile, it must be said that we are faced with a very short title. Let's say that to complete it the first time it takes from an hour to an hour and a half, depending on the skill with which you manage to avoid enemies. Unlocking the other endings requires repeating some chapters, but overall with two hours, maximum two and a half hours, you can really see everything. The second question is to reiterate what we wrote in the article: in Neverending Nightmares there is very little to do, except explore the environments. No puzzles to solve (apart from a couple to unlock the various endings) and the risk of getting lost is really nil. We can talk about a minimal playful style, like the various Dear Esther or The Stanley Parable, but obviously you have to be aware of what you are buying, in order not to have bad surprises. So, those looking for a more traditional horror avoid it carefully because they could be very disappointed.", "date": "2014-10-02", "grade": "8.0"}