{"name": "Defense Grid 2", "ref": "https://multiplayer.it/recensioni/138163-defense-grid-2-grigliata-di-torri.html", "text": "Few have dared to shuffle the cards on the table in the strategic subgenre of tower defense. The guys from 11 bit studios did it with the Anomaly series, reversing the gameplay mechanisms so as to create a ~tower offense~, but otherwise there were no particular experiments or revolutionary gimmicks. Also because we are talking about a vein that has managed to keep its charm intact without becoming excessively inflated and which, as Defense Grid 2 demonstrates, has spaces that can still be explored for those who want to look for something new to put on the table. Let's clarify this point immediately: the Hidden Path Entertainment title, also out on PlayStation 4 and Xbox One, does not in any way seek to be original, but aims to offer a solid structure, which is engaging for fans of the genre but which does not necessarily act as a starting point for those who do not know tower defense. This goal is pursued through a single player campaign consisting of twenty-one progressively more difficult levels that can be tackled in eight different ways, three multiplayer modes and an editor that allows you to create your own maps and share them with the community. Defense Grid 2 tackles the topic of tower defense competently, with a good campaign I, robot The story of Defense Grid 2 is told through a series of dialogues (in English, subtitled in Italian) which mostly features some artificial intelligences, and which, if desired, also hides a discreet final twist. Unfortunately, however, this type of approach does not engage or inspire, so during the games you will focus on what happens to your towers rather than the exchanges between characters, however cute they can sometimes be. Fortunately, what matters most, that is, the gameplay, does not disappoint at all and plays on the differences between the scenarios to propose new and interesting situations. The starting concept is the one we know well: using a certain amount of energy resources, which increases over time and/or by achieving important eliminations, our task in each stage will be to place units on the map to counter the passage of a certain number of enemy hordes. Specifically, these hordes will follow a variable path that will lead them to steal energy cores and take them away. We will have to make sure that this does not happen, also because these nuclei constitute our vital energy and depleting them will correspond to game over. Furthermore, from the point of view of the high score and the obtaining of trophies based on the score, we will often find ourselves repeating missions to ensure that none of the cores are stolen, suppressing the enemy maneuver in the bud. All towers in the realm We have mentioned different situations within the levels that make up the campaign. It all depends on their connotation: those characterized by open spaces allow us to place towers in order to create real paths that the aliens are forced to follow, exposing themselves to our fire for a long time. On the other hand, the scenarios with predetermined roads imply instead the organization of the defense on the basis of the hot spots of the map, therefore around the place where the energy cores are located, so as to quickly eliminate the enemies and ensure that the stolen capsules back to their place. To implement these strategies we will have a large number of different units available: machine guns, flamethrowers, cannons, precision missile launchers and ~cluster~ missiles, lasers, emplacements that emit electric shocks and then again those that create ~explosive zones~ or which slow down the movement of hostile troops. Each tower can be upgraded three times, changing color (green, yellow and red) and of course the degree of effectiveness. To complete the missions we will be able to choose to implement different tactics, for example to concentrate the offensive in certain areas of the location or to distribute it in several points. The ~open~ scenarios even allow you to change your approach while running, creating new paths where necessary. In all cases, the technical sector plays a purely functional role in the action, with graphics devoid of personality which also prove to be a bit too heavy in terms of hardware requirements (we thought we could run the game without problems on the notebook, but we were wrong) and is spectacular only in the most agitated situations. Variations on the theme As already mentioned, the single player campaign of Defense Grid 2 opens up to a whole series of variations on the theme that focus strongly on replayabilityity. Not only the difficulty levels, therefore, but also the possibility of controlling different characters, each equipped with a particular special ability (an orbital laser, resource enhancement, the ability to concentrate fire on a single target and so on) , and to face the internships subject to precise conditions that significantly modify the structure. The end result is appreciable and keeps you company for a minimum of five or six hours (that's how long it took us to complete the game, focusing on the standard mode and often resorting to the fast forward button), but as mentioned, the duration of the experience can be lengthened quite a bit by dedicating yourself to the many variations available for each mission. Then there is the matter of the multiplayer modes and the editor, even if we can immediately say that the latter is not a viable option for less expert users, rather it puts us in front of an interface low level that almost looks like the one used by the developers themselves. This means that to use it in a decent way you will need to invest some time and you won't be able to get something in a few minutes on the first try, of course. As for the multiplayer, there are three different modes: ~DG Fighter~, ~Double Co-op~ and ~DG Coordinated Defense~. The first sees us fight the aliens and at the same time put our human opponent in difficulty, who will find himself as many opponents as there will be those we will be able to eliminate; the second and third are instead classic cooperative modes, in which we will have to share resources to counter the advance of the aliens. In this sense, the idea of managing matchmaking in a transparent way is apt: once the search for a game has started, the game allows us to do something else and then call us back if an opponent is found.", "date": "2014-09-29", "grade": "8.0"}