{"name": "The Vanishing of Ethan Carter", "ref": "https://multiplayer.it/recensioni/138176-the-vanishing-of-ethan-carter-tutte-le-storie-di-ethan-carter.html", "text": "~This is a narrative gameplay experience that doesn't lead you by the hand.~ The Astronauts, a Polish team formed by the initiative of some veterans who have left People Can Fly, immediately warns the player: The Vanishing of Ethan Carter begins with an inscription that says it all, an invitation to explore and move freely, giving up the modern claim to be led step by step through the interactive epic of the day. Detective Paul Prospero, supernatural investigator as well as the player's alter ego, has a precise task, to find little Ethan Carter who wrote to him asking for his help, and a well-defined investigation area, the splendid Red Creek Valley, but the little information in his possession is not a great baggage to rely on to get to the bottom of a mystery that reveals itself clue after clue, revelation after revelation, until the usual change of cards on the table at the end, which calls into question any accumulated certainty during the five hours of play (approximately) that it takes to go from that enigmatic initial writing to the end credits. The Vanishing of Ethan Carter invites us to move freely by giving up being led by the hand Offline The Vanishing of Ethan Carter is a game with ambitions: it wants to tell an intense and engaging story, but at the same time it doesn't give up entirely, a bit like Dear Esther did instead, to its playful dimension, focusing on the presence of a certain number of puzzles but also on a substantial exploratory component. It abandons the idea of an omnipresent interface on the screen in favor of contextual writings that appear near the objects to interact with, cleans the monitor of any superfluous presence, even the protagonist's hands and arms, and refuses any form of tutorial. Once the game has been launched, you find yourself in a forest, along the train tracks, strengthened by your previous experiences as a gamer to understand how to move, run and crouch with the first person view, but otherwise alone with yourself and the soliloquies that from time to time they give voice to the conscience of Paul Prospero. From there, a few hundred meters away, the first of several corpses to investigate, crime scenes to solve by collecting the clues scattered around, then using the supernatural powers of our alter ego to relive the sequence that led to the crime, reconstructing it frame by frame through a mini game that requires a minimum of intuition or a little more time if you want to experiment. Both the investigations in the places where the crimes took place, and the handful of other puzzles that must be completed to see the final sequence of the game, are based on the observation of the environment and almost never on the manipulation of objects or the solving of bizarre puzzles, apart from a couple of cases. Furthermore, Red Creek Valley is made up of a single rather large and freely explorable environment right away, so the order in which each sequence is completed is not predetermined. The result is surprisingly suggestive because the absence of barriers, therefore the impossibility of remaining stuck in a room looking for a solution, helps a lot to immerse yourself in a story with dark, almost horror tones, which however practically never focuses on the abused and simple prospect of making players jump off their seats. The atmosphere, the speech and the music blend perfectly giving the very first hours of the game a remarkable thickness. Then something creaks and the limit of this structure comes to the surface. Removed all the elements that The Astronauts has cleverly arranged in such a way that you let yourself go to the supernatural mysteries of Red Creek Valley, The Vanishing of Ethan Carter is in fact one big level with a series of events to solve scattered around the map, to be completed in the preferred order but still to be completed in their entirety if you want to get to the bottom of the investigation. In short, the risk that something is left behind is high, especially at the beginning, and so is the frustration of having to wander aimlessly in a context that becomes less and less dense with interactions as we solve individual crimes and get closer to completing the adventure. In reality, this problem is mitigated by a sort of map, which at the end suggests which direction to point our gaze in, but by then it is probable that several players have already accused some frustration. Feeling that risks being tickled even by a somewhat ramshackle autosave system, which has been improved with the first official patch but remains rather inexplicable and annoying. If the development team made some tasks optional,perhaps linking the completion percentage to the presence of multiple endings would have made the completion process smoother and given a reason to come back to it later, while today The Vanishing of Ethan Carter is a title that is completed only once and it is set aside forever. Red Creek Valley Although there is actually the risk that at some point you will find yourself filming in desperate search of the last events left behind and that therefore the suspension of disbelief will come to naught a little, The Vanishing of Ethan Carter remains a title with a very well thought out and courageous narrative. In five hours he tells a detective story that, depending on the moment, lets itself go to Lovecraftian, science fiction derivations, to stories of possessions and black magic. The characters that revolve around the investigation, the members of Ethan Carter's family, are known by observing their spirits when our protagonist reconstructs the crime scenes, but also with the numerous written testimonies and with an intelligent use of the environment, often able to tell details of the story through the exclusive use of images. Speaking of the visual component, the subject of this review is a spectacular game to look at, probably one of the most beautiful around. The Astronauts took an engine we thought we knew everything about by now - the Unreal Engine 3 - and used it intelligently to create glimpses of rare beauty. The secret is the use of the photogrammetry technique: textures and models are elaborated starting from photographs - many photographs - taken of real objects and then elaborated to create the virtual counterpart. The result contains an impressive number of details, including all those imperfections and details that are difficult for an artist, even an expert, to recreate, but which our eye unconsciously expects to observe when looking at reality. If you add to this beautiful lighting and great care for the vegetation that covers almost all of Red Creek Valley, this game is likely to become one of the best screenshot generators out there. A perfect experience also for virtual reality, which would suit you very well both for the staid rhythms and for the quality graphics. The audio enjoys beautiful ambient music that accompanies the various moments of the narrative and a fairly well-made English dubbing, while for the Italian one you have to settle for subtitles. High production values that justify the price of 18.99 euros, corrected for the guaranteed 4-5 hours of gameplay.", "date": "2014-09-29", "grade": "8.4"}