{"name": "L'estate libera di Playground Games", "ref": "https://multiplayer.it/recensioni/138005-forza-horizon-2-lestate-libera-di-playground-games.html", "text": "Two years ago, our review of Forza Horizon began by comparing it to a season, autumn. Here, if we were to do the same with the sequel, the season would undoubtedly be summer. Playground Games' racing sequel takes us back with its atmospheres a month, or even two, while we sip a drink on the Ligurian coast or the beaches of Nice. And the places mentioned are by no means a coincidence, because the map, tripled in the Xbox One version compared to the first episode, moves from Colorado to a curious reproduction of southern Europe, in this case the border between Italy and France up to a tip of the Amalfi coast. Let's say that the area of inspiration is more or less this, then, also considering the obvious proportions, it is a matter of a free interpretation that also involves the Tuscan countryside and Switzerland. If you are stimulated by the idea, nothing can prepare you for the start of Forza Horizon 2, certainly one of the most exciting of recent years and which has nothing to envy to the first chapter. A live action introductory film prepares us for the three dogmas of the title: deafening music, dream racing cars and total freedom. While we still hear the echo of a crowd of young people shaking their bodies in a riot of tribal joy, we wake up in the hangar of a ferry, inside a luxuriant Lamborghini Huracn, discovering that we are docking the Ligurian coast for a run to the tune of Liberate by Eric Prydz. Song chosen to perfection and which represents the banner of this sequel and which makes our fingers tremendously heavy... on the accelerator. Arrived at the Horizon party, located as usual in the central area of the map and functional as a nerve center for the various competitions, we are welcomed by the organizer, who offers us a new challenge, obviously becoming champions of the new Horizon Festival, we are here to This. Forza Horizon 2 improves on just about everything from the original, taking the series in new directions Time to take the field The career structure of Forza Horizon 2 recalls that of the progenitor, the aim is always to win the Festival only this time the bracelets of various colors are no longer linked to the unlocking of the subsequent competitions, but to the level conquered by the player with the points accumulated experience indicating its level as in an RPG. It doesn't take long to understand the reasons, the proportions have changed considerably, not only as regards the map, but also for the number of races that can be played and the various possible activities, as well as the ~seamless~ online integration, i.e. which allows to play on the same map only against flesh and blood opponents rather than against Drivatar. Every time you arrive in one of the areas that make up the map, a location is designated as a dislocated center of the festival, where a new sub-championship of the Grand Tour starts which takes us up to the final of the festival. There are ten categories of cars, divided into sub-classes ranging from two to five each, and every time you get to a new stage of the Tour you have to choose which one to enroll in and based on this choice, the four or five rounds will be different. that we will have to face to move on to the next championship, to be activated by driving to the following location surrounded by Drivatars that splash from everywhere. To access the Horizon final there are 17 championships to win (you necessarily have to finish first in the ranking that comes from passing the stage tests), chosen at will among all the car classes depending on what you most like to drive, without limitations. In fact, it only takes a few minutes to understand that another novelty of the title is precisely the absolute freedom granted to the player. Except running into obstacles such as walls or guardrails, you can go practically anywhere, exploring the map immediately and destroying most of the elements of the scenario. To move around the map, the fast travel system also returns, which is no longer activated in the locations to be found on the map, but directly between the main locations of the Festival, those where the garages are located to modify the car or to register for the various categories of the championship, and only the credits are needed to pay for the transport, credits which decrease when the discount signs scattered on the map are destroyed. It is true that the first Forza Horizon also enjoyed a free roaming structure, but going off the roads was only allowed in certain situations, while now it has almost become an imperative, so much so that we often and willingly find ourselves happily mowing vineyards and prairies. The same races, always represented by closed circuits or courses, also integrate off-road events with great joy, this time the true flagship of the production thanks also to the presence of Jeeps and Pick-ups, as well as obviously the rally cars. Among the most successful events we must mention the open-structure ones, which alternate short sections on asphalt with endless and spectacular off-road raids. In these cases there is no obligation to follow a precise route, even if indicated in the navigator, but it is sufficient to enter the various checkpoints, which are signaled from a distance to provide a reference to the player, the rest is all at our discretion. Playground really risks a lot with this formula, the decision to minimize the repercussions of the dirt road on the car risked flattening the pleasure of driving, but instead everything works wonderfully, and fun is always guaranteed. Unfortunately there are side effects which we will discuss later. Harder, better, faster, stronger The possibilities offered by the Forza Horizon 2 map and the total freedom granted to the player bring the Playground product closer to a true free roaming open world, in terms of complexity it has little to envy to products such as Grand Theft Auto, while outings in the middle of nature they almost make you think of an Elder Scrolls with cars. The comparison seems crazy on paper, but a few hours in the company of the title are enough to understand how everything is blended beautifully and the only real limitation seems to be that of not being able to get off on foot, given that in certain areas of the map we will find ourselves running only by choosing certain cars, rather than others, and that the events of the championships end up recalling the activities of a Grand Theft Auto in terms of number and variety of driving style required. Everything that had made the progenitor great has been revised and improved, the hidden billboards to be destroyed have returned, but they are now of various types and able to offer different rewards not only discounts for being able to use fast travel, as mentioned, but even real experience boosts. Then there are the photographs and the speed cameras, which now also calculate the speed in a pre-established stretch like the tutor who has also arrived on our motorways for some time. The customized liveries and the lost jewels also return, cars to be found in the map expertly hidden and which facilitate free exploration every time the radio informs us that in a certain area there may be an old racing car to be found and put back on track. Each maneuver in the game is rewarded with a score that can be increased using the multiplier, real ~lines~ can be created by chaining various actions, thus increasing the player's experience and the credits earned to buy cars, liveries from other players, assets racing and power ups. It's still. Could the special stages be missing? Obviously not, so let's get ready to face, in addition to the tricolor arrows that have been talked about so much, another series of vehicles on the edge of reality, but calibrated on the old continent, in which the game is set. As usual, these tests give us the same special cars used to overcome them. Not satisfied with having substantially improved everything, Playground has included many innovations, such as the dynamic weather system, which finally brings rain into the series and in a spectacular way with puddles that gradually form on the asphalt and then dry up under the sun, a slot machine to play every time you level up that gives us credits and new racing cars and a perk system to enjoy a series of discounts for the single player campaign and more than 700 total events, a dish of truly enviable wealth. Along the roads there are also those called Unmissable Challenges, which allow you to grab the protagonist car, passing a time trial on a pre-established track, the difficulty of which is indicated on the map by selecting the icon that represents it. There are dozens of them and they are stimulating with their way of introducing challenges of pre-established difficulty that do not depend on the skill that you decide to attribute to the Drivatars as happens for normal competitions. We estimate that 100% completion of the single player campaign could take up to 100 hours, taking the Playground racing game from the parts of a true free roam on wheels. Tell me who you are and I'll tell you how you drive Inheriting the graphics engine and system of Forza Motorsport 5, Forza Horizon 2 makes use, like its more serious cousin, of Drivatars, a new conception of artificial intelligence based on the Cloud, capable of memorizing and learning the driving styles of the players. The result is excellent, even more than previously, and makes us say goodbye to the sad lines of machines, o~trains~, completely unrelated to the presence of the player with an even more remarkable effect precisely for the open spaces in which the Drivatars find themselves moving, marking an even more evident detachment compared to the cars moved by the CPU and which represent normal traffic on the roads of Horizon 2. Drivatars are not only offered in races, but are an integral part of the game world, mixing with traffic, also resulting in unpredictable dynamics and opening up a whole new set of possibilities. It is possible to challenge them simply by positioning yourself behind with your own car, while the presence of particular professional Drivatars allows you to win large amounts of credits. This choice had a cost, Forza Horizon 2 is a sequel clearly devoted to social media, those who prefer solo sessions will find a long-lasting campaign full of things to do, but it is clear that the connection to the network is essential for downloading Drivatar behaviors and to challenge and the friends they continually bring to mind as we read their gamertags as they zip around the countryside. The multiplayer modes themselves often appear in the single player, never proving invasive but on the contrary fundamental for understanding some dynamics, such as that of the Clubs, real teams in which players can unite to face races, or gatherings, where it is possible to watch machines and swap liveries (by the way, remember that the Multiplayer.it Club is already there waiting for you!). Everything is seamlessly integrated, so much so that you just need to enter the menu to convert the campaign into the Grand Tour Online or Free Exploration, but we will talk more about these modes in a separate paragraph. So what's the flip side? The Darius Flynts of the first Horizon are now the most aggressive Drivatars, so much so that the various characters to face, who took the place of the final bosses, have completely disappeared. As a consequence the story has been strongly affected, an aspect that was not particularly strong even in the original, but the fact is that there is no real purpose or identification in the protagonist apart from winning the festival, which in the end represents a small part of the many races available. The interlude scenes intervene only to link the succession of championships to be won in order to finally have access to the final race of Horizon, but they are very short, involve no more than two characters and are engulfed by the enormous amount of content in the game. Question of balance The driving system must have been discussed at length by the Playground programmers, also inheriting in this case the heritage of Forza Motorsport 5, a complete settings system returns, which allows you to customize every aspect of the game, from the driving aids, to the damage, wheel and engine wear, tuning, trim and much more. Basically, even in this sequel everyone can create the game they want, setting the difficulty level according to their needs, but earning fewer credits if they decide to use the aids. The setting of the races and the type of map, however, suggest a choice towards markedly arcade horizons, further reinforcing the more ~caciarone~ soul compared to Forza 5, and perhaps rightly so. We are only slightly perplexed by the decision to open off-road races even to cars clearly unrelated to the type of competition, finding yourself plowing wheat fields with a Lamborghini or a Dodge Viper could annoy someone, but it finds a logic with the festive spirit of the title and is liberatingly entertaining, as you whiz by leaving tire trails across wheat fields or vineyards. Taken in the right direction, Forza Horizon 2 is one of the most fun and rewarding titles to play in recent years, also being particularly challenging if you decide to deactivate all the aids. In addition to the aids, there are also damages to the cars which can only be aesthetic or even mechanical, but even if activated, precisely to guarantee driveability in the extreme situations to which one is called, lead to trajectory and stability defects, rather total unmanageability of the vehicle. Finally, we appreciate the presence of two hundred machines, all included in day one, and the removal of tokens to be purchased with real money, which avoids any danger of ~pay to win~ or ~pay to play~ mechanics. From online, from Kinect and from ANNA Forza Horizon 2 online is accessed with the simple push of a button, that of the menus. From here you go to the social section, which also includes challenges with friends, and you can activate two modes: Grand Tour Online or Exploration", "date": "2014-09-25", "grade": "9.3"}