{"name": "Nightmare before Vita", "ref": "https://multiplayer.it/recensioni/137576-murasaki-baby-nightmare-before-vita.html", "text": "Since it was presented at GamesCom 2013 as one of the flagship titles for the mistreated PlayStation Vita, Murasaki Baby has suddenly attracted all the attention of the trade press and owners of the Sony portable console. To make the game even more interesting is the fact that it is the debut title of Ovosonico, a new team founded by Massimo Guarini after his experience in Grasshopper Manufacture as director of Shadows of the Damned. A declared attempt to create original and more authorial products, and in fact since they showed us the game for the first time, the guys from the Varese team have repeatedly reaffirmed their desire to create a strong, new experience capable of emotionally touch those who play. Murasaki Baby brings a world of crazy characters and Tim Burton-esque atmosphere to PlayStation Vita Hand by hand It's incredible how, watching a tender little girl with a balloon during a train journey, Guarini got the inspiration for an imagery as disturbed and dark as that of Murasaki Baby, clearly influenced by Tim Burton's atmospheres and created with an absolutely unique. The protagonist of the adventure is Baby, a grotesque-looking girl desperately looking for her mother after waking up in a world shaped by the nightmares and phobias of children. Almost like helping a little girl who is lost in the mall, the player must accompany Baby, literally holding her hand with a finger on the touchscreen and dragging it firmly or gently through the various levels. It is an extremely simple, almost trivial input, but which in the intentions of the developers contains the very essence of the game, creating a direct link between the user and the child. The same connection that took shape between Yorda and the player in Ico, but this time without an avatar (Ico, in fact) to act as a third wheel. Baby holds a purple heart-shaped balloon in her hand, not a simple embellishment but a real metaphor for the little girl's life: if it were to fly away, explode or deflate, then it would be game over. Precisely for this reason you must constantly pay attention, using the touch screen to retrieve it in case it gets out of hand, or to keep it away from brambles, flames and electric shocks. Protecting Baby and preventing the balloon from making a bang is already a big nut to crack in itself, but to solve the puzzles and situations that are proposed from time to time, we resort to what the developers have called ~states of mind~. ~. In fact, during each of the four chapters, new moods are unlocked, i.e. alternative backdrops to be selected by sliding two fingers on the rear touch pad: in addition to having its own ~mood~, a distinctive tonality and a different theme, each of these backdrops offer different types of interaction, a bit as if they were, to be clear, powers to be activated when necessary. One of the moods allows for example to make it rain and fill puddles with water; another unleashes a gust of wind useful for blowing enemies away or propelling a sailboat; still another makes some otherwise hidden elements of the scenario visible. There are quite a few of them, and the fact that they are always different for each of the four worlds ensures that they are never identical to each other. Unfortunately all these ideas are never elaborated in a very interesting way, largely also due to the limited time available, given that Murasaki Baby can easily be completed in an hour and a half, maximum two if for some strange and unlikely reason you were to get stuck. Lost children In Murasaki Baby, each chapter sees the protagonist dealing with another child involved in crazy situations. They range from Tentacle Boy, a sociopathic boy who prefers to live in his imaginary world and wear a mask to isolate himself from others, to Perm Girl, a girl so obsessed with her curly hair that she is literally trapped by it. Too bad that the lack of coherence between the child protagonist of the chapter and the various moods that are released within him is evident. In a game that tries to give a thematic imprint to each world, the puzzles, backgrounds and solutions almost always seem to be placed there without an evident logic. In essence, there is no connection between the various situations and problems of each child, with the result that the whole experience is fragmented into many small and decontextualized puzzles, instead of offering a cohesive and exciting experience like that of a Limbo or a Thomas Was Alone, for example. The last chapter is partly an exceptionor, in which the possibility of inverting gravity by turning the console upside down is clearly reflected in the split personality of Twisted Twins, probably the most successful character in the whole game. Here, we would have liked to see such a coherence also in the rest of the adventure, but what is another of the most controversial aspects of Murasaki Baby opens up precisely regarding the control system. The guys at Ovosonico have made an effort to exploit the various features and functions of PlayStation Vita as much as possible, but in some cases the ideas don't fit together very well. Quickly flipping the console feels awkward and unnatural due to its shape and size, while the one brief sequence where the two analog sticks are used feels utterly out of place and disconnected from the rest. The use of the touch screen itself has some contraindications: the index finger that holds Baby's hand ends up constantly covering part of the screen, but the worst comes when you have to twist your fingers in an unnatural way to guide the protagonist, carefully move the balloon and, in meanwhile, hit many small flying pins ready to attack us. Not to mention those moments when the camera is far enough away to make it difficult, if not downright frustrating, to be able to accurately grasp the little girl's hand. And it is precisely because of these small hitches that the magic of Murasaki Baby vanishes: the moment you have to tap the screen three or four times to catch the exact point, or as soon as you find yourself handling the console like a sort of Twister for the fingers, the bond that was being created between the user and Baby is completely broken.", "date": "2014-09-17", "grade": "6.8"}