{"name": "Il gioco della vita", "ref": "https://multiplayer.it/recensioni/137481-fantasy-life-il-gioco-della-vita.html", "text": "Sometimes it's important to remember the great truth of the game reviewer's job, that calling him a videogame journalist or critic angers the envious and know-it-alls: we rarely have fun. Often you have to play the garbage for hours and hours, perhaps sipping the minutes because - surprise surprise - it's difficult to live only on reviews and previews and there are other jobs to do (such as translating novels late at night, a random example). Most of the time you have to race against time, playing very long titles - which maybe we even like, eh - with the embargo breathing down our necks, without being able to fully enjoy them. In the end, having published the review, perhaps without having managed to finish the game one hundred percent, one feels empty and lacks the desire to take it again: so one moves on to the next game to work on, not to play, and everything starts all over again. However, it happens to have several days in advance on the embargo or the release of a game, and therefore to be able to try it in peace. It also happens to be a good title, and it eclipses everything that's coming out at the same time. This is exactly what happened to us with Fantasy Life, RPG signed by Level-5 (already authors of classics such as Dragon Quest IX, White Knight Chronicles or, above all, Ni no Kuni: The menace of the ashen witch) which led us to publish photos of our adventures on social networks without even realizing it. On Facebook there are those who put kittens, those who throw ice on themselves without even knowing why and those who show off for having made an excellent quality silver armor. The world is beautiful because it is varied. Fantasy Life has trapped us in a beautiful virtual world: you decide if it's a good thing or a bad thing A fairy tale for everyone Level-5 is not a famous developer for the scripts of its jRPGs: despite some not very successful epic attempts (White Knight Chronicles and Rogue Galaxy, above all) the Level-5 guys have always been more comfortable with the humour, bizarreness and lightness, often framed by fairy-tale, sunny and serene places. In a sense, Fantasy Life is the child of their latest experiments, in particular of Dragon Quest IX: The Sentinels of the Sky and Ni no Kuni: The menace of the ashen witch. There are many points of contact with these two jRPGs, starting with the distinctly fantasy setting, full of talking and anthropomorphic animals, characters with very funny names and profusion of puns. Another important common feature is the development of the story, often anticipated by jokes and gags as if you wanted to joke with the player/spectator, divided into micro-stories linked by a key element. Hence our adventure, in Fantasy Life, begins in the kingdom of Castele and with a shower of meteorites that seem to corrupt the life forms with which they come into contact. Don't worry, there are no deaths or massacres: the story is very delicate and kicks off when our alter-ego, created at the beginning of the game, meets the talking butterfly Franfalla. From that moment begins a series of adventures that will lead us to explore the world of Reveria and to solve the problems of its rulers: among rebel princesses, bumbling pirates and dark sultans full of secrets, we will meet increasingly atypical and weird characters who will further color our history. Fantasy Life is not a jRPG full of twists or dramatic moments, but an adorable tale that makes joie de vivre and the freedom to choose its cornerstones. For some it might even have a slightly too cheesy aftertaste, but in today's videogame scene, where if you don't have at least a couple of complexes and a revenge to accomplish you don't deserve to be the protagonist, it's a fun breath of fresh air, thanks also and above all to an extraordinary localization in Italian that made us laugh out loud. The blacksmith who cast spells while fishing The so-called ~Lunares saga~ is not the only story in Fantasy Life. Level-5 has filled the world of Reveria with characters looking for help, but the missions we will have to carry out for them are the typical RPG ~fetch quests~: kill a certain amount of enemies, bring these objects, craft this and find that ... We have made the idea. They reward experience points, money, items, and are completely optional. Then, however, there are the trades, and here the discussion becomes a little more complex. ~Choose how to live your life~, reads one of the Fantasy Life commercials, referring to the possibility of choosing a profession and therefore playing as a paladin, a wizard, a miner, a lumberjack and so on. Actually, the choice of mestYesterday has no influence on the development of the story or the actual gameplay. Each profession is headed by a great master and the first thing we will have to do to unlock it is to complete a short introductory story that outlines the various supporting actors, further enriching a large cast which, in many cases, at a certain point will be able to accompany us on our travels . The change of job can be done at any time by talking to a specific character, and it only modifies our character's abilities relatively: each job has access to peculiar skills, it is true, and enjoys a couple of bonuses to the statistics that distinguish it, but the reality is that all trades can wield the same weapons and gear or wear almost any equipment in the game with few restrictions. Our protagonist's competence with weapons or with tools such as lumberjack hatchets or fishing rods are unrelated to the related professions, so it is possible to become expert swordsmen even by playing as a magician or holding a stick and casting spells when dressing those of the tailor. The possibility of combining skills with professions is not necessarily a defect, mind you, because it allows us to approach the game a bit as we want, but in the end it has little impact on the gameplay, also due to the generally rather low level of difficulty. The management of professions and bonus points earned at each level up becomes more important towards the end of the adventure and in the full-bodied ~post-game~, when mining a mineral, catching a fish or defeating a monster particularly dangerous require the use of unique skills and represent the goal of a specific enterprise. The ranks of the various professions, in fact, are in turn unrelated to the level of the character, and increase by completing particular missions entrusted to us by our grand master. If desired, the player can easily concentrate on a single profession and face the whole adventure as a paladin or as a magician or even as a lumberjack without ever changing his profession, but in that way he would lose the beauty of intertwining the various skills, neglecting the accumulation of the happiness points that unlock various, very comfortable optional bonuses such as the personal mount, the most capacious inventories and so on. Not to mention that mining the gold with which to craft your own shining armor is much more satisfying than buying it from the merchants scattered throughout Reveria. The 3D effect Well implemented, the stereoscopic effect does not slow down the action or affect the gameplay, but it makes some glimpses of Reveria particularly spectacular especially when playing with camera rotation. A great coming and going Fantasy Life is basically similar to a classic The Legend of Zelda of the past, in the sense that the isometric exploration is filmed for most of the time by a camera that frames the environment from above and that can be rotated up to a certain point both to the right and to the left. The fights are in real time: we will encounter aggressive creatures or not, and we will be able to decide to draw the sword or nock arrows to our bow to attack them. At that point, the Fantasy Life battle system turns out to be unexpectedly deep, between simple and rhythmic combos, special loading moves and defensive and healing abilities. The control system is simple, but it stumbles a bit on the multiple functionality of the keys: for example, the button for collecting objects is the same one used to draw the sword, and it often happened that we engaged in battle when instead we just wanted to pick an herb or shake an apple tree. Which can be particularly annoying when you're trying to bring loot back to the guild identifier: these large crates prevent us from running and must be dragged and defended from enemies who will try to destroy them. Too bad that often the content is rather modest, despite the fact that they are rare or powerful enemies to guard them. The collection of objects, whether they are dropped by enemies or extracted with picks and hatchets, is the heart of Fantasy Life's ~crafting~ system that characterizes the professions of blacksmith, tailor, cook, carpenter and alchemist. Once the necessary materials have been accumulated and the appropriate formulas have been unlocked, it is possible to access the work table and complete a simple mini-game - almost the same for each profession - to manufacture a new object. The quality of the result varies according to several factors: our competence in manufacturing the type of object in question, the goodness of the tool we are using, the precision in completing the puzzle to the rhythm. In factthat the ideal player goes on an adventure, collects everything possible and returns to the city to make his own weapons and armor, which can therefore be much better than those on the market and, in some cases, cannot be purchased at all. It must be said that for that same ideal player, the collection of objects and the completion of the various missions to improve the professions are the cross and delight of Fantasy Life, which on that side proves to be a fairly repetitive title. The missions of the professions, especially the combat ones, are basically all the same and take place in the same environments, forcing us to go back to the city, change professions and retrace our steps over and over again, which at some point is only relatively facilitated by the fast transport systems or mounts. On the other hand, neglecting some jobs it becomes impossible to complete some optional missions, unlock new members for our group (who wouldn't want the old legendary blacksmith in his underwear in tow?) or enjoy all the possibilities that Fantasy Life offers to the fullest such as, for example example, home furnishings. Home Sweet Home Indeed, we should say houses, in the plural, because we will be able to buy up to three and then furnish them as we please. Some nice pieces of furniture can be found, some others can be bought in shops, but if you want to have a nice pirate-themed living room you will have to put together various materials and make each piece of furniture at the carpenter table. The management of our house (which is a room) is very reminiscent of Animal Crossing, but it is obviously much less profound and varied. It is basically possible to change the upholstery or place the furniture on a grid, perhaps add a couple of pets after unlocking the bonus with happiness points, but the interaction with the environment is almost nil and, in the end, it is a simple accessory minigame and nothing more. So let's say that Fantasy Life is more of an RPG with a splash of life simulator than the real simulator defined by some slogan, but in this sense Level-5 has succeeded in the difficult task of setting it in an extraordinarily well-finished and detailed world, with lots of of day/night cycle, rare enemies that appear only at certain times of the day, places to explore in a completely optional way that hide treasures or impossible enemies, perhaps to fight together with a friend who comes to visit us in our Reveria with his alter -ego. The possibility of exchanging items via the Internet, for example, greatly expands the potential of the Level-5 title, which can still be enjoyed completely alone. Longevity is not in question: it takes at least forty hours to complete the story and grow a handful of professions, many more if you decide to explore every corner of Reveria, craft every object, defeat every boss and unlock every supporting character. Nintendo also offers the day-one additional content in the form of paid DLC, a solution that made us turn up our noses enough since the island of Origins in question was actually an integral part of Fantasy Life LINK!, the second iteration of the Level-5 title, equipped with Internet support and bonus content, released one year after the original Japanese version.", "date": "2014-09-17", "grade": "9.0"}