{"name": "Hearthstone: La Maledizione di Naxxramas", "ref": "https://multiplayer.it/recensioni/137289-hearthstone-heroes-of-warcraft-giocando-a-carte-con-la-morte.html", "text": "Some time ago we told you about the first wing of The Curse of Naxxramas, the ~adventure~ pack - practically an expansion - developed by Blizzard for its recent and hilarious card game inspired by World of Warcraft. Now that the Arachnid Wing is no longer free, and must be purchased like all the others, individually or in bundles, it is worth summarizing the entire offer. In fact, we remind you that Blizzard has now unlocked all the wings of the necropolis, and that the price is 5.99 or 700 gold coins for each, with a small progressive discount based on the wings you decide to buy. For example, the whole package costs 21.99. The question, therefore, is the most obvious in the world: is it worth buying? Curse of Naxxramas is short but intense fun, and Blizzard needs to fix the shot Pestilence, Fighters and Constructs The first wing had given us a taste of the philosophy behind this first adventure: to replicate, as faithfully as possible, the ~feeling~ of Naxxramas, that raid (or incursion, in the Italian style) that World of Warcraft veterans have faced first in 2006, at the end of the so-called vanilla era, and then in 2008, at the beginning of the Wrath of the Lich King expansion. The Arachnid Wing did it very well and we can safely say that the others did it too: the bosses were excellently designed and will make MMORPG fans smile, forcing them to vary their decks and their tactics to come encounter enemies' special abilities. Let's start with Pestilence Wing: Noth the Plaguebringer's hero power, for example, allows him to draw a new skeletal minion from every defeated opposing minion, which is why it's best to use a deck with few minions. The next fight with Heigan the Unclean can be tackled with a very similar tactic, but the Warlocks will have an edge thanks to their ability to control the minions summoned by the boss. Instead, to face Loatheb, the last boss of the wing, the completely opposite strategy is recommended, filling the board with minions to take advantage of the damage bonus that is obtained thanks to enemy minions/spores... a bit like in the original battle . As usual, Loatheb is the reward card for completing Pestilence Wing. The one you win by completing the Wing of Fighters, however, is the Baron Rivendare: he is in fact the boss who represents the infamous Horsemen of the Apocalypse at the end of the wing, with his cronies acting as powerful servants on the board. Here is another example of an ingenious adaptation of the original mechanics. The Construct Wing is perhaps the most interesting: to begin with it offers four bosses instead of the three present in the others, and therefore the defeat of the final boss, Thaddius, rewards the player with two special cards, namely those of his Stalagg minions and Feugen. We also really liked Gluth, a boss with the hero power to reduce the life value of all deployed minions to 1, always keeping us on our toes. In short, from the point of view of creativity and fidelity to the sources, Blizzard has done an excellent job and created a satisfactory adaptation of the original battles in card game format. The Antro del Gelo: final considerations The situation has reversed a bit with the last part of the adventure, the Cave of Frost, which offers only two bosses: the zombie dragon Zaffirion and the (very nice!) lich Kel'thuzad. While remaining faithful to the original mechanics (Zaffirion's cards, for example, can freeze hero and minions but it is important to exploit this disadvantage in reverse since it is the only protection from his hero power) the two bosses did not seem particularly difficult to us, but this consideration actually applied to all the other wings: of course, there are more or less effective decks with which to fight bosses, as it should be, but the normal difficulty level is calibrated downwards, so 'is that it is not particularly difficult to defeat them even using strategies other than the most recommended ones. The speech is a little different as regards the class challenges, which actually seemed rather approximate to us: the idea would be to face a certain boss using a pre-built deck that requires the application of a particular strategy based on card synergy and hero power. In practice, in most cases it seemed to us that the decks didn't have much logic and that the difficulty of the ~challenge~ was linked, more than anything else, to luck... or bad luck. The intervention of the blindfolded goddess, apparently, is also the determining factor in the scenter heroic mode, more exasperating than demanding: to defeat the various bosses you have to use really well-constructed decks and cross your fingers practically from start to finish, and this for a strategy game is not exactly a great advantage, especially if you consider that the reward for our efforts in heroic mode is simply a new card back. Unfortunately, heroic mode closes the content loop for Curse of Naxxramas. As we had already suspected by playing the Arachnid Wing, the longevity of this adventure is decidedly narrow. Once you complete the class challenges and wings in normal and heroic modes, while earning the new exclusive cards at the same time, there is practically no reason to return to fight these bosses, which is why the price of the individual wings (not to mention the last with only two bosses) ultimately appeared to us as a bit too high, especially if you are not a die-hard Hearthstone fan and play it as a hobby. In the future, we hope that Blizzard will adjust the shot, tweaking the prices of individual wings or the complete package downwards and paying attention to longevity. For now, in short, The Curse of Naxxramas - as the first expansion of Hearthstone - is promoted ... but with reservations.", "date": "2014-09-11", "grade": null}