{"name": "Rasta in fuga", "ref": "https://multiplayer.it/recensioni/137327-the-journey-down-chapter-two-rasta-in-fuga.html", "text": "While playing The Journey Down: Chapter 2 we thought: hey, this game is reminiscent of Grim Fandango. Then we stopped. Did we really think such a thing? Is it possible that hundreds of adventures away from Tim Schafer's masterpiece, after which we felt hopelessly orphaned, a game made us feel at least a little the same emotions? Well yes, the second chapter of The Journey Down naturally manages to recreate the atmosphere of the classic adventures that came out of the studies of the late LucasArts. And it does so without having to continually justify itself for being ~just~ a point and click. The recipe for a great adventure was so simple, but it also took courage: the courage not to follow sales trends and imaginary expectations, letting yourself be guided instead by the taste you feel in doing something you like. The SkyGoblin developers must have had a lot of fun writing this second adventure, and it shows. After a sparkling debut but incomplete, mainly due to the short duration of the game and the modest means available, The Journey Down finally becomes what it aimed to be from the beginning, a solid and complete adventure, which is worth all the (few) euros what it costs. If you want to play the first episode, however very pleasant, you can find it for sale on Steam, but it is not necessary. The Journey Down: Chapter 2 traces past deeds throughout the narrative so that everyone can instantly feel at home. However, if you have played the first adventure, you will feel a stronger emotional bond towards the characters, having already lived with them the daring series of events that led them to be fished out of the sea and escorted to the Port Artue pier. And this is where the story really begins. The Journey Down: Chapter 2 is the kind of brilliant adventure that makes up for a bad day A city to visit at least once About three years have passed since the remake of the first chapter of The Journey Down, which debuted in a free version even in 2010. We want to be honest: after all this time the memory of Bwana and her sidekick, Kito, had not abandoned us, but we could also living without knowing what would become of the search for his father and the mysterious land known as the Underland. Then we found this second chapter in our hands and we were very surprised at the growth that the game has made. Now yes, after completing it, we look forward to knowing how it will end. The secret of The Journey Down's success is to be found in the atmosphere and visual style. The African masks instead of the characters' faces, Bwana's Caribbean accent, the mysterious and surreal context in which the lives of the many characters have fallen contribute to representing a world in which we willingly get lost. Unfortunately, even if the screens to visit are much more numerous than those of the first chapter, some interesting points are missing, shown in a map hanging in the municipal office of Port Artue. Perhaps we lacked the time and resources to create them, or perhaps we will visit them in the third chapter. For now, however, we're left with longing for those places we thought awaited us further down the road. In short, you will have guessed that Port Artue is an interesting city, with its own personal history that is revealed in the course of the dialogues, and afflicted by the classic problem that keeps its citizens blocked, in this case the malfunction of the lighthouse. During our exploration we have encountered honest proletarians who get drunk in bars, secretaries who dream of exotic destinations, cunning longshoremen, a corrupt power, and enemies who themselves have bigger enemies. Some characters are more memorable than others, such as the taxi driver Reynolds, or the lighthouse keeper, who stands out for his depth and personality, even more than Lina, the third protagonist of the adventure, who hasn't yet found her authentic voice. The story set in Port Artue, although it moves within very simple coordinates, becomes increasingly intricate, with reversals of perspective and twists and turns that follow one another at a rapid pace. There is also room for a brief psychological evolution of the bad guy. However, one feels that there is a lack of space to let events expand as they should, and some passages take place hastily, such as Bwana's prison break, which no one seems to notice until he personally knocks on his enemy's house. On the other hand, we appreciated the abundance with which the second chapter answers all the questions it raises, delving into the motivations of the characters, allies or enemies, and the background of the events. It does so in the cbear long dialogues, but stopping short of boring the player. We were also amazed to discover that, when the game seemed finished, there was still room for one last set of screens and puzzles in another location outside of Port Artue, which we won't reveal anything about, but which turned the color palette upside down , perhaps to anticipate that the third chapter will not offer only gloomy and shabby screens like those of the first two episodes. And when the credits roll, it is with a heavy heart that we say goodbye to Bwana and her gang. Optimism against repression The two main sources of positive vibes emanating from The Journey Down are its protagonist, Bwana, and the excellent soundtrack, a blend of jazz and Caribbean rhythms that makes us feel good even in front of the gloomy scenery of Port Artue. Bwana is fun and lighthearted without forcing his hand. Conscious of himself and of what is happening around him, he moves with style, trying to solve problems without having his day ruined, despite the fact that he is up against a totalitarian regime that seems intent on persecuting him by any means. We also appreciated the measured irony of the game, which doesn't seek a joke at all costs. The virtue of this second chapter of The Journey Down seems to be the balance of the parts, sober and well integrated with each other. But while on the one hand knowing your limits and focusing on what you can do well is a wise strategy, on the other you feel the weight of some compromises. The animations are in fact very pleasant, but the general quality is fluctuating, with some models that clash against the hand-painted background. Even the puzzles are too simple, so much so that an experienced player will have no problem finishing the game in four hours. On the other hand, each solved puzzle accelerates the progression of the story, because it sets events in motion and provides a key clue for the next puzzle, so that the flow of the game is almost never interrupted. To close on a positive note are the voice actors, who lend a voice to all the characters in the game, among which Bwana and Kito stand out. We are aware that few will consider this game, and it is a pity, because with so many depressing titles that fill the windows of Steam, The Journey Down: Chapter 2 is a concentration of pleasures capable of awakening the passion of the despondent gamer looking for stimuli.", "date": "2014-09-11", "grade": "8.0"}