{"name": "Bella", "ref": "https://multiplayer.it/recensioni/137143-angry-birds-stella-bella-bionda-e-dice-sempre-cip.html", "text": "Quite a while has passed since the release of the original Angry Birds, but we know well how the Rovio franchise has become popular among mobile gamers, however leaving the smartphone screen to land on t-shirts, stuffed animals, toys and key rings. It happens when you have in your hands a real blockbuster with tens of millions of downloads. The point is: how can we keep the starting formula fresh, the same one that has undoubtedly contributed to conquering so many people? In the passage from one episode to another the developers have in fact changed very little, but with Angry Birds Stella things seem different, given that the entire cast of characters has been replaced by a group of feathers (with the only exception of the little Luca) also decidedly angry with the usual green pigs and each endowed with a new power. The protagonist of the game, Stella, can be launched with a slingshot and then make a further aimed shot towards a target of your choice, while the aforementioned Luca has the ability to emit ultrasounds that break glass and can therefore bring down the buildings behind which enemies are sheltered. Poppy is a ~heavy~ girl who, once in flight, can screw and drill the objects below her like a drill, whereas Willow manages to deceive the force of gravity and rotate backwards with respect to the initial trajectory , drawing lethal arcs. Finally, Dahlia is the geek of the group and has a sort of teleportation that allows her to overcome any obstacles to project herself directly where she has decided to strike. Angry Birds Stella boasts all-new characters and abilities, yet the experience remains the same Feathered and angry If you have experience with the Angry Birds series, you will understand that a new cast of characters with new abilities is not just a novelty for the gameplay. And it's not even the only variation on the theme introduced by the Rovio developers, who have also focused heavily on the elements of the scenario: wooden walls on which Stella can bank to activate a disruptive ~flipper~ effect, drums on which to bounce to get further, pipelines to go before finding the impact with the hated green pigs and so on, marking the transition from one area to another with a sort of boss. Precisely at this juncture, the freemium aspects of the experience come into play, which is not limited in a particular way and can be enjoyed completely free of charge, of course, but forces us to wait longer and longer when we have to face that specific challenge to continue the adventure and explore all of its over one hundred and twenty levels. Unless you want to spend coins to reset the timer, of course. The play system is accompanied by a valuable technical realization, which can now count on animations and design of a quality similar to that of a cartoon. In short, there is no doubt that the production value is high, but the question that arises spontaneously is another: those who are bored with Angry Birds, after playing it in all its guises, will find valid reasons to use their time with Angry Birds Stella? The answer depends on the degree of wear compared to the franchise, in the sense that there are new things but the feeling hasn't changed and the surprise effect of this nice puzzle game is now long gone, replaced by solid and tested mechanisms, but at the same time at the same time lacking the punch one would expect from a possible (further) blockbuster.", "date": "2014-09-08", "grade": "7.7"}