{"name": "Perfect Dark Zero - Recensione", "ref": "https://multiplayer.it/recensioni/perfect-dark-zero-recensione.html", "text": "Primary objectives and secondary objectives Perfect Dark Zero is not a sequel, but a prequel that makes us experience the events that will lead Joanna Dark to the Carrington Institute. The plot takes place in the year 2020, Joanna and her father Jack find themselves involved, during a routine mission, in something bigger than themselves. A deadly weapon is on the loose, threatening devastation on a massive scale. The story unfolds through 13 levels seasoned with cut scenes created with the game's fantastic 3D engine, interspersed with encounters with the various bosses up to the inevitable final battle and its epilogue, not too epic to be honest. PD0 can be considered an FPS adventure like Halo, there are many points in common with the latter, including the desire of the Xbox community to seek at all costs in PD0 its ideal successor, especially for online modes. PD0 levels can be addressed in multiple ways. During the various missions, in addition to the primary objectives which, if failed, force you to restart the level from the last check point passed, there are also secondary objectives which, although not essential to the game, we will be called to solve. Failing one of these objectives does not affect the mission, but determines the level and the game statistics which then go into the Xbox Live rankings. The level design is at times mammoth and offers the right space for multiple ways to reach the completion of each stage, thanks to the crossroads that are revealed upon careful examination of the locations. The replayability of this title is high due to the fact that, thanks to the many secondary objectives, we find ourselves appreciating parts of the stages that previously went unnoticed Primary objectives and secondary objectives The replayability of this title is high due to the fact that, thanks to the many secondary objectives, you find yourself appreciating parts of the stages that previously went unnoticed, or you can try your hand at trying to eliminate enemies from different positions from time to time. time. The layout of the maps is absolutely non-linear, and the absence of any reference map doesn't help. The Rare guys must have noticed this along the development of the game, and they have well thought of inserting a support with blue arrows that indicate the correct way forward, an aid that can be activated at any difficulty level you are playing. The arrows come into action when the game ~thinks~ you're lost, or when you stand still for a few seconds too long. Sometimes, however, the many viable roads put this kind of virtual navigator into crisis, causing further bewilderment to the player. Regardless, the entire game can be completed within eight hours on the easiest level, while with fierce checkpoints and more vicious opponents on the other three difficulty levels, it will take quite a while before may you finish the game as Agent Dark. The indication, which we feel like giving, is to play PD0 at least at the ~Secret Agent~ level and to remove all sorts of CPU help, in an attempt to increase the sense of challenge that would otherwise be lacking. The internships follow one another in a swing of difficulty and quality. Some run away as smooth as oil, others flounder a bit and are forgotten. Unless the passion for achieving all the goals does not take off, an eventuality that is far from remote among other things. Joanna's new toys From a purely playful point of view there are several new things to talk about. Long gone are the days when Joanna could only run and shoot. Today the heroine Rare has much more stock at her disposal than in the past (on the other hand she is also younger!). Joanna can perform melee attacks, can hide behind walls in stealth mode, or do evasive somersaults. The controls are well calibrated, the analog is very precise, even if sometimes slightly slow, above all by virtue of the solution adopted for the zoom of the weapons, which is activated with the progressive pressure of the left trigger. The total absence of the jump may initially annoy you, but you get used to it and you soon understand that it is the choice that most distances PD0 from Halo 2, especially in multiplayer. Almost all weapons have a secondary and even tertiary function, such as the flashlight, the silencer of the sniper pistol, the grenades of the assault rifle, the hologram or the possibility of influencing the opponents' radars. In general, the arsenal is really well done, varied and satisfying, in the most literal sense of the term. Using any weapon at our disposal gives a real sense of satisfaction, in fact, and the vibrpad action combined with sound effects combined with machine guns, rifles and pistols contribute to a hyper realistic experience. This is also increased by the effect that accompanies the destruction of opponents' body armor and protective helmets, even in multiplayer. Unloading the shotgun on a Datadyne member and seeing him stay in his shirt is a really adrenaline-pumping feeling. In addition to weapons, Joanna is called upon to use a series of objects that open up the different paths through the levels, even in multiplayer, especially in Dark Action modes. They range from a Door Unlocker to the Splinter Cell, up to a detonator to be activated with a simple puzzle game. There are also two types of means of locomotion in the game: the Jetpack, which can both fly and walk on the ground, and the Hovercraft. In story mode they only make a fleeting appearance, given that their real use is clearly that intended for multiplayer and online matches. Artificial intelligence PD0 shows its long gestation on many occasions during the crossing of the 13 levels that compose it. Like a good monologue with contradictions, the parts that convince alternate with some that leave you perplexed, starting from the level design, which experiences a continuous crescendo up to the middle of the game and then fades away in a couple of levels that seem to have been inserted to number or who in any case are not as convincing as others, to recover in the last desert stages. The alternative routes are reduced and so is the satisfaction of rummaging everywhere. The same Stealth approach, possible in every situation, breaks down against opponents with excellent vision and who coordinate at the slightest noise, even tracking us down where it would be implausible. And this is as true as the opposite is true, given that, especially in the simpler difficulty levels, the artificial intelligence of the opponents is consistent, but too basic. The DataDyne agents, in fact, take shelter from our fire, retreat if targeted, but too often they enchant themselves, gun drawn, offering themselves to the merciless blows of the player Artificial intelligence The DataDyne agents, in fact, take shelter from our fire, retreat if targeted, but too often they enchant themselves, gun drawn, offering themselves to the merciless blows of the player. Even by increasing the difficulty, in reality, the effectiveness of their aim and the damage inflicted will change radically, but the behavioral dynamism will remain more or less the same. The story, while clearly caricatured and citing 70s DC and Marvel comics liberally, proceeds quickly without being able to involve the player more, who towards the end will either be conquered by the gameplay or left a little cold, without Joanna's events can decisively change her relationship with PD0. These aspects, however, do not affect the substance of a fun game which will hardly be left before the end and which, especially in the multiplayer sections and in the cooperative sections, will dominate on Xbox Live and in the LAN parties of Xbox owners 360 in the coming months. Objectives and Multiplayer PD0, among the many things he was called to do, had to raise the flag of the Xbox Live project, together with Project Gotham Racing 3, waiting for Halo 3. Rare has filled the online experience of the game with customizations and possibilities : Single and team deathmatch, capture the flag and territory are the classic modes, but always green. The novelties are all in the Dark Action modes, with some variants such as Infection and Sabotage full of delicious touches, thanks to some of the six well-designed maps. These, among other things, are scalar, becoming increasingly larger with the increase of players on the field, which can reach up to 32 plus 15 Bots, moved by the CPU with infernal skill. The means, which in the single player mode were pure unrealistic appearances, here acquire their own well-defined role and they are found to be manageable and not invincible. In front of an opponent in Jetpack you don't feel cannon fodder, but you can attempt an assault at any time with the hope of having the upper hand. The setting of the game helps in this, more permissive and less technical than that of Halo 2, which, however, in the whirlwind of explosions of the matches with 32 players plus bots, increases the fun factor exponentially, sheltering the players less constant from glaring and continuous defeats, at the hands of the most assiduous players in Live with consequent frustration. With the obvious limits dictated by the difference in experience. The goals to be achieved online, then, add further spice to the clashes, and seeing the various pop-ups appear that attribute more than 10 headshots made or territes conquered in a match, or 1000 kills in deathmatch, rather than damage per certain credits in Sabotage mode, only increases the adrenaline of a victory or sweetens the bitterness of yet another defeat. Objectives and Multiplayer Speaking of graphics and style The polygonal engine set up by Rare is the most incredible one can admire today. Some levels with wide horizons leave the texture detail intact, despite the presence of mountains of polygons on the screen even at great distances. The framerate is constant on 30 fps, except for sporadic occasions in which it drops for a few fractions of a second. A slight motion blur masks the dips well and gives the action an unusually smooth feel. The polygonal engine set up by Rare is the most incredible one can admire today Objectives and Multiplayer Explosions, particles, water, fire, transparencies, glass effects, dynamic lights, parallax mapping and so on and so forth: Perfect Dark Zero is a graphic orgy. The design of some maps, then, helps to appreciate the technical ambitions of the title, given that the breadth and depth of some stages are unprecedented for a fps, above all for the real sensation of space that the 3D engine manages to render. The locations, which are the most varied, are peppered with references to the first Perfect Dark, such as the numerous manga-style graffiti on the walls that are so ~cyberpunk~. The animations are good, also thanks to the use of motion capture for the main characters, and those of Joanna's hands that move sinuously on the weapons as they are reloaded are amazing. Those of the enemies are instead to be reviewed, too slow and unreal, accentuated by the uncertainties attributable to the physics applied to the corpses, which on some occasions start bouncing around the seabed for no apparent reason. This and other small bugs should have been eliminated from a title of this importance, while not detracting from the gaming experience. Open to any kind of discussion is instead the style adopted for the characters in the game, which varies from that of Joanna sexy bomb, to the head of the Carrington Institute, in a Scottish kilt and knee high socks in the middle of the desert. PD0 is a 70s cartoon and a reference to certain action cinema, as for the story, it will appeal to those who have already been captivated by the game and its personality, but it will leave indifferent those who have not been captivated by Joanna's curves. Comment Despite their name, the new adventures of Joanna Dark are not perfect. Some uncertainties could have been smoothed out, especially given the importance that this game has in the Xbox 360 launch line up. Having said that, however, Perfect Dark Zero boasts an exceptionally well-crafted graphics sector, and manages to entertain up to the end of credits. Particular in style, settings and characters; excellent in balancing weapons and, above all, in online components, PD0 is a true new generation game from a technical point of view and from that of the completeness of the package created by Rare. Among the beginning adventure titles for the new Microsoft console, it is certainly one of those that most deserves to be played and that, especially Xbox Live subscribers, should take into consideration. Pros: True Next Gen graphics Comprehensive online game Good balance and assortment of weapons available Cons: Some bugs that could have been avoided AI to be reviewed Inconsistent level design Perfect Dark Zero was undoubtedly the most awaited title of the entire Xbox 360 launch line up. Since the announcement of Microsoft's acquisition of Rare, the expectation towards the prequel of that jewel admired on Nintendo 64 has become asphyxiating among fans. The desire to see and play Perfect Dark Zero has risen year by year, from its first announcement on Xbox, up to the one who wanted it transposed to the new generation Microsoft console, almost turning it into a sort of urban legend, a chimera. December 2nd has passed, the game is finally on all store shelves and the time has come to judge this title that makes hype its main ally, but also its most bitter enemy. We are interested in the substance, however, and we went to find out how much there is and if, in the end, there is fun with the new adventures of Joanna Dark.", "date": "2005-12-15", "grade": null}