{"name": "The Elder Scrolls Online: High Isle", "ref": "https://multiplayer.it/recensioni/the-elder-scrolls-online-high-isle-recensione.html", "text": "We're sure the same may be true for some of you, but almost 11 years after the last original chapter of The Elder Scrolls saga, we have to admit that finding ourselves in the fantasy universe that Bethesda Softworks has built with its open world RPGs terribly missing, even more if we think of the fact that it is still very early to receive any information on the sixth chapter of the series. In fact, the company is concentrating all its resources and energies on Starfield, and since role-playing games at Bethesda are not exactly very simple to develop, there is a serious risk of returning to Tamriel only towards the end of this decade. Although there are substantial differences between the two titles, what many ignore is that the legacy of the saga is actually carried on with great pride by The Elder Scrolls Online, the MMO now in its eighth year of activity which has gradually expanded to now offer an almost totally explorable Tamriel, from the granite towers of the Imperial City to the snow-capped peaks of Skyrim, from the forests of Summerset Island to the volcanic slopes of Vardenfell. After a couple of DLCs that had led the adventurers of the ZeniMax Online Studios MMO to fight powerful daedra in the plans of Oblivion, the game is now preparing to welcome a new expansion with a completely different flavor, set in the splendid Breton island of High Isle, characterized by charming Mediterranean landscapes and luxurious castles. There is an air of holidays, and just like a tourist guide equipped with an umbrella, our review of The Elder Scrolls: High Isle will take you to discover all the beauties of the island, telling you plus some new features coming with the expansion. Did you put sunscreen under the armour? What can you expect from a Breton, other than politics? High Isle, in all its colors The expansion is not limited to concentrating its range between the borders of the island of High Isle, but will rather allow you to explore most of the archipelago of Systres, a commercial point of reference for the naval routes that circumnavigate the continent. The strategic position of the Breton ports, but even more their total neutrality in the War of the Three Flags, makes the archipelago the ideal place for the intricate plots of the policy of the three Alliances, in which we will find ourselves immersed from the very first lines of the main plot. Forget the epic of the latest expansions, in the story of The Elder Scrolls: High Isle we will be thrown into a complex political thriller whose antagonists do not jeopardize the survival of Tamriel, but only the fate of High Isle and its sister island Amenos, a penitentiary colony covered by a dense jungle and populated by all kinds of criminals. The tone of the adventure is therefore much more relaxed than in other DLCs, even if after a few hours of play we realize that our intervention will still have an impact on the destinies of the inhabitants of the continent. The prominent nobles of the bay of Gonfalon have lost a small fleet of ships carrying an extremely precious cargo, and as expected it will be us who will have to shed light on the mysterious disappearance, having to deal with a large cast of secondary characters properly characterized . The plot is quite enjoyable, and although it proceeds without particular twists and turns in a very linear way, in our opinion it will be appreciated by that part of the community looking for an undemanding single-player narrative experience. Veterans have never been entirely enthusiastic about the attention that the latest expansions have reserved for the more casual user group and newbies (who without ever having started TESO can enjoy the expansion just like the others), and in this sense they could instead ill digest another expansion that does not bring particular gameplay novelties (such as new classes or skills) to focus on the narrative. And for veterans? A knight of the Ascendant Order, the opposing faction in the DLC As it was legitimate to expect, The Elder Scrolls Online: High Isle does not in any way want to leave anyone empty-handed, and therefore, in addition to the new 12-player trial, we point out the presence of two new companions, Ember and Isobel, who will be able be found on the game map among the dozens and dozens of other side quests that dot it. The first is a clever Khajiit enchantress who can't resist the temptation to empty a few pockets, while the second is a local Breton noble who has however embraced knighthood to fight all kinds of noble causes. The new companions undoubtedly represent one of the most interesting novelties of the expansion, not only because it hasn year of characters at the antipodes, but also for the evident care that the team has put into their realization, to the point that the dubbing of Isobel is entrusted to that Laura Bailey who at the Game Awards a few years ago won an award for the unforgettable interpretation by Abby from The Last of Us Part 2.As far as the endgame is concerned, the new activity that makes its debut with High Isle is Dreadsail Rift, a classic 12-player trial that will reward the most skilled adventurers of The Elder Scrolls Online with 4 new unique equipment sets. Focused on the theme of piracy, the trial features three main bosses and 2 mini bosses, all with very complex mechanics and which will require a good deal of cooperation between all participants. Some bosses are also separated by dense areas of environmental hazards, so if completing Dreadsail Rift on normal may not be that difficult, prepare a team of professionals if you have the ambition to complete its bosses on hard. A card game to save the world This is what the Tales of Tribute game table looks like Among the many contents of The Elder Scrolls Online: High Isle, the protagonist role in our opinion is taken by the new card game that the developers have introduced with this expansion, known as Tales of Tribute. It is natural that for a part of the community the introduction of such a novelty should be accessory to the arrival of great innovations on the gameplay front, but after a few hours spent at the gaming tables against human and AI opponents we fell madly in love with this card game, to the point that we can define ourselves as the first supporters of its possible landing in stand-alone mode. If you have never heard of Tales of Tribute, you will be pleased to know that just like Gwent was for the Witcher saga, now also The Elder Scrolls has its own card game. This content is accessed by visiting the Gonfalon gaming room, and from there you learn the rudiments of a different card game from the usual in which you don't fight the most monstrous creatures to death, but rather tell real stories through the cards of a deck that, at least initially, you don't even own. In fact, you start with some basic card that can give you money, useful for buying one of the five cards always present in the center of the table during your turn, offered by an imaginary tavern keeper to both players. Tales of tribute The accumulated and unspent money is lost at the end of the turn, but all the cards obtained go into your hand and return to the deck after being used. These provide the other two currencies of Tales of Tribute, Prestige and Power. The first is the score of the game, you win when you reach 40 Prestige, while the second allows you to dismiss the opponent's cards in play and turns into Power at the end of the turn. The fact of being able to build a deck in constant rotation during the game, while contending with the opponent for the best cards in the center of the table, makes Tales of Tribute a card game capable of offering players ever-changing situations, and in our case it was really hard to get away from the table to go and turn around High Isle.", "date": "2022-07-06", "grade": "7.5"}