{"name": "Indiana Gems", "ref": "https://multiplayer.it/recensioni/135892-traps-n-gemstones-indiana-gems.html", "text": "The release of a new mobile title by Donut Games generally doesn't make too much news, given the extreme prolificity of the Swedish team: however, in the case of Traps n' Gemstones here, things are fundamentally different. In fact, the game stands out from the rest of the developer's catalog not only for a higher selling price, but above all for a more complex and profound play structure, which refers to great classics such as Metroid and Castlevania. So let's go and see if the guys from Donut Games found themselves at ease on this absolutely new terrain for them. The pyramid of disorder Without too many preambles, Traps n' Gemstones immediately puts the user in the shoes of the anonymous protagonist, an adventurer very similar to Indiana Jones (complete with a leather jacket and fedora hat just to remove any doubts about a purely casual reference) who it is located at the entrance to a large pyramid. A brief dialogue with a guardian makes us aware of the fact that a mysterious bad guy has scattered all the sacred relics of the monument inside, thus activating all kinds of traps and pitfalls: it will therefore be our task to put things right, recovering the artifacts and freeing the imprisoned orderlies. In terms of gameplay, this translates into a game that rightfully falls into the metroidvania category, thus offering a two-dimensional action / platform setting within a single large scenario made up of interconnected rooms. Initially the protagonist is unarmed, and the few virtual keys on the screen simply allow him to move left or right, jump or roll on the ground: however, a few minutes of play are enough to find a whip (another vague reference to a certain cinematic adventurer) that will as the main tool to get the better of the monsters that populate the pyramid. Combat isn't the main focus of Traps n' Gemstones however, which predominantly focuses on exploration, solving simple puzzles, and collecting gemstones and treasure, accomplishing the task with commendable proficiency while not inventing anything really new. As in the best tradition of the genre, here too each room presents a challenge of some kind, be it a puzzle, a platform section, an encounter with a particular enemy or a combination of the three factors: in case it is impossible to continue, you have to go back retrace your steps to look for a tool or a relic that allows you to move forward. A backtracking that the developers wanted to sweeten with a series of tricks such as the indications given to the protagonist by the freed attendants or the map accessible from the pause menu, in which the rooms are marked with points of interest. The scenario itself is structured in such a way as to make the process as least frustrating as possible, with an elevator placed in the center of the pyramid that allows you to move quickly between the various levels. Traps n' Gemstones is a great adaptation to the mobile format of the Metroidvania formula In addition to the simple and precise control system and the pleasant smoothness of the adventure, Traps n' Gemstones can count on other arrows in its bow that make it a fully successful title, starting with a level design with attention to the smallest detail. The pyramid is not enormously large (the adventure can be completed without major problems in a couple of hours), but the effort made by the developers in trying to offer a sufficient dose of variety in the various rooms to keep the interest alive is evident until the end. The solution adopted to bring together the high accessibility of the game with a challenge factor dedicated to the most competitive users is absolutely successful: every time you die (just one hit is enough to knock the protagonist out) you start over immediately from the beginning of the room that was being faced, with the only penalty being the zeroing of the score obtained by collecting the treasures. In this way, the more casual players don't have to submit to frustrating rebirth mechanics, while those who want to compete with their friends to see who can pull off the best score must try to go on as much as possible without running into any mistakes. In addition to the online rankings, Traps n' Gemstones also offers a series of objectives always oriented towards the most hardcore users, with the most challenging ones requiring you to discover 100% of the pyramid's surface, including the secret passages. Everything is in the right place in the Donut Games product, even from a technical point of view: graphically, the game relies on a simple but effective two-dimensional cosmetics, with sminutes but very detailed, while the sound accompanies the action with music that varies according to the area of the pyramid being explored and pleasant old-school platform effects.", "date": "2014-08-11", "grade": "9.0"}