{"name": "MOBAsta", "ref": "https://multiplayer.it/recensioni/135867-fates-forever-mobasta-mo.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. That mobile gaming does not lend itself to complex and prolonged entertainment is a difficult assumption to question, yet there are now beginning to be numerous productions that aim precisely to offer a dense and demanding experience, with games that end up lasting even forty-five minutes between face-to-face flips. And so, after the excellent Heroes of Order & Chaos and Solstice Arena, here comes, for the moment only on the iPad, the long-awaited Hammer & Chisel project, or Fates Forever. Let's start by saying that the game can be downloaded for free from the App Store and adopts a very permissive freemium approach, which uses the device of rotating free characters to let us try all eleven warriors currently available (to which three more will be added soon ), but which, through an achievement system, offers up quantities of ~premium~ credits sufficient, with a little patience, to permanently unlock other guardians. And if the quality of this title convinces you after a few games, you can take advantage of the 17.99 euro Launch Bundle and immediately unlock the entire roster, so you can enjoy a more varied experience. That said, we would like to underline that there are no purchase restrictions or ~action points~ that are consumed or waited between one game and another: it is possible to play with Fates Forever for as long as you want, completely free . The popping tooth fairy Closing this necessary parenthesis, let's see what are the peculiarities of a MOBA that has been designed specifically for use on tablets, and which uses all the typical elements of the genre, adapting them very well, however, to the context. The touch control system is immediate, since it is based on the simple touch of a point on the map for our character to go there, or an enemy to start the attack against him. On the left side of the screen there are five icons arranged vertically: except for the last one at the bottom, which represents the rune we selected at the start, the others are responsible for activating special attacks, which differ from warrior to warrior, of type ranged or directional, which can be upgraded by acquiring experience points during the game and used to get the better of the most dangerous opponents, i.e. those controlled by other players. Anyone familiar with multiplayer online battle arenas knows that these are variations on the theme of real-time strategy, rigorously designed for competitive online modes; however the main menu of Fates Forever allows you not only to face three against three matches, but also to participate in cooperative matches with two other players against bots or start a game in which both our companions and the enemies are controlled by artificial intelligence . There are episodes of lag, unfortunately, but not particularly marked and in any case limited to three-on-three clashes. Before getting there, however, we will have to complete a simple but rather complete initial tutorial, which provides a clear idea of what the philosophy behind this production is. Fates Forever succeeds in the difficult attempt to clear MOBAs on tablets in the best way Without giving up anything One of the strengths of Fates Forever is that it does not give up any of the aspects that have always characterized the MOBA genre. So here are the minions, who play a fundamental role as they can shield us during the assault on the towers until the enemy base is destroyed, which will allow us to win the game, and also an economic system that uses a series of slots to allow us to customize our warrior's skills based on the strategy, favoring attack rather than resistance, providing him with extra objects such as potions or going to act on his movement speed. All strictly with a view to progress that ends at the end of each match, completely avoiding hateful dynamics such as the infamous ~pay to win~. For the rest, the usual rules apply: you never win alone, and you must therefore coordinate your action with that of your companions, starting with the selection of the character so that the team is perfectly balanced. Speaking of characters, the design work done by the guys at Hammer & Chisel seemed to usexcellent, with a group of anthropomorphic animals whose abilities suit their nature: there is the big and powerful boar, the quick and insidious hare, the elusive and lethal bird, the lynx that strikes from afar with its bow, and etc. In terms of modeling and animations the result is excellent, and in the same way we appreciate the attention to detail of the only available scenario, with its two main streets but the many ~alleys~ in between. Finally, the sound sector manages to best accompany the action thanks to its full-bodied effects and enveloping sounds.", "date": "2014-08-09", "grade": "8.5"}