{"name": "Street Fighter 6: la recensione dello straordinario picchiaduro di Capcom", "ref": "https://multiplayer.it/recensioni/street-fighter-6-recensione.html", "text": "The community still has a vivid memory of the launch of Street Fighter V: a game that arrived in homes ahead of time, plagued by a small roster and disappointing content and further battered by a structure closer to that of a free-to-play that at a full price title, inexcusable for such an illustrious name. That reckless launch was the last nail in the coffin of Yoshinori Ono's career, already shaky due to various projects below expectations and very little sensible choices, which had led Capcom's fighting game division to lag behind the others even during the period of the rebirth of the Japanese team. Let it be clear, the faults were not entirely of the good Yoshinori, who we consider an iconic character in the world of development with a respectable curriculum behind him. The veteran's departure from the scene, however, represented a second chance for Capcom and a new direction to follow in the approach to fighting games, where the once innovative and unstoppable strength of the software house had been missing for some time. However, even for the most skeptical it was difficult to foresee changes as rapid and successful as those seen at the end of the cycle of the fifth main chapter... Within a few years, in fact, Street Fighter V became a sort of ongoing construction site, constantly updated with increasingly more interesting, and supported to the point of remaining at the top of the competitive scene despite the initial problems. In short, the ~new course~ was already clearly perceivable by the fans, and surrounded by the general belief that what was done was not linked only to the shortcomings of the last chapter released, but to the desire to use it as a test bed for a sequel (later quickly confirmed by Capcom itself). Now this long-awaited sequel has arrived, and after following it for months, we've finally managed to get our hands on a complete code to test it thoroughly. And we don't hide it, practically every information revealed on the new Street Fighter has only increased our anticipation and the general optimism around the game, to the point of making us consider it almost impossible to fall in style right on the final. However, what we have tried these days has exceeded even our wildest expectations: the Street Fighter 6 review tells us that this is the game that fans of the series have always wanted, a surprising return designed to erase all mistakes of the predecessor and to raise the qualitative bar beyond all limits. And, that wasn't enough, it is also one of the very few fighting games capable of adapting both to those who want monstrous depth and to those who simply want to approach the world of digital beating, as well as offering both of these types of players all the tools necessary to enjoy the best experience. Narrative and single player campaign: world warriors During the World Tour the characters on the roster will become your masters. So we think it's time to prostrate... ahem, talk to Cammy The gameplay and the changes to the mechanics of the latest Street Fighter are obviously the most important element for any longtime fan of the series, yet we believe it is very important to start from the contents offered, since Capcom has paradoxically turned the tables almost more to this element than in all the rest. In fact, director Takayuki Nakayama's new baby represents a sharp break with the past of the series and is clearly designed to give several hours of entertainment both to online dating fanatics and to anyone who simply adores the Street Fighter universe and wishes to enjoy it in quiet solitude. Therefore, beyond the classic Arcade Mode, you will find a brand new single-player campaign called World Tour waiting for you, in the role of a customizable alter ego with a very complete character editor. The World Tour is literally the most ambitious novelty of its kind ever seen in a title of the series: it transforms the game into a sort of action adventure with explorable maps and RPG progression, in which your protagonist gradually becomes stronger and stronger and can customize his techniques by learning them directly from the main fighters. Of course, the battles always take place using the view and the classic system, but we assure you that the developers have done everything to create a campaign capable of capturing even those who are not particularly familiar with fighting games: advancing from battle to battle not only do you unlock a myriad of quests and secondary activities, but it is possible to transform into unstoppable monsters capable of using techniques of all kinds (in addition to the ~base~ that you prefer by imitating your favorite warrior), obtain a myriad of objects with variable statistics to enhance (you can also exploit only the aesthetics), and advance a narrative with implications that are nothing short of important for the world of Street Fighter . The World Tour features insane combat, side activities, a structured narrative, and explorable maps. It's certainly not trivial stuff for a fighting game, least of all if it's called Street Fighter 6 That it is an addition created with love is also evident from the care with which many of the missions have been calculated, and in addition to the more classic quests you will find many optional tutorial missions waiting for you, specially designed to make new players understand some of the fundamental mechanics; the secondary activities have also been included with this intent in mind, ranging from training for the use of complex inputs to the need to learn the timing of parades defending against basketballs. A truly respectable variety, also accompanied by an endgame represented by series of fights of increasing difficulty when the final bars are reached, and by a sea of fanservice and quotes. Furthermore, if you want to delve into the history of legendary warriors such as Ryu and Chun Li, or simply find out more about the newcomers, there is even a sort of affinity system linked to the masters, which requires you to improve your relationship with each one by dint of enhancing their style or gift items. Focus enough on the relationships and you will get not only interesting information related to each one's narrative and background, but also high-quality artwork or other surprises. It will take some time to unlock everything, and the upgrades of your alter ego will then also be maintained in the online Battle Hub, where it will be possible to use him in very exaggerated (and very unbalanced) non-competitive clashes with other players. Capcom has gone big with Street Fighter 6, starting with the editor of its alter ego Considering how much this campaign represents a step forward compared to the commonly meager contents of this type of norm present in the genre, it is really difficult not to rejoice at what Nakayama and his team have done, however there are some flaws in the World Tour, and it is the case to underline it. The campaign really starts to ~click~, in fact, only after a few hours, due to a rather slow prologue in which many of the AI-controlled opponents are too stupid to present a challenge (some of them cannot react to simple maneuvers as repeated series of grips, so to speak); the design of the maps, then, is not the most excellent in circulation, so much so as to sometimes force you to do annoying backtracking, or to require a rather annoying use of the day and night cycle to change the available assignments; finally, although the aforementioned explorable maps are quite accurate, we have noticed a few bugs here and there, including textures loaded late and other strange landslides. However, these are marginal defects when compared to the positive elements, and we can tell you without hesitation that we have fully appreciated what has been done, so much so that we return even after the completion of the main story to unlock the unlockable and further enhance ourselves. If fighting games often boasted such an approach to the story, perhaps the genre would be more popular with a wider audience. Street Fighter 6 bonus content and tutorials The Street Fighter 6 tutorials are extraordinarily complete, and make Capcom's work a fantastic ~encyclopedia~ for those who want to approach fighting games The World Tour alone would be enough to forgive the sins of the previous title, but Capcom with Street Fighter 6 seems to have wanted to satisfy every single request from the community, including the inclusion of tutorials of rare completeness. We had already praised some Arc System titles in the past for their way of treating the ~educational~ aspect, because in a complex genre like that of fighting games, the presence of in-depth tutorials and clear notions is potentially invaluable for conquering those who don't know the basics (and many exponents tend to ignore the thing almost completely, relying entirely on the guides posted on the net by veterans); therefore imagine how happy we are to see this work also follow the encyclopedic path, providing a myriad of tests divided between fundamental mechanics and advanced strategies, and explaining the terminologies in detail. There are even guides dedicated to individual characters, which not only outline the most evident characteristics, but also show how to use tactics that are useful to say the least online. Trials of combosthey are no less, and in general the developers have calculated almost all of them to teach the user a series of shots that are useful in any type of situation. The beauty is that combinations and guides are divided between normal and modern commands based on the preferences of the player, but we will focus on this important diversification later. In Street Fighter 6 there is no shortage of loud and excessive modes, designed to have fun with friends and not give a damn about the competition for a while To further raise what has just been described, the artificial intelligence of the enemies takes care of it, among the best thought out not only in the saga, but in fighting games in general. The CPU is seriously problematic at the highest difficulties, and at the maximum one (level 8) it is so efficient that it is useful both for training and for understanding which are the most optimized combos and the best offensive approaches. Ok, sometimes he cheats by reacting instantly to maneuvers and using conversions at the limit of the human, yet he does it with a not entirely dishonest frequency that still allows him to defend himself properly. This adjustable challenge level also makes the aforementioned Arcade Mode exhilarating, the single-player versus matches a great way to understand how the roster in its entirety works, and the more naughty modes absolutely a hoot even if you are not facing other players. we are talking about less classic modes, Street Fighter 6 contains Extreme Battles, clashes equipped with specific modifiers and customizable victory conditions, which will see you fight in arenas with charging bulls, drones capable of inflicting negative and positive statuses, electrified zones, and away like this. Practically a party mode for unpredictable challenges with friends, which only increases the range of options available to users. As you will have understood by now, in terms of content this game is truly a giant, and it was difficult to hope for a more massive work than what has been done. Even as you delve into the online Battle Hub there are extra surprises to take note of; incredible, therefore, that everything we have described in the last paragraphs pales in front of the quality of the gameplay. Combat System: Defeat Sheng Long The Drive System is more elaborate than ever. Properly mastering all its mechanics will be essential to play properly We want to temporarily postpone the discussion related to simplified modern controls (also because they have more weight than one might think) and focus on the classic ones, since Street Fighter 6 is always based on a six-button fighting game - three punches and three power kicks and different speed available - and there were no bastardizations whatsoever. In addition, the 18 initial fighters have not been simplified in any way and among the choices there are still ~charge~ characters (which require a directional charge for a few moments to launch special moves, so to speak), equipped with mixed moves, or with 360-degree inputs especially suited for arcade sticks. Already maintaining these foundations could make us understand Capcom's desire not to stray too far from the origins, but, if we then analyze the new mechanics, we quickly realize how much the latest Street Fighter is actually designed to offer even more tools to the players than some of the most technical and appreciated chapters of the saga. One novelty in particular undoubtedly represents the heart of the combat system: the Drive System. The work done with the new roster entries is fabulous. Marisa is one of our personal favorites, and not just for being Italian The balance of the battles practically revolves almost entirely around the Drive bar, an indicator divided into six notches that is used for a myriad of different actions. The first - and probably the one you will see most used in the initial months of the game - is called Drive Impact, and it is nothing more than a shot equipped with armor (it absorbs at least three opponent attacks before being stopped) with a rather slow activation, but capable of guarantee a meld if it takes the enemy by surprise during a move animation or hits them near the corner. The other two main maneuvers are the Drive Rush, which allows you to cancel an animation to make a sudden dash towards the enemy and offers an advantage to any attack that hits during that movement, and the Drive Parry, which absorbs any hit and recovers bar if used properly. Now, the Drive Impact is a maneuver that can scare, but paradoxically it is the least useful of the three: if you play defensively, reacting to its use is very feasible and it is possible to stop it not only with the", "date": "2023-05-30", "grade": "9.5"}