{"name": "Di padre in figlio", "ref": "https://multiplayer.it/recensioni/135731-rogue-legacy-di-padre-in-figlio.html", "text": "Released practically a year ago on PC, Rogue Legacy now arrives on the PlayStation platforms thanks to all the updates released so far, the Cross Buy, but above all thanks to a charisma, an immediacy and in some ways an originality that we are rarely used to seeing nowadays. All in the name of a practically successful mix between two genres that seem to be made to be merged together, the much loved (and hated) ~roguelike~ and the too little frequented lately ~Metroidvania~. Obscure insider terms for what is to all intents and purposes a two-dimensional action platformer that draws heavily from pearls of the past, such as Ghosts 'n Goblins, and from the more ~explorative~ chapters of Metroid and, of course, Castlevania (the most obvious reference here is Symphony of the Night) and then raise everything on the altar of permanent death and levels... sorry, procedurally generated castles, game after game, different from each other. Playstation 4 trophies Rogue Legacy rewards the player with 30 trophies, 9 bronze, 5 silver, 4 gold and 11 secrets, plus the obvious and badass all-encompassing platinum. We obviously have to dissect the game in depth, exploring every meander of the castle to perfection, but also kill all the bosses and properly enhance ours, indeed our alter egos. Rogue Legacy is really a perfect mix between Roguelike and Metroidvania One day all of this will be yours In this article we will not dwell much in explaining in detail all the many facets of the gameplay - there is a substantial PC review about it - but it is enough simply to say that our hero leaves one or more heirs at each departure, each with weapons, class, different abilities and traits (somatic and otherwise): you return to the castle, you try to survive as long as possible by accumulating more money to bequeath to your progeny, and so on for all the following generations. Money is all that's left over from the previous game and will be spent mindlessly on new spells and upgrading your stats and gear before, er, dying again. Also because the entrance ticket to the castle always resets our liquidity. It is understandable, therefore, how the game decisively pushes the accelerator on extreme farming and on the ~one more game and then I stop~ factor, which in theory can hardly be affected by the repetitive factor given that each adventure is always different from the previous one. both in terms of the game world and of the fauna that populates it given the roguelike structure. Obviously in the long run the forcibly repetitive structure of growth reaches a breaking point, but without a doubt Rogue Legacy puts all of itself into removing this problem over time. With such a setting, the first walks in the castle can be extremely difficult, punishing at best, but luckily for us we will never get to define them as frustrating, given the excellent response to the commands and above all the non-linearity of the gaming experience that it (almost) always gives us an escape route. And if this weren't enough, the game also offers the possibility of ~cheating~. By unlocking the architect we can return to the previously visited castle by paying a certain amount, which is very useful once the bosses have been found, in order to avoid wasting time and obviously unpleasant surprises. By doing so, the spirit of the roguelike is lost, but it must be said that in this way fundamental resources are wasted to be spent on upgrading outside the castle, consequently it is not exactly a painless shortcut, without forgetting also that there is no loot in the previously visited rooms. Another thing we really liked is how each heir isn't just another of the same hero with a different weapon. The peculiar traits, somatic and otherwise, make one game even more different from the other. These range from ironic ones, such as heroes suffering from aerophagia, to those that have a major impact on gameplay. We can be born dwarf, short and with a short slash, but this allows us to reach areas where only the ~little ones~ can reach. We can be colorblind and see the world in black and white, or we can be massive and not feel the backlash when hit. There are many of them and they contribute to the pleasure of discovery in Rogue Legacy. Speaking specifically of this Sony release we must add that in addition to the too little acclaimed cross-buy (and cross-save) that allows us to play the title on all three platforms with a single purchase, the developers have rightly included all the updates released so far on PC, including of course the boss remixes, for an even more complete, tough and rewarding gaming experience.", "date": "2014-08-06", "grade": "8.5"}