{"name": "Non fidatevi dei procioni", "ref": "https://multiplayer.it/recensioni/135568-guardians-of-the-galaxy-the-universal-weapon-non-fidatevi-dei-procioni.html", "text": "With the imminent release of the new Marvel film, could the classic video game tie-in be missing to accompany the film? Of course not! The iron must be struck while it's hot, so here we are ready to offer you the review of the latest game produced by Disney and dedicated to the Guardians of the Galaxy, less well-known but no less likeable characters than the classic Spider-Man, Iron Man or the Fantastic Four. Guardians of the Galaxy is a fun game, partly marred by imprecise controls Simple but effective The game mechanics are absolutely elementary: in essence, it is a matter of completing each level without letting all the characters die in battle, in order to collect experience points, weapons, useful objects and bonuses in the form of gems that enhance the heroes. As you progress through the story, you have the opportunity to unlock new allies equipped with special skills and moves that allow you to create destructive combos to defeat even the toughest opponents. Each stage - there are more than sixty - must be tackled in the same way: the desired team is composed, using a maximum of four fighters, the power-ups are distributed in order to have at least a balanced team and the fight begins. The strategy plays a fundamental role, given the need to find the right combination between attack and defense power; successfully completing each battle on the first attempt is very difficult, if not impossible. In this regard, the arena mode comes to our aid, a sort of horde mode in which you face an infinite series of enemies until you die, thanks to which you can earn quite a few experience points to level up and increase the statistics of the our heroes. The controls are really simple as the only action required is to draw a line from the character to where you want to move or to the enemy to attack; ironically it is also the biggest flaw of this title, given that in the presence of excited moments it is virtually impossible to perform precise actions, assuring us certain death. If we add to this also a scarce variety of situations, here are the two problems that undermine this otherwise enjoyable, but tiring title in the long run. The graphics are very nice and the short cutscenes are really well drawn, in full Marvel style, which comic fans will appreciate; the care dedicated to this last aspect is far superior to the gameplay, which risks getting bored with the umpteenth fight. The price is average, but the developers must be acknowledged that they have made the right choice, abandoning any form of in-app purchases and promising periodic updates with new characters and levels to unlock in addition to the many already present. Note the presence of small bugs that force the application to restart and a very poor responsiveness in the menus, given the need to press several times on an element to be able to select it; they are small defects that can be easily fixed with future updates but at present this is the way things are. It is neither a revolutionary title nor a masterpiece, but nevertheless the game is fun and will satisfy all fans of Marvel comics and even some players looking for a simple and immediate pastime.", "date": "2014-08-01", "grade": "7.5"}