{"name": "I denti del drago", "ref": "https://multiplayer.it/recensioni/135462-battlefield-4-dragons-teeth-i-denti-del-drago.html", "text": "Dragon's Teeth, the fourth expansion for Battlefield 4, takes us this time to Asia, namely China, North Korea and Thailand, for a DLC all about close combat, where infantry is the protagonist. From the oceans of Naval Strike we then move on to the cities: a nice change to stage very different dynamics compared to previous amphibious assaults. The contents are as usual fairly rich: four maps, a new game mode, eleven new ~assignments~, five weapons and two gadgets. In short, a lot to play. Chain Link, the new game mode, is undoubtedly spot on. The idea behind it is quite simple but effective. It is a question of conquering control points in sequence, thus creating a ~connection~ between the various ~hot spots~ which results in the elimination of the opposing team's return tickets. It would seem nothing particularly different from what has been played up to now, but given the urban and ~intricate~ nature of the maps, everything becomes even more frenetic and complicated, often in tight spaces, with the two teams fighting each other with good luck, trying in the meantime to move to the sides to avoid bottlenecks in which to die every three by two. In terms of guns, to begin with we have two pistols with a low rate of fire but with devastating power, perfect for a caciaroneous and pyrotechnic action film. We are talking about a classic like the gigantic Desert Eagle and the lesser known Mateba Model 6 Unica, a made in Italy revolver. Then we have the McMillan CS5, a single shot sniper rifle, designed specifically for urban combat; the MPX, a small compact machine gun with a high volume of fire and the Bulldog, a bullpup assault rifle, therefore relatively compact, also designed with close combat in mind. No new vehicles unfortunately, but two decidedly interesting gadgets. The RAWR is a small, remotely guided, tracked drone armed with a machine gun and grenade launcher. It doesn't have an easy life, it's not a bonsai version of a tank; it can be disabled quite easily, but if used with great care, especially in bottlenecks, it can save us many tickets. The shield, on the other hand, is as useful to use together with a companion as it is totally useless alone, since it doesn't let us take up any weapon. Basically you become a sort of walking cover. From the beaches of Naval Strike back to the city with Dragon's Teeth Lakes and skyscrapers But how are we placed at the level of battlefields? Although urban combat is the leitmotif of this package, the level design sets up maps that are undoubtedly not gigantic, but in any case very varied, complex both horizontally and vertically, therefore capable of enhancing all types of game, with the exception for those that mainly involve battles between tanks and aircraft. Here the means are few. The soldiers, the infantry on the ground are the protagonists of Dragon's Teeth. Pearl Market takes us to China, to make us fight in a veritable hell of narrow streets, dilapidated buildings to explore up to the roofs in a not exactly fashionable district of Hong Kong. There is a bit of everything, including a couple of armored vehicles: openings to go through with your heart pounding since the buildings around are perfect for snipers stationed everywhere on several levels, numerous defilations to get to the control points, on the ground and on the roofs, and more generally a lot of space to move around, even (and above all indoors). The Levolution system is not very present, with the exception of a switch that closes an access and little else. With Lumphini Garden we move to Bangkok, for a map that is totally the opposite of Pearl Market. We are inside the huge Lumphini park, ideally divided in two by a monorail made especially for stakeouts and ambushes. The distances and lines of fire increase exponentially, but at the same time, embankments, hills, huts and low walls can block them with great ease. The bridges over the river therefore become the fundamental junctions for moving between the various control points, for a map that does not fail to indulge in a bit of close combat between the buildings given that at one end there are a couple of strategically placed control points placed. The Levolution of the map is interesting and effective: just sabotage a dam to flood a large part of the map with tons of mud, completely changing the face of the level in those areas. With Propaganda, however, we travel to Pyongyang, the capital of North Korea. The layout is quite basic, but the possibilities offered by level design, levolution and environmental destructibility are very interesting and give rise to interesting tactical situations. A map to nothingtrivial, with a long railway that cuts it entirely (watch out for the trains!), while on the sides, tower blocks and embankments and small tunnels complicate things for the infantry. The vehicles are now present, such as armored vehicles and quads. A truly apt map, which perfectly recreates the miseries of the Korean capital complete with a huge golden statue of the father of the homeland, a perfect counterpoint to the gray of the Soviet-style tower blocks. Even if there is no shortage of smaller structures and huts to stage ~close quarter~ clashes. The last map is Sunken Dragon. Ideally divided in two by a small lake in the central part of which there is a three-story restaurant, while around it we find flyovers and skyscrapers. In a small way, therefore, a perfect battlefield to put into practice all types of approaches, since there is room for everything and everyone, from close combat to long lines of fire from snipers stationed in the many raised points of the map. The Levolution event is interesting and spot on, given that there is the possibility of flooding the central part, the one where the restaurant is, changing the layout of the battlefield again. Dragon's Teeth we liked it. Its setting dedicated to infantry is not extreme and also leaves some space for vehicles, but above all it offers a never banal level design on all battlefields, full of ~tactical~ possibilities and also embellished by a discreet use of Levolution. The content beyond the maps is there as usual, a new and effective game mode, new weapons, assignments and gadgets, new vehicles are missing, but it doesn't seem to be something to tear your clothes off. We also like to underline how on an artistic level the developers have done a good job of best characterizing the maps, especially Propaganda, a realistic representation of the ugliness of North Korea.", "date": "2014-07-29", "grade": null}