{"name": "Moderno di nome e di fatto", "ref": "https://multiplayer.it/recensioni/135234-modern-combat-5-blackout-moderno-di-nome-e-di-fatto.html", "text": "You can think what you want of Gameloft and Modern Combat, the FPS series by the transalpine studio that has always been inspired more or less clearly by the Call of Duty franchise: however, it is undeniable how this has managed to represent , episode after episode, a real yardstick for all the exponents of the genre who appeared on the mobile scene. A custom that seemed to have weakened with the fourth chapter, released last year, received positively but with more than a few reservations from the public and critics. Fortunately, Gameloft has rolled up their sleeves and this time they have decided to go big Dream or smartphone? As happened for all the other episodes of the series, even in Modern Combat 5: Blackout the plot is nothing more than a mess of events and characters already seen in thousands of other similar titles, but considering that it serves only as a mere glue between the various levels game, that's okay. On the other hand, this is certainly not the traditional strong point of Gameloft's play offer, which has always stood out for its cutting-edge technical sector: Modern Combat 5: Blackout is no exception and indeed represents the best that can be currently see on a mobile device. From a graphic point of view, the title is a real feast for the eyes, and this can be understood immediately from the majestic introductory level set in Venice, a true condensed version of what will be seen during the single player campaign: well-kept settings, delicious light effects, polygonal models of enemies defined down to the smallest detail and equipped with realistic and very varied animations, all decorated with a presentation that does not spare itself in terms of pure spectacularity, with exploding vehicles, collapsing buildings, walls they disintegrate and so on. The frame rate is also applauded, which on the iPhone 5s proved to be granite, without ever giving way to any hiccups even in the most agitated situations. If you want to nitpick, from time to time you still catch a glimpse of some gross detail that abruptly brings Modern Combat 5: Blackout into the confines of mobile gaming, but most of the time it's almost hard to believe you're facing to a smartphone rather than a real portable console. The same goes for the exceptional amount of content crammed into the application: there is a single player campaign divided into five different settings, a multiplayer component that offers five modes (free-for-all, team, capture the flag, VIP and battle between groups), four different classes for the character to choose from - each with specific characteristics and related branch of skills - freely selectable between one stage and another, modifiable and expandable equipment with the elements conquered during the game, objectives, challenges weekly, rankings and a comfortable chat to converse with friends and members of your clan. All this without the software giving in to the easy temptation of microtransactions: in fact, with a decidedly counter-current choice compared to today's standards, Gameloft has well thought out not to insert any form of in-app purchase, thus making all the game components simply unlockable via the gameplay. On the other hand, there is a small price to pay for all this good things: the application always requires an active connection to synchronize progress data, even if you want to play only in single player. Modern Combat 5: Blackout establishes itself as the new champion to beat in the field of mobile FPS Automatic (fire) for the people It must be said that the French studio has often stuffed its products with large amounts of playful material ~forgetting~ to take care of the qualitative aspect, but fortunately this is not the case with Modern Combat 5: Blackout. To begin with, the developers have tried to compensate in every possible way for the natural inadequacy of the touch screen as a control system for an FPS, allowing the user to choose between three different settings and to work on a whole series of parameters, from speed of the view to the position and size of the virtual keys, up to the never too praised option of the automatic fire, which was so much missed in the previous episode. Thanks also to all these expedients, the single player campaign flows away like a pleasure, moreover benefiting from a truly enviable variety of scenarios: not only the main stages put the player in very different situations (breaking the canonical action with command sequences of turrets, quick time events and amore), but there are also a number of non-story special missions that include very varied activities, such as using a sniper rifle to cover an ally, eliminating all enemies in a room within seconds of breaching a a door, resist a certain number of waves of opponents and so on. However, in a globally much more than positive picture, Gameloft has however let its hand slip away in balancing the level of challenge, with some sporadic but frustrating difficulty peaks that seem more the children of design oversights than of a precise intention of the developers. Even the sumptuous multiplayer sector also lends itself to a criticism in particular, relating to the lack of a concrete matchmaking system: we therefore happened to participate in online matches in the company of players who, with much higher levels of experience, had been able unlock better skills and equipment, giving you a disproportionate advantage over newbies. However, this is an aspect that could easily be corrected by Gameloft with a future update, and which only partially inhibits the value of a playful offer which, even in this area, can be considered a real yardstick for FPS on smartphones and tablets. Ultimately, this is the judgment we feel we can give on the entire offer of Modern Combat 5: Blackout, a title that amply compensates for its lack of originality with excellent technique, solid gameplay and massive doses of entertainment.", "date": "2014-07-24", "grade": "9.0"}