{"name": "Rotola ancora", "ref": "https://multiplayer.it/recensioni/134925-armillo-rotola-ancora-sam.html", "text": "Armillo is the son of a long gestation, which began way back in 2012 and ended now that the game has become a temporary exclusive for the Nintendo eShop. More than two years to develop a platformer apparently like many others. The funny little animal, the kidnapped brother, the mechanical enemies who play nature against technology, the colorful worlds... Nothing that we haven't already seen, in short, and that could make us think of the infamous death of fantasy. This is how many beautiful indie titles are often ignored, just waiting for that extra minute of attention to reveal themselves to be something better, something special, something that could change the rules of the game. Armillo, in his small way, tries, and he does so by drawing heavily on the great classics of the recent and remote past: the result is a platform that really surprised us and gives us hope for the future of Nintendo's virtual platform. Is he a plumber? Too small! It's a porcupine! Too orange! Is it Samus Aran? No, it's Armillo! The cloned clone Armillo is the eponymous protagonist of the platformer, an orange armadillo who finds himself facing a long and dangerous journey to save his family from the Darkbots. A story seen and overwhelmed, which the guys from Fuzzy Wuzzy Games tell us without overdoing it but still managing to involve us in the misadventures of their hero. A little animal that will immediately remind us of another: it is not blue and it is not super fast, but it curls up in the same way, and that way of curling up reminds us of another character, a certain interstellar alien hunter who manages to roll in the most squeezed into a perfect Marble Madness imitation. And the very first level of the game - and most of the subsequent ones - certainly don't shake off a strong feeling of deja vu that sends us back to a mustachioed plumber lost among the stars. Super Mario Galaxy was certainly Armillo's main source of inspiration, since it is played practically the same way: the levels are planetoids which the camera will rotate around as we explore them facing one danger after another. The basic mechanics are very simple: the left stick or the accelerometer to move, a key to jump, a key to sprint. That's all, Fuzzy Wuzzy Games was enough to come up with a truly applause level design, because if the first few minutes can make you turn up your nose remembering Mario, Sonic and Metroid, you immediately realize that the Canadian developer didn't limit himself to copying Nintendo and SEGA titles, but to make their ideas their own by proposing something of its own. The trick is not in the originality of the puzzles - because there isn't much originality in finding keys to open doors or pressing switches to clear passages - but in the fast pace with which the challenges follow one another, passing from platform sequences to puzzles, from time-trial combat: each level is different from the next in both content and the way it's served, and you never get that nasty feeling of redundancy you get when a game just pretends to be something else. The armadillo with an edge Armillo is also a balanced game from the point of view of longevity: not too long nor too short, it focuses heavily on ~completists~ without appearing poor in the eyes of backtracking haters. Each world consists of four levels, a boss and a secret stage, but to unlock the latter and collect every hidden goodie it will be necessary to replay the various levels after making a stop in the shop which will exchange the currency collected while we were walking around for upgrades , permanent bonuses and special abilities. None of these purchases are essential, but some will allow us to reach otherwise inaccessible areas and complete each world one hundred percent. In this sense, there is no shortage of variety, both from the point of view of gameplay and from a purely technical one: the Super Mario Galaxy-style level design is accompanied by horizontal scrolling levels that we will have to complete by racing against time and others more focused on puzzles solving or combat rather than jumping and manual precision. Perhaps the most disappointing part of the experience were the bosses, quite trivial in execution when compared to the riot of ideas concentrated in each stage. In any case, Fuzzy Wuzzy Games has done everything possible to aesthetically differentiate the locations even with the few means available: Armillo is certainly not an indie title that pushes the power of Wii U to the maximum, and relies almost entirely on lighting effects and on the general style of each world, so as to offer different situations despite the mediocrity of the textures or the polygon count. Sintherefore that, in certain situations, there are quite inexplicable drops in frame rates, which affect the action in moments in which there would seem to be nothing capable of causing the defect. The problem tends to occur when the scene is particularly confused, but quite often there have been some rather annoying slowdowns in otherwise calm moments. It is a minor defect, however, and does not in the least affect the desire to strip each stage as much as possible, thanks also to their brevity and density.", "date": "2014-07-17", "grade": "8.5"}