{"name": "C'era una volta il lieto fine", "ref": "https://multiplayer.it/recensioni/134548-the-wolf-among-us-episode-5-cry-wolf-cera-una-volta-il-lieto-fine.html", "text": "For an introduction to the series, we refer you to the review of the first episode. The one we review here is the fifth and final one, Cry Wolf. Finally, if spoilers are keeping you awake, we advise you to go directly to the comment box at the bottom of the article. A wrong ending ruins even the best story. Thankfully The Wolf Among Us ending works, unties the knots and answers all the questions. It's a predictable ending in terms of the sequence of events, yes, but unexpected in terms of the emotions it leaves behind, although enough clues had been planted for us to predict grim scenarios. Resignation veiled in melancholy, this is what we feel in the time of the last cigarette. Despite the catharsis of revenge, which has been simmering inside Bigby for a long time, the message is in fact that there can be no justice, because there is no single truth. We can only choose and live with the consequences of our choices. Is Fabeltown a better place now? Looking back on the past, would different choices have made us feel better? These questions linger under the ever-present neon light. You too have probably decided what type Bigby should be in your narrative, because The Wolf Among Us is all about him, the wolf sheriff who has to look after the flock and protect it, even at the cost of hurting, maiming, and finally betraying him. The frog father and his son leave the city - at least in our story - destined for exile. Father's fault, sure, but then why does Colin, the pig, equally guilty of not using Glamor to dress up, stay in town? Because he's our friend, that's why. Sending him away was too much, it seemed like the wrong thing to do, but seeing the frog family get into the van we're not so sure anymore. Then there's The Crooked Man, who we've been hunting for a long time, public danger number one. But there's also his version of events, our anger, the deaths of Lily and Faith, a scared and lonely community, and Snow White's sense of justice. Too much for one man. Indeed, for a single wolf. That whatever he decides to do, he still fails. The Wolf Among Us is over, and we will stay with Bigby for a long time to ruminate on what happened It ends like this Even if the conclusion of The Wolf Among Us convinced us, it is not among the best packaged episodes. The latest revelations come quickly, without beating about the bush, then it's time to get down to business during one of the longest action sequences of the entire series. From this point of view it was inevitable that the escalation would focus on physical violence, but the psychological preparation necessary to be emotionally invested remains in the previous episode. As if to say that after a month the anger has subsided and everything turns into an exciting but little-felt rodeo. The chase is a little perplexing, considering that the destination of the pursued is the most obvious of all - so what was the risk of losing them? - while the final fight in a foundry is cliche. If nothing else, the long-awaited clash with Bloody Mary fully satisfies the need for spectacularity, prompting Bigby to manifest his final form. Nothing to say about the dizziness of the camera, therefore, even if the ruthless assassin has frightened us much more in the past, holding the silver-loaded pistol. And then comes the key moment, the confrontation with The Crooked Man. Here we have to make the key decision, the sum of all those made previously. This part is perfect, and we finally get back to hearing the heart beat. It's just a pity that the weight of our actions is made explicit in a long expository scene where the community gives voice to the accusations that we already felt arising within us. The purpose of this scene is blatantly to say hey, did you see that what you did in previous episodes mattered? Certainly Telltale could find more complex and less comfortable solutions. Suffice it to say that among the members of the community there are completely secondary characters such as the butcher, while others who would have had the same right to be present but with whom we had no pending accounts are excluded. Similarly, the visit to the municipal office seems designed to show Colin that, as we said in the first paragraph, we have not sent to the farm. It's not that serious, they are lapses in style that do not diminish the strength of Bigby's retrospective gaze who, in the course of a last confession, manages to put an end to it. And that's all you could ask for. There is nothing fairytale about The Wolf Among Us. The stories of his characters leave the screen and mix with our experience. They interrogate and torment us. It doesn't endhere, that's for sure. Everyone will carry this last hour of play within themselves. And, we hope, in the upcoming season, that we are clamoring.", "date": "2014-07-10", "grade": "7.4"}