{"name": "Robottini fotografi", "ref": "https://multiplayer.it/recensioni/134486-chibi-robo-lets-go-photo-robottini-fotografi.html", "text": "Chibi Robo was born about ten years ago on the GameCube, thanks to the little Japanese hands of the Skip boys. It is a developer who has worked almost exclusively for Nintendo platforms, yet we would not be surprised if many of you have never heard of him: their works are nothing short of particular, imbued in brazenly oriental sauces and rarely offered in Europe. One of the exceptions, as you may have guessed, is the very first Chibi Robo: a game featuring the homonymous little robot about ten centimeters tall, devoid of rockets, teleportation or any other super power, devoted to epic housewives cleaning, and earthly bound to the life of your battery. Days marked by night and day, declined in robot-perspective precisely by the electric recharge of one's energies... all after having passed the vacuum cleaner, talked to other mini characters inside the house, avoided the dog (or, better say, the angry giant) and in general helped in every possible way the human masters. It was peculiar, interesting and, frankly speaking, not very funny. Little action, slow pace, not exactly exciting objectives. But in that first Chibi Robo this atypical and strange direction had a precise goal, that is to familiarize and create empathy with the domestic dramas going on inside the house: we don't want to pass it off as a colossus of modern dramaturgy, but here, the way giving importance to the little things, giving you control of a minute robot, it was touching. From that point of view, cleaning, sweeping or carrying a toothbrush were bearable tasks, not an end in themselves. While maintaining similar minimal missions, Chibi Robo on Nintendo 3DS abandons the general plan, inevitably losing its original identity. The mini robot Chibi returns to Nintendo 3DS: this time, however, the tasks are less valuable ... nostalgia Even going beyond the undeniable fact that it's a less ambitious video game than the progenitor, it's hard not to see in Chibi-Robo! Photo Finder a set of minigames glued - discreetly - together. The final objective, as well as the reason for the title and the symbol of the entire production, is to photograph, through the Nintendo 3DS camera, objects of everyday life... and bring them back to the - slightly futuristic - world of Chibi Robo. Not that the game develops in an indiscriminate series of shots, far from it; on the contrary, getting to the point of being able to ~photosteal~ something is a privilege, almost an end-of-level boss. But why ~photostealing?~ Well, in practice Chibi serves an elderly master, a collector of now obsolete and essentially unobtainable old objects, to the point of photographing, and then going to recover and extrapolate from the original habitat (i.e. your home) these collector's relics, which they are called ~nostalgilli~. The idea is nice, and it is also able to fascinate both children and so-called ~casual users~: in fact, observing this strange little robot interacting with a photo of one's own house is curious, albeit superficial from a playful point of view. There are two main problems afflicting this phase: first of all, it is necessary to immortalize the objects by making their limits correspond to those of a pre-established shape. One possible negative consequence is the poor lighting of the room - such as not to distinguish the element from the background well, invalidating the shot - while the other is linked to the interpretation of the grid to be respected. To give an example, a shape that seemed to me suitable - and it was, since the game approved the shot - for one of those old clamshell mobile phones, was actually to be applied to a can; therefore the photo-texture of mum's old pink Samsung was glued onto a cylindrical polygonal construction, to then be archived, at that point predictably, as a ~can~. Same thing for the circle-brooch, which we have instead interpreted as a vase. The silhouette of a roll of toilet paper seen in three-quarter view is less confusing. Before getting further lost in the crazy missions required by this Photo Finder, a last word on the other problem we had initially stated: the quality of the Nintendo 3DS camera. Here Skip has little or nothing to do with it - the problem is hardware - and it is certainly a weakness that afflicts enthusiasts more than occasional users, however the feature should be reported. In any case, we reiterate it, however limited and superficial this phase of the game is the most captivating. Wash and iron The real weak point of the production is therefore not the final section, i.e. the coveted photograph of an object, but rather the process necessary to get there. As mentioned previously, it is betweentta of a series of minigames linked to each other by the domino effect, with the last piece constituted by the click itself: action-reaction, without an authentic link to connect the various parts, if not the generic visual hub constituted by desk, laptop and socket to recharge Chibi. To photograph you need a silhouette, to buy a silhouette you need ~heart points~, to get heart points you need to complete short missions. And precisely on this last part, which among other things is the predominant one - at least in terms of time - the game sinks: the tasks assigned to Chibi Robo are boring and not very engaging. In one case it is necessary to guess the distance that separates the protagonist from a certain point, using his height as a reference; in another mission, the challenge lies in bringing the right ingredient to a couple of crazy chefs with refined language, moreover in the shape of a tube of mayonnaise (them, not the way of speaking). And the two cooks allow us to deal with another thorny topic, namely the lack of cultural ties with the characters in the game: unless you love the most extreme Japanese productions, with strange or demented characters, whether they are robots or super-deformed entities, you will hardly be able to familiarize yourself with the selected cast. However, apart from the protagonists, once a mission has been tackled, the setting can be freely explored, so as to recover other heart points. As? With those everyday, trivial and domestic gestures which, as mentioned at the beginning, deprived of the aestheticizing role covered in the first episode, emerge overwhelmingly in their superficiality. Chibi must clean with a vacuum cleaner, collect waste paper, peelings and various kinds of waste, to then recycle them and receive the infamous heart points in exchange. It's not fun or inspiring, and it's not even clear the logical connection with the final photograph. Chibi's constantly precarious battery, pointed out by some as a cardinal defect of the game, in fact constitutes the only constraint that gives a little adrenaline to missions and cleaning, limiting the autonomy of the robot. But it is certainly not enough to bring out the work from mediocrity, among other things exacerbated by a low-level technical realization, primarily due to the frame rate.", "date": "2014-07-08", "grade": "5.8"}