{"name": "Sul carro del vincitore", "ref": "https://multiplayer.it/recensioni/134409-world-of-tanks-blitz-sul-carro-del-vincitore.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. With over eighty million users worldwide, the success of World of Tanks in the field of free-to-play productions is indisputable and has led to the consecration of the Russian Wargaming team, which over the years has been able to enrich and diversify its offer, expanding it to other vehicle categories. Three years later, the tank-based simulation also lands on mobile devices, first on iOS and then on Android, with a structural reduction very close to the original, capable of staging spectacular team battles for up to fourteen participants and to offer us a gameplay strongly characterized by strategic elements, as well as assisted by respectable numbers, with over ninety unlockable vehicles, divided into four categories and belonging to the American, German and Russian armies, an incredibly multifaceted growth system, eight scenarios in which to fight and a text chat to possibly communicate with our teammates. Having selected one of the armored vehicles available, with a view to slots limited in number (but it is possible to obtain more using the precious currency of the game, gold coins), we will only have to make sure that we have a suitable amount of ammunition, after which we will be able throw ourselves into battle, immediately noticing how the matchmaking system implemented by Wargaming is very fast and works very well, given that it is able to set up a game in a matter of seconds, without showing its side to phenomena such as those due to excessive latency or server disconnections. World of Tanks Blitz manages to translate the gameplay and structure of the original in an excellent way Shoot or conquer Our goal in World of Tanks Blitz is quite simple: once projected into a scenario, we have to identify the members of the opposing team and eliminate them, or reach their base and conquer it. The double value of the matches, which are therefore both elimination and territorial, increases the variety of possible approaches to the game, which makes the simple strategy a fundamental factor in being able to aspire to victory. Our vehicle is in fact slow and cumbersome to control, just like a real tank, and can have different projectiles or more or less precise turrets depending on the model. The point is to always and in any case exploit not only the strengths of the armored vehicle, but also the characteristics of the map in which we are moving. Are there any cover you can use to avoid getting hit? Of the depressions that can put us in a position to wait for the advance of the enemy and target him from a distance? All these elements must be taken into due consideration, because game over is often a matter of a handful of shots, after which to reuse the tank selected for that mission we will have to wait for it to end or choose another unit and access a new match. The touch control system conveys the philosophy behind the Wargaming product very well, with an analog stick on the left that determines the movement of the vehicle and its rotation, while touching the screen with the right thumb it is possible to freely adjust the view and aim with the turret, in the normal way or by exploiting the magnification offered by binoculars. The impact sensation is not the best, but World of Tanks Blitz is actually more of a simulation than a shooter, proof of which is the fact that it is possible to win a game even without firing a single shot, aiming to conquer the enemy base. In addition to the immediacy of the action, the quality of the net code and a technical sector that lives up to expectations, with a fixed sixty frames per second and great attention to detail (very nice when the carts cut down trees, causing them to fall, for example example), the best part of the game lies in the extensive progression system, which uses virtual currency and experience points to allow us to unlock new technological elements and then, gradually, additional vehicles belonging to the various factions. By subscribing to a premium account (which costs 250 gold coins per day) you can also count on the multiplication of points at the end of each match, so as to reach your goals more quickly. A non-binding interpretation of freemium dynamics, without energy points or expectations, mwhich inevitably rewards users who decide to put their hands on their wallets.", "date": "2014-07-05", "grade": "8.5"}