{"name": "L'evoluzione del classico", "ref": "https://multiplayer.it/recensioni/134359-divinity-original-sin-levoluzione-del-classico.html", "text": "For Larian Studios the new Divinity is a return to the origins, a return to that combination of top-down camera and turn-based combat that characterizes most of the great classics of Western-style RPG. A formula that, among other things, allows you to create great games with a limited budget and this is precisely the case of Divinity: Original Sin, a title financed not by a publisher but by passing through the Kickstarter crowdfunding platform. But the value of the production is visibly higher than the one million dollars that the funding campaign grazed. There aren't, this is true, spectacular movies or complete dubbing but the technical sector, we say it right away, is delightful and in terms of content there is little to complain about. Let's start from the latter, the heart of any self-respecting role-playing game, to try to frame the new effort of Larian Studios. Divinity: Original Sin returns to the origins of the series to renew an entire genre Game for two Sent to the port city Cyseal to investigate the murder of an official, the two protagonists are faced with a dramatic situation that includes mobs of cultists, a terrible plague and the inevitable invasion of orcs. Threats in abundance, in short, which promise to fill the four areas that make up the experience with action and quests. Faced with this, it matters little that the exploration is partially guided, with various unreachable areas, and that the overall extent of the world is not comparable to that shown by the great classics of this genre. What matters is the density of an experience literally crammed with enemies, traps, puzzles, secrets and dungeons. Just to be clear, we are talking about a minimum of 20 hours to complete the Cyseal area alone which represents approximately a quarter of the experience. We can therefore assume that many players will exceed 80 hours of play, none of which spent wandering into thin air or tackling copycat quests often used to fill open world RPGs. And to all this we must add a high replayability guaranteed by the crossroads, the customization of the heroes and the online co-op supported, among others, by an intuitive infrastructure that includes the drop-in drop-out functionality. In all of this, it is natural to wonder why the choice of two main characters with the other possible party members to act as supporting actors. Why not opt for the classic formula, with a protagonist, or extend the cooperative to four players as happens in many RPGs of this genre? The answer may lie in the developers' desire to implement polished interaction mechanics. In fact, the two characters can collaborate to solve the puzzles and both intervene in the dialogues - complete with a mini-game to resolve any disagreements - bringing their own cultural baggage with them. In this way the cooperative gives equal importance to the role of both players. The great wealth One of the main advantages of Divinity: Original Sin, beyond the classic but refined and balanced turn-based combat, is that it is an extremely rich title. The signature Larian Studios recipe includes paradoxes, spells, quests, puzzles, dungeons, elemental resistances, rain, fog, teleporters for fast travel, destructible doors and even numerous secrets. Not to mention the tons of skills, crafting, ability to move objects, attacks of opportunity and a customization made high by the various skills, which can be learned by all characters without restrictions, and by the numerous talents whose effects on the gameplay can be decisive. There is also no shortage of stealth, ambushes, intrigues, thefts, a reputation system and true hardcore RPG mechanics such as the ability to talk to animals and the interaction between elements involving puzzles and spells. Water puts out fire, lightning charges the cloud, fire melts ice and so on up to less trivial and therefore more delicious combinations to discover. And finally there's the editor, which we've talked about in the past, which allows you to create content of similar quality to that created by the developers. In the Larian title there is, in essence, everything that can be asked of a pure and hard role-playing game, one of those that leave their mark. The skills, which include buffs and great area spells, do not consume resources but are divided into those that have a cooldown, usually more powerful, and those that can be used each turn. Furthermore, all characters, even if they have no magical knowledge, can use spells through scrolls and this is an important factor because it allows you to exploitct different elemental interactions at a great distance without having to choose archer or mage. Furthermore, spells are powerful and are therefore useful in combat which is not always easy to deal with. After the tutorial, the level of the monsters skyrockets and a difference of a couple of levels is insurmountable. Fortunately, the quests are numerous and it is good to solve as many as possible, increasing equipment and level, before putting your nose outside the borders of Cyseal. And this is where the more classic and difficult nature of Divinity: Original Sin emerges. In many cases it is necessary to read the diary well to understand where to go and what to do since the system of indicators is very different from that of modern RPGs that lead the player by the hand. But it's definitely worth exploring every nook and cranny of a title that also makes numerous side missions important. Saving a non-player character, for example, could make us meet him as an ally at a later time. A lively and vibrant world The world of Divinity: Original Sin mixes dramatic tones and ironic touches in full Larian Studios style. Stealth, for example, sees the character transform into a boulder (or bush) walking on tiptoe. The effect, needless to say, is decidedly funny but the excellent artistic direction means that the light-hearted animations and the presence of elements such as the rectangular sheep do not clash with gloomy settings and blood-soaked battlefields. Also, as we anticipated, the top view didn't stop Larian from making Divinity: Original Sin a little technical gem. The game world is made of rich colors and is full of characters who talk to each other, move around and run errands. Large differences in level of the land give us suggestive visuals and every magic is accompanied by graphic effects that are not astonishing but of excellent workmanship. The textures are also exquisitely defined, maintain a good quality even when we move the camera closer and, more importantly, they are varied. But it is the vegetation that makes the big voice in the artistic sector. Every blade of grass moves and every plant appears to be made up of hundreds of leaves. It is a technical trick and in some situations the trick is seen, but overall the rendering of bushes, trees and lawns is amazing and goes hand in hand with the excellent dynamic lighting that changes fluidly according to the framed environment. And all this, by the way, can be viewed without any particular problems even on mid-range PCs. But even having to compromise, the atmosphere of the title always remains intense thanks to a veritable avalanche of sound effects. Chirping birds, crackling torches, wind, sea, footsteps, whispers and meows effectively contextualize each environment and increase the sensation of being in a living world. Furthermore, the cries produced by the monsters are heard at a generous distance and this allows us to use our hearing to avoid potentially unpleasant encounters. The dialogues, on the other hand, are devoid of dubbing but the non-player characters pronounce some sentences, dubbed rather well, which make everything much more believable. Less credible, on the other hand, is seeing archers shooting arrows even when they are at a short distance from their target. Furthermore, the rotation of the camera stops after completing a decidedly reduced arc (it is unlockable but causes glitches and artifacts during the campaign) and in many cases it is necessary to use the bird's eye view in order to interact with monsters and objects. To all this we must then add several glitches and a quest diary that is not easy to consult. But the inevitable flaws still fail to overshadow the merits of a rich, long-lived, ironic, suggestive and capable of involving us also thanks to the spot-on soundtrack characterized by a large number of songs. Probably amplitude and propulsive thrust are not comparable to those of titles like Fallout 2. But in a period in which various RPGs of classical inspiration are about to arrive, Divinity: Original Sin not only shines as one of the best productions born from crowdfunding but reassures us by demonstrating that this way of making role-playing games still has a lot to say.", "date": "2014-07-04", "grade": "9.0"}