{"name": "A palla di fuoco", "ref": "https://multiplayer.it/recensioni/134360-storm-casters-a-palla-di-fuoco.html", "text": "Storm Casters is what could be defined as the result of an extramarital relationship between Diablo and a scrolling shooter: from the first it inherits the dungeon setting and some RPG nuances, while from the second the predisposition to action through long-range weapons. All suitably packaged according to the rules of mobile gaming, thus allowing the user immediate use and also suitable for short game remnants. In short, the title Get Set Games (already authors, among others, of Mega Run and Mega Jump) would seem to have all the credentials to be able to emerge in the iOS playful panorama, but let's see if this is really the case ... Gold, monsters and... cards Without getting too lost behind a plot that in any case would have gone immediately into the background, Storm Casters allows the user to choose a male or female alter ego and immediately launch into the exploration of the dungeon that constitutes the game world, designed in a rather intelligent way from the developers of Get Set Games. Each chapter of the adventure is represented by a room with four doors on the sides that lead to a series of randomly generated areas that must be completed before being able to advance to the next block. However, there is a tasty variable that soon reveals itself as the real cornerstone of the experience: crossing one of these thresholds activates a countdown, once which is finished the player is taken back to the main room from where he can start again with a new attempt. A feature that stimulates you to act quickly, forcing you to constantly evaluate whether it is worthwhile to linger in an area for a few seconds longer to collect some treasure or whether to go straight to the next one having more time available to complete the stage. If he fails in his intent, the user is still rewarded by the game, given that every time you return to the initial room the gold and experience points collected in the session are added to the total and you can enjoy the rewards relating to any increase in character level as well as spend part of the assets to improve the power of attacks or increase the amount of time available for subsequent attempts. Thanks to all these precautions, Storm Casters proves to be a pleasant experience, which compensates for the evident repetitiveness of a gameplay that is basically always the same with constant, small gratifications that urge the user to get back into the game immediately after a defeat. Storm Casters won't revolutionize gaming on iOS, but it's an honest and fun title Obviously a good part of the credit must also be given to the actual on-screen action, which as we mentioned at the beginning is more reminiscent of a shooter than an RPG. Being able to count on a top view, the player moves the protagonist using a virtual stick, while casting spells at the enemies simply by pressing a button, with the software automatically taking care of selecting the closest target. There's also a control mode that allows you to manually manage your aim (at the expense of sheer precision), but the main setup works so well that you don't really need to. The basic attack consists of simple fireballs, but by eliminating enemies and destroying crates and barrels it is possible to find a vast series of consumable power-ups which are divided into two categories: there are different types of bombs - to be activated special button and which distribute damage in the area immediately surrounding the main character - and a wide range of spells that are in fact real weapons with limited ammunition. A few games are enough to already glimpse a remarkable variety of offensive means to use at one's discretion, and a convincing system of trading cards intervenes to enrich an already quite full-bodied dish. These can be found in the chests obtained at the end of each level, and each of them guarantees the user a particular bonus: when starting a new mission, three are assigned at random from the deck in one's possession, even if it is possible to spend gold to get a new selection. Another arrow in Storm Casters' bow is that, despite having a budget price, it absolutely does not exceed the odious practice of wild in-app purchases, limiting itself to offering a shop in which to buy magic stones useful for unlocking new and more rare card sets. The only real defects of the Get Set Games production are an evident repetitiveness in the settings and enemies (including the bosses who tend to offer a very anonymous design and attack patterns that are too similar to each other) and a technical sector that is anything butand exciting, with just average graphics and sound that only does the homework.", "date": "2014-07-04", "grade": "8.2"}