{"name": "Impariamo a disegnare con Pikachu", "ref": "https://multiplayer.it/recensioni/134311-pokemon-art-academy-impariamo-a-disegnare-con-pikachu.html", "text": "Born as a spin-off of the official series developed by Headstrong Games, Pokmon Art Academy is the kind of title on which you wouldn't bet a single penny. Even we started it off with a raised eyebrow, expecting a hastily developed, mediocre product that was sure to sell on the strength of the name. Instead, we have discovered a worthy heir to the franchise born in 2009 on DSiWare, which is not necessarily aimed at the little ones, but at anyone who wants to have fun drawing and learn some surprising tricks along the way. Pokmon Art Academy is not a simple spin-off for children, but a small compendium suitable for everyone Gonna draw'em all! New academy, new mentor: in this case his name is Leonardo and he is the brother of Raphael, the ninja turtle. No, joke: we are obviously referring to the director of the previous Art Academy. Leonardo will guide us step by step in the various courses designed to teach us how to draw pokmon and, together with a funny and clumsy classmate, will offer us a large dose of dialogues designed to make the experience as least alienating as possible. The expedient works, also because Leonardo will not fail to tell us some details or curiosities about the life of the pokmon that we are going to draw, a bit like a human PokDex: Pokmon fans will immediately feel at ease, and if it is true that these ~fun facts~ leave the time they find, on the other hand they serve to break the monotony of a sterile school lesson by offering the little ones one more reason to commit themselves to their works. From this point of view, Pokmon Art Academy does a surprisingly organic job, while remaining faithful to the spirit of Game Freak's intellectual property. At the beginning, for example, we will have to choose which pokmon to start our course with, mimicking the choice of the ~starter~ in the real RPGs of the series: Pikachu, Piplup or Froakie, in this case, but the completion of each compulsory lesson unlocks other pokmon to draw, slowly filling our catalog as if it were a real PokDex with dozens and dozens of little monsters to draw in all sorts of ways. For older or more experienced artists, the first steps could be quite tedious, since Pokmon Art Academy doesn't joke when it wants to start from the basics: we start by tracing simple close-ups of the most essential-looking pokmon such as Piplup, a set of circles and sharp colors. Every new step, even the simplest, is explained in detail by Leonardo, and we have no doubt that many players will skip the most obvious ones. In reality it is only the beginning, in every sense, because each of the over forty lessons, divided into three courses of increasing difficulty, always teaches how to employ a new technique, to use a new tool, to draw something in a certain way, offering us a simple and clear explanation of its usefulness. So we start from close-ups, but we soon move on to three-quarters and whole figures, nuances and reflections, and so on. Little artists grow up It is possible that some lessons appear a bit obvious and that others perhaps seem excessively simplistic, but the most interesting detail of Pokmon Art Academy is perhaps precisely this: it manages to find an excellent balance that brings together every type of player, from the child learning to color to the adult who just wants to have fun for a few hours. The compulsory lessons are then alternated with more complex and optional ~challenges~ that will allow us to put aside any help and try our hand at increasingly complicated illustrations. In the end, our works can be framed in a kind of card - which we also proceeded to sign at the beginning of the game - and then printed on paper or published on social networks via the sharing menu integrated in the software. The interface is clear and clean, even if sometimes a little less responsive but mostly by choice; this is the case of the tool case, for example, which must be opened and closed each time as if to simulate the opening and closing of a real case or drawer from which we want to draw a new felt-tip pen or eraser. In any case, Headstrong Games has also thought of integrating some new features into this iteration of Art Academy that we hope to see in future editions of the series: one of these, for example, is the ability to press the L and R back buttons to Undo o Repeat, respectively, an action. In this way it is possible to manipulate our last hatches in an instant, without resorting to rubbers or other tools that could further compromise our work. From one parte it is a great idea that modernizes the software; on the other, however, it is not always very practical due to the sensitivity of the two keys and the frequent need to rotate the entire console to adapt the ~palette~ to our outlines. We take the opportunity to point out that we have played Pokmon Art Academy on Nintendo 3DS XL: needless to say that the larger screen has been a real godsend, even if it remains perhaps a little too small for adult hands. For a child, on the other hand, it will be absolutely perfect.", "date": "2014-07-03", "grade": "8.0"}