{"name": "Transformers: The Dark Spark", "ref": "https://multiplayer.it/recensioni/134183-transformers-the-dark-spark-less-than-meets-the-eye.html", "text": "With the Transformers: The Dark Spark campaign complete, we had a few questions. First, has the franchise sold enough so far to justify Activision's investment? The first episodes have approached the million copies sold, which could be considered a good result for a series that is all in all young, with not exorbitant production costs. So why was the development of this new chapter, which we could consider a sort of cinematic tie-in medium, entrusted to Edge of Reality instead of the usual High Moon Studios? Here the matter thickens, because it seems that the Californian studio is currently working on the Xbox 360 and PlayStation 3 versions of Call of Duty: Advanced Warfare and not, as fans had hoped, on a Playstation 4 and Xbox One edition of Transformers. Considering that High Moon Studios is not Naughty Dog, it seems unlikely that one half of the team is secretly planning a return in a big way for Optimus Prime and his faithful Autobots. In short, the chances that The Dark Spark is a momentary ~filler~ like Batman: Arkham Origins was (which, moreover, was excellent as a filler: to have it like this!) are few and there is great uncertainty about what will be the future of a franchise on which no one bet on in 2010, but which has shown instead that it knows how to best interpret the spirit of the transformable robots that Hasbro decided to import into the USA in the early 1980s, following an intuition that later proved to be a success planetary. Transformers: The Dark Spark disappoints the expectations of fans of the series after two excellent episodes In the good... The Transformers: The Dark Spark campaign has a great central part, and we say that in all honesty. The intermediate levels, which in view of the peculiar plot based on space-time passages take place on Cybertron, therefore with the Autobots and Decepticons redesigned by High Moon Studios, are the most engaging, those with a higher challenge rate and in which the possibility of transforming from robot to vehicle makes real sense instead of being a mere option. In fact, there are stages that develop vertically and therefore require that one transforms into a spaceship to reach the destination of the turn, such as when we control the glacial Shockwave (which here becomes a spaceship, not a gun) or the leader of the Insecticons, Sharpshots. Or even when, at the commands of Jetfire, we are asked to cross the internal structure of the Trypticon carcass, full of traps and ambushes. As has already happened in the past, in short, we find ourselves both on the side of the Autobots and on that of the Decepticons, depending on the moment, and there is no shortage of spectacular sequences for fans of the series, such as when we can control the enormous Bruticus and make a clean sweep of the ~minions~ who make up the bulk of their respective armies; or when, in one of the last levels, we are allowed to vent our desire for devastation in the robotic guise of Grimlock, although it is the film version of the character, therefore more of a dragon than a tyrannosaurus. We have just mentioned the degree of challenge, which at the normal difficulty level is surprisingly high and quickly changes the mind of those who expected a very simple, even banal action game. There is no ambush system and you have to make the most of the shelters (almost all destructible, in any case), but launching yourself head down during a firefight translates into a game over in most cases and having to start over from the last one checkpoint, with a view to a system unwilling to reward this type of approach. In some situations, moreover, the checkpoints are quite spaced out and it is therefore necessary to proceed with all the calm and precision possible in order not to have to repeat a generous portion of the game. A further positive aspect of this production are the weapons, capable of giving great satisfaction. The ~melee cannon,~ for example, blasts enemies to pieces which is a beauty, but there's no shortage of trigger-operated grenade launchers, sniper rifles, machine guns of various kinds, surprisingly powerful pistols, blade-shooting devices, and more still, framed in a context which, however, at first, does not appear particularly intuitive and which exploits the unlocking of new objects and extra equipment in the worst possible way, in the form of boxes that must be opened from the pause menu, breaking the rhythm of the action . Xbox 360 goals If nothing else, the Objectives present in Transformers: The Dark Spark are quite multifaceted and range a bit in all fields of experience. To obtain them, in fact, it is necessary to complete a certain number of eliminations with each arma, collect objects and complete gameplay sequences without making mistakes, for example when, with Optimus Prime, we have to penetrate a Decepticon outpost trying not to get caught by laser detectors. Part of the achievements are then dedicated to the Escalation mode. ...and in the bad Dutifully listed what are the merits of Transformers: The Dark Spark, let's see instead why this episode developed by Edge of Reality is substantially below the two chapters edited by High Moon Studios. In the first place it is a matter of content: the competitive online multiplayer has been completely removed, leaving only the cooperative mode Escalation, which is nothing new, the task of increasing the duration of the entertainment once the fourteen levels of the campaign have been completed , which can only be played in single player. The campaign itself, as explained above, boasts a thick central phase but appears decidedly scarce in the initial and final parts, not surprisingly the stages set in the filmic present, with Optimus Prime and all the others characterized by ~ hodgepodge~ which earned Michael Bay a place of honor in the worldwide ranking of curses by fans of the original Transformers. In fact, if in such situations a solid gunplay is not lacking, with the weapons that often and willingly run out of ammunition, forcing us to change them as soon as possible or to desperately look for supplies around the locations, it is the level design that collapses. Both as regards the planning of the scenarios and their technical realization, terribly ~old gen~ even on Xbox 360; let alone on PC, PlayStation 4 and Xbox One, which apparently suffer particularly from the cross-gen nature of this tie-in. It is not only the polygonal count that fails, there are also rather evident drops in frame rates (especially during the first moments of each mission) and textures that in some cases are literally unwatchable (see the Megatron model on Cybertron ... so full of pixels to look like a joke). We also ran into two or three rather serious bugs, which forced us to reload the last checkpoint because a certain event did not occur and the action could therefore not continue. The sound sector can count on a good dubbing in English, with some actors from the film, but the fact that during the dialogues the general audio is lowered is a choice that we frankly do not agree with and which undermines the involvement of certain action sequences .", "date": "2014-07-01", "grade": "5.0"}