{"name": "Il coraggio nel cuore", "ref": "https://multiplayer.it/recensioni/134034-valiant-hearts-the-great-war-il-coraggio-nel-cuore.html", "text": "It is now evident how Ubisoft has taken the hand with its recent digital projects: almost visual experiments that, in some way, try to imitate the most famous indie productions, throwing triple A production values into the pile. And at the same time it is undoubtedly that the framework developed by the Montpellier division of the French publisher, that UbiArt which makes every project that uses it immediately recognizable, is giving results that go beyond the wildest expectations. And so, if it all started with Rayman Origins and Legends, two daring platformers in their belonging to a very classic genre, the drift taken by the software house soon made it possible to aim for even more imaginative and original products. In April it was the turn of Child of Light, an appreciated RPG with a highly sought-after artistic style and gameplay that offered an interesting mix of turn-based and real-time, in an attempt to get closer to the typical elements of jRPGs. And today it's time to talk about Valiant Hearts: The Great War, a sad and melancholic adventure with a cartoonish caricature design, which relies entirely on a very fascinating historical scenario that is rarely seen in video games. Perhaps so fascinating as to be even overwhelming compared to the all too basic gameplay of this project. Follow us and we will explain why. A touching and melancholy graphic adventure but perhaps too basic in gameplay: here is Valiant Hearts History teaches The plot of Valiant Hearts unfolds through four different chapters that use the background of the atrocious years of the First World War, from its outbreak following the assassination of the Habsburg Archduke Franz Ferdinand until Canada's entry into the conflict, a few months since the defeat of Germany. Some historical battles are actually relived during the unfolding of the events of Valiant Hearts, such as the German advance on the Marne, the battle of Ypres or the attempt to liberate Neuve-Chapelle but due to the peculiar gameplay of this game, the historical setting is limits to stimulate in the player specific feelings of sadness, melancholy and unhappiness for the terror that unleashed on Europe during the five long years of war rather than having concrete consequences on the game action. From this point of view, Ubisoft's ability to bind what happens on the screen to what happened historically between 1914 and 1918 is absolutely to be commended, maintaining the originality of a fictional story that is grafted onto real events . The precise will of the French publisher to teach something to those who decide to play Valiant Hearts is also clearly evident from the collaboration with the foundation currently grappling with the hundredth anniversary of the Great War and which has made it possible to fill the game with collectibles and historical documents of great value both for the most forgetful and for those who have yet to study this terrible page in the history of humanity. The narrative arc develops through the events involving four different characters, each with its own specific purpose that will lead him to take part in the world war, whose lives will meet and will be held together by a common thread represented by a lively and resistant rescue dog that cannot be controlled directly by the player but will accompany him for most of the adventure. Emile, Freddie and Anna will be deployed on the side of the allies, in order a Frenchman, an American and a Belgian, while Karl is of German origins and his recall to the axis forces will make him the narrative device for the start of the game. Emile and Karl are in fact directly linked from the beginning, the second is the son-in-law of the first, while the others will become part of the cast for some vicissitudes that we don't want to risk revealing to you. In the four chapters that make up Valiant Hearts, each consisting of seven levels with the exception of the last, slightly shorter, we will learn to know them, to become attached to them, to discover the reasons that forced them to get involved in the tragic conflict; we will be passionate about their stories and will inevitably be connected to the faithful dog who will see them sad, injured, tired and exhausted during the abundant four hours it took us to complete the game. And also in this case we feel like praising Ubisoft's ability to propose an ending that we found extremely touching and spot on without falling into cunning carelessness or obvious moments. Playstation 4 trophies Valiant Hearts: The Great War contains twenty trophies, almost all of them bronze and more than half, eleven to be exact, secrets. The unlockables are largely aboutpeculiar moments of the story, but also small actions that can be carried out by being very attentive to what is happening on the screen, such as completing at least one mission aboard vehicles without ever being hit or saving the entire platoon during the battle of the Sum. Another small handful of trophies concerns the collection of collectibles and the reading of historical facts. The only silver trophy is directly linked to completing the game. But is everything good then? Unfortunately, however, as it should be, Valiant Hearts is first and foremost a video game and not (or in any case not only) a beautiful story told and drawn. And here we can glimpse the main flaws afflicting this production. As mentioned at the beginning of the article, the title is an adventure, indeed we could go further and say that it is to all intents and purposes a point and click adventure. Within each scenario we will be able to move our protagonist horizontally, sometimes crossing doors and windows to access other levels of parallax and within the path we will have to deal with a whole series of puzzles to solve in order to proceed. In the vast majority of cases, these are environmental puzzles that involve the recovery of a certain object from a point in the scenario or from a non-player character and its interaction with the environment itself or with another NPC. In more sporadic cases we will have to limit ourselves to moving levers and wheels to match pieces of some gear or to open doors and trapdoors. There are also small more action sections where we will have to limit ourselves to dodging grenades and machine gun shots by taking advantage of the right timing, stealth phases where we will have to hide from the sight of the enemy on patrol and also sequences where, aboard vehicles, we will have to avoid obstacles that are outside the screen and which are signaled to us by special indicators. Each of the characters then has a sort of special ability that complements the rather basic commands of movement, melee and throwing objects. For example, Freddie is able to cut fences and barbed wire, while Emile can dig holes and tunnels. Finally, Anna, the nurse, can treat the wounded through a small mini-game dedicated to quick time events. The problem is all concentrated precisely on this gameplay which proves to be too basic and excessively repetitive in the actions that are proposed to the player. Too often we will find ourselves going back and forth having in mind what we have to do to complete the scenario but having to spend our time jamming levers or dodging shadows of grenades that arrive from the sky. And the deviations on the theme mentioned above are of little use, such as the particular fugue sequences in time to music while driving a vehicle, described above. Fortunately, there is the story and the desire to see how the events of the characters will end up stimulating us to move forward, certainly not a gameplay that has already said practically everything after the first hour of play. In this regard, the figure of Anna is exemplary, who manages to occupy an entire chapter forcing us to deal with a truly excessive number of absolutely useless and redundant QTEs which, if nothing else, are rather permissive and allow us to make mistakes repeatedly without serious consequences. Let it be clear that the length of the experience is perfectly calibrated in the end and you never want to give up the game or get bored but there is no doubt that the weakest side of the whole production is just a gameplay that fails in any way to amaze or entertain the player. Someone will perhaps see some similarities with the most recent productions of TellTale Games, The Walking Dead and A Wolf Among Us above all, but in reality these have extremely complex dialogues and above all a freedom of choice given to the player which has tangible consequences on the continuation of the story, when instead Valiant Hearts ~limits~ itself to bringing an extremely linear plot to the screen and offering basic interactions to those who have the pad, or mouse in hand. Where the Ubisoft product cannot be criticized is in the artistic component. The rendering granted by the UbiArt Framework has allowed the creatives of the French software house to indulge themselves with a particularly inspired design that manages to bring all the horrors of the Great War to the screen but also the joy and satisfaction of those who manage to find a family member or bring completed a particularly onerous mission. The colors mix, they continuously pass from bright tones to a much darker palette and in the background we see a Paris first in celebration then torn apart by bombing, kilometersre of trenches and tunnels dug underground, lush countryside and swamps made deadly by the chemical weapons of the Germans. What we see moving before our eyes is the perfect mix of a cartoon with a comic: transitions, intersecting boxes and lots of balloons to identify the actions we have to take or what the characters say to each other on the screen. All this is combined with an excellent audio sector with a particularly inspired dubbing entirely in Italian, sound effects that manage to involve the player and above all a soundtrack that ranges from well-known pieces of classical music to absolutely original but extremely catchy songs, such as splendid main theme, and able to immediately immerse the player in the melancholy and bittersweet atmosphere of this production.", "date": "2014-06-27", "grade": "8.0"}