{"name": "The Sims 2", "ref": "https://multiplayer.it/recensioni/the-sims-2_b.html", "text": "Sim life It all begins when our alter ego, specially edited and built by us, ends up in a steppe and desert town called Stranizia, with the car breaking down and a great desire to leave the tents as soon as possible. He runs into a ramshackle hotel left a little too much to himself, then the first sims to interact with. It helps dude and dude with simple quests to complete, then the inevitable: the mayor sees the light in us, and rolling his eyes, he entrusts us with the management of the mephitic hotel, instructing us to bring it and the town itself back to the original splendor. Thus began our entrepreneurial activity, with one room to manage, others to build and a rather rigid series of things to do. We will have to collect energy bars, mysteriously present in the building, in order to give electricity to the whole building, which will then logically be cleaned and enlarged. At the first building permit, the one for scaffolding a new room, we realize a rather strange choice on the part of the developers. Eight hours to build the new chamber, this is said after having paid good money to obtain municipal approval. Eight real hours, not virtual! Anyone who knows the series knows how time management - incidentally the possibility of speeding it up, slowing it down or even stopping it - is the fulcrum element of the game, where the player's ability lies precisely in the ability to carry out each task in that period of time it's virtual day. The choice of the coders to adapt the game to the internal clock of the console would make sense from the point of view of a title often projected over a long distance, but thus it has very little game to play, finding the first real enemy in linearity. The possibility of choice is reduced to a minimum, and consequently the variety of things to do. The same needs of the alter ego, usually divided into several bars depicting the primary physical, hygienic and mental conditions, in this DS version are all enclosed in a single bar called lucidity. Ergo taking a shower rather than a nap, or eating rather than doing the needs, will not make any difference, since everything will affect that single bar depicting the character. The growth of the professional qualities of the sim we created is also given to chance, which if in the original they increased by carrying out one activity rather than another, here they increase thanks to icons found randomly in the darkest meanders of the hotel. The choice of the coders to adapt the game to the internal clock of the console would make sense from the point of view of a title often projected over a long distance, but thus it has very little game to play, finding the first real enemy in linearity. The nerve center of the saga, as we know, is the interaction with those slightly sirocco npc called sims. Often times throughout the game we will be called to interact with the characters that we will gradually meet. It is important to always keep the opinion of customers high towards us, and this implies rather frequent interactions, even if not requested. In fact, it often happens to meet NPCs with an unstable mood, perhaps sad after a disappointment in love or simply angry with a bad mood. In fact, it often happens to meet NPCs with an unstable mood, perhaps sad after a disappointment in love or simply angry with a bad mood. Our interventions become fundamental to quell the various issues, which to be carried out will require access to a special tactile screen in which to respond to the attitudes of the sim on duty by choosing from three possibilities. Too bad that in the long run this concept becomes more of a mnemonic issue than anything else, simply having to associate the appropriate response to a given animation. Technically the Maxis bandwagon proceeds much better than what we have seen so far. Good polygonal constructions alternate with varied and well-finished animations, effective transparencies and well-balanced colours. Just a shame for a rather low quality of the textures, definitely too grainy. Praise sound made up of the inevitable slang of the sims, which has always been the identification mark of the saga, and carefree and always fitting instrumental tunes. Comment Difficult not to feel the most classic of aftertastes, a rather balanced mix of disappointment and bitterness that remains in the mouth for the entire game session with this portable version of The Sims 2. On the handsome double Nintendo screen, the important Maxis title looks even more disfigured of an occasion, and it is still not clear whether the path taken by the coders was more comfortable or simply courageous. Probably a little of both, but the end result leaves something to be desired. Ultimately it remains a gamepleasant to 'play around' during coffee breaks and nothing more, which in any case is far from any thick footprint. Lovers of the saga, whether in PC or console format, will hardly appreciate this game, which absurdly offers itself as a valid thought harp for all those who know the name of The Sims just right. Pro Carefree. Technically not bad. Cons Simplified to a minimum. Linear. Some developer choices are really difficult to interpret. It could be called anything else... Two words to describe the work that Maxis has done in recent years with his masterpiece saga? Pure inspiration. For years we have toyed with The Sims and its innumerable expansions, to then see it worthily transported to the current generation of home consoles, up to the highly anticipated and incomparable second episode released last year on PC. The Sims 2 precisely, which at the dawn of the fundamental Christmas season also appears on home consoles and, drum roll, also on the never too praised double screen Nintendo. Try to think of the infinite implications that the DS touch screen could have in a context such as the Maxis management system. Of course, there are hardware limitations, and it is undisputed that it is not possible to bring the amount of data that distinguishes the PC version to the small two-screen laptop. However, it is undeniable that the hope of a well-calibrated management system with a high depth lay in the heart of all lovers of the game and of the console in question. We speak in the past tense, have you noticed?", "date": "2005-12-12", "grade": null}