{"name": "Entwined", "ref": "https://multiplayer.it/recensioni/133608-entwined-il-pesce-innamorato.html", "text": "Two kindred souls, one in love with the other, who however cannot be together because they belong to different worlds. It is a theme addressed several times by cinema and literature (we can mention the film ~Ladyhawke~, for example) and which, in the case of Entwined, draws on an ancient Chinese legend. The protagonists of the game developed by Pixelopus for PlayStation 4 are in fact a bird and a fish who, over the course of nine ~lives~, must overcome a series of obstacles in order to be together. In short, a real metaphor made into a video game, which promised wonders in terms of atmosphere and visual impact thanks to the curriculum of its authors, all belonging to the artistic academic world. We therefore approached Entwined not without a certain expectation, but after just over an hour - the time necessary to complete the story mode - the initial enthusiasm had been replaced by a burning sense of disappointment. Why? Basically we were faced with the classic unfulfilled promise, playfully very poor and unable to rise even in those aspects on which the most was aimed. We are clearly referring to the artistic element, understood as the ability to amaze by proposing a sequence of evocative images, perhaps accompanied by music capable of touching certain chords. But let's proceed in order... Entwined disappoints in what should have been its prerogatives, namely the artistic figure and style The perfect storm The gameplay of Entwined refers to the classic Tempest, with a traditional ~tunnel~ which, in the case of the Pixelopus title, however, can only be traversed in half by the fish and the bird, characters separated by an invisible wall in the center of the display and controlled by the respective analog sticks of the DualShock 4. By keeping the sticks constantly pulled outwards (a solicitation that we do not believe is good for the health of the controller), our task in the game is to move the two mythological animals, each along its own half of the screen, drawing arcs and thus trying to hit colored ~slices~ (and, optionally, collect luminous spheres) to raise the double indicator located at the top of the interface. Once full, the bar allows you to take a further step: speed up the action (by pressing the back keys) and ring other ~centers~ to get to the end of the stage, where the bird and the fish merge into a single creature , they enter a sort of open space and have to collect luminous spheres to fill yet another indicator (the third), an operation at the end of which it is possible to freely draw stripes in the sky and thus call up a portal that leads us to the next level. In Entwined you don't shoot like in Tempest, the experience is based exclusively on promptness and a minimum of coordination, given that in the more advanced stages the ~slices~ that flow towards us do not have a symmetrical connotation and therefore require independent movements right and left thumb. There is no concept of game over, or at least so it seems, given that the lack of impact with the objects produces nothing but an emptying of the bar and an extension of the game, which can therefore last even several minutes if you are unable to ring the movements required, especially during the final sprint, with obvious repercussions in terms of frustration. Playstation 4 trophies There are fourteen Trophies made available to Entwined, and obtaining them is a rather simple operation: just complete all the levels, or the ~lives~, and the skill challenges that constitute the alternative to the story mode. Only two Trophies require additional work, such as making the encounter between fish and bird happen two hundred times or getting a score above 300 in any stage. Was it true glory? As already mentioned, the nine levels that make up the Entwined campaign can be completed in just over an hour, then leaving the task of entertaining us further to the extra challenges alone. In fact, it is precisely the challenges that manage to put a few more stimuli into play, asking us to reach certain scores in view of particular situations, and testing our reflexes, but in general the offer of the Pixelopus title seemed too much to us poor and devoid of bite. Even more so if we consider what the expectations were, because after the presentation at E3 probably everyone had thought of a visual experience along the lines of Journey, then finding themselves faced with a show that was very, very distant from the style and narrative quality of the adventure by thatgamecompany. So this is Entwined's biggest problem: nonor the simplicity of the gameplay (a factor which, if desired, could also have been there) nor the excessive brevity (a feature also common to the aforementioned Journey), but rather the fact that these aspects of the product do not find a justification in the artistic dimension. The graphics of the game are too bare, decidedly old gen, and some chromatically harmonious backgrounds are contrasted with compositions that leave something to be desired from a stylistic point of view. The scrolling of the ~tunnel~ also becomes the protagonist, after a while, of an annoying ~click~ which probably serves to restore the loop but which, in addition to being ugly to look at, causes unwanted errors in the positioning of the characters. Then when the duct ends and we pass to the open scenario, the latter often presents itself as an anonymous jumble of invisible elements and walls that make one think of everything except a work of art. And the music that accompanies us on this journey is disappointing in its composition, completing the picture of a technical sector that is far, far below expectations.", "date": "2014-06-19", "grade": "5.0"}