{"name": "Lifeless Planet", "ref": "https://multiplayer.it/recensioni/133542-lifeless-planet-senza-vita-davvero.html", "text": "Sin. Trying the first part of Lifeless Planet in the early access version we fell in love with it. Slow and reflective pace, minimal interface, sense of total bewilderment, intriguing plot with many possible philosophical implications, simple but diversified puzzles and a certain aesthetic taste in being able to wisely and artistically exploit the few means available (the developer Stage 2 Studios is formed by a single person). In short, we expected great things from the final version, which promised many other scenarios and the conclusion of the story left hanging in front of an immense alien door to be opened by entering a code, easily decipherable by trial and error, using a newly found mechanical arm. Here, let's start right from the mechanical arm to reconstruct the reasons for our final judgment, certainly not flattering. In the early access version, it was found in the last part, that is, before being postponed to a later date in order to continue. It was used to solve two puzzles, very different from each other: the first required to grab an energy sphere and place it in a sort of generator, the second is the one we have already mentioned, i.e. the code to be entered on an alien door by pressing sequentially of some buttons. Our idea, then, was that they were two introductory puzzles, useful for preparing for more complicated situations. Unfortunately, after finishing Lifeless Planet, we can say that this is not the case. Yes, in the rest of the adventure there are other puzzles that require the use of the mechanical arm, but they are identical to the two described above. Not similar, just the same. The only variations are the distance of the energy balls from the generators in the first type of puzzle, requiring longer walks, and a different code to enter to open other doors identical to those in the second type of puzzle. However, it is not only the mechanical arm that has been underexploited, because all the other puzzles experienced in the first part of the game also return identical to themselves in the second. Reading our review, it seems that Lifeless Planet ran out of oxygen before concluding From the universal to the banal The only novelty of the second part of Lifeless Planet is the encounter with some alien creatures of a vegetable nature, which can kill us instantly if we come into contact with them. In reality there are various types, some of which are non-hostile that will help us overcome some obstacles, acting as walkways or real platforms. So the problem is repeatability? No, or at least not entirely. If the developer of Lifeless Planet had managed to maintain the same narrative level of the first part up to the end, not dispersing the charm of what was narrated in false explanations, which lock the initial vision in a cage of banality, we would have gladly overlooked everything else . Unfortunately this is not the case and, indeed, the biggest disappointments come from what was the strong point of the game for everyone. The desolate and distant planet, whose terrestrial occupants were exterminated by a mysterious force, becomes a kind of ecological parable on the limits of human ambition. The sense evoked by the use of Cold War iconography is almost lost in thin air, engulfed by a medium-sized science fiction story, in which a few short dreamlike sequences create unbearable frictions. When you understand what happened, you almost want to stop reading the documents scattered around the maps, so as to remain anchored to the illusion of being inside something significant. Passino transitions between scenarios cut with a hatchet, connections simply wrong and ungrammatical; pass the many platforming sections, which I'm not sure why you wanted to love Lifeless Planet; but the waste of such a monumental vision cannot really be tolerated. Yet it would have been enough to follow in the footsteps of a small masterpiece like Monument Valley, in which the story is told by a few sentences spoken at precise moments and the traces of the events that precede the adventure can be found not so much in the verbal narrative as in the multiplicity of cultural connections activated by having plundered with full hands and re-reading Escher's work in a playful sense. Lifeless Planet does exactly the opposite: from opening up to the indefinite and unknowable of the first part, which reminded many, at this point improperly, of the final sequence of 2001 A Space Odyssey, one ends up confronting a bagatelle between species in the second, where the only hope is the classic ~middle way~, born from the encounter of two immensely distant cultures. That's all? Moreit goes on, plus the question ~is that all?~ it takes on an unbearable force, the more the beautiful scenery loses its weight in the playful economy, leaving ample room for the desire to put an end to the adventure, which also drags it out for long. We go from one platform phase to another hoping that each jump is the last and that we finally arrive at the inevitable and very phoned conclusion, clear well before revealing ourselves (we won't tell you anything, don't worry). The puzzles repeat themselves, some settings fail their purpose (was there really a need for the fiery moor?) and every difficulty, albeit rare, is experienced as a burden rather than a challenge. We could go on to tell you that changed the point of view on the game, much of what was tolerable, is no longer. For example, one wonders what the sequences in which we are threatened by running out of oxygen are for, given that they always occur in predetermined points with reserve cylinders nearby, always clearly visible from a distance. Once is fine, but the second, third and fourth? By now we have understood that in the other phases the oxygen will never run out. The same goes for the extreme platform sections with the jetpack, where you have to use a special fuel to reach very distant platforms. How come the aforementioned fuel always runs out at predetermined points? Couldn't we think of something more gradual? They are certainly the best moments from a playful point of view, but in the long run it is understood that they do not add much or, at least, end up being limited in power by the linearity of the levels. Wouldn't it have been better to exploit the advanced functions of the jetpack in more open levels, perhaps by interweaving the various puzzles a bit, including oxygen? Unfortunately the developer has decided otherwise and we just have to take note of it, as we just have to take note that what could have been a great game finally turned out to be a mediocre product.", "date": "2014-06-18", "grade": "5.0"}