{"name": "I cavalieri del re", "ref": "https://multiplayer.it/recensioni/132873-rival-knights-i-cavalieri-del-re.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. How long has it been since we last tried a medieval jousting simulator? It might seem like a joking question, but in reality there is an answer: more or less eight months, or rather from the release of Joust Legend for iOS devices. In fact, the title developed by Rebellion put us in the role of a knight committed to earning money and glory in increasingly difficult tournaments, in which from time to time two contenders had to challenge each other on the saddle of their horse, shouldering long lances that would then attempted to jab into each other's armor to achieve victory. An interesting but controversial project, given that the gameplay was based exclusively on timing, i.e. you had to stop an indicator at the right time to determine the starting point of the charge and the area of the body to hit. A little bit to guarantee lasting entertainment, and in fact the Joust Legend experience quickly exhausted its charm, weakened moreover by a fairly limiting freemium connotation. Gameloft, we say it right away, wanted to throw down its gauntlet and try its hand at this particular action sub-genre starting from a very similar idea, certainly supported by respectable numbers (150 missions for five ~houses~, each defended by as many bosses ) but stringent in its attempts to monetize and even less multifaceted when it comes to gameplay. Let us try to address the two topics in a slightly clearer way. To play a game with Rival Knights you need to ~spend~ a seal, i.e. the traditional ~action energy~ which however, thanks to the brevity of the duels, ends up running out very quickly, leaving us waiting for relatively quick recharges (about five minutes for seal) or asking us to use hard currency (diamonds) to restore energy and get back into action. In short, a limiting approach that is also applied to online multiplayer, which we would define as ~asynchronous~ but which in reality is simply based on user statistics to set up a semblance of a real duel. Rival Knights is a medieval jousting simulator that is very nice to look at, but not so nice to play They kill more sword stats So we come to the question of gameplay. Rival Knights basically plays like a drag racer, only in this case on screen, in portrait mode, it's the rider lashing the horse rather than a driver shifting the gears of his muscle car. You have to touch the touch screen at the end of a countdown (small note: you have to do it in advance because the timing is obviously wrong) to start, then touch it again when the ~laps~ indicator reaches the green area. When we have reached the final speed, we will then be asked to move the spear to aim at a precise point of the enemy's armor, with a view to a dynamic but not a static situation, therefore certainly not very easy to manage. The real problem is that even by completing all the steps listed above perfectly, we can still lose the duel because our attack, defense and mount power statistics are lower than those of the opponent. Then the grinding necessary to buy new weapons, new armor, new horses or upgrade the equipment in our possession comes into play, following the freemium canons that we know well and of which Gameloft developers are certainly experts. The campaign is very long and there is also a pinch of variety, given that the standard challenges are contrasted with mini-tournaments to the best of three rounds, achievement-based races and sessions in which we are asked to fight using borrowed objects, but the excessive limits and the repetitiveness of the gameplay, in addition to the constraints imposed by the seals and the need to monetize, soon make the experience dull and of little significance. It's a real shame, because an excellent job has been done on the technical implementation front, with the polygonal models of the riders and horses full of details and well animated, spectacular bullet time sequences that emphasize the shots scored, evocative settings and full of details, even enriched by a variable weather.", "date": "2014-06-07", "grade": "6.5"}