{"name": "Trauma infantile", "ref": "https://multiplayer.it/recensioni/132833-among-the-sleep-trauma-infantile.html", "text": "Being two sucks. Everything is too big, the distances are excessive for our shaky progress and in fact we don't understand a damn thing about what is happening around us. But we can crawl under a bedside table to escape the clutches of a horrible monster that is hunting us. And then we have a creepy bear that talks to us. In short, all the elements are there for a horror game like we have never experienced before. And from this point of view Among the Sleep keeps the promises made to backers when it was still a project seeking funds on Kickstarter. The child's point of view is unsettling and the atmosphere saturated with anguish. The mini-plot develops around a strong theme, easily understood even before you get halfway through the game, and there are moments when knowing that someone is behind us and is chasing us makes our hearts beat faster, above all because , as happens when you are a child, turning around means going towards certain death. We can only run on all fours hoping to slip into a hole before big black hands grab us. These moments of tension are enhanced by image distortion accompanied by ominous noises. And the monster that torments us is the perfect incarnation of a childhood nightmare. But in the scarce three hours that the game lasts there are sporadic heartbeats which, left alone to support the action, highlight the emptiness that surrounds it. Among the Sleep explores an unusual point of view full of possibilities for the horror genre, but keeps it on the surface, betting everything on the strength of the idea. Like the facades of houses reproduced in film studios, once you cross the threshold you discover that this was the edge of the world. But if you want to experience seeing the world from an unusual perspective and experience fear from the point of view of a two year old, then you will get what you paid for. But don't expect to go further, because there is no game beyond it. Among the Sleep puts us in the shoes of a child running away from his fears. It works, but there's little else We thought it was fun to be two years old The introduction is impressive. We're sitting like awkward pacified brats in the high chair, with mum feeding us. Then someone knocks at the door, an unwelcome visit, which the player easily frames. But what effect does it have on the little protagonist? We soon find out, because after the cake we go to bed with the promise that, when we wake up, we will be able to play all day with the teddy bear that our mother gave us. When we open our eyes, however, it's still dark, and a scary creature snatches our beloved soft toy from the cot. No trace of our mother. The first part of the game is an exploration of the house similar to the one we saw in the demo. Bluish tints dominate the rooms, while noises seem to play with us, keeping us on the alert. The teddy bear, once recovered, climbs onto our shoulders and becomes an electric battery. Just hug it to see a light appear. As a metaphor it may be simple but it is very effective, as is the fact that the child covers his eyes with his hands before the main menu appears. Up to here the interest in the game is very high and rises again when we reach a kind of crossroads between worlds, where we pass from the horror setting to that of the dark fairy tale. Unfortunately, the four dreamlike journeys that follow the prologue soon turn out to be meager and tedious, a repetition of simple actions already experienced in the first half hour of the game. We have to push small objects to get on them and turn door handles, open drawers to use as platforms and find objects to unlock previously inaccessible paths. The puzzles are non-existent and the way forward admits no deviations. An ephemeral design for which the excuse of the child protagonist is not worth it, since the rare times that the talking teddy bear descends from our shoulders to take action, we understand how much potential has remained unexplored. With the help of our furry friend, an infinite number of actions would have been possible. As things stand, however, even just the two hours needed to finish the game seem too much. Where are my toys? The protagonist's room is the only environment in the game that feels authentic. During the prologue the talking teddy bear discovers our treasures one by one and together with him every object seems significant to us. Once out of our bedroom, however, it only takes a few minutes to understand that there is nothing in the surrounding environment that is worth examining. The objects that decorate the rooms or that we can collect offer no information on the story and give the idea of having been placed there by chance. Anthat if many elements have a childish aspect, there is no connection with the protagonist's life. With the excuse of dream scenarios we see around us things rained down by the imagination of the developers with the sole purpose of filling the space. After the umpteenth object picked up and dropped just because it's possible to do so, we don't even bother to look around anymore. So much what are the key elements to move forward is clear, it is useless to waste time with everything else. Here and there we see only drawings that reproduce the monster chasing us and objects that all too openly allude to the trauma we have to deal with. Faced with the emptiness of the scenarios, which if only they had a story to tell would have been worlds in which to rummage with pleasure, the only thing that comes naturally to us is to rush towards the finale. Unfortunately, even in the last sequences of the game, the story is barely mentioned. Something is missing, and it's a real shame because for a moment you can touch the rawness of the reality in which the protagonist lives, but it's only a flash. Then the light comes and the end credits begin to roll.", "date": "2014-06-06", "grade": "6.9"}