{"name": "Astebreed", "ref": "https://multiplayer.it/recensioni/132783-astebreed-il-successo-che-non-ti-aspetti.html", "text": "The magical world of independent video games is, at times, really difficult to understand. Not through the fault of those who are part of it, mind you, but more through the fault of a sector now dominated by marketing and triple A titles capable of carving out space and interest in the eyes of the players despite the fact that the production values put in place are not particularly original or innovative. So it happens that a semi-unknown Japanese team gets to work on a small masterpiece that you, until two months ago, didn't even know existed. Fortunately, however, the effort encountered by independent developers to emerge in an increasingly overcrowded panorama finds a precious collaboration in realities such as Playism, which offer visibility to projects from the land of the Rising Sun with the hope of being able to make them widely known public. It is precisely in this way that Astebreed had the opportunity to be talked about before its debut on Steam last May 30th. The title developed by Edelweiss is as atypical as it is spectacular: it makes gameplay its strong point, belittling everything we are used to seeing as fundamental in a successful blockbuster. History, contamination of genres, pumped graphics, characterization, game modes step aside to give way to a frenetic, captivating, explosive and adrenaline-filled carousel of which once you get on, you will never want to get off. Astebreed is a deep, fun and well-groomed title. Short but a must try! The defense of the Earth Astebreed is an old-school shoot'em up, one that twenty-something arcade adepts may still remember. Its greatest advantage, however, is that it is not an anachronistic title: thanks to a level artistic direction, to the continuous leaps of perspective, to a refined gameplay and to the big robots, which, as we know, make everything more beautiful, it manages in an attempt, if ever there was a need, to reinvigorate the genre with an extremely current and appreciable formula from many points of view. In an unspecified future, the Terrans, thanks to technological progress, have managed to colonize Mars and lay siege to numerous colonies scattered throughout the Solar System, but a mysterious alien race undermines their stability by waging a war that brings death and destruction among the population. To deal with this threat, in typical Japanese style, powerful mechs equipped with a respectable arsenal will be used, piloted by kids of unspecified age and equally mysterious past. The clichs abound, but, as mentioned, the fulcrum of Astebreed is not the plot, rather confusing and poorly presented. What matters is the gameplay. The robot, to be strictly controlled with the pad, is equipped with a devastating sword and cannon combo capable of dispensing death and destruction from any distance. Among the standard attacks we find an area one and a more precise barrage of bullets, each of which can be loaded for a sort of automatic attack that is very useful for catching your breath during the always crowded fights. In this case, in fact, the weapon hooks on to all the enemies present in the mech's attack area, riddled with bullets by dozens of targets simultaneously, in a whirlwind of colors, sounds and explosions that fills the heart with joy. Target locking also works on different planes, so that when the game phases are in a two-dimensional perspective, it is still possible to simultaneously attack the spaceships in the background and the spaceships that appear in front of us, or detonate groups of missiles in the distance before they are too close to harm us. Obviously, all this increases the chaos on the screen, raising the difficulty exponentially during the continuation of the story and the appearance of enemies with increasingly powerful multiple attacks. Sword and cannons never disappoint Last, but of fundamental importance, there is the sword. It has been since the appearance of the Gundams that there has been this fascinating mix of three hyper-technological mechs and classic combat weapons, and the sword could only be a well-appreciated element in the game's economy. It is the most powerful weapon in our arsenal, but this quality is well balanced by its limited range which makes it practically unusable against end-of-level bosses. In these cases, in fact, getting too close exposes us to easy attacks that we are unable to dodge, condemning us to certain death. To underline the ability of the blade to cancel certain enemy blows, unexpectedly revealing itself more of a defensive than an offensive piece of equipment. To make your way through the scenarios aihigher difficulty levels, it will in fact be necessary to continuously move the robot on the screen and obsessively tap the pad, alternating cannons with the sword in an incessant vortex of attack and defense which is essential for survival. At least until you get cramps in your fingers, a far from remote possibility. Precisely because of the soreness of the phalanxes, the developers' choice to limit the main campaign to just over an hour and a half of the game makes sense, a more than sustainable time to finish it all in one go by destroying one in a row at a time. other the various bosses of each level. On the other hand, the lack of alternative ways to extend the longevity of the title should be underlined, currently entrusted to the desire of individual players to climb the online leaderboards by scoring ever higher scores. On the offline front, the only thing that can keep your attention high are the forty achievements to unlock on Steam, some of which are decidedly tough to obtain: finishing the entire campaign without taking damage on the highest difficulty level will require a good dose of patience, as well as a rich collection of insults. Technically, Astebreed defends itself very well. While the production values aren't exceptional, the title runs consistently at 60 frames per second with no dips whatsoever, the image is clean and detailed and the anti-aliasing filters prevent any jaggies, all accompanied by well-crafted explosions and particle effects. The main story is told through interludes with anime-style static images and numerous dialogues during game sections; however, these are dubbed in Japanese and accompanied by English subtitles that are practically unreadable during the frenetic phases of combat.", "date": "2014-06-05", "grade": "9.0"}