{"name": "F1 22", "ref": "https://multiplayer.it/recensioni/f1-22-la-recensione.html", "text": "Formula 1 is experiencing a real renaissance in terms of interest. After years of domination by the Mercedes drivers, last season the young Max Verstappen won the drivers' world title in a championship full of twists, exciting battles on the track and some political and managerial drama between the teams involved and the race commission. A perfect mix to rekindle the desire for Formula 1, both for fans who grew up with the great rivalries Lauda-Hunt, Senna-Prost and Schumacher-Hakkinen, and for new spectators interested in discovering the charm of the top category of open-wheel motorsport. As if that weren't enough, the FIA wanted to give a further push and ride the wave of success by introducing a new regulatory change this year with the aim of bringing more entertainment and improving the competition on the track. At the beginning of the season we entered what many like to call ~the new era of Formula 1~ with new aerodynamic concepts, completely redesigned single-seaters and a great, great desire to see wheel-to-wheel duels right up to the last grand prix on the calendar. In this scenario, interest in the official Formula 1 video game could only be rekindled, which has been under the production of Electronic Arts since last year. Given the sweeping changes brought about by the new regulations and the start of a new era for the sport, expectations for F1 22 could only be high. Like every year, the developers had the difficult task of proposing a video game capable of entertaining and satisfying both inexperienced players who interface with this genre for the first time, and professional esport pilots. It goes without saying that there is an abyss between these two targets, so as to make the two experiences almost two completely different video games. In the F1 22 review, we tell you if at Codemasters they have succeeded in the difficult task of creating a video game for everyone, in step with the times and able to withstand the pressure of the high popularity that has re-emerged towards Formula 1. The new era of Formula 1 The F1-75 faithfully revived in F1 2022 Teams, drivers and enthusiasts had been waiting for the regulatory change that took place in 2022 for a long time. The FIA's goal to renew Formula 1 was quite simple: to change the single-seater aerodynamic philosophy to allow more duels and overtaking on the track. The new cars have been completely revised from an aerodynamic point of view, concentrating most of the air flows on the underbody of the single-seater. It is precisely this element that allows the cars to remain glued to the ground, even when they are competing with each other. Simplified wings, fewer aerodynamic appendages and new 18-inch tires from Pirelli are other key elements of the new regulation. This also translated into a significant increase in the weight of the single-seaters and a consequent loss of performance per lap compared to what we were used to seeing in previous years. The new Miami GP has entered the calendar, which is already quite full of sporting events, and we have already told you about it in our dedicated preview, for a total of 22 grands prix for this year's season. On some race weekends the so-called sprint races return, which have been given a second chance, having already been tested last year without too much success. Each element mentioned above, from the elegant new single-seaters, to the circuits in the calendar, up to the sprint races is also present in the official F1 22 video game, which is therefore also preparing to welcome these important changes and apply them to the gameplay. The developers have promised us that all machine models will be updated before launch, so don't worry if in some screenshots and videos you still don't see identical machines to the real ones. F1 Life Home customization in F1 Life Formula 1 drivers are very popular celebrities, especially nowadays in the era of social networks, which allow us to discover at least part of their private life such as their luxurious homes, their sports car collection and their trophies earned in the automotive career. Trying to achieve a greater level of immersion, also simulating the life of the pilots off the track, the developers of Codemasters have implemented a new section of the game called F1 Life. In addition to being able to customize the look, helmet and overalls of your virtual alter ego, you can also furnish his home, adding furniture, paintings and the trophies earned in the video game in the dedicated section. Unfortunately the customization optionsion are not numerous, on the contrary, we believe that this part of the game was done rather hastily. Most of the customizations are also paid by spending the virtual currency of F1 22, which can also be purchased with microtransactions. Once your virtual space is furnished, your online friends will be able to visit it to admire your trophy case and also review the manually saved track feats after the event. Within the F1 Life section it is possible to access a showroom, where you can enjoy both the new Formula 1 single-seaters and our cars created in career mode. Short texts have also been added here that explain the recent and past history of all the Formula 1 teams. Supercars Trophy room in the F1 Life section of F1 22 with the supercar in the foreground Formula 1 is not just competition and overtaking on the track, given that various events are organized in the various appointments on the calendar to give greater entertainment to the race weekends. Formula 1 drivers are often tasked with driving sports cars in exciting challenges specifically designed to excite the public. This aspect of modern Formula 1 has also been revived in F1 22 with the arrival of supercars. The following sports cars can be purchased and driven in the game: Mercedes AMG GT R Pro, Aston Martin DB11 AMR, Ferrari Roma, Aston Martin Vantage F1 Edition, Ferrari F8 Tributo, McLaren 720S, McLaren Artura and Mercedes AMG GT Black Series . To these are added, by great demand from enthusiasts, the two official Safety Cars, one Mercedes AMG and the other Aston Martin. Once purchased, the supercars can be displayed in the various spaces of our virtual home. In terms of gameplay, however, they can also be driven both on race weekends in career mode and through a special section of the game with some nice challenges. For example, we will have to drive through gates arranged along the track, or try to reach a certain average speed. Accessibility and immersion Manual positioning on the starting grid on F1 22 With each new iteration of the series, Codemasters has added some small or major change in terms of accessibility and immersion. This year the animations and cutscenes present in the game have been revised a bit, which by now felt the weight of the years a lot. Don't expect any major upheavals, but longtime fans will surely appreciate some new podium celebrations or team cheers at the end of a grand prix. The voice of Davide Valsecchi has arrived in the commentary booth (even if the game in the version we tested continues to call him Luca Filippi) and next to him is the now popular Carlo Vanzini. Going down the track however, we will be faced with two important changes. Now we can control our car during the formation lap to place it right on the starting square. There will be some kind of indicator that will show us how precise we were in this operation. Similarly, inside the pits, by pressing the dedicated button with the right timing, we will be able to establish the duration of the stop. This last option didn't seem entirely realistic to us like grid positioning, as what the developers have offered us is a simple quick time event and at that moment we won't have any control over the accelerator, brake and steering wheel. Manual stop in F1 22 Both options mentioned above can clearly be turned off for those who prefer to leave these tasks to artificial intelligence. Speaking of the latter, in F1 22 there is the possibility of activating the adaptive artificial intelligence. If you are an inexperienced player and cannot maintain a constant race pace, the adaptive artificial intelligence will be a real godsend. In fact, the opponents will tend to adjust their pace according to yours, also taking into consideration some of your mistakes or more important loss of control. An option that should definitely be rewarded, which adds to the already excellent level of difficulty control and accessibility present in the video game. In general, however, the artificial intelligence of F1 22 is more aggressive, generating dangerous situations just as it can happen in reality. Therefore, it will often be necessary to evaluate the opponent's intentions and in some cases let him pass in order to reattach him immediately at the next corner. Guide model Ferrari F1-75 at Silverstone in F1 22 The first sensation you have once you embrace the steering wheel is linked to the heaviness of the single-seater. The lack of agility is especially noticeable in the slower corners, where you will sufferof understeer on entry and a slight oversteer on exit. Going to push on the flying lap, trying to conquer the coveted pole position, it will be quite easy to lose control of the car, and once lost, it will not be easy to recover it without going off the track or worse, crashing into the barriers. However, mid-corner steering feedback has improved a lot, because the downforce is maintained and does not disappear into thin air as often happened in past editions of the video game. This improvement is also linked to the new tire model, which behaves in a more realistic way by simulating different types of grip depending on the contact surface and the compound used. For example, the passage on the curbs is perceived much more than in the past and the differences between soft, medium and hard tires are now important, especially as regards the difficulty in getting them up to temperature. Speaking of temperatures, the physics engine is able to simulate them better, both in the external and in the central part of the tire to give an extra variable of complexity to expert players. On board with Williams in Baku in F1 22 With these single-seaters it's really easier to follow your opponents in the races, just like in reality. The pressure drop while drafting has been significantly reduced, so we will suffer less from understeer and the tires will not wear so quickly. Going straight on the other hand, the wake effect will not give us a significant advantage as in the past, not even using the DRS. This thing initially surprised us, because in fact it is not so easy to overtake on the straights without using the overtaking button to receive the horsepower boost via the electric part of the power unit. However, seeing how the cars are behaving in real Formula 1, it is in fact a rather frequent behavior, which has already made several enthusiasts and drivers turn up their noses. The customization of the setup in the pits has received a major improvement. It is now possible to set 50 different levels of downforce on the front and rear wings, which has a very heavy impact on the entire single-seater setup. The damage system, on the other hand, remained almost identical, given the important changes received in last year's edition. Supercar driving model Don't expect an absolute level of realism from the supercars on the track. Codemasters has indeed created a driving model dedicated to these cars, which clearly have a completely different behavior compared to the Formula 1 single-seaters. The experience in this case is much more tending to an arcade game, even if without the use of aids driving, it won't be that easy to keep these sports cars on track. You will need to pay close attention to the braking and acceleration maneuvers in order to enter the corners at the right speed and come out with good traction. However, supercars have introduced a very interesting aspect, linked to their performance on the asphalt. Driving these supercars, which as the name itself suggests are not banal small cars to be used in the city, one nevertheless notices the abyss in terms of performance compared to Formula 1 cars. We have therefore observed with extreme interest how much it is difficult for them to drive in the same tracked the supercars against the single-seaters. Simulation or arcade? McLaren in the wet in F1 22 F1 22 from the point of view of the gameplay and the level of simulation, however, remains a mainly arcade video game. In fact, some like to call this type of video game simcade, that is, a union of the two genres. All in all, the innovations brought by the development team to F1 22 are few and we expected more from an important edition like this one. Of course, implementing the new driving model of the 2022 single-seaters will not have been easy, but the rest conveys the same feeling as in the past. Probably as long as the series is also distributed on older generation consoles - with the same graphics and physics engine - we will hardly be able to see important changes to make the game more simulative. Let us remember, however, that the developers' goal is to bring an experience for everyone, therefore accessible even to those who do not have some experience with driving simulators, so perhaps this radical change will never happen. Pilot career Team career and F1 driver career 22 So let's get to the point, going to see the main game modes of F1 22. This year the spectacular Breaking Point mode present in the last edition does not return. However, the now historic career modes could not be missing. The pilot career will allow us to undertake", "date": "2022-06-27", "grade": "8.6"}