{"name": "Affilate lo smartphone", "ref": "https://multiplayer.it/recensioni/132236-bonsai-slice-affilate-lo-smartphone.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. It all started with Fruit Ninja: the casual game developed by Halfbrick Studios started from a simple but fascinating idea, that is to transform our fingers into a sword, with the aim of slicing as much fruit as possible on the fly within a single match. A clear and simple concept, which has earned over 500 million downloads. We repeat: over 500 million downloads. As per tradition, clones flocked to the App Store and Google Play, but the real variation on the theme was missing, the ~equivalent but different~ idea that could perhaps have aspired to conquer an equally large audience. Almost four years later, Playground Theory hits the jackpot with Bonsai Slice. The title, available on the App Store since last month, was ~revolutionized~ just a few days ago, becoming free and also offering us a version for the iPhone (initially the app was only for the iPad). As with Fruit Ninja, the idea is to provide the player with a time limit (in this case one minute) within which to hit as many objects as possible by virtually wielding a sword. Only in this case the blade is not controlled by executing gestures on the touch screen, but by tilting the device itself. A dangerous stunt? Bearing in mind that we have to maintain eye contact with the screen, it is to say no; on the contrary, in reality often more than with a sword it seems to be dealing with a stick that must be moved in a rather precise way, especially when the formation of objects to be hit is invaded by bombs that can negatively affect the achievement of a high score. The idea behind Bonsai Slice is nice and original, but it has been exploited in only one way Who by the sword wounds... One of the peculiarities of Fruit Ninja-style casual games is represented by the limits of their structure, and Bonsai Slice is no exception. Wielding the sword, slicing a large number of things and obtaining a certain amount of gold coins (which can be multiplied by taking a look at short advertising trailers) are operations that point to a progression made up of increasingly versatile and powerful blades, equipped with directional sharpening or able to cut in any direction it moves. Purchasing them becomes easier when you give in to the inevitable temptation of in-app purchases, but in truth it is possible to obtain them all even with simple practice and a little patience, which means that from the point of view of freemium mechanics we are not dealing with a pretentious product, on the contrary. The technical sector, then, appears pleasant thanks to the use of bright colors, the presence of nice quotations in the objects to be hit and, finally, the great fluidity which guarantees (unfortunately not always) a precise correspondence with the tilt controls. The problem is rather the variety of the action, which inevitably fails after a certain number of attempts, and that the competitive multiplayer mode for four players (locally or online), in which the player who scores the most points simply wins, can guarantee only For a limited period of time. In short, the idea of handling the iPhone as if it were a sword, of providing us with a fairly differentiated arsenal and even of proposing some upgrades from time to time (to increase the time limit or transform the bombs into standard targets, overcoming otherwise complicated phases) , it works and is undoubtedly fascinating, but it would have been appropriate to build a richer and more varied structure around it, which was capable of keeping attention high and therefore going beyond the mere pursuit of the highest score. Potential that is not precluded by future updates, mind you, but which for the moment remain unexpressed.", "date": "2014-05-24", "grade": "6.5"}