{"name": "Non sar un'avventura", "ref": "https://multiplayer.it/recensioni/132119-ruzzle-adventure-non-sara-unavventura.html", "text": "When a development team pulls the proverbial blockbuster out of the hat, a game downloaded by tens of millions of people, there is always a certain amount of pressure about what the future direction of the franchise should be. Even more so in the case of Ruzzle, a casual word-based game that we all know and that last year literally depopulated on mobile devices and beyond. Downloadable for free from the App Store and Google Play, the title created by MAG Interactive was a digital clone of the classic Boggle, allowing us to challenge our friends or perfect strangers in exciting asynchronous online multiplayer matches in which, at the best of three rounds, the winner was the one who managed to score the highest score, composing as many words as possible on the board within a certain time limit. A very simple concept, probably for this reason able to conquer an extremely large audience. But how to repeat this success and at the same time introduce enough novelties into the mix to give a clear and different characterization to any sequel? The developers have seen fit to keep the basic mechanics of the game intact, but to push decisively on the variety of situations, framing everything in the perspective of an ~adventurous~ progression in single player. Thus three locations appear on the map (the Forest, the Swamp, the Volcano, to which others will be added in the future), for a total of one hundred and fifty levels in which you must always and in any case cross the boxes to form words, but following rules precise. Which? We tell you right away. Give them to the board During the Ruzzle Adventure campaign we will have to deal with different types of missions, sometimes mixed together to obtain further facets. The standard ones see us forming words in search of a minimum score, to be obtained using a precise number of moves or respecting a time limit. In the first case it is possible to take it easy and identify our compositions in the best way, trying to find the longest and most complex terms to optimize the results; while in the second case it will be the glance and the reactivity that will get us out of trouble, in an attempt to put together all the words that come to mind as quickly as possible. From a certain point on, this type of mission is enriched with extra variables, such as, for example, wooden, stone or slime-covered boxes, which must be ~unlocked~ by composing a certain number of terms that involve them, or locks to open by carrying keys over it. A further variation on the theme is obtained in the levels in which the board takes on a puzzle game connotation, or where the words are eliminated and the columns descend downwards, possibly freeing the emeralds that we are asked to get to the bottom. In other cases, however, we risk drowning because the water level rises from below and we have to compose terms to be able to go upwards, until we reach the exit and save ourselves, in one of the most frenetic and demanding ways of the world. game, especially in the later stages. Finally, there are also the bosses, with rather cunning opponents that we will be able to defeat only by putting together complex terms and obtaining bombs, the detonation of which will have to invest the enemy a certain number of times. Ruzzle Adventure enriches the original formula, but will the single player twist convince the fans? Free adventure Equipped with colorful graphics, easy to read and functional to the action, but with a sound sector a little below expectations, Ruzzle Adventure too - like its predecessor - can be downloaded for free from the App Store (but we are sure that a Android version is coming soon) and uses the classic system of lives and gold coins, which enables the most skilled users to play without problems, at least until they hit a series of game overs. There are boosts and aids that can be used by putting a hand in your wallet, but even in this respect the choices made by MAG Interactive did not seem to us oriented towards the most unscrupulous monetization, on the contrary they leave discrete room for maneuver and the fundamental freedom to choose whether make some in-app purchase or not. The same can be said about the balance of difficulty, which unlike other freemium titles does not rise sharply to raise the classic ~paywall~, but lets you proceed without particular problems up to the second location, where things actually start to get more complicated. Logging in to Facebook allows the application toidentify the progress of our friends on the map and possibly challenge them, even if trying the game before its official release obviously precluded us from this possibility. The feeling we had during the (many) games played is in any case of a fun and successful game, which substantially enriches the original formula and always tries to mix the cards on the table to keep the interest high. Of course, the underlying Boggle-style concept remains and it is possible that someone will now feel nauseous from what they have tried, but fortunately it was not our case.", "date": "2014-05-22", "grade": "7.6"}