{"name": "Disgaea 6 Complete", "ref": "https://multiplayer.it/recensioni/disgaea-6-complete-recensione.html", "text": "Released last year on Nintendo Switch - but in Japan it had also made its debut six months earlier on PlayStation 4 - Disgaea 6: Defiance of Destiny represented a kind of misstep for the very famous series of strategic Nippon Ichi. Despite being an excellent RPG, the game tried to embrace a wider and savvy audience with a stack of perhaps excessive simplifications in the eyes of the veterans who have followed the franchise since its inception on PlayStation 2, and the just enough technical sector certainly didn't help to elevate it above its predecessors. In the end, not even Disgaea 6 managed to escape the Complete treatment, that is, a re-release including DLCs and some marginal improvements that arrives on PlayStation 5 and PC. Let's see how it went in this review of Disgaea 6: Complete. From Switch to Playstation 5 and PC Disgaea 6 Complete, Zed is the zombie protagonist of the game If this is your first Disgaea, know that narrative has never been the strong point of the franchise. The plots are so delusional that you get to the end without really understanding what happened and why; don't expect who knows what writing peaks, since the dialogues are mostly gags with a very Japanese flavor that play on the absurdities of the various characters, but the story of Zed, a zombie who hunts the God of Destruction, is not exactly the most brilliant of the series. It makes you smile, and some characters, such as the pompous Misedor or the hysterical Ivar, are really hilarious, but it lacks that irreverent genius that characterized the previous episodes. Zed is a bit too formulaic to be an infinitely reincarnated zombie, but if you speak English you'll certainly get a few laughs, as the game has unfortunately not been localized into our language. Disgaea 6 Complete, plot and characters are absurd as usual Disgaea 6 was thought of as an ideal starting point for new players, and it's no coincidence that the Japanese developer has switched completely to 3D, abandoning the two-dimensional sprites that moved on the isometric maps to address a more modern audience. The choice, which aficionados like us did not welcome, turned out to be more convincing than expected. We will miss the pixel art of yesteryear, but the new three-dimensional models, thanks to the excellent cel shading and good animations, are more consistent with the general artistic sector, giving their best in the spectacular cinematics of spells and special attacks. The rest, sadly, is disappointing. Disgaea 6 allows you to choose between three different graphics settings (Graphics, Balanced and Performance). In the Switch version, it was better to set Balanced as, while dirtying the graphics, it managed to maintain a better fluidity than Graphics, which instead traded stability for mediocre antialiasing. Performance, for its part, didn't even make sense, it was so unwatchable due to the sacrificed resolution. On PlayStation 5 the three modes are redundant, given that Performance and Graphics return almost the same image, and in any case with a much better definition and a stable 60-frame fluidity compared to the Nintendo console. Strategies old and new Disgaea 6 Complete, it is possible to change the color of the units Explaining a title like Disgaea is a titanic undertaking, if only because the game dynamics are numerous and depend on each other. This has always been the strong point of the Nippon Ichi series, which can be played and enjoyed without delving into it too much; but those who love the micromanagement of items, stats and synergies could literally spend hundreds of hours on a title that needs about thirty to complete only as a main campaign. Before dwelling on the most important features of the gameplay, it should be emphasized that Disgaea is a strategic RPG designed above all for players who have a lot of time to invest in customizing their units and who want to see exaggerated numbers on the screen every time they slap . But if once it was necessary to work hard to inflict millions or billions of damage, Disgaea 6 greatly accelerates this process, and within a few hours, and without too much effort, already exorbitant numbers are reached. If it is true that this solution mortifies the complexity of the previous titles, on the other hand it is clear that Nippon Ichi wanted to insist on this aspect precisely because it distinguishes Disgaea 6 from any other turn-based strategy game on the market. This does not mean that the game is less satisfying . Nippon Ichi has simply raised the bar, raising the maximum level achievable to 99,999,999 (s, you read correctly) while proportionally increasing the ceiling of the individual statistics. So you start with characters that have five-digit stats and can reach the billions just by leveling up, which is much faster than before. Disgaea 6 Complete, PlayStation 5 version includes all DLC In addition to experience points, which are used to level up, each unit also earns Mana, a resource needed to enhance spells and special techniques, learn new Evilities (passives borrowed from the previous Disgaea) and so on. Mana is also used to convene the Dark Assembly, a kind of minigame in which you bet on the consensus of the Netherworld senators regarding our requests. This historical function of the series returns with a myriad of options, among which the Super Reincarnation system stands out, which allows you to restart a character from level 1 while retaining the skills learned and a percentage of the statistics reached: in this way, when he levels up , its parameters will reach higher and higher values. The Juice Bar, on the other hand, is a feature that allows you to distribute the excess experience points and Mana gained by characters who would not do anything with them at will. The Juice Bar therefore serves to micromanage the units in an even more precise way, but unfortunately it requires an exorbitant amount of HL (the money of the Netherworld, in short) to be used often. Disgaea 6 Complete, there are tons of classes and combinations One last novelty that we used less, but still appreciated, is the Demonic Intelligence. This function recalls the Gambit system of Final Fantasy XII: in practice we can set one or more thoughts for each character, i.e. directives linked to circumstances and logics that automate behavior in battle. For example, we can make a character heal himself using a consumable whenever his health drops below a certain percentage, that he only attacks under certain circumstances, and so on. By setting up more and more ~thoughts~, we can fully automate battles, by writing firsthand the artificial intelligence of our characters. It is a complicated operation that requires time and patience, but which could become a valuable resource for players who intend to give themselves to the unbridled ~grind~. Turn-based combat Disgaea 6 Complete, the fights are turn-based Let's spend a few words on the combat system for all those readers who have never got their hands on a Disgaea. As we said, explaining it in detail would be difficult, so we advise you to download the demo available on the PlayStation Store: it will be a good tutorial and you will be able to import the saves into the final game. That said, Disgaea 6 is a turn-based strategy game. Once a mission has been chosen, each enemy must be defeated to win the battle, which begins by deploying a certain number of units from our army. The fight then alternates the turn of the player and that of the enemies. On his turn, the player can move his characters, make them attack or perform other actions, without following a precise order as happens in many other strategy games. For example, you can perform an action with one character, move another and then move the previous one into its place and so on. Furthermore, the characters will not follow the orders given until you have given your OK with the Execute command or you have not concluded your turn, and in the latter case any pending orders will be executed before it is the enemies' turn. Disgaea 6 Complete, the legendary Prinny could not be missing In addition to being extraordinarily versatile, the combat system of Disgaea 6 contemplates an immoderate variety of mechanics and features. There are multiple attacks and combo attacks; the characters can lift each other up to launch from one point of the map to another and gain ground, or form absurd human towers to reach elevated positions otherwise inaccessible. The Geo Panel is also back: practically a part of the map could be affected by artifacts called Geo Symbols that give the units above it advantages or disadvantages. The player can manipulate the Geo Panel, intervening on the Geo Symbols, to appropriate those advantages or weaken the enemies in the most imaginative and creative ways. Although slightly simplified compared to the past, the combat system of Disgaea 6 has nothing to envy of the previous episodes. Some mechanics are missing, such as the possibility of wielding monsters as weapons or the Revenge mode but, as they say, too much stuff and the contents, after all, are not lacking: between the main campaign, the DLC missions included for free in the version Complete from the outset and the procedural maps of the Item World, Disgaea 6 is a very rich title that cannot disappoint fans of turn-based strategy and all-Japanese nonsense, but which may seem antiquated to those looking for something more visually up-to-date with the times.", "date": "2022-06-24", "grade": "7.0"}