{"name": "Scacchi elettronici", "ref": "https://multiplayer.it/recensioni/131873-pure-chess-scacchi-elettronici.html", "text": "Almost 15 centuries after its birth in India, chess still represents a more than current game today. It is not surprising to read about man-machine challenges bordering on the paradoxical, or tournaments with single challenges that have exceeded 5 months in duration. VooFoo Studios tries to fill a gap on Nintendo consoles by providing its take on chess, but only on the eShop. It must be said that the choice is wise for two reasons: a chess game is well suited to a download size, both for reasons of philosophy and size in bytes; moreover, a physical distribution would have increased fixed costs and consequently the average price, stable at 6 on Wii U and Nintendo 3DS. A figure that is not high by standards but soiled by the now ubiquitous downloadable content that can be purchased for a fee. The team's promises of wanting to amaze with the online sector have proved ambitious from the outset, thanks to the support of the cross-platform function unrelated to the platform. Let's see how the game of King has evolved on today's dual screens. Pure Chess does not fully satisfy: a good single system does not support the cumbersome online structure Plank from another time The commitment to characterization instilled in Pure Chess is undeniable: the single player mode allows you to enjoy a rather complete chess product. Nothing ever seen before, let's be clear, after all we are still talking about chess: the options provided for the local game are basic but punctual. Once you have read the guide provided by the game which explains the fundamentals and tricks to learn how to gain experience on the board, the title provides up to 6 different slots on which to start and carry on cross games, leaving it up to our needs to set them against the CPU or against human opponent. In any case, the team puts on the plate the possibility of deciding the rules of the match: initiator of the game, possibility or not to cancel the moves, semi-tutorial on the possible movements of each piece and a stopwatch to set a time limit for each move . VooFoo Studios chooses to broaden the standard offer by adding welcome bonus games - a sort of unique challenge - linked to checkmating the CPU in a limited number of movements. Twenty problems to be solved for a range from 1 to 5 check moves bring the maximum number of unique challenges to one hundred, as they are identical on both Wii U and Nintendo 3DS. A pleasant addition that joins the Tournament factor, in which to face the races proposed by the team in a sort of early Survival, differentiating the offer for novices from that for experts. All in all, the single package recreates that ecosystem that every chess fan will appreciate, with some playful additions almost from a puzzle week given by the challenges included in the whole. There is also the customization of the soundtrack, able to mix genres suitable for the discipline such as jazz, classical music, chill-out and ambient, and the stylistic choice of chess and place of play. One move at a time It is sad to note how the VooFoo stock collapses exactly in the area where it should have shined with its own light: online. The assumptions were all there: the closs-platform mechanics of Pure Chess is in fact also compatible with the iOS and Android versions, making the challenger park potentially endless, but the execution on Nintendo machines lacks playability. Starting the analysis from how the game deals with local multiplayer, the Gamepad is certainly the best place to challenge each other; rejected the idea of exchanging the pad each time to make the moves, it is possible to place the accessory on a flat surface and play totally on the second Nintendo LCD, with the board reproduced entirely and one player on each side to make his own move. On Nintendo 3DS, unfortunately, this flow of game is not expected, and it will be necessary to pass the console from time to time. Therefore, if Wii U wins the offline challenge, it sensationally loses the opposite one, but not for its demerit. The game system via ~notifications~ by VooFoo Studios lacks convenience since it does not hook up to the external notification system of the Wii U operating system, thus resulting in an absence of real warning when the opponent has played his move. Physical limits prevent Wii U from reaching the flexibility of mobile platforms, decidedly more suitable for play-by-mail style management, and tip the balance this time in favor of Nintendo 3DS, decidedly more suitable, as it is portable, for a logic similar. To make everything more complex, there is an emphasis placed by the team on not speeding up the post-move dialogue - perhaps also due to netcode problems - the fact is that the desire to slow down the flow of the action is less inclined to static console gameplay and much more suited to a smartphone philosophy. All this without considering the fact that there is no way to understand if and when the next opponent will intend to make the move, thus leading to potential situations where, in the absence of interest from an online opponent, the game could go on forever or until close on our side. The only pride of the English team is that of having created a system based on accounts external to the platforms and therefore universal, convenient to manage and export in case of need. 3D Effect/Gamepad Considering a deficit frame rate on Nintendo 3DS and an absence of parallax depth, the advice is to completely lower the bar of the 3D effect on portable. The Gamepad instead helps with its second window features, allowing convenient management of the grid and offline multiplayer sessions. Handsome king From a purely technical point of view, Wii U certainly offers a much cleaner and richer visual than the Nintendo 3DS version, unfortunately poorly programmed. On a laptop, VooFoo Studios was unable to reproduce the models with the desired cleanliness: the proposed polygonal mass is not surprising and the stable frame drops only underline a partial commitment to optimizing the very inexpensive software for the potential of the device . On the housewife the speech is decidedly different: the high definition adds a nice initial impact, also helped by a faithful and clean reproduction, enriched by refraction effects and static lighting that embellish the outline. Of course, never forget that it is still a game of chess and not a role-playing adventure with astonishing fantasy settings, but in this case the eye can also enjoy its part. Game environments, chess pieces, materials used: on Wii U the technical aspect is surprising, also and above all considering the obvious lack of personnel of a small independent development team such as VooFoo Studios. Precisely on this aspect the team has based the construction of DLCs, relating to a purely collecting area of new chess sets or other places where to set one's games, with a price range from  1.20 up to  2.", "date": "2014-05-16", "grade": "6.5"}