{"name": "Need for Speed: Most Wanted - Recensione", "ref": "https://multiplayer.it/recensioni/need-for-speed-most-wanted-recensione.html", "text": "The sensation of speed is not what you would expect Next generation inside But all that glitters is not gold: the series continues to drag along some defects, first of all the lack of damage (even only aesthetic) to the car. Especially in chase mode, when you ram police or civilian cars, they break and lose pieces, but ours remains perfectly intact, with the exception of the paint or glass (which are marked, but not broken). giving the impression of driving an unstoppable bulldozer. Project Gotham and Juiced teach that at least a few dents make the gaming experience more realistic, but EA does not want to know. The other big lack is the absolute impossibility of running outside the late afternoon! While before you could only run at night, now you can only run during the day! Something probably due to the vastness of the game environment, which probably would have taken up too much programming time to be reviewed with other lights. But, sorry to say, that's not enough of an excuse. Certainly the pre-evening setting is beautiful to look at but in the long run it gets tired (as before the night got tired) and once again the opponents (always Juiced above all), prove to be superior in terms of choices. Finally, the game is particularly expensive on PC: it requires a latest generation computer to be enjoyed at its best, but not so much for the graphics as for a bad hardware optimization (it seems that the game is not fluid even on Xbox 360 but for question we refer to the future dedicated review). The sensation of speed is not as you would expect (the motion blur doesn't help either), and from here the old Need for Speed Porche comes to mind, also unable to convey the same speed that is expected from the title. We point out the absence of replays and mysterious crashes if you use the key for the internal grab of the images (F12). On mid-range PCs (P4 3 GHz, 1 GB ram, GeForce 6600GT) at 1024x768 with AA4X and AF8x it stutters, while removing the filters improves but slightly. EA Trax Hats off to EA for the sound: as in all games there is ~EA trax~, a collection of songs (about thirty) made by more or less famous artists, to act as the soundtrack of the title. The interesting thing is that when the police intervene, an all-action piece of music will come out, very similar to that of the film ~Speed~ which will greatly galvanize the chases. Unfortunately, even this time it is not possible to customize the playlist by adding songs and, strangely, the key used for changing tracks only works in the menus. The in-game side is fantastic, with the noise that changes according to where you run, and has a good dubbing in Italian, even in the cutscenes. Rumbles, skids, accidents, they are all in the right place and do their job very well. Of course, it's not that you feel much difference between one car and another, but it's something you'll pass on. The noise of the air trail when you pass near a car or an object is also nice, but you hear it less than the previous Need for Speed. Note: The horn is also missing on this NFS! hearing others play it and we don't irritate...Grr! Blacklist... Online multiplayer on PC involves joining EA servers by creating an account. Once this is done, you can immediately jump into the race or create a custom game. It is also possible to activate filters depending on how you want to run. Serious flaw: there is no category that divides the cars and therefore in 90% of cases those who have not continued their career (and want to race online immediately) automatically find themselves against very powerful cars (although you may have some souped-up cars, this is not enough to be equal). Frustrating to say the least to seek competition on a human scale. It is obviously a must to have a broadband connection otherwise you will be involved in ~invisible~ accidents. In LAN obviously everything goes much better: you create the game and you can decide together with the other types of vehicle. No more than four can be run either way. Final comment Most Wanted arrives in the birth of the next generation, but it does so by presenting some major gaps compared to the previous title. The game mechanic works but besides the police and the movies it doesn't offer anything new and indeed it loses most of the customizations in favor of a few more cars (even the neons are missing!). If we add a graphically avant-garde but absolutely expensive and poorly optimized engine we see that the balance tends to the negative. Fortunately, the abnormal longevity and the variety of environments and races compensate for everything (and the interest resists). Fans of the series will certainly like it but they will certainly be somewhat disappointed. Recommended at chi enjoyed the various NFS and the arcade games in particular. A latest generation PC is a must to play it decently. Pros HDR and flashes of Next Generation Massive game environment Excellent longevity (average 40-50 hours!) Cons Runs only in daytime Reduced customization Damage model absent again 1/68, 2/68, 3/68... As if the long career wasn't enough, the EA programmers have added the challenges menu: 68 competitions to face with the most varied objectives. The beauty is that every time you will have a different car and you can immediately race with fast vehicles. Passing some tests will lead to the unlocking of cars and tunings. Lots and lots of longevity and low number of boring rides. Three fast, three furious... Here we are at what can be defined as the third chapter in the Need for Speed ~tamarri~ saga. Most Wanted includes the usual clandestine races aboard the most souped-up cars on the planet, but this time the police force returns, having been absent from NFS: Hot Pursuit 2 and eager to have their say. The plot this time sees flesh and blood actors (especially actresses) who will show you the objectives and guide you to the climb of the ~Blacklist~. Basically the list of the most wanted of which obviously it will be your aim to become first. The various characters are amusing, among which the cursed black policeman stands out who travels on a super-prepared Viper complete with sirens... The game offers vast freedom of choice: you can go around the city in search of competitions or embark on a series of challenges to overcome in order to be able to confront the members of the Blacklist. Also present this time is the convenient GPS, which if activated will guide you quickly towards the pre-established destinations, avoiding the risk of getting lost in the huge metropolis in which you will run. An important new feature is the slow tempo, which can be activated with the appropriate button. Pressing it slows down the view along the lines of Max Payne and it is possible to better focus on the curves or important indicators. Being chased by the police brings up a capture indicator which if it reaches the limit will see you landed in jail; vice versa, the more you manage to escape, the more the bounty on your head increases. The aim is to make it rise in order to be able to challenge particular opponents. The more you manage to resist arrest, the greater will be the commitment of the guardians of the law to stop you, who will arrive with tanks and even helicopters! This mode is certainly the most fun of the entire game because it allows for great destruction of cars and structures and a lot of satisfaction in escaping dozens of cops! In addition to the classic circuit races, we find the following possibilities: Sprint (from one point to another), Shot (whoever changes better wins), Elimination (every lap out of one), and the new ~Speed cameras~ and ~Race between toll booths~ . The first requires you to pass at high speeds on certain points, the second to reach the toll booths within the set time. Most Wanted gives us a taste of next generation The Fantastic 15 The artificial intelligence of the opponents is adjusted according to the difficulty: the first challenges will be very simple, and then gradually become more and more demanding, especially in clashes with the most powerful cars. Civilians' cars will try to avoid you or they will honk your horn while the police will try to stop you first with encircles, then with ramming and head-on! Then all the opponents can make mistakes, perhaps colliding with the truck on duty, it follows that even repeating a race you are practically never faced with the same event. + car = - accessories With NFS: Underground 2 the changes that could be made were truly a large number. This chapter has taken a big step backwards. For example, the bumper and side skirt kits can only be taken in blocks of the same type, the neon lights, lights and mirrors have disappeared, just to name a few. A real pity, only partially compensated by the greater number of cars which, however, sees some frankly exaggerated cars (like the Lamborghinis) which are then caught up by the police in a chase Too bad! Cross-platform Leaving aside the characteristics and positive (and negative) sides of the PC version, which we have adequately discussed in the body of the article, let's spend a few words on the console editions. The three PS2, GC and Xbox versions are presented adequately from a graphic point of view even if, as always happens in this case, the last of the 3 is the most appreciable one, with the version for the Sony console suffering rather heavily due to the lack of acceptable anti-aliasing, and for some lower quality textures. However, they all travel at 30 FPS. The controls also move in parallel, with theXbox joypad that certainly has the better of the other two for the convenience of the triggers that are very versatile with Most Wanted. We then noticed a strange inconvenience with the management of the cameras which, only in the PS2 version, cannot be modified in real time: it is necessary to enter the game menu to change the view. Finally, only the Xbox version (and the PC version of course) offer an online game mode. Next generation inside The very first thing that immediately catches the eye is the graphics. Most Wanted gives us a taste of the next generation by offering highly detailed cars full of reflections, depth of field, and moments of photorealism guaranteed. The title is also one of the first (the second after Half-Life 2) to introduce HDR, in other words a lighting system that simulates the real gaze towards the sunlight, with a truly realistic blinding-focus effect ! The setting is the classic fictional city of enormous proportions, with different types of neighborhoods. We go from the center (with its skyscrapers), to the industrial area (run down) to the periphery (with the typical air of American villages) which includes roads through the woods. During the races it is possible to take advantage of short shortcuts but also to use objects present on the route: in addition to the destruction of particular structures that block the police, it is possible to bump, for example, trucks carrying logs, so as to overturn them on the road and block the opponents ! Or better yet go under the trailers! Notion about the movies: these are made with actors on blue screen (and then glued to the background), and put on video with a slight blur and an oil color type effect. Beautiful to look at (even if the acting is what it is) and the tutorials and presentations of the characters are wonderful (with the image that is composed in a puzzle style, a must see!).", "date": "2005-12-07", "grade": null}