{"name": "A testa in gi", "ref": "https://multiplayer.it/recensioni/131713-mario-kart-8-a-testa-in-giu.html", "text": "Dear old John Barth, one of the pillars of 20th century American literature, wrote in his masterpiece, quoting Marx, among other things, that ~quantitative changes suddenly become qualitative changes~. A maxim of total authenticity and ruthlessness. You change here, it seems just a detail, you mute there, some suspicions should come to you, you transform yourself into another part and one day, in the mirror, you discover that you have become someone else. It doesn't just apply to people, God forbid. In fact, just playing Mario Kart 8 reminded us, not that it had ever come out, this sentence. Because it's true, at first presentation it could have seemed like the usual thing, simply more beautiful - and how much more beautiful. But no, Mario Kart 8 has become something else, it has transformed. Unlike people, fortunately for him and to our displeasure, he is rejuvenated. This is the explosion of a process started by Double Dash on GameCube, who was the first to instill a new liquid inside a perfect container: polygonal interaction, and machines other than karts. Then came the Nintendo DS chapter, with online and a fabulous track design. Another drop. The Wii, with twelve characters on the track, motorcycles and expanded network play. First crack on the surface. Mario Kart 7 on Nintendo 3DS with customizable gliders, sea sections and vehicles. And now here is Mario Kart 8, which for the first time unites all these things, at least the best ones, seals them and breaks the old dogmas: because merged together they generate something radically, essentially different from that first Super Mario Kart from which no one, basically , had still wanted to divorce. Of course, more than Mario Kart 8 perhaps it would have been more honest to call it ~Mario Racing~, or something like that: between motorcycles and quads, gliders and anti-gravity, there is little faithful to the progenitor left. More Mario Racing than Mario Kart, but never so beautiful and complete since the days of the SNES. An 8 out of 10. Driving license and booklet There is little left, we said, but something yes. And it is the most unexpected thing. Because, needless to feign surprise, right from the presentation we expected that this eighth episode would be one of the epochal ones: too much money invested, too much thirst for killer applications for it not to be so. We envisioned a solid game with good track design and respectable online, as well as lavish graphics. And in fact it is all of this, but there is also one more ingredient that concerns the balance of the driving. We are about to make a consideration that influences the high rating you see below, and should we be proven wrong, please remove one or two tenths from the total: this is because, despite the long and in-depth test, we will be certain of our assertion only in a few months, when the most competitive drivers will have clashed online to the tune of tenths (it will still remain true, for the avoidance of doubt, for anyone who plays below the ~pro~ threshold). In a nutshell, Mario Kart 8 succeeds in the glorious enterprise in which all its predecessors, ancestor excluded, had failed: restoring centrality to big and heavy karts. You know the fireball on the cover of Mario Kart DS? Well, to finish first was useless. From the GameCube onwards, anyone who aspired to victory, not caring about tastes, had to equip themselves with a small character, with a slim and light kart. On Wii it had come close to the solution, but in that case ~the chosen one~ turned out to be a particular type of motorcycle, changing the equation only in appearance. We're not saying that in this eighth chapter there isn't a better kart than its peers: simply, there isn't one type superior to the other. For two reasons, above all: the beloved and hated straight sequential skid, called ~snaking~, has been definitively eradicated. And the coins scattered along the way, accumulating for a maximum of ten, alter the speed in a decisive way. Exactly like on SNES, to reconnect to what was written at the beginning. Thus the majestic and heavy kart, considered too clumsy for too long, has regained its authority: it is still difficult, and recommended only for expert players, but if you want to compete head-on, it is the most suitable one. Conversely, maneuverability, post-crash recovery and cornering acceleration make small vehicles a priority for novices. The quads, present in mass, can be associated with heavy vehicles, with a pinch of speed less and greater grip off the track. The motorbikes, on the other hand, at least in terms of characteristics, are a hybrid between a big car and a kartini: in reality they represent much more. Evolved and weakened by the Wii episode, they give rise to a driving experience almost parallel to the karting one, with sharper and less modulable curves. Surprising too. Even the notorious trail effect has been refined and chiseled, it exaggeratesto Nintendo DS, now the protagonist thanks to the rediscovered dignity of straight lines and clean trajectories. Upside down Your ~driver package~ is made up - a rough estimate, mind you - 35% kart, 35% tyres, 25% character and 5% glider. This means that, apart from time trials, you can choose both your kart and your favorite character without harmful consequences. This time among thirty options: from Mii to Toad, passing through the koopalings, the cast is well varied and, above all, unabashedly maries. No Diddy Kongs, various monkeys or, worse, characters from other series: a choice we approve of. However, it remains inexplicable why runners like Baby Bowser or Boo, must-haves among enthusiasts, have left room for Peach Oro or Mario Metallo, whose charisma borders on zero. Details, not bad, also because the circuits in which the challenge takes place, extended to twelve competitors, are unsettling. The anti-gravity, the now famous novelty of the episode, which allows you to travel upside down and encourages clashes with opponents and rotating pylons, is equally important in declining the structuring of the tracks. Finally, we cannot stress it enough, they become aware of their width and, rather than limiting themselves to being ontologically large, they fill up with alternative routes: on the walls, under and above the asphalt, they reveal themselves to be a harmonious jumble of paths. Thanks above all to anti-gravity, which allows new solutions, sometimes ingenious, and at the same time distorts the old circuits. A small note before continuing the analysis: the transition between classic and anti-gravity takes place without any trauma, and it is very surprising to see yourself again, through the replays, protagonists of unwitting adventures. The only exceptions are the shortcuts located on the side walls, but it is the - wanted - price to pay if you want to cut. As anticipated, the quality of the unpublished tracks is surprising, never so high since Mario Kart DS, and the variety is remarkable: clean and dirt tracks, flat or undulating, marine or flying, often joined together in different dosages. Since this review is not a medical bulletin, we avoid illustrating them case by case, but it is our duty to point out the excellence of ~Monte Wario~, a route that blossoms from the top of a mountain and eclipses once you reach the valley, in a single, polymorphic path which sublimates the idea of the long ~no-lap~ race introduced on Nintendo 3DS. Another advantage, unlike Mario Kart Wii, is that you drive a lot: perhaps on land, sand or sea, but you are rarely more focused on avoiding obstacles than pursuing the ideal trajectory. It's not little. Should we find a fault with the track design, we would point the finger at the choice of the old circuits: a flaw that exists only in the eyes of those who have played them, because the quality, in and of itself, never falls below the sufficiency. But, although they are all polished, renewed and often enhanced by marine, aerial or anti-gravity prostheses, the doubt remains that, limited to the N64 and GameCube, more deserving tracks could have been chosen. Run! The essence of the offline game also in this Mario Kart remains the Grand Prix mode, in the usual 50cc, 100cc and 150cc categories (plus the mirror one to be unlocked), in increasing order of speed and ruthlessness. No obligation this time - fortunately - on the vehicles to be used. In this specialty, it must be reiterated, you run forcibly with all the weapons in circulation. But, by skill or divine will, despite the twelve drivers and dangerous precedents, Mario Kart 8 does well in this field too. The challenge usually evolves into two well-spaced sections, the low-ranking rabble and the leading race. The objective of the first group is to get out of the swamp with improper weapons and (above all) with a series of well-taken curves; goal of the seconds to collect as many coins as possible and break away from the others. Rarely do the two sides merge into a single group of riders, even less frequently, on the threshold of the last lap, is it possible to overturn the standings. In general, therefore, there are few opportunities for contact between head and tail, and mainly represented by two weapons: the blue shell, which flies straight against the winner, and the lightning bolt. As usual, the bolt involves everyone, and therefore has little influence on the relationship between the forerunners; unlike customs, blue shell is rare. Even if you are always in command, you hit on average once per game, and the possibility that you don't meet is as probable as that you suffer twice. A truly basic modification, much more than the super horn capable of annihilating it, as blessed as it is rare: it is revealed every three or four races, and whenyou will hardly be in a position to arm it against the sententious tortoise. We would not like to diminish the feeling of finally seeing it shattered, after decades of previous hatred: in the overall performance of the races, however, it counts for little. Instead, boomerang and carnivorous plant were promoted, the latter being particularly useful in the arduous transition from low to high ranking: it devours objects and - above all - coins, if used well it can be fundamental. The gold tokens deserve a separate observation, the centrality of which was first clarified, and which one is deprived of if hit by an object. Also for this reason it is difficult to free yourself from the crowd: being hit right and left, accumulating coins becomes prohibitive. They are so vital that, far from appearing superfluous, they are often given to the leader at the moment of impact with the weapon boxes. There is greater protection, in general, for able runners. In this apparently perfect recipe we find a big flaw in contrast with the rest: the punishment, falling off the track, is miserable. Removing three gold coins, a few stop guards and ready to go again, without even a moment of embarrassing silence to repent (those who have played Mario Kart 64 know what we are talking about). In some cases, these measures are enough to jeopardize a race, but given the focus on riding, we would have expected more severity. No War There are three sub-modes related to offline single player. First of all the time trials, also rejuvenated by the accumulation of coins (and by the track design), which for the most competitive and meticulous runners could alone justify the purchase: there are CPU ghosts to beat, but above all those of the other players, complete with an online ranking and a hypothetical sneer message. Not only that: eyes and intuition weren't enough for you, a useful button will be able to reveal the setting of the other vehicle, so that you can imitate it and, hopefully, surpass it. The challenges are the authentic novelty of the iteration, not so much for the presence in and of itself as for the extremely malleable composition, from the number of circuits to the displacement, from the difficulty of the CPU to the general setting (teams or not). Above all, and dare we finally say, by the presence or absence of certain objects: you can run with any weapon or with none, with devastating ones or only with coins, exclusively with shells, mushrooms or bananas. Negative note instead for fans of the historic battles of Mario Kart: they have been distorted, downgraded, brought into a subordinate position. In short, they are now a simple side dish. There are no longer specially designed arenas, eight tracks have been chosen, the most appropriate, to also form the basis for this mode: the differences from the grand prix version are minimal, some accelerators removed and a few ramps moved, nothing more. And it is always played in tempo and always in twelve, a quantity that justifies and gives identity to battles that have been transformed in any case. Here too you can compete individually or in teams, using the usual balloons (three each, one is removed with each shot) which at the end of the competition are added to the attacks carried out, so as to determine the overall score. More than for novices, this fragment of Mario Kart 8 will be a disappointment for fans of the old episodes. Network It is almost superfluous to add that racing without objects, or with few weapons, represents a dream for the most obsessed runners in the series. Even more exciting is the fact that the option is also extended to online, the game's authentic elixir of life. Already on Wii the series offered the best network service of the console, and this eighth chapter lives up to expectations: you can race on a global or regional scale, with your own score that rises or falls after each race, entering and exiting at will from the various groups. As anticipated, you can also search for competitions by applying filters, the same as in the challenge mode. But above all, with a friends list finally aligned with that of your ID (never take anything for granted with Nintendo), a customizable tournament option has been included: from the rules to the engine capacity (up to 150cc), passing through the time and cyclicality of the event. In the private ones, which can be locked with a password, voice chat via gamepad is also activated - in the lobby. All of this, at least in our experience (prolonged but linked to the scarce crowding of the servers), without a drop of lag. Unifying the online with the offline is split-screen web racing, with a friend by your side and a world of competitors to challenge together. An offline mode that is pegged to 60 frames per second and perfect in split screen, alm", "date": "2014-05-15", "grade": "9.6"}