{"name": "Hardspace: Shipbreaker", "ref": "https://multiplayer.it/recensioni/hardspace-shipbreaker-recensione.html", "text": "Welcome to the review of Hardspace: Shipbreaker, a game that tries to simulate a job that doesn't exist: the dismantling of spaceships. It is not a profession suitable for everyone, perhaps to accept it you also have to be a little desperate, but if you return alive you will also return rich. The company that manages this, like millions of other businesses, is called Lynx and is not particularly attentive to the needs of its employees. Accepting the job of dismantling spaceships also means taking on a considerable debt: everything necessary for survival in orbit, including the tools of the trade, must be paid by the worker. Thus we start with a monstrous debt, from which what we will earn during each work shift will be deducted. You risk a lot, the job is stressful but it also has its positive aspects: shifts last only fifteen minutes, and then you're free all day... even if there's not much to do on this sort of orbiting junkyard. Risk and Profit Hardspace: Shipbreaker: Larger ships consist of multiple rooms and multiple floors Harsdpace: Shipbreaker is a very special game, stressful and relaxing at the same time. The first ships to be decommissioned will be the simplest to manage, but these will slowly be replaced by larger, more complex and more dangerous aircraft. During the shift, two tools are mainly used: the tractor beam which is used to move the disassembled components and the blowtorch to eliminate welds and anchor points. Even with these simple two friends you can make a big mess: there's always the risk of overdoing the tractor beam, losing control of the ship fragment you're moving and hitting it on your helmet, and if you're really geek strong enough to break the visor with sudden loss of oxygen. With the blowtorch, or cutter, on the other hand, you must always be careful not to hit any flammable or explosive structures, especially using the methods that allow you to act on larger areas. Does the time savings justify the increased risk? This is a recurring question while ~working in this game~. The dangers will increase exponentially: some ships hide still pressurized areas inside them that can cause the ship to explode into a thousand pieces, others will have a dangerous nuclear reactor that will have to be disposed of before it becomes unstable, and the nasty surprises don't end there. All this is managed by a rather complex physics and, consequently, free to create situations that are actually very dangerous, chain explosions, fractures that bend the ship to the breaking point that in a dull snap can turn into an avalanche of metal. The pieces of a ship, based on the material of which they are made and the type of belonging, will be disposed of using the three different hatches that surround the work area: there is the furnace to destroy, the conduit to recycle and below we the largest panel where to launch the most complex and precious components. Throwing yes, through the second mode of the tractor beam. End of shift Hardspace: Shipbreaker: the ships in the game are made up of hundreds of different pieces, and it won't be immediately clear how to act To organize the disposal you can also use cables with which to join several pieces at the same time, in order to push one of them to move them all in the same direction. Inside the ships you can find useful things such as medikits, oxygen with which to recharge our reserves, but at the beginning our equipment will still be rudimentary and these finds will not be enough to guarantee us survival until the end of the work shift. It will therefore be necessary to return to the entrance and exit platform where, through the appropriate terminal, you can top up, paying, what needs to be refilled, and fix what needs to be fixed. With the money earned, as we grow in level, we will be able to buy upgrades that will make us more and more effective and faster. Speaking of speed: it is very difficult if not impossible to dismantle a ship in a single work shift, fortunately from version 1.0 of the game it is possible to resume work on a ship until we have completed the dismantling. The game also offers modes for those who don't like time limits, and others for those who live on the razor's edge preferring limited lives or even a nice permadeath. Mode for everyone Hardspace: Shipbreaker: we will be able to use the grip of the left hand to cling to the surrounding elements, both to stop floating and to prevent any jets from pushing us away All modes which, however, we advise you to select lateryou, after having completed the plot of the game which without surprises focuses entirely on the relationship between employers and the increasingly exploited employees. The theme is undoubtedly hot, but experiencing this slow revolt against the Lynx firsthand has proved to be a rather lackluster experience, despite the empathic cast with whom, however, we will mainly interact via radio and terminal. But the mere fact of having found a plot is already great news not only for Hardspace: Shipbreaker but for the whole genre of simulators, realistic or fantasy it doesn't matter, which are finally realizing that their gameplays are fantastic but to reach the general public, an extra effort is needed, a more complete and appetizing package than what was offered in the dark years. One of a kind Hardspace: Shipbreaker: where to start, from the engines or by stripping the internals? Everyone has their own strategy Hardspace: Shipbreaker is one of those games destined to become cult, and the first sales figures of this 1.0 version do nothing but justify the optimism. Being one of a kind is one of the best qualities of the game, such as its excellent physics which at first glance does not even seem to be so present, only to reveal itself in all its dangerous complexity. It's also great that there are so many modes: permadeath, lives numbered or infinite, with or without time limits. At Hardspace: Shipbreaker you really can play it however you want. The contents are not few, if you get the passion of listening to podcasts dismantling spaceships, you can spend hundreds of hours on this game. Provided you can handle the work in the absence of gravity: although the game has a command to make us hook with one hand to the surrounding environment, so as not to fluctuate continuously, it does not present any other type of help for those who risk suffering in similar circumstances of nausea. Zero G Hardspace: Shipbreaker: Be careful not to recycle the disassembled parts in the wrong conduits, or you will lose a lot of money in lost earnings The problem is that at least the first few days it's really hard to break away from Hardspace: Shipbreaker. Slowly you learn about the different models of spaceships, the different arrangements and how they are built; and then where to find the most important joints, how to position yourself to empty a chamber as quickly as possible; you slowly find your routine, your modus operandi which can be totally different from that of another player, exactly as if it were a real job to be optimized according to one's skills, intelligence, intuition. The concept is undeniably fantastic, the technical realization of first quality, it's the amalgam that cares Hardspace: Shipbreaker: the plot not very incisive even if in any case optional, the gameplay that would need a couple of more inventions to keep the attention of the passing player.", "date": "2022-06-22", "grade": "8.0"}