{"name": "Un dungeon da conquistare", "ref": "https://multiplayer.it/recensioni/131771-wayward-souls-un-dungeon-da-conquistare.html", "text": "Anyone who has been following the gaming world on the App Store for some time will probably remember Rocketcat Games, a team made up of only 3 people and which in 2009 gave birth to one of the first ~phenomena~ of the Apple online store, namely Hook Champ. Since then the boys have embarked on a path of great successes, with the publication of a total of 6 games that have collected millions of downloads, yet they have not moved an iota from the original lineup and from a certain type of ~productive values~ which also represent the common thread and the distinctive element of their work. It seems incredible, yet Kepa Auwae, Jeremy Orlando and Brandon Rhodes, these are the names of the components and founders of Rocketcat Games, have never even met in person yet. How can such a bizarre and in some ways unique team manage to ring together one best seller after another? Luck, talent, quality, ideas? We don't really care that much about the answer; what matters is that Wayward Souls, the new title of this trio, is really good. Wayward Souls is a very challenging roguelike of extraordinary quality Leaving is a bit like dying Another roguelike. Yes exactly, Wayward Souls is based on one of the most popular formulas of the moment. But as those who know the genre in question well know, the elements of roguelikes are only ~rules~ on the basis of which even completely different titles can then come to life. The work of Rocketcat Games obviously respects the aforementioned dictates, which translated essentially mean randomly generated levels and permanent death. Spiritual sequel to that Mage Gauntlet dated 2011, the game allows you to choose between 6 different characters, three of which are unlocked at the beginning, each with extremely distinct characteristics: warrior, mage, rogue, adventurer, spellsword and cultist. The aim is basically to go through randomly generated dungeons trying to survive as long as possible, eliminating all the enemies in each room and collecting objects, equipment, potions, spells and money. Very simple to say, less to do: because the hostile creatures are numerous and different from each other, each with dangerous attacks capable of heavily affecting energy, and with the bad habit of often attacking in groups. Combat is a fundamental element of Wayward Souls, and in this sense the work done by the team in trying to get the most out of the touch screen control system is commendable: movements are managed by the classic virtual stick on the left, while a tap on right handles the attack with the main weapon. The management of secondary attacks, linked to swipes up and down, is interesting: despite the risks of imprecision, in reality during our test we practically almost always encountered the happy translation into practice of our inputs, an essential factor for allowing fluid action and reduce deleterious sources of frustration. And it would have been a drama, because Wayward Souls is already quite difficult on its own: the energy bar drops mercilessly, the potions to restore it are extraordinarily infrequent, and the recovery of a part of it by passing from one floor to another is often not it is enough to ensure survival. In this sense, the development of the character becomes very important, which passes through the improvement of the equipment, but above all through the improvement of the characteristics and skills to be purchased before the start of the adventure. The purchase requires the virtual money collected within the dungeon during previous attempts: we would like to underline that it is virtual currency because Wayward Souls does not make any use of in-app purchases, with the promise that the only real money the user will have to shell out throughout the experience are those of downloading the game from the App Store. A courageous choice, and which represents a sort of step backwards after the freemium experience of Punch Quest and which we hope will be supported by the public. Going back to the game, the Wayward Souls formula therefore quickly proves addictive: each game is different from the previous one, and the inevitable death still brings with it a small amount of loot to invest, in the hope of being able to reach a higher goal with the next attempt. distant. Sure, those who don't like grinding might turn up their noses, but it would be a shame in the face of the many qualities of the game. A refined, balanced and engaging gameplay that marries and is perfectly supported by the graphic style, again absolutely recognizable: just like for the previous works, also in this case Rocketcat Games has chosen a fascinating and rich 16-bit pixel art styleor personality, never poor, and characterized by an absolutely extraordinary variety of environments, enemies and elements. The musical accompaniment is also of quality, with atmospheric songs that never make you want to activate the mute button.", "date": "2014-05-14", "grade": "9.0"}