{"name": "Ciao ciao", "ref": "https://multiplayer.it/recensioni/131755-sayonara-umihara-kawase-ciao-ciao-kawase-chan.html", "text": "If you don't know who Kawase Umihara is, don't worry: we didn't know either. Or rather, we didn't remember that platformer that occasionally popped up on Japanese shelves, selling a lot of copies and even influencing our local videogame production. An example? Team 17, creators of the popular strategy series Worms, said they were inspired by the SNES original Umihara Kawase when coding the physics for their worms' grappling hooks. The first episode of the Japanese series, in fact, dates back as far as 1994, and spawned some sequels, as well as a kind of compilation for Nintendo DS, which have never left the land of the rising sun, except when they were important to the fans who made something of a cult object. Flash forward to 2014, for the twentieth anniversary of the series Nintendo has well thought of locating the new episode, Sayonara Umihara Kawase, and offer it via eShop with its original title in Europe and with the title Yumi's Odd Odyssey in America. And here we are reviewing it. Kawasaki is back! But where had she gone? But above all who is it? And why do those fish have legs?! The 3D effect Neither fish nor fowl, allow us the joke: limited, it does its homework and in no way affects an entirely two-dimensional gameplay. Practically useless: turn it off as well. Kawase likes fish It is true, the title of this paragraph seems to be that of a porn film, but it is not our fault that the Japanese guys from TNN/NHK SC, developer of the very first Umihara Kawase, had invented this absurd scenario, which was then maintained in the various sequels and in this episode for Nintendo 3DS. Kawase and her friends (including one of her descendants and a ~chibi~ version of herself, long live the follies) are lost in an imaginary and abstract world made up of giant objects, suspended platforms and realistic-looking flying fish or they walk on dry land thanks to a pair of humanoid legs. That is, as you can understand it is not that there is a story or a rational premise, but a simple ~just 'cause~ that justifies the approximately fifty levels of play. The latter are actually not very large and with a little skill they can be completed in a matter of seconds: it is no coincidence that the game records our failures but also the record times, complete with a leaderboard to brag about our ability. Sayonara Umihara Kawase, moreover, is not a ~long~ title in itself and, indeed, it is possible to complete it in a few hours, but it only took us a few minutes to understand why in recent years it has also gained such a hold on the Western public. carving out a niche of loyal supporters. The level design is in fact excellent in general, focused almost entirely on the protagonist's weapon: a simple fishing line. In fact, we will play with two keys, one delegated to jump and the other to throw the line and, optionally, we will be able to throw the line diagonally using the backbones. This bizarre weapon can not only stun enemy fish, allowing Kawase or whoever to put them in his backpack, but mainly performs the grappling hook function a bit like in the classic Capcom Bionic Commando, only with much more accurate and convincing physics . You have to get carried away, mind you, but once you understand how to use it you can show off some truly spectacular stunts, taking advantage of every angle and millimeter to navigate the stages - especially the advanced, truly labyrinthine ones - and collect every object. The grappling hook can stick to any surface, and you can use the swing and momentum speed to perform realistically impossible maneuvers. In short, the ingenious and well thought out level design is the backbone of a title which, unfortunately, does not satisfy in the same way in the various other fields. Technically it is a colorful but certainly not exciting product, in which the classic 2D would perhaps have been more suitable than the questionable ~2D and a half~ chosen for this version, and the accompanying music - also proposed in a nostalgic 16-bit version - are pleasant but soon repetitive. The main problem of Sayonara Umihara Kawase, in the end, lies precisely in that same level design that we praised earlier, in the sense that the developer Agatsuma Entertainment has not managed to balance the pace of progression well, alternating the more excited stages with other really boring and frustrating: this is the case with most of the ~bosses~, for example, which are proposed as environmental puzzles without the slightest hint of a hint. The player must therefore intuit the solution, which in most cases consists of a maneuver or a particular use of the line, and almost always wait, turning his thumbs, for the boss toneutralize on your own. The difficulty in some cases borders on pure masochism, with traps and obstacles positioned in an intelligent way, but also a little too diabolical, thinking of millimeter jumps and a timing in the casting of the line of pure precognition. After playing it, we understood why YouTube is chock full of ~video guides~ that show the solutions of the various stages and show off all the skill - or maniacality, make vobis - of the players, mostly Japanese, who uploaded them.", "date": "2014-05-14", "grade": "7.0"}