{"name": "Agonismo da divano", "ref": "https://multiplayer.it/recensioni/131721-sportsfriends-agonismo-da-divano.html", "text": "Among the most original party games of recent years, Johann Sebastian Joust probably proved to be the project that best exploited the PS Move, despite not being a video game at all. The writer has literally devoured Douglas Wilson's experiment: at fairs or in private, against friends and colleagues from other Italian and foreign publications. Requiring large spaces, a computer and a good number of controllers, Joust however remained accessible to a very small number of people, until a Kickstarter campaign started two years ago in an attempt to offer it to the mass public. Thus was born Sportsfriends, a collection of four small multiplayer games made by as many independent developers in order to stimulate the good old local experiences, just like other indie titles such as Towerfall, Nidhogg and Samurai Gunn have done. J.S. Joust is a brilliant game that on PlayStation 4, however, is too narrow BaraBariBall and Super Pole Riders Introduced by an apt quote from the late game designer Dan Bunten, author of the classic M.U.L.E., Sportsfriends opens immediately with the possibility of choosing one of the four games in the collection: BaraBariBall, Super Pole Riders, Hokra and of course the aforementioned Johann Sebastian Joust. Dualshock in hand we start immediately with BaraBariBall, a small sports title in which, as in volleyball, the goal is to accumulate points by throwing the ball into the opponent's half. The variant lies in the fact that a point is earned only when the ball has completely sunk into the water below the playing platforms, which allows sensational last-second saves or frantic fisticuffs in an attempt to keep the opponent away. It must be said that the fun changes radically if you play in two or four: in fact, the arenas seem to have been created specifically for team challenges, collaborating with your partner and perhaps dividing the roles. Developed by Noah Sasso, the game features some interesting design ideas: your avatar has a limited number of jumps that it can perform within a certain time (therefore essential to avoid ending up in the water and drowning), and if you want you can sacrifice your stash to perform a special technique. The different arenas available, as well as the possibility of selecting characters with different characteristics, invite you to change your strategy from time to time, but overall BaraBariBall is the title of the most ~traditional~ collection. More bizarre and particular is in fact Super Pole Riders, a heavily revised and enriched version of the original Pole Riders by Bennett Foddy. It is a sort of mix between the game of polo and pole vault, in which you use a huge pole to push a ball up to the opponent's goal. Considering that the ball slides along a string in mid-air, scoring a point isn't exactly a walk in the park: by rotating the shaft thanks to the analog stick, you can give sharp hits to the ball, you can hinder your opponent or you can give an upward push to kick the ball. Super Pole Riders requires several rounds and quite a bit of practice, but when all the players are familiar with it, crazy situations and extremely fun matches are created. Playstation 4 trophies Although many of the 14 unlockable Trophies in Sportsfriends require you to win matches by activating particular options, there are some much more curious challenges. One of these asks to play Joust every day for a week, while another to play a game of Hokra under certain conditions on author Ramiro Corbetta's birthday. Hokra and J.S. Joust Unlike the two games mentioned so far, Hokra necessarily requires four participants in intense 2v2 matches: in the absence of four Dualshocks it is still possible to use only one per team, with each participant using only half a controller. In Ramiro Corbetta's title, the aim of each team is to get hold of the ball and keep it in their ~base~ for as long as possible: with passes, one-twos, interceptions, shots and throws, Hokra is among all the games in the package that most resembles a traditional team sport, fast, tight and highly competitive, despite a highly minimalist presentation. Finally, we close with what is undoubtedly the most interesting title of Sportsfriends, for many the real reason to buy the whole package. In Johann Sebastian Joust there is no need to look at the screen. Holding a Move each (Dualshock 4 are also fine on PS4), players must try to move while paying attention to the rhythm of the music: when Bach's notes go into slow motion, the controllers become sensitive to movementsthe abrupt, forcing each participant to move very slowly. Conversely, when the music starts to speed up, the challengers can move more freely around the room. The goal, as you may have guessed, is to try to annoy your opponents with pushes and pulls, trying to knock them out but being careful not to make too sudden movements. This creates absurd situations, with players trying to hide their Move before executing an attack, others preparing ambushes from behind, or even someone who prefers to stay at a distance waiting for the others to eliminate each other. It's a brilliant, physical and fun concept, a time machine that takes us back to the courtyards where we used to play Hide and Seek, Capture the Flag and Tag. And it is precisely here that the major limitation of Joust emerges in its incarnation for PlayStation 3 and PlayStation 4: unless you have a huge room, you have too little space to move freely and have fun, not to mention that the PlayStation 4 version of the game supports up to four players, too few to create unpredictable and really fun matches. On PlayStation 3 you can connect up to seven Moves, but the problem of space remains: how many can say they have a room large enough to accommodate seven people who chase, hit and move away? On home consoles, Douglas Wilson's game is really tight, and for an ideal experience we will have to wait for the release of the version for Windows, Mac and Linux, when with a laptop and a couple of speakers you can play anywhere: from backyard at the park. Provided, of course, that you have a good number of Moves available.", "date": "2014-05-13", "grade": "7.8"}