{"name": "Whistleblower", "ref": "https://multiplayer.it/recensioni/131526-outlast-whistleblower-di-nuovo-in-fuga.html", "text": "In a period in which the Internet, both the one linked to issues of global importance such as the NSA case and the slightly more frivolous one of the world of video games, seems to be unable to do without ~deep throats~, of insiders who at a certain point they take and spill the beans now assuming the role of ordinary sources of information, Whistleblower is very topical. In the first paid downloadable content of Outlast, in fact, Waylon Park is played, the engineer of the Murkoff Corporation from which the tip about the atrocities that happened inside the Mount Massive asylum started, pushing the journalist Miles Upshur, protagonist of the base game , to embark on the journey into madness that we have been able to experience on our skin on PC and PlayStation 4 in recent months. Our verdict on Whistleblower, Outlast's first DLC, real interactive torture porn Fear at 180 BPM It will be the youtubers who film themselves while they piss themselves, it will be the hype of Oculus Rift which is reflected in a natural way on experiences that seem to fit like a glove for its application, it will be the ~new Sony~ particularly attentive to indie and small productions, which had the idea of including Outlast in the portfolio of downloadable titles with PlayStation Plus, will be what it will be, but first-person survival horrors are finding themselves at the center of a decidedly favorable conjunction in terms of media and commercial interest. Outlast has tried to have its say in a landscape at risk of Methuselah Syndrome, taking to the extreme consequences one of the key concepts of this relatively young sub-genre, namely that of escape: prey to an evil much bigger than us, ready to tear us apart, here we you run away, but you run like hell, with your heart stuck in your throat beating at a mad pace, almost to the point of causing self-suffocation. Red Barrels has therefore chosen to raise the pace by giving the action impetuous lashes, which pierce the tension by investing the player with a mixture of panic and adrenaline, in an inseparable unicum which in the most successful situations is able to take him exactly where he wanted: to experience the primordial impulse to flee, desperately, for one's life. All enhanced by one of the most vivid and convincing renderings of a hand-held camera shot, which truly restores the unmistakable ~look & feel~ of certain themed films and television programs, from REC onwards. Whistleblower focuses on the same key elements, fugue and digital reprise, knowing how to extract some simple but spot-on variations on the theme from the hat, which in some passages shrewdly change the cards on the table managing to displace and please those who thought that with Outlast the Canadian team had played every number. But it also brings with it the heavy limitations of the original, making it a chase title in which you are hunted down by unstoppable brutes who don't seem to know how to turn the knob of a door, preferring to waste time knocking it down, or who, unless to seize in the fragrant they always look in the locker next to the one in which they are hiding, while more often than not the action becomes so linear and coercive that it could justify a pejorative revision of the concept of ~trial and error~ in the bad guy manuals game design. Goodbye inhibition brakes The valuable work done in terms of narrative and scenography takes care of maintaining the interest at high speeds. In addition to the ~Opposing Force~ effect of seeing places and experiencing facts that we already know through the perspective of a different character, an always very catchy expedient when it comes to enriching a basic universe without having the creative and productive autonomy of the sequel true, to convince is the shot correction. Outlast was already an extremely violent and deviant title, which soaked both hands in the sordid, pulled them out and threw what he had found in the player's face, hammering him with an oppressive and excruciating vis horror. It was really hard to imagine, but Whistleblower manages to up the ante even further, violating the sphere of sexuality without extenuating circumstances and staging a new theater of perversions that in some cases border on actual torture porn,  la Hostel. But it's not just degeneration. Red Barrels seems to have also looked to the virtue and the beautiful. Indeed, to the virtue and beauty that are no longer there, assimilating the lesson of BioShock which is remembered in some passages with a decadent and nostalgic cut, in which concepts that vaguely recall poetry, art and love appear. Similar but different, or the secret to a good expansion, which aims to confirm and questionthe original format. And this in Whistleblower succeeds great, with all the strengths and weaknesses that characterize it, whether they are of him or inherited from the half-successful nightmare of which he is the progeny.", "date": "2014-05-08", "grade": null}