{"name": "Cazzotti al buio", "ref": "https://multiplayer.it/recensioni/131531-shadow-fight-2-cazzotti-al-buio.html", "text": "40 million players on Facebook are certainly not a few, and represent the figure of the success of Shadow Fight, a fighting game born precisely for social platforms and now arrived, with a sequel, on iOS and Android devices in the famous freemium format. The game can therefore be downloaded for free, but with in-app purchases as a counterpart: the hard currency joins the virtual one not only to possibly replenish our energy bar (the one that decreases with each game and is recharged with time), but also and above all to allow us to buy new weapons and armor more quickly, or to upgrade those in our possession. The developers have decided to focus strongly on the objects with which we can spruce up our shadow warrior, a formidable fighter who has strayed from the path of wisdom and stupidly lost his life, and who now finds himself fighting against a string of opponents always stronger to recover what was taken from them. The many weapons available, each carrying a different repertoire of moves, in fact determine the ability to inflict damage, while the helmets and armor give the dark character greater resistance to blows. More than the simple increase in level, which also implies the learning of new techniques, in short, it is the objects that put us in a position to face a particular enemy or not, with a view to a structure that is very rich in situations and even with some variations on the theme (the duel, in which the equipment is random, or the survival mode), even if the weight of the freemium is felt relatively quickly, already during the first chapter, forcing the usual grinding of those who do not intend to spend money real. Shadow Fight 2 is an immersive fighting game with stunning animations and lots of items to unlock The shadow of a fighting game? Beyond the perplexities regarding the balance of difficulty, a few minutes are enough to get in tune with Shadow Fight 2 and appreciate the many advantages of the Russian title. The amount of animations available to each individual character is in fact incredible, even more so if we consider the fact that wielding different weapons completely changes the repertoire of moves, defining a set of unique approaches to combat. Hitting with bare hands, as happens in the first stages, implies a reduced range and effectiveness, whereas using sticks, for example, substantially increases the range of attacks and the damage inflicted by them. In the advanced stages, then, these tools are also accompanied by throwing weapons and special ~energy~ type moves, to close the circle of a production in which absolutely nothing seems to have been left to chance. The sensation of impact, which as we always reiterate is of fundamental importance in a fighting game, does not appear that marked in Shadow Fight 2, which is a real shame. Even in this situation, however, the amount of movements takes a toll, going to underline the technicalities and the strategy that regulate the clashes. All this is assisted by a technical sector decidedly up to the situation, which on the sound front does not shine or work miracles with the scenarios but, thanks to the expedient of the completely black characters, guarantees animations that are not only particularly rich but also fluid and realistic , the likes of which had never been seen before in the mobile sector. So what is missing for the game to really stand out on the App Store and Google Play? Probably greater attention to touch controls, which in the current configuration rely on a very unreliable virtual analog stick, which often mistakes a simple advance for a jump and can therefore make us lose a tightrope match, with all the frustration that could result. A ~digital~ alternative, with very specific and separate directions, would certainly be a better solution for what is the philosophy behind the clashes, very tactical and often fought on the ground, in a mix of timing and distance.", "date": "2014-05-08", "grade": "7.6"}