{"name": "Cooking Mama: Cuisine", "ref": "https://multiplayer.it/recensioni/cooking-mama-cuisine-recensione.html", "text": "The long story of Cooking Mama continues and somehow returns to its origins on Apple Arcade, as we see in this review of Cooking Mama: Cuisine, a chapter that recovers the original essence of the game as a simple cooking simulation made up of mini-games. After the disappointment with a lot of scandal attached to Cooking Mama: Cookstar, for this new chapter it seems that Office Create Corp. wanted to go back to the roots of the series, skimming the experience of any accessory element and simply focusing on the proposal of tiny gaming experiences placed in sequence, offering a remarkable variety of interactions and above all a great breadth of recipes to complete, with a constant expansion of contents. Talking about ~simulation~ is obviously improper in this case, given that the reinterpretation offered by the series it is far from realism, but the procedures indicated to complete the recipes reflect the real ones, so it is not out of place to say that with this game you can also learn to cook some dishes. There is no story, nor a progression structured into real levels: it is simply a matter of completing increasingly complex recipes, starting with the ingredients. The approach is so free that the initiative is left in the hands of the players, who can simply select the ingredients, the tools to use and then try to cook the dishes that can emerge from the various combinations chosen. The rewards are represented by the unlocking of further ingredients, work tools and therefore combinations and recipes, in addition to the possible additional customizations to be applied to the protagonist and to the various kitchen tools. The fact that the game is distributed on Apple Arcade also avoids the possible presence of microtransactions, which could probably have easily found space in such a structure. Kawaii masterchef Cooking Mama: Cuisine, the preparation of a dish This free approach helps to make the game particularly relaxing and enjoyable, like a simple pastime that can be enjoyed at any time without pressure. On the other hand, the gameplay is basic but can also present some demanding challenges, in the more complex tests: the mini-games are all focused on a particular action to be performed in the right way, with the correct intensity, speed or rhythm and remaining all within the time limits imposed. There are many variations on the theme, which correspond to the numerous actions that can take place in a kitchen: it involves cutting, kneading, cooking in the oven, frying and much more, with further variations given by the addition of new culinary techniques and tools that are unlocked and added as you progress through the game. The basic principle is a bit that of WarioWare, the title that started the wave of mini-games in collections which also included Cooking Mama in 2006: you have a few seconds to figure out what to do and perform the short actions in sequence, trying to stay within the limits set. It is a concept that is perfectly linked to the use of the touch screen, it is no coincidence that it thrived precisely in the years of the Nintendo DS and found new impetus with the advent of mobile gaming, an area in which Cooking Mama can be perfectly at ease. Cooking Mama: Cuisine, another recipe in progress And that's actually true: what emerges most from a Cooking Mama: Cuisine session is precisely the comfort and the excellent response to the commands, especially on larger screens such as iPads, as well as the elimination of all possible problems related to free-to-play and microtransactions being distributed through Apple Arcade. For the rest, the style is typical of the series, all built on simple 2D drawings and three-dimensional models that make the gameplay perfectly ~readable~, however with a particularly realistic rendering of some ingredients, thus creating a particular effect between the tone classically Japanese of the original Cooking Mama and some technological advances.", "date": "2022-06-21", "grade": "7.0"}