{"name": "Mari d'oriente", "ref": "https://multiplayer.it/recensioni/131202-wargame-red-dragon-mari-doriente.html", "text": "Red Dragon is the third incarnation of the Wargame series and, like AirLand Battle, is based on the mechanics of the first chapter, proposing itself as a stand-alone expansion enriched with new means and with a new series of single player scenarios. Wargame matches are based on the concept of map control and elimination of the opponent and the initial configuration of our contingent can be decided in the troop deployment phase which anticipates the action in both single player and multiplayer. Once the combat phase has therefore started, you move on to observing the map in search of traces of the enemy, with the help of the powerful zoom of the Iris Engine, while you send your units towards the positions to be conquered or held. Important positions that guarantee bonuses of various types and the fundamental possibility of calling those reinforcements that will save us on more than one occasion from pincer maneuvers and mass assaults. With Wargame: Red Dragon the war moves to the east in a really well done expansion Taste of sea The structure of Wargame: Red Dragon is the same as the previous chapters even if it undergoes some implicit variations due to the introduction of naval means. An addition that paves the way for sea battles and river movements that involve significant changes to the general gameplay as in the case of supply transport by sea. These no longer magically appear at the landing point but travel the stretch of sea that divides their arrival point on the map from the point where they will leave what they are carrying. The player also has the ability to intercept sea transport as well as having to garrison rivers and having to fight for control of areas entirely covered in water. There are no aircraft carriers or submarines, probably considered too complex to balance, but there are cruisers capable of launching long-range missiles or cannon fire that make naval forces very useful also for attacks on air and land troops. Furthermore, the absence of heavy naval vehicles is balanced by the presence of a fleet which, although not directly controllable, allows the launching of air flocks equipped with a moderate offensive power. Neglecting the sea could be very dangerous especially as land forces were balanced. Land strike groups no longer enjoy all the previous benefits and this makes upgrades and troop leveling play an even more important role. But this balance does not automatically make the sea an obligatory choice. Investing in expensive naval means without having adequate cover could result in a mere loss of points since even the largest vessels are decidedly vulnerable and the sea offers fewer hiding places than woods and forests. A factor that also increases the importance of the number of units deployed given the greater difficulty of protecting one's units from enemy fire. For this reason it is advisable, if one intends to take full advantage of the maritime component, to set up a global tactic from the beginning, avoiding placing a couple of ships just to do so, and carefully studying the initial deployment, organized as a deck of cards and saveable in code form, to refine it and share it with a community always ready to dispense advice and learn new strategies. Horizons of glory In Red Dragon the campaign, always based on the concept of a fantastical reinterpretation of important moments in modern history, is once again one of the strong points of the experience as opposed to what happened with AirLand Battle. Despite this, artificial intelligence does not seem to have made clear progress even if, given the complexity of Wargame, it has nothing to envy to that of various other strategic ones. In any case, the single player offers plenty of content with four intriguing and well-developed scenarios, adequately supported by the narrative component that drags us into the missions by making the most of historical events and characters. Nothing transcendental, mind you, and the paralyzed portraits of the characters cannot be even remotely compared to the cut-scenes of Command & Conquer, but we find the spectacularity absent in the outline once we enter combat. On the other hand, one of the strengths of the Wargame series is the aesthetic sector that gives us endless meadows, reflections in real time and the trademark of the series, the zoom, considerably enhanced with AirLand Battle, which allows you to switch from an extremely close-up view to an almost satellite shot. A possibility, this, which is hand in glove with the gameplay of a title whose means fight against each otherrealistic rooms and move freely for huge maps. The close-up view still has some flaws in terms of definition, but the overall result is still impressive. For this, and not only that, Wargame is confirmed as one of the broadest strategic in the current panorama and each chapter becomes increasingly rich in terms of aesthetics and content and this gives us battles literally crowded with units, spectacular to see and extremely varied . With more than 1400 units and the inclusion of almost all the most important military factions in history, Wargame has become an immense strategy and despite this entailing considerable difficulties in the balancing phase, the multiplayer remains enjoyable and fun. In the community, unfortunately, there is little patience with those who launch themselves into the online game without being ready to deploy their troops in a few seconds but luckily for us there is the single player that allows you to approach the title with all the calm in the world. However, the feeling remains that a nice rich and exhaustive tutorial would streamline the approach to the title and would also be useful for introducing newbies to a system that is not as complex as it initially appears but still rich, broad and full of elements to assimilate. Once captured by Wargame, however, the pleasure of playing does not fade even when it happens, not infrequently, to be beaten by human opponents and not even in those situations in which the enemy controlled by artificial intelligence manages to hurl about eighty means when our pool of points barely allows us to employ a dozen. In these cases the successful use of cover also allows you to set up particularly effective defensive tactics but between bombardments and balancing it is increasingly difficult to get away with a clear numerical inferiority. In this way, the synergies between the vehicles, made more varied thanks to the global balancing, and the movements of the troops on the strategic map take on even more importance.", "date": "2014-04-29", "grade": "8.0"}