{"name": "Guerre vichinghe", "ref": "https://multiplayer.it/recensioni/131193-war-of-the-vikings-guerre-vichinghe.html", "text": "Vikings, a people of warriors with dubious hygiene that never ceases to fascinate the collective imagination. Men whose breath is so heavy that when they put a mint in their mouth they turn it into M&Ms. People so rude that if you don't laugh after he tells a joke they'll cut out your tongue. Who wouldn't want to have participated in their war against the Saxons? From today you can do it in complete tranquility in front of your PC, thanks to War of the Vikings, a multiplayer white weapon battle simulator that puts you in the role of one of the two factions fighting for the conquest of some control points (Conquest mode ) or just for the sake of beating up enemies together with your teammates (Team Deathmatch mode). The combat system is simple and complex at the same time. Allows you to carry out different attacks depending on the direction in which you move the mouse after pressing the left button to start the blow. Parrying is just as simple, even if it requires a glance and quickness to understand the direction from which the attack to be neutralized is coming. The slashes can be more or less powerful depending on how long you hold down the left button to load them and, like parries, they are linked to the stamina bar which, once depleted, makes offense and defense less effective. There is no shortage of special shots and various skills, active or passive, to season everything and to allow the personalization of one's warrior, spending the money accumulated during the battles. The improvements can have a purely aesthetic nature, with various embellishments to our hero's equipment, or they can have a more functional nature for the gameplay, with for example the possibility to change a skill that we do not like, or to buy a weapon different from the one we have. From this point of view, the game by Fatshark, the development team, performs really well, without being penalizing for anyone and without resorting to various tricks to favor the poorest players. Sure, there's a slight bias in favor of the two-handed ax on the other weapons, but we're hoping that will be fixed soon with some balancing update. The various classes have different weapons to choose from: sword and shield, ax and shield, two-handed axe, bow and others. There are also secondary weapons such as hatchets or javelins, but as we will tell you in the next paragraphs, we had some problems using them. Yes, because despite the excellent premises, made even better by the beauty and variety of the maps, really well done from a graphic point of view (at least for a multiplayer title), we found quite a few obstacles in our test. Vikings vs Saxons: Who will win the World Cup this year? Ouch! You spawned on me The beauty of War of the Vikings, unfortunately, ends with the soundtrack, made up of songs that reflect themes of the time, because otherwise the game is stained by a whole series of problems that cannot be overlooked. Let's start with the reckless management of the respawn and the maps themselves compared to the game modes. From the description of the combat system you will surely have understood that it is very technical and that it can give great satisfaction because it allows a good growth of the player together with the game. This is true when you are in a position to exploit it properly, as in the aforementioned dueling servers or in generally uncrowded ones. Unfortunately, when you are in a server at full capacity, therefore with teams of sixteen players each giving each other a thrashing, big gameplay problems arise. The most obvious is certainly the chaos generated, which involves a series of limits to action. The first is that it is difficult to be technical in the midst of the fray, the second is the almost impossible to avoid or cause ~friendly fire~, also thanks to the terrible lag we will discuss in the next paragraph. In game terms, friendly fire translates into experience points subtracted from the accumulated ones, which would also be fair, if it weren't often completely impossible to avoid it. If we add the wild respawn to the chaos, with dead enemies suddenly appearing from behind you and killing you while you are busy fighting others, or with you reappearing in the middle of the fray, just in time to get shot 'head ax from a passing enemy (the reverse is also true, with enemies that suddenly appear in front of you and don't have time to notice your presence that they are already dead), it is clear that after a while the schemes they jump completely and all the charm of the white weapon, linked to the force system and directional parry, is a bit of a mess. From this point of view the conquest mode is less problematicca of that team deathmatch, given that the clashes are concentrated around the objectives to be captured and the respawn always takes place in safety zones, but the other considerations remain valid. They are also for twelve-on-twelve matches, where the chaos is only subdued. It is not clear why it was decided to offer clashes between so numerous teams in the face of very evident technical limits since the first beta, which have not been resolved over the months. Furthermore, there is another big flaw to consider, which ends up completely killing the game if you are not enormously patient and motivated... Honey, I'm late! Don't worry, it's just the lag The other big problem of War of the Vikings which we mentioned a few lines above is the terrifying lag that afflicts it. In fact we cannot know if and when it will be resolved, but given that the combat system is based almost completely on hand-to-hand combat and precision, it is an issue that cannot be avoided, also because it is one of those problems that makes the want to connect. In fact, when a server is crowded, even with very low pings (30-40, say), to be able to deliver one's blows one must anticipate the attack by a few decimal seconds compared to what is seen on the screen, because otherwise we inevitably find ourselves sliced. For example, it happened several times to be killed by ~phantom blows~, while in other cases we were unable to parry with the shield attacks against which we had clearly opposed, a sign that the blow had already been successful when we could oppose our reaction. Many players solve by attacking with their heads down, ignoring any defensive ambitions and carrying out flurry of blows, but you will realize by yourself that this is an immense limit for a combat system that otherwise could be classified among the most satisfying ever for clashes body to body. Thus, what should be a medieval combat simulator turns too often into a brawl between drunks who beat each other up as if there were no tomorrow. The matter is further complicated with thrown weapons, such as axes, javelins or bows, whose projectiles, in case of overcrowding, start more than a second after the end of the animation on the screen, nullifying any attempt to take the aim. As at the end of the previous paragraph, one wonders why it was decided to allow clashes between so numerous teams if the system is not able to handle them as it should. Wanting to add a little seasoning to the bad range we are facing, we could tell you about the numerous graphic glitches from which the game still suffers, the frequent crashes that brought us back to the desktop several times, some bugs identical to those present in War of the Roses (like the possibility of glitches) and so on, but I think you understand that the situation is not rosy and, therefore, there is no need to say more.", "date": "2014-04-29", "grade": "4.5"}