{"name": "Catalyst Black", "ref": "https://multiplayer.it/recensioni/catalyst-black-recensione.html", "text": "If mobile gaming has made great strides over the last few years, we owe it on the one hand to the investments of important publishers who have decided to extend the user base of their franchises to iOS and Android, on the other hand to the talent of independent developers with previous experiences of a certain thickness, therefore aware of what it takes to package a quality product. The latter is certainly the case of Super Evil Megacorp, the team that in 2014 revolutionized the MOBA genre in the mobile sector with its Vainglory , and which is now trying to take the same step in the vein of competitive shooters, but using the aesthetics and approach of a multiplayer online battle arena. What came of it? We tell you about it in the review of Catalyst Black. Gameplay Catalyst Black, a firefight The most particular and characterizing aspect of Catalyst Black is undoubtedly its gameplay, which incorporates the mechanics of the twin stick shooter with an isometric view, also using the concept of arena as mentioned. The scenario in which the matches take place, and which changes according to the mode, in fact looks like a MOBA map, with its central corridor and the enemies controlled by artificial intelligence hiding on the sides, ready to be killed at the end to provide us with an advantage in terms of progression. However, there are no upgrades during construction: our character, who is always the same as a base but can change gender and appearance by selecting one of the various skins available, can be equipped with a 'main weapon and a secondary (with limited ammo to collect around), some accessories that can provide small hints in terms of health, resistance and speed, as well as a ~mask~ that determines the transformation into a large, powerful creature. This feature can change the course of the match: by collecting certain objects and eliminating the aforementioned enemies we will be able to scroll faster the countdown that will allow us to transform and be able to fight with an independent health bar against our opponents, launching elemental attacks really powerful and different depending on the monster we become. Beyond this interesting variation on the theme, conventional weapons dominate the rest: from the basic assault rifle to the Gatling that accelerates as it fires, from the shotgun to the sniper rifle, passing through the flamethrower, there are really many tools that we will be able to use, unlocking them gradually and enhancing them thanks to the resources obtained with each victory. Mode Catalyst Black, the Colosseum mode with its PvE mechanics As a good free-to-play, Catalyst Black does not offer its users all the contents immediately, but rather proposes a path which, based on the level of experience achieved, opens up new possibilities. We therefore start with the Massacre mode, a six-versus-six deathmatch in which the team that reaches twenty-five eliminations first wins, and then move on to the Hydra mode, which sets the conditions for victory to kill the opponents three times , collect twenty fragments or destroy the ~base~ of the enemy team. After that there is the Colosseum mode, a PvE in which a group of players works together to take out five waves of increasingly powerful creatures, culminating in a spectacular boss fight; the Eventide mode, the most complex and full-bodied of the game, which in the context of a single match brings together a series of events with different objectives; and finally the Caccia all Bandiera mode, a variant of the traditional Capture the Flag that we all know. Catalyst Black, the character management menu The progression system designed by Super Evil Megacorp works very well and constitutes a solid starting point for those who begin to try their hand at Catalyst Black, given that certain modes are unlocked only after having done a few hours of practice with the simplest stipulations and immediate. The matchmaking support, however, works very well and it is possible to enter the game within a few seconds, without encountering problems related to latency. Clearly the possibility of upgrading the weapons and accessories of the characters through the inevitable system of prize boxes and the three in-game currencies (powder, quint and brands) open up to pay-to-win implications that are counterbalanced only by the aforementioned matchmaking, which deals with distributing skills in a balanced way to avoid giving life to meaningful matches unique. However, we cannot yet know if this solution will prove effective in the long run. Technical realization Catalyst Black, a fast-paced combat modeHydra As mentioned at the beginning, Super Evil Megacorp cannot count on the budget of the most famous publishers, but this has never prevented the Californian studio from packaging titles with great production value, real triple A mobile games made thanks to the use of a powerful proprietary engine and the presence of talents who have worked in important development teams on PC and console.Catalyst Black carries on this tradition by giving us an excellent set of characters and environments, delicious pastel shades and valuable effects to enhance the shots put to sign, explosions and environmental interactions. The graphics can be scaled for detail and frame rate so as to adapt even to older terminals, but at its maximum potential it is really beautiful to see. Catalyst Black, some of the monsters on the map The use of simple skins for the characters on the one hand disappoints, given that in fact the implications of a hero shooter-style setting that could have given further character to the franchise and given life to a real reference lore are renounced. but the equipment also influences the movements and animations of our fighter, who can become slower or faster depending on the gun. The sound sector accompanies the action in the best possible way, with epic-style orchestral music and effects convincing audio, while the touch control system is basically perfect, net of an annoying blunder: it sometimes happens that, instead of pointing the weapon, the right thumb makes the view splash towards the ends of the scenario, in a frankly useless way. It will therefore be necessary to separate the inputs well with the next updates.", "date": "2022-06-21", "grade": "8.6"}