{"name": "Drangleic 2.0", "ref": "https://multiplayer.it/recensioni/131043-dark-souls-ii-drangleic-20.html", "text": "Japan and PC have never gotten along very well. That of the Rising Sun is historically a land firmly anchored in console development, an ecosystem in which the hardware package necessarily keeps the control device and architecture intact until the next generation. For this reason, in recent years, the PC landing ambitions of the major Japanese publishers have appeared more as timid attempts to expand brands than as real commitments to change the underlying mentality. With the first Dark Souls, From Software appeared decidedly too lazy: the game could have effortlessly benefited from the performance increase of a medium-low-end PC of the time, but the team packaged a product in all respects identical to the console version including defects. A little over a month has passed since our review of Dark Souls II on PS3 and X360, and finally the new chapter is ready to embark on a different path in which to express oneself, free from the chains of the old generation. Dark Souls II arrives on PC with many improvements and the certainty of being the reference version! Stay calm during Back in 2012, Peter Thoman's DSFix was a lifesaver for Dark Souls on PC. The work on the modder's graphics libraries guaranteed amazing performances in terms of resolution and framerate, and when the modder himself declares that this sequel ~is a better experience and a better looking game than the fully modded Dark Souls~, fears they can subside. The PC version of Dark Souls II provides many interesting options to improve the graphics sector in a substantial way, first of all the FXAA filter, which guarantees a geometry of the models completely free from ladders and artifices of image post-processing. We liked Dark Souls II's shadows only partially: we appreciated From's commitment, but the result on consoles was barely enough. Among the available options, one is naturally dedicated to the possibility of deciding the quality of the latter, thus bringing them - in terms of resolution and focus filter - to a much higher and more satisfactory level than the low setting seen on consoles. The depth of field has not undergone a particular job as it has already been optimized, bringing only an improvement in cleaning in the distance. To increase its characterization and meet every taste, From Software wanted to take a typical factor of the saga - motion blur - and rightly divide it into two. On the one hand we have the blur applied to moving objects and bodies, on the other the blur of the view; it is up to the player to decide whether or not to enable the two effects according to their preferences. Effects such as dynamic lights, already noteworthy on consoles, have been retouched but not distorted, while the textures have been completely redesigned for the joy of those who are not limited to mere 1080p. In reality, there is an element that opens completely new doors to Dark Souls II compared to the counterpart released in March, a very important factor that completely changes the gameplay approach to the title: the frame rate. It is with pleasure that we confirm that this version of the title unlocks the flow of frames on the screen, with all the consequences of the case. The pleasure of the answer When present, the 60 frames are an essential element for a correct response to commands. Then when this element is a complete new entry for the saga, it is clear that it is easy to advise anyone who comes from Demon's Souls first and then Dark Souls to test firsthand how things change when fluidity is at home. The ability to have a 1:1 response is an added value that opens up a whole other game scenario, certainly a better one, and allows you to observe Dark Souls II in a completely different light. Awareness and hand-eye coordination make the learning and progression curve much easier; these factors provide a crystal clear, accurate, reliable, fast and absolutely new play touch for all those who have been accustomed to an on-screen update flow that has hit few highs and many lows in the past. All, of course, recommended only and exclusively with the pad. We would like to be able to say that Dark Souls II is a different game compared to the console version: obviously it is not, but the unlocking of the frames per second is such an innovative element for the saga that it must be at least witnessed by those who already have the title extensively concluded elsewhere. We do not exaggerate in saying that this feature radically changes the freshness of the enemy movement patterns, the use of objects, the strategy and the study of distance and execution framesction of the moves, making this PC version a step forward also in terms of play. Certainly not easier, but certainly less frustrating and more digestible. Even the viewfinder, a real defect of the console version, although not fully resolved, benefits from the flow on the screen with greater controllability. To differentiate this version, the Japanese team has chosen to create a direct line between the Steam account and the server of the title, leading - at least currently - to an absence of support for cloud saving, but evolving the server saving of progress in real-time, now no longer confined to a fixed respawn at the last bonfire touched but at the point where the game was interrupted for any reason, also carrying all the meta-data relating to destroyed objects and enemies killed in that session. Convenient, right?", "date": "2014-04-25", "grade": "9.3"}