{"name": "Attenti all'Ufo", "ref": "https://multiplayer.it/recensioni/130928-beware-planet-earth-attenti-allufo.html", "text": "Driven by rather simplistic dynamics, the so-called tower defense genre, in addition to being one of the most prosperous in the indie field and among the most appreciated by budding developers, has found new lifeblood with the spread of digital delivery and above all of mobile gaming, where it has established itself thanks to the intrinsic characteristics of the gameplay. Conceptually all very similar, the titles belonging to this peculiar strategic vein provide for the protection of a specific objective from the enemies of the moment, forced to overcome our defenses - generally automatic - tactically arranged along a more or less complex labyrinth. Among the numerous exponents of the genre Plants Vs. Zombies by PopCap Games is undoubtedly the most famous and loved, a real cult product which is also strongly inspired by Beware Planet Earth!, whose predisposition for quotations is evident right from the title ( that apes the film Mars Attacks!). Developed by the independent studio Lightmare Studio and distributed by Bandai Namco, the Australian title was created with the clear intention of not distorting the basic alchemy of the most classic tower defenses, while offering painstaking attention to detail and some elements that reinforce its personality and variety. Cows, crazy Martians and quotes in the latest effort by Lightmare Studio Mars Attack! From the font used for the game menus down to the smallest graphic and sound detail, it is clear that the source of inspiration for the developers were the sci-fi themed b-movies of the 50s and 60s, where the stereotyped Martians ( little green men with their brains on display) arrived on Earth aboard the inevitable and shiny flying saucers, obviously with very bad intentions. In Beware Planet Earth!, in suffrage of the ironic atmosphere that permeates the entire production, the object of desire of the invaders are however not human beings, but the cows, which we will have to protect at any cost and by any means to avert the game over. Within about fifty levels of increasing complexity, set in harvest fields over the course of the four seasons, the player must help the farmer Barnie (always locked up in the makeshift toilet) to defend his precious cattle, setting traps and gadgets of various kinds along the pre-established perimeter. To build the aforementioned machines, all based on household and rural objects, ~gears~ are needed which can be recovered both by placing distributors and by destroying the bales of hay with the laser gun, a trinket stolen from the Martians who plays a particularly important role in the global economy of Beware Planet Earth!. The aliens, in fact, belong to different classes and varieties, and some of them require the direct intervention of the player to be hindered. In addition to the basic soldiers, the classic cannon fodder, there are some like the private investigator and the mad scientist who must necessarily be hit with the aforementioned gun; the former, for example, cannot be knocked down by towers until it is ~unmasked~ by the player, while the latter equips a device capable of generating a shield - for itself and nearby allies - which can only be broken with a well-placed blow. The use of the weapon, also useful for temporarily strengthening the defenses, enlivens the gameplay by significantly increasing its interactivity and depth, a worry of other tower defenses where the action is often dedicated only to the positioning of the towers. Similarly to the laser pistol, whose operation is limited by overheating and cooldown times, it is possible to intervene directly to destroy badly positioned defenses - through the appropriate remote control - or to ring a cowbell which speeds up the return of the kidnapped cows to pasture and save. The ~bestiary~ is quite rich and varied, and in addition to the enemies already mentioned, the housewife Martians deserve a mention, complete with a vacuum cleaner capable of removing any traps positioned along the way, the incredibly resistant swats and the very fast ninjas, as well as the handful of armored bosses. In this edition of the game, which has just landed on Steam and can be purchased for around 8 Euros, several bonus levels have also been added where enemies and settings are inspired by the classic Valves, from Left for Dead to Half Life, via Portal and Team Fortress 2. A gem that further enriches the dish by placing the player before completely peculiar missions and challenges. As highlighted, overall the Lightware Studio title does not particularly shine for originality, however it leaves the apprezzare for some mechanics and the great care placed in the artistic system, as well as for the excellent level design. The stages and enemies, strictly in two-dimensional graphics, are coloured, well designed and pleasantly animated, while the arsenal supplied to the player, although not very vast, is diversified and able to stimulate the strategic approach and creativity. There are freezers that slow down Martians, barbecues that fire explosive projectiles, flamethrowers, mines, bombs, and so much more; a mix capable of satisfying both casual gamers and the most savvy tower defense lovers, to whom the veteran mode is dedicated.", "date": "2014-04-21", "grade": "7.5"}