{"name": "Steins;Gate", "ref": "https://multiplayer.it/recensioni/130852-steinsgate-tempo-ballerino.html", "text": "Steins;Gate, sequel to Chaos;Head, another visual novel released in 2008 on PC, was released for the first time in Japan in 2009, achieving great success. Developed by 5pb and Nitroplus, it followed the launch of the manga of the same name by a few days, which will also be followed by an enormously successful anime released in 2011, after the launch of the PC version, the one we got to try, which took place in 2010. There are also other versions of the game, which we mention in a dedicated box, but the only one available in a language that can be understood even in our parts is the PC version, recently translated. We don't believe the others will ever be adapted, unless there is an immense public demand. Steins;Gate tells the story of Rintar Okabe who travels with his friend Mayuri Shiina to a conference in the Radio Kaikan building in the Akihabara district. We won't tell you all the events that happen at the beginning of the game, for the simple fact that it would be a matter of revealing a good part of the plot, with some twists. Just know that at a certain point Rintar finds himself in front of the corpse of a girl, who he will later find alive. Finding out what happened and how everything is related to time travel is the entire development of the story, which proceeds by introducing the cast of main characters with great wisdom. The plot develops in various directions and deals with many themes, alternating serious moments with lighter ones. In general it is an excellent late adolescent story which, despite some winks at eroticism, typical of the genre, keeps its style unchanged from the beginning to the end. Let's discover Steins;Gate, one of the best visual novels of recent years translated into English. As we said in the review, there are many versions of Steins;Gate, unfortunately not even translated into English. In addition to PC, it can be purchased on Xbox 360, PlayStation 3, PSP, iOS, Android and PlayStation Vita systems. In fact they are all identical, except for a few details, so if you know Japanese and have one of these machines, you know what to do. Phoned gameplay Steins;Gate is a classic visual novel, so in terms of gameplay there is very little to say. You simply have to read a lot of text, which appears in a box at the bottom of the screen, but which is sometimes related to comics or other gimmicks, and push the story forward by pressing a button. If you want, you can make the text disappear to better see the images. Here too, as the genre dictates, there are several narrative turns that require choices to be made, in this case manageable via the protagonist's telephone. Doing so is very simple and does not create particular headaches, given that basically two situations can arise: in the case of a voice call, you have to decide whether to answer or not, or, in the case of text messages, you have to choose the words with which to answer by clicking on those underlined in blue (hyperlink style) in the received text. The minimal variations introduced on certain occasions do not change the basic scheme one iota, which remains the same throughout the adventure. We don't talk about the choices in detail, since to do so it would necessarily be necessary to make big advances on the plot. Just know that some narrative twists are really well thought out and that Steins;Gate deserves the fame it has earned among fans of the genre. Even in terms of longevity we are at very high levels, with more than thirty hours of gameplay guaranteed by the immense amount of text that tells the story. However, not all narrative sequences are of the same level and some will only be appreciated by those who love Japanese culture as a whole, even in its angularity compared to Western culture. For the rest there is little to say, if not to mention the quality of the technical realization, really high. For most of the time on the screen, excellent non-animated 2D drawings alternate, but sometimes 3D objects enter the scene that enliven the situation by bringing a little movement. There is also some well-made footage, which further enriches the charm of the game. One could hardly ask for more.", "date": "2014-04-21", "grade": "9.0"}