{"name": "Gunstar Future Heroes", "ref": "https://multiplayer.it/recensioni/gunstar-future-heroes.html", "text": "The good old days Gunstar Future Heroes represents, without too many words, a real leap into the past. The main game scheme is very similar to that of Contra or, to stay in more recent times, Metal Slug: in fact, you control a character in horizontally scrolling levels literally stuffed with enemies, obviously ready to do anything to facilitate the appearance on the Game Over word screen. The story that forms the backdrop to the events is nothing more than a dull and banal justification for the classic theme of ~alone against all~. The possibility of choosing between two different heroes, Red and Blue, does not bring with it substantial differences, except for the main weapon and some dialogues. Stuff of little importance therefore, so much so as to make the two protagonists practically identical at the time of the practical act. But the merits of Gunstar Future Heroes are certainly not to be found in the narrative plot or in the variety of characters present, but in the goodness of the pure and simple gameplay. The control system is extremely responsive, and responds well to the player's requests. The mechanics are not complex, and as in the best ~old school~ titles it is in fact possible to jump, shoot with the various weapons or fight hand to hand with enemies; these range from simple ~mass attack~ opponents to half-screen large bosses capable of ending dreams of glory with a couple of hits. All rather conventional then, but executed with great care as one would expect from a Treasure work. However, what gives an edge to this production for GBA is the variety; the classic stages just described are in fact interspersed with shooter sections, in various ways, and platformers. A clear attestation of the care taken by the programmers in the realization, even if it must be clearly said that Gunstar Future Heroes is not a game for everyone; the level of difficulty - provided you don't go below normal - is quite high, even too much for some, and despite the variety just described, there is nothing new or surprising in the effort of Japanese programmers. For many but not for everyone The technical aspect is certainly excellent, bearing in mind the limits of a piece of hardware that has been on the market for almost 5 years. The on-screen sprites are plentiful, and also of a good size and full of detail. The settings are also absolutely positive, equipped with sufficient variety, colorful and enriched by effective levels of parallax. Too bad for some slowdowns in the most agitated phases of the game, which in any case do not penalize the gaming experience too much. Not much sound instead, not irritating but anything but unforgettable. However, the major limit of Gunstar Future Heroes is to be found in longevity, limited to 6 levels that are far too short; and when we say short, we mean that completing the entire game takes less than an hour. Undoubtedly too little, since just as few are the stimuli for replayability. As if that weren't enough, this episode for GBA represents almost entirely a re-adaptation of the original, since a large part of the settings are directly imported from the Megadrive. Tribute to the value of the masterpiece of 12 years ago, or laziness of Treasure, it's up to the single player to decree it. The absence of a cooperative multiplayer mode is the final blow that sinks the duration of a title that is far too short. Comment Freeing the mind from the sweet influence that the original Gunstar Heroes can have on the judgment of this episode for GBA, Treasure's latest effort proves to be a product of a decent level, but far from being unforgettable. While enhanced by a leading technical sector, and refreshed by the variety of diversions to the main game mechanic, Gunstar Future Heroes slips away in less than an hour, reaching the end credits without leaving great emotions. Too ~old school~ and not very accessible to enter the hearts of young gamers, too faithful to the chapter for Megadrive to stimulate the nostalgic, and too short for anyone who spends the necessary money to buy it. For heaven's sake, we are a long way from the disaster of Guardian Heroes Advance, but today's Treasure is only a distant relative of that of the golden age. Sin. Pros Technically excellent Quite fun Good variety Cons One hour of gameplay No multiplayer Can be played without getting excited Gunstar Heroes for Megadrive was one of the titles that most contributed to creating the fame of Treasure, recognized by many as one of the most creative and gameplay-oriented teams in the video game market. 12 years after the original, the Japanese programmers have decided to return to the brand in question, creating a product from scratch to the delight of all the fans who avehopes have long since been lost. On Ps2? Or on next-gen consoles? None of this. In fact, Treasure wanted to focus again, after Astro Boy and Guardian Heroes, on the good old Game Boy Advance, strong in a monstrously large catchment area, but above all capable of accepting a two-dimensional production without any haughty and snobbish disparaging attitude.", "date": "2005-12-05", "grade": null}