{"name": "Vita o morte?", "ref": "https://multiplayer.it/recensioni/130765-dead-nation-vita-o-morte.html", "text": "It was the end of 2010 when Dead Nation peeped for the first time on the PlayStation Store. Made by a team highly experienced in the shooter genre, the game offered a fresh and interesting take on zombie-based twin analog shooters, putting you in the shoes of two heavily armed survivors determined to eliminate as many non- dead, in a desperate journey towards what could be the last hope for what was left of humanity. The title was the protagonist the following year of the ~Welcome Back~ package, offered by Sony to all PlayStation Network users as compensation following the well-known problems due to the violation of the digital platform by a group of hackers. A sort of ~dress rehearsal~ for the Instant Game Collection, we could say, which helped to further spread the Housemarque branded product among PlayStation 3 owners. Last month was therefore the turn of Dead Nation: Apocalypse Edition, reissue for PlayStation 4 with improved graphics and the inclusion of the Road to Devastation DLC, with its extra modes ~Arcade~ and ~Senza Fine~, capable of further enriching the offer. The circle closes today with the PlayStation Vita version, a reduction of the 2010 original and available both in the standard format (7.99 euros) and in a bundle with the aforementioned expansion (9.99 euros), the latter also on sale separately (3.99 euros). However, those who already own the game on PlayStation 3 can download it for free thanks to the cross-buy function. Dead Nation remains a great zombie shooter, but the PlayStation Vita version disappoints Us against the world A portable reduction of Dead Nation was not only now in the air, but it also seemed desirable to us, given the potential that twin analog shooters are able to express in a mobile context. However, it is also true that we are talking about a rather old title, which practically everyone has played, which makes this umpteenth edition more of a ~duty~ than the answer to a real need, which is not simply to increase the game library of PlayStation Vita with a shooter that can still have its say and count on a solid foundation. There have been no changes in the campaign (which can be tackled both in single player and in online cooperative multiplayer mode) and in the levels that compose it, full of zombies to mow down thanks to a less impressive arsenal than the Apocalypse Edition for PlayStation 4 but far from it that skimpy, featuring assault rifles, light machine guns, shotguns and various heavier attack tools, all upgradeable through a mechanism that uses the money collected in the scenarios, found in crates or in the trunks of abandoned cars , and which works in parallel with an armor customization system that can offer us balanced characteristics of strength, agility and resistance. Therefore, although starting from a tested and engaging gameplay, the Dead Nation experience on PlayStation Vita starts uphill due to a fairly serious problem with the controls. The analog sticks of the Sony portable console are in fact too small and sensitive to allow us to aim with the right stick and open fire by acting on the backbone R without the pressure causing the device to wobble and, therefore, result in the loss of the target. The only way to remedy this drawback is to remap the keys (fortunately it is possible to do it completely freely) and assign fire to the left back key, a valid solution all in all but which inevitably makes the gunplay lose its charm. The developers could have opted for an autofire operated by the right stick or insert an aim assist system to maintain accuracy, but they didn't do it and this clearly affects the enjoyment of the experience. PSVita trophies Dead Nation contains a total of thirty-five Trophies, obtainable by completing the various missions of the campaign, collecting all the pieces of armor, upgrading the weapons to the maximum and dedicating yourself to ~numerical~ achievements: burning a thousand zombies, killing five hundred with melee attacks, a set number of headshots, and so on. Little zombies The presence of only two back buttons on PlayStation Vita has inevitably influenced the layout of the controls, forcing a small revolution which in many ways distorts the original setting of Dead Nation. If on PlayStation 3 and PlayStation 4 it was in fact possible to play using almost exclusively the various L, L2, R and R2, on the Sony portable console it was necessarily necessary to resort to the main buttons for recharging, themelee attack and dash, which forces you to momentarily leave the weapon and makes maneuvers lose a bit of cue, especially evasive ones. The controls aren't the only drawback to this conversion though. On the one hand we have in fact a rather dancer frame rate, which drops more or less conspicuously depending on the amount of zombies displayed simultaneously on the screen, which makes the excited moments rather chaotic and confused, further worsening the shooting accuracy; on the other hand, the poor visibility problems already reported for the ~major~ versions do not benefit from a smaller display, on the contrary it is practically a must to increase the brightness of the options to be able to clearly distinguish figures that are often tiny but no less lethal for our alter ego. Beyond the goodness of the original system, which holds up well despite the almost three and a half years since its debut on PlayStation 3, the picture outlined by this new edition of Dead Nation for PlayStation Vita is therefore largely below expectations due to some questionable choices and a general lack of optimization.", "date": "2014-04-16", "grade": "6.0"}