{"name": "Campioni del cuore", "ref": "https://multiplayer.it/recensioni/130719-mondiali-fifa-brasile-2014-campioni-del-cuore.html", "text": "There are just under two months left until the fateful date of June 12, the day on which the Brazilian soccer World Cup will open, which has always been the soccer event par excellence since, as per tradition, it will see the most important national teams on the planet compete to win the title of world champion. Accompanying the fans in the long weeks that will separate them from the event, as well as during a tournament which will be attended by millions of fans from the stands of the stadiums, and more than a billion viewers from home, there will not only be the various themed television broadcasts, the matches and feats of players, but also the usual carousel of licensed products. In the videogame field, for example, there will be a dedicated title by Electronic Arts, which did not miss the opportunity this time either to start from the solid foundation of FIFA to build a spin-off that abandons local competitions to focus on the maximum one, as mentioned before, the most coveted trophy. Following the tradition of the previous themed productions, the FIFA World Cup Brazil 2014 offers a series of modalities linked to the world event which will be held in June, in the colorful South American country, in an explosion of colors that already begins with the menus, designed following the box style used by smartphone operating systems. From there you can choose which events to participate in among those available, ranging from the classic friendly to the actual tournament, which can be played starting from the qualifying phases to rewrite the history of the various groups or from those already defined, up to the various online modes. But let's proceed in order. EA brings all the excitement of the 2014 World Cup in Brazil to PlayStation 3 and Xbox 360 Xbox 360 goals There are 48 goals offered by FIFA World Cup Brazil 2014 for a total value of 1,000G. To obtain them you need to be able to win a series of challenges in the different modes present in the game or within a match, such as being able to make complex feints, a certain type of goal, qualifying as an Oceania team in Destination FIFA World Cup or Lead the national team, or achieve a landslide victory. Play online For those developing a title like this, the challenge is to create a package large enough to justify the full price and not succumb to comparison with the annual release of FIFA, which draws from a larger pool of licenses. EA Sports has 203 national teams available here, all with licenses for players and shirts, but above all the 32 teams that had access to the final tournament. You can decide to start from the official scoreboards or reshuffle the cards and choose teams that have not been able to access the competition: whichever direction you take, the ride towards the trophy can obviously take place offline as well as online, trying your luck against other flesh and blood players bone. The online mode Destination Rio de Janeiro is proposed as a softened version compared to the regular competition, where once the groups are finished you risk being left out at the first defeat: here you have to move to the sound of victories and objectives through a stylized map of Brazil by making steps forward or backward depending on the success of the challenges; for example, it may happen that you have to score a certain number of points in a given number of games to move on to the next step. To keep the title alive during the World Cup and beyond, a special selection of scenarios called Story of the Finals will be gradually inserted, which after each match of the final phase will ask you to repeat the exploits of the players who have faced each other for a few minutes on the real playing field . For those unable or unwilling to connect, or waiting for the kick-off, the same type of content but related to the qualifying phase of the last two years has already been developed and included on the disc, so if you want to retrace step by step the arrival of your favorite teams in Brazil, you can do it right away. In exchange, you will get experience points and credits to spend within the EA Sports Football Club catalog. Alone, disconnected from the Network, the FIFA World Cup Destination modes can also be played, where in the role of the coach you must manage the squad by training it, making them play friendlies in preparation for the final phase and help them win the qualifying round, and Guida la Nazionale, a sort of player career mode in which to guide a young talent to conquer the World Cup and the captaincy of his national team. Alongside the package of main modalities - in total there are about ten - EA Sports has made sure to review and better integrate the modalityt Training, and then to reintroduce secondary but welcome options into the offer such as the five-match mini-seasons. To the rhythm of samba The beating heart of the gameplay is obviously composed of that set of elements that characterized FIFA 14, but the initial feeling that nothing has changed in this sense is swept away after a few games. In fact, if it is true that in general the game base is that, it is equally true that the developers have filed some aspects. The response of the commands, for example, especially in the dribbling phase, has been revised to be more reactive, making the dynamics of managing the ball a little more accessible, and a similar discourse has been made to enhance changes of pace and direction of the players, which consequently are more snappy. Thanks also to a mini set of new animations, virtual footballers tend to try to recover the ball when it slips away, perhaps by attempting a touch with the heel, heel or toe, but at the same time it is easier for them to lose balance or overbalancing in an attempt to get on a too long pass or in a tackle. The latter have in turn been reworked, so as to reduce the abuse of harsh interventions during hand-to-hand combat between athletes. The different physicality of the players is always felt both in the way they move and in the way they act in the tackles, with the bigger ones who make their size weigh more on the smaller ones, but it is also easier for the referees to whistle this time to what happened instead in FIFA 14. The result is a slightly faster gameplay, where the user can count, in the construction of offensive and defensive actions, on a good contribution from the teammates managed by the CPU, which boasts a discreet artificial intelligence that allows it to start attack or cover plots that are decidedly more effective than those seen in the recent past of the saga, albeit good ones. The ball itself is a little heavier, by virtue of a physics redesigned on the real one of the Brazuca, the official Adidas-branded ball of the championship, and this helps to make more believable passes and shots, especially in free kicks. These, in their second incarnation, like corner kicks, present an important novelty compared to the fourteenth chapter. In fact, during set pieces, it is possible to manage up to four different tactics by recalling them using the directional cross on the pad. Strategies are not ends in themselves, but rather contribute to making set-piece actions less predictable. In fact, you can decide to place a man to disturb the opposing goalkeeper, or to let three men enter the area by starting them from the edge, while as many teammates make the opposite movement, that is, they go out, crossing each other with their teammates to free them from the markings to allow them more freedom in the header. The goalkeepers aroused some perplexity in us, awake yes but also authors in some circumstances of a couple of egregious errors at the near post, and sometimes headers, to execute which on the one hand, as always, it becomes important to take a position on the opponent before detaching, on the other hand this solution didn't always seem to work properly. And the momentum, the most difficult and cursed opponent by FIFA users? As well as in the fourteenth regular episode, during our test it didn't seem particularly invasive to us, apart from a certain softness of the legs on the part of the teams we manage at the end of a couple of decisive races. But it must be taken into account that the treacherous comes out when you least expect it, and often after a certain number of games or tournaments, so it is not excluded that it may peep out in all its odious virulence. For completeness of the record we must say that Electronic Arts has repeatedly stated also to our microphones that momentum does not exist, that there is no obscure script that ~directs~ the artificial intelligence and it is only a perception of the users when maybe they put less focus on the game. World Cup faces FIFA World Cup Brazil 2014 offers full coverage of the tournament with official licenses for both the event and the participating teams. Unfortunately, as has been the case for some time for the regular series, once again EA has shown little attention towards Italian fans: in fact, if we exclude those already present in the past, or remade last year, such as those of the AC Milan players , the faces of the vast majority of our national team athletes are generic or out of date. Still seeing Pirlo today with the face of when he was ten years younger and beardless, or athletes now of international renownional like Maggio with an absolutely anonymous face is frankly annoying. Especially considering that even Tim Howard, goalkeeper of the United States, has been updated with the addition of his bushy beard. As for the faces of the coaches, nineteen of them have enjoyed a digitization treatment, and among these there are also Alberto Zaccheroni, coach of Japan, and our CT Cesare Prandelli. Like on television As far as the technical part is concerned, from a graphic point of view there are not huge changes compared to FIFA 14, as was logical to expect for this generation of consoles. However, there is no shortage of tweaks that have served to make the most of those surrounding elements that make up the match event, from the entrance of the fans to the stadium, complete with an external shot of the plant from above as in the Playstation 4 and Xbox edition One of the fourteenth chapter, to that of the teams in the field. Then there are various scenes with the race in progress, such as when one of the technical commissioners is framed cheering on his team, the cheering public in front of the maxi screens in the squares of the main cities of the world, from Paris to London, from Tokyo to Rome, or the face of the attacker who misses a goal already scored. Everything is further embellished by a series of choreographies made up of fireworks, confetti and various shows in the stands, often resulting from an important goal that has just been scored. And from replays, in most cases closer to the action in order to make the vision of what is re-proposed more spectacular, including the celebrations after a goal by the players themselves, who can also show off new ones. Too bad that the same treatment in customizing the way of celebrating the most famous athletes was not also reserved for the way they run or move, making them similar to that of their real counterparts, which would have further increased the sense of identification of users with their heroes . However, the polygonal models of the players are still excellent, well proportioned and well animated, thanks to an increase in the number of their animations. The reproduction of the uniforms and the surrounding details are also of excellent workmanship. Returning to the theme of stadiums, the game features eighteen stadiums for qualifying - nine original and nine fictional - plus the twelve official venues of the tournament such as the San Paolo Arena, the Beila Rio and the legendary Maracan. Each of the arenas that will host the world challenges has been reproduced in a very accurate way, with a decidedly remarkable abundance of details. Or What about the commentary? As always entrusted to the tested duo formed by Fabio Caressa and Beppe Bergomi, the commentary to the matches is dynamic, fast, and seems to follow the actions that take place on the green more or less well, apart from a few sentences that are sometimes a little out of tune with the context , as per tradition now for the series. However, there are new introductions to the competitions, specific comments on athletes, nations and statistics relating to the facilities or in general to the past World Cups, plus a handful of unpublished sentences on some actions, even if we are still far from the completeness and beauty of the English one. However, the commentary as it is also helps to identify the gamer with the event in progress. In this sense, an equally important role is played by the choirs that accompany the various moments of the match or the aforementioned choreographies in the stands. The chants follow each other at an unceasing rhythm, the boos underline a crucial mistake by one's favorite or the attacking actions of the opponents who are looking for a draw, vice versa the applause the successful plays of the champions and so on. Final note on the beautiful soundtrack, which musically reflects the geographical area in which the event will take place, thus proving to be rhythmic, cheerful, with songs such as The World Is Ours by David Correy feat. Monobloco, Blackbossa by DJ Bitman and the official song of the tournament edited by Pitbull/Jennifer Lopez & Claudia Leitte, namely We Are One (Ole Ola) to stand out from the others.", "date": "2014-04-15", "grade": "8.0"}