{"name": "Il caro benzina", "ref": "https://multiplayer.it/recensioni/130648-trials-frontier-il-caro-benzina.html", "text": "There are games that define a developer's story. In the case of RedLynx the reference title is undoubtedly Trials, obviously together with all its sequels. The Finnish studio, despite having been in business since 2000 with its debuts between N-Gage and PC, experienced great success with that Trials HD of 2009 for Xbox Live Arcade on Xbox 360. From then on there were Trials Legends , Trials Evolution and the upcoming Trials Fusion, with the latter representing the franchise's next-gen debut. In the meantime, RedLynx has also proved to be quite prolific on iOS and Android, with a series of more or less convincing games but never really able to leave their mark. Evidently with the very intention of aiming for success with a capital S even in a competitive environment such as that of the online stores of Apple and Google, the studio owned by Ubisoft has chosen to play its ace up its sleeve, giving life to an episode of Trials specially designed for mobile platforms. Trials Frontier does not hit the target, mainly due to a poorly thought out freemium formula For a handful of diamonds Trials Frontier, this is the name of the product in question, is a freemium game. A choice in some ways obligatory to reach the general public, but also intended to determine the balance and the very structure of the gameplay. But let's immediately clear the field of doubts: Trials Frontier is not a simple academic reduction of the formula offered by the console episodes, but on the contrary a title designed and created specifically with smartphones and tablets in mind. A choice destined to have repercussions on many elements of the game, to the point that confusing Trials Frontier with a previous chapter in the series is absolutely impossible. First of all for the most obvious aspect, i.e. the graphic component: in this case, in fact, a more rounded and cartoony style was chosen, undoubtedly less realistic than the one used up to now, and capable in all likelihood of helping to attract that type of user more casual until now completely extraneous to the irreproachable rigor of the RedLynx product. Because Trials Frontier actually has very little in common with the chapters of the main series other than the simple fact that it revolves around driving a trial bike. The graphics are only a piece of a larger work, which also involved the gameplay itself; on the other hand, thinking of tackling the exact same mechanics via touch controls would have been able to give even the most patient and avid fan chills. For this reason, the Finnish team has opted for what is to all intents and purposes a sweetened version of the one appreciated on the console: much more permissive and simplistic, with four virtual keys (acceleration, brake, weight shift forward and backward) that allow you to piloting your vehicle within levels that are generally much shorter and less articulated than those to which RedLynx has accustomed us, moreover with the obligation to repeat them several times due to the game structure created for this occasion. Certainly the track design is a key component to decree the success of the product: in reality, despite the quality and experience of the Nordic studio being perceived, it is inevitable to find less inspiration and in general a lesser source of interest in the Trials Frontier paths and stimulus for the more experienced user. However, where RedLynx has chosen to bet is precisely in the freemium system, which inevitably required a revision of the classic formula. First of all, there is a reserve of petrol, destined to fill up by waiting for (real) time or by leveling up. In order to be able to tackle each single route, you need to spend (initially) 5 units of petrol, which once finished can be bought or in fact restored by waiting patiently. In Trials Frontier then a plot component takes shape in a robust way, a glue between the various levels which is accompanied by the presence of different characters with whom to converse. These, all present within a small village that acts as a connection point, essentially allow you to assign the missions to the player's alter ego, who will then have to complete them thanks to his pilot skills. Often it is a question of collecting certain objects, which can be either pieces to improve one's two-wheeler, or simple trinkets useful only to the NPC who has requested them. The fact is that, instead of guaranteeing the obtainment of these objects simply by completing the races (perhaps within a time limit), the procedure passes incoherently through the need to spin a sort of wheel of fortune, hopefullymaking sure it stops at exactly what you need. Alternatively, it will be necessary to repeat the race (using the precious petrol) or spend the precious diamonds - or the second and precious game currency - to make another spin of the wheel. A decision that mortifies the player's skill element, instead focusing strongly and excessively on luck: and if the blindfolded goddess does not assist, it is inevitable to fall into a spending loop between petrol, diamonds, coins and possibly real money. It is therefore essentially the umpteenth declination of one of the most exploited formulas lately for freemium titles, and unfortunately also in this case the result is not favorable for the player: sooner or later, in one way or another, one inevitably finds himself faced with a microtransaction to deal with to make the otherwise tedious progression more sustainable. And so Trials Frontier becomes just ~one of many~.", "date": "2014-04-14", "grade": "6.5"}