{"name": "Clonare se stessi", "ref": "https://multiplayer.it/recensioni/130575-warlock-2-the-exiled-clonare-se-stessi.html", "text": "Warlock 2: The Exiled left us a bit dumbfounded. Let's clarify right away that whoever is writing this article has played the first chapter for almost two hundred hours, so he can't be suspected of antipathy for the game itself or for the turn-based strategy genre. The big problem with this sequel can be illustrated by talking about the download size of the review code. Let's go in order: a few weeks ago we received the code to test the beta version of the title, of which we wrote a preview illustrating all the new features it contains (link). About three weeks have passed since the publication of that article. A few days ago we received the review code, which can be activated directly on the old version. If you read the preview to the end, among our hopes you will see that of having more news. Lo and behold, when we downloaded the review code, we couldn't help but notice the download of a few megabytes. Now, after years of doing this kind of job, we have accumulated some experience, so we know that on a game that takes up about two gigabytes of hard disk space, such a small download can only have an influence limited. Starting the final version of the latest effort of Ino-Co Plus we were sadly comforted in our assumption. To be honest, we could copy/paste the test to tell you exactly the strengths and weaknesses of Warlock 2: The Exiled, keeping a few words for the obvious bugfixes and the introduction of the editor to create your own maps to exchange with the community. In short, we just have to transform the questions we asked into statements and the review is written. It remains only to verify how much the few innovations actually influence the dynamics of the game to draw the appropriate conclusions. Will a few subtle changes in a tried-and-tested formula be enough to justify the price of the new Warlock? Exiled mode So, compared to the previous episode we have two big news, namely the Exiled mode, which joins the Sandbox one, and the possibility of designing your own contents; some minor changes, such as the new faction or the limits on the number of productive cities that can be maintained at the same time; and some new cosmetic additions, such as new worlds and some revised graphics. Otherwise Warlock 2 is identical to the first episode, both in the interface and in the majority of menus and selectable options. But let's take a deeper look at the new mode, which still has its problems. Exiled mode offers a campaign in which the player must move between the astral planes by overcoming quests and reactivating the portals that connect them. Unlike the Sandbox mode, in which the world is a single block and in which the portals lead to superfluous areas for the final victory, in the Exiled mode the floors are small fragments of maps that overlook the void and move from one floor to the next. 'other is required to be able to complete the campaign. The new structure opens up to interesting solutions at a strategic level, above all thanks to the limit of active cities that can be managed simultaneously (going beyond the pre-set number creates unhappiness in the population, with the possibility of having riots that cause cities to lose control). The problem is that some critical issues also arise from it. For example, the division into fragments has made navigable areas rare. So, in fact, the infrastructures and sea units have become almost useless (what is the use of ships when at most you have to deal with lakes of a few squares?) Another problem is the randomness with which you explore the floors, given that sometimes you end up in places defended by very powerful troops, even if you are in the early stages of the game. You will understand that facing very powerful werewolves with basic archers is not exactly the best of life. This translates into time spent growing cities so they can produce more powerful troops before moving forward. Or in a river of troops to be sent to the massacre hoping to be able to undermine the enemy defenses. Fortunately, this situation does not always happen, but, especially at higher difficulty levels, the stalemate on one floor makes it convenient to start the campaign from scratch and hope for a more friendly conformation of the universe, rather than continuing to massacre troops. Note the very last mission, decidedly disappointing given that it actually puts the player in confrontation with troops so powerful that it takes hours to beat. Honestly, it seemed more like a way to lengthen the broth than a choice dictated by the desire to create something epic. Editor, factions and a few other news Let's talk briefly tooof the editor, the other big news worthy of mention of Warlock 2: The Exiled. Fortunately, from this point of view, the developers have kept what they promised and anyone, even the least savvy users, can create their own maps and then share them online with a click. There's not much more to say, really, unless you want to go through the tool option by option. Know that the menus are clear and intuitive and that everything has really been done to make the life of modders as simple as possible. If you don't want to commit too much, just a few clicks are enough to create a map. In short, it is a very comfortable tool that we invite you to try if you decide to buy Warlock 2: The Exiled. Less decisive are the other additions. For example, the new faction is certainly pleasant to drive, but apart from the aesthetics, it doesn't have very original troops. Let's say they are a mixture of the others, with little that is characteristic. On the other hand, some significant adjustments are pleasing, such as the rationalization of the search for spells, now arranged on a tree diagram that takes away the terrible randomness of the first chapter, or the greater clarity in the construction of city infrastructures, now more rational. As you will understand, these are novelties that are more reminiscent of those of an expansion than those of a completely new title. The confirmation of this impression comes from the technical sector, equivalent to that of the first chapter. In fact, not only are the graphics the same, but the soundtrack has also been recycled. Not bad, given the genre, but a few more elements of differentiation would not have hurt.", "date": "2014-04-11", "grade": "7.0"}