{"name": "Gli acchiappaspiriti", "ref": "https://multiplayer.it/recensioni/130564-destiny-of-spirits-gli-acchiappaspiriti.html", "text": "Born from the collaboration between Sony's Japan Studio and the developer of Lumines and Meteos, Q Entertainment, Destiny of Spirits follows the trend of free software - the so-called free to play - with which Sony intends to characterize the PlayStation Vita library in an attempt to animate it in periods of slack (which up to now, unfortunately, have followed each other at a worrying pace). Furthermore, this ~joint venture~ is a particularly ambitious project, because instead of being a game that you download, play and finish there, it is a kind of Massive Multiplayer Online with strategic and RPG nuances that make it more difficult to catalog but also more interesting than it seems. There is a certain maintenance and update work behind Destiny of Spirits, which involves the presence of Mephistophelean microtransactions that often risk ruining even the best ideas: will this be the case? Despite its originality, Destiny of Spirits struggles to be little more than a fun pastime We are all a bit evocative Not that Destiny of Spirits has a real story, but at least it offers a premise - actually a bit disturbing - which justifies all the ambaradan: apparently the supernatural world has been corrupted by the sins of human beings and many spirits are turning to evil, which is why our task will be precisely to recruit the few remaining good spirits to get rid of the bad ones. Essential and superficial, the plot of Destiny of Spirits only serves to contextualize a ~hunt for spirits~ that is very reminiscent of Pokmon. It is not the only thing that the Q Entertainment title has in common with the Nintendo brand, however, and it is enough to start a fight to understand it: the player can in fact assemble a party of six spirits (only three of which are on the front line, however) and pit him against enemies in semi-automated turn-based battles. The spirits attack on their own whenever a dedicated gauge is filled, and the player can simply change their target or use the unique ability each spirit possesses. The fact that the spirits possess only one power each, plus a passive support ability that triggers only if the spirit who owns it is at the head of the group, negatively affects a strategic structure that is a bit too fragile, mostly enough on the relationship between spirits' elemental attributes: in pure rock/paper/scissors style, water spirits inflict more damage than fire spirits, fire spirits do more damage to metal spirits, and so on. In short, the surface is not very different from that of Pokmon, but if you go scratching you don't discover who knows what depth and the fights soon become an exercise based above all on the composition of the party than on the actual intervention of the player. Thankfully, the battles aren't particularly long, even if they can appear a bit spartan as the illustrations of the various spirits aren't animated and the special effects of their attacks are basic to say the least. Once the battle is won, you earn at least two types of currency, and here things start to get more complicated: in short, get ready for a long tutorial that will overwhelm you with a little too much information at the same time, making the first few games quite heavy. PSVita trophies Destiny of Spirits offers only twelve Trophies: nine bronze, two silver and one gold. Earning them is not very difficult and some are obtained by performing basic actions such as connecting every day or purifying a certain number of areas. Around the world Despite its very simple combat system, Destiny of Spirits is based on a network of mechanics, features and options that at the beginning can displace precisely because of the world in which they intersect with each other, depending on each other. The Spirit Points earned at the end of the fight, for example, are spent to fuse spirits: it's the only way to make them level up, sacrificing a spirit that we may not like to enhance another. The other currency that is earned by fighting, the Summoning Stones, is used to summon new spirits and add them to our collection. There is also a third currency, called Destiny Orb, which the game gives out only in very rare cases and which is used to summon spirits that are much rarer and more powerful than normal, such as those inspired by other video games such as Knack. The Destiny Orbs also allow you to unlock some limits imposed by the game and, needless to say, they can be bought with real money in the PlayStation Store: the purchase is not absolutely mandatory, mind you, but it leverages the players' collecting obsessions and at a certain point we had the strong feeling that Q Entertainment aplayed a little too much on downtime to invite users to put their hands on their wallets. The energy of the spirits, for example, takes really too long to regenerate, and the purchase of Destiny Orbs to speed up the procedure becomes necessary when you want to face long game sessions. It being understood that the Internet connection is essential: without Destiny of Spirits it simply does not work. The reason lies in the interesting ~social~ structure, so to speak, devised by Q Entertainment, which exploits the player's geographical location to establish his starting point in the journey to purify the world, the type of spirits he can summon - and that changes depending on the area it is in - and the relationships it can form with other Destiny of Spirits players. Through a simple menu, the player can exchange spirits, entrust his own or borrow them, enjoying special bonuses during fights and expanding his collection. We do not hide from you that, despite the basic repetitiveness and the limits imposed by microtransactions, it is precisely the quantity and variety of creatures that, in the end, pushes you to connect even once a day and for a few minutes: fans of esotericism or more simply than folklore they will love this aspect of the game, which features the most diverse mythological creatures in the graphic style characteristic of the geographical area to which they belong.", "date": "2014-04-11", "grade": "6.0"}