{"name": "Che la caccia abbia inizio", "ref": "https://multiplayer.it/recensioni/130532-the-wolf-among-us-episode-3-a-crooked-mile-che-la-caccia-abbia-inizio.html", "text": "For an introduction to the series, we refer you to the review of the first episode. The one we review here is the third one, A Crooked Mile. In all there are five episodes and, as always in these cases, we will have to wait for the end of the series for an overall judgment. Finally, if spoilers are keeping you awake, we recommend skipping directly to the comment box at the bottom of the article. And so was that bastard Crane. We understood that he was a creep, but paying Lily to look like Snow White and then... no, better not think about it. The photos we found in the bloody room are all too telling. The only thing that matters now is finding Crane. Even if in a corner of our minds the doubt remains: all right, he was a pervert, but does that also make him a murderer? Something doesn't add up, and it's up to us to figure out what it is. When we finally put the picture back together, a face will pop out. And for that person it will be pain. Thus begins A Crooked Mile, the third episode of the series, with a tight manhunt that sees Bigby and Snow working shoulder to shoulder. No Fable or nook and cranny of Fabletown will be spared. The pace of the investigation is fast-paced and wide-ranging. This episode weaves together the scattered threads of the narrative into a solid plot within which all known characters find their place. The developers have been able to dose and alternate action, investigation and dialogue scenes that give space to all the voices of Fabletown. In fact, the investigation is no longer a private matter for Bigby. Everyone seems to have something to lose or gain in this mystery, while others have already lost a lot, like Holly, Lily's sister. For the first time since the story of A Wolf Among Us began, we feel close to the characters we see on screen, an achievement achieved in the course of this third episode, digging into their personal conflicts and intertwining them in a game of alliances and rivalries. When we first started playing, we didn't really care who the killer was. At the end of the episode, however, we couldn't wait to have the next chapter in our hands, even if it was just to settle our personal account with the first, very bastard, antagonist of the series. In A Crooked Mile, Bigby will discover that creatures more dangerous than him live in the woods of Fabletown A new food chain As in the second season of The Walking Dead, also in The Wolf Among Us we see the face of the true villain of the series at the end of the third episode. And finally the tension rises. Indeed, the quality of the enemies is a measure of the stature of the hero, and this time Bigby has encountered a predator stronger than himself. To tell the truth it seems that behind the antagonist we see in the foreground there is an even worse one, but they are still part of the same group. What we interact with makes an unexpected and impressive entrance. Charismatic, unusual and perfectly characterized, the villain of A Wolf Among Us is a tough nut to crack with which we drool with the desire to measure ourselves again. And this with regard to the final climax, to which we arrive one step at a time, following the rhythm established by the screenwriters, which rises and falls between long revealing dialogues, brutal confrontations and brief inspections. The result is an episode that does not let us get up from the chair until the end. The control over the succession of sequences is still in the hands of the director, but there is a central moment in which we can choose where to start the search for clues among the three places available, although it does not seem to influence much the way in which the subsequent events. The feeling we had after playing the first few episodes, and which is now becoming increasingly clear, is that Bigby can affect the lives of the other characters, sometimes permanently, but not on the main narrative. This aspect connects to the second storyline of the game, all internal, which concerns Bigby's painful attempt to repress his wolfish nature. In this regard, the question Snow asks him at a certain point is revealing, tormented by the doubt that the sheriff of Fabletown likes it when things take a turn for the worse because he can give in to his own impulsiveness. Maybe that's the way it is; but can a wolf be asked to behave like a lamb? The problem is that the wolf in question no longer lives in the woods but shares a neighborhood in the heart of Manhattan with other people, and every time he loses control, someone gets hurt. We verify it once again on our skin in A Crooked Mile, because the game confronts us with Bigby's irascibility without giving us a break. As much as we try to be good, and whohe writes has always played the part of the ~good guy~, we find ourselves in situations which, catching us off guard and goading us to the quick, push us to bare our fangs. The result is soul wounds, or a broken nose. And anyway, in the end, the pressure built up will be so much that when Bigby turns into a wolf we will feel the blood spurting in our veins. Finally free. Finally on the right side. Finally we can destroy. But at what cost? Take your pick and you will find out. As far as we're concerned, we've seen and felt enough emotions to start taking this series seriously. Who knows, maybe by the end of the fifth episode the interest hasn't turned into love.", "date": "2014-04-11", "grade": "8.4"}