{"name": "Winning Eleven", "ref": "https://multiplayer.it/recensioni/130442-nintendo-pocket-football-club-winning-eleven.html", "text": "Calcio Bit is a football management game that first appeared on the Game Boy Advance in 2006, developed by the ParityBit team. If these names don't tell you anything, don't worry: the game was in fact only released in Japan, while the programmers themselves are practically completely unknown to the Western public. The fact is that the good success of that debut paved the way for a sequel, which was initially planned for the Nintendo DS; however, development delays caused the project to migrate to Nintendo 3DS, with the publication of Pocket Soccer League: Calciobit which took place domestically in the summer of 2012. Almost two whole years later, Nintendo has therefore finally decided to bring the latter also produced in Europe, renaming it Nintendo Pocket Football Club and placing it on the market only through the less risky sales channel of the eShop. Nintendo Pocket Football Club has potential, but the flaws in the implementation are so many I thank the coach for the trust Nintendo Pocket Football Club is certainly not a classic football manager, so if it's Football Manager you're looking for, or if you want official licenses and real teams, you'd better look elsewhere. If the basic concept is similar, i.e. playing the role of manager of a training of amateurs to be strengthened and guided in the victory of championships and cups, the development and realization are extremely different. Hiroyuki Sonobe, head of the project and already involved in baseball and horse racing titles in the past, has in fact chosen to apply a particular vision to the genre, stripping it of a large part of the apparently intrinsic complexities and shifting the focus more to pleasure of watching a game rather than managing it, thus trying to replicate the sensations generated by watching a real football match. The introductory phases allow you to apply a good degree of customization to your team, being able to decide the name, the uniform, the club colors and the crest. Having overcome this decision-making part, you are therefore inside the main screen intended to act as a connection point for all 6 areas that act as the theater of the different sections present: in summary, the Training Center in which to improve your team, the Club Headquarters basically to act on the market, the Federation where to consult statistics and calendars, the Stadium in which to play matches, the Clock Tower where to save progress and finally the Airport to access the multiplayer component. It doesn't take much to learn how to navigate the various areas mentioned above: either thanks to the rich and complete tutorial, or for the less rigorous approach, as mentioned, Nintendo Pocket Football Club is a title that will hardly be able to intimidate even the less accustomed to this kind of games. All in all, this is precisely the greatest value of ParityBit's effort: having managed to create a football manager that does not require wasting hours between statistics, dozens of screens and menus, and that does not require expertise at the level of super course of Coverciano. All this also thanks to the graphic component which, although it cannot be said to be beautiful in an absolute sense (indeed, in reality it is decidedly poor) can boast such a characterization as to be able to be appreciated and convinced without too much hesitation. Pushing on the stylization and the reference to the 8-bit era, in fact, the Japanese team has found an intriguing, colorful, pleasant and simply ~nice~ aesthetic solution that is perfectly suited to the spirit of the game. In fact, moving on to the actual gameplay, undoubtedly among the most successful aspects is the management of the growth of one's squad: in practice, by facing the various matches you can obtain cards, each with a specific type of training such as for example dribbling, passing , punishments, but also stretching, mini-match, video analysis or the training camp, the spa, the autograph session and so on. The stronger the opponent is, the more tiles you will get. Each single card (up to three can be used at a time) improves one or more specific types of skills, based on the player's potential and aptitude. With a little luck and experimentation it is also possible to discover specific combos, or associations of two or three cards capable of unlocking even more effective special training sessions. It is a formula that, albeit with some imperfections, manages to remain quite interesting and stimulating, in fact proving to be the most in-depth and convincing of the entire game. Alongside the various ~normal~ teams that it is possible to face in a friendly match for guadagnare cards there are also special formations, with characteristics such as to allow specific training. Unfortunately, however, the latter must be unlocked through in-app purchases, requiring a further outlay which, however, at the time of the review we are unable to quantify, given that the relative section of the eShop is still deactivated. The 3D effect He limits himself to giving a minimum of depth during the meetings, but with an absolutely negligible result. In short, it is better to leave it off to save some battery. I thank the fans and teammates who helped me Faced with a game deliberately and expressly created with the intention of simplifying and making it easier to approach the genre of football management, it would be foolish to complain about the lack of depth and the lack of facets in the playful offer. Consequently, this is certainly not the reason for our criticism of Nintendo Pocket Football Club, which on the contrary manages to entertain and involve during the first hours of the game despite the evident repetitiveness of the required actions. Where, on the other hand, we have identified problems is in some precise and conscious game design choices, destined to make even the less expert users turn up their mouths. Probably the most controversial and complicated to digest lies in the impossibility of changing the speed of the meetings, each of which requires about ten real minutes to allow the virtual ninety minutes plus recovery to be completed. If at first the morsel can be sweetened by the graceful aesthetic characterization, it takes very little to start finding yourself impatient with the choice of ParityBit; decision that turns out to be even more wicked by discovering the almost total lack of influence that one can have on the fate of the match and on the behavior of one's team, in a sort of absurd denial of the responsibilities of the role of manager and coach that one is called to cover. The only way to get a handle on something is through a substitution: contextually with the change of a player, in fact, and only on that occasion (as well as during half-time), the user can change the tactical attitude (offensive, balanced or defensive), the playing area with distances between departments and man markings. A microscopic window of action, after which we find ourselves once again occupying the spectator's chair. And if by chance you don't want to make a replacement? Or what if, even worse, all three changes have already been made? Resign yourselves, new Trapattoni, because in the world of Nintendo Pocket Football Club, there is no alternative. Perhaps you are in the 75th minute, down by a goal, and would like to order your team to rely on long balls to attempt the coup? Niet, nada, you can't. There are no precise strategies that can be applied and used when needed, but only generic ones. You have chosen to line up your team with a prudent 4-5-1, but during the match you want to switch to a more aggressive 4-3-3? Also in this case, it is not possible: in fact, the formation is decided only before the start of the game, after which it is practically carved in the rock, totally untouchable. It is, as easily understandable, serious errors that impoverish the highlight of the entire experience, excessively limiting the user's influence and leaving too much room for chance and luck, and soon also for tedium and boredom. The section linked to the transfer market is also limited and questionable, which allows you to operate only against a small list of randomly chosen players; there is no faculty, for example, to go and look for athletes with certain characteristics and abilities in other formations, but one must be satisfied with the little that the convent passes. And even if you are lucky enough to find a pawn suitable for your team, it is not said that you can hire him: the price of the salary to be offered is in fact precisely pre-established, and you cannot make raises to try to convince those who have refused, nor lower the offer in case the budget is tight. This whole series of stakes inevitably take away a good part of the pleasure and fun, making the search and purchase of new players very mechanical and not at all rewarding. Absurd then the absence of important indications such as age, and even more the fact of keeping hidden the value of the potential that becomes visible only once a player has been purchased. Which then, given the inconceivable management of contracts, this limit turns out to be only the bearer of an extra step: with all due respect to the unions, in fact, the contract can be terminated with aown player at any time, even immediately after buying it, thus recovering the entire amount spent. Also worth mentioning is the unbearable repetition of the usual text messages when accessing certain menus (such as ~ok, it's time to take the field. Open your ears~) that appears every single time the tactics screen is opened. Finally, a few words also for the multiplayer mode, through which StreetPass and SpotPass can be used for ranking and local matches; in addition, it is allowed to share up to five players in the ~Friends Market~ with their acquaintances, who will then be able to obtain a copy of their players by paying for their salary.", "date": "2014-04-09", "grade": "6.5"}