{"name": "Ether One", "ref": "https://multiplayer.it/recensioni/130266-ether-one-in-viaggio-tra-i-ricordi.html", "text": "The panorama of indie games expands with the first interesting production of the developer White Paper Games, a small Manchester studio that wanted to reinterpret the genre of graphic adventures using the Unreal Development Kit. The player plays the role of a doctor who, thanks to futuristic technology, manages to enter the memories of an old woman with dementia with the aim of manipulating the traumatic events of the past to prevent their harmful consequences. If the plot brings to mind an often misunderstood (by critics) film like Inception, you are on the right track: however, we like to remember other small and large pearls of the videogame past, such as the immortal Myst from which the desolate landscapes seem to re-emerge dreamlike; the introspective Sanitarium and Planescape Torment and their plots made of amnesia and identity searches; to stay on the subject of first-person games, it is impossible not to remember the forgetful agent XIII, in a Ubisoft title with which Ether One shares the curious cel-shaded graphics, or the cryptic Gone Home from 2013, with its stories to be recomposed with memories just like the ~Restorator~ of this adventure must do. However, what we believe may have been the greatest source of inspiration for the boys from Manchester is To The Moon, the touching work by Kan Gao created with the antediluvian RPG Maker and published a couple of years ago, i.e. shortly before the White Paper Games project came to life. Ether One does not offer action, but fascinates and involves like few others A guided story Ether One, like the Freebird Games project, belongs to that category of games that English speakers would define as ~story driven~: the player is left with minimal freedom of interaction to make him more involved in the story being told. In fact, in this title it will only be possible to collect a few more or less useful objects for the purposes of the plot, and then use them to solve the puzzles, sometimes bizarre but never trivial, which arise during the exploration of the imaginary English town of Pinwheel, recreated from the mind of the sick woman. The very specific choice to eliminate the inventory ensures that only one object can be carried around at a time; however, the possibility of returning to your laboratory at any time, where you can store what you believe may be useful at a later time, expands, albeit in a somewhat cumbersome way, the spectrum of choices left to the player. There are, in perfect Baldur's Gate style, dozens of notes, books or posters to read (obviously in English, the software does not have localization in our language) between which lines you can hide useful clues to continue the adventure or more simply to better understand the patient's experience. There are two ways of completing Ether One. The first, trivial and quick (it probably won't take more than four hours), involves collecting a series of red bows scattered across the extensive landscapes created by the developer; in the second, the recommended one, it is also necessary to solve the puzzles mentioned before. In this way, projectors can be repaired, inside which fragments of memory are kept which help to shed more light on the traumas experienced by the woman in her childhood. Note that not all puzzles can be solved within the same setting. Some objects may appear only by continuing in the plot, which obviously will require the player to retrace his steps. The pace is rather slow: if on the one hand this choice allows you to carefully study the level and the objects to collect (most of which will be completely useless), on the other hand it could quickly lead to boredom for those who do not have to deal with the right spirit this adventure that makes the plot its strong point. It is a story that deserves to be discovered but which requires a good dose of patience especially during the opening bars when countless streams open up which only later flow into a unitary narrative plot. Voices from another world During the adventure we will be accompanied by a voiceover: it is the doctor who follows us on this journey into Jean's mind and who represents the only point of contact with the real world. There will also be other interventions by the same patient or by other people who for some reason are involved in the unfolding of events. The level of acting is discreet, while the work done on the soundtrack, entrusted to Nathaniel Apostol, already at work on Project Zomboid, is of a high standard and perfectly accompanies the delightful graphics of Ether One. The technical sector is certainly worthy of praise especially if we consider the relative inexperience of the members of the development team: the choice to rely on the always audacious cel shading seemed spot on to us, given that with this ploy it is possible to overshadow some low resolution textures. The color palette used for the reconstruction of Pinwheel is also convincing; in certain glimpses it is almost hard to believe that this well-kept project was created by a developer with limited financial capabilities. There are also some venial errors of inexperience: rarely some bug could force you to repeat a part of the level, while the code didn't seem properly optimized to us, so as to embarrass systems with minimum requirements.", "date": "2014-04-03", "grade": "7.1"}