{"name": "Il gran finale", "ref": "https://multiplayer.it/recensioni/130120-bioshock-infinite-burial-at-sea-episode-2-il-gran-finale.html", "text": "The first fraction of BioShock Infinite: Burial at Sea, DLC divided into two parts that extends the experience of BioShock Infinite, led us to visit an alternative Rapture, seasoned with a pinch of noir more than the one visited in the first two BioShock and characterized by role changes for the main characters of the story. Polished brass, happy citizens and clean carpets welcomed us into an underwater dream city with Big Daddies engaged in the maintenance of the complex aquatic structures and little sisters with a still human complexion led by apparently sane teachers. But behind the facade here is a suspicious sentence, strange masks and absurd characters, anticipations of what we would soon find ourselves in front of. We knew it, things looked different but the epilogue seemed written in destiny. The experiments, the degradation, the mad dream of omnipotence of beings unable to face the human condition, everything was ready to explode even in this Rapture, everything had already happened in a part of the city, an incubator of an apparently inevitable future. And the inevitability, in the finale of Burial at Sea, also seemed to involve the protagonist in a decidedly macabre cliffhanger. A new perspective By launching BioShock Infinite: Burial at Sea - Episode Two (in Italian Funeral at Sea - Part 2) we would have expected to start again from the ending of the previous segment which had ended with a Pyrrhic victory that ended in tragedy. A bitter epilogue that plays an important role in this second chapter of Burial at Sea but is resumed only after a peculiar introduction that leads us to face a new change of perspective. This time, in fact, we take on the role of Elizabeth, first met as a damsel in distress and then almost a noir femme fatale, and we are not in a dark underwater city but along the Seine in the middle of a suggestive period Paris. Edith Piaf's voice welcomes us to a dreamlike place, beautifully made, full of life, colorful sparrows and happy citizens who greet us as if we were the belle of the romantic comedies of the 50s. The evocative song la Vie en Rose is first played on the radio and when we move away it is Elizabeth who sings it, then a shopkeeper whistles her and shortly after the melody is prolonged by an accordionist to be finally carried in triumph by some street musicians whose notes are even accompanied by a celestial choir with a Disney flavor. In short, we start with an introduction that bears witness to Irrational's desire to amaze us one last time, an overture dedicated to pure happiness, the artificial happiness of dreams and films, magnified by the authors with the obvious aim of making the inevitable arrival of the most effective nightmare. The breaking effect is telephoned but the intensity of the whole is such as to still be struck. The beginning, in essence, contains all the values that characterize the trilogy of Irrational, a software house that has given us a series with excellent gameplay but whose true essence is a magical elixir made of suggestion, criticism of man, nostalgia and vintage science fiction. A real journey into the author's dystopia which, after a second chapter developed by third parties and all too similar to the first, had the strength to renew itself to give us an impressive ending crowned by a very thick DLC. The finale of the finale, or the second Burial at Sea, is the grand-style greeting of Irrational Games and a Levine determined to devote himself to smaller productions, perhaps tired from too many efforts, compromises and problems that have characterized an impressive production such as BioShock Infinite. Silence is golden The structure of Burial at Sea - Episode Two is the same as the first part of the DLC and includes doors to open, codes to find and lockpicks to recover but the situations are fresh enough to avoid any inference about a possible commercial nature of the DLC. The gameplay doesn't change radically, mind you, but it adapts to Elizabeth's nature, more intellectual than heroine and therefore much less resistant and strong than Booker. And here the stealth mechanics become fundamental which are supported, first of all, by the implementation of a plasmid that allows you to identify enemies through walls. Not that this is necessary in the case of the Big Daddies, impossible for the protagonist to deal with but slow and noisy enough to be easily spotted, but Elizabeth's low resistance makes even seemingly fragile enemies dangerous. In these cases, fortunately, the crossbow comes to our aid, an offensive tool conceptually backward but made incredibly effective by tranquilizer darts that neutralize instantaneousenemies eagerly. Too bad there are few bullets and for this reason weapons in general are tools to keep for emergencies in a title which, as the stealth only ~1998 mode~ suggests, allows you to face any situation without shooting. But calculating the times and proceeding crouched flush with the wall is not enough to overcome patrols and crowded rooms. In some situations, for example, it happens that we have to throw ourselves from great heights, as in the case of the hooks to which we can hang ourselves with the grappling hook, and it is necessary to crouch with good timing to avoid producing dangerous noises. Furthermore, some environments are intricate and on several occasions the ground is strewn with broken glass and puddles of water that produce suspicious noises when they come into contact with the protagonist's feet. Yet, despite the addition of these elements, the stealth dynamics are not penalizing and the developers have been very careful, perhaps too much, to avoid that enemy frustration of experiences based on a strong narrative component. Precisely for this reason, we assume, the positional audio has been enhanced and allows us to easily identify enemies, the carpet allows us to jump without producing excessive noise and it is possible to use sound decoys to distract enemies and cut short in case the situation is too complex. The result is a rich stealth dynamic, perhaps not suitable for those looking for an absolute but intuitive challenge and blended perfectly into a gameplay which, as far as the rest is concerned, is the classic one of the series. The medkits are essential, the EVE substance is necessary to activate the powers and the grappling hook allows us to stun the enemies even if Elizabeth, weaker than Booker, cannot use the tool to hurt them once they have identified us. But there is another novelty and this is a new minigame related to picking locks. Nothing amazing, mind you, but another small touch, seasoned with an apt aesthetic choice that also recurs in various cutscenes, which, together with a decidedly longer duration than that of Burial at Sea, testifies to the commitment made by Irrational in this sumptuous swan song. A farewell in style Irrational's greeting to BioShock fans has the form of a full-bodied DLC that leaves no openings for easy criticism even in terms of duration. We are talking about six hours which bring the total of Burial at Sea to almost nine hours for a total calculation, compared to a price of 19.99 euros for the two DLCs combined, comparable to that of titles sold at full price. All of this, among other things, is characterized by a decidedly high visual and narrative intensity. Burial at Sea - Episode 2 allows us to observe the BioShock universe from a new perspective and does it with the strength of a team whose artistic skills are beyond question. There is no shortage of bare environments, but as we turn the corner we are surprised by spot-on posters, exquisitely macabre glimpses and details of all kinds, the last glimpses of an intense experience that is inexorably coming to an end. And the ears, at the same time, eagerly listen to the diaries, the author's soundtrack, the lucubrations of masked madmen, the auditory hallucinations and the numerous testimonies of great men who have become mad in pursuing the impossible. As Elizabeth needs to know we also need to know. First a magical Paris and now the nightmare, the painful memories, the responsibility, the horror. The narrative device, strongly supported by the visual power of BioShock Infinite, also involves us by dragging us into a nightmare made of questions, doubts and pain. Who is the Elizabeth whose clothes we wear? What really happened to what we've lived up to now? Is there still someone or something to save? How much do we know about the DeWitts? The answers, unfortunately, are not all satisfactory and some monologues become redundant in revealing something without ever revealing the full picture. There is also the doubt, in some situations, that we rely too much on the multidimensional nature of the BioShock universe to avoid inconsistencies and too complex explanations. But when it comes to suspension of disbelief, the question becomes subjective and it is in any case difficult to criticize a DLC that is not satisfied with closing the accounts with the bersagliera but offers us a new all-round experience. In conclusion, the latest effort by Irrational Games, unfortunately the last in an absolute sense, is a DLC that makes you forget that it is additional content. A compact BioShock that perhaps fails to close all accounts with the past but still manages to surprise us with well-chosen gameplay variations, quantity of content and dream visions. IrrationalGames faces the closure by saying goodbye in style", "date": "2014-03-31", "grade": null}