{"name": "Anime perdute", "ref": "https://multiplayer.it/recensioni/130123-diablo-iii-reaper-of-souls-anime-perdute.html", "text": "The concept of expansion, ancient and now almost disused in favor of a granular distribution of contents through DLCs and a tight serialization of the main chapters, which in many cases have become annual, remains one of the clearest when it comes to establishing expectations in the player . Even etymologically, the expansion is by definition a ~more of the same~: a new piece of history, a new class, some extra features and refinements built on the basis of the original game. What is interesting in the case of Diablo III and Reaper of Souls is that the path taken by the Blizzard action role-playing game has been incessantly dotted with changes that have kept the premises but radically upset the gameplay. More than an addition, a point of arrival and a new beginning largely conveyed by the feedback, often ferocious, of the players who, despite the criticisms, have decreed the commercial success of the product and made its change possible. Interesting and rich, even if perhaps not complete with everything we would have liked, Diablo III: Reaper of Souls is a must-buy for all those who have followed the hack 'n' slash parable up to this point, but perhaps also a valid excuse to start playing again for those who, disappointed, abandoned the original almost immediately. Reaper of Souls arrives on the market with a load of new features, improvements and excellent content Start over In short, to understand the news of Diablo III: Reaper of Souls we need to look at what has been done with the recent patch 2.0, made available to everyone a few weeks before the launch of the expansion. The closure of the auction house and the review of the object collection system, the so-called Loot 2.0, has brought the conquest of the loot back into the spotlight and the ability to rely solely on one's own strength to see the heroes' equipment grow from game to game. The distortion of the difficulty system then paved the way for an experience less routed within certain predefined stakes. An objective similar to the one pursued, choosing a different path, by removing limits for the accumulation of excellence points and by opening them to all characters on the same account. By moving the role-playing component from the auction house screens to the battlefields, Blizzard has thus followed the requests of its fan base who asked for an experience that rewards the player's constancy and ability. A partial return to the origins of the first two chapters that playing Reaper of Souls can be understood even just by launching the fifth act and immersing yourself in the gloomy streets of WestMarch and then up to the crazy lands of Pandemonium. The story of this portion of the story is quite predictable and asks us for a last effort to defeat Malthael, the Angel of Death, who has taken possession of the Black Stone of Souls with the aim of erasing humanity from the face of the earth. We shouldn't expect great narrative developments, however the dark and gothic settings of this addition are a response to all those who had found the first four acts too distant from the visual and stylistic past of the series. In terms of content, we have no problem defining this piece of adventure, which entertains for about four hours, as the best ever: the mix between interiors and exteriors is convincing and the transitions take place fluidly, the variety of panoramas is at least as remarkable as that of the new enemies and an important effort has been made to improve both the procedural generation of the maps, which in some cases is really consistent, both the complexity of the secondary events which more frequently appear in the form of missions and optional environments. The three clashes with the three main bosses of the expansion are well-finished and captivating, also thanks to the presence of sets of legendary objects with characteristics that make them more attractive than in the past, but the process itself of eliminating the opponents who inhabit the maps benefits of a greater diversity of situations, new skills and new obstacles. It had never happened to us to defeat an opponent and discover a new level of the game by entering the dimensional portal located on his head, and it is this kind of small discoveries that invite you to return to the title after having already dedicated several hours of your time to it. Seeking Adventure If the fifth act responds to the need to expand the variety of encounters and situations, the Adventure mode is a decisive and successful push to the end game component that is unlocked once the fifth act is completed. On the one hand, in fact, there are all those who have repeated the same ifs to exhaustiongaming operations, the most profitable ones in terms of loot and rewards, on the other hand the less hardcore players who have never had the constancy and the desire to delve into a certain type of use of content that is less accessible for those who remain on the surface. By selecting this option you have access to a revised version of the map of the five chapters, with all the control points already unlocked and studded from time to time with five missions to be completed in the desired order. They range from defeating a boss to completing a dungeon, from killing a certain number of enemies to eliminating a single, precise opponent. They are rather short challenges that are usually completed in fifteen or twenty minutes, and offer a good deal of experience, money and two further rewards. Blood Shards are a currency that a merchant can spend to obtain weapons and random items. The Parts of the Keys of the Gate, on the other hand, open the Gates of Nephilim: by bringing five of these fragments to the appropriate non-player character, you gain access to a special dungeon created from time to time by mixing environments and characters taken from all the acts; levels to be cleared until, after enough kills, you have to deal with the boss on duty. The mix of quick games and great replayability make this addition a great idea and the perfect excuse to continue having fun after consuming the story. Although this is one of the most successful aspects of Reaper of Souls, our greatest grievance also arises here: in fact, it would have been interesting to have a further outlet, perhaps in the form of rankings or direct competitions between players - even without bringing into play a real PvP own - that gave a long-term goal to the most die-hard users. However, the foundation is solid and we hope that this Adventure mode will be expanded by future patches. Personal satisfactions Like any self-respecting expansion, Diablo III: Reaper of Souls does not abstain from the inclusion of a new playable character (in Diablo II there were two additions, Druid and Assassin) which overall we found really well done. The Crusader starts from the idea of the old Paladin, also narratively being a sort of elite unit of the order, but then takes his own path: damage collector and naturally devoted to close combat, like the shield present by default in the his equipment suggests, is also capable of hurting and being dangerous from medium range. His skill package allows him to hit in an area, attract enemies to him, recover life by consecrating the surrounding terrain and emerge unscathed from extremely crowded situations, but as usual the presence of runes opens up a substantial series of alternative options. In terms of mechanics it does not bring major innovations, accumulating anger with certain powers and then spending it with others, but the enjoyment given by the sensation of impact on enemies that the other five classes of Diablo III already gave, is here enhanced by sets of animations and more complex and varied special effects than ever before. The Crusader is probably the coolest class to watch fighting and one of the best to play. However, all the others benefit from various additions thanks to the increase in the level cap, which gains ten levels to reach 70, and to the consequent new active and passive skills inserted. In this sense, the developers have worked in part to pay tribute to old chapters of the saga, bringing back powers that have always been loved by fans, on the other hand trying to introduce new ones that stimulate them to rethink their builds and try something different. Finally, it is absolutely necessary to mention the introduction of a new craftsman, the Mystique: in addition to changing the appearance of weapons and armor, by bringing her a piece of equipment, she can be asked to change a precise attribute by choosing from a list created semi-randomly, so to have a chance to improve an item that maybe counted towards our build but lacked a certain stat or power. The Monk serves all the work done with Loot 2.0 very well and also helps take some money out of the game now that the Auction House has been eliminated.", "date": "2014-03-31", "grade": "9.0"}