{"name": "Teenage Mutant Ninja Turtles: Shredder's Revenge", "ref": "https://multiplayer.it/recensioni/teenage-mutant-ninja-turtles-shredders-revenge-recensione.html", "text": "That of the Teenage Mutant Ninja Turtles is a story that only old guard gamers can say they have experienced firsthand: born from the pencil of Kevin Eastman and Peter Laird, the brave amphibious warriors with Renaissance names have experienced extraordinary success since 1987, with the release of the classic animated series and the avalanche of merchandise related to it. In addition to the line of toys produced by Playmates, obviously the video games could not be missing, which Konami took care of: from the first, difficult Teenage Mutant Ninja Turtles for NES , capable of selling as many as four million copies, to the famous Turtles in Time arcade, to which the scrolling fighting game we are about to talk about draws a lot of inspiration. Are we facing a new center for the authors of the colorful and mangy Scott Pilgrim Vs. The World: The Game, as well as yet another successful revival for DotEmu after Streets of Rage 4 and Windjammers 2? We reveal it to you in the Teenage Mutant Ninja Turtles: Shredder's Revenge review. Structure Teenage Mutant Ninja Turtles: Shredder's Revenge, one of the artworks that tell the story during the campaign The offer of Teenage Mutant Ninja Turtles: Shredder's Revenge in terms of content is relatively dry: the game offers a total of seven characters (Donatello, Raphael, Leonardo, Michelangelo, Splinter, April O'Neal and Casey Jones, this last unlockable by completing the campaign), each characterized by different but roughly overlapping values and abilities, and two modes: Story and Arcade. Playable solo or in co-op, for up to four players locally or six players online (via a system of open rooms or invitations), the Story mode consists of fifteen chapters and two extra boss fights, with the ability to navigate a sort of map of the world to access each scenario or stop at supporting characters that we have saved and who have instructed us to collect certain objects for them. Teenage Mutant Ninja Turtles: Shredder's Revenge, the Ninja Turtles against some members of the Foot Clan This type of side missions allows you to get extra points that add to those obtainable in-game and unlock upgrades for the protagonists according to a pre-established path, therefore without a skill tree to be able to manage. In general, the rule is that the more time you spend with a single character, the more the latter will be able to count on health bonuses and additional maneuvers. A progression system that is lacking in Arcade mode, designed to offer an experience similar to that of a coin-op and therefore without power-ups to be conquered over time, with the levels that follow each other without breaks, an increased degree of challenge and a lower amount of ~continue~ available should game over occur. Gameplay Teenage Mutant Ninja Turtles: Shredder's Revenge, a co-op fighting sequence Clearly there was great curiosity about the gameplay of Teenage Mutant Ninja Turtles: Shredder's Revenge, given the many references to the Konami classics and, in general, to the unforgettable world of scrolling fighting games: a videogame trend that between the end of the ' 80 and the beginning of the 90s was literally all the rage, but which has in fact disappeared with the advent of 32-bit consoles and polygonal graphics. Well, the Tribute Games title is confirmed right from the start as decidedly solid and fun , capable of rendering the impact of the blows very well and therefore the sensation of actually beating the enemies, who being cyborgs of the Foot Clan are all visually more or less the same, apart from the color of the uniform, but boast characteristics and patterns very different. This adds a minimum of thickness to the clashes, which thanks to the roll provide us with a few more options than charging head down. Teenage Mutant Ninja Turtles: Shredder's Revenge, one of the boss fights that we will have to face But let's go back to the bad guys: we will find ourselves facing simple soldiers or swordsmen, armed with axes with a charged attack, equipped with sais, spears, bows or suction cup-shooting rifles, aboard large robots or accompanied by other types of enemies: stone warriors , anthropomorphic dinosaurs, androids of all shapes and sizes. A truly remarkable bestiary, to which are added many bosses (taken individually they will be at least fifteen) and demonstrates how the developers have squeezed the imagination of the Ninja Turtles to the max. We will be able to face these opponents by performing spectacular combinations of blows, flying kicks, special moves ( which, however, consume life and must be recharged) and sockets that include the iconic launch ofthe villain towards the screen. Curiously, grabbing someone in Shredder's Revenge turns out to be a less immediate mechanic than the classics Double Dragon, Final Fight or Streets of Rage, but a bit elusive, just like in the old Konami coin-ops. Teenage Mutant Ninja Turtles: Shredder's Revenge, the famous launch of the enemy towards the screen This kind of reverence for the material that Tribute Games relied on for its new tie-in can only be noticed by fans of the old guard, while fans of the Teenage Mutant Ninja Turtles will inevitably have to acknowledge the Canadian team having brought to the screen practically everything that could be taken from the classic animated series and, in general, from that historical period. It goes without saying that the experience of Teenage Mutant Ninja Turtles: Shredder's Revenge gives the best in cooperative: we completed the campaign facing the levels first solo, then together with a friend and finally putting together a team of four rowdy (strictly fed on pizza) to relive the good old days of so-called couch gaming. The result was yes chaotic and we imagine that in six it could turn out to be even worse, but do you want to put in the fun? Graphics and sound Teenage Mutant Ninja Turtles: Shredder's Revenge, one of the ~moving~ levels The animated introduction, with the classic song written by Chuck Lorre, immediately conveys the intentions and references of the game, which are then fully expressed thanks to pixel art graphics that hark back to the era of 16-bit productions and really enjoyable, colorful and full of details. Unfortunately the degree of interaction of the scenarios is very limited and some animations didn't drive us crazy (see the walk of the characters, who basically proceed with their guard up), but in general the final result is excellent and is not diminished by the rare slowdowns that we have encountered on PS5 in the most messed up sequences. The sound sector follows the same philosophy, fielding music perfectly in line with the 1987 animated series, which more than adequately accompanies the action and they are supported by effects that are perfectly functional to the experience.", "date": "2022-06-15", "grade": "8.0"}