{"name": "L'ascesa degli arcieri", "ref": "https://multiplayer.it/recensioni/129849-towerfall-ascension-lascesa-degli-arcieri.html", "text": "When Towerfall debuted on OUYA last year, it seemed impossible that such an entertaining and critically acclaimed gem would remain exclusive to such an uncommon platform for long. Well, as we wanted to demonstrate, less than a year after the release of the original version we find ourselves writing about Towerfall Ascension, the PC and PlayStation 4 edition of the frenetic multiplayer game by Matt Thorson (RunMan, An Untitled Story). The game remains substantially the same as released on OUYA, but for the occasion the Canadian developer has enriched it with a single-player option and a whole series of other more or less relevant innovations, it being understood that the heart of the experience beats without no doubt in the exhilarating and unpredictable local challenges. Lately, with games like Nidhogg and Samurai Gunn, those who like to spend a pleasant evening inviting a few friends over owe the indie scene hours and hours of fun, insults and laughter. But trust me, Towerfall Ascension is bound to take over your living room for quite some time. The secret of Towerfall Ascension lies in the care for the design and in the perfect balance A bow to rule them all... Not too different from the aforementioned Samurai Gunn, Towerfall Ascension is a competitive game in which up to four friends compete in small 2D arenas, quickly jumping from platform to platform and trying to eliminate opponents without leaving us quills. Unlike the Teknopants brawler, in Towerfall you don't fight with katanas, but like a skilled Robin Hood you use the bow available to shoot the few arrows in your quiver against the other players. Hitting (and being able to be hit) from distance gives life to completely new dynamics, with a fast pace and absolutely unpredictable situations. There are no points in the scenario where you are safe, and so each archer must keep an eye on what is happening in every corner of the arena. It often happens to focus only on two enemies, without realizing that in the meantime the third is behind us, intent on aiming to stick us like a pincushion. The basic mechanics are actually very simple, but complex enough to create spectacular or comical situations, giving the player the opportunity to do a quick dodge, cling to a platform or crush an opponent by jumping on his head. You can intercept an incoming arrow and send it back just before executing a wall jump, landing on an opponent and shooting a third arrow at the last hapless archer. All within seconds. Each fight is made even more exhilarating when power-ups and alternative arrows come into play, including darts that explode or pierce the ground as they traverse the level from end to end. But you have to be careful, because each player starts with just three arrows at his disposal, and once they run out you become vulnerable prey and a tempting target, even if reversals are the order of the day: the shot darts can still be collected by any player, which creates nice dynamics, between those who launch themselves trying to collect as many as possible, those who use them as bait and those who try not to miss the target so as not to give their opponents a great opportunity to recharge their quiver. It is precisely for this reason that Towerfall works much better when played in four, since the arenas are designed to offer a fast pace and create situations that are difficult to predict, whether you face all against all or split into two pairs. Speaking of the levels, compared to the original for OUYA, dozens and dozens of new arenas have been introduced in Ascension, each of which is unique in terms of characteristics and aesthetics. As if that weren't enough, the numerous variables with which to customize or even distort your matches in Versus add more spice. For example, you can decide that each player starts with only one arrow or only with special arrows, or even that his corpse explodes after a few moments, giving life to a mad stampede. If Towerfall has been defined by many as one of the best multiplayer games of last year, the reason lies in Thorson's care for design and perfect balancing work. An example are the simple and immediate controls: each player can only aim in eight directions, but the arrow's trajectory is slightly adjusted by a sort of automatic aiming; in this way it is avoided that most of the shots go empty, allowing the player to focus more on the timing than on the accuracy of the shot. Even an apparently aesthetic decision come the use of the 4:3 format is actually closely linked to the gameplay of the game: in widescreen the arenas would have been too large, profoundly altering the rhythm and balance that one has instead with more compressed scenarios. ...and chain them to the couch The most obvious novelty of Towerfall Ascension, however, lies in the addition of a Quest mode, a new option designed for one or two players. It is a series of pre-built arenas in which to face waves of enemies, up to the final boss fight. Each scenario has unique opponents created for the occasion, including seraphim that flutter around the screen launching annoying whirlwinds, ghosts capable of becoming immune to arrows or moles capable of digging into the ground or rolling towards the opponent. It's certainly a fun option and also quite difficult (especially if played on Hardcore difficulty), but one that doesn't hold a candle to the experience in Versus. Together with the new timed challenges, this is a poor side dish with which to pass the time when you are alone, perhaps in an attempt to unlock one of the secret archers: certainly, eliminating an enemy controlled by artificial intelligence does not give the same at all degree of satisfaction and retaliation that one feels by making fun of a friend or relative sitting next to him. And this is where we come to the most controversial aspect of Ascension, since despite the multiplayer experience being undoubtedly the core of the game, the author preferred not to include any online options, limiting the Versus mode to simple local challenges. In short, bad news for those who can rarely invite friends to their home, but despite everything, the choice of the Vancouver developer is more than understandable: in a brawler like Towerfall, even the slightest presence of lag would end up irreparably compromising the fun, with arrows that would go to blank due to a microscopic connection delay. For this reason Thorson has already received a large number of criticisms, but if he had done otherwise we would probably have found ourselves in front of a new Nidhogg, a perfect game locally but frustrating online. In closing, a mention goes to the lively and pleasant pixel art aesthetic, which in addition to hiding a whole series of graphic subtleties (characters who lose their hats, arrows that catch fire and so on) goes perfectly with the music in full medieval style -fantasy composed by Alec Holowka.", "date": "2014-03-24", "grade": "8.8"}