{"name": "GUN - Recensione Xbox 360", "ref": "https://multiplayer.it/recensioni/gun-recensione-xbox-360.html", "text": "It certainly cannot be said that the western genre plays a dominant role within today's television, cinematographic and videogame landscapes. Indeed, if it weren't for some very sporadic releases, one could almost say that the dusty stories of gunslingers and bandits have ingloriously fallen into oblivion. Precisely for this reason, the announcement by Neversoft of its project regarding a third-person action game set in the old West aroused no small curiosity, also due to the particular background of the US software house, universally known for its work on the Tony Hawk series. In light of these facts, the development of Gun has therefore been followed with considerable interest and, after having landed on all consoles of this generation and on PCs, Activision has also prepared it for the launch of Xbox 360. Let's see how it is gone Wild Wild West From the very first lines, it is evident that Gun is an extremely story-driven title, with a plot that may not be very original but decidedly well written and capable of bringing together the strongest themes of the western imaginary. The title Neversoft tells the story of Colton White, a skilled and taciturn gunslinger whose relatively peaceful life as a hunter is turned upside down during a normal ~work~ day. Embarking on a steamboat with his father Ned to accompany him in the conclusion of a mysterious deal, Colton finds himself in the midst of a violent boarding raid, from which he barely manages to escape thanks to the intervention of Ned, killed shortly after by a terrible explosion. Thirsty for revenge, our hero thus heads towards Dodge City, following the latest instructions provided to him by his elderly parent. The convincing story of Gun develops from these premises, an adventure full of well-defined characters and typical western film situations, all described by a considerable amount of enjoyable real-time sequences. Paradoxically, the storyline turns out to be the best aspect of Gun and at the same time its biggest limitation. Paradoxically, the storyline turns out to be the best aspect of Gun and at the same time its biggest limitation Wild Wild West In fact, the plot develops in a truly impeccable way in terms of number and variety of characters, quality of the cut-scenes, user involvement and amalgamation with the various gameplay elements; but it also has the defect of proving to be too short and at times even hasty, leaving the user essentially dry-mouthed after just over six hours of play. This is enough time to complete Gun following only the main story and caring little about the numerous sub-missions made available by Neversoft. Sub-missions which, although appreciable and capable of slightly varying the gaming experience, turn out to be rather uninspired on balance, as well as almost useless on a practical level (the money and bonuses earned have an imperceptible effect on the progress of the adventure). Not only the subquests, but also various elements such as weapons, objects and even game situations in Gun seem to have been included just to make up the numbers, helping to instill in the user the feeling of being faced with a product that is in some ways incomplete. Fortunately, the quality and intensity of the action contained in the Neversoft product manage to make up for most of these shortcomings. North South West East Grossly described by some as a sort of GTA western, Gun is actually a ~simple~ third-person action game framed in an almost entirely free-roaming scenario and driven by two elements of sure appeal: shootings and violence. Regarding the first aspect, the Neversoft product performs the task in a more than excellent way, offering the user the opportunity to engage in excited firefights based on knives, pistols, shotguns and sniper rifles up to more picturesque offensive tools such as bows and sticks of dynamite. The richness of the arsenal is a reflection of the different combat situations offered by the game, which range from violent frontal clashes to almost stealth passages more suitable for sniping. However, the emphasis is placed on direct comparison, as evidenced by the presence of the Quick Draw mode: armed with his two revolvers, Colton enters a sort of bullet time equipped with automatic aiming, the devastating effects of which are limited by a gauge that fills up by killing. The richness of the arsenal is a reflection of the different combat situations offered by the game North South West East A substantial part of the playful experience is then made up of the horse riding sections, definitely fun and well implemented: iThe control of the animal is convincing (particularly the presence of a bar representing the energy of the beast is spot on, which therefore cannot be spurred on indefinitely), as are the missions that one is called upon to face in this area, whose nature varies from chases seasoned with frantic shootings to real western gems such as the one concerning the assault of a moving convoy. Solid and sufficiently varied, the gameplay of Gun shows the side in terms of the level of difficulty, which could have been less condescending also considering the brevity of the adventure. The ~extreme~ imprint given by Neversoft to its own representation of the West raises some doubts: in addition to an often completely gratuitous visual and verbal violence, the design of some characters and scenarios and the treatment of some passages of the storyline are not convincing, so over the top as to be ridiculous. The Wild West in the next generation Neversoft has done a good job of recreating a fascinating and evocative environment like that of GUN, above all thanks to the over the top animations, which give the protagonists' movements credibility and concreteness. The textures and lights, however, if on PS2 and Xbox they served to fill the gap of a somewhat meager polygonal engine, on Xbox 360 they are not enough to hide the origin of a title designed for less performing and advanced hardware. Gun has the same attitude as the other versions, but as a next generation title it faces some criticism, above all considering that, if connected to a 4:3 TV, the software does not rescale the image by proposing the imaginary black bands on the edge of the screen. The speech for the audio is different, which maintains the excellent dubbing in English and the subtitled translation in Italian, which had already impressed us at the first gaming experience. Separate applause for the selection of music, spot on and perfectly inserted in the western vein from which GUN is inspired. Comment The central elements of a title are playability, the story it manages to tell and the fun it brings to those who rely on it, pad in hand. In this Gun it is confirmed as a good action game and one of the best video games linked to the fascinating world of westerns, thanks above all to an exciting, even if a little too short, plot. In the case of the launch of the first next generation console, however, the technical aspect assumes greater importance and the Neversoft title relies too meekly on simple improvements related to the hardware specifications, with more defined textures and better sharpness and graphic resolution, without proposing substantial changes to the stage system. That said, Gun is still a game recommended for Western lovers, who may fall in love with this raw and realistic story. Pros Fun and frantic gameplay Engaging narrative background Excellent animations Cons Very short main adventure Low level of difficulty Inadequate technical sector", "date": "2005-11-30", "grade": null}