{"name": "Figli di un dio minore", "ref": "https://multiplayer.it/recensioni/129694-infamous-second-son-figli-di-un-dio-minore.html", "text": "These first months since the launch of PlayStation 4 have not been very easy for Sony early adopters. The exclusive products of the house have not left their mark, consequently ~the shack~ has been supported by the usual multi-platform and by a handful of downloadable titles, decidedly good but still ~minor~. Natural, therefore, that - given also the postponement of #DRIVECLUB - players are waiting with foam at the mouth inFAMOUS: Second Son, the third chapter of a franchise that has already given the guys at Sucker Punch some great satisfaction with its first two excellent releases on PlayStation 3. A challenge, this of the American boys, full of pitfalls, either because the generational leap has always been full of risks, or because the eyes of the players are all on them and on a title that, inevitably, must begin to show the full potential of PlayStation 4. inFAMOUS: Second Son is a fitting start to Sucker Punch's PlayStation 4 adventure The new monsters Seven years have passed since the good ending of inFAMOUS 2. We put on the shoes of Delsin Rowe, the classic ~good for nothing~ with a passion for graffiti who gets by with his brother, Sheriff Reggie, in the Indian community of the Akomish, on the outskirts of Seattle. One day a prisoner transport of the DUP passes by, the government agency, run by the despotic Augustine Brook, which is responsible for hunting and capturing conduits, human beings endowed with extraordinary powers, capable of unleashing hell on earth ( anyone remember Empire City and New Marais?). Obviously the prisoners manage to escape, and Augustine arrives on the spot, a renegade conduit, with the power to manipulate and launch concrete darts. Delsin also sets out to look for the fugitives, and one of these with just contact manages to pass on his gift to him, the ability to manage smoking at will. Delsin is now one of them, a bio-terrorist as the mass media keep repeating. What to do? Give yourself up to Brooke, who has meanwhile tortured the Akomish community with her cement to get them to talk, or look in Seattle for a way to unmask the head of the DUP and in the process find a cure for the wounds inflicted on the community? This will be one of several moral choices that we will face during the course of the adventure, and this is where inFAMOUS: Second Son really begins. A story that, alas, goes on on autopilot until the end, without particular jolts, even if there are good moments and good characters, but which does not dare much beyond what has already been said on the theme of diversity in dozens of X-Men stories . The idea, even if by now inflated, of the pervasive power of the media is interesting. In this sense, more could have been done, and perhaps go more lightly with the ~metaphor~ (spoiler alert, let's not add anything else). Second Son is structured as a ~light~ free roaming. Our task is to track down the escaped conduits, understand more about ourselves, absorb their powers and in the meantime try to ~lighten~ the DUP's game on the city. All this translates into a small number of missions related to the main story and numerous side activities that revolve around the presence of the nefarious government agency. Warning, don't despair: the main missions are structured like real chapters and are quite long; it's not simply a question of reaching a point and doing something, but they make us experience situations in constant evolution, quite varied, and take full advantage of the mechanics of the powers that we will acquire throughout the game. The ~outline~ is linked to a series of completely free possibilities, ranging from the search for flying drones useful for enhancing powers to the conquest of DUP outposts that free areas from their presence. In between there is the fight against drug dealers, the search for undercover plainclothes agents, the search for audio files, the destruction of cameras, jammer antennas that block our GPS and DUP checkpoints. It goes without saying that if you show off your powers in the presence of the DUP, the battle begins, both on the streets and on the rooftops. The presence of the opponents is as capillary as it is reactive. That's why it's important to free the various districts from the DUP, but also because the checkpoints - and above all their huge outposts - give away fragments to be absorbed in order to earn the points necessary for the development of skills related to powers. Initially it is good to stay away at the mere sight of an armored car and four soldiers armed with rifles, without forgetting the mutated capable of creating shields with concrete, but just start enhancing the powers a little to change the cards on the table. As we want How is the combat system structured? Alongside the melee strike, troubadourwe have a normal ranged attack, an enhanced one (devastating and with area effects) and one capable of stunning enemies, which allows us to decide whether to subdue or execute them, a fundamental choice for our karma and therefore to be good or bad. Plus there's the ~physical~ ability of the powers. The smoke allows us to use the ventilation ducts at the base of the buildings to reach the roofs or to extend the jump after a glide. The purple neon, which we will acquire as we have seen from the numerous cutscenes after meeting the fugitive Fetch, allows us to run up walls leaving a trail like the Flash. Obviously the powers don't end here, but to avoid dangerous spoilers it's better to stop (the power of concrete is nothing new, but the third one is really crazy and full of effective surprises). How you shoot enemies also affects karma. Precision aiming with neon highlights the head and feet of the opponents, better shoot low if we want to become heroes without killing anyone. Everything can then become even easier since a passive skill slows down time to aim with great calm. With smoke it's more difficult: the headshot is sanctioned with negative karma, so it's better to stun the soldiers with the smoke bomb and make them harmless one by one without killing them. All this, perhaps, running at breakneck speed and turning into smoke to move (or escape!) among their ranks. These are just a couple of situations, but more generally Sucker Punch was good at ~designing~ powers with pros and cons, which therefore push the player to use them wisely, changing them (when possible) as needed depending on the enemies we will meet . Being good or bad then has a very important weight in the economy of the game. It goes without saying that such a setting pushes us to play Second Son at least twice. The main mission changes, as does the relationship with the different characters functional to the progression that we will meet. In the same way, some missions may or may not be undertaken, or the way in which to complete the secondary activities will be different. Furthermore, several attacks are available only in the presence of negative karma, while the ~smart bomb~ of the game (peculiar to each skill) is activated only by keeping faith with one's choice and filling the appropriate bar. If we are good, just kill one enemy too many and the counter restarts from zero. In short, there are many variations in play that double - if you like - the longevity of the game. Our clock stopped at around 12-13 o'clock, with a full seventy-four percent total. Not exactly a huge number. Invincible or not? The combat system is therefore an undeniable strong point of the game: inFAMOUS: Second Son is a terribly fun title, which really offers moments of great exaltation and which brings to mind the more ~caciaroni~ and pyrotechnic ones of games like Just Cause 2 or Saints Row IV. The city becomes our playground: we navigate it with great speed, up and down, we make mileage jumps, we attack with quick hits and run by entering the heart of enemy bases or hitting opponents in complete safety without exposing ourselves too much, changing skills when we want, absorbing neon, the smoke from chimneys and more. There is indeed a lot of freedom of choice, both in how to fight from a karmic and purely ~material~ point of view, and there is also a pinch of environmental destruction. We feel like real invincible superheroes, even if in reality the people of Seattle must be conquered slowly... we are still bio-terrorists, after all! Immediacy, power and freedom: three positive characteristics which, however, risk spilling over into a non-secondary problem. Bosses aside, Second Son, when played on a normal level, can be pretty easy. Once you understand the rules of the game and upgrade the right skills, the most fortified bases, full of mutated jumpers capable of throwing concrete trails or thugs armed with miniguns, can be cleared with relative ease. All this, perhaps, from a safe distance, hammering the most difficult enemies with enhanced attacks and the ~standard~ ones with normal ones, obviously paying attention to karma. Then there is no possibility of running out of energy, both in terms of health and as a resource for skills. Just splash on a roof, respawn, absorb something, and throw yourself back into battle. In short, after three or four hours of play you become practically invincible; death is a not too rare occurrence even in the most agitated phases that often close the main missions, when it can happen to meet all the ~bestiary~ of the DUP in generous quantities. The tactic of the fearful procrastinator is a winner, throw yourself into the fray a little less but not too much. The bosses are something else entirely: tough, well thought out and also decidedly original. There you have to sweat a lot to overcome them. By setting the difficulty to expert, the matter changes, even when you are ~pumped~ properly at the end of the game, with the endgame unlocked to finish all outstanding issues. The approach must necessarily be more reasoned, given that the energy drops more rapidly. Less caciarone and ~more tactical~, if you pass the term, but nothing to sleep at night. Another thing we weren't too impressed with is the quality of the optional assignments. Karma and the need to find fragments to develop or enhance skills force us to repeat the usual routine over and over again. We can always play it however we want, but after yet another checkpoint blown up, the twentieth drone shot down or the usual subdued gang of drug dealers, interest quickly wanes. It is necessity alone that drives us to clean up areas. The DUP outposts in the neighborhoods up the ante and undoubtedly give greater satisfaction, but even by deploying the ~almost stealth~ of the third estate we are far from being a game within the game like the one seen in Far Cry 3. Playstation 4 trophies inFAMOUS: Second Son rewards the player with 48 trophies. To get them we will have to properly dissect all the contents of the game. They then engage us in optional activities, but also in completely cleaning up the neighborhoods and then the city from the DUP. Achieving a certain level of karma, negative or positive, counts towards obtaining a particular trophy, as does rescuing mistreated Conduit, or perhaps dispersing an anti-Conduit rally. In short, they are many but not too difficult to obtain: you just need to spend a lot of time with the game. The beauty of a city at sunset We close the review of the problems of inFAMOUS: Second Son with a certain stretching of some mechanics. Once a new power is acquired, Delsin needs to develop it. You don't have immediate access to ~super speed~, to the different types of attack and so on, but you need to recover conveniently defended cores: each of them corresponds to an ability. All to be repeated, therefore, as if it were a tutorial, at least three or four times for each power. Definitely boring, repetitive and without the pathos of a budding superhero. On a technical level, Sucker Punch flexes the muscles of PlayStation 4. The city of Seattle, although not as immense as those of the ~classic~ free roaming realms, has its own personality: each neighborhood is different from the others (just look at the beauty of Chinatown) and full of very special details, shops and landmarks. It is clear that the developers (who are based in Bellevue, a suburb of Seattle) wanted to pour all their love for the city, which appears alive and vibrant, with a peculiar character, light years away from the classic American metropolis. Leaving poetry aside, it should be emphasized that on a technical level 1080p and the virtual absence of aliasing give an extremely clean picture, full of details and with textures of great value, which perhaps loses a bit of quality only in some models of citizens and for some secondary elements. Credit to the models by Delsin and his ~friends~, perhaps a little less to Augustine who betrays a significantly lower quality standard especially in the close-ups. But where inFAMOUS: Second Son draws open applause is in the lighting system, refraction on the surfaces and in the palette used to color Seattle. Some glimpses are truly breathtaking; every source of light paints the surrounding world, whether it's the neon lights or Delsin's powers, and when it's the middle of the day you curse yourself not being able to play at night, at sunset or in the rain, when Seattle is a blaze of colored lights, and instead it is only filled with a beautiful, warm but ~flat~ light. A truly complex and successful lighting system that seems to weigh little on the game engine, even if some microshots peep out several times in the most agitated phases, perhaps in correspondence with a hasty escape.", "date": "2014-03-20", "grade": "9.0"}