{"name": "Questioni di tempo", "ref": "https://multiplayer.it/recensioni/129296-aeterno-blade-questioni-di-tempo.html", "text": "That of the ~metroidvania~ is a genre that, after the discreet boom of a few years ago, has slowly disappeared from the radar. However, it remains in the hearts of all lovers of partly platform and partly puzzle adventures, especially two-dimensional ones because the cornerstones of the genre have expressed themselves in two dimensions, among which it is impossible not to mention those who gave it its name , namely Castlevania: Symphony of the Night and Super Metroid. It may be that the market today prefers straight lines to follow from start to finish without thinking too much about it, the fact is that a ~metroidvania~ without good level design behind it makes no sense to exist. It is precisely there that Aeterno Blade slips, an interesting metroidvania for the Nintendo portable console with several arrows in its bow  which however have not managed to hit all. Aeterno Blade is a metroidvania with many original ideas that could have been implemented better Tempus Fugit The premise is one of the most original that we have seen in recent times. The evil sorcerer Beladim has just destroyed a small village and the only survivor, a warrior named Freija, swears revenge. Yeah, okay, this part isn't that original, but listen: Freija diesin the first five minutes of the game. Evil seems to win, for once, but Freija's sword, the Aeterno Blade which gives the title to the game and which was delivered to her a short time before by a mysterious character, takes her back in time, seven days before her death. Freija thus discovers that Beladim also possesses a weapon that can manipulate time and in this case is able to erase an event from the space-time continuum, which means that he can in fact survive any deadly attack simply by eliminating the moment in which it is been injured. Only the Aeterno Blade can prevent this from happening and therefore Freija embarks on an adventure that we completed in about five hours with the aim of killing Beladim and avenging his loved ones. We told you the premise was original. Too bad that the development is not too, with some really phoned twists and an obvious but still appreciable ending. The story of Aeterno Blade is told through a handful of modestly made computer graphics sequences and, above all, various textual dialogues - totally in English, we specify - between the illustrations that portray the characters. Traditional but functional, the narrative interrupts the action from time to time to explain any new game mechanics and open or close each stage. The adventure is in fact divided into chapters, and each takes place in a different scenario: unfortunately the developer Corecell Technology has well thought of recycling some assets that make some segments of the areas look a little too much like each other, but other than that the variety environment we also liked thanks to the good graphics and an excellent choice of colors, undermined only by the fairly poor polygonal modeling of some enemies among which, strangely, also include the bosses. The generic and repetitive soundtrack, on the other hand, left us quite dumbfounded. The 3D effect Well done, it embellishes the scene with a good depth and doesn't put too much emphasis on the texts every time they appear, a mistake that everyone usually makes, ending up annoying the view. Don't tell Doc Brown Freija's only weapon is her Aeterno Blade, which does not mean that it should be underestimated: in fact, the girl has a substantial amount of combos that can be unlocked as you progress through the game. In fact, between one level and another, we can access a kind of hub where we can customize our heroine in various very interesting ways. In addition to being able to choose the new combos to learn, expanding his repertoire of attacks from standing, stooped and jumping, it is also possible to spend points to improve his statistics (such as life points, mana reserve and so on) and above all equipping the relics, objects that we will find scattered throughout the levels and which allow us to enhance some aspects of the character at will. The interesting thing is not only that after a while we will be able to equip several relics at the same time, but also that we will immediately be able to alternate two sets of relics on the fly: we will therefore be able to prepare one that increases the attack and one that increases the defense, for example , and change them instantly and at any time with a simple press on the touch screen, thus allowing us to face the various enemies as we prefer. The problem, more than anything else, is that despite its depth, the combat system is betrayed by a system of collisions and hitboxes which,quite simply, it doesn't work well. Most of Freija's attacks, for example, force her to remain motionless until the animation ends, while the enemies are repelled by each hit of the combo, ending up going out of our reach and making the fight frankly woody even when great mobility is required, especially in boss fights. As a result, you soon find yourself nibbling damage with one tap at a time, at least until you have learned the attack pattern of the enemy on duty well. It is perhaps to compensate for this problem that Corecell has implemented one of the main powers of the sword, namely that of rewinding time by consuming Freija's mana: just press the L key to perform a real ~rewind~ of the scene in which, however, Freija remains free to move normally. This power therefore allows us to stop an enemy's attack and rewind its animation, thus exploiting a possible blind spot or gaining a few more moments to dodge an attack that would have inevitably been successful. The feature works, but not exactly very well because if it is true that it is a panacea against normal enemies it is equally true that against the bosses and the unpredictable order of their attack patterns you end up running out of mana and not being able to stop the time just when a very powerful attack is coming that can only be dodged in that way. Fortunately, the original and captivating power of the Aeterno Blade is also used to solve the numerous puzzles scattered throughout the levels, acting on levers and platforms to open doors or overcome various obstacles: the idea is ingenious, but even in this case it has not been implemented wisely since the puzzles soon end up looking a bit alike and the long loads between the rooms, which are actually quite small, end up making backtracking moments quite tedious.", "date": "2014-03-11", "grade": "6.5"}