{"name": "Mario Strikers: Battle League Football", "ref": "https://multiplayer.it/recensioni/mario-strikers-battle-league-football-recensione.html", "text": "It certainly cannot be said that the lineage of Mario Strikers is as aristocratic as that of other Nintendo sagas; despite this, with a couple of episodes, released only two years apart, the Next Level Games series has managed to conquer many passionate users. To the point that, fifteen years later, a sequel was made: Mario Strikers: Battle League Football, in fact. Since the first release on GameCube, dated 2005, the developer has remained unchanged: unlike almost twenty years ago, however, the Canadian studio is now owned by Nintendo. And this is the first game made with this new status. We don't know if the acquisition has encouraged them to take risks, the fact is that, despite appearances, Mario Strikers: Battle League Football is very different from its predecessors. In its intentions and implementation, it is more ambitious and structured. Perhaps, consequently, less immediate. Without dwelling too much on the comparisons with the past, Mario Strikers has always combined a basic football game (more specifically five-a-side football, or futsal), with a certain amount of blows: sliding, shoving, shouldering, weapons thrown against the opponents. In this series there are no fouls or throw-ins: in their place there are electric barriers, which appear when a player hits them. To top it all off, between soccer, beating and weapons, there have always been hyper-shoots, to be carried out by loading the shot for a long time, and then stopping a swinging bar, golf-style, in the right points (first to the left, then to the right) . All this remained intact, unchanged. At the same time, Next Level Games didn't just reiterate the concept: they analyzed it, and extended it into various ramifications. We'll talk more about it shortly, but on the one hand it has deepened the ball possession technique, on the other it has made the action even more violent, almost as if it were a scrolling fighting game: not by chance, the possibility of both dribbling and with a sudden movement, or to avoid pushing opponents without the ball (with the same button). An eventuality that often occurs, to make you understand how important the part relating to the barrels is. Before going into the analysis of the game mechanics, we want to point out a detail that we really liked, namely the unpredictability of the action and movements of the sphere. This type of game, which we could define as caricatured futsal, has often been limited by the execution of predefined mechanisms for scoring: absolutely certain ways of going to the net, with the ball carrier trying to implement them, and the opponent ready to foil them. But if they succeeded, well, there was the certainty of scoring. As much as we played it, and we played it quite a long time, it felt like Mario Strikers: Battle League Football managed to break out of these annoying mechanics. And he succeeded, if not entirely, certainly in large part, thanks to the physics of the ball, which has its own autonomy: there have been cases in which we have hit the crossbar, and the ball is slammed on the back of the goalkeeper, before ' slip into the door. We have seen some own goals, with deflections from the goalkeeper. A double post, before the ball crossed the line. We are not ready to swear that there is no certain method to score, it probably exists, but we assure you that this unpredictability was absent in the predecessors - spiritual and otherwise. But perhaps we have gone too far: here is the review of Mario Strikers: Battle League Football. Technique and barrel Mario Strikers: Battle League Football: between ball and explosions The basics of ball possession are pretty canonical. It is played in four, plus the goalkeeper (the Boom Booms have replaced the Kritters), who cannot be damaged in any way, neither with shoulders nor with weapons. On the pitch it is always arranged with a 1-2-1, with the captain of the team placed as center forward. You can pass the ball both low and high, and in this game they are equally important and effective actions, with the difference that the low trajectory is faster, the higher one less easily intercepted. The other two main keys throw weapons (X) and shoot (A). Weapons are obtained in various ways, the most frequent of which is being hit by an opponent without having the ball. With shooting, the charge is very important: the more you hold down, the more you will expose yourself to your opponents, the more powerful the trajectory will be. While charging you can vary the direction of the blow, both to the left and right, and in the balance of the body and, consequently, on a higher or lower trajectory. Charging for too long does not necessarily lead to an advantage, there is a precise and ideal moment in which to launch the blow: in this case a perfect shot will be created,which will have more chances to enter. This dynamic does not only apply to shots from a standstill, but also to passes - and to the shots themselves - as before, i.e. without blocking the ball: in this case you have to hold down the button before receiving the ball and release it at the same time impact. They are not binding dynamics and, although they influence the outcome of the shot and improve it, they are not essential for scoring: however they help, and how. Mario Strikers: Battle League Football: Pushing is as important as the ball The defensive phase is mainly composed of blows, whether physical or with weapons. There are no markings, team pressings, or anything else: in Mario Strikers: Battle League Football you defend by hitting. And although it is possible to intercept passes, especially high ones (by standing in front of, precisely in front of, the receiver of the ball), the most comfortable method (which, however, gives a weapon to rivals) is to hit in a preventive manner. Everyone needs to be beaten, ball carriers, unmarked men, everyone. Taking care not to leave the defense too unguarded, certainly not a secondary danger. You can push either by simply pressing Y or by holding it down: in this case the action is slower, but the contrast is wider and more violent. Even here the ~perfect thrust~ is present, if released with the right timing. The better the players become, the more the scrolling fighting game part is predominant; the more the action becomes chaotic and frenetic, the more the use of weapons becomes central, both for scoring and for defending. There are red shells that go against the ball carrier, green areal shells, bananas, bombs (lethal but chaotic): almost all bombs can also hit your team, so they must be used expertly. Mario Strikers: Battle League Football: Mario enters the pitch If you get to play at this intensity, you'll have to think extremely quickly. A second of reflection is usually already too much: you will find yourself on the ground, or with a shell on your skull. And at this level the advanced moves are fundamental: there is the team defense, which allows you to push not an opponent, but a teammate against a rival. Lethal move, when it enters, but rather detailed. On the contrary, dribbling is really important and the ~hard~ CPU uses it very often. It is done by pressing R, both when running, and in possession of the ball, and in defense (in this case, to prevent an opponent from stunning a player there). Above all, it was useful for us to avoid slips or pushes while loading a shot: a move that, when it enters with the right timing, also guarantees you acceleration. Equally important is the stroke (ZR), which the game does not consider advanced, but which in use essentially is: it is more of a shot, a shot which, as in realistic football games, substantially pushes the ball away from direct possession of the bearer, who therefore risks losing it in that short separation stretch: the advantage is that it could be a decisive draw, which allows you (among other things) to execute a perfect first shot, therefore to obtain power without load. There are two more techniques that make sense to talk about. The first is hyperthyroidism. Each player on your team will have the opportunity to do so, ~just~ hold down A for a long time, hope they don't fight you first and block the bar that just appeared at the right time. Much easier said than done: not so much for the execution (it's not impossible, with a little coldness, to stop the cursor in the right place), but for the activation. To charge a hyper-shot you first need to pick up a ball that appears from time to time (common for both teams) and, more importantly, be in the position of being able to charge it: we're talking about two seconds, but in this game two seconds without being hit they are certainly not few (in case you enter, the hyper-shooting is worth two goals). The last technique is the through ball, which is performed by pressing L + B (low pass) or Y (high pass) at the same time: at that point a cursor appears to be moved on the pitch, before releasing the button and carrying out the passage to the chosen place. A fundamental mechanic to skip the opposing defenses, but quite complex to carry out. Fun and perplexity Mario Strikers: Battle League Football: Waluigi grappling with a banana All the mechanics just mentioned, although they are not as intuitive as in other Mario sports games, are able to amuse enormously. Mario Strikers: Battle League Football is complex, deep, adrenaline-pumping and also very technical. When it comes to high-intensity gaming, you're in for a structured and immersive experience that's fast-paced and articulated, and won't run out of time.it will certainly be there in a few hours. We have already widely praised the unpredictability of the actions, but we would like to repeat it again: the famous saying ~the ball is round~ has never applied so well to a caricatured mini-football game. We also have some perplexities, two in particular, which do not harm the general goodness of the experience. The first concerns the through ball. Precisely because ball possession and also shooting have become more realistic, it is difficult to understand how the through ball is so complex to execute: not only because it involves pressing two buttons, but because these two buttons generate the appearance of a cursor. As we have already told you, here two seconds are enormous, so making a well done through ball is difficult and exposes you a lot to the blows of others. Mario Strikers: Battle League Football: The team consists of four players plus a goalkeeper The point is that neither live, nor on FIFA or similar, the through ball is considered an advanced technique: indeed, it is a fundamental, basic move. And it is here too, because it is functional for overcoming the ravenous opposing defenses. Sometimes it's unnerving how impossible it is, with the push of a button, to attack the depth of space with a pass: there are always defenders ready to hit you, and it's irritating to have to forcefully receive the ball on your feet. Pep Guardiola's nightmare, basically. The other perplexity, much less important, concerns goal chances. The in-game guide advises you to get close to the goal, load up and angle the shot, as would be normal: in our experience, however, this is not the case. Distance from goal is important (by the way, you can only shoot from midfield upwards), but certainly not fundamental; at the same time, it is quite rare that it is scored with a traditional action, with a low pass in front of the goalkeeper, or with a first shot from inside the area. The net is more frequent with a diagonal broadside, with a long shot, with a bicycle kick just outside the box. Nothing dramatic, in fact: in this case it is enough to accept the ~rules~ of the game, which however are not in line with those of futsal. It's far more dangerous to take a charged shot from Bowser from midfield than a front shot from the edge of the penalty area. Stats, equipment and characters Mario Strikers: Battle League Football: There are many armor parts that change characteristics Consider that all the mechanics just described are declined, for each character, in five characteristics: strength (amplitude and intensity of a contrast, as well as resistance to them), speed (explains itself), shooting (i.e. its power and speed) , passing (accuracy and speed of the same, but also range of action of the through balls) and technique (ease in executing perfect shots and hyper-shots). These are not venial differences, each characteristic ranges from a minimum of 1 to a maximum of 25 points, and the influence on game dynamics is decisive: absurdly, a character with strength 1 would have no possibility of stopping another with strength 25, while one with strength 25 would send the other flying across the field. And if no character is so extreme at the base, because the distances are not so marked, through the personalization of the same it is possible to reach these differences. The more you play, the more coins you earn, the more coins you have, the more equipment you can buy, real armor, the metal that has always distinguished the series: helmets, helmets, boots, shoes, armrests. There are no elements that only bring advantages (if he rises on one side, he falls on the other), but through them it is possible to create extreme characters: our Bowser for example has 25 strength, despite being extremely slow, while our Toads have maximum speed (on the other hand, they are thrown around rather easily). After the first few games, we found a way of playing that was congenial to us, which certainly isn't the only solution: a versatile character as a centre-forward, two fast wings (the Toads), a strong and powerful player in front of the defense (Sergio Ramowser ). As we have already said, the formation is fixed (1-2-1), and unfortunately initially it is not very clear how the players will be arranged: know that the captain is the center forward, the two characters in the middle are the wings, the last one the most backward . A small detail of the interface that we didn't like, given the importance of the positions. Mario's stats As for the characters, there are only ten of them. There are no longer supporting characters and captains as in the past, each of them can be used in any role. The exceptions are Toad and Yoshi who, being ~ethnic~", "date": "2022-06-08", "grade": "8.5"}