{"name": "A letto i bambini", "ref": "https://multiplayer.it/recensioni/128929-senran-kagura-burst-a-letto-i-bambini.html", "text": "Senran Kagura Burst finally reaches our continent almost three years after the original Japanese publication, a period in which the series has flourished in its homeland giving life to spin-offs, sequels and adaptations in the form of manga and cartoons . Requested in a loud voice because of its indisputable artistic qualities ... come on, but who are we kidding? The frenetic gameplay and the excellent graphics sector must certainly not have captivated the players, but the sinuous curves of the busty protagonist girls. In a delicate moment like this, in which one does nothing but talk about women's rights and the way in which they are increasingly exploited within the media, Senran Kagura Burst was just the straw that broke the camel's back, arousing the ire even of some newspapers called to review it. We want to put all these sterile controversies aside and focus on the game, which is really hard... i mean, nice! We meant beautiful! Senran Kagura Burst has no shame, yet it is a fun and well made scrolling beat 'em up Action, Adventure, Atette Anyone who reads the legendary Rat-Man by our compatriot Leo Ortolani will surely know the philosophy of the three A's on which the whole market is based. The Tamsoft guys have respected them perfectly, proposing a title that includes all three in more than generous quantities, adding to the whole as well a nice dose of Japanese comedy that will delight any self-respecting otaku. Take this statement as you like, in any case Senran Kagura Burst follows a plot - far from obvious, we would add - which starts from a historical premise. The shinobi, faithful servants of the feudal lords in ancient Japan, after the Meiji Restoration have practically become extinct, turning more into assassins in the service of politicians and the corrupt. In Japan today there are very few left, trained hard in schools that look like ordinary high schools from the outside. Senren Kagura Burst follows the parallel stories of two institutes, the national Hanzo Academy and the clandestine Hebijo institute, which represent the two faces of the new generation of shinobi. You know the Jedi and the Sith? We are there, in short. It may seem a little ridiculous that these lethal shinobi are actually very Japanese maidens dressed in a sailor suit, but at this point you should have already suspended your disbelief and should no longer be surprised by the paradoxical situations that mix epic battles for the fate of the world , paranormal powers, sexually explicit gags and neighborhood thugs. Halfway between a school anime and a visual novel, thanks to the always effective Japanese dubbing and long English texts, Senran Kagura Burst manages to perfectly characterize its protagonists, transforming them into something more than simple erotic toys, despite the two animated sequences introductions suggest otherwise. In the end, the plot isn't even that trivial: the player can choose at any time whether to follow the vicissitudes of one or the other school, since the game, which in its original version was the sequel to the first Senran Kagura, is made up of two storylines titled Crimson Girls and Skirting Shadows. Each of the two narrative lines consists of about seventy missions, some optional and others essential to continue the story; they can be played and replayed, often even choosing different characters, in order to level up the heroines by unlocking every possible bonus and reward. It's a shame that the variety is practically zero: it's still about defeating a certain amount of enemies or reaching the end of the level alive, eliminating each opponent until we are allowed to advance or face the boss of the moment. Because Senran Kagura Burst, in addition to being a slightly risqu visual novel, is also an excellent scrolling fighting game. The 3D effect Nice move, Tamsoft: rather than further sacrificing a fairly unstable frame rate, the developer has enabled the stereoscopic effect only in specific situations. When it works, it's impactful and almost feels like you can touch them. The girls' weapons, of course. Not just curves Each school has its own hub, the common room where the protagonists meet to spend time and where it is possible to directly control one of them to interact with the others and access the real menus, which can also be called up by acting on the lower screen of the console . In these moments of pause it is possible to review the kinematics and re-read the dialogues, change the character we are controlling, saveo load the game and change clothes in the dressing room. This last possibility is as curious as it is voyeuristic, as it is possible to dress up our heroines with the clothes and accessories unlocked in the missions. Do you want to fight wearing a bunny costume with a nice halo on your head? You can do it, and also feel a little manic obviously. Once the character has been chosen and dressed as a doll, we will be able to undertake one of the unlocked missions and begin the actual battle. The control system is simple and responsive, and allows us to swing weakly and strongly, dash in any direction and, of course, jump. Senran Kagura Burst places particular emphasis on the combos, which are very easy to ring and can be continued even in mid-air by activating the dash at the right moment, and on the special attacks, real ~smart bombs~ that consume the spiritual energy indicator and trigger rather spicy kinematics in which the heroine of the moment unleashes all her energy. If it is true that Senran Kagura is not that difficult, thanks also to the possibility of leveling up by repeating the various missions, it is also impossible to deny the strategic factor constituted by the ingenious question of the costume. The concept is simple: as our shinobi loses vital energy, her costume also tears apart, showing her beauty more and more. At any time, however, it is possible to completely restore her vital energy and enhance her attacks by making her wear her ninja uniform: this technique can only be used once and requires a minimum of tactics. Is it better to wear the uniform and upgrade immediately or wait for the very last moment, with all the risks that it entails, to exploit our first bar of vital energy to the last drop? Adding to this dilemma is also the Frantic, an option that allows us to get naked - or almost, since we'll be wearing our panties and bra! - at the beginning of the level and therefore not being able to resort to any other protection, greatly increasing our offensive power to the detriment of defense: a risky tactic which, however, allows you to unlock further goodies. And depending on the style of play, more focused on defense or attack, the Yin and Yang counter also increases, further enhancing one or the other value. In short, as you can imagine, Senran Kagura Burst is far from an ignorant beat'em up and also gives a lot of satisfaction, albeit not in variety since the levels and enemies tend to look a bit too much alike, becoming repetitive in the long run. Too bad, because the Tamsoft title is simply delightful even from a technical point of view, with attention to both the polygonal modeling of the characters and the choice of colors and effects. Unfortunately there is a certain inconstancy of the frame rate, but the developer has preferred to deactivate the stereoscopic effect in the actual game phases in order not to further tire the engine, going down to some compromises to make the experience more, ahem, enjoyable possible.", "date": "2014-02-28", "grade": "7.8"}