{"name": "Due Tales sono meglio di uno", "ref": "https://multiplayer.it/recensioni/128887-tales-of-symphonia-chronicles-due-tales-sono-meglio-di-uno.html", "text": "That Namco Bandai (or Bandai Namco?) Has changed register towards Europe - not to mention the entire West - it is now quite evident. Not so much for the frequency with which we are now seeing the Tales series on our local shelves, but also for the care reserved in the adaptation of its titles, which finally also show off an Italian translation and many bonuses. Something more could be done for the European Collector's Editions, which are less substantial than their American counterparts, but who knows... maybe we'll get to that too. In the meantime, however, the choice of locating Tales of Symphonia: Unisonant Pack, the Japanese title for this remastered edition of the historic 2003 GameCube jRPG which also includes the more recent 2009 sequel developed for Nintendo Wii: the local version, complete with dual Japanese and English audio and multi-5 localization for all tastes, it's a real little dream for all those who missed the appointment ten years ago and who have always wondered why Tales of Symphonia has remained in the hearts of fans of the franchise. More than the sequel, for sure, but you don't look a gift horse in the mouth... right? Tales of Symphonia Chronicles is a blast from the past that no jRPG fan should pass up Playstation 3 trophies Two games and two collections of Trophies: forty for Tales of Symphonia and forty-one for Dawn of the New World, to be conquered by following the adventure and defeating all enemies and secret bosses, completing lists of monsters and objects, performing the various Artes combo and more. Tales of Symphonia It could be argued that there is very little ~donated~ in this horse since Tales of Symphonia Chronicles is certainly not free, but the low price of the disc includes two games, one of which, by itself, is more durable than many other titles sold at full price. Tales of Symphonia is certainly the jewel in this crown and it can take more than fifty hours to sift through every secret, as per the tradition of the Namco Bandai series and its long Japanese cartoon storylines. The protagonist of this adventure is called Lloyd Irving and is the typical daredevil and immature hero who will grow up together with his travel companions: initially his purpose will be to accompany, together with his friend Genis, the same age Colette and her bodyguards Kratos and Raine in a veritable procession from one temple to another of the world of Sylvarant. Colette is the chosen one and only she can restore the planet's now spent mana. We don't anticipate anything, but as you can imagine the matter is not that simple and the group will be forced to make an ethical choice that could cost the life not only of sweet Colette but also of the inhabitants of not one but two worlds. Between betrayals, surprising twists, alliances and very powerful enemies, there will be the possibility of a double ending which, in any case, will move and fully satisfy the players. The cast of Tales of Symphonia is undoubtedly one of the best in the long history of the franchise, both in terms of the delicate character design of the always very good Kosuke Fujishima and in terms of the characterization of the characters, who at the beginning can actually appear quite stereotyped but actually hide facets that will become more and more interesting. In the actual game, the characters take on a decidedly more squat appearance than Fujishima's artwork: the style chosen for their graphic representation is a super deformed cel shading which perhaps does not completely do justice to the general quality of models and animations. The version proposed in this package, however, is not actually the 2003 GameCube but the 2004 Director's Cut published for PlayStation 2 which, in the passage, had lost some visual elements such as the sharp black outlines of the textures. In retrospect, the result in this remastered high definition version is much better and the image is much cleaner and leaner. The same cannot be said of the animated sequences, which are quite grainy, and of the frame rate which, although stable, is blocked at thirty frames per second, whereas on the GameCube it easily reached sixty: the downgrade is frankly inexplicable and unjustifiable, although not being so harmful, also because the fights lack that frenzy and chaoticness seen in the more recent exponents of the series such as Tales of Xillia and Tales of Graces F. Tales of Symphonia is still a game of ten years ago, and as such it does not propose all the refinements and improvements made to the battle system from iteration to iteration: manalways keeps the real-time formula made up of combos and special attacks linked to the controller keys, but all in all it appears rather simple and without acute details, represented mostly by the possibility of enhancing the characters through particular gems, called Exospheres, which decree the skills that they will learn in combat and therefore allowing the player to marginally control their growth. Tales of Symphonia, rather, excels in two aspects that have failed in the last few titles in the series: the first is exploration, with an ~old-fashioned~ three-dimensional world map which, while sparse and decidedly retro, is a pleasure to see again in action after a long time. The second is the level design of the various dungeons, not very linear and often characterized by environmental puzzles and puzzles to be solved with a little brain, which makes the experience much more engaging and less repetitive. The whole is framed by a good dubbing in English or Japanese and a splendid soundtrack that enhances the highlights of the adventure. Dawn of the New World The sequel to Tales of Symphonia included in the package, known in Japan as Knight of Ratatosk, is considered one of the weakest Tales of the series, but in reality its defects are mostly technical given that the story, after the first and actually boring seven hours of game, takes off and closes the cycle of Symphonia with a spot-on ending. In order not to anticipate anything about the ending of Tales of Symphonia we will have to remain vague, but it is worth saying that the protagonists of this adventure are essentially two: Emil Castagnier, a young man who is a bit too crybaby for his role, and Marta Lualdi, a sideways girl too energetic. Both are linked by a grudge against the protagonists of the prequel for reasons that we cannot reveal to you and, as if that weren't enough, Emil is possessed by an entity that occasionally takes control of his body, transforming him into a fearless warrior. The two will embark on a journey that will confront them with their enemies and with a series of unthinkable allies, namely the real monsters they will have to face. Dawn of the New World, in fact, offers a bizarre mechanic - who said Pokmon? - which allows you to ~recruit~ monsters as party members. The idea is nice and at first it also seems interesting, but soon you realize that you'd rather have well-characterized characters in your party rather than anonymous creatures. Fortunately, we don't need to despair, because within a few hours the group will begin to count old and new heroes, expanding the choice of fighting party. The battle system of Dawn of the New World is a little more modern than that of Tales of Symphonia, even if it doesn't count on particularly complex mechanics and features, whose place is occupied precisely by the recruitment of enemies. The problem, if anything, does not lie so much in the fluctuating storyline, but in the structure of the game itself, excessively linear to be that of a jRPG and moreover a Tales. Beyond the world map, replaced by a mere list of places, and dungeons that are a bit too flat, Dawn of the New World lacks that spark that makes the prequel special and seems to want to leverage, without fully succeeding, on the nostalgia effect. From a technical point of view we are faced with an all in all sufficient product that has just been touched by the remastering work: Dawn of the New World is exactly the same game as 2009 in high resolution and therefore offers the same technical sector rather bland already seen in its time on Nintendo Wii. It may seem an unfair comparison, but we must consider that Tales of Graces F, PlayStation 3, was actually a title for Nintendo Wii which was significantly improved in terms of graphics and content during the porting phase. The porting of Dawn of the New World, on the other hand, appeared to us quite listless, almost like a sop developed in a hurry to inflate the re-proposition of Tales of Symphonia. It is still about twenty hours more in the company of the splendid protagonists of the prequel, so not all the bad silver comes to silver.", "date": "2014-02-27", "grade": "8.0"}