{"name": "Potere ai fabbri", "ref": "https://multiplayer.it/recensioni/128906-weapon-shop-de-omasse-potere-ai-fabbri.html", "text": "There's one thing all jRPG players have in common: every time they open a chest or defeat an enemy and find a new weapon, they check its stats, equip it to find out what it's like, discard it or sell it if not they need it or use it immediately to play them at the next monster. But this is not the point of contact, but the fact that no one ever deigns to reflect on who made that weapon. When was the last time you did this, after finding the legendary sword in the last chest of the last dungeon with which you then pierced the heart of the final boss? We tell you: never. Unless you made that weapon yourself with some abstruse crafting system, but that's another story. It is on this concept that the new Level-5 title plays, which calling it new is almost a contradiction: perhaps it is for us, but certainly not for the Japanese who downloaded it almost two years ago together with the other games in the Guild01 compilation, and ie Crimson Shroud, Aero Porter and Liberation Maiden. With Weapon Shop de Omasse the circle closes for us too, in short. In beauty... or not? Despite its shortcomings, Weapon Shop de Omasse is a truly original and captivating title No matter the size of the hammer... The introduction of Weapon Shop de Omasse is deceptive: it shows us the final confrontation with the terrible Lord of Evil in a video game setting of the 8 bit era which immediately suggests a period of only temporary peace. In short, the Lord of Evil will return, and a new generation of heroes will rise to oppose him. But someone will have to make weapons for these poor wretches, right? So here comes the young apprentice of a famous blacksmith with an idea to revolutionize the business: weapons, rather than sell them, will be rented and customers will pay them only if they are satisfied with the goods... and that is if they come back alive from their businesses. Have no fear, Weapon Shop de Omasse is by no means bleak or dramatic; on the contrary, it is a hilarious mockery of the jRPG genre with lots of sit-com laughs and sighs in the background, a cheeky - and rather repetitive, as well as in the long run irritating - soundtrack - and a character crazier than the other. Starting from the young apprentice, energetic and carefree, and from his master, a man of the world perpetually frowning, passing through the wacky customers who will visit the shop: the funny twins, the knight with the French accent, the samurai with no sense of orientation, the old woman with a handle and so on. All Japanese cartoon stereotypes taken to the highest levels, on which Level-5 made fun of a lot with various digs at the video game market and breaking down of the fourth wall that made us smile on many occasions. The adventures of these absurd heroes are constantly updated through the Grindcast, practically a kind of Twitter that we can consult at any time and which allows us to follow their adventures complete with hashtags and various quotes: the entire game, in fact, takes place only and solely inside the shop, filmed every day by a single shot. In these moments we will be able to consult the various menus, save and examine our stocks of weapons and materials in the warehouse, examine our collection and check orders. Because at any moment a new customer could arrive... The 3D effect Certainly not the best we've seen, but pleasant enough to be able to keep it active to embellish the image despite not affecting gameplay in any way. ... but how iron strikes while it's hot Despite appearances, Weapon Shop de Omasse is not an ~infinite~ game: in the upper right corner, an indicator shows us how much is missing from the resurrection of the Lord of Evil. By then we will have to make sure that we have become good gunsmiths and can make the best guns in the world. In the meantime, we will have to satisfy the requests of increasingly demanding customers, who will be divided between the important ones with a kind of history behind them and the very common ones that the game limits itself to calling, well, NPCs. Each of them will present themselves at our counter explaining what type of weapon they need and why, and we will have to get them the right one based on the values required in the three categories that characterize them. In case the weapon is not immediately available in our warehouse, we can always manufacture it: in these situations, Weapon Shop de Omasse becomes a sort of rose water rhythm game, with the iron to be beaten by strokes of the stylus on the lower screen following the rhythm of the music on duty and, perhaps, taking advantage of the breaks to warm it up and keep the temperature high enoughto guarantee an even better final result. Once the weapon has been delivered to the character on duty, we will be able to follow its vicissitudes on the Grindcast and, if they are successful, the weapon will be returned to us and we will be paid with the money and materials necessary to manufacture new ones. Weapon Shop de Omasse is therefore divided between visual novel moments, in which we will read the long and amusing exchanges - in English, beware! - between the characters, and the more managerial ones in which we will be able to dedicate ourselves to the manufacture or polishing of weapons to guarantee our customers the best war instruments in the world. Brilliant? Absolutely. hilarious? Enough, but not too much. The rhythm with which the main ~quests~ follow one another is decidedly fluctuating and whole minutes can elapse between one and the other in which nothing happens, perhaps when we have already manufactured all the weapons currently in the catalog. Even the rhythm game mechanics did not fully convince us: the touch controls are not exactly very precise, and we often end up involuntarily hammering the wrong points of the iron. Not that this really matters: Weapon Shop de Omasse is very, very easy, and we never had the feeling that we could fail in our exploits, however unlegendary they were.", "date": "2014-02-27", "grade": "7.0"}