{"name": "Lombra del vampiro", "ref": "https://multiplayer.it/recensioni/128771-castlevania-lords-of-shadow-2-lombra-del-vampiro.html", "text": "Since the dawn of time, vampires have exercised a certain fascination, sometimes even morbid, in the general collective imagination. In fact, these creatures have always populated the legends and popular beliefs of countries in the most disparate corners of the planet, sometimes for a sort of macabre folklore, more often out of ignorance. Many times, in fact, these beings have served to ~explain~ tragic events or scientifically incomprehensible events in remote times, such as sudden epidemics of plague or other unknown fevers. In any case, from the fearsome ciua-pipiati of the Aztecs to Lamia, the lethal anthropophagous vampire of ancient Greece, to the terrifying penanggalans of the Malay peninsula, their figure has evolved over the centuries, often in step with the customs of the peoples , and so we went from the terrifying bloodthirsty monster to the most fascinating figure of the elegant, beautiful and immortal vampire. Nowadays every sector of entertainment, from literature to cinema, up to video games, has not remained immune to the phenomenon, and even if occasionally there have been excesses, for example portraying these undead as teenagers in full hormonal explosion, those more traditional, whose main features were codified visually by films such as Murnau's Nosferatu and Tod Browning's Dracula, albeit in a slightly reworked form they continue to resist in some way. In the gaming sector, a large part of these themes have been the dominant figure in the plot of the Castlevania series, which for more than 25 years has been telling the eternal struggle between Good and Evil, between hunters and vampires. And it is precisely the last chapter that tells of this bloody war that we are going to talk about in this review. The return of Satan, the desire for mortality: Dracula awakens in the future for one last battle Curiosity There are four different difficulty levels: the first, Knight of Twilight, is equivalent to Easy; the second, Creature of the Night, on Normal and the third, Lord of the Shadow, on Hard. The last option, which is unlocked after finishing the adventure at least once, is called Prince of Darkness and is equivalent to the Very Difficult level. Also in the options menu you can choose to disable some hubs and QTEs. By sword or by rifle The combination of Castlevania and three-dimensional has never worked that much in the past, at least until the arrival of Castlevania: Lords of Shadow in 2010, a title with which the series was restarted from different points of view, starting with the development that was entrusted to the Madrid-based Mercury Steam team under the supervision of Kojima Production. A choice that proved to be a winner in terms of sales and critical acclaim, which prompted the Japanese company to carry on the project in a sort of new trilogy that finds fulfillment and conclusion in Castlevania: Lords of Shadow 2. The game practically restarts from the end of Mirror of Fate: without anticipating absolutely anything of the plot to avoid spoilers for all those who have not played the other Mercury Steam titles, we limit ourselves to stating that from a narrative point of view the connections with the predecessor are solid, and in a few minutes we it finds itself immersed in the typical atmospheres of the new saga, with a long-winded but trivial story at certain points. The protagonist of the story is Dracula, engaged between the past and the future in a grueling fight against Satan and his acolytes, between demons, robots, unscrupulous pharmaceutical industries and manufacturing companies dedicated to the manufacture of weapons. In view of the final confrontation with the demon, the Prince of Darkness must recover all his lost powers. On the gameplay front, the first important novelty of this Castlevania is its linear structure in progression, but at the same time quite open, with sandbox-style areas that are fully loaded without interruptions. The areas are freely explorable, and exploring them is not an experience in itself, since secrets are hidden inside them just waiting to be discovered, such as the city's memorials, useful for deepening the plot, or rare objects to collect. To be able to move better, the developers have also introduced a mobile camera that can be freely managed by the user. The latter works quite well by the way, even if it seems to be a bit of a dancer from time to time. In any case, the choice to give up the fixed camera that had characterized its predecessor and to switch to one positioned behind the protagonist was probably among the most difficult that Mercury Steam had to face, not only because, as we will see later, it required a complete change of graphics engine, but also because it made necIt required a total rewrite of the gameplay, especially in the combat phases. The modern settings have also contributed to these changes, which in addition to a different level design than usual have brought with them different enemies in addition to the more markedly horror ones typical of the saga. On balance, the user therefore finds himself having to cross the gloves even with mechs with a futuristic look and with other fully armed technological gadgets. Machine guns, bayonets and homing missiles are just some of the means by which the robots can do harm - and a lot - to the unfortunate Dracula, in a context that in these cases is revealed to be very far from the classic stylistic features of the saga. Style and design aside, the opponents, even the traditional ones, are in any case decidedly very difficult to face already at the lowest difficulty levels, which will make hardcore gamers happy, a little less ~normal~ gamers. All this is not related to their superfine intelligence or particularly varied attack patterns, but rather to the fact that they often arrive in large numbers and at the ~wrong~ moments, perhaps in support of some boss. The latter, medium or large, however, always prove difficult to eliminate, and many antagonists require a certain effort on the part of the users, as well as a good strategy to be eliminated. In this sense, it becomes essential on the one hand to exploit the protagonist's athleticism properly, on the other to learn and maximize the many moves at his disposal, in a spectacular and violent combat system, which clearly winks at titles such as God of War and that works well, tending to reward the most skilled and attentive player. That is, the one capable of not throwing himself headlong against the contenders by fumbling buttons at random, but vice versa capable of ringing parries, counter-moves and dodges. Chaos and the Void Dracula can act in different ways, for example by exploiting the classic QTEs to avoid blows or counterattack by inflicting high damage on opponents, or the classic attacks and related combos through the skills related to the Whip of the Shadow, the new blood weapon in his disposition. Then there are secondary objects, the so-called Relics, perfect in relation to their specifics for medium or long range attacks, to temporarily increase the maximum value of Dracula's life once restored (Tears of the Saint) or to temporarily slow down time and enemy movements. After a series of particularly effective hits, enemies release globes of energy that can be absorbed by pressing the left analog. These in turn fill two special independent bars with energy, which once loaded give access to the alternative use of two weapons, the Claws of Chaos or the Sword of the Void, which can be selected quickly by pressing the upper backbones of the controller . The former are extremely powerful and can be used to break down the defenses of more heavily armored monsters. In fact, these are special fiery ~gloves~ capable of making the protagonist perform powerful and concentrated attacks, to the detriment of speed and range. The second weapon, on the other hand, regenerates vital energy with each successful attack, absorbing lifeblood from enemies, and proves to be particularly useful in moments when combat becomes more frenetic and there is no time to resort to bites on the neck or anything else useful for healing. As it is easy to understand, these two weapons replace the powers of Light and Shadow that characterized the predecessor, but keep the basic characteristics intact. Remaining on the subject of war resources, the new Mastery system is noteworthy, which allows you to improve the specifications of individual weapons, even secondary ones, through their repeated use. In fact, each of them has its own tree of skills and upgrades, in this way those who prefer a certain type of attack the most, can enhance them step by step by increasing the potential of the selected specialty. To ~work~ on the purchase, on upgrading weapons or on the protagonist's skills, as well as to always keep everything under control, including missions, map and inventory, there is a Travel Diary that can be recalled by simply pressing the Select key. Even if the fulcrum of the adventure remains the clashes, the platform sessions are important in which the Lord of Darkness climbs, jumps and interacts with the scenario, helping himself to find his way with on-screen indications provided by groups of bats or through the his vampire senses. Unfortunately these moments did not live up to expectationsive, and they almost seem to have been inserted just for ~duty~, resulting in the long run repetitive between QTEs, guided paths and so on. The sessions in perfect stealth style are on the same wavelength. In these phases, which almost always take place in modern laboratories or bases and which are not very many, the user's ability to hide and act in the shadows is rewarded, also exploiting Dracula's powers here to blend in or unlocking doors, such as turning into a mist, a rat, or controlling enemies for a short time. But to be honest we didn't like them that much, since they seem almost detached from the rest of the game, and they too turn out to be quite monotonous and repetitive. It is understandable that the developers always try to vary the gaming experience within certain limits to avoid making the game design flat and lengthen the adventure, in this case for a total of about 15-20 hours, but we also believe that there is a way and a way to implement certain innovations. Xbox 360 goals Castlevania: Lords of Shadow 2 offers 46 achievements for a total of 1000G. Most are related to the acquisition of objects or skills, and to the upgrading of the protagonist's weapons and techniques, while the more complex ones require the spending of a certain number of experience points, the completion of the Kleidos challenges or that of the main adventure on the Prince of Darkness difficulty level. The eyes of a vampire Coming to the technical sector, the choice to work only on the now past generation of consoles has anchored the technical sector of Castlevania: Lords of Shadow 2 to ambitions that are not too high in terms of effects and texture quality. However, the work done on the ~new world~ entirely in three dimensions seemed to us quite valid in some respects, and overall the graphics ~let you look~, even if they do not reach the quality level of the latest titles released on Xbox 360 and PlayStation 3 The main characters are well characterized and cared for, while the others appear uninspired in design and not adequately finished. Ditto the scenarios, which offer pleasant glimpses, thanks also to a good play of light, but which on the other hand are a bit bare in various points in terms of complex textures and details. Even the blood, of which the game abounds, and even the new environments of Wygol City, whose design sometimes seemed deliberately excessive from a stylistic point of view, with its architectural buildings where baroque and steampunk that seem to merge into an original solution, have not fully satisfied us in detail. In Castlevania: Lords of Shadow 2 we cannot fail to mention the frame rate, which is confirmed as quite a dancer in certain moments, just like the one seen in the first episode. As far as the story is concerned, where the incipit of the predecessor was presented in a very dry way, here we are faced with a more cinematic composition of the events, which are told through long dialogues and well-made filmed sequences. The sound sector is also very valid, with the excellent dubbing in English (the game is subtitled in Italian) and audio effects qualitatively in line with the rest of the production. All of this is corroborated by the excellent soundtrack signed by the usual Oscar Araujo, able to properly underline the most significant moments of the adventure with decidedly atmospheric music that is perfectly integrated and in keeping with the narrative context of the gaming experience. The songs that make up the work alternate between different genres ranging from ~simple~ piano accompaniments to industrial rhythm, up to more epic tracks that would not look out of place as a soundtrack to a Hollywood fantasy blockbuster.", "date": "2014-02-25", "grade": "7.3"}