{"name": "Il fascino dell'esilio", "ref": "https://multiplayer.it/recensioni/128774-banished-il-fascino-dellesilio.html", "text": "The genre of the so-called city-building games, which include successful series such as the very famous SimCity by Maxis or the historic Caesar by Sierra, represents a peculiar strategic vein with roots firmly anchored to the PC platform, although the first experiment in this sense, or Don Daglow's Utopia, was released way back in 1982 on Mattel Intellivision. There is no doubt that this type of game experienced its heyday between the 90s and the beginning of 2000 - culminating with the publication of the beautiful SimCity 4 - and only recently, after a long period of tarnishing, was back in vogue again thanks to Cities XL of Monte Cristo and above all to the new iteration of SimCity, despite the disastrous launch and problems of various kinds still to be rectified. The product that we will analyze in the following paragraphs is fully part of the same videogame sphere, even though it presents itself with original nuances and a fascinating story behind it; Banished was in fact created by a single developer, the expert Luke Hodorowicz, who, after 10 years spent at Vicious Cycle Software, decided to quit and take the ~solo~ path by founding Shining Rock Software. The most curious aspect of this story is represented by the fact that the work, in principle, was supposed to be a classic zombie-based action-RPG, however after nine months of hard work the developer realized that something was wrong, and so, also driven by the inflated theme, he decided to exploit the product code for something extremely different. Here we tell you the conclusion of an exciting adventure that began in the summer of 2011. Banished offers a unique sandbox experience on the theme of survival Make love, not war Bandits, exiles, expelled from their motherland with a cart of supplies and the need to build a new life, a new home. A new story. This is the fascinating incipit of Banished which, while not addressing the reasons linked to such a dramatic situation, places the fate of a group of families in the player's hands - variable according to the level of difficulty - with children in tow and the desire to start over. The new path of life, fraught with obstacles, must be built with a lot of good will, with sacrifice and, above all, wisely exploiting the expanse of woods, waterways and forests that stand out before the eyes of the exiles at the beginning of each new countryside. They are the basic ingredients to transform a nightmare into a great opportunity, and why not, to make the player caress the dream of a desert land to colonize, of a new community to found and shape, far from the yoke that grips modern societies. After all, the success of series such as Lost and of programs based on the theme of survival also lies in this component of escapism, and in Banished one can savor the taste of building a village, even a city, simply by exploiting hard manual work and what nature provides. In Luke Hodorowicz's title there is no ultimate goal other than to make one's community survive and expand, only defying the atmospheric agents, the passage of time, food shortages, diseases and sometimes some disasters such as fires and epidemics. In Banished there are no armies, invasions or anything else to do with combat: there is only an earthly paradise to colonize and the concept of family to feed and protect. ~Make love, not war~, seems to suggest every screen, every sound that permeates the atmosphere of this very delicate and profound work. Although the setting may appear medieval, with some visual references to the Nordic-style villages present for example in Skyrim, the developer has made it clear that it is a setting of pure fantasy, this to encourage identification and overcome some historical urgencies , such as growing seeds unavailable at the time. The exceptional tutorial, among the best for clarity and completeness in this genre of games, tells us that one of the most subtle enemies to fight is represented by the frost of the harsh winters, thus inviting us to immediately build some wooden houses and assign the role of lumberjack to one of the workers. The availability of firewood in fireplaces, in fact, is one of the key elements for the survival of our community. For food sustenance it is instead possible to build fishing posts and hunting cabins, devote oneself to cultivating the fields, plant fruit trees and so on, all while paying close attention to keeping the productivity of our Eden in balance, con an eye to eco-sustainability. An employee in the planting of new saplings and in the uprooting of the old ones is undoubtedly useful in this sense, as is an herbalist dedicated to the collection of berries and herbs, which are extremely effective also for the treatment of diseases. Otherwise, a blacksmith can provide more efficient tools capable of speeding up the work, while a hairdresser can transform the hides deriving from hunting and farms into warm clothes to better face the cold seasons. The player can move workers from one job to another based on the most pressing needs and without worrying about specializations, simply making a virtue of necessity as would be the case in a similar situation. It is also possible to build roads, bridges, schools, hospitals, places of worship, warehouses and a whole series of buildings, in wood or stone, in order to improve general efficiency, the well-being of citizens - represented by hearts in the special menu - and their happiness. The cornerstone of the management system in Banished lies in the fact that it revolves around human resources and not money, as instead happens in other similar products; this guarantees a much better understanding of the dynamics involved and more intuitive leeway. Naturally our citizens reproduce, and children represent the future for the community we are building; keeping them until they too can contribute to growth is another of the many challenges that confront us in Banished. Too many mouths to feed and too little food available, as you can imagine, can in fact have catastrophic results. Delicate balances One of the main problems in this kind of game is often represented by invasive and extremely confusing menus, however the Banished interface, in addition to being pleasant, is always very clear and complete. Each table and icon shows exactly the information you need to better manage your settlement, furthermore a series of messages - perhaps a little untimely - warns us of the problems in progress, guaranteeing us total control of the situation. Of course, the delicate and fragile balances on which the playful scaffolding rests can collapse at any moment due to some parameter not carefully evaluated or to a sudden misfortune, nevertheless if you work carefully from the outset, with an eye to prevention , obtaining beautiful and thriving towns is not an impossible mission (although failures are always around the corner). The fact that any objective to be completed is missing, beyond the achievements present, takes away a little bit of bite in the long run and after having ~secured~ one's settlement, however the sandbox nature of the title and the varied range of options always offer the opportunity to improve and devise new strategies. Among other things, for example, it is possible to build a commercial exchange point where one can barter one's resources with those of the merchants who cross the river, thus making available the breeding of new animal species and the cultivation of better seeds. A varied and balanced diet, just like in real life, is one of the keys to ensuring happiness and well-being for our community of exiles. The Village During the more than two years necessary for the development of Banished, a good part of the time was used by Luke Hodorowicz to create the graphic and audio assets, to which the programmer dedicated the same care placed in the interface and in the strategic-management component of the game . The result is an extremely pleasant product concentrated in a hundred Megabytes, whose best performances can be perceived by setting the DirectX 11 from the appropriate video options panel. Among others, in addition to the classic resolution and v-sync, it is possible to set the quality of the antialiasing, the anisotropic filter, the incidence of reflections, the quality and resolution of the shadows. With our main test configuration, in 1080p and at maximum detail, the title is firmly anchored to 60 frames per second, giving extremely convincing bucolic glimpses as well as urban settlements rich in detail. The sensation is that of being in front of a delightful animated diorama, with the smoke rising from the fireplaces and an absolutely credible realization of the atmospheric agents - such as snow and rain. The sound effects are also very good, in particular those relating to the work of the community and the environmental ones, which the developer recorded while hiking in the woods near his home. The soundtrack is excellent, characterized by delicate, pleasant and captivating themesor fully the spirit of the work. Banished is currently only available in English, however the clarity of the information and the elementary language used make the product usable even for non-English speakers. However, a translation into our language is probable, also because the title will soon be supplied with a mod kit that will push its diffusion in the community.", "date": "2014-02-24", "grade": "8.0"}