{"name": "L'attacco dei mostri giganti", "ref": "https://multiplayer.it/recensioni/128717-earth-defense-force-2025-lattacco-dei-mostri-giganti.html", "text": "Born as a budget production, the Earth Defense Force series has now turned ten and over time has managed to carve out its own space even outside the borders of Japan, although its popularity remains high especially at home. We are in fact talking about a third person shooter that clearly recalls some elements of the Japanese imagination, such as the giant monsters that invade Tokyo and destroy its buildings, until a special force is sent to counter its advance. The new episode, available on PlayStation 3 and Xbox 360, is probably the most substantial ever made by Sandlot and serves as a sequel to Earth Defense Force 2017, taking up the events and showing the return of the huge ants, terrible spiders and vehicles aliens that the team only managed to defeat a few years ago. In reality, the plot of the game is barely sketched and it certainly cannot be said that the artistic direction or the narration constitute the strengths of this title, which in the end is only looking for an expedient to catapult us back into the action, putting us from time to time time at your disposal a large urban scenario and asking us to clean it of enemies. Earth Defense Force 2025 offers many missions and a certain spectacularity, but technically it disappoints a lot Fantastic Four The central theme of Earth Defense Force 2025 lies in the four available character classes, which we can select at the beginning of each of the eighty-five missions that make up the single player campaign (and to which some extras are added if we choose to replay the levels in online multiplayer). The Ranger class stands as the traditional balanced choice, it is equipped with medium armor and an excellent degree of mobility, while the starting equipment consists of a machine gun and a missile launcher. Then there is the Air Raider class, the typical support unit whose usefulness, however, is quite dubious. In fact, this character can only convey the attack of the troops controlled by the artificial intelligence, launching light signals to signal the position of the enemies. It could have some value within an online team, but the gameplay doesn't boast who knows what strategic facets and therefore the choice to include this figure seemed to us at least questionable. So let's move on to the more extreme and spectacular classes, the Wing Divers and the Fencers. The former are basically a special female body equipped with light armor, a jetpack that makes them the units with the best possible mobility and two weapons, a light one for close combat and a plasma cannon capable of causing spectacular explosions. Finally, the Fencer class is the ~heavier~ one, equipped with impenetrable armor and boosts that allow it to move rapidly forward, but at the same time very slow in moving. Fencers can equip more weapons than other classes, and their power is devastating. Based on the missions completed and the items collected in the field, it is possible to unlock new weapons for each class and thus significantly increase their effectiveness in battle. This actually constitutes an element of interest for replayability purposes, given that it is necessary to face the missions with all the characters in order to make them ~grow~ in the same way and therefore not find themselves in difficulty during the last and most difficult stages, when perhaps the situation requires the use of one class rather than another. Playstation 3 trophies There are fifty-one Trophies obtainable by playing Earth Defense Force 2025, if we include Platinum. Unlocking them is a rather simple and linear operation, given that it is enough to complete all the stages with all the available character classes, eliminate a certain number of enemies and obtain all the weapons. Giant insecticide The assumptions of Earth Defense Force 2025 are the usual, but they are enough to generate a certain involvement, even more so if you are in tune with the theme ~giant monsters destroying Japanese cities~. What the game lacks is, in fact, the solidity of a production that is able to guarantee adequate support for certain choices. Let's try to explain ourselves better: the gameplay is very simple and systematically repetitive, since all we have to do in each level is eliminate the enemies, whether they are gigantic insects, alien spaceships or huge robots and mobile fortresses. The sense of scale is remarkable, on the one hand because the portions of the city represented on the screen are very large and completely destructible, on the other because there are truly immense opponents and even just seeing them arrive causes a feeling of fstrong participation, the same that pushes to complete one mission after another despite some obvious limitations. The first concerns the technical sector, unpresentable today, at the end of the life cycle of PlayStation 3 and Xbox 360, marred as it is by collapses in the frame rate precisely where the sequences become more spectacular, for example when we rise into the air with a Wing Diver to bombard insects from afar with plasma cannon shots, destroying practically everything that comes within range, or when the most impressive alien units enter the field. Running into real slow motion in such situations generates a very high degree of frustration, even and above all when facing multiplayer missions. The second limitation concerns the feeling of a very simple combat system, based on two or three maneuvers that are repeated indefinitely but which do not produce the sensation one would expect from the use of such powerful weapons. It is as if the developers had remained in view of the early days of the series, when it was precisely a budget production and without too many pretensions, with the difference that ten years have passed and a title with these problems cannot be proposed on widely tested hardware .", "date": "2014-02-21", "grade": "6.0"}