{"name": "Ys: Memories of Celceta", "ref": "https://multiplayer.it/recensioni/128639-ys-memories-of-celceta-il-peso-dei-ricordi.html", "text": "Little publicized and badly distributed as always, the Ys saga isn't exactly one of the most popular on our continent. Yet it was born in the distant 1987 thanks to Nihon Falcom, has a long list of main episodes and spin-offs, and is still revered by a hard core of fans all over the world, used to seeing it overshadowed by much more commercial giants. The case of Ys: Memories of Celceta, then, is so bizarre that it is worth telling. Despite being developed after Ys Seven, Memories of Celceta actually represents the fourth adventure in the history of the absolute protagonist Adol Christin: the reason is rather abstruse, and concerns the fact that in the early nineties Falcom had licensed two software different houses, Hudson Soft and Tonkin House, who had created their very personal interpretations of Ys IV, subtitled respectively The Dawn of Ys and Mask of the Sun: the backbone of the plot for better or worse was the same, on Falcom's directive, but the two stories developed differently, contradicting each other. Once the license was regained, taking advantage of the fact that neither of the two Ys IVs had been published in the West, Falcom thought it well to discard them both and to offer his fans the true fourth adventure of Adol, with a brand new script on a console just born. In short, a nice clean break with the past, which allowed the very Japanese developer to invite both veterans of the series and those who have never heard of it to the magical universe of Ys. Will he have succeeded? The new Ys is a must buy for action RPG fans with a PlayStation Vita in their pocket Forget me not Mind you, the event that is the premise for the whole story of Ys: Memories of Celceta is one of the most banal possible and imaginable. In fact, in the opening sequence we find an Adol hanging around the streets of the village of Casnia who collides directly with one of the passers-by, getting a big punch that knocks him out. Cut, nice cartoon opening theme, title, back to the game: what the hell is happening to Adol? Duren, an old acquaintance of our red-haired adventurer, who has lost his memory, also asks. Well yes, Memories of Celceta has a protagonist afflicted with amnesia, probably caused by his exploration of the nearby forest of Celceta. It is said that no one has ever returned from its depths, but Adol and Duren receive an offer impossible to refuse: explore it and map it for the government, the first to regain his memories and the second to scrape together some change. In short, the adventure begins like this, almost on the spot, but fear not because it is not as trivial as its own incipit: during their wanderings Adol and Duren will come across characters and situations that will paint a much more complex and interesting, often playing on Adol's amnesia and the alleged ~trouble~ he would have done before losing his memory. In short, there is no shortage of funny moments and the dialogues of the good cast help to make the story particularly pleasant even in the most tense moments. We said at the beginning that Falcom, with this ~reboot~ of the fourth chapter of Ys, has taken the opportunity to open the franchise to new fans as well, and in fact it is precisely the amnesia ploy that allows it since Adol's memories are scattered throughout the region and once recovered they will not only increase his stats but will also trigger flashbacks that will tell us glimpses of his childhood, deepening the character like never before. In this way, historical fans will be happy, who will finally have the opportunity to learn more about their favorite and what prompted him to embark on a life of adventures, and newbies will be satisfied, who will therefore be able to enjoy the world of Ys even if they have never played one before. The story is told completely in English (rather scholastic, but non-English speakers be warned) through numerous illustrations or cinematics that make use of the game's graphics engine, sometimes dubbed and more often not. The result is a Ys more similar to a traditional jRPG in terms of narration, thanks also to a good visual realization which, however, did not make us cry out for a miracle: the character models and their animations are more than satisfactory, the locations numerous, varied and detailed, but the whole adventure appears to be filtered by a blurry patina that tries to restore an ethereal atmosphere ending up becoming more annoying than anything else. The bright colors guaranteed by the OLED screen smooth out this problem a bit, and the frame rate is always constant even in collisions.the most spectacular makes up for a graphics sector that could have been better. The good soundtrack by Hayato Sonoda closes the circle, a pleasant accompaniment without acute details. PSVita trophies The array of trophies available to the player is quite large: forty bronze, nine silver, two gold and platinum to complete the collection. Some will be unlocked simply by completing the game, while others will have to work hard, for example by recovering all memories of Adol or by satisfying particular requirements in combat. The Three Musketeers As per tradition, Memories of Celceta is an action RPG in which the player, in the role of Adol, explores the world and puts enemies to the sword thanks to a decidedly entertaining real-time combat system. The player is granted a fair amount of freedom: we tend to have to head towards the next objective marked on the map to carry on the main storyline, but often nothing prevents us from prevaricating and discovering the map in totally opposite directions which frequently lead to portions of the area designed only for guard chests, natural resource caches, or optional keepsakes. In the various villages that we will visit it will be possible to undertake optional missions, which normally ask us to defeat certain enemies or recover some materials: completing them means exploring the map even more - something for which, however, we will be rewarded - and earning objects and money with which, of course, buy new weapons or upgrade the old ones. In fact, Memories of Celceta offers a simple ~crafting~ system that allows us to make our equipment more effective, increasing the resistance of the armor or infusing bonuses to weapons. This is a somewhat superficial level of customization that we have never really felt the need for, except in the final stages of the adventure, and which in any case marginally embellishes an already very good combat system. Had there been a ~lock on~, we would have been even happier: the player controls one of three party members and can switch to one of the other two with the push of a button. In brackets, the excellent artificial intelligence of the two automated companions is striking, able to attack the right targets, collect objects for us and dodge most of the enemy shots. It is certainly not a mere button mashing, attention: we have only one combo per character, but also a large series of special moves that can be associated with the four front keys in combination with the R key. The L key, on the other hand, allows you to unleash a particularly devastating super move that consumes a gauge to be filled by performing special moves or landing charged shots. Parrying and dodging, if done with perfect timing, can respectively mitigate the damage in full or slow down time for a few seconds, giving us excellent attack opportunities. The point is that each character can inflict very specific types of damage (cutting, impact or piercing) and some enemies turn out to be more or less vulnerable or resistant to a certain type of weapon, suggesting the player to switch characters on the fly to inflict more damage and, with a little skill, chain the effects of special moves into long and devastating combos. Apparently caciarone, the combat system of Ys: Memories of Celceta is instead very fun and never frustrating, thanks also to a well thought out system of checkpoints and transport points, supported by the possibility of saving at any time and even accelerating the speed of the non-interactive sequences.", "date": "2014-02-20", "grade": "8.5"}