{"name": "La colazione dei campioni", "ref": "https://multiplayer.it/recensioni/128347-toast-time-la-colazione-dei-campioni.html", "text": "Universally recognized as the most important meal of the day, breakfast must also have been a great source of inspiration for the Force of Habit developers, who wanted to make the Anglo-Saxon household appliance the prince of the morning the absolute protagonist of their latest work: the toaster. We are talking specifically about TERRY (acronym of Toast Ejecting Recoil & Reload System), pixelated and smiling tool that will have to massacre enemies during 45 different levels by shooting slices of bread as if they were bullets. In short, that of Toast Time is an extremely bizarre premise, under which, however, an action game with a great temper is hidden ... The toast test In addition to the morning meal, Toast Time also owes its existence to the 8-bit classics from which it is evidently inspired for everything concerning the audiovisual sector: graphically, the title stages almost monochromatic scenarios, with a single background color on the which stylized white pixels stand out. Despite this deliberately ~poor~ style, the final result is really convincing and gives the product a strong personality, also made manifest by the precious detail of a soundtrack that boasts the beauty of 45 original tracks, one for each level of the game. Unlike many other titles that bask in their good looks and end up neglecting the gameplay, Toast Time takes very little to convince the user of the goodness of its videogame ideas, even if it starts from widely known bases: the game is a to all intents and purposes a shooter, in which the objective is to shoot down all the enemies that appear on the screen before they can reach the big clock that marks the time remaining to the end of the stage. What makes Toast Time special are the dynamics linked to the ejection of the bullets, since pressing any point on the screen shoots a slice of toast in that direction, however also obtaining a marked recoil of TERRY in the diametrically opposite direction: since there is no other inputs into the control system, we understand how the act of firing serves not only to eliminate enemies, but also to move along the scenario. The harmonious combination of these two elements proves to be the key to success in Toast Time, which after a first phase of deliberately simple stages engages the fifth, offering a respectable level of challenge: it is at this juncture that the Force of Habit gives its best, pushing the user to have to act very quickly while also evaluating the consequences of each single shot. Behind an apparent frivolity, Toast Time reveals itself as a fun and very tough shooter However, the merit of the English developers is not limited to the good realization of an original idea, but also extends to the care of a whole series of elements surrounding the gameplay. We start with a nice selection of weapons, unlockable during the adventure and usable with limited ammunition when hitting the appropriate boxes: in addition to guaranteeing variety in the action, these also support the tasty humor that permeates the entire production. dividing himself between clockwork baguettes, explosive bagels, machine guns of bread crumbs and so on. The shooter mechanics are then regulated by a couple of extremely well-chosen expedients: therefore it is possible to chain combos (thus increasing the final score and consequently the chances of obtaining the proverbial three rating stars at the end of each stage) by hitting the targets a few seconds apart from each other, and keeping this trend long enough you can enter the Coffee Time mode which increases the speed and power of TERRY's attacks for a few moments. As they say, however, a good game does not last long and this is particularly true when referring to Toast Time: despite the sudden increase in the level of difficulty, the 45 stages that make up the package can also be completed in a single session. What is certain is that getting the maximum rating in each scheme is a whole other matter, and if you add to that the achievements and a whole series of clothing items to unlock and use to customize TERRY to your liking, then it is It's easy to find enough motivation to backtrack, at least for a while.", "date": "2014-02-12", "grade": "8.4"}