{"name": "The Wolf Among Us - Episode 2: Smoke and Mirrors", "ref": "https://multiplayer.it/recensioni/128261-the-wolf-among-us-episode-2-smoke-and-mirrors-nessuno-e-senza-peccato.html", "text": "For an introduction to the series, we refer you to the review of the first episode. What we review here is the second one, Smoke and Mirrors. In all, five episodes are planned and, as always in these cases, we will have to wait for the end of the series for an overall judgment. Bigby, the protagonist of A Wolf Among Us, has style. And everything else has them too, from menu screens to dialogue fonts. This is a ~tempered~ series, almost glamorous in its artistic direction. All a shimmer of shocking pink and fluorescent blues that make us almost believe we are in front of a glossy world. But it's just a deception, like the glamor that the Fables use, in this case a spell, to hide their grotesque appearance from the eyes of humans. Beneath the layer of makeup is a squalor that rivals the ordinary world. In Woodland, the Fable ghetto, located in the heart of Manhattan, there are the same hateful social divisions that we all know, and there is no shortage of perverts, moral, sexual, you name it. One of these, however, went the extra mile and started killing other Fables, first Faith and then Snow. What a mistake. Because now Bigby is really angry, and he won't stop sniffing the trail until he has his claws on the culprit. Thus begins a tight investigation, which soon becomes a labyrinth. Suspects who turn out to be innocent, dead ends, too many clues to connect, and everyone who seems to have something to hide. The main plot is intertwined with the subplots born from the relationships between the Fables and, every time we seem to have reached a turning point, we realize that one track opens up others. The case is becoming a game of mirrors, and the tips are smoke and mirrors for Bigby. There is no shortage of twists, although we must admit that those related to the main plot are easy to anticipate, unlike those relating to the secondary characters. It seems that the more we hunt down the culprit, the more skeletons we find in the closets of the Woodlanders. The pace of the narrative is pressing, because the spotlight is always on Bigby, the absolute protagonist of this second episode. The feeling of having everything in hand is strong. We are in charge, and perhaps that is precisely the problem. Bigby, in fact, has some behavior problems. So let's find out what's going on under that fur. The investigation has begun, and Bigby has carte blanche: will you be able to rein in the beast in Smoke and Mirrors? By hook or by crook After the first episode we had some reservations about this series, but now the character of A Wolf Among Us is coming out. Instead of proposing narrative crossroads (in fact all the choices converge on the same point), the writers have chosen to focus on Bigby's inner conflict. In Smoke and Mirrors there is a considerable amount of dialogue, and each time we have to choose whether to give in to the violent and unbridled side of Bigby or keep the wolf under lock and key, in favor of a softer approach. The beast is seductive, and it seems that every occasion has been designed to lead us into temptation. Bigby's patience, and therefore ours, is constantly tested. Opinionated and hard of hearing pimps, jealous lovers for no reason, suspects muttering half-truths: it's hard to keep your hands in your pockets. On the other hand, violence complicates everything and does nothing but attract the hatred and dislike of those around us. If, like us, you took off that poor wretch's arm in the bar in the previous episode, now you'll have one more chance to be ashamed to see him crippled. To make it more difficult we add the fact that we have full power. Bigby doesn't let anyone put him down and we know it, we feel it, we've had proof of it more than once. He is the law, the strongest, and decides how to act. All this power is intoxicating, and this is precisely where the subtlety of this second episode lies: making our mouths water but punishing us with a sense of shame if we bite too hard. For this inner tension alone, the series is conquering us. But there's more, even if we have to keep our mouths shut so as not to end up in the group of twisters. Short but intense Let's just say that the investigation is exciting: there are so many clues to examine, ambiguous characters to question, and a whole network of half-truths that keeps you tied to your chair. Someone could argue that the game drags us from one scene to another without leaving freedom of movement, but it is also true that each meeting adds pieces to the puzzle, or removes them: in any case it makes us want to know what awaits us next. Perhaps the choice of whether to be the good cop or the bad one is repeated too often. Even the few fisticuffs prexempt, always justified by events, are however a test for Bigby's character. To hit or not to hit? And once we start hitting, when do we stop? Inner conflict is always on stage in this episode. However we are glad that the brawls do not take up too much space. The scene in the nightclub is much more effective, in which we wander around with a spanking shovel going from one piece of furniture to another, each time with the possibility of pardoning or destroying the furniture in question. In short, before we really miss a few words too many, let's just say that Smoke and Mirrors has put the series on the right path. The only really sore point concerns the fact that after so many months of waiting an episode with a total duration of one or two hours at most was released. At this point it is natural for us to advise you to wait for the series to end, otherwise it is torture because, after this episode, you will feel the urgency to have a chat with whoever we know. But not after four months. Right away.", "date": "2014-02-08", "grade": "8.0"}