{"name": "Velocit massima", "ref": "https://multiplayer.it/recensioni/128151-strike-vector-velocita-massima.html", "text": "One is really surprised, somewhat disoriented, when approaching Strike Vector for the first time, as always happens when a multiplayer shooter offers a control system that is easy to understand but difficult to master. The game provides some suggestions and allows us to take a tour alone within the scenarios, so as to understand the mechanisms that regulate vehicle control; but it is one thing to become champions of the hairpin bend, another is to carry out the same maneuver while ten other spaceships shoot the impossible at us. The result of so many efforts is more often than not a spectacular explosion and our vehicle that transforms into a fiery comet, which perhaps has the good fortune to slam into an enemy and take him to hell before finally crumbling. However, as always happens, with a little practice and some experimentation things change and you can stop being ~the incompetent guy who loses the team~. Yes, because in Strike Vector each life is worth a team point, and when you lose it it's true that the respawn is infinite, but it's also true that the scoreboard cries. The first work of the French team Ragequit Corporation therefore debuts on Steam, and despite the controversy surrounding the transition to a premium model of 22.99 euros instead of the original free to play setting (but the developers have promised the release of numerous updates free), the servers are definitely full of users who are eager to try their hand at this new and frenetic experience. Strike Vector is a fast-paced and spectacular multiplayer-based shooter, unique in its genre Like a flash Speed is undoubtedly the most striking factor during the first games with Strike Vector, because in the absence of a minimum of practice it is really easy to crash into an obstacle and therefore not even get to the appointment with our opponents. The modes currently available are the classic and team deathmatch, a territorial mode called Team Domination and one based on the collection of bounties, Bounty Hunter, which take place in the perspective of exciting playlists within eight different scenarios: Platform93, Slum045, Death Canyon, Sand Storm, Iron Fortress, Airshot City, Inferno and Farwest. The game does not support the use of the controller, unfortunately, and a small bug with the assignment of the W key must be fixed before doing anything (just ~reassign~ it in the options), but in principle the combination keyboard / mouse it proves to be spot on and provides the reactivity and precision necessary to proceed expeditiously and perform spectacular maneuvers as we try to eliminate the enemies and avoid their fire. The vehicle has two configurations, and switching between them quickly is one of the secrets to our eventual success. We start with the jet mode, very fast but imprecise, and then move on to the ~stationary~ mode, with the spacecraft that ~opens~ and remains suspended in the air, moving much more slowly but thus managing to obtain superior shooting accuracy, as well as the ability to use a zoom to hit targets even from a distance. This element of gameplay variation opens up to different approaches, further supported by the presence of a radar that does not signal our position unless we open fire or accelerate with respect to cruising speed, which allows us, for example, to stay away quietly to ~camp~ behind a shelter or to chase the other players without them realizing it, to then strike treacherously. Double weapons, double fun Strike Vector adopts a decidedly peculiar approach as regards progression, making all the weapons immediately available to us regardless of the level of experience. In some ways this turns out to be an advantage, going to cancel any disparity between expert users and novices, at least in terms of equipment, but for others it represents the renunciation of an important growth factor in terms of longevity of the product, which at this point will be guaranteed only by the release of new weapons and modes by the developers, as already mentioned. Before launching into the middle of the action, we will therefore be able to configure our Carrier and equip it with two different weapons, one on each side, as well as a passive type specialization and an extra skill. The weapons are eight in all and are well differentiated in terms of range, frequency of fire and power: the gatling is one of the most balanced choices, perhaps to be kept under the left wing, while on the right we can mount a standard or research missile launcher. ConfigureOn more thrusts they will see us using a shotgun or a carbine, for dry and powerful shots, or even two ~swarm~ missile launchers, the most lethal combination from short range. Each weapon has two perks that can be selected from a list of five, which improve damage, range, rate of fire, silence and accuracy. As for the passive skills, it is possible to obtain greater resistance, a higher base speed and so on, while finally the extra usable object can be a sudden boost capable of getting us out of trouble, a sequence of repairing nanomachines, a shield energy, a tactical hologram, or more. In short, the possibilities are many and the combinations really numerous: anyone will be able to design their own ideal vehicle after a few games. Big impact The Ragequit Corporation title uses the Unreal Engine 3 in an effective and spectacular way, guaranteeing a considerable visual impact on certain configurations. In our case we were able to play with all the effects at their maximum, at 1080p resolution, always keeping to 60 frames per second, apart from very rare drops in the busiest situations. The style adopted takes up some of the classics of the shooter genre, for example Ikaruga, with these huge metal structures that sometimes have a ~closed~ shape, full of obstacles to avoid, while in other cases they open leaving us completely free to move but also quite a few discovered compared to the sorties of the opponents. The scalability of the graphics goes into detail and allows you to use the game even on mid-range PCs, while the system that regulates matchmaking has been improved compared to the beta and works really well, guaranteeing us access to the various servers in a matter of moments . The system is accompanied by a sufficiently lively soundtrack, able to connect with the frenzy of the action on the screen and to underline the impacts and explosions with effects up to expectations. The picture that emerges is therefore that of an indie production of indisputable technical quality, highly spectacular, characterized by a hardcore approach that requires commitment and a little patience, but which knows how to give great satisfaction when you enter the mechanisms that regulate pursuits and firefights.", "date": "2014-02-05", "grade": "8.0"}