{"name": "Silt", "ref": "https://multiplayer.it/recensioni/silt-recensione.html", "text": "Games like Limbo or Ico work because their authors have wisely chosen not to lock their scenarios in the prisons of logic. Their worlds give as few references as possible. They suggest, but they don't tell. They tell without following a precise narrative thread, at least in appearance. They work because they never deny their mythological dimension, their living in a space other than reality and the traditional imagination. The characters who populate them are apparitions that make timeless spaces resonate, born of an unknowable story because it is lost in time. Will the developers of Spiral Circus Games have managed not to be frightened by the unknown? Let's find out in the review of Silt, a very special title. At the bottom of the sea The objective of the game is to defeat giants In Silt you wake up as a strange diver chained by who knows who in an ocean dominated by colossal creatures that protect the secrets of an ancient civilization. The only words we'll read throughout the game are six verses that serve as an introduction and basically explain what we have to do: find the giants and suck their eyes to reactivate an ancient machine. For the rest we will be left to ourselves and in search of our goals, which will have to be addressed in a pre-established order. We don't have a name, we don't have a past, and we don't know where we're going. The world around us is a big mystery, as is our mission. Turning we will also meet the corpses of our fellows. Why am I there? The protagonist doesn't have many resources at her disposal. He can obviously swim, increasing or decreasing his speed, and he can light a torch. Its only power, which is also the fulcrum of the gameplay, is the ability to possess fish, then using their abilities, projecting a tentacle of light from the helmet. The same power can also be used to interact with some objects, such as levers. All the puzzles that Silt is made of are based on this power. Just to give an example, it is possible to have electric eels to give energy to machinery, or it is possible to dominate schools of small fish which, after being contaminated, can be used to poison decidedly voracious carnivorous plants. Or again, crustaceans can be used to break fans, or the sharp teeth of piranhas to cut ropes that block our way. In general, when multiple types of fish are seen in a level, they will inevitably all have to be possessed to solve the puzzles. The maps of them aren't very big and there isn't much to explore. The first chapters of the game are very linear, while the final ones offer more complex puzzles, sometimes distributed in several sections. At the end of each chapter you have to face one of the giants. Don't expect to fight, as you'll simply have to solve puzzles to get the upper hand. Difficulty Some moments are really beautiful Silt flows beautifully, enthralling the player scenario after scenario, so much so that it goes almost on autopilot, in a state of ecstatic rapture caused by the pace of the game and its monochromatic graphic style that creates some truly sublime visual moments. Evidently, however, at a certain point the developers felt that the adventure lasted too little and therefore created passages of enormous difficulty, placed towards the end of the game, that is, when the player is most anxious to pull the strings. We're not talking about a gradual growth of the challenge that reaches its ideal peak, but a sudden surge that transforms a meditative journey into an at times frustrating experience. Where in the previous phases the gameplay required to discover the solution of the various puzzles and to apply it to move forward, we find ourselves in more action phases in which we must execute certain patterns perfectly if we want to survive. Having to understand what to do is marginalized by being able to do it. In some moments the surge in difficulty is really excessive Too bad that it is precisely the game dynamics, which until then had been almost physiological to the gameplay, with the slow and fluid movements of the main character that adapted endemically to the scenarios, to rebel against the new artificial difficulty, which requires perfect in the execution of every truly irritating action. A bit as if Inside at a certain point introduced platform phases to Super Meat Boy. There is nothing impossible, but the contrast is very noticeable and can be annoying, especially in terms of involvement, because it seems as if you have changed the game without realizing it.", "date": "2022-06-01", "grade": "7.8"}