{"name": "Echo Prime", "ref": "https://multiplayer.it/recensioni/128085-echo-prime-echi-lontani.html", "text": "In the current gaming landscape, there is no doubt that the mobile sector is the one characterized by the best growth performance, so high that an executive of the Digi-Capital investment bank, Tim Merel, hypothesized that the turnover combined with that of online gaming could reach sixty billion dollars by 2017. It is natural that in this thriving context, in constant evolution and driven by the capillary diffusion of devices, numerous software houses - independent and otherwise - are concentrating their economic and creative efforts to develop ad hoc. This is the case of the Texan Robot Entertainment, born from the ashes of the defunct Ensemble Studios and known to the general public for the highly appreciated series of Orcs Must Die! and Hero Academy, the latter particularly loved by smartphone and tablet users. The latest effort by the boys of Plano, an action with RPG elements inspired by the sci-fi tradition called Echo Prime, was received rather positively by critics and the public on iOS devices, thanks to the frenetic gameplay, the pleasant technical sector and the particular system of ~perks~. Here we are dealing with the PC edition of the aforementioned title, anticipating you from the premise that something, during the conversion process, certainly did not go the right way. Robot Entertainment tries it with an action with RPG elements and a sci-fi setting Muffled echoes In the imaginary universe of Echo Prime, the human race has spread abundantly among the galaxies in the strenuous search for resources and planets to conquer, coming into contact - as expected - with more or less hostile extraterrestrial life forms. Beyond the so-called ~Frontier~ are the worlds of the Sliver, the bad aliens of the moment characterized by incredibly advanced warfare technology and by the traditional and variegated xenomorphic appearance, from the insectoid to the inevitable cephalopod. As you may have guessed, the sci-fi clichs are widely respected and the work by Robot Entertainment certainly does not leverage the depth of the narrative plot, although there are some original elements in support of our intergalactic raids. The protagonist of the game, a so-called Enforcer engaged in military escort to space stations, trade routes and human colonies, during a routine mission is suddenly involved in an Einstein-Rosen bridge (commonly known as a ~wormhole~) and the fracture in space-time it joins him in symbiosis with an ethereal female figure called Echo Prime. The ~spiritual~ encounter with the damsel marks the incipit of the adventure that will transform the anonymous protagonist into the most classic of champions in defense of universal peace and the fight against the bad guys, in this case Sliver and the like, who have become unstoppable and much more aggressive after opening the wormhole. Despite the crucial role played in the plot, Echo Prime represents only the first of the Echo with which the Enforcer will enter mental contact; it is in fact a copious group of heroes from distant worlds who will spiritually join us in battle, infusing us with their own peculiar skills. From a purely playful point of view, the Echoes are nothing but perks like those seen in many other games; tools able to offer us a wide range of passive and active skills to be set before tackling each level. Although there are around seventy different Echoes to unlock as you progress through the long campaign and upgrade your equipment, there is no doubt that some of them are decidedly more useful than others - for example those that restore health over time or by hitting enemies - and the choice of player will inevitably always fall on a very small circle. In addition to the Echo owners, for a maximum of four upon reaching level 30 of experience, it is possible to equip an extra character ~remotely~ by selecting it from those of other players and friends, furthermore each Echo can be upgraded up to the level of veteran, equipping the protagonist of ever better and far more effective skills. This interesting system represents the distinctive brand and the fulcrum of the RPG soul of the Robot Entertainment title, however, however well implemented, it irreparably clashes with other aspects of the game that are decidedly less successful and inspired. Cephalopod hunting Echo Prime looks like the classic side-scrolling hack'n'slash action in which to overcome each level, divided into so-called ~chambers~, it is necessary to eliminate all the enemies on the screen. Sometimes it may happen that you have to destroy a certain objective, carry out a task within a defined time interval, defend a structurefrom the opposing waves or survive them, however since the first stages there is a basic repetitiveness accentuated by the practically non-existent level design, which pushes the player to go through identical corridors and constantly carry out, with inertia, the same actions from the beginning to the end of the game. Our hero, in addition to being able to take advantage of the active skills of the Echoes equipped with reloads such as special projectiles and the like, has a vast arsenal of swords and pistols at his disposal - to be purchased in the appropriate shop - which allows you to attack enemies both from a distance and with powerful melee attacks. An interesting approach undermined in the foundations by a decidedly awkward and unresponsive control system, a symptom of a hasty and coarse conversion of the original touch controls. If on the one hand, in fact, with the mouse and keyboard the feeling is acceptable albeit with some flaws, by adopting a joypad evident critical issues emerge in the precision, sensitivity and even in the hitbox of the targets, with enemies hit in full without accusing our shots. The case of ray guns is emblematic. If that weren't enough, it can also happen to remain inexplicably ~stuck~ between a handful of Sliver and more rarely at the edge of a level, in an anthology of bugs and glitches that sometimes also concern the same enemies and the game menus, with inaccessible items through the joypad and the like. Fortunately, the developers are at work and there are already several mini patches released on Steam for this purpose, in the hope that everything will be optimized as soon as possible. Deep space From a purely technical point of view, the PC version of Echo Prime offers very little compared to the product designed for iOS systems, presenting itself with a decidedly limited range of graphic options. In addition to the inevitable resolution, it is in fact possible to set only the bloom effect and dynamic shadows, which however do not significantly affect the visual impact of the game. The polygonal models are generally poor and uninspired from an artistic point of view, the animations are sometimes woody and the textures are completely devoid of filters in step with the times. The particle and volumetric effects are practically non-existent. We tested the game with two extremely different test configurations (a high-end system and a laptop with a dedicated GPU) obtaining 60 frames per second in any circumstance, however annoying micro-stuttering phenomena emerged especially with the less performant, as well as some flickering of the graphical interface. The soundtrack is repetitive and forgettable while the samples of the sound effects are not very incisive and of low quality, especially as regards the screams and verses of the enemies. The latter range from the aforementioned multiform Sliver aliens to fully armed space marines, passing through small probes and heavily armored robots, for a ~bestiary~ overall quite varied but not exactly original. The less successful technical aspect of Echo Prime is however represented by the level design, with dozens and dozens of photocopy stages characterized by completely identical corridors, where only the shades of colors or the arrangement of some architectural elements change. In certain situations it is possible to appreciate new panoramas and glimpses, which however after being ~presented~ are subsequently and constantly recycled.", "date": "2014-02-04", "grade": "5.0"}