{"name": "Sto par di Bhaal", "ref": "https://multiplayer.it/recensioni/127905-baldurs-gate-ii-enhanced-edition-sto-par-di-bhaal.html", "text": "If ten or so years ago someone had given the numerous Baldur's Gate fans the opportunity to play this masterpiece even on a portable device, liters of tears of joy would probably have been shed. A cry actually ~only~ postponed by just over a decade, given that thanks to Overhaul Games this dream has recently become a reality: in fact, the Enhanced Edition of the first chapter of the series dates back to 2012, revised and corrected for the occasion from the team that acquired the rights to the splendid creature from BioWare. If seeing the most famous role-playing game of all time return to PC was not a particular surprise, much more curiosity was aroused by the conversion of Baldur's Gate also for tablets, which brought the great classic to iPad and Android systems. The same operation was also carried out with the second episode, Baldur's Gate II, which arrived with its Enhanced Edition at the end of 2013 on PC, and then also landed on the iPad a few days ago. After having already had the opportunity to properly see and evaluate the fruit of Overhaul Games' work on the computer, we took the opportunity to unsheathe the sword in a new adventure on the Apple tablet as well, in order to see how it behaves on a very recent technology which is a title born way back in 2000. Baldur's what? If it is true that the years that have passed since the release of Baldur's Gate have now made it a video game classic, we are still talking about a real video game era ago. For the benefit of those who do not know what it is, we remind you that both chapters of the series are based on Dungeons & Dragons settings and rules, to follow the story of the protg of the wizard Gorion told by an impressive plot, which is still today able to clearly distance (there is no need) many productions of the same genre. Together with its expansion, Baldur's Gate II tells us the events that took place after the devastating battle experienced at the end of the first chapter, taking us inside a prison where a wicked wizard tortures the protagonist deprived of his memory. As far as the story is concerned, we will stop here: in case you want to deepen the discussion, we refer you to other sources (including our review of the PC version, linked above), preferring to dwell in this new article on what are the peculiarities of this game on iPads. Contents and price So let's start going into detail, taking a look at what Baldur's Gate II: Enhanced Edition in tablet version shows us. As in the PC version, also in this case we find the base game, Shadows of Amn, together with the Throne of Bhaal expansion, fully playable without the need for further outlays. Different speech instead for the characters introduced exclusively with the two new Enhanced Editions, therefore not included in the two original games: if on PC they are included in the 22.99 euros to be spent on the purchase of the game, they are not in the 13 .99 euros required by the iPad version. The only new character already available to us is Rasaad yn Bashir, a monk already known in the first chapter together with the wild sorceress Neera and the blackguard Dorn Il-Khan, while the thief Hexxat is the new entry of this episode. The purchase of these last three characters can be made in-app at a cost of 2.69 euros each, thus giving the player the option of choosing whether and who to buy: if on the one hand the new characters are the only real innovations in terms of content, also thanks to the specially created line of quests, it is however true that Baldur's Gate is such a big game that it does not need any additions compared to its original version, so feel free to make your choice lightly, and depending of your pockets. You must gather your party... but it was easy! The one faced by the developers to bring Baldur's Gate to tablets was certainly a difficult challenge, given that we are talking about a title released in an era in which this type of device was not even remotely among us yet. The interface developed by Overhaul Games on the iPad has many elements similar to the one seen on the PC, with the addition of a button to be pressed to select more than one character by dragging one's finger across the screen: a necessary act, given that there are no mouse buttons to hold down. The long press on the touch screen, on the other hand, is managed to view the details on a specific object: if, for example, you want to know more about a potion, you have to put your finger on it and hold it there for a while before pulling it away, to then watch the opening of information related to it. The problem is that sometimes the game doesn't interpret les properlyour intentions, in some cases associating unwanted actions such as in the case in which we end up using the aforementioned potion, instead of reading its details. Further additions to the interface see the possibility of highlighting the objects with which it is possible to interact, very useful given the screen size on the iPad, reduced compared to that of the PC. An automatic bar can also be used to manage loot, which appears at the end of the battle to allow us to take the objects left by the enemies: a quite welcome addition in this case too, given that clicking on each corpse on the iPad display it would have been rather boring, as well as difficult in some cases due to the aforementioned problems in the accuracy of the touch display, the real Achilles heel of the game. To try to stem this problem, the developers have equipped the Enhanced Edition on iPad with the ability to zoom in on the game scene, through the classic gesture also used in other applications to bring elements on the screen closer and further away. From a technical point of view, practically everything said in the PC review is also applicable to the iPad version, supported by Baldur's Gate II in all its models. Baldur's Gate II: Enhanced Edition has also arrived on the iPad, to the delight of all its die-hard fans!", "date": "2014-01-29", "grade": "7.0"}