{"name": "Chi non salta rosso !", "ref": "https://multiplayer.it/recensioni/127692-mega-jump-2-chi-non-salta-rosso-e.html", "text": "Forty million players make up practically an entire nation, yet these are the amazing results recently achieved by the original Mega Jump. Released in December 2010 on the App Store and Google Play, the title developed by Get Set Games quickly established itself as the reference jumping game for mobile devices, thanks not only to characteristics such as the immediacy and simplicity of the gameplay, but also in the presence of a structure that offered something more than the traditional survival setting, allowing players to reach new scenarios as they continued to progress upwards. A little over three years later, therefore, here is the sequel, Mega Jump 2, which takes up the freemium formula and the same concept, however trying to mix the cards a bit and give us a renewed experience. Goal achieved? Honestly, no. Certainly the first thing you notice is a substantial increase in difficulty: in the original chapter it was possible to complete the first stage even without touching the terminal, thanks to a favorable arrangement of the coins and objects on which the character could bounce, while in this case the simple goal of moving from one scenario to another requires a great deal of effort and you will probably have to wait to get it, metabolizing some unpublished and quite cumbersome mechanics. After more than three years since the first episode, we expected much more news from Mega Jump 2 Jump that shakes you Introducing the series to those who don't know it is very simple: in the role of a funny little red monster named Redford, we are asked to bounce upwards with the aim of covering the greatest possible distance, jumping on a large number of items and often taking advantage of upgrades that provide an additional boost. All this is done by controlling the vertical movement of the character via the accelerometer, thus tilting the device to the right or left to direct its trajectory, with the possibility of popping out from one side of the screen to the other if necessary. At the time of Mega Jump this type of mechanic was not new at all, but they tried to refresh it by inserting the aforementioned progression system in the stages, each characterized by a different degree of challenge. The same solution that we find in Mega Jump 2, but as mentioned net of a much higher difficulty, which at first constitutes a significant obstacle to fun, given that endless productions always need an ~introductory phase~ because the their experience is not too difficult, especially for casual users. It is not uncommon to find obstacles on your way from the early stages of the game, marked by some ~exclamation points~ but far from easy to avoid, and whose contact results in an inevitable game over. In short, elements such as coins that ~escape~, fragile platforms and so on, which in the original episode only appeared after a while, have become very frequent right away and we believe it extremely probable that the developers will be forced to modify them the incidence with one of the next updates. The focus was also on the introduction of alternative characters to Redford, each with a special ability that makes the climb easier, but to unlock them it is necessary to collect a huge number of coins or put a hand in the wallet, which makes them almost superfluous the implementation. Even the graphics have lost their edge with the transition to Retina resolution, remaining fluid and colorful but neglecting the animations (unchanged), while the music is often not very appropriate compared to the context.", "date": "2014-01-22", "grade": "6.2"}