{"name": "Strategia teutonica", "ref": "https://multiplayer.it/recensioni/127646-blackguards-strategia-teutonica.html", "text": "With a curriculum that is not exactly long but full of quality, it is not easy to sit down and explain the very special soul of Blackguards, Daedalic's latest creature. The German boys' strategic role-playing game could have been much more; it had to, in reality, given the strong campaign of visibility and creation of expectations, which even went so far as to use the enthusiastic comments of some phantom user to create a video to be fed to the press. Building on its past success, the Hamburg development house has grown dramatically over the years, now counting more than one hundred and twenty employees; precisely for this reason it remains complex to attribute a number to the group of elements involved in the development of Blackguards, as this first step into the world of strategy shows a system worthy of a small, or at least inexperienced, team. A mixture of battles with hexagons and point and click adventure tries to merge two worlds in which strategy, statistics, narrative and study of details come together. However full of problems, Daedalic's attempt is undoubtedly ambitious and is based on two cardinal principles that keep it afloat. Blackguards is certainly not Daedalic's best entry into the world of strategy Growing up in battle The main element on which the peculiarity of the Blackguards gameplay is based revolves around the desire to attribute a different and unique map to each encounter: the environments that, for reasons of sub-plots, you will be forced to see more than once are counted on palm of a hand. This apparently simple aspect actually becomes important when analyzing the strategic/environmental approach chosen by Daedalic: each map shines with its own life, with elements of the environment inserted to be functional - often fundamental - only in the clash in question. Chandeliers, barrels, traps, cages and many other elements of the scenario are included in a scale of use that goes from forced to recommended, providing a host of varied types of approach and capable of guaranteeing sufficient interest along the continuation of the adventure. Another interesting aspect is the depth of growth of the characters; the editor and the choice of the class with which to start the adventure are just pieces of a much larger and more ramified growth picture. The choice to give each battle new combinations of enemies and obstacles forces the player to study the right advancement for the supporting team, which must be perfectly balanced so as not to run into a merciless and demotivating cycle of defeats. In reality, the massive inclusion of features to be carried forward will only make fans of cryptic titles happy, in which the cause-and-effect links of skills, spells and equipment are not clear and make the learning curve a much too broad parable to novices of the genre. But there are other real sore points. Witch's Stroke? If the two fixed points of Blackguards just described open at least to a glimmer of curiosity and admiration for the effort put into characterizing the adventure, unfortunately it is inexperience that plays a bad joke on the development team. The courageous choice of having prepared the environmental aspects of each clash at the table is not balanced by a coherent and functional presentation of the map and level design. The moments in which discovering the keystone of a clash will not be rare will be the result of a culmination of frustration, caused by a too cheesy ~trial and error~, decidedly not in line with the prestigious curriculum of Daedalic. Leaving aside an interface and a badly calibrated camera, in the strategy of the Germans there is too much randomness, too many consequences left to chance that don't make it pleasant to experiment with new solutions as the success or failure of the game actions is sometimes not as faithful as it should. The choice not to insert in any way the possibility of speeding up the flow of gameplay leads to clashes that are in many cases too slow, heavy and difficult to digest, especially with a view to repeating the same over and over again until the map is interpreted in the that the team deemed optimal. First of all, the desire to enter a world, that of the strategic, alien to the development house weighs, but if you wanted to turn a blind eye to the soul of gameplay certainly deficient but capable of providing a certain satisfaction in the most complex clashes, certainly the second cannot be barred in the face of a plot that is decidedly below expectations. From an expert team of graphic adventures we would have expected particular characters, sophisticated plots, interesting supporting characters, a journey worthy of being lived, in short. The Blackguard storys, unfortunately, rewards very little in relation to the time invested in the adventure, which, adding the secondary quests, necessary to accumulate experience, even exceeds forty hours. Paradoxically, some background plots characterized exclusively by dialogues are more interesting than the main one, poor in charismatic protagonists, narrated with a mediocre and sometimes grotesque direction in its evolution. Technical stasis The poor narration does not correctly convey events and characters, resulting in a series of theoretical twists and turns which, due to a very questionable narrative choice and a lack of psychological insight from the protagonists, do nothing but fuel questions as to why the reactions without pathos of the characters, faced with some specific events, are sometimes so absurd as to seem unreal. Perhaps we are demanding too much, but Daedalic definitely knows how to do much more than what is revealed in Blackguards. The intercity progression system blends point-and-click structure in a curious way but, again, too ambitious to be really deep. Excluding the individual quests, the offer of the cities does not differ from the quadrinomial inn/merchant/blacksmith/healer, alternating their presence throughout the game environments. It will not be uncommon to find yourself visiting cities just to look for the correct dialogue that triggers the progress of the quests: the only element that, apart from aesthetics, differentiates one place from another. Technically speaking, the title already seems to have a generation behind it: the models and textures of characters, environments and cities are deeply dated, unable to offer a glance or give dignity to an artistic sector if nothing else sufficient. The game engine suffers in complex conditions, and this is surprising precisely when analyzing the low polygonal mass of the screen proposal. Of the audio tracks present, only a couple deserve praise in the face of a sector which, thanks to an under-sufficiency dubbing, does not offer particular acoustic emotions and performs a mere accompanying task.", "date": "2014-01-21", "grade": "6.0"}