{"name": "Aveline unchained", "ref": "https://multiplayer.it/recensioni/127609-assassins-creed-liberation-hd-aveline-unchained.html", "text": "Aveline de Grandpr is a great character and hers is an undoubtedly fascinating story. Daughter of a French merchant and an African woman, she lived a troubled childhood and was saved by an Assassin who took her under his guidance and taught her the dictates of the Creed, making her a cunning and lethal warrior , capable of exploiting not only their physical abilities but also an incredible beauty and the ability to blend into certain environments thanks to the color of the skin and a simple disguise. Impossible to ~sacrifice~ a figure of such thickness on the altar of an exclusive yes successful, but limited to a platform, PlayStation Vita, which is still struggling to mesh. So here is that Ubisoft has decided to recover Assassin's Creed Liberation, redo its makeup and re-propose it as Assassin's Creed Liberation HD, or a remastered high definition version of the portable game, released a few days ago on PlayStation Network, Xbox LIVE and Steam. We will deal with this latest edition in the article, highlighting the differences compared to what we saw on Xbox 360 and PlayStation 3. For an overview of the product, therefore, go read the review written by our Giorgio Melani and then come right back here. We also played the PC version of the remastered edition of Assassin's Creed Liberation Shine bright like a diamond Let's start with some loose concepts. As already mentioned, Rihann um, Aveline is a killer, not the first one seen in the Ubisoft franchise but certainly the first one to play the lead role in an episode of the series, although it is actually a spin -off. The experiment made with Assassin's Creed III Liberation was not actually the only one to translate the traditional mechanics of the game produced by the French company into a portable context, given that in 2009 a small miracle was performed with that Assassin's Creed: Bloodlines which chronicled Altair's life after the events of the original chapter and was deemed so important from a narrative point of view that Oliver Bowden wanted to include the plot in the novel ~Assassin's Creed: The Secret Crusade~. Strengthened by the technical capabilities of PlayStation Vita, with Liberation the Ubisoft developers were however able to push much more on the technical side (although it turned out to be, at least initially, a double-edged sword, considering the significant frame rate problems) , use the same graphics engine of the ~major~ version and try to introduce into the mix all the elements that have made the fortune of Assassin's Creed III, an episode to which Liberation is closely linked, at least in terms of gameplay and structure. Not all donuts come with a hole, and so on PlayStation Vita the game turned out to be lacking in terms of characterization, a problem that we tried to remedy in the HD edition thanks to the inclusion of some extra missions that go right to work on Aveline's background, without distorting the work done previously. The experience therefore remains a sort of ~compact~ interpretation of a standard chapter of the series, with more collected scenarios and shorter missions, even if not despicable for this, on the contrary. The ~historical~ problems of the franchise are not limited in any way, in this case a combat system that does not enhance the numerous different weapons in any way and always proves to be too easy, with the opponents who in practice wait their turn to attack , but it would have been absurd to ask Liberation to do something about it, both on PlayStation Vita and in this remastered edition. However, there are some interesting innovations, such as the fact that the plot is unrelated to the story of Desmond Miles and presented as a sort of entertainment product created by Abstergo Industries (just like in Assassin's Creed IV: Black Flag), but above all the possibility in the game to assume three different aspects (assassin, noblewoman and slave) which perhaps imply limitations but allow you to wander around within certain areas without problems. It is a pity that this element is often and willingly placed as an obligatory path, in the sense that in most cases it is not possible to opt for one strategy rather than another, but one is forced to assume the expected aspect for that particular mission. The PC version We have seen a lot of ~HD remastered editions~, and one of the most recurring problems concerns the polygonal count, which inevitably remains the same as the original version and can catch the eye where the technological gap between platforms is substantial.In the case of Assassin's Creed Liberation HD we fortunately started from a product not only graphically advanced (PlayStation Vita is still a respectable portable console) but moved by an engine that allows you to replace assets in a rather simple way depending on the system . The game still costs 19.99 euros and it is therefore clear that the implementation of advanced features for the Windows environment could not be expected, however what we saw did not disappoint us at all. Firstly, the relative simplicity of the polygonal models (at least when compared with those of Assasssin's Creed IV: Black Flag) is not as evident as one might have thought at first, the edges are in fact very few and the revision of shaders and textures, as well as an enhanced lighting system, they do their duty and give the title an unprecedented, very pleasant cosmetics, comparable in many ways to that of ACIII. There are undoubtedly some textures that hold close-ups better than others, and in particular during the dialogues it happens that a close-up shot shows a less defined texture than usual, but exploring the cities it is rare to come across an ugliness, even if in this juncture the reduced polygonal count we were talking about earlier manifests itself in the simplicity of the buildings and in a reduced depth of field, evident when the traditional ~synchronisations~ are carried out from the top of some bell tower. The PC version natively supports the Xbox 360 controller, although it is also possible to play with mouse and keyboard (a combination that we practically never recommend for third-person action games), while the graphics options allow you to adjust the resolution, the quality of the environments , textures, anti-aliasing, and shadows, as well as turn v-sync on or off. During our tests we detected a couple of curious behaviors: first of all, vertical synchrony, applied in-game or from the video card settings, translates into a lock at 30 frames per second, solid but still very little for those who have invested money for a performance CPU and GPU. Disabling the vsync inevitably rises, reaching 40-45 fps and enduring a bit of tearing in the cutscenes (fortunately in real time and not simple movies), but the thing is still strange due to the not incredible graphic complexity. We unraveled the mystery by completely disabling in-game antialiasing and activating FXAA from the video card settings, which produced a significant performance boost and guaranteed very stable 55-60 frames per second, even in the most complex situations. Considering the resolution of 1920 x 1080 (and beyond) and 60 fps we can therefore speak once again of a ~superior version~ on PC and of a globally well-done remastering work, even if there is no shortage of shadows.", "date": "2014-01-20", "grade": "7.0"}