{"name": "War Thunder", "ref": "https://multiplayer.it/recensioni/126920-war-thunder-lampi-e-tuoni-di-furore.html", "text": "After the experience of Birds of Steel and IL-2 Sturmovik: Wings of Prey, Gaijin Entertainment has seen fit to use its knowledge in the ~aircraft~ field, as well as an always fascinating scenario such as that of the Second World War, to create a free particularly deep and interesting to-play: War Thunder. Available on PC for a year now, albeit in the open beta format, the game takes advantage of Sony's openness towards this kind of productions to also land on PlayStation 4 and therefore offer owners of the new console another reason to browse with interest free titles downloadable from the Store. The enthusiasm that has been created over the weeks around this simulator is tangible, thanks to a cross-platform setting that in fact never misses opportunities for confrontation and a structure that draws heavily on both the multiplayer facets of the action , with exciting sixteen-on-sixteen matches that alternate with cooperative missions, both with single player ones, thanks to a very dense and challenging campaign. The entire architecture lays its foundations on a continuous growth system, which is sometimes managed automatically and which allows, through investments in research and development, not only to improve the aircraft that are part of our fleet, but also to unlock new and more powerful ones, in a crescendo that after a few games appears particularly tasty and rewarding. Where do I have to go to go where do I have to go? Let's take the pebble off our shoe right away: there's one aspect of the War Thunder experience that we really didn't like, and we're talking about the interface. It was evidently designed for the PC version and the developers did not consider it necessary to modify it with the arrival on PlayStation 4, however making a gross mistake, given that navigation through the menus is the least intuitive and practical we have seen on the Sony console , with the ability to move a pointer (yes, the mouse pointer!) using the touch pad integrated in the DualShock 4 which however does not solve the critical issues of this solution in any way. The point is that the cumbersomeness of the interface inevitably steepens a learning curve that is already anything but benevolent towards the more casual user, and this translates into a ~wall~ against which during the first few games and which can only be tolerated with a lot of patience, a virtue which, however, not only is lacking in many people, but which a video game should not require as a fundamental requirement for its use. In fact, it should actually be quite the opposite. Closed this necessary parenthesis, it cannot be said that War Thunder lacks numbers: there are currently over two hundred aircraft available, for a total of five factions (Germany, Russia, USA, United Kingdom and Japan), and new ones will be added in the future, with a view to an offer that will also range towards tanks and will therefore offer many different situations, to the full advantage of variety. Furthermore, as mentioned above, there are really many missions available, whether they are competitive ones or those to be played alone with the support of artificial intelligence. Of course, in some cases the structure remains basic, for example asking us to go from point A to point B and possibly deal with enemy threats, but there are certainly many intense and engaging moments. War Thunder is a title of great interest for those who love aerial simulations, full-bodied and free For all tastes, or almost In short, the setting of the missions moves between ups and downs, fortunately with a prevalence of the former, but in general the air you breathe is exactly what you would expect from a simulation product. So get ready to have to travel many kilometers without encountering even an enemy and then, suddenly, find yourself faced with an apocalyptic scenario, made up of frenetic dogfights while artillery from the ground tries to continuously target you. The gameplay proves to be up to the task, also thanks to three different styles: the first, with an arcade vocation, sees our aircraft responding promptly to inputs and limiting nervousness as much as possible; the second is a middle ground that can be widely used for those who want good realism without getting stuck in mechanisms that are too rigid, with the aircraft that must be controlled gradually, paying attention to sudden manoeuvres; finally there is the completely simulative option, strictly with the first person view from the cockpit and all that follows, therefore many variables to take into account during the execution of each single maneuver. The higher the simulation degree, tthe greater the satisfaction of eliminating the adversaries, using the planes of one's fleet as ~lives~ to be consumed during a mission. The controls use the analog sticks for yaw and speed and rotation management, while the lats are used to zoom in on any target and open fire with the equipped weapons, starting from a simple machine gun to then unlock missiles ( obviously not research) and bombs. The controller lends itself very well to War Thunder's precise and delicate approach, and from this point of view one can't really complain about how Gaijin Entertainment has worked on the conversion. Who pays wins? As is known, the free to play format very often lends itself to an interpretation that tends to reward users who spend real money, creating rather unbalanced comparison situations between those who pay and those who enjoy the experience for free. This aspect appears relatively limited in War Thunder, in the sense that some planes and upgrades are objectively unattainable for those who don't want to dig into their wallets, but despite this, you can do well without it, moving within a fleet that still counts on lots of aircraft. Indeed, to put it all, the ways in which the game releases credits are fairly generous at first, so after a few games it is already possible to expand your stable, add new models and start the search for the creation of the related upgrades. And if the game convinces, premium packages are available on the PlayStation Store that make an even more dense and in-depth experience of this simulator possible, which represents yet another example of a positive ~open construction site~, with great potential for development. This structure is assisted by a technical sector up to expectations, very close to that seen on PC, with a 1080p resolution that enhances the detail of the landscapes and a frame rate that never shows the side of obvious drops, while the sound it plays only a functional role with respect to the action.", "date": "2014-01-03", "grade": "8.0"}