{"name": "We Were Here Forever", "ref": "https://multiplayer.it/recensioni/we-were-here-forever-recensione.html", "text": "Total Mayhem Games, after three chapters, returns to the field with a new cooperative game in the We Were Here series. Available on PC, PlayStation and Xbox, We Were Here Forever puts us in the shoes of an explorer, trapped inside a cursed castle. Our job is to escape, of course, but we won't be able to do it alone. We Were Here Forever is an adventure to be completed with the help of a second player and cannot be tackled alone, similar to more famous titles such as It Takes Two and A Way Out. The only difference, in this case , is that both players have to buy the game. What matters, however, is the final quality of the product. To find out if this is the right video game for you, continue reading our review of We Were Here Forever. A castle and a jester Castle Rock, setting of We Were Here Forever We Were Here Forever takes us to a fallen kingdom, immersed in the snow, and more precisely to a cursed castle, Castle Rock, in which a mad jester will try to trap us forever. Despite being part of a saga, it is possible to play this new adventure even without knowing the history of the previous titles. Of course, certain references will not be noticed, but the plot of this saga is always an additional element, rather than the fulcrum of the story. While enjoyable, the narrative serves to justify our presence in Castle Rock and give us a reason to continue. The journey flows into the fairy tale, with kings, queens and events of a magical nature that guide the narrative thread. The beauty of We Were Here Forever is to be found in the atmosphere, rather than in the detail, especially with regard to the setting. From stage to stage, caves, parts of the castle and more are explored, in a small, well-crafted magical world. On a technical level we are certainly not talking about an impact game, but we are sure that the target audience of We Were Here Forever is not looking for this. Puzzles for two We will often be divided into We Were Here Forever As said, the texture is just a support. The core of the experience is pure two-player co-op gameplay. Even more precisely, the game is completely based on puzzles. Each section will see the two players mostly separated, in different parts of the level. Often, among other things, it will not be possible to see what the other can do, either totally or at least in part. To overcome this problem, one must communicate verbally. Voice chat is central, as you have to constantly ask and answer. We need to understand what the other sees, what clues they have and how they can help us solve the overall puzzle. Our actions must interlock each other, as it is impossible to advance by one's own efforts alone. Technically it's not incredible, but the atmosphere of We Were Forever is great The difficulty is never too high and there is always a clear logic behind it, but on average you should expect a difficult game. The puzzles are sometimes even quite large and require many steps: it is impossible to solve them by pure chance or by trial and error. It is therefore important that both players are good enough to understand what to do and what is important to communicate. In other words, don't mistake We Were Here Forever for a game to play with a child. Also, the game doesn't discount even with its own clue system. In each area it is possible to activate suggestions, but these are useless suggestions. We Were Here Forever is a game designed for puzzle game enthusiasts and offering them the clue ~take a good look around~ seems more like a joke than anything else. Simply put, this feature is as if it doesn't exist. Darkness will often be our companion in We Were Here Forever We specify that there is matchmaking to play online with a stranger, but it is not the best solution. Beyond the potential problem of the language barrier, it is necessary that the two people know each other and know how to be patient, since in certain situations one of the two parties may have to spend some time trying to figure out what to do . Furthermore, one's advancement depends on the actions of the other, so if one were to find a person who enjoys putting a spanner in the works it would only be frustrating. Finally, in terms of longevity expect a minimum of ten hours, if you are very good and fast. Obviously everything depends on the level of your skills, so the counter will probably show a higher game time at the end of your adventure.", "date": "2022-05-29", "grade": "8.0"}