{"name": "Prima ti pago", "ref": "https://multiplayer.it/recensioni/126961-fightback-prima-ti-pago-poi-ti-meno.html", "text": "Of all gaming genres, scrolling beat'em ups have certainly struggled more than others to adapt to the new standards imposed by post-generation 16-bit consoles. If we exclude very few worthy exceptions, in fact, it is a category now almost completely abandoned by developers, even in a panorama such as the mobile one which has contributed to bringing back types of games that have ended up being forgotten. Of a different opinion is clearly Ninja Theory, which for its first product for iOS has decided to try its hand in this area: let's see how it went. Aridatece 'er stinker By launching the Fightback application, one immediately gets the impression of having been catapulted into the 90s, finding oneself faced with a title that is very little lost in talk: a handful of text screenshots inform us that the protagonist's sister has been kidnapped by a dirty and bad criminal, and it will therefore be up to the user to help the wiry hero make his way through hordes of henchmen with kicks and punches until he reaches the final boss. To reinforce the idea of a leap into the past two decades ago, a deliberately crude menu and interface design contributes: an evident attempt to replicate the humorous slant of a product like Far Cry: Blood Dragon, which took possession of an aesthetic B-action films for the sole purpose of making fun of the source material. However, the final result is quite different, given that the irony of Fightback fails to affect in the slightest, completely failing to support a title that only turns out to be ugly to see in the screens that accompany the action. The latter is developed following the classic canons of scrolling fighting games, even if declined to the particular needs of the mobile market: the internships are therefore very numerous (each level corresponds to a floor of a building to be cleaned of the enemy scum) but equally short, in order to facilitate a hit and run fruition. At the same time, the control system has been simplified to the maximum by removing the possibility of commanding the movements of the protagonist, who stands still in the center of the screen waiting for the opponents to approach to fill them with barrels: a tap is equivalent to a punch and a horizontal or oblique swipe to a kick, while executing the same movement upwards or downwards produces a jump and a dodge respectively. The union of these elements and the presence of sidearms and firearms allows the composition of satisfactory combos, even if there are structural problems: the software is not very precise in detecting inputs and the opponents' reluctance to get close can be really nerve-wracking, considering the tight time limit allowed for each stage. Fightback is the perfect example of how to ruin a game by being stubborn about in-app purchases Too bad that the prospects of being able to enjoy an honest old school beat'em up on iOS are literally mowed down by the almost criminal use that Fightback makes of the free to play formula. All the most unpleasant expedients that have contributed to making this model indigestible to a large part of the gaming public are in fact present here to the nth degree, assisted by the by now well-known dual currency system, with the dollars that are obtained by playing and the ingots of gold that are given very sparingly unless you decide to buy them. There is the stamina indicator which decreases at each level and which must be recharged with gold or by leaving the application for some time; there is a fee to be paid to return to the game in the event of a game over; there are upgrades and new equipment for the protagonist offered for sale at simply exorbitant prices; finally, there is a screen at the beginning of each stage that invites you to buy very expensive special skills and ammunition for your firearm. As if all this were not enough, Fightback does not spare itself in a whole series of annoying promotional announcements, whether these are related to the official Facebook page of the title, to other applications in the Chillingo catalog or simply to offers related to game content. The sum of all these elements leads not only to bitterness when navigating the menus, but also and above all to reducing the real gaming experience to a minimum wage before colliding with authentic barriers to in-app purchases. In fact, it is not an exaggeration to say that just half an hour of play is enough to get to a point where it becomes almost impossible to continue without spending real money: as a further joke, the title contemplates the possibility of trying your hand at internships reserved for the practice of grinding which, however, bestow refees so disproportionate downwards as to border on the ridiculous.", "date": "2013-12-27", "grade": "5.0"}