{"name": "Run & gun", "ref": "https://multiplayer.it/recensioni/126840-ratchet-clank-before-the-nexus-run-gun.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. The experiment is not new, see Knack's Quest last month, and it could be proposed again often and willingly in support of the new titles for PlayStation 3 and PlayStation 4. We are talking about the concept of ~companion app~, a mobile application that interfaces in various ways with the game on which it is based and allows those who own it to have fun in an alternative way, while earning extra items which can then be synchronized. In the case of Knack it was a match-3 style puzzle game, far from evil but decidedly short and easy, while for Ratchet & Clank: Nexus Sony has decided to explore a difficult and particularly inflated vein such as that of endless runs , releasing this Ratchet & Clank: Before the Nexus on the App Store and Google Play. The references to the PlayStation 3 game are numerous, from the setting to the characters, but the mechanics are different: yes, we will have to take on the role of Ratchet, but instead of trying our hand at a third-person action game, our goal will be to walk tracks, wide futuristic territories and scenarios trying to get as far as possible and defending ourselves from the attack of various types of enemies. Ratchet & Clank: Before the Nexus tries to act as a different endless run than usual, but fails He runs, jumps, flies, what a horse he has In the mobile sector, we have now seen everything that running games have to offer, including titles in which, in addition to running, you also have to shoot. This type of solution was adopted by Imangi Studios for Temple Run: Rebel, the spin-off based on the Pixar animated film, however it did not constitute a pillar of the gameplay and indeed represented a simple parenthesis, due to the need to insert references to the feature film which, in that specific case, saw the protagonist expert in archery. Shooting was much more frequent in Run'n'Gun, to name one, but in Ratchet & Clank: Before the Nexus this interpretation unfortunately collided with a series of not insignificant problems. In the first place, the developers have decided to opt for a view in landscape mode, with the device horizontally, which is really curious for an endless run in which you have to avoid obstacles and therefore be able to see as far as possible to prepare the own maneuvers. Secondly, the touch control system often mixes up the change of ~rail~, jump and willingness to open fire at a target. This means that during the most agitated phases, for example when a boss appears on the screen, it becomes really difficult to coordinate actions and avoid moving by mistake to where the opponent's attack is directed. Add to this enormous confusion the ~sudden death~ typical of this kind of product and the mess is served. The interesting weapons that can be upgraded are of little use if the application does not correctly implement the inputs, asking us for a precision that is impossible to provide in such a situation. That's not all: the aiming system implemented in Ratchet & Clank: Before the Nexus works with the touch of the target we want to hit. It goes without saying that in the presence of multiple opponents we will be forced to occupy the upper part of the display with our fingers, which will cover our view of any obstacles or enemy fire itself. In short, a half-disaster that we do not doubt will be fixed with some updates but which, right now, seriously undermines the enjoyment of a title that can be used for free, which could have had its say in terms of technical realization and structure despite the fierce competition.", "date": "2013-12-21", "grade": "5.0"}