{"name": "Santo protettore del free roaming", "ref": "https://multiplayer.it/recensioni/126674-grand-theft-auto-san-andreas-santo-protettore-del-free-roaming.html", "text": "It is said that celebrating a birthday early brings bad luck, but evidently Rockstar are not superstitious: unlike what happened with the two previous portings of Grand Theft Auto III and the subsequent Vice City, released perfectly in time to celebrate the tenth anniversary of the original release of both titles, this Grand Theft Auto: San Andreas indeed arrives much earlier , considering how the debut on PlayStation 2 dates back to distant October 2004. A choice that in any case will certainly not displease the users, who have always been closely linked to the criminal epic of Carl Johnson, which for many represents one of the highest points ever reached by the franchise. So let's see if the title has stood up well to the attacks of time and above all to the transition from console to tablet and smartphone. Free smartphone in free state It can be said that Grand Theft Auto: San Andreas marked an ambitious turning point for the Rockstar series, putting on the plate a playful offer that at the time had absolutely no equal: starting with the mere extension of the scenario (an entire state instead of a single city) to then continue with the vast series of secondary activities and with a character growth system with almost RPG contours, with CJ increasing his characteristics the more he dedicated himself to the activities related to them. A lot of stuff for the PlayStation 2 hardware, which in fact managed with difficulty to support the weight of all these contents, lending itself to critical issues such as rather long uploads, a more limited visual horizon than usual and a limping frame rate. In this sense, the present mobile edition looks more like the PC version which came out in 2005 and which made it possible to overcome all the limitations just described. Here, therefore, that on the iPad Air we used for the test, Grand Theft Auto: San Andreas is presented in dazzling form, while obviously bringing with it some legacies of a game that still has almost ten years on its shoulders. To begin with, loading times have been reduced to zero: you wait a few seconds just to launch the game for the first time, after which you can freely roam between the internal and external spaces built by Rockstar without the experience being interrupted by transition screens. Even if the polygonal complexity is not exorbitant, then, observing the state of San Andreas that extends for kilometers on the screen of your smartphone or tablet without the game being affected in the least in terms of fluidity is a truly satisfying spectacle, which underlines the Once again the remarkable technical goals now achieved by the most modern mobile devices. Then some visual details specially improved for this version catch the eye: beyond the high definition, you can see slightly more refined polygonal models of characters and vehicles, dynamic shadows and a general cleaning of textures and colors. Grand Theft Auto: San Andreas is a convincing re-edition of one of the best episodes of the series See and touch Also in terms of usability, Rockstar has certainly capitalized on the lessons learned with the two previous portings, first of all proposing the convenient cloud save slots intended for those wishing to share the game on two different terminals. The commitment to improve the enjoyment of the playful experience as much as possible is also evident by analyzing the control system, equipped with a couple of interesting refinements. It is permitted to change the nature and position of the various virtual keys on the basis of one's personal tastes, with particular regard to driving vehicles: in this context, one can choose between three distinct types of commands (analogue, digital or touch), and for fans of the accelerometer can use it as an alternative for steering management. Anyone who then deems the concentration of buttons on the screen exaggerated can activate a mode that allows only the indispensable ones to be visible, with the others that are activated dynamically depending on the situation. Considering the difficulties often encountered by similar titles in the mobile environment, one can only commend the solutions adopted by Rockstar: with the exception of free aim (objectively rather cumbersome and imprecise), everything works well and playing Grand Theft Auto: San Andreas is undoubtedly easy enough. Those wishing to enjoy an experience on par with that offered by consoles and PCs will be happy to know that the title also provides support for external controllers. However you play it, Grand Theft Auto: San Andreas remains free roaming with a quantity and quality of content currently unmatched in the mobile.", "date": "2013-12-18", "grade": "9.0"}