{"name": "Macabro ma con stile", "ref": "https://multiplayer.it/recensioni/126536-escape-plan-macabro-ma-con-stile.html", "text": "The idea of fleshing out the initial PlayStation 4 line-up with a good dose of ports isn't as bad as it might seem, especially as it gives greater visibility to those low-budget games that have unfairly remained off the radar of mainstream gamers. This is the case of Escape Plan, for example, a very interesting title signed by Fun Bits Entertainment which caused a bit of a stir both at the presentation of PlayStation Vita and at the launch, only to end up practically forgotten also due to the low diffusion of the Sony handheld. In short, the PlayStation 4 version is just right, but it is clear that something must have changed in the transition from one console to another, missing a real touch screen and the other features of PlayStation Vita. Is there anything to worry about? The PlayStation 4 version of Escape Plan has lost touch controls... but that's far from a drama! Runaway men If you want to know in detail all the salient features of Escape Plan, we strongly suggest you read our previous and exhaustive review. At this juncture we will summarize the concept behind the Fun Bits Entertainment game and then focus on its PlayStation 4 version. Is everything clear? Perfect! Escape Plan is a sort of puzzle game featuring two masked men: one is called Laarg and is nothing short of obese, the other is called Lil and, conversely, is decidedly skinny. The two are prisoners of a shady figure named Bakuki who must have seen the films of the cruel Jigsaw a little too many times, since he has filled the building with lethal traps that can slaughter our duo of unfortunate protagonists in the most grotesque ways possible . And they certainly will, because death, in a certain sense, is part of the gameplay of Escape Plan, so much so that each death is counted on the costume of the two characters as a reminder. To discover most of the traps you will first need to trigger them: a very ordinary-looking room could hide a deadly pitfall that you will only discover by trying it firsthand. Don't worry, however: you can immediately repeat the ~level~ and perhaps get around it using the peculiar abilities of the two protagonists. Laarg is very slow, of course, but he has superhuman strength that allows him to break through walls and floors. Lil, on the other hand, is much more agile and fast and can slide through the tightest passages. To help them survive we'll also have to interact with the environment, arranging mattresses to cushion their falls or moving platforms and activating various devices. Our ~performance~ will be evaluated at the end of each stage from one to three stars based on the speed of completion and the number of deaths achieved, thus prompting us to try and try again each level to score the best score. Playstation 4 trophies Thirteen Trophies: nine bronze, three silver and one gold. They will be unlocked by completing the various levels, satisfying some specific requests of the game, including some that are quite bizarre and sadistic and other more common ones related to scoring and collecting collectibles. Touch trick In short, despite its short duration of a handful of hours, Escape Plan offers a fair replayability, as long as you come to terms with some of the more complex and diabolical puzzles that can cause a lot of frustration. On PlayStation Vita this problem was exacerbated by a touch control system that was not exactly precise and intuitive: how will the situation be on PlayStation 4? The fact that Escape Plan was so based on controls via touch screen and rear touch pad certainly did not play in favor of this conversion, which we therefore approached rather skeptically, convinced that we were dealing with an unsatisfactory port. The truth is that the PlayStation 4 version of Escape Plan is controlled even better than the PlayStation Vita version, despite the passage having forced the guys at Fun Bits Entertainment to take a step back and give up the originality of touch controls in favor of an alternative more banal but perhaps also more precise. The touch pad of the DualShock 4 is therefore exploited in an absolutely marginal way, while some mechanics are now managed through the motion control system of the joypad, of which the integrated speaker has also been used: a really tiny but pleasant addition. Most of the controls that on PlayStation Vita were relegated to the touch screen and touch pad have been translated into a cursor that appears on the screen and which must be controlled with the analog stick in combination with pressing the X button and the right backbone. It may seem like a cumbersome choice, however forallows you to face some of the more complex puzzles more serenely than on handhelds were complicated by the inaccurate control system. This conversion is framed by the possibility of enjoying the peculiar artistic choices of Fun Bits Entertainment on the TV screen, which through a simple grayscale has managed to create a truly unique title of its kind: Escape Plan is entirely in black and white and the character design between the funny and the grotesque makes it look like a Tim Burton film. The soundtrack that accompanies the action is almost entirely composed of well-known classical music pieces which help make each level even more surreal, especially when each death or situation is accompanied by the bizarre verses of the two protagonists and by the boos, laughter and audience applause mimicking American sitcoms.", "date": "2013-12-13", "grade": "8.0"}