{"name": "SSX on Tour", "ref": "https://multiplayer.it/recensioni/ssx-on-tour-3.html", "text": "Surfin' EA The history of Ssx has its roots in the year 2000, the year of its first appearance on consoles, since then it has been followed by a not so exciting tricky ssx and an excellent ssx3. The common thread of all three chapters up to now has been the strong arcade component, and if it is true that the team that wins does not change, then this ssx on tour is also part of the same family. The game in its new portable guise will not go down in history for sensational graphic downgrades (the psp version still has fewer graphic effects and a more sparse setting so as not to run into problems of fluidity and confusion on the screen) nor for improvements made during the game structure. The feeling is the same as its twin home counterparts, with the only difference that the psp screen, while highlighting the actual merits of the graphics sector, sometimes leaves the player completely at the mercy of the case due to some macroscopic camera problems...but let's take it one step at a time. This new ssx does not bring substantial innovations from the point of view of the competitions in which it is possible to participate (race, slope style, bigair and ssx legend) except that it effectively doubles them for the inclusion of alpine skiing. The real welcome change lies in the design of the menus and the concept that underlies their creation. The graphics of EA Big were inspired this time by the typical style of sketchbooks: horses playing guitars, cats on sledges, alien spacecrafts kidnapping people queuing for ski resorts, trolls, out-of-this-world characters, wrestlers with the humpback, since the presentation it seems to be catapulted into the crazy vision of the world of an artist who has devoted his life to only two things: the pen and the snow. Following this (undoubtedly) happy graphic choice, all the menus are animated by line drawings, the same goes for the -unfortunately- long loading sequences before the races. When the game is turned on for the first time, it will be possible to create a profile containing the player's data and his physical appearance; during the game it will be enough to collect a series of particular bonuses in the form of snow crystals to expand one's wardrobe (and the choice will start from the sober, passing from the extreme snowboarder style to the pink rabbit costumes) and one's set of boards you go out. Each type of equipment, whether it's a dress or a board, will bring significant changes to the player's capabilities, increasing stats such as grip, speed or handling. Over the course of the game, by completing the races, more and more tournaments and modes will be unlocked and you will have the opportunity to quickly climb the general classification of the game until you become the uncontested king of the snow. When checking your ranking you will notice that a skull will be drawn next to some names, the symbol will mean that to climb over a specific player you will be challenged on the playing field and the mountain will decide who will have to pass forward. In addition to the classic tour mode, it will be possible to test yourself in some special stages that will put a strain on the nerves of the more expert players with races ranging from simply passing through some special doors up to reaching a certain -very high- figure to perform in tricks. In the multiplayer section you will find yourself competing with up to a maximum of four players simultaneously (ad-hoc structure), supported by a solid wi-fi connection and without problems of any kind regarding lag. It's just a pity there is no infrastructure version of the multiplayer game, EA games have always demonstrated a vast appreciation among the online population and this would have made no difference. Paint it Black! Although Ssx presents itself in the best possible way and with all the credentials, it is unable to hide in the best way a couple of defects that partially affect its rating and playability. Before continuing, it is urgent to remember one thing: Ssx was born on ps2, it was shaped around the ergonomics of the dual shock to take full advantage of everything it had to offer. Having said that, the control system of this psp version does not shine with its own light, indeed the lack of sticks and triggers is felt a lot especially in the trick phase where most of the time it all comes back to a rambling tapping session without a actual sense; to this is added the problem of the camera mentioned above: the view (fixed and non-modifiable) follows the player to the end of the world, and by this we mean even in the most courageous wanderings without ever leaving one's shoulders, creating on more than one occasion real havoc and not helping the player in the slightest in a stalemate in figuring out where to move to get out of the way; the same goes for the bumps followed by the trees that suddenly appear more for visual problems than for the graphics engine. Remaining on the subject of graphics, the psp version comes out of the comparison with the others without infamy and without praise, a few less trees still fail to overshadow the excellent work done by the EA Canada team, the game runs smoothly, without hitches and slowdowns making the gaming experience better. An EA game wouldn't be worthy of existence without a massive supporting soundtrack, Ssx on Tour doesn't hold back and offers the player a wide choice of rock songs ranging from Iron Maiden, to Motorhead passing through the now classic piece of Queens of the Stone Age. The musical choices integrate perfectly with the sketchbook style used in the game and end up giving the whole thing a further frenetic touch. A welcome surprise for all those who purchase the PSP version is undoubtedly the Pocket Trax mode with which it will be possible to transform your console into a sort of portable mp3 player from where you can listen to all the tracks in the game, followed, needless to say, by the umpteenth delirious animations of people in raptures from a live concert (the choice of the Multiplayer editors falls on the always green Mr. Roboto, seeing is believing). Undoubtedly a good game, undoubtedly the only exponent of one of the most loved winter sports. Forced choice? Maybe, but not only. Ssx mixes an excellent graphic and sound sector with a playability that has been established for five years now. This first appearance on psp confirms what is good about the saga and mixes it all with the peculiarities of a laptop: Ssx is a game that can range from a single five-minute leisure game to an intense game session to unlock everything that can be unlocked up to simply listening to the audio tracks; it doesn't reach a higher mark due to some flaws and the lack of a substantial multiplayer section... the possibilities were all there. Pros: Long-lived Musically and graphically very inspired The arcade setting of the game is a real panacea for fun Cons: Some small problems with the camera and controls Multiplayer online unjustified absent ~In the beginning it was 1080 on Nintendo64. Given the public's appreciation, many strove to overcome its winter glories without apparent results: the Cool Boarders came, there were the Snow Surfers, nothing undermined the hegemony of the triple rotation trick; then , just when we were preparing for the next-gen advent of the Nintendo title, here came out of nowhere the launch line-up for ps2, what would become one of the most loved sagas by the snowboard people: Ssx.~ To date, another small step towards product perfection has been taken, the series has maintained the robust foundations on which it was founded: alpine fun in pure arcade style and to this we add some new (and juicy) features, finally also for ski aficionados traditional they will be able to descend at breakneck speed along the gullies of EA Big and let themselves be overwhelmed by their own exhibitionistic vein in the trick phase. Ssx On Tour is among us.", "date": "2005-11-23", "grade": null}