{"name": "Un posto in Paradiso", "ref": "https://multiplayer.it/recensioni/126341-crusader-kings-ii-sons-of-abraham-un-posto-in-paradiso.html", "text": "Introducing a title like Crusader Kings II is always a strange task, as the game developed by Paradox is now perfectly known by fans who have gutted every single aspect. Yet, despite its success, Crusader Kings II is not among the ~big names~ of the industry: this is in fact the well-known fate reserved for every niche video game. Even if, as in this case, it is something that has now become the emblem of an entire genre, of those so-called ~grand strategies~ of which the Swedish team is now the absolute master. More than a year and a half after the release of Crusader Kings II, Paradox has released the new expansion Sons of Abraham, thus bringing the count of major updates made to the basic version of the game to five. As usual, after the due confession (given the theme) we rushed to try the new contents offered, focused as suggested by the name on the Abrahamic religions and their influence within the society of the Middle Ages. Christian, Muslim or Jewish? Let's choose our faith in Crusader Kings II with Sons of Abraham! The importance of the papacy Although the novelties of Sons of Abraham concern three different religions, its main characteristics reflect those of Crusader Kings II itself, based mainly on the European continent and neighboring territories. It is therefore the Christian religion that enjoys the greatest innovations, thanks in primis to the introduction of the College of Cardinals, which can now elect the Pope from its members. Such a situation opens the door to new options for sovereigns, especially those intent on leveraging the pontiff and his followers to achieve their goals. The simplest way is of course to ensure that a trusted man is able to enter the College, to then become the new successor of Peter, thus obtaining a preferential path towards the Holy See to obtain favors and concessions of all kinds. If becoming Pope isn't exactly easy, the Middle Ages teach us that there are also different ways to take advantage of one's religiosity, whether real or fake. In fact, among the elements of Sons of Abraham we also find the possibility of making pilgrimages to sacred places, perhaps a little underestimated in their effects and consequently not always convenient, while jumping from one branch to another it can be useful to pack and send one's relative to monastic order, thus resorting to a more peaceful method to distance it from power games than physical elimination or incarceration. The Pope and the various Orders therefore acquire a renewed importance in the geopolitical evolution of the territories, giving the compliant player the option of counting on their support in cases of need, thus resorting to religion to obtain economic and other favors. In this regard, the possibility of exploiting religion also to find an otherwise non-existent casus belli, to invade one's neighbors, should not be underestimated. Children of Abraham As we said, there are 3 religions involved in this expansion: in addition to Christianity, we also find Islam and Judaism. In the first case, the historical context confronts us with the opposition between Mutazilism and Asharism, two faces of the Muslim confession linked to two very distinct philosophies: the first more rational, the second more spiritual. Once chosen who to stay with, the player will therefore have to face a situation of internal conflict within the same religion, which naturally contributes to a certain tumultuousness in the management of relations with one's neighborhood. However, it is an excellent diversion, as is the challenge proposed by the population of Khazaria and by the kingdom located on the shores of the Caspian Sea, from which to start to try to recreate the Kingdom of Israel. Since the starting territory is particularly small, it is a difficult objective, for this reason recommended to the most experienced Crusader Kings II players. Along with the major news regarding the three religions we've talked about, there are also a series of events naturally inspired by the relationship between man and divinity: they won't be huge news, but they help to add some variety to the game. Nothing to note from a technical point of view, considering that both the graphics and the music remain practically the same even in Sons of Abraham: nothing that we didn't already expect from an expansion of Crusader Kings II. Have you lost count? Given the number of Crusader Kings II expansions and DLCs released by Paradox, it's easy to get lost in the additional content that has arrived since the game's release. For convenience, all the e's are summarized heremain expansions, with their release date: Sword of Islam - June 2012 Legacy of Rome - October 2012 The Republic - January 2013 The Old Gods - May 2013 Sons of Abraham - November 2013 Halfway between expansion and DLC we find Sunset Invasion, dedicated to a phantom invasion of Europe by the Aztecs.", "date": "2013-12-10", "grade": "7.5"}