{"name": "Lo skater invisibile", "ref": "https://multiplayer.it/recensioni/126369-touchgrind-skate-2-lo-skater-invisibile.html", "text": "In a rapidly evolving panorama such as that of the mobile market, the five years it took Illusion Labs to follow up on the original Touchgrind can rightly seem like an eternity: sure, in the meantime the Swedish development team has dedicated itself to a spin-off dedicated to BMX and other products, but the wait for skate enthusiasts who had appreciated the first chapter was still long. So let's find out if it was worth waiting so long... Touchgrind Skate 2 is better in everything than the first chapter, but it remains a sector experience Only for lovers Experience teaches that many sequels tend to simplify the playful experience in order to reach a wider audience, but this is absolutely not the case with Touchgrind Skate 2: as happened for the first chapter, once again we are faced to a product dedicated to true enthusiasts of the discipline, or at least to users with large doses of patience and dedication. The learning curve of the game is in fact extremely steep, despite the vast tutorial section dedicated to illustrating the basics of the complex control system: this involves using the middle and ring fingers as if they were the skater's legs, moving them on the board to impart direction and by carrying out a whole series of movements to perform jumps and various tricks. It is an absolutely ingenious and well-structured model, which however really needs considerable coordination skills to be mastered properly: in short, Touchgrind Skate 2 makes a selection of its truly ferocious audience, to the point of making it a completely inadvisable product to anyone who does not intend to anticipate an intense initial training phase. Also because, after this section, the Illusion Labs title offers a truly attractive playful offer only for skate enthusiasts. The three environments that make up the package allow you to try your hand at four distinct modes: Training is self-explanatory, Competition requires you to reach the highest possible score within the time limit, Jam Session shifts the focus to completing certain challenges while S.K.A.T.E Game is the name behind which there is an appreciable turn-based multiplayer component. Initially, only some of the contents mentioned are available, and it is necessary to grind points to gain access to these and other unlockable elements: in this case, the game offers a vast collection of boards, wheels, grips and stickers just waiting to be reveal yourself. As is evident, it is a structure that requires a constant reiteration of the same playful mechanics, in which there is no real sense of progression other than that deriving from obtaining a new hi-score to enjoy on the appropriate online rankings . Also in this case, Touchgrind Skate 2 stands as a highly divisive title, with the more hardcore users who will undoubtedly appreciate the ~hard and pure~ look of the Illusion Labs production, an aspect that instead to all the others may appear as a much less captivating lack of variety and incentive to continue. From this point of view, as we mentioned at the beginning, little or nothing has changed since the first chapter, while analyzing the technical sector the differences are many and immediately visible. Instead of the bird's eye view of the prequel, Touchgrind Skate 2 uses a more comfortable framing placed behind the board and slightly inclined upwards, which allows you to have a much wider vision of the scenario without sacrificing the usability of the control system. With a quick tap on a special indicator it is then possible to have an overview of the entire skatepark, to easily identify the ideal ramps and rails to put into practice the desired evolutions. The surge in the performance of iOS devices compared to those of five years ago on which the original Touchgrind ran is finally made evident by a truly excellent graphic creation, with decidedly large and very detailed scenarios, covered with defined textures and which slip away on the screen without the slightest uncertainty: then the management of the physical routines of the skate is textbook, which behaves in an extremely credible and realistic way.", "date": "2013-12-09", "grade": "7.5"}