{"name": "Pac'N Roll", "ref": "https://multiplayer.it/recensioni/pacn-roll.html", "text": "Once upon a ball The story on which Pac'n roll is based is in fact a rather specious element to make sense of the game mechanics: a brief presentation created along the lines of that of Pac-pix (the pages of an illustrated book scroll which tells the preamble to each other), explains that Pac-man on vacation in Pac-land with his great teacher Pac-master, finds himself facing the threat of Golvis, a ghost who is a great fan of rock'n roll who mimics Elvis, brought back to life thanks to a spell cast by the famous band of ghosts Blinky, Pinky, Inky and Clyde. Golvis turns all the inhabitants of pac-land into yellow balls and kidnaps pac-man's friends, it will be up to him to save them during the adventure. Here, the part relating to the ~plot~ effectively ends and what is the real game begins. Pac'n roll winds its way through 5 different worlds (castle, jungle, bonbon land, ghost and flaming fortress) plus a final area for the big showdown; each world is divided into five stages: four of normal travel with a series of intermediate objectives and a final one with the end-of-level boss. The typical level is structured by mixing elements of the original Pac-man with Marble Madness and Super Monkey ball; Pac-man is made to move by scrolling the stylus on the touch screen (the concept of scrolling is the same as the basis of the track-ball): it will then be possible to perform a whole series of particular actions useful for the purposes of the game (the movement lightning of the nib from the bottom upwards will make pac-man perform a sprint to reach, via ramps, more distant places, or the simple pressure on the touch will cause the sudden stop of the rolling action). The aim of the game is the same as always: to eat dots, however it is interesting to note how recent graphic technologies are integrated into such a simple game scheme: in many levels there will be barriers - of the most varied shapes - which will force the player to follow a certain path to eat and not be eaten by ghosts, a clear homage to that labyrinthine structure that was the fortune of the progenitor of the series. Ghosts are given practically the same treatment as always: they will chase the player to the end of the world, but will run away as soon as he eats the special ball that makes them vulnerable; when one of the four ghosts comes into contact with pac-man by hitting him, the action will move to the lower screen of the ds: in fact, it will be necessary to hit the ghost floating around the yellow ball a couple of times with the stylus to be able to drive it away and get back into the game. In this second spin-off for ds pac-man will have a special energy bar that can be recharged through the use of fruit scattered throughout the levels and can be increased by defeating the bosses at the end of the level. An interesting addition to the interaction with the levels is given by the presence of some special cards that are able to transform pac-man into a heavy and super-light version; some areas of the levels can only be overcome through the use of these two particular statuses: in the first case you will be equipped with a medieval helmet, you will be much less subject to the action of the wind and it will be possible to recover the balls present on the bottom of the mirrors of 'waterfall; in the second case pac-man will be equipped with a winged hat, with which he will be able to float in the air much longer following a jump and will be equipped with greater speed. Unfortunately a medal does not exist without its reverse and while in the heavy version you will find yourself much more difficult to escape from the ghosts due to the actual weight, in the light version you will find yourself completely at the mercy of the wind. At the end of the game session, it will be possible to retrace one's steps and try the stages again in different modes (challenge and time attack): to complete pac'n roll 100%, it will be necessary to complete all the alternative missions proposed and find all and 128 diamonds scattered throughout the game, only in this way it will be possible to unlock all the extras. Another medal, another reverse The real, only and big problem of pac'n roll lies in the absolute imbalance of the level of difficulty: the game does not present in the options the possibility of raising or lowering the tones of the challenge and playing through the adventure you will find yourself overcoming with extremely easily the first four worlds based on quite similar structural schemes (jump ramps, dots, ghosts, intermediate points, final), and to sweat the proverbial seven shirts to overcome the fifth and last set of stages which, distorting the proposed structure, presents as a set of self-propelled platforms, trampolines, temporary actionszed and no ghosts. This type of drastic level design choice leads the player to find himself faced with two almost completely different game experiences, where the first part does not help in any way to create the manual experience necessary to complete the game. That said, Pac'n roll lives, like its predecessor, with a big problem of longevity even if, with the inclusion of a whole series of unlockable secrets, it slightly increases its replayability. Pac'n roll can boast a very pleasant and colorful graphic sector, the first evolutionary step taken in this sense by pac pix to rejuvenate the franchise here finds an excellent disciple, unfortunately we cannot speak in equally enthusiastic terms regarding the sound: only one track per world and some remixes of the original pac-man theme don't justify its sufficiency. Secrets? Yes please! This box contains a small spoiler, but at the same time contains a possible good reason to buy Pac'n roll. During the adventure it will happen to come across a series of blue diamonds. The diamonds in the game are 128 in total, scattered among the various time attack, challenge and normal stage tests. Conquering 8 of them will unlock an additional special level called Pac-luna which will give you the opportunity to play three mysterious stages. The first unlockable -with precisely 8 diamonds- will be the original pac-man in all its beauty and simplicity. An excellent opportunity for those who haven't had the chance to play a game for years and an even better opportunity for those who, too young, have only heard of it in gatherings of old nostalgic gamers. Pac'n roll is undoubtedly a fun and well-made game, but afflicted by a whole series of small flaws which unfortunately undermine the gaming experience: the difficulty set in a somewhat original way (no, it's not a compliment), the unfriendly level design and poor longevity detract points from what could have been a much more deserving game. However, the idea behind it and the realization of the whole remains well made, even if by exploiting ideas that are not entirely original (marble madness and monkey ball have made school from this point of view), Namco looks for new ways to revolutionize the series and manages to pull pac'n roll out of his hat: the road is the right one but something is still missing, all that remains is to wait. (Note: I add half a point to the final numerical value of the unlockable secrets.) For another positive turning point in the series, the gaming experience is pleasant, visible references to the original series Coinciding with the twenty-fifth anniversary of its life, Namco's yellow ball makes its second appearance on nintendo ds, once again upsetting the game system and trying to bring new air to a product that was already perfect two and a half decades ago . At first glance, Pac'n roll looks like a puzzle set in a 3D world, totally modeled around the use of the touch screen and linked to some of the aspects that made Pac-Man famous in the gaming world. So take up the nib and get ready to experience yet another adventure in pac-land!", "date": "2005-11-23", "grade": null}