{"name": "Il ritorno del generico eroe!", "ref": "https://multiplayer.it/recensioni/126258-jett-rocket-2-il-ritorno-del-generico-eroe.html", "text": "It was 2010 when Shin'en, a German software house known for its technical ability in exploiting Nintendo hardware and for being fond of digital delivery, released the first Jett Rocket on WiiWare, a 3D platformer whose inspirations could certainly be include Mario (especially in his ~galactic~ incarnations) but also, in terms of themes and settings, a bit of Sonic. The two formidable symbols of the platform remain the main reference points of the sequel too, this time on the eShop for 3DS, although the mind even travels to Mega Man in the most successful moments. A game that therefore does not seem to do anything original, but it is said that borrowing the excellent ideas already had by others cannot lead to anything good; it's all about mixing the elements well and not just copying without giving a ~soul~ to the whole. The first time Shin'en managed to pack a good game, will she be good at conceding an encore? The 3D effect Activation is recommended: not only is it exploited by some nice effects such as the eliminated enemies that seem to blow up when they come out of the screen, but it also manages to be functional to the gameplay, mitigating a bit the visual problems in the 3D levels and mixed 2D and 3D. Given the developers' emphasis on maintaining 60 frames per second, maxing out stereoscopy doesn't affect fluidity at all - admittedly this is a goal that few Nintendo 3DS games, retail or DD, ever achieve. Kaiser S... Taikai! The story behind it all is nothing epochal, very similar to the first episode and, moreover, clearly inspired by that of the first Sonic the Hedgehog. In the future-fabulous world of Jett Rocket, where ours plays the very important role of ~planetary inspector~, the pitfall that bad robots lead to good robots is constant, and this time it's the turn of a mysterious machine that becomes menacingly call Kaiser Taikai. The mechanic figure kidnaps all the good robots and dear friends of Jett, scattering them in three different worlds each consisting of five levels (one robot for each level, very good) plus a final guardian, and forcing the hero to undertake a long, difficult and perilous journey for their liberation. However, while the prequel was a pure 3D platformer, in Jett Rocket II Shin'en tries to shuffle the cards a bit, with some levels belonging to the same genre, others that could be defined as a mix between 2D and 3D (taking inspiration from no less that from Super Mario 3D Land, in short) and still others that are in a very pure 2D. It is precisely these last phases, although a novelty, that seemed to us the most successful: they take their cue, as we said, from the first Mega Man titles, and in the level design and difficulty, in some passages truly diabolical and reminiscent of the glorious days of platformers 2D. The reason for this apparent strangeness is soon explained, and lies in the characteristics of the protagonist: Jett, despite the name, is a character with a very slow pace and who basically has only two basic movements, the jump and the ~spin ball~, which it also doubles as a double jump, also taken verbatim from the blue hedgehog games. To these is added the non-constant presence of a jetpack to reach the highest portions of a stage. Although the philosophy of the latter is different, the nature of the character does not change, and it is in the pure 2D levels that he is exalted, also thanks to a very successful level design that focuses more on difficulty than the other two types of gameplay platform. The 3D levels, although well designed, suffer a lot from Jett's slowness combined with the low presence of enemies and a view that does not always allow you to better judge distances and directions; problems that are mitigated, not disappearing, in the 2D/3D stages, however penalized by a management of the camera that occasionally throws a tantrum. After the first episode on WiiWare, Jett Rocket returns to 3DS and brings together all the elements of the platformer! I do things, I see robots... That a lot is focused on variety is also evidenced by the challenges with the bosses, each equipped with precise patterns as per tradition, and by the bonus stages that serve both to diversify the pace of the game and to collect extra lives. There are different types, from those that do not vary the platform theme but have to be completed within a time limit, and can be reached both by finding a particular bonus within the canonical levels, and between one level and another by spending some of the solar cells collected in the stages, to those that are comparable to real minigames, notable the sorties with the jet ski and the hang glider. In addition there is a ~mirror mode~ which is unlocked after completing all mimissions that let you replay them in a ~mirrored~ version, and a Bonus Attack mode that lets you replay all stages with the goal of the highest score; this is unlocked by finding some photographs scattered throughout the levels, which therefore, you will have understood, are not linear but provide for various detours. All this increases a longevity that basically would not be excellent, although graced by a well-crafted difficulty curve that finds its peaks, also like the actual gameplay, in the 2D levels. Speaking of Shin'en, a remarkable quality of the technical department is always expected: well, in the case of Jett Rocket II the Teutonic developers have preferred to focus on fluidity, always at 60 solid frames per second, but somewhat at the expense of quantity of screen elements which is never incredible, and of their variety. In any case, the cleaning of the textures is of a good level, and some lighting effects are also remarkable. All in all, a nice sight, although perhaps, given the rather reflexive pace of the whole, a decrease in fluidity in exchange for a greater graphic richness would not have been a bad deal. Absolutely generic and standard sound, just as the general style is completely anonymous, especially as regards the design of poor Jett who certainly will not be celebrated as the most charismatic character in the history of video games.", "date": "2013-12-05", "grade": "7.0"}