{"name": "Skylanders Swap Force", "ref": "https://multiplayer.it/recensioni/126229-skylanders-swap-force-skylanders-next-gen.html", "text": "Released a few weeks ago on ~current gen~ consoles and on Nintendo 3DS, the third episode of Skylanders proved to be the consecration for Activision Blizzard's teen series, capable of offering production values such as to be not only irresistible for children and teenagers, but also absolutely tolerable if not even pleasant even for parents or adult players. For the children of fathers with a passion for technology, the American label has decided to extend the availability of the product to the new consoles from Microsoft and Sony, both of which have also been able to count on Skylanders Swap Force to strengthen their respective launch line-ups . So let's take a look at what actually changed in the generation leap. Skylanders Swap Force on next gen becomes more beautiful while keeping the same content Same inside, better outside As usual in these cases, we refer you to our extensive review of the PS3 and Xbox 360 version as regards the extended description of the game and its contents, since these aspects have been entirely carried over without any changes whatsoever even on the new hardware. Skylanders Swap Force also remains on the next gen therefore one of the most interesting and valid titles available for the teenager range, consolidating a leadership based on the ingenious and very profitable basic idea: a series of statuettes representing the heroes of the video game, to be made on screen to control them directly with the pad by simply placing them on a device called a ~portal~. A union between real and virtual that has made its way into the hearts of kids, and generated an authentic money-printing machine based precisely on the sale of the aforementioned statuettes. A formula often and willingly criticized by detractors due to the mechanism which, by making certain areas of the levels available only to characters belonging to specific classes, in fact favors the purchase of many more Skylanders than those present in the Starter Pack. Although it is certainly a judgment not without foundation, the reality is that the Activision Blizzard franchise would not have reached such heights of popularity if there had not been a level title underneath, with a quality often unrelated to video games aimed at this type of audience. This last episode basically brought with it two innovations: the first linked to the presence of new statuettes that can be separated in the upper and lower part of the body, and can then be combined with those of other characters to create hybrid creatures. The second more concerning the gameplay mechanics, thanks to the introduction of the ability to jump which was instead absent in the first two episodes: an addition truly capable of giving a renewed freshness to the product through a much more varied, full-bodied and robust level design. Dad's wallet Having therefore clarified that the next gen version of Skylanders Swap Force does not bring with it anything new in terms of content, it is quite clear that the differences with the other editions must be sought only and exclusively in the technical component. If it is clear that the cross-gen nature of the project certainly did not allow the potential of the new hardware to be substantially exploited, at the same time the American programmers must be acknowledged for having carried out an absolutely more than decent conversion job. The magic words are, as expected, two: 1080p and 60 frames per second. Translated, it means a graphically very, very superior experience. It is above all in the cleaning of the image that Skylanders Swap Force on the new consoles shows the greatest differences: a considerable improvement in the overall quality is immediately perceived at a glance, but it is in the details that stand out through the higher resolution that one can appreciate the work of the graphic designers of Vicarious Visions. The much cleaner textures and the impeccable definition of settings and characters immediately manage to solve the main defect identified on the current gen, thus allowing you to appreciate even the smallest details. The game therefore simply becomes more beautiful, with a very pleasant overall result even without any type of intervention on the polygonal complexity. The question to possibly consider is whether a child can actually perceive the superior visual rendering of the next gen versions, and secondly whether this is incisive in his enjoyment. From our point of view, we believe that the factor is very little decisive, which is why we certainly don't feel like recommending the purchase of the Xbox One and PlayStation 4 edition to those who already own another version. But if on the contrary you stayed at fwindow waiting to see the results of Skylanders Swap Force on the new consoles, it is decidedly evident how the Activision Blizzard production manages to give its best on the latter.", "date": "2013-12-04", "grade": "8.5"}