{"name": "L'avventura  arrivare", "ref": "https://multiplayer.it/recensioni/126135-adventure-park-lavventura-e-arrivare.html", "text": "Bullfrog's Theme Park kicked off the dance many many years ago and since then there have been attempts to create video games that put you in the shoes of the manager of an amusement park. Apparently the concept is very simple to implement: given a vast empty area, attractions and services must be built to attract as many visitors as possible and make their stay pleasant. From this point of view, Adventure Park is flawless and perfectly follows the line dictated by the most famous titles of the genre: from the aforementioned Theme Park to Rollercoaster Tycoon 3 passing through all the other more or less relevant management software. The player is therefore called upon to achieve certain established objectives (if desired, there is also the free mode which allows you to do what you want, i.e. to grow the park without worrying about the missions) in different maps, each theoretically with its own characteristics and peculiarity. If you have already tried the aforementioned titles it is not difficult to understand what to do in practice. We start with the construction of the roads, then we put in place some economic attractions (for the more expensive ones we will first have to gain consideration among the customers) then we move on to supplying the fleet with maintenance and cleaning personnel, finally we go to services various, such as public toilets or food dispensers. Only when the first draft of our park has been prepared will it be possible to open access to the public, the only judge of the goodness or otherwise of our work. Obviously building costs and you will have to constantly pay attention to the cash register. Also, don't expect to convince the patrons with little, because the public will prove to be pretentious towards you... perhaps too much... hey, but these are hard to please! The positive and promising part of Adventure Park ends here. Now comes the harsh reality. Running a playground can be a lot of fun but not in this case! Bad intelligence ~Ok guys, we've built toilets right under your noses, why do you keep needing toilets? Are there few of them? So why does the customer who follows you even think there are too many?~ This, in summary, is the confusion that we constantly face when playing Adventure Park. Why do the accursed little virtual men who populate the park seem incapable of doing anything? These little maniacs get lost all the time and it seems that they are often unaware of what is around them, expressing contradictory opinions that simply leave them stunned in front of the monitor. Now, it is obvious that so-called customer feedback is important, but if one group has too many distributors and another does not have enough, it becomes difficult to figure out how to fix it. However, if the problem of the artificial intelligence that drives the population of the park were only this, it would be very small compared to what it actually is. Let's take the case of some missions where you are asked to repopulate attractions or various infrastructures. One that many have found problems with is a restaurant. Well, our aim is to build a park to increase the number of seats for the poor restaurateur who seems unable to attract customers on his own. So what to do if not arm yourself with a bulldozer and patience to build the most beautiful park in the world just to help him? (does this make sense?) Said and done. Too bad the cursed visitors do not want to go to that restaurant, for any reason. How come? We study the situation a little but we understand each other little. People are hungry, but they don't go in there. Yet we have built a road that leads directly in front of the entrance and we have avoided supplying the park with distributors, to the point that the strongest complaint of the various feedback concerns the absence of food. They're hungry, but they don't even think about going in. Will it be a dump? Who knows, the fact is that the park is full and the restaurant is empty. Did we do something wrong? Fortunately in 2013 we have the internet to help us and we discover the drama in the blink of an eye: the little men are placed in front of the restaurant by hand using the selector. We didn't want to believe it when we worked hard to find that it works perfectly. In short, our little men are too stupid to go to a restaurant. Don't worry, because I'm in good company. In fact, very often we had to move the work units by hand to make them work on attractions or areas that were actually already included in their work space (each worker has his own action area in which he automatically performs his tasks). Other times we have seen that some attractions were not reached despite not being located in particularly difficult places to reach.In short, it seems that guests and workers are having a very hard time finding their way... which may be an interesting drama from a philosophical point of view, but in the game it's just a big nuisance. Fists in the pocket Another big flaw of Adventure Park is the lack of customization. Without wandering around too much, the attractions are few, just as there are few decorations and the various surrounding elements that define the park (fences, gates and so on). As we mentioned above, the advanced attractions must be unlocked by rising in consideration among customers, but that's about it. Even the most complex attractions, such as roller coasters, don't offer many possibilities in terms of feasible interventions and quickly get bored. Sure, we weren't expecting a new Roller Coaster, but at least something complex and customizable enough to justify the ticket price! It is true that the editor for building the attractions is very easy to use, but the situation changes slightly and in the end we find ourselves with parks that are all very similar to each other and with very few things to do (apart from catching visitors to put them in front of the destination they can't find on their own). It gets to the point, in the largest parks, of having to place the same attraction several times in order not to leave them empty. The possibility of improving individual attractions with additions helps, but not by much, also because the differences compared to the basic versions are difficult to appreciate in game. More evident are some additions, such as scenic explosions or short tunnels, but also not very effective on the overall gameplay. Let's say that these little extras would have been much more welcome if there had been more basic content, instead of being faced with less than the minimum wage. Also because we are not talking about an economic own title. At least, it must be said, the attractions present are not bad to look at, but that's all, since they also lack the basic background sound effects.", "date": "2013-12-04", "grade": "4.5"}