{"name": "Esteban chi?", "ref": "https://multiplayer.it/recensioni/126177-esteban-e-le-misteriose-citta-doro-mondi-segreti-esteban-chi.html", "text": "Before talking about the game, a small necessary premise: ~Esteban and the mysterious golden cities~ is a cartoon that aired in Italy in the early 80s, on Rai. We're not talking about a series that has entered the hearts of millions of viewers, but in any case a product that at the time enjoyed enormous visibility even in countries, such as Italy, where it did not reach the pinnacle of success. The cartoon was predictably followed above all in France and Japan, this because it was made by Studio Pierrot, which started a Franco-Japanese collaboration, both between designers and - above all - between screenwriters. Everything is then based on a novel published in the mid-60s in the United States, written by Scott O'Dell: overall it is a work with various cultural influences, suggestions that are clearly evident in the final result, while dominating the graphic imprint Japanese. All this preamble to clarify that for many customers, especially in certain countries, the brand alone could entice them to buy: it is a tie-in, although in Italy many users will not even realize it. A tie-release to coincide with the relaunch of the series, with new seasons currently airing in various states, after a nearly 30-year hiatus. Esteban, from the cartoon to the video game. Ever heard of it? We present it to you I don't watch cartoons Before totally closing the parenthesis on the cartoon, we point out that the game does very little in terms of storytelling: the videos are cute and understandable by anyone, but to be fully appreciated they require a previous affection for the characters. You will hardly want to see the cartoon after finishing the game, here it is: it is designed and built to please the opposite path. From the first moments we understand that it is a low-budget project, and in fact it has arrived on WiiU, and tablets in general, thanks to the crowdfunding on Kickstarter. This does not mean that it is a bad product, on the contrary: aware of the technical limits, Neko Entertainment, the French developer of the game, has created a clean and well-finished graphic style, including details. Despite being passed off as an adventure, a genre that is certainly more congenial to the soul of the animated series, it is immediately evident that the backbone is that of a puzzle game, with a slight splash of action that never hurts. The controls are immediate and responsive, whether you want to play with the stylus or with traditional buttons: both methods have their pros and cons, but it's one of the few cases where it's really personal taste that makes the difference. The touch screen makes it more immediate to switch from one character to another, while the control stick gives the usual tactile feedback to the movements of the protagonist. The internships to face, set in China and framed with an almost isometric view, are about thirty. Some still not available, but don't worry: they will be available soon, when the respective episodes of the cartoon air, at no additional cost. There are already enough to enjoy, by the way. The essential mechanics are very simple: make the three protagonists (Esteban, Lia and Tao) interact, each with unique skills, so as to solve puzzles and collect the scrolls necessary to access the next level. You can switch from one character to another without any restrictions - except when you're under surveillance, as we'll see shortly - but you can't move them at the same time. Sometimes it seems like playing a miniature Pikmin 3, figuring out where it's best to send one of the protagonists and how: the level of complexity never reaches high peaks, in the sense that it will often be the game itself that suggests what to do, putting a themed path puzzle intended for only one of the three characters. Puzzles that form the basis of the game, pleasant, but never too varied or demanding: they are repeated more or less regularly throughout the experience, and range from moving stones to activating blocks, all declined in an increasingly intricate, without ever resulting in the real complexity. In general, it becomes more and more pressing, as the stages progress, to have the three protagonists collaborate - often at a distance, who manage to keep the mechanics lively which, taken in and of themselves, are certainly not original. Splinter Cell for dummies Apart from the direct control of the protagonists, the stealth sections take care of expanding the action experience of the game, the only ones in which it is not possible to change characters. There are several, at least one in each stage, and they make it further clear how this work is mainly aimed at children: apart from the atmosphere, it is precisely the softness with which surveillancealliance and eventual capture to limit everything to a childish audience. If puzzles can also arouse the attention of more experienced players, perhaps eager for a well-groomed genre pastime, these parts are to the video game like noisy buttons in children's books: fun for a child, almost comical for anyone else . The guards before deciding to attack you will wait several seconds - in which it will be clear from a hatch that they are observing you - and, once captured, you will have the only punishment of having to redo the section (not the stage). The developers have tried to broaden the potential audience by inserting objectives that involve perfect execution of the level, including never being seen by enemies, but frankly they appear out of place. Esteban's game is a good title for children, and as such should be appreciated.", "date": "2013-12-03", "grade": "6.5"}