{"name": "Pursuit Force", "ref": "https://multiplayer.it/recensioni/pursuit-force.html", "text": "Brute force? Yes please From a good arcade-style title, Pursuit Force immediately reveals itself as an orphan of great presentations or elaborate storylines to follow, immediately throwing the player into the middle of the action. We therefore soon find ourselves on the mission selection screen, which reach the considerable figure of 30 units and which are divided according to the gang to which the criminals being pursued belong. Among Italian mafiosi, paramilitary groups and prisoners on the run, there is certainly no shortage of irons in the fire, and at the same time the attempt to differentiate the objectives of the same internships as far as possible is appreciable: one always revolves around the classic concepts of elimination, protection of allies and respect for a certain time limit (elements often mixed together) but Bigbig's effort must undoubtedly be rewarded. With these premises, let's describe a typical Pursuit Force game phase, which best of all can explain the characteristics of the SCEE product. Basically, the player is simply asked to drive his own vehicle until he reaches the enemy one (possibly avoiding ramming civilians or involving them in shootings), and then obliterate it using two options: by shooting him directly while remaining behind the wheel or by jumping on it and then eliminate its occupants and take possession of it. Of the two opportunities, the second is definitely the more fun and functional, and which in fact ends up not being applied only in the rare cases in which it is specifically prevented by the game. Once clinging to the front or rear of the enemy car, the user just has to shoot the driver and his associates, being very careful to shelter from enemy fire and to maintain balance. A decidedly captivating and adrenaline-pumping process, which is enhanced when the ~justice indicator~ is filled - through good gameplay: in this case, it is possible to take advantage of a sort of bullet time mode which allows you to shoot enemies during the flight between one car and another. Pursuit Force therefore boasts a series of interesting playful ideas, unfortunately conspicuously dampened by some large gaps in terms of gameplay. Criminal flaws The first, conspicuous, point against Pursuit Force is undoubtedly represented by the absence of any difficulty curve, invisible even in the very first mission which should act as an introduction to the game. The developers of Bigbig, evidently heedless of the concept of gradual progression, seem to have arranged the stages almost at random and not according to a regular order: one passes without continuity from short and affordable missions to other long and tough ones, without checkpoints or the like to provide a some kind of support. It must be said that the general difficulty of Pursuit Force is largely conditioned by other negative aspects of the SCEE production. Above all the control system, wooden to the point of making any attempt at a clean curve almost impossible, with the vehicle on duty destined to inevitably crash into the barriers that delimit the turns; it is useless even to list the consequences of such incredibly unresponsive steering. Not only that, Pursuit Force also lacks precision with regard to jumps from one car to another, inexplicably denying this opportunity on a large number of apparently favorable occasions. Deserve a negative mention, then, the sections on foot which unfortunately insert themselves between one chase and another: characterized by an even less fluid control system and by practically zero coefficients of challenge and charm, they turn out to be a truly mediocre show. To all this we must add a palpable repetitiveness of the game scheme, which is reduced on balance to the mere jumping to the bitter end from one car to another, a situation little comforted by the questionable secondary play modes. And it is a pity to have to underline all these defects concerning Pursuit Force, both for the good gameplay ideas offered by the Bigbig title, and for the highly appreciable technical sector it boasts. While certainly not representing the most spectacular ever seen on PSP, Pursuit Force shows off a clean and fluid graphics, perhaps not very rich in polygons but which does its job in a decidedly good way. Lights and shadows instead with regard to the sound, characterized by music and effects of sure impact but at the same time guilty of a sometimes even irritating dubbing in Italian. Comment Pursuit Force is basically a product that lacks care in some of its most important aspects, and that's why it shouldsettle for a just enough rating. A poorly calibrated difficulty level, a very woody control system and a repetitive game scheme are only the most striking defects of the title developed by the Bigbig team which, sad to admit it, has largely wasted the potential of a very interesting playful quid all in all . That said, Pursuit Force is certainly not a bad game, and those able to turn a blind eye to its obvious shortcomings will still find themselves a frenetic pick 'n play action game. Pros: Immediate and addictive gameplay Technical sector at the height Some good gimmicks Cons: Repetitive game structure Inadequate control system Frustrating difficulty level Developed for the PSP by Bigbig, Pursuit Force puts the player in the role of a member of an imaginative police force, specializing in high-speed pursuit and elimination of criminal threats. Put simply, you take a car (or a motorboat, or a jeep, or a motorcycle), catch up with the bad guys and shoot them out amiably with pistols, perhaps jumping directly onto their vehicle for greater convenience. But despite these curious premises, Pursuit Force on balance fails to keep expectations intact.", "date": "2005-11-22", "grade": null}