{"name": "Sfida globale per la Soul Edge!", "ref": "https://multiplayer.it/recensioni/125640-soul-calibur-ii-hd-online-sfida-globale-per-la-soul-edge.html", "text": "Project Soul, Namco's internal studio responsible for all the chapters of the saga, celebrates the tenth anniversary of the release of Soul Calibur 2 with a great port for Xbox Live Arcade and PlayStation Network full of new features and improvements. Accredited and acclaimed as one of the most engaging and entertaining fighting games ever, the second chapter of that game that caused such a sensation upon its release, effectively determining the beginning of a new graphics generation on the SEGA Dreamcast, is back. Many fans fondly remember this fighting game as an icon of their console (the first chapter was in fact the only one in the saga not to be released on competing platforms), until the release of the sequel, if we want even more beautiful and complete than the first ~masterpiece ~, and one of the few games in history to receive a ~perfect score~ in Famitsu magazine, and at the same time full marks in major world publications. What could Soul Calibur 2 HD Online do better than this fighting giant already had? Simple: do it all again, and do it better. Improving perfection? Soul Calibur 2 HD Online is the definitive chapter. Mission accomplished, Namco. Even bigger and meaner Soul Calibur 2 expands and improves every parameter and aspect of the first chapter, starting from the gameplay and passing through the undisputed artistic and technical qualities. Let's start immediately by talking about the innovations introduced by the HD Online version, which, as can be seen from the title itself, gives the Namco game two absolutely new features. The first is high definition graphics; the second is the possibility of challenging players from all over the world using matchmaking, an option that appeared for the first time for this game despite the appearances on Xbox, PlayStation 2 and Gamecube. For those unfamiliar with Soul Calibur 2, it is good to specify some aspects starting from the gameplay. This second chapter, as already mentioned, represented a real ~evolution~ for fighting games in general, clearing them to the general public thanks to various factors such as immediate playability, simple to manage but at the same time profound for enthusiasts, a set of truly memorable and well characterized characters, and last - but not least - a look that still today, ten years later, still has a good impact (and imagine what it could have been at the time). The only criticism that could be made of this sacred monster is that it is essentially a ~more of the same~ of its prequel without too many innovations. But how can you create another masterpiece, if not by refining what has already been done? Soul Calibur 2 has more characters, more moves, more animations and options, while not representing a decisive step forward in gameplay or even in general glance compared to the first. But this, we repeat, is the only real limitation that could be applied to a game that is already perfect in itself. Soul Calibur 2 HD Online, which arrived many years later, is instead the demonstration of how that perfection still has room for improvement, adding decisive and decisive improvements to a mature, complete, multi-faceted game structure with a unique gameplay. Vocabulary In the Maestro D'armi mode there is a small bug which, while absolutely not affecting either the progression in the game or the playability of the title itself, could create some discomfort for less savvy players. During the long tutorial, the text on the screen erroneously shows the keys to press, effectively inverting the ~A~ and ~B~ keys with ~X~ and ~Y~, and giving the backbones an absolutely fictitious name. Let's try to clarify. In Soul Calibur 2 HD Online, if you read ~A~ you must press ~X~ (and vice versa), if you read ~B~ you must press ~Y~ (and vice versa), if you read ~K~ you must press ~B~, if you read ~G~ you have to press ~LB~. A simple patch should fix the problem quickly, either way. Xbox 360 goals The HD version of Soul Calibur 2 offers 30 achievements to unlock and adds 400 points to the gamerscore: it won't be child's play. A third of the achievements come from the single player, another from the multiplayer and finally the rest is obtained by progressing in the Mestro d'Armi mode. No particularly arduous actions, but great consistency in the game is required to fulfill some objectives (finishing the game with all characters and unlocking all weapons, for example). The legend will never die! The epic character of Soul Calibur 2 HD Online is one of the major leitmotifs of the series. Thanks to a top-level sound accompaniment, with music halfway between medieval and fantasy, those well-designed landscapes and game arenas are highlighted, rich in background elements, weather effects, full of animations,with a look in bright colors but never tacky. It is the perfect mix of design, graphics, audio, elements that frame an almost perfect and flawless gameplay. For all fans we must point out that the Japanese voices have been cut in favor of the American edition, much worse and less captivating. The gameplay of Soul Calibur 2 HD Online is fast, frantic and instinctive for everyone, but also reasoned and tactical for a few. Like any self-respecting great game, this one too has a deep but not impossible to master, fast but not confusing gameplay. The key point that supports the whole structure are the animations, absolutely out of parameters today, and the function that these perform in the execution of combos and moves that follow one another during the match, one after the other, without interruption. Timing is fundamental, as the game hinges on moves, counter moves, holds and revolves around an absolute reactivity of our inputs with impeccable collisions, as well as all the great beat'em ups that respect each other. Soul Calibur 2 redefines the ~weapon based~ genre, as well as the game in general, thanks to its perfection of controls and a practically absent lag. The heart of the game is obviously the multiplayer in all its forms, including the brand new online mode, but Soul Calibur 2 HD Online manages to entertain us even without a friend by our side thanks to the now famous Weapon Master mode. It is, in essence, a real adventure in which to face a series of increasingly demanding challenges. You travel through a map moving from one place to another while the events are well narrated on the screen, with missions that are increasingly complex and exciting each time. The latter obviously take advantage of pre-existing sets and characters in the game, but the developers had the intelligence to recycle each element by creating original and very different missions. For example, there are stages where enemies arrive continuously, or levels that sink into quicksand and still settings magnetized by strong winds that sweep us away while we fight. The story revolves around the search for the mythological Soul Edge, a panacea for all ills that all the characters hunt down. The latter are still absolutely memorable today and look incredibly detailed, different from each other. Mitsurugi's sword, Sophia's skirt, Cervantes' daggers and Ivy's eyes are elements that remain etched in the memory of those who have played with it and those who will play with it for a long time. One of the strengths of Soul Calibur 2 HD Online is precisely the variety of fighters (and at the same time the absolute balance), with new recruits such as Yunsung, Cassandra, the Necrid designed by Todd McFarlane and, as extra characters, Heihachi and Spawn, which were included in the respective editions for PlayStation 2 and Xbox. Instead, Link is missing, which was the prerogative of the GameCube edition for obvious rights reasons. Unlike the first Soul Calibur, also released digitally, we point out that this time (fortunately) there are no annoying sidebars but that the game has been totally adapted both in graphics and in 16:9 format at 1080p. For the single player sector, in addition to Maestro D'Armi we can choose between the inevitable Training, Survival, Time Challenge and Team Combat sections. The game does not suffer from particular bugs or problems apart from the one reported in the relative box, but some freezes were sporadically encountered during some tricks and moves, still images of a fraction of a second as inexplicable as laughable, even if probably due to the ~unblocking ~ of virtual rewards when we perform what is required by the game. That said, for the record, we close by recommending Soul Calibur 2 HD Online to any fan of fighting games and more, finding ourselves faced with a milestone of the genre and moreover in a truly dazzling form. Not to be missed. The relatively too high cost of this digital edition weighs in the final calculation of the assignment of the grade.", "date": "2013-11-25", "grade": "8.5"}