{"name": "LEGO Marvel Super Heroes", "ref": "https://multiplayer.it/recensioni/125732-lego-marvel-super-heroes-un-mattoncino-per-wolverine.html", "text": "The unmissable annual appointment with the ~LEGO games~ of TT Games this time could be defined as even more surprising than usual. After LEGO The Lord of the Rings, and waiting for LEGO Teenage Ninja Turtles or LEGO The Hobbit, the guys from the Maidenhead software house have targeted the Marvel universe, both comics and - above all - cinematographic, in what has been revealed without a shadow of a doubt their most ambitious project. In recent years we have carefully followed the evolution of a brand that within a couple of editions seemed to have nothing more to say and which instead, version after version, has continuously enriched itself with new ideas and mechanics that have embellished the concept without ever betraying or distorting it. We anticipate that, once again, deja vu is always around the corner, but if you are a fan of TT Games' ~LEGO games~ by now you should have gotten used to it and this certainly won't be stopping you from exploring New York together to the Avengers, the X-Men and their friends and foes. Playstation 3 trophies To win the thirty-eight bronze, four silver and three gold trophies offered by LEGO Marvel Super Heroes, players will have to - among other things - complete the various levels, find all the characters and all the hidden objects and collect bricks galore. Only then will the platinum trophy unlock. From big bricks... A few lines further up we have already introduced two important concepts on which this LEGO Marvel Super Heroes is based: ambition and evolution. They go hand in hand, in this case, because the latest effort from TT Games clearly draws heavily on its long experience with ~LEGO games~ and, at the same time, proposes something completely new that will challenge the opinion of the players, tracing probably the future of the franchise. The ~LEGO games~ began as pure and simple parodies of famous sagas such as Star Wars or Indiana Jones, when the stories we all knew were told in the form of silent interludes where the animations and expressions of the LEGO ~minifigs~ made sense to each other. Gradually, these interludes became more and more sophisticated, until TT Games began to dub them. In LEGO The Lord of the Rings, on the contrary, he had done even more, proposing the jokes as such from the Peter Jackson film trilogy. And that had been simple: there was already a script to work on, adding a few gags here and there without breaking it down too much. In LEGO Marvel Super Heroes, however, TT Games has put itself to the test, proposing a completely new story, told through fully voiced interludes and set in a Marvel universe specially conceived for the occasion. And it is a universe that mixes the main heroes and villains of the House of Ideas, taken a little from comics and a little from the movies, to build a plot that does not rely on any precedent. Doctor Doom has kidnapped the Silver Surfer and set his sights on the Cosmic Bricks his board was made of and which have scattered across the world; in order to find them, the good Victor assembles a team of super villains that includes, among others, the Goblin, Doctor Octopus, Loki and Magneto. The superheroes will therefore find themselves investigating the strange behavior of their enemies and then fighting to recover the Cosmic Bricks before them. Despite the inevitable gags and several witty jokes, the story of LEGO Marvel Super Heroes tries to take itself perhaps too seriously, and thanks to good direction and a great variety of settings - which include, in addition to New York and its surroundings, also scenarios like Asgard or Latveria - manages to be interesting and enjoyable from start to finish, offering that little bit more than the usual LEGO parodies that makes it a different experience than usual. TT Games, then, made a lot of leverage on Marvel (and Disney) film productions by recruiting not only the voice of Clark Gregg - who returns to play agent Phil Coulson - but also the mannerisms and the ~feeling~ between the characters it established itself in the films, although without establishing a precise connection between this universe and the cinematic one. And therefore Hawkeye and the Black Widow have the same friendship / camaraderie seen in The Avengers, Spider-Man's jokes refer to the reboot with Andrew Garfield, Nick Fury is represented in his ~Samuel L. Jackson version~ and etc. New York is dotted with billboards depicting the LEGO version of the posters of recent films: the one for Thor: The Dark World in particular dominates, released in theaters coincidentally in this period, while the Stark Tower towers over the city along with the Baxter Building. Despite these details, LEGO Marvel Heroes is an absolute delight for the most die-hard fans of the House of Ideas; draw heavily in more than fifty years of comic stories proposing enemies, costumes and situations that the nerds will recognize with a smile, from Jim Lee's X-Men to absolutely niche characters like Squirrel Girl and the Scarab. All rigorously made of cubes and bricks. LEGO Marvel Super Heroes is TT Games' most successful game, a real treat for Marvel fans Walking around the big apple Staying on the subject of quotes, details and research, the guys from TT Games undoubtedly deserve a big round of applause for the care they have placed in the creation of the various characters and their animations. Not only are the textures that depict the details of the ~minifigs~ very accurate and full of details, but the various animations are the real protagonists: in addition to being numerous and very fluid, when possible official sources have been respected to give the various heroes and to their enemies greater personality. Black Widow fights exactly like Scarlett Johansson in The Avengers and Iron Man 2, Hawkeye attacks in melee with the bow just like he did in that very short sequence against Natasha in The Avengers, Spider Man punches a bit like in the movies and a a bit like in Capcom fighting games... we get the idea. The 'minifigs' are voiced with ups and downs, but still include a huge cast as virtually every hero and villain has been voiced, even the sidekicks who meet for an optional mission and that's it. And the LEGO version of Stan Lee, practically omnipotent yet imprisoned in the most unthinkable places, is voiced by him himself, 'nuff said. The same could be said for the various areas in which the numerous levels of the game are set, even if in this case TT Games has indulged itself by proposing not only the scenarios of the films (just think of the Bifrost of Asgard) but also those of the multifaceted Marvel multiverse, with the Xavier School for Gifted Youth as it was many years ago in the stories of Earth-616, before Schisms and Utopias. Nerd language, pardon us. Let's go back down to earth, because if there is one scenario that connects the events and the various levels, it is certainly the one we all know, some up close and some from afar: New York City. TT Games has revived its own miniature version of the Big Apple based on its free-roaming experiments of LEGO Batman 2: DC Super Heroes and LEGO Lord of the Rings. After completing a couple of levels, you find yourself free to roam the city as one or more of the heroes unlocked so far; the reconstruction was carried out with moderate care, within the limits of the possibilities offered by the type of game, and in addition to the fictitious buildings of the Marvel universe, it is possible to recognize authentic ~landmarks~ such as Central Park or Chinatown. Furthermore, the city is teeming with life, with passers-by coming and going up and down the streets, taxis, helicopters and other vehicles always on the move. The idea is that of a miniature Grand Theft Auto, and it's even possible to steal a car and just wander around the streets. And frankly, Iron Man behind the wheel of a cab is an image that sticks around. As you beat the story levels, you also unlock other areas of New York, which grows bigger and bigger. The price to pay for this more ambitious than usual choice by TT Games is the even more evident presence of bugs and glitches, framed by a not particularly brilliant technical picture. Mind you, New York in its combination of realistic elements and LEGO bricks is splendid and the care taken in the creation of the levels is definitely over the top, but the strong aliasing and the fluctuating resolution of the textures make the images rather mixed, especially in the sequences of more excited action. Furthermore, in those cases, extremely annoying drops in frame rate take over: in reality, the deterioration is minimal, but so frequent that it does not go unnoticed. Perhaps precisely because of the greater graphic complexity, and the dozens of pieces into which everything that is destroyed is broken down, generating quite a few moving elements on the screen at the same time, TT Games has not managed to stabilize performances that we hope will be more satisfactory at least in the forthcoming next gen version. Super heroes with super problems Obviously TT Games has not miniaturized a LEGO version of New York for beauty, but to fill it with secondary activities with which to entertain players between one level and another. Mission accomplished: in certain moments it was even more fun to walk around thein the Big Apple rather than face a new level. It's a real shame, from this point of view, that sometimes the control system betrays the good intentions of the English developer, often forcing us to get by with the multiple functions - sometimes even conflicting - entrusted to the various keys. Once you get comfortable with the controls, you can finally appreciate the variety of challenges and content that are literally around every corner. From racing against the clock to finding Golden Bricks and other hidden collectibles that often require a bit of platforming skill, New York is full of surprises. In most cases there will be a citizen, or even a super hero, who needs our help: for him we may have to defeat a gang of criminals or recover a van with his pizzas, and in return we will receive bricks or even the ability to control the hero or villain who tasked us. Other times the objectives will be less clear, and to solve some puzzles it will be necessary to use very specific powers or abilities, such as the Hulk's punches that break through the cracked surfaces or Hawkeye's explosive arrows that blow up the silver bricks. LEGO Marvel Super Heroes, moreover, does not deviate too much from the tradition, and once again offers a mixture of platform, action and puzzle based on the peculiar abilities of the various characters. That's why it's possible to replay a level with heroes other than those initially proposed: in that way it will be possible to access new areas and secrets, as long as the character with the right super power has been chosen. There aren't many skills, but TT Games had the excellent intuition of combining different types of them in different characters, thus guaranteeing an excellent variety in terms of cast. Some, however, seemed particularly original to us, while others are a little less successful and still others are the usual ones already seen in previous ~LEGO games~. The levels, on the other hand, are a real concentration of puzzles, often interspersed with action moments in which the player has to beat up dozens of enemies: once again you don't die, there is no Game Over, and at most you only lose collected bricks. The experience is therefore pleasant and never frustrating, even if we often happened to freeze for perhaps a little more than necessary in front of some rather too cryptic enigma that could probably challenge a younger and less coached. Two brains are better than one, in those cases, and in fact LEGO Marvel Super Heroes also supports local multiplayer via split-screen. Nothing online, as usual: by now we have put a cross on it.", "date": "2013-11-22", "grade": "8.9"}