{"name": "Quale futuro per SimCity?", "ref": "https://multiplayer.it/recensioni/125722-simcity-citta-del-futuro-quale-futuro-per-simcity.html", "text": "By now several months ago we left SimCity in the balance: during the review we appreciated the effort made to give new life, both in terms of play and technology, to a historical brand of PC gaming, underlining however that it should have been the first step of a more ambitious and long-term path. A necessary evolution for a title that made the online multiplayer component and its community the two cornerstones on which to base an experience capable of entertaining for a long time. Almost a year later, the Californian developer has indeed corrected many of the bugs of the first version, but we feel like saying that he has not kept up with the expectations in terms of post-launch content support, limiting himself to releasing some updates, some paid downloadable packages and little more. SimCity: City of the Future, sold for around thirty euros in a digital and packaged version, intends to take up this discourse left half-finished, to definitively evolve the gaming experience. Unfortunately only partially successful. SimCity: Cities of the Future brings sci-fi scenarios to the Maxis simulation smart cities Installing SimCity: City of the Future opens the doors of its urban centers to a very rapid technological growth that upsets its face. Adopting the buildings of the Academy, the first new specialization, means embracing the idea of a sustainable and clean future: the structures that function, fully automated, under the ControNet network help the mayor to clean up the city from waste, extract more efficiently water, develop technologies aimed at maintaining environmental balance and produce energy in full respect of the surrounding ecosystem. The mega corporation OmegaCo, on the contrary, has created a system to work fossil resources in a super efficient way, guaranteeing stellar profits but corrupting the environment and those who live there. In a short time the OmegaCo brand spreads to the factories and commercial activities of the area, making the new landscape uniform. The transformation, especially the aesthetic one, of the map is one of the aspects that most convinces us: Accademia and OmegaCo perhaps embody two overused stereotypes of science fiction, two possible sides of the coin that do not involve nuances, but to see the streets and buildings change before our eyes is spectacular and Maxis has created a large number of new models and surfaces to adorn views worthy of the best sci-fi films, without denying the graphic style of SimCity. The same goes for Mega Towers, the third weight addition in the pack. These are huge buildings that force a radical change in the geometries of inhabited centres. Each tower can have up to eight floors, each of which is reserved for homes, commercial activities, offices and services. As if they were small cities themselves, these buildings should be considered a response to those who complained about the size of the maps - which also remains unchanged in the City of the Future - and represent a welcome variant to the horizontal urban development of the game. Looking for a challenge Although the three new specializations - and all their implications on the pre-existing ones and on the other game systems - are a fairly full-bodied addition in terms of possible options to have fun with, playing there is the feeling that the challenge does not come at all or almost affected by the news. Of course, building these huge futuristic structures has a cost and bankruptcy is a possibility if you don't pay a little attention, but the enormous progress to which cities are subjected does not require an equivalent administrative effort and the risk is that get tired soon. For a game that suffered from a certain lack of depth from the outset, especially when compared to its illustrious predecessors, we would have expected Maxis to want to appeal to fans by taking a partial step back, abandoning the immediacy that distinguished, even positively, SimCity coming out and trying to complicate our lives a bit. In the same way, we would have liked even more advanced multiplayer game options, which could fully express the (almost) mass online game potential that the original vision envisaged. Instead we found ourselves with a sandbox full of buildings and systems to interact with, perfect for spending hours watching the city grow and proliferate, but which doesn't invite you to go into who knows what in-depth study. The price of thirty euros, certainly not a few considering that the basic package is sold for the same amount on Origin, is another reason for perplexity that certainly does not encourage an impulsive purchase. In short, whoever liked the carefree and fun nature of SimCity, linked to the'excellent visual component and some playful aspects objectively well done, can take into consideration the purchase of Citt del Futuro. Those who, on the other hand, remained at the window waiting for a simulation breakthrough, or simply expect a large contribution in terms of depth of experience from a similar additional content, better wait for the next opportunity.", "date": "2013-11-21", "grade": null}