{"name": "Superbike", "ref": "https://multiplayer.it/recensioni/125603-lococycle-superbike.html", "text": "The life of a mechanic is really tough. Every day in the workshop you have to deal with heavy tools, handle greasy parts, work in awkward positions, and it's not uncommon to cut, scratch or burn yourself while working. It can even happen to get entangled in a futuristic talking motorcycle, to be dragged for hundreds of kilometers while helicopters and battleships try to blow it up with missiles. What is called a bad day, in short. This is what happens to the protagonist of LocoCycle, the new and funny arcade made for Xbox One by Twisted Pixel, after the acquisition by Microsoft and the attempt to exploit Kinect with The Gunstringer. The formula is the one that the Texan team has been carrying on since the days of The Maw and 'Splosion Man: extremely simple gameplay ideas seasoned with an avalanche of humour. Too bad that this time there is some badly oiled gear. LocoCycle's comedy and personality are not enough to hide a monotonous gameplay Motos Rancheros Anyone who has played the final lines of The Gunstringer knows how crazy and over the top the live action movies made by Twisted Pixel can be. Well, in LocoCycle the developer from Austin went crazy, filming a sort of small B-movie for the most important interlude sequences. The same premise is told through several minutes in which flesh-and-blood actors recite a script overflowing with comedy. During a secret meeting, a military arms manufacturer called Big Arms is introducing some buyers to I.R.I.S. and SPIKE, two motorcycles armed to the teeth and equipped with an artificial intelligence in full KITT style (complete with a sliding light on the nose). Too bad that I.R.I.S. decides to sneak away in an attempt to participate in a rally event in the city of Scottsburg, dragging (literally) with him the unfortunate Pablo, the Mexican mechanic who got stuck on the bike while making repairs. Thus begins a crazy journey, with the Big Arms units trying in every way to eliminate the unlikely duo while Pablo tries to free himself, in a way as desperate as it is useless. After such a crazy incipit we find ourselves in front of an arcade game very similar to the classic Spy Hunter: driving this futuristic two-wheeler, the player darts at full speed along a completely linear path full of enemies. Going off the track is impossible, so the only real concern is avoiding the other cars, dodging incoming shots and knocking out. all the enemies who relentlessly try to stop I.R.I.S. and Pablo. The particularity of LocoCycle lies precisely in the combat system, since if the firearms clearly recall Spy Hunter, the hand-to-hand combat against flying opponents is much more interesting: just press a button and, like a Transformer, the bike takes on a shape humanoid and begins to attack with kicks and punches. The developers' intentions were to insert a system that was intuitive, based on timing but which did not interrupt the flow of the action, and from this point of view the inspiration for the attack and counterattack system of Batman: Arkham Asylum is evident. The strength of the blows, the duration of the combos and the number of enemies that can be faced at the same time are then among the characteristics that it is possible to enhance between one level and another by spending the accumulated money. Unfortunately, everything is resolved in continuous ~button mashing~ sequences, although those looking for the perfect score must be careful not to interrupt the attack combos, switching from one enemy to another and blocking incoming shots in time. Also in this case the humor is not lacking, and one cannot fail to feel a minimum of tenderness for Pablo as he is thrown like a boomerang and thrown at enemies like a riding crop. Too bad that the comedy of the co-protagonist is not enough to make interesting a gameplay that withers after just a few levels, thus confirming the fear that had arisen last June, when we played LocoCycle for the first time at E3 in Los Angeles. It must be said that the developers have also tried to go a little off the rails by inserting a few minigames here and there, but more often than not these are unfunny or too frequently recycled sequences, not to mention the abuse of QTE to interact in the most choreographic. The complete lack of inspiration of the environments and backdrops does not help, ranging from an anonymous desert to a desolate highway, passing through a banal military base and the waves of an ocean. The flavor and liveliness of Ms. Splosion Man and The Gunstringer seem like a distant memory, and despite thegame you speed at 60 frames and at 1080p, it is clear that Twisted Pixel has not had enough time to adapt its proprietary engine, the BEARD, to the new generation. That LocoCycle was actually born as a Live Arcade for Xbox 360 can be seen in the bare backdrops, in the low-detail scenario and in the fact that almost none of the new Xbox One functions are used. However, it cannot be said that the new Twisted Pixel game has no personality: although Pablo's Spanish (played by actor Freddy Rodriguez) often forces you to watch the subtitles if you don't want to miss a few jokes, the cutscenes and the dialogues nonsense have amused us on several occasions. Which, however, does nothing but highlight how much this time the humor and the filmed sequences serve more to mask a monotonous gameplay rather than enrich one that is already fun in itself.", "date": "2013-11-18", "grade": "6.0"}