{"name": "Draghi dal Giappone", "ref": "https://multiplayer.it/recensioni/125617-crimson-dragon-draghi-dal-giappone.html", "text": "Strange as it may seem, Crimson Dragon shared the same fate as Ryse: Son of Rome. Both, in fact, were born as Kinect games on Xbox 360 and then became two of the Xbox One launch titles that use Kinect only marginally. However, the production quality is very different and where Ryse has become a triple A that pushes Xbox One also and above all from a technical point of view, Crimson Dragon limits itself to coming out among the titles in digital delivery, bringing to an evidently current gen structure a higher resolution and some light effect. The game deserves all the attention possible, however, because it is the result of the work of what remains of Team Andromeda, or that group of programmers who had given life to the Panzer Dragoon saga, one of the most famous and loved shooters in the history of Sega Saturn, then resulted in the first Xbox with the excellent Orta. Crimson Dragon's dragons fly less high than we would have hoped What remains of the 90s The mechanics of Crimson Dragon are the same as the games of which it is the ideal successor with the player riding a dragon and traveling a series of environments on tracks, having only the ability to move around the screen and direct the shots that come from the jaws of the animal. The story is absolutely specious and is told only through a narrative voice on two-dimensional animated screens with artwork or through a series of dialogues with the characters of the army who are trying to eradicate an epidemic that is spreading on the planet Draco, in via of colonization. There are no computer graphics scenes, but not even with the game engine, making it clear that the core of everything is the actual gameplay, which is, as mentioned, very similar to the originals, but which differs in some very important points. Each level is divided into several phases, the sections in which the enemies that gradually appear on the screen are eliminated, those in which you have to collect power ups that give credits and objects and the boss fights. At the end of a level, a summary tells us how many credits we have accumulated, which powers we can activate and the antibodies that are needed to have access to subsequent missions in areas where our dragon cannot fly at first. Between one mission and another, you go to the management part, very complex, with which you can feed the dragon to make it level up, you can give it new skills, you can make it evolve to a higher species, returning it to the first level, or you can change its alignment with respect to one of the earth elements. There are two dragons to choose from, but you can buy more, depending on your playstyle of course. In the store you can then buy packages of objects for the dragon, gems that allow you to continue playing when you die and those that are needed for evolution, you do it using the credits won in the game, there are no microtransactions whatsoever. This tells us a lot about the structure of the levels which are a series of short missions, which divide the same environments, to be repeated to collect what is needed to upgrade the dragon and move forward in the game. The system works, considering that there are additions such as the possibility of carrying around another dragon which acts as a companion and which can be positioned in front of or behind us and with which attacks can be made in combo. Among other things, having friends in the list who are playing with Crimson Dragon, their dragon can be purchased, always with credits, and used in your campaign. The problem is that the lean structure and the levels, evidently designed to be played multiple times to accumulate experience and credits, almost completely disperse the epicness that one would expect from this game, which lacks unforgettable battles, more structured levels, repeating the sensation that was felt by playing the mobile version developed a year ago, again by the same team. Forests, lakes and caves are bare and the thrills of playing Panzer Dragoon here are just a memory. Even from a technical point of view, little, if anything, has been done for the transition to Xbox One with levels and settings that obviously have a detail designed for another hardware, helped only by 1080p, high resolution and some effects of light that certainly go away more smoothly here, but other than that there is very little else.", "date": "2013-11-18", "grade": "7.0"}