{"name": "La battaglia dei pianeti", "ref": "https://multiplayer.it/recensioni/125570-battle-worlds-kronos-la-battaglia-dei-pianeti.html", "text": "Reimagining turn-based strategy: this was King Art Games' intention when the Kickstarter campaign was born to finance the development of Battle Worlds: Kronos. The operation ended successfully, raising over 260,000 dollars compared to an initial goal of 120,000, and the game landed on Steam a few days ago, actually at a not very accessible price (29.99 euros). Inspired by classics such as Advance Wars and Panzer General, this production certainly does not skimp on numbers, offering us two distinct single player campaigns (the second is unlocked only after completing the first) for a total of thirteen missions, a challenge mode always in single player, an editor to create our maps and finally an online multiplayer capable of working both ~live~ and in asynchronous mode, designed for users who really want to take all the time necessary to make their move and then pass the ball to the opponent. Some cutscenes (dubbed into Italian) act as an introduction and have the task of connecting the in-game action with the developments of the plot, unfortunately not very original, which sees us engaged in a war for control of habitable planets around the galaxy . In the narrated sequences we have recognized what is actually the spirit of the game, in a sort of metaphor about battles and the warriors who fight them. The developers simply wondered how an ~old school~ strategy would be received today, one of those who really do not forgive. And how did we welcome it? Battle Worlds: Kronos is an ~old school~ strategy game, substantial but decidedly ill-balanced Smash our faces Battle Worlds: Kronos tries to carry out the ~tutorial~ practice by accompanying us by the hand in the first moves, showing us how to manage the available units and warning us to pay close attention to their specific characteristics, because they can make the difference between victory and defeat. A few minutes later it becomes clear, yet we are still on the first mission. The enemy troops are very numerous and they don't go into subtlety, on the contrary they load our vehicles like madmen until they break them to pieces. The only way to win is to try to get to the physical confrontation always in numerical superiority and using resources intelligently. Tanks can only attack from a ~square~ adjacent to that of the target and have reasonably strong armour, so those have to keep going. Behind them we can place the jeeps, which are equipped with rocket launchers that work remotely or, even better, the vehicles equipped with missile batteries that reach even further. The point, in short, is to create a ~column~ of units that can concentrate fire on the enemy and which, preferably, do a certain amount of damage. It seems simple on paper, but in reality it is not at all and the hypothetical thirty hours of the campaign (which will be further fleshed out thanks to the next release of a free DLC with other missions) can become many more, where the need to repeat an internship over and over again until it was solved. We don't know who used this expression, but it's true: playing Battle Worlds: Kronos is like playing a game of chess. With Kasparov, though. What is there and what is missing After taking quite a few releases, despite the presence of quick saves and quick loads that can help us establish strategic points to resume a mission before things fall apart, some doubts arise about the work done by King Art Games. Confronting such a difficult strategic game can in fact represent a highly enjoyable challenge for fanatics of the genre, but it inevitably cuts off all the others, and abruptly. There is only one level of challenge available and the feeling is that rather than taking care of the artificial intelligence of the enemies, it was preferred to dramatically pump their number, simply ordering them to attack anyone who approaches, with the usual focus on the pawns they already have lost some energy. It is not a problem to accept defeat, where it is possible to start over and understand how to move, which groups of enemies to attack first and which ones to avoid (but often and willingly it is not possible to do it, it is necessary to destroy any hostile unit). The point is that all of this is rendered too slowly and cumbersome, with the games going on for hours, and neither the interface nor the options help in this sense. Yes, there is the traditional button that speeds up the enemy's operations, but the controls for moving and attacking take inputs with an unbearable delay, forcing us to wait every time the manova is completed; without however being able to cancel it in case of error, since there is no ~undo~ button. Graphics and sound are perfectly anonymous, both in terms of general design and animations, but at least this ensures that the game runs at its maximum even on low-end configurations.", "date": "2013-11-16", "grade": "6.5"}