{"name": "Ricomincio da Link", "ref": "https://multiplayer.it/recensioni/125491-the-legend-of-zelda-a-link-between-worlds-ricomincio-da-link.html", "text": "The Legend of Zelda: A Link to the Past represents one of the seminal titles in the history of video games, a turning point for the entire industry, a masterpiece of game design as well as the pinnacle of the series in the two-dimensional arena. At the same time, however, A Link to The Past has written down the fundamental points of a game formula which, in fact, has traveled over 20 years through countless sequels without substantial variations; a factor this which, although it has delivered to the history books a series of titles that have practically formed entire generations of players, on the other hand it has inevitably led to a probably excessive calcification of the franchise. The full awareness of the need for a renewal is now fully established even at the top levels of Nintendo, starting with the producer Eiji Aonuma who has often indicated in the future and so far completely mysterious chapter for Wii U as that turning point from which to start building Zelda's new life. Yet you don't need to wait that long to start appreciating changes in the classic formula of Link's adventures; yes because, in a far from expected way, it is from this new episode for Nintendo 3DS that the Kyoto house has chosen to demonstrate how ferment and innovation are not irreconcilable terms with the events that take place in the kingdom of Hyrule. A Link to the Past? To claim that a reference game like The Legend of Zelda: A Link Between Worlds is a source of renewal for the franchise might seem like something of a joke; on the other hand, since its announcement, this unpublished episode for the Nintendo portable has done nothing to hide the more than obvious references to the Super Nintendo masterpiece we mentioned earlier. And yet, believe it or not, despite the fact that we are talking about an absolutely and totally recognizable chapter both in appearance and in gameplay, A Link Between Worlds is a courageous example of how the brand can still have a lot to say without losing even a shred of own identity. And it is appropriate to thank the existence of Nintendo 3DS, an environment in which mixing the cards of a much loved title is possible and not too risky. And so here is the team led by Aonuma and directed by Hiromasa Shikata has managed to give life to one of the most interesting Zeldas of recent years, an episode that - after a couple of hours of initial bewilderment - puts it into high gear for the whole time until the end credits. However, let's start by saying that the plot is certainly not where the designers have chosen to concentrate their efforts, on the contrary it probably represents the only real weak point of the whole package: we are in fact once again in the context of a Link who discovers himself as a hero in the moment in which Princess Zelda is kidnapped and transformed into a painting, together with seven wise men, by the evil of the moment called Yuga. Unfortunately, however, the characters turn out to be stereotyped, not very incisive and poorly characterized; during the entire adventure the narration almost always remains on a secondary level, barely hinted at, with no dialogues or cutscenes of particular importance except for a couple of key moments necessary to justify the hero's actions. In this sense, if it is therefore true that Nintendo probably could and should have done something more, it is equally true that in fact the entire attention of playing is rather naturally directed towards the gameplay and the mechanics offered. In fact, it is enough to pass the prologue to come into possession of Link's main ability in this chapter, or precisely the ability to transform himself into a stylized portrait of him on walls or walls simply by pressing A near them. The beauty is that then, in the form of a drawing, one can move along this surface, on a purely two-dimensional plane. A spell, which in practical terms opens the door to a multitude of applications within every environment and situation of the entire story. Is there just a crack between one room and another? Not bad, just enter the wall to go through it. Or does that platform seem unreachable? Maybe you can get there by walking along the wall from the opposite side of the room. It goes without saying that the level design has been finely and perfectly studied to make the most of this ability, and there is very little to say about this aspect: Nintendo remains one of the best developers, if not the best ever, when it comes to to make all the pieces fit together giving an unassailable continuity and coherence. And in the specific case of The Legend of Zelda: A Link Between Worlds the result is truly exceptional. The Legend of Zelda: A LinkBetween Worlds is an extraordinary chapter between tradition and novelty First money and then health It is not necessary to wait too long to find out that also in this chapter, as well as in A Link to the Past, the main narrative device is supported by the existence of two parallel worlds, namely the sunny and colorful Hyrule and the gloomy and gloomy Lorule. In fact, the two kingdoms mirror each other on a geographical level, even if in reality there are many differences: to be clear, the forest, the mountains, the lake and the castle, for example, are in the same place in both cases, but only visiting them you can realize that what they contain is actually almost completely different. However, the citation of the Super Nintendo masterpiece does not stop here, because it is the game map itself that bears witness to a high similarity with the places visited at the time, to the point of triggering an immediate nostalgia effect in any self-respecting fan of the series. But we were talking about the two worlds; Link can in fact pass easily between one and the other, always through the power of transforming himself into a painting, thanks to what are in fact portals, represented by dark fissures on the walls in different areas scattered a bit everywhere. And the continuous journey between Hyrule and Lorule is a key aspect, because the possibility of reaching otherwise inaccessible areas in one or the other kingdom is based on it. Although it may initially appear a bit alienating, in reality the balance and continuity of A Link Between Worlds always remains firmly standing, to the point that we have never found ourselves blocked or without clues on how to proceed. Even if this happens anyway, the team has come up with an intelligent solution: by putting on a pair of magic glasses, you can come across friendly ghosts next to the individual puzzles, called Fantaiuto, who, for the cost of a StreetPass token, can give you a valuable suggestion on how to continue . But what is probably the biggest break with the past is to be found in the management of objects, which for the first time is almost completely unrelated to their discovery within dungeons. And we will tell you more: after a very short time it will be possible to have practically all the various boomerangs, bows, bombs, hammers, grappling hooks and so on in your inventory, without having to submit to the now classic ~timing~ imposed by the previous chapters of the series. In fact, this time things are different, because the merchant Lavio will settle in Link's house with what is in fact a shop in which to rent and buy the tools to be able to face the adventure. Let's talk about rental, yes; at the cost of a rather reasonable handful of rupees (50-100) you can in fact borrow any object, and take it with you freely anywhere... but with a limitation. In fact, in the event of death, everything that was rented will be lost and brought back to Lavio's shop, thus requiring a new expense to be able to get it back. Later in the game, the possibility also appears to buy any object definitively, avoiding the above problem, but in this case the figures start to rise a lot (800-1200). What may seem like a simple expedient actually constitutes a turning point of extraordinary importance and effectiveness for the very way in which a Zelda is tackled: said goodbye to the rhythm marked by dungeon - object - dungeon, in an imposed linearity and impassable, now on the contrary the player is faced with an almost unprecedented freedom for the series, strengthened by a range of possibilities and skills that immediately put very few limits on what can or cannot be done. Although there are still a handful of objects to be recovered in specific moments of the adventure, the solution adopted by Nintendo in A Link Between Worlds maintains an extraordinary strength and incisiveness, which is simultaneously supported by an equally impeccable quality and solidity of the level design. Obviously, as a result, the economic aspect, the collection of rupees, also assumes a very significant importance, which on the contrary in the past has almost always been a very little developed element; in this case, however, every rupee counts, and for this reason there are no limits to the capacity of one's purse right from the start. Having such an economic priority in a Zelda is something completely new, and really fun. The 3D effect As mentioned in the text of the review, the three-dimensional effect in A Link Between Worlds performs perfectly, adding an element of depth without ever feeling intrusive or annoying. Even in some situations then, the characteristic tipica of Nintendo 3DS is also useful for gameplay purposes, providing a better assessment of the distance between platforms placed on different levels. In short, the advice is to play with the lever on ON. The princess is in another castle Removing the ~prize~ of the object to be obtained within a dungeon could lead to believe that the exploration of the same loses its value and importance. If it is undoubtedly true that A Link Between Worlds lacks that gratification such as opening presents under the Christmas tree, nevertheless the stages of crossing what is now a cornerstone of Zelda have not suffered too much from the change of plans. And this above all thanks, also in this case, to a superfine design with no real weaknesses, with a great variety of puzzles but above all an absolutely perfect difficulty setting; in our experience we have never run into dead or frustrating points, but at the same time not even in sequences so easy to mortify the necessary need for a sufficient level of challenge. The dungeons are several, not very large but extremely dense, fun, rewarding and above all different from each other. The normal sense of dj-vu that is bound to touch the most expert connoisseurs of the franchise is never expressed in the guise of the recycling of ideas for its own sake, but rather in the necessary feeling of continuity and fidelity with the unique atmosphere of Zelda . Excellent work also with regard to the bosses, all quite interesting, even if perhaps a little easy and never of such a size as to enhance the epic nature of the clashes, as instead happened in the most recent chapters for home consoles. From a technical point of view, The Legend of Zelda: A Link Between Worlds continues to wink at the inspiration for the Super Nintendo by offering a practically identical view, a bird's eye view slightly inclined by a few degrees to guarantee the effect of depth. This is an absolutely ideal solution to support the ~classic~ gameplay formula of the series, and in fact there are never situations where you find yourself getting frustrated with the positioning of the camera; what is not seen, which is not framed, or has no value or is purposely hidden to arouse the player's exploration and curiosity. A case in point are the rupees or hearts drawn on the walls, which can only be seen and retrieved when you find yourself exploring that seemingly uninteresting wall in the form of a painting. Precisely because walking on the walls the point of view instantly passes parallel to Link, at the height of the ground, it is obvious that an entirely 3D graphics engine is necessary; and in fact A Link Between Worlds is based precisely on a very valid polygonal engine, so good as to make the typical angularities of a choice of this type almost disappear on hardware that is certainly not extraordinary like that of Nintendo 3DS, bringing the final result and feeling very close to that of A Link to the Past. A result of great quality therefore, with a good level of detail and convincing textures, and which never lends itself to uncertainties in the frame rate. The only note that we feel like moving, even though we realize that it is an element rather linked to personal tastes, lies in the character design characterized by a not particularly exciting style. But it really is the classic hair in the egg. On the other hand, the use of the three-dimensional effect is interesting, never invasive but well balanced and effective above all with some elements (see the flying hand in the Bosco d'Ossa) or in certain dungeons (as in Ruins of Ice) in which the positioning of the platforms on various levels of height is rendered perfectly by the peculiar feature of the Nintendo console. The orchestrated musical accompaniment is also extraordinary, which enhances the quantity and quality of the songs present; the times of MIDI are very far away, for sure, and for this reason the use of headphones is particularly recommended to better appreciate the work of Nintendo's musicians. The longevity is very good, which alongside a more than sufficient duration of the main adventure (the lack of a counter prevents us from giving a precise value, but we are still roughly around 10 hours going straight ahead) adds numerous and interesting quests secondary - such as the useful and fun collection of maimai - and various mini-games in which you can try to increase your loot of rupees. Finally, without forgetting the heroic mode, to be unlocked once the adventure is over.", "date": "2013-11-14", "grade": "9.5"}