{"name": "Dancing Stage Mario Mix", "ref": "https://multiplayer.it/recensioni/dancing-stage-mario-mix.html", "text": "Four simple directions Up, Down, Right and Left. The gameplay of each Dancing Stage is based on these four simple directions, and only these. Thinking of inventing a game with such a poor control base is difficult, but Konami has managed to invent a genre of its own, that of dance games. For years and years they have been raging in Japanese arcades, where dancers who have little to envy to those of MTV now move and dance at great speed and with enviable fluency. In Italy, as usual, we arrive a little later. But anyhow, now it's fashionable here too, especially among the very young. Nintendo was the only console that couldn't have a Dancing Stage title in its playground. Konami, in collaboration with the big N, has finally decided to dedicate an entirely exclusive chapter to GameCube, which features Mario and Luigi as protagonists, surrounded by many other characters from the Mariesco world. And it is precisely this framework that gives ~Dancing Stage Mario Mix~ a little story on which to justify and enrich the dance experience. Up, Down, Right and Left. The gameplay of each Dancing Stage is based on these four very simple directions Four simple directions It is in fact the only Dancing Stage with a storyline, albeit a simple one. The classic formula is the usual, this time also enriched by numerous mini-games that give a greater sense of completeness to the game. The keys to music are scattered across the realm, and with them the power of music. Our task will be to take them all back and bring them back, before Waluigi takes them over for his own evil purposes. This is the incipit that then connects each stage of the game, giving it a new conductive fabric for this type of game. Each stage is also linked by nice cut-scenes created with the game engine and featuring Kinopio and other Nintendo protagonists. The bundle for sale is very nice and colorful and obviously contains a blue carpet with the faces of Mario and Luigi. A great collector's item for any true Nintendo lover out there! It's a short step from psychedelic backgrounds to Super Mario mushrooms. The supplied mat is very robust and responds very well to stress. However, it is strongly recommended not to wear shoes during dance sessions because they could damage the sensors. Unfortunately it should be noted that Nintendo has not marketed this nice peripheral by itself, but it can only be found bundled with the game and the result is that it becomes really difficult to find a friend to play multiplayer. Double in a dance game, as we all imagine, gives longevity and challenge. The good news is that single player play has been heavily featured and enhanced with many subgames. single player play has been heavily featured and enhanced with many subgames It's a short step from psychedelic backgrounds to Super Mario mushrooms. The characterization is the Mariesca one: therefore via psychedelic backgrounds, via modern art, and space for the world of Mushrooms, Mario's castle and the Koopas. All of that is much more fun. The included side games are also very nice, and even if they don't represent the salt of the game, they are very welcome. In one, for example, we will be called upon to crush the Goombas' heads by literally jumping on them, just like Mario does in his adventures. In another one, however, we will have to run quickly on the mat, moving quickly from right to left to make Mario accelerate and make him jump as high as possible and grab the classic end-of-level flag. Konami's commitment to create an original game is all there, perhaps inspired by Nintendo itself. The painful notes. However, there is something that makes you smile much less than the Mushroom Kingdom and the nice protagonists of the game. In a music game like Dancing Stage we certainly expected a more satisfying song selection. The list of pop songs is insufficient, as is that of remixes of old Nintendo songs. And all this makes you particularly angry especially thinking about the vast collection available to work on. Dozens and dozens of songs could be inserted, from Metroid to F-Zero, from Zelda to Kirby, passing through all the adventures of Mario. Remixes of Super Mario Bros 2, Super Mario Bros 3 and Dr. Mario have been included in the game, and the list doesn't go much further. The feeling is what causes an excellent football team on the bench that makes room for perfect strangers. And when we talk about songs in a music game, we're talking about the gist of the game itself. Finally, another sore point is the calibration of the difficulty. On a normal level the game is annoyingly simple. And there is also to consider that theyours truly is not Michael Jackson on the mat. To have a satisfying sense of challenge it is advisable to set the fifth available level, the Super Hard. At max difficulty, Dancing Stage Mario Mix is ~normally~ difficult. Conversely, by setting the game to ~easy~, even our four-legged 1-year-old sister will be able to finish the game. Dancing Stage Mario Mix disappoints where it was meant to impress. A dance game must be addictive and must have good songs. Mario Mix has few songs, and those few aren't even exciting. Flaw in the multiplayer component because it is not possible to buy a mat separately, and although the two-player mode is foreseen, we will have to find a friend who has purchased the game. In the single player, however, the difficulty is set too low, perhaps to meet the needs of the little ones. The fact is that at the highest level the game will be enjoyable but not particularly challenging. On the other hand, Konami has pledged to embellish this Nintendo exclusive chapter with a story worthy of Mario and several ingenious and fun mini-games, two new factors for the series and for any dance game. A game of this type is always fun, and the judgment is therefore more than sufficient, even if the final grade could have been much higher with a few small adjustments. Pros: A new storyline for the series Cute and fun minigames Simple but addictive gameplay Cons: Too easy Poor quality and quantity in the music selection It is not possible to buy a mat separately Only in recent years, in Italy, have we witnessed the birth of that small mass phenomenon that once again comes from the Rising Sun: the proliferation of dance videogames in arcades. A genre that alone has had the merit of bringing many closer to cinemas, including those categories of people who had little to do with videogame entertainment, namely girls. And it is above all to them that we owe the fortune of the ~dance~ trend. Konami primarily invented and was able to ride the wave of fashion. And so Dancing Stage has even arrived on television, with the consequent driving effect given by massive advertising. By now everyone knows dance videogames, especially Konami ones, especially Dancing Stage. What happens if we combine this very popular genre with the most well-known video game character of all time?", "date": "2005-11-18", "grade": null}