{"name": "Resogun", "ref": "https://multiplayer.it/recensioni/125440-resogun-sparatutto-al-potere.html", "text": "The Housemarque are tough developers and they have shown it in each of their titles without perhaps having millionaire budgets available. The trademark for this developer's games has always been a perfect balance, pure fun and a great level of challenge. Super Stardust, according to the writer, was one of the few ~dual stick~ shooters able to rival and perhaps surpass milestones such as Geometry Wars; Outland, a beautifully immersive and stylish adventure; Dead Nation, an atmospheric shooter that has left its mark especially in co-op, to the point that its possible sequel is eagerly awaited by quite a few people. PlayStation 4 therefore could not fail to have a new title from this prolific developer at launch, and thanks to the fact that it will be present in the Instant Game Collection for PlayStation Plus owners, including those who sign up for the trial period, its access will be free for virtually everyone at the console launch stage. If we look at Resogun we think of Super Stardust as a typology: however, where the latter offers gameplay that extends around the rotation of a planet and therefore at three hundred and sixty degrees, Housemarque's new effort offers dynamics typical of horizontal scrolling shooters. On a complete X/Y axis though, because if the scenery still rotates around a central structure, the movements are vertical and horizontal in both directions. In this way the initial learning curve is immediate; in fact, one is immediately at ease with the controls but it is enough to advance within the same level, or choose a greater difficulty, to appreciate the depth of the mechanics of this game. Playstation 4 trophies Resogun offers 34 trophies, of which 5 are gold and 9 are silver. The most ~simple~ are obtained by completing the levels at various degrees of difficulty, the others by saving, for example, all the hostages, killing 100 enemies with the hyperdrive, 50 with a single acceleration and so on. The first 40% of trophies are obtained quite naturally, after that you have to build a deck like this to unlock platinum. Kaboom! Resogun is in fact the fair of explosions and chaos on the screen. Each object, adversary, element of the scenario is made up of so-called Voxels, small cubes with the most disparate colors which make the action even more frenetic and impactful; all set in 1080p resolution and at sixty frames per second. The graphics engine manages the construction of all worlds made of voxels in the same way as a LEGO model, each level can be defined as a cube made up of millions of other cubes that are practically sculpted. Each voxel features independent physics and lighting, and the amount of cubes you can destroy in a level ranges from 150,000 to 200,000. Not due to technical limitations, however, the developers have wisely decided to impose this limit to avoid problems of visibility or ~reading~ of the action, and we must say that the choice has proved to be spot on: during our many games we have always encountered the right compromise between chaos on the screen, visual beauty and level of challenge. But how does Resogun work? The title provides the classic arcade mode in which to face the five worlds available in sequence, the choice of the single level or the online cooperative. Once you have selected the ship from the three available, you are catapulted into the action. Left stick moves, right stick shoots in both horizontal directions. The first thing to do is obviously get rid of the more or less aggressive opponents that populate the screen, trying to keep the multiplier in order to get high scores. At each unspecified time interval, a series of green-lit opponents appear on the screen: they must be eliminated before they disappear to free the humans trapped in the appropriate cells. The next step is to ~collect~ the survivors and transport them to one of the two rescue platforms present, in order to obtain points, additional lives and even upgrades. In addition to the basic shot, in fact, with R2 it is possible to activate the classic ~smart bomb~ which invests the whole scenario through a spectacular graphic effect; its quantities are limited and it should only be used as a last resort. More useful for gameplay purposes are the bar dedicated to acceleration and that for hyperdrive: the first gives a sumptuous boost to your ship, which allows you to pass through enemies by destroying them as well as escape from chaotic situations. The hyperdrive recharges after a certain number of el opponentsiminati, slows down time and allows you to unleash an extremely powerful beam of horizontal energy. Dulcis in fundo, each level is divided into three phases of increasing difficulty and timed by a bar at the bottom of the screen: in the last one there is the fight with the boss, who must first be weakened by hitting his critical points, then eliminated aiming directly at the nucleus. This is Resogun, and as you'd expect from a Housemarque title what ~wins~ is the perfect balance of challenge, fun, and high score chasing. At first things seem simple, shortly after you literally have to ~dance~ between enemies using acceleration, without forgetting to rescue the hostages and keep the multiplier alive; all without ever feeling a sense of frustration thanks to the classic ~easy to learn, hard to master~. By choosing the highest difficulty levels (there are four, with the last one to be unlocked) it will be necessary to sweat the proverbial seven shirts not so much to advance to the end, as to get a decent score and constantly improve with each game. Beyond the search for the best score and the replayability of the worlds, to lengthen the longevity in any case there is also an online cooperative mode for two players. Why not also offline? It is easy to say, playing in more than one person, the ships can also be found in two completely opposite points of the map and therefore it would not be possible on the same screen: Housemarque stated that the split screen could have been an option, but the chaos generated it would hardly have been manageable without sacrificing fun and balance while playing. Chaos on the screen which, as mentioned, is engaging and never overwhelming, a psychedelic experience in which it is mesmerizing to see the scenario gradually crumble with the explosions of the cubes, and if we add to this the perfect response to the commands and the fluidity always exceptional, the result can only be high-profile. The soundtrack is perfectly in line with the graphics and a robotic female voice allows you to have the events at hand, indicating when a prisoner needs to be freed, what kind of bonus has been obtained and what upgrade is available. This way you can concentrate even better on the action and make all this chaotic goodness a little more controlled. One last gem that we have identified is the possibility of listening to this voice also through the integrated speaker of the DualShock 4. The paid version of Resogun should range between twelve and fifteen euros; the quantity of content in an absolute sense does not make one cry for a miracle, on the contrary, but as mentioned at least initially it will be quite simple to access it for free and appreciate its qualities. Resogun arrives at the PlayStation 4 launch in a blast of fun, our review", "date": "2013-11-13", "grade": "8.8"}