{"name": "Indiana trash", "ref": "https://multiplayer.it/recensioni/125426-deadfall-adventures-indiana-trash.html", "text": "There are certain games that install without much hope, i.e. without expecting anything in particular. Sometimes, however, unexpected virtues can be discovered even in products that from first impressions appear inconsistent and overlookable. This is the case of Deadfall Adventures, the new first-person shooter from The Farm 51, a developer to whom we owe the discreet Painkiller: Hell & Damnation. The plot of the game is a mix of elements ranging from already seen elsewhere, to already seen and that's it. Ind... Dra... What's the main character's name? Indiana Drake! The protagonist is a mercenary adventurer sculpted on the model of Indiana Jones, coupled with Nathan Drake's mother, and with the character of a teenage redneck who is dumb enough and always horny. Hired by two archeology scholars on the trail of, look what, Atlantis, he will have to contend with enemies such as Nazis, Communists and mummies, not necessarily in that order. At his side he will have a beautiful archaeologist who, goodness of hers, also knows how to use a gun when necessary. In the midst of this burst of wild creativity, very original places to visit such as Egyptian temples, frozen caves, mines and South American forests could not be missing, where temples belonging to pre-Columbian civilizations arise. And towards the end they could be missing... no, better not to reveal the ending. At least one triviality you have to discover for yourself. We can't do everything ourselves. Fortunately the dialogues are written with a literary flair and don't make you regret the ticket price. Wait, we accidentally launched another game. Unfortunately those of Deadfall Adventure seem written by a Hollywood screenwriter in his first year of studies and, in addition to bringing together in a few lines of text all the possible and imaginable clichs about sexism, Nazism and communism, they are also the fair of ideological exaltation of the Yankee who never has to ask, the one with the easy joke who exports democracy with pistol shots and hand grenades (yet the developers are Polish... and there are those who say that cultural colonization has done no damage). Do you want a good Indiana Jones adventure? Deadfall Adventures is made for you! Note on multiplayer Deadfall Adventure offers six modes for competitive multiplayer (Deathmatch, Team Deathmatch, Capture the Artifact, Treasure Hunt, Team Treasure Hunt and Last Man Standing) and one for cooperative multiplayer (Survival). Unfortunately, having tried the game before it hit the market, the servers were completely empty and we weren't able to test them properly as they deserved. Exotic treasures Don't misunderstand. The scenario is not the disaster it seems. We know that the statement might seem contradictory to what is written above, but fortunately it is the gameplay itself that helps to overlook certain creative shortcuts. Of course, we have already visited the places represented elsewhere, but they are still indicated for the type of mechanics created by the developers. Deadfall Adventure is in fact a shooter with a strong exploratory component and with many puzzles to solve. In fact, in addition to going around shooting enemies with weapons that can be collected from crates and corpses, treasures must also be found, usually well hidden and protected by lethal traps that must be faced in different ways. Let's give a couple of examples: in one case we had to shoot plates on the floor to raise pillars that served as a shield against the flames that separated us from a treasure, while in another we had to build a bridge with a beam wooden ladder to reach a statuette on a half-destroyed jetty. No sunscreen? We try to avoid sunburn. Although there is nothing really new from this point of view either, it must be said that lately action video games have given up on offering gamers situations other than shooting. In an age where FPS buildings collapse, dogs bark and the sea is full of goldfish, it's strangely refreshing to be able to spend time reflecting on solving a puzzle or exploring all the nooks and crannies of an environment in search of clues and useful items. Moreover, in Deadfall Adventure treasures are not only collected for glory, but are used to upgrade the character, so they also have an active function that cannot be underestimated. There are three types of trinkets to find: one type is used to boost life and stamina, a high type to improve combat characteristics and the third to improve the performance of the flashlight, the use of which we will explain in the next paragraph. Upgrading the hero isn't essential to beating the game, but it helps a lot in combat, especially towardsthe end of the adventure where things get more complicated. One torch to burn them all In Deadfall Adventure there are essentially two types of enemies: humans, armed and armored in various ways, who must be killed by shooting them; and the mummies, which must always be pierced with firearms, but which must first be softened by the supplied flashlight. To do this, just concentrate the beam of light against them and then eliminate them with the weapon in hand. During the adventure you will encounter variants of this formula, such as mummies imprisoned in some blocks of stone, or others who will ambush you by breaking sarcophagi, but in practice you will not escape from the initial mechanics. Smile... really not, huh? In general, the enemies, human and otherwise, have not shown great intelligence. Let's say that they are in line with the Call of Duty model, i.e. they tend to get behind the various covers but always leave some parts uncovered to be lovingly pierced. Moreover, they are not very reactive and manage to really worry only at the higher difficulty levels, and only when they attack in large groups. For the rest, you die much more because of the traps, but even here there are precautions to take so as not to ruin the pleasure of overcoming them alone. Concerned about the mental health of some gamers, the developers have inserted a safety notebook on which the solutions of the puzzles are practically written. Our advice is not to use it, except in extreme cases, or to disable it completely. Always being told what to do to move forward is quite demeaning and much more satisfying to be able to make it on your own. Other problems, technology and the grand finale First the flashlight, then the gun. Unfortunately Deadfall Adventure suffers from other problems that must be underlined. The most annoying is the save system, based on classic checkpoints. In reality these are frequent and work quite well, except that on some occasions they are placed at the beginning of fairly large areas to explore, with various treasures to find. What does this mean? Well, to get to the treasures you can die multiple times. Now, once you get a treasure the game is not saved. The real risk is that one will die looking for the next treasure. Unfortunately the game does not remember the treasure already found, which will consequently have to be recovered again. This translates, fortunately in a few areas, into a continuous collection of the same treasure and overcoming the same traps, which you end up learning by heart, until, having found everything that can be found, you cannot go to the next checkpoint. Let's take as an example of the problem the beginning of the series of arctic levels, where there are three treasures to collect and a field full of traps to overcome before reaching the next checkpoint. It is as if doing a jigsaw puzzle, every wrong attempt to hook a piece would also have to rehook those already positioned. Wanting to add a few more defects to the pile, we can notice some strange behaviors of the mummies (say bugs). For example, in one case we literally made one fly backwards simply by shining a flashlight on it, while in another case we saw another one get stuck against a wall. Of course we mercifully eliminated it. It's not much stuff, really, but it's fair to give an account of it. Some puzzles are easier to solve than first impressions suggest. From a technical point of view, Deadfall Adventure fares well, much better than we expected. Created with Unreal Engine 3, it offers richly detailed scenarios, some truly spectacular, for generally well-made 3D models and a series of by now standard but decidedly convincing effects. You can see from a mile away that from this point of view the developers really know how to do it (actually they had already demonstrated their ability with Painkiller: Hell & Damnation). Even the pure level design is really well done: the maps are in fact vast and, despite the underlying linearity, offer good exploration possibilities and some interesting variants. For example, in one situation you have to follow signal flares so as not to get lost in the middle of a snowstorm, while in another you have to slide down a slope avoiding various obstacles. Generally these are situations already seen elsewhere, but they serve to break the rhythm dictated by the shootings and the puzzles and effectively perform their function. At this point, all we need to do is talk about the grand finale. Too bad there's no grand finale to talk about (did you really fall for it?).", "date": "2013-11-13", "grade": "7.5"}