{"name": "Fantasmi all'assalto", "ref": "https://multiplayer.it/recensioni/125355-call-of-duty-ghosts-fantasmi-allassalto.html", "text": "Our coverage of the most anticipated pair of ~cross-gen~ shooters of recent months is coming to an end, and today, after the embargo expires, we return to talk about Call of Duty: Ghosts for the third time, now being reviewed on Xbox One, after extensively spoken in version PlayStation 4, Xbox 360, PlayStation 3 and later also PC. By now you know everything about the game, in this sense it would be enough to update the paragraph on the technique, but in any case a small summary on what the new Infinity Ward project is and how it is is necessary for all those who have only now listened, so let's break delay and let's see what the substantial package set up by the Infinity Ward guys contains. Call of Duty: Ghosts fails to replicate the usual winning formula with the same success History (does not) repeat itself Campaign, multiplayer, Extinction and Squads: this in short is the rich game menu created by the American boys. The campaign is the real letdown of the game. It all begins when the Odin, the satellite equipped with huge rods capable of unleashing the destructive power of an atomic bomb only with the impact, is boarded and used against American territory. The United States is brought to its knees, invaded but not broken, with the remnants of what was once the most powerful military in the world continuing the fight against the invader, locked up in pockets always at risk of annihilation. Obviously it's up to us, the ghosts, to lead the rescue in the stars and stripes. After a Black Ops II that has been able to reinvigorate the franchise a lot, between ~RTS~ missions, but above all multiple choices and endings, we return to the classic. There would be nothing wrong in itself: a tense, fast and exciting story has always been the Call of Duty trademark. Too bad that this time the basic features do not work properly. Too fragmentary, uncharismatic characters, rose water twists and zero pathos are the nefarious ingredients of a story that doesn't hit the stomach and doesn't excite, a homework with some infamy and little praise, perfectly forgettable if inserted among all the campaigns played since Modern Warfare. Attention, we are not talking about five - six hours of game that don't work, there is everything one expects from a Call of Duty, i.e. fast pace and lots of variety, the ~wow!~ effect simply never triggers, not even in zero-gravity missions, and even the much-vaunted dog Riley is only an extra in a couple of stealth missions in the early stages of the game, to then leave the scene without a fight. Then there is to add an artificial intelligence that with a euphemism we could define as underdeveloped: here too everything is as per the textbook, fortunately the narrow spaces and the frenetic pace mask these deficiencies a little, but not too much. In short, a nice step back from the past. The multiplayer, on the other hand, is full-bodied: over ten game modes, between old and new and fourteen maps, many of which, probably the best of the package, are decidedly large and open. The first novelty is the process of creating your own alter ego, which mediates between the Point Streak system seen in Modern Warfare 3 and that of Black Ops II's Pick 10. In fact we can choose between three classes that determine the type of Strike Package to implement (assault, support and specialist) and a completely free construction of our armory, in which the acquisition of weapons, gadgets and so on takes place through Squad Points, points that are obtained by leveling up or by completing missions, while only the perks are linked to certain levels. How to use the points therefore becomes very important: spend those given sparingly by the game to buy the (too much) fearsome Beretta ARX-160 or distribute them evenly throughout our ~loadout~? Everything is therefore functional to level up: we are encouraged to play Ghosts in its entirety by properly dissecting it in all its possibilities. The three specializations of the Strike Packages were spot on two years ago and are still spot on today in 2013, but balancing problems in some rewards should be reported. The dog, which is activated with five ~kills~ by choosing assault, kills enemies with a simple caress, and remains on the map even if we are killed, accumulating further points and even the two types of Juggernaut seem a little too powerful, while the specialist , without Strike Package but equipped only with perks, can become invincible in the hands of the best players, activating a total of over 15. Another thing that made us turn up our noses a little is the reduced health of the player: with a few hits you die, especially if they come from high-level weapons, which does not make otherro that making the respawn problem more tangible is not always flawless. A design choice strongly desired by Infinity Ward to detach from Treyarch's less ~hardcore~ setting, but which can make games really frustrating. Xbox One goals The specific Xbox One objectives are not yet known, but the Xbox 360 ones are well known. Many of the basic ones are obtained simply with progression, perhaps even by performing particular contextual actions other than simply pulling the trigger. Extinction also allows us to obtain a good number of them provided we not only get to the end but also play in a certain way. Bigger, better Among the new inclusions, the design of some maps is certainly very welcome. Among the fourteen available, there are some very large ones, obviously in relation to the average of the series. The prime example of this swerve is the green valley of Stone Heaven complete with a ruined castle in the centre, full of hills, mounds and streams. But we must also mention Chasm, set in a Los Angeles devastated by the impacts of the Odin, structured on several levels, with a marked verticality and also very intricate and Whiteout, a good mix between long shots and areas for close combat, all played between a fishing village, small snowy hills, caves and tunnels all around a wooded clearing perfect for crossfire. The construction of the maps is obviously always the same: many secondary passages, defilations, and many ways to get to the hot areas, but finally the airiness is the master, one no longer has the impression of being locked up in a circular labyrinth, and when you go up to the top you often enjoy a very vast panorama. All of this, of course, without losing what is the DNA of the game, i.e. fast and frenetic battles. The smaller ~standard~ maps remain, and although their construction is appreciable, their charm is much less, with or without the moments in which we can change (actually little) the initial layout. The new game modes are definitely fun and well structured: the best are undoubtedly Search and Rescue, or the old Search and Destroy with the rules of Kill Confirmed and Blitz which sees the two teams in a furious race towards the opposing base, where ~ mark~ by stepping on a small circular area to then be teleported to the starting point. But we also liked Hunted, even if it's more of a pastime than a real competitive mode. Extinction is beautiful However, where Call of Duty: Ghosts makes the leap in quality is in Extinction, which takes the place of Spec Ops, refreshing Treyarch's Zombie mode. The focus is the personalization of one's alter ego: it starts from the choice of class, between weapons specialist, tank, engineer and doctor, to then access a whole path of specialization and growth that modifies both our performance and the contribution to team play. The heart of the game are the points that are earned wave after wave, that is, every time we successfully drill the alien nests that infest the freely explorable town. The choices that the game asks take us almost to the role-playing zone: do we specialize our class to the maximum or do we disperse the precious points in the various skills (offensive and defensive) that are useful both to us and to the other players? Funny and ~caciarona~, but at the same time very reasoned and ~tactical~. A truly intriguing novelty that will make both Spec Ops orphans and the many fans of Zombie mode happy. To conclude the large amount of game content there is Squads, or a kind of asynchronous multiplayer mode since we basically have to build our own team moved by bots, choosing roles and paraphernalia wisely, and then level it up by playing with it together , but also and above all by ensuring that it is chosen and fielded by other players. All managed by an artificial intelligence on which Infinity Ward seems to have worked a lot since it is capable of adapting to our abilities and skills in real time. Squads has all the characteristics to be an interesting novelty, with the plus of Safeguard (a horde enriched by random launches of weapons, perks and strike packages), but which must be objectively evaluated in the long term to understand if the asynchronous mechanism of the squads will work without problems. From a visual point of view, what is written in the previous reviews is valid for both PC and next gen. Call of Duty: Ghosts inevitably shows the signs of an engine still too tied to the past, which doesn't need more polygons, more special effects, better management of the lights and higher detail to make a decisive leap~in the future~. We see the clean break with the past in terms of cleanliness, but the impact is anything but shocking. Clear references to times gone by are the qualitative changes between many foreground elements and those placed in the background, without forgetting that even entire missions of the campaign give the idea of having been ~closed~ with a lower quality rate than others. Obviously, if we talk about the textures and animations - facial and non-facial - of the protagonists, the situation changes decidedly for the better, but more generally, one gets the impression of only sufficient cosmetics, which does not impress even when everything explodes, when the direction is exalts in the most pyrotechnic and spectacular moments. It should also be noted that, compared to the PlayStation 4 counterpart, thanks to the lower resolution and less present antialising, there is more dirt and definition of the images on Xbox One. However granite frame rate, waiting to verify in day one that of Sony, which appeared shaky on several occasions in the review.", "date": "2013-11-12", "grade": "7.9"}