{"name": "Il ritorno dei morti viventi", "ref": "https://multiplayer.it/recensioni/125255-sniper-elite-nazi-zombie-army-2-il-ritorno-dei-morti-viventi.html", "text": "Hitler is furious: the evil ~Plan Z~ hasn't gone as planned and zombies have targeted his secret bunker. ~Isn't this artifact supposed to protect us?~ he shouts to one of his subordinates, pointing to a strange stone cylinder. ~Yes, my fuhrer, but we should have owned all three!~ says the soldier, before being barbarously killed by the mad ferocity of his commander. Then the bunker door opens under the weight of hundreds of living dead and Adolf Hitler lives in panic the last moments of his existence. Across town, Karl Fairburne and his three fellow fighters (a scientist, a repentant German officer and a Russian soldier) realize that their battle isn't over yet, as corpses keep waking up and forming a threat to the whole world. However, they discover that three mysterious artifacts, when brought together, could end this macabre conflict. Thus begins a new desperate mission for the group, which must once again face an army of zombies to achieve their goals. Developed by Rebellion, Nazi Zombie Army 2 is the sequel to the spin-off released eight months ago exclusively for PC (here is our review), which starts from the structure of the original Sniper Elite to offer us a more action and less strategic interpretation of the World War II, or at least what might have happened if hordes of the undead were also involved in the conflict. Sniper Elite: Nazi Zombie Army 2 is a ~more of the same~ than the first episode of the series A blunt bullet (from the skull) The first impact with Sniper Elite: Nazi Zombie Army 2 is a bit unsettling, because it seems to be faced with a photocopy of the first episode. The problem is that the sensation continues to be felt as soon as you start playing, given that no changes have been made to either the gameplay or the structure: the new Rebellion production proudly stands as a ~more of the same~ for those who have enjoyed the first experiment of the Sniper Elite series with zombies, and to hell with all the others. The funny thing is that the argument stands perfectly, given that the game costs 10.99 on Steam (32.99 for a pack of four, for those who are quick-thinking and want to get organized with friends for the fun cooperative mode ) and offers a campaign lasting four or five hours, which pushes the accelerator on the usual points, i.e. almost infinite swarms of living dead to (re)kill in the most spectacular way possible, thanks to the three different categories of weapons supplied ( sniper rifle, machine gun or shotgun and pistol) and the sensational ~x-ray~ kill cam, which shows bones and internal organs being shredded in slow motion as they are punctured by our bullets. As with the first Nazi Zombie Army, tackling missions in co-op greatly amplifies the fun, even more so if you organize yourself with trusted people. In fact, during the inevitable ~sieges~, two players can position themselves on a raised area to target enemies with precision shots, while perhaps the other two make their way through the crowd with a shotgun or place explosives to prevent the evil hordes to go beyond a certain boundary. However, the experience is also enjoyable alone, with the number of zombies that adapts to the situation (but this is adjustable from the options) and a considerable degree of challenge already at the normal level. Has nothing changed? The plot has changed, the scenarios have changed (even if sometimes they seem to have already been seen) and there are two new types of enemies, in this case a boss covered in fire and his rapid minions, which add to the already well-known soldier-zombie with the machine gun, the jumping snipers and the final boss, who is also protected here by a barrier of flying skulls, after which you have to score a headshot. In short, the similarities with the first Sniper Elite: Nazi Zombie Army are many, too many to consider the title of Rebellion a real sequel. It is certainly possible that users who appreciated the original would like to try their hand at the exact same action and with the exact same weapons, after all, the formula developed by the English team worked properly and had some declines only in terms of direction, which appears to have been resolved. There is no shortage of exciting moments and more space has also been given to petty strategy, i.e. the control points are somehow ~announced~ and it is therefore possible to dedicate oneself to some operation with explosives to protect the strategic points of the scenario, so as to guarantee the space to retreat in case of troublethe. From a technical point of view things work well, you can play with mouse and keyboard or with the Xbox 360 controller, the graphics are very detailed and the level design appears to have improved in various respects. Once again everything can be managed without problems from a mid-range PC, at a resolution of 1920x1080 pixels and with all the effects at their maximum. Only supersampling, which can be activated up to 4X, has an important impact on the frame rate and is therefore an exclusive feature for the most extreme configurations. We also liked the sound accompaniment, decidedly spot on given the massive use of synths and the many references to horror classics.", "date": "2013-11-08", "grade": "7.0"}