{"name": "Disney Planes", "ref": "https://multiplayer.it/recensioni/125244-disney-planes-the-video-game-laereo-meno-pazzo-del-mondo.html", "text": "Dusty is a small agricultural plane but has big ambitions, in this case he would like to participate in the speed races that take place up there, in the clouds. There's only one problem: he suffers from vertigo; so look for someone who can give him a hand, who can train him, someone with some experience. Who better than the old aviator Skipper? You will see the rest of ~Disney Planes~, the new Disney animated film, at the cinema these days, given that the spin-off of the famous ~Cars~ arrives in Italian cinemas today. What we are interested in discussing in the review is instead the video game developed by Behavior Interactive, the team that also authored the recent Spongebob Squarepants: Plankton's Revenge and many tie-ins of the same tenor, as well as products such as WET, Naughty Bear and the MMO Warhammer 40,000: Eternal Crusade, to be released in 2015. Designed for a very young audience, Disney Planes starts from the events of the feature film to put us in command of eight airplanes (ten in the extra modes), each with a specific personality, which are have to deal with different situations within more than thirty missions. Fly fly fly fly fly Maya the Bee Once the game has started, the main screen allows us to choose between four modes: story, free flight, air rally and balloon burst. The story mode, as we mentioned earlier, provides us with eight planes (two of which need to be unlocked), each engaged in four missions based on the background of the aircraft. Dusty, for example, finds himself having to help his farmer friends in the middle of a tornado, recovering the tractors working in the fields and using a device that literally ~turns off~ the disturbances. The female plane Ishani, on the other hand, must first collect flowers around the scenery and then take care of launching fireworks, all to allow a party to take place in the city. The problem, in all cases and with all aircraft, is the flatness of the action, which never goes beyond a basic mechanic: go to point A, perhaps to pick up an object, and then to point B to use it. The degree of difficulty is decidedly low, calibrated for children of six or seven years, but we assume that even they will have no problem completing the campaign within a couple of hours. Things don't improve with the multiplayer (usable on the TV in split screen or in separate mode, with one of the two participants playing on the GamePad while the other uses the Wiimote and Nunchuk), even if it must be recognized that the control system based on the gyroscope it works well and guarantees a minimum of more fun, always from the point of view of the very young. Disney Planes might appeal to very young children, but it's a mediocre tie-in Airplane you leave The side modes allow us to use two more planes (Bravo and Echo, jetfighters) and to try our hand at free flight in one of the nine scenarios present (all to be unlocked through the campaign), as well as with the aerial rally and the explosion of the balloon. The latter provides a time limit within which we have the task of bursting a minimum number of balloons present in the location, while the air rally is a Mario Kart-style race, complete with power-ups to collect along the way to put opponents in difficulty. This is certainly the most successful part of Disney Planes, so much so that one wonders why the guys at Behavior Interactive have not worked directly on an airplane racing game, perhaps with some upgrade system for the aircraft and a minimum of progression. Mysteries of licensed productions, which in this specific case (Wii U version) unfortunately cannot even count on the favor of technology. Beyond the double view (on the TV and on the GamePad), in fact, Disney Planes is evidently a title born on the Wii and ported to HD on the new Nintendo console, without any optimization and retaining decidedly ~old gen~ effects. Just look at the water, the rendering of the clouds, the general complexity of the polygonal models and even the uncertainties in the frame rate that arise from time to time. It doesn't matter, will we be able to soar carefree in the sky? Not even that, given the presence of invisible walls that delimit the size of the stages and force us to turn around if we go just beyond what is allowed. One of the few positive notes is the dubbing in Italian, made by a cast of professional interpreters (probably the same as in the film).", "date": "2013-11-08", "grade": "5.0"}