{"name": "Arma tattica", "ref": "https://multiplayer.it/recensioni/125241-arma-tactics-arma-tattica.html", "text": "It's a good thing that developers have now assimilated the practice of differentiating their products according to the platforms on which they are developing, in particular as regards portable devices: it is not simply a matter of avoiding the release of simple downgrades built only to place its flag on unexplored market segments - also because the technological evolution of mobile devices increasingly weakens the necessary compromises - but to understand how the development of a good video game cannot ignore the specific context of use. The idea of Arma Tactics from this point of view is excellent, because instead of trying to reproduce the complex experience of one of the most tactical and demanding FPS on the market on small portable screens, with the inevitable bottleneck represented by the and from the necessary lowering of the pace of the game, it moves to another level, proposing a completely different approach to digital warfare. The spirit of the series remains unchanged, with its typical realism, the high level of challenge and the tactical element, but the strategic aspect of the battle is exalted to the maximum, with a rigorous turn-based structure that assimilates it to the more classic trend strategic ~checkerboard~ with a shot from above. From a conceptual point of view, therefore, the Bohemia Interactive operation is impeccable, rather it is from the point of view of the realization that the defects emerge, making this Arma Tactics a good idea, fun for the most part but with various filings and adjustments that make it necessary to be able to achieve a positive result, perhaps with possible sequels in the same vein. Leaving aside the dullness of a decidedly uninspired plot, but perhaps functional to the simple construction of levels to be completed, it is precisely the mechanics of the game that do not work properly in various respects, starting from the control system, passing through the rhythm of game to get to the same damage management. It's a shame because the potential was there, considering the developers' experience in war simulations and a basic structure that could work well, if perfected. Arma Tactics is a good idea, unfortunately not developed with the right care War is not a game The rules are quite simple: we find ourselves managing a team of soldiers within various missions, which essentially require us to cross a map more or less full of enemies and characterized by various settings and scenario elements that offer potential cover. Each soldier has two action points available, i.e. two actions that can be performed for each within a turn, including movement (which, depending on the distance covered, may require one or two action points), attack, defense, reloading and use of objects. The clashes are therefore marked by the succession of turns and the amount of damage inflicted (or suffered) depends on the type of weapon used, the specialization of the soldier, the position and the presence of covers. On this point we already notice one of the defects of the game, which often does not seem to take into consideration the necessary position of the soldier in terms of elevation from the ground and the presence of covers, with a calculation of the damages that appears somewhat uncertain in several cases. The mechanics of the clashes is enriched by the possibility of modifying the equipment of the soldiers thus providing new attack capabilities and specialization in the field. The continuous evolution of the characters, combined with the possibility of always generating new levels (outside the Campaign), extends greatly the longevity of the game, and it is these other positive elements in Arma Tactics' balance sheet, which could well be taken up and developed further in the future. Returning to the sore points, we note a certain inexperience of Bohemia in the mobile field also in the pace of play, with games that often last for a good half hours, decidedly unsuitable for the normal context of use of a portable title like this and certainly more suited to the use on PC. The average high level of challenge also makes the errors of videogame tragedies as they can frustrate such long game sessions, and sometimes they occur for reasons not attributable to wrong calculations but rather to incorrect pressures on the screen that derive from a control system that is not too reactive with the impossibility of remedying, aggravated by a not always clear framing on the battlefield. In short, the defects of Arma Tactics are objectively multiple, but the balance is not entirely negative, thanks to a basic structure that is still engaging and a gexcellent profile graphics.", "date": "2013-11-08", "grade": "5.8"}