{"name": "Tastiera assassina", "ref": "https://multiplayer.it/recensioni/125048-the-typing-of-the-dead-overkill-tastiera-assassina.html", "text": "Do you remember The House of the Dead: Overkill? Originally released in 2009 on Wii, the shooter with lightgun (but without lightgun) made by SEGA was then recovered on PlayStation 3 with an Extended Cut edition that added two extra levels to the campaign and a slightly improved technical sector. Well, since all good things come in threes, on the occasion of Halloween, the Japanese company has seen fit to re-propose this title again, this time on PC but with an important novelty, namely the inclusion of the ~typing~ mechanics of the original The Typing of the Dead. If you have never had to deal with such productions, which are rather widespread in Japan, here is briefly how it works: starting from the stages and sequences of The House of the Dead: Overkill, the player does not have to maneuver the pointer of the mouse or a lightgun, but can hit the zombies that appear on the screen simply by typing the words on the keyboard that accompany the arrival of each enemy, represented by a kind of ~plate~ whose letters light up as we type. Quickly dialing a word results in eliminating the undead or, during bosses, performing an attack designed to weaken the opponent. An interesting and even useful exercise for those who write for work (here we are!), it's just a pity that the reference dictionary is exclusively in English and this inevitably entails a greater degree of difficulty for those who are not used to typing certain terms, which obviously become gradually more complex and numerous, so as to consequently increase the degree of challenge of the experience. The Typing of the Dead: Overkill offers a mix of initially interesting but very limited experiences Beyond the keyboard Typing the words that continuously appear on the screen on the keyboard, as we said, proves to be interesting and also quite challenging, transforming the gameplay of The Typing of the Dead: Overkill into something actually peculiar and fresh. The point is that as soon as you realize that the package offered for sale by SEGA on Steam also includes The House of the Dead: Overkill - Extended Cut natively, you will immediately put aside the typing vein to grab a mouse or controller (no lightgun here too, it's a vice) and tearing apart zombies in a more ~serious~ way. Also because the adaptation that gives its name to this new edition of the game does not include the variations on the theme conferred by the arsenal, made up of six different weapons (service pistol, revolver, shotgun, semi-automatic rifle, submachine gun and shotgun assault), all of which can be upgraded using the money collected in each mission. And speaking of ~collecting~, the scenarios are full of cash, medikits, bullet time activators and unlockables which in the ~typing~ version of the experience inevitably take a back seat. The campaign, which in this case has nine missions (completed which unlocks the Director's Cut mode), sees two police officers, the ~perfect~ G and the foul-mouthed Isaac Washington, chasing a dangerous criminal who seems to have given birth to a epidemic that turns people into zombies. The two are soon joined by the busty Varla Guns, seeking revenge for the death of her brother and the protagonist of one of the bonus levels. The ~plot~ clearly mentions the classic horror filmography and seasoned everything with a 70s atmosphere (underlined by an excellent theme musical accompaniment) and tons of profanity, mostly coming out of agent Washington's lips, an ultra-stereotypical character but no less amazing and hilarious. In a nutshell While on consoles it could count on the contribution of peripherals such as the Wii-mote and Move, which do not return the same feedback as a lightgun but at least do not go too far from it, on PC The Typing of the Dead: Overkill suffers greatly from the situation of the controls. If you play it with the keyboard everything is fine, as long as you accept the limitations we mentioned above, but with the mouse it's all a bit too simple and the presence of unlimited ~continues~ (at least at the normal difficulty level ) makes it possible to complete the campaign within two to three hours. Then it is clear, there are higher degrees of difficulty, there is the Director's Cut mode to guarantee a certain replayability, but it is never nice to ruin the narrative contents of a product of this genre in a first stint which in the end reveals itself as far too ethereal in terms of texture. The outline of the offer sees the presence of three mini-games that leave the time they find: in the first we have to shoot zombies with the aim of covering the escape of some prisoners from a prison invaded by the undead, the second is an traditional horde-based survival and the third is the reproduction of a carnival shooting gallery. Through the release of a DLC, the developers will add a cooperative multiplayer mode, which we assume will work in a ~mixed~ way (one player at the keyboard, the other at the mouse), but it is not known when it will arrive. We must also consider the technical sector, full of interesting graphic devices that simulate the artifacts present in the films of forty years ago, but at the same time terribly ~old gen~ and devoid, in this version, of advanced graphic adjustments: it is possible to choose the resolution (which however seems locked at 720p), possibly activate the anti-aliasing and stop. Of course, moving such angular polygonal models does not require brute power, and in fact we carried out the tests without any problems on the test configuration. Also considering this element, although the sale price was accessible (17.99 euros), it seemed too high to us.", "date": "2013-11-05", "grade": "6.0"}