{"name": "Morti su Marte", "ref": "https://multiplayer.it/recensioni/124598-dead-effect-morti-su-marte.html", "text": "What happens when five developers with various projects behind them (Mafia, Cold War, Chronicles of Riddick, UFO Aftermath and others) decide to form an independent team and dedicate themselves to making mobile games for iOS and Android devices? It happens that a first person shooter with zombies comes out of it. Joking aside, Dead Effect undoubtedly represents an interesting experiment, given the values in the field and the excellent technical sector, all however mixed with all too traditional mechanics. The plot of the game sees us awakened from a cryogenic sleep aboard the ESS Meridian spaceship, which left with the aim of reaching and colonizing the planet Tau Ceti f. There's just one small problem: the crew has been contaminated by a mysterious virus that has turned everyone into flesh-hungry zombies. Guided remotely by Dr. Wagner, apparently our only ally still alive, we will therefore have to cross the various areas of the ship and defend ourselves from the attack of the undead while trying to understand what caused the infection. Also because we have been subjected to the same viral agent and could transform at any moment. In short, the incipit of Dead Effect is not the most original, but in the end the narrative element is not exactly the priority when you are dealing with a first person shooter of this type. Dead Effect is ~yet another FPS with zombies~, graphically well done but with too many problems Under the magnifying glass From the start, the touch control system of the game seems to work properly: the solution of the double virtual analog stick, widely tested, proves to be precise and reactive, assisted, however, by two arrows at the edges of the screen that allow you to turn quickly in case of danger behind. The problem is mostly the size of the buttons, customizable but still tiny, as well as the lack of an option for automatic fire. Let's try to explain, hoping that some developer out there tends to listen: when you frame an enemy in your viewfinder in a shooter, you usually do it to shoot him. So what's the point of deputing the fire to a separate button, significantly increasing the cumbersomeness of the experience and making aiming more difficult? Some titles have shown how such a configuration is decisive with respect to the problems that often and willingly have to be faced when engaging with a mobile FPS. In the case of Dead Effect, then, the difficulties unfortunately do not concern only the controls but also the gameplay, which doesn't really add anything new to such an inflated genre. There is undoubtedly a good direction and a minimum of behavioral variety among the zombies, but at the same time the amount of ammunition available appears excessive, which diminishes the generous size of the arsenal (why use a different weapon, perhaps less effective , if the one we have equipped always has a full magazine?), which can be upgraded through an interface that unfortunately takes an example from the buttons on the screen and turns out to be tiny in the writing and keys, so much so that even those with small hands struggle. And here too it is appropriate to appeal to developers: work on games that run on a four, five inch display at most when it comes to smartphones. What's the point of inserting text the size of two microns and an interface designed for much larger screens? It's a pity, because beyond the lack of novelty and acute details, the Dead Effect experience proves to be fun and engaging, characterized as it is by a truly excellent technical sector, with defined textures and excellent fluidity, which shows the side only to a scarce variety of scenarios. The dialogues in English and the sound effects are also good, while we would have expected something more incisive from the music.", "date": "2013-10-24", "grade": "6.8"}