{"name": "The Centennial Case: A Shijima Story", "ref": "https://multiplayer.it/recensioni/the-centennial-case-a-shijima-story-recensione.html", "text": "There is a period for everything. History tends to tell us this and remind us constantly. Courses and appeals, so someone said, despite the fact that sometimes we try to anticipate too much or maybe we risk arriving late. The Centennial Case: A Shijima Story lives this double feeling. It would be too harsh to say that it is automatically an old and trivial title, but without a doubt it can be said that it is out of time in its current state. This review of The Centennial Case is more difficult than expected precisely because it confronts us with a particular experience, so damned anchored to its inspirations and in some aspects eager to return to combining live action games with interactivity. As was done well before being able to deceive the imagination with crazy technical values by now achieved by the industry, but also trying to recover that desire to try to surprise without exploiting frankly penny little tricks, like any Super Seducer does. The case of the hundred years The Centennial Case: A Shijima Story - the live action scenes are fine workmanship The story of The Centennial Case: A Shijima Story, published by Square Enix puts us in the shoes of mystery writer Haruka Kagami who finds herself in the middle of an investigation that digs into the past of the Shijima family, of which Eiji Shijima is currently the pivotal member in some way. Everything would seem to recall the presence of a mythological Japanese fruit which should contain the secret of eternal youth and which has brought so much pain and mystery to the family over the generations. This assumption opens the investigations that will lead us back to the beginning of the last century, in 1922, the year of the first crime that will bring its aftermath up to the present in 2022. A story that builds its foundations on the stylistic features of Agatha Christie-esque yellow and that transforms our protagonist into a real oriental version and less eccentric than Hercule Poirot. Don't expect the plot of the century, let alone superfine pen solutions, but what really generates the great doubt in the ~player~ when it comes to judging The Centennial Case is that the live action filmed sequences are really excellent workmanship. Well directed and well acted - obviously without forgetting that pinch of Asian over acting - which however transform the title into an experience that is worth the trip. From this point of view, productions of this kind have hardly been seen. In its remarkable brevity, only Her Story struck us for its workmanship, perhaps giving some vain hope to projects of this type. Square Enix, on the other hand, continues this work of experimentation that has given us great slips like The Quiet Man, but which obviously knows where to go to fish given what has been achieved in this case. Gameplay, so to speak The Centennial Case: A Shijima Story - the protagonist of the story We come to the structure of the experience, which follows very specific tracks and which, even if we try, ends up collapsing under the weight of the lack of real interactivity, the real cross of this kind of product. All of The Centennial Case, which also sees the use of the same actors for the different eras, along the lines of what the Wachowski sisters did for the adaptation of a masterpiece of modern literature such as Cloud Atlas, is in fact structured according to three different and separate sections of ~game~. Everything is then repeated for all the cases on which we will investigate. The first part of the experience is therefore strictly linked to the visual and narrative aspect. We witness several tens of minutes of footage, which it is possible to manage in progress as you see fit, also making decisions regarding some directions to be taken in the discussion, going back and forth naturally and therefore being able to try to understand all the different facets of events. Once you have seen everything that you consider fundamental, it's time for the deduction phase. In this section we find ourselves putting together all the various clues collected on a sort of hexagonal grid. Juxtaposing the clues and choosing the right deductions will clearly lead to formulating a thesis, right or wrong. Here we encounter a sort of short circuit. In fact, the game, to avoid becoming too frustrating and excessively trial and error (a danger which in any case is touched upon on several occasions) already makes all the clues present in that specific sequence available to the player, regardless of whether or not they have actually been viewed in the course of the scenes. The possible degree of challenge is therefore drastically weakening, even if the obiThe objective of the game is certainly not to put a spoke in the player's wheels. The Centennial Case: A Shijima Story - Japanese atmospheres have their charm Once the hypothesis has been formulated, one moves on to the final phase, the one that really seems to mimic the works of Agatha Christie and which sees us having to illustrate our conclusions to those present, accusing and exonerating those responsible. If the structure itself is also well thought out, it is the repetitiveness and the unclearness of some of the situations that often mislead the player, who ends up putting together clues and deductions that sometimes know a little ridiculous and that show little attention in the various declinations of the story put standing by the writing team. Nothing that changes the fate of the project, but a detail that clearly does not honor a title that makes writing its main source of livelihood. In short, The Centennial Case: A Shijima Story does not revolutionize the genre, although we find it hard to deny that it treats of one of the most interesting and well-finished experiments for this kind of titles.", "date": "2022-05-17", "grade": "7.0"}