{"name": "In piedi", "ref": "https://multiplayer.it/recensioni/124655-phoenix-wright-ace-attorney-dual-destinies-in-piedi-entra-la-corte.html", "text": "The Ace Attorney series debuted in Japan in 2001 on the Game Boy Advance, even if we Westerners were only able to enter the virtual courts from 2005 with the Nintendo DS conversion of the first episode. In twelve years of activity we are at the fifth game of the main line, to which must be added two spin-offs dedicated to the other side of justice (the prosecution), a crossover with the Professor Layton universe, a series of conversions and collections for PC, WiiWare and iOS, a comic series, a musical, a film and a stage adaptation. Ah, in addition of course to the several million copies sold, without which there would have been neither sequels, nor conversions, nor forays into other media. The reason for all this success could have been a mystery around here until a few years ago, but it just so happens that it was the Western conversion of Phoenix Wright: Ace Attorney that revealed to the European and American masses how much those all-Japanese games, that go by the name of ~visual novel~, can be magnetic, engaging and interesting. Attempts to export a genre that for decades has not seen its popularity crack in the Land of the Rising Sun had been there even before, Hideo Kojima's Snatcher comes to mind, but it was only our simulation of a lawyer that was so successful that it to catch Capcom itself unprepared, and to finally open the doors to many other series as well. And this is because, among the visual novels, the Ace Attorney saga has always been made with particular care, presenting first-rate investigative and logical gameplay, intricate and engaging storylines, interesting characters and so over the top that it cannot fail to be very nice from the first game; has a name to defend, in short, Ace Attorney, and that's why great things are expected for this debut on Nintendo 3DS. The 3D effect As we said in the body of the review, stereoscopy gives the settings considerable depth and concreteness, increasing the feeling between game and player. The same goes for the characters, and indeed, the character gestures for which the series is known - who doesn't know Phoenix Wright's pointing finger as he yells ~Objection!~ - they seem born for 3D. While not absolutely necessary for gameplay, it is therefore an addition of some substance. However, there is a contraindication: in the investigative phases it is better to eliminate it as, while the setting develops in depth, the viewfinder that serves to highlight the areas of interest remains in the foreground, making the interface a bit problematic. Legal drama Being plot and characters among the sharpest bow arrows of Dual Destinies, as well as all the episodes of the series, we will avoid ruining the experience with too many advances. Suffice it to say that one year after the events narrated in Apollo Justice: Ace Attorney, the last episode of the main saga, dear old Phoenix Wright returns to practice as a lawyer at the head of Wright Anything Agency, his studio (not only) legal. But this does not mean that the young Apollo is not in the game, on the contrary, and his role within the WAA, as designated heir to Wright, is increasingly prominent. To support the duo there is a new acquaintance: the very young Athena Cykes, who at only eighteen has already obtained the coveted badge of lawyer and whose dream is to introduce the concepts of psychoanalysis within the processes, and Also returning is Trucy, Wright's adopted daughter who aided Apollo in the previous episode and who is also represented by the WAA, but as a magician. Along the way we will then make many new encounters and we will also come across old, well-loved characters, friends or opponents. Still with a view to not anticipating too much, however, it is difficult for us not to mention at least one of the new characters, namely Simon Blackquill. Simon is the district attorney, the prosecution, the opponent of Phoenix, Apollo and Athena, but if you have played even one Ace Attorney you know that the district attorneys are among the most interesting characters, torn between their role as ~bad guys~ and their natural thirst for justice, so much so that the two spin-offs of the Investigations series were dedicated to one of them, Miles Edgeworth (by the way, it seems that depending on the sales of this Dual Destinies, Capcom could decide to release it in the West also the second Investigations, which has never seen our shores, but that's another story). Blackquill is no exception and stands out, as well as for his modern samurai attitudes, for a very, very particular characteristic: in fact, he exercises his role as prosecutor while he himself is serving a sentence for murder! What a system alreadyjudicial is what allows a murderer to act as a representative of the law, Apollo wonders at one point in the game. It is precisely on the concept of the ~dark age of the law~ that the plot of Dual Destinies is based, and on the recurring theme of the falsification of evidence. A plot, as usual, extremely well written and exciting, where the single cases are gradually inserted into a coherent and fascinating whole, just like the single ~pieces~ of each case slowly fall into place as the player faces them and unravels its intricate complications, and how, at a higher level, each episode of the series is part of a global fresco which - an admirable result these days - is at the same time very complicated but perfectly coherent and logical. Along the way we will delve into the psychology of all the main characters who, as always, under the exaggerated, frantic, very humorous and very Japanese appearance, hide an excellent depth that cannot, at least for some of them, not make them enter the player's best gaming memories. And we will do it by alternating many comic moments - the game seems to linger often and with pleasure in these divertissements, sometimes resulting in the verbose - and just as many dramatic twists and occasional digressions into psychoanalysis; all very exciting, well written, well rendered by the greater technical capabilities of the Nintendo 3D portable. The due process Those who are not new to Ace Attorney will take a second to settle in Dual Destinies. The basic structure, in fact, hasn't changed one iota, and although we are sure that this will be very welcome to the fans, we can't help wondering how nice it would have been for Capcom to dare a little more, perhaps to smooth out that linearity that on the one hand it allows the writers to have total control of their own creature, on the other hand it slightly frustrates the investigative and logical ambitions of the player who is always and in any case required to do a certain thing at a certain moment in order to move forward , all already foreseen by the aforementioned writers. It's a bit the historical problem of the saga, which manifests itself above all when there doesn't seem to be a really stringent logic in the right choice; and then we find ourselves, for example, proposing to the judge proof of the witness's lies going a bit blind, even when perhaps we have understood very well how and why he is lying; it must be said that in Dual Destinies these situations have been even more limited, but not eliminated. However, all this discussion does not make sense for those who do not know the basic structure, and therefore let us briefly explain it. Each case is divided into two phases, the investigative phase and the procedural one. The first sees us move between the crime scene and various other locations, interrogate and dialogue with the characters as in all visual novels, and investigate the various settings as in a normal graphic adventure, all to collect all possible evidence. This evidence must then be used in the trial: forget the presumption of innocence, in the Phoenix Wright judicial system it is the defense attorney who must prove the innocence of his client and not the other way around. It may seem strange, but this system is actually inspired by the real Japanese one, in which the percentage of convictions is very high - 99%! - but where, on the other hand, a suspect is never sent to trial unless there is almost total certainty of his guilt. Basically, between the jokes and the dramatic turns mentioned above, the witnesses are listened to, perhaps they are pressed to clarify some points and bring out new truths, and when it is thought that they are lying (and they are lying, they are all lying) it arrives the classic ~Objection!~ screamed at the top of their voice, which however must be followed by the presentation of the proof that proves the lie. If he is wrong, the judge loses some confidence in the defence, and when that is completely exhausted the accused is found guilty; therefore, there is also Game Over, but you will understand that from the point of view of a visual novel it is more of a nuisance than anything else. Therefore, the possibility of saving at any time is very welcome, perhaps just before presenting the evidence that in our opinion demonstrates a flaw in the prosecution's theories. Ace Attorney arrives on Nintendo 3DS with the usual quality and with completely renewed graphics! Subjects from psychoanalysis The aficionados know that our lawyers can count, to unlock a process that sees them clearly disadvantaged and at the same time make the gameplay a little more varied, on their own peculiar abilities, almost ~special powers~. Thus, while Phoenix unlocks the ~padlocks~ with which the witnesses protect thecertain truths, and Apollo, with his particular bracelet, is able to grasp the slightest nervous tics that signal a lie, Athena, as we said, introduces psychology into the debate: it is the ~Mood Matrix~ the new system devised by programmers. Thanks to Widget, a tiny and very technological gadget equipped with a holographic interface similar to Minority Report (but Ace Attorney is set a few years in the future, so everything is fine), Athena can extrapolate from the words of the witness the images of what he is saying, as well as the emotions that the subject feels at that moment, which can essentially be happiness, anger, sadness and fear. When you come across an emotion that does not seem consistent with the testimony, or in an unexpected intensity, it means that there is something wrong, and you need to insist on that particular point to remove the psychological block that prevents the interrogated to tell the whole truth and nothing but the truth. A ~gameplay twist~ typical of the series, which however is perhaps better realized and more immediate, for example, than Apollo's ability, which requires you to focus on a specific part of the witness's body and wait patiently for the tic to manifest itself. Although this is a novelty, it fits fully into the very linear and guided spirit of the game. The skills, in fact, can only be used when the game allows for it and this forces us again to point out that from the point of view of the gameplay nothing has been changed, with all the positive and negative considerations already made a little above. Even the control system does not undergo any changes whatsoever, presenting the two alternative button/touch screen systems and the possibility of shouting into the microphone to press the interrogated and present an objection. Where Ace Attorney has instead decidedly evolved is in the presentation and technical department: taking advantage of the greater potential of Nintendo 3DS, the programmers have given a decisive modernization to the entire technical sector, starting from the graphics which are now all in 3D, with a nice , light and well done cel shading on the characters. These take on a completely new corporeality; they are often also presented in full length, they are equipped with many more animations, all beautifully exaggerated as the spirit of the series foresees and all fluid and very successful. The settings also benefit from the new technique, the depth made possible by stereoscopy (refer to the appropriate paragraph for further information) and the camera movements which are very atmospheric and which make the well-known courtroom seem much more spacious and concrete than not in the past. As for the music, many have been recycled from previous games; only some, mostly linked to certain characters, are new. The nice thing is that this time they are all orchestral, with a consequent significantly increased hearing pleasure; for the rest, they underline with the usual skill the various moments of the game, from the more comical to the more dramatic ones. All this also has a positive effect on the presentation and on the feeling that the game thus establishes with the player, making the universe, albeit a little alienating in its exaggerations, ever more vivid and engaging; worth noting in this regard are the excellent animated interludes, really well done and which, put together, also reach a considerable duration. Sign of an upcoming Phoenix Wright anime? We wouldn't mind at all. The animated interludes, however, also introduce us to what for many, in our part, will be a big flaw: just like Investigations, Dual Destinies remains completely in English, in speech (and the aforementioned films don't even have subtitles) as well as in tons and tons of text. This is a real pity: although only a scholastic knowledge of the Albion language is ultimately required to move forward, non-Anglophiles will miss out on a lot of the details, jokes, references and puns that have always been a characteristic hallmark of a saga that is always well written. Furthermore, the Italian localizations of the Ace Attorneys have always been among the best ever seen in our market. This is a choice expressly made by Capcom to limit the costs and risks of a series which, evidently, has somewhat loosened its grip on the western public after the exploits of the first episode. And the other choice that will cause discussion should be seen in the same vein, namely that of releasing Phoenix Wright: Ace Attorney - Dual Destinies in Europe and America exclusively through the eShop. We are well aware that this thing will make many readers turn up their noses a little, and will probably also limit the catchment area of the product; but the other side of the coin is that Fr", "date": "2013-10-24", "grade": "8.6"}