{"name": "Robot gratuiti", "ref": "https://multiplayer.it/recensioni/124607-mechwarrior-online-robot-gratuiti.html", "text": "The Japanese weren't the only ones to embrace the passion for giant robots, because in the 80s the USA saw the birth of several franchises starring huge metal giants who face each other in battle. Beyond the well-known Transformers, who were endowed with their own conscience, the concept of mech as a military-style humanoid vehicle, controlled by a real-life pilot, was introduced by BattleTech, immediately the protagonist of a popular boardgame and, a few years later, of a series of video games called MechWarrior. We are talking about a production that took its first steps in 1989 on PC, therefore in all respects a classic for personal computer owners, who at the time fiddled with the config.sys and the autoexec.bat to tick off those few kilobytes of RAM needed to run this or that game. If you want to deepen the discussion, here you will find an interesting video that traces the evolution of the franchise up to the release of MechWarrior Online. The bet made by Piranha Games, that is to go into the impervious territory of free to play, is certainly courageous and the developers were fortunately able to count on the contribution of many enthusiasts to refine mechanics and methods over the course of an entire year of beta testing. But now that the game has been officially released and properly patched, we tried to do some laps on the mechs, offering succulent cannon fodder to the most savvy users. Do you have it small, medium or large? Let's clarify a concept right away: MechWarrior Online can be downloaded for free at this address) and also played endlessly without ever taking out a euro. From this point of view, the guys from Piranha Games have been extremely correct, providing four ~trial~ BattleMechs that never run out and that belong to the Light, Medium, Heavy and Assault classes, progressively bigger and more powerful but at the same time less quick and agile. We can use them in a short tutorial on the movement of the robot which, unfortunately, clarifies very little about the dynamics of combat (this topic must necessarily be explored using alternative sources - luckily there are many around); or select one and jump into battle, choosing between the two available modes (Assault or Conquest) or entrusting this task to the automatic matchmaking system, which immediately proves to be quite quick and effective. The money we eventually earn in battle belongs to the game's virtual currency, the C-Bills, while the real currency is called MechWarrior Credits (MC) and can only be obtained in exchange for real money. Let's try not to stray too far from the basic question, therefore: can we play well and without limitations using only C-Bills? The answer is yes, but clearly with some reservations. MechWarrior Online certainly does not arise as the most striking case of ~pay to win~ in circulation, but it is natural that users willing to dip into their wallets will be able to immediately buy the most powerful mechs and equip them as they see fit, while those who want to make a different choice or is simply ~evaluating~ the experience, he will find himself having to participate in quite a few games before being able to buy a model belonging to the most powerful classes and design its equipment around his needs. MechWarrior Online offers a lot of mechs and a lot of side, but suffers from some important limitations Matter of feeling One of the ~surprises~ introduced by MechWarrior Online concerns the enhancement of light BattleMechs, almost simple exoskeletons which however stand out on the battlefield for their speed and for the possibility of using retro rockets, a very useful tool when you need to move quickly vertically. A well-organized team can take advantage of smaller robots to distract opponents and open a gap in their defense by attacking them en masse, but the strategy in the Piranha Games title is an element that takes on different values depending on the substrate we are examining. In the first place, in fact, you have to come to terms with a control system that sees the upper and lower parts of the BattleMech independent of each other, a selection of weapons that certainly does not wink at immediacy and, finally, the environmental component that substantially affects what we can or cannot do once we are on a mission. We also add that for the ~novices~ a third-person view has been inserted which in itself goes a bit against what has always been the prerogatives of the series and its simulation intentions, which also translate into those limitationsfield of view systematics that combine with all the other elements to create the kind of gameplay that fans have shown to appreciate over the years. To try to balance the undoubted advantages of the external view, the developers have seen fit to eliminate here the useful radar that tells us the position of allied and enemy units on the map. However, let's go back to the strategy discussion, because a substantial part of the experience is undoubtedly expressed through the setup and customization operations of the mech, which at first appear a bit complicated (the interface doesn't help, let's face it) but with a little of experience actually add value to the package. With his eyes he can set fire to a moving spaceship Permissive free to play setting, different mech classes, many different weapons, many customization options and nine maps. Can we say that MechWarrior Online has hit the target? Unfortunately not, or at least not entirely. It is possible that the choice to include only two modes (the aforementioned Assault and Conquest: the first a traditional team deathmatch, the second a middle ground with points to be conquered) was made to never limit, in any way, the matchmaking; and from this point of view it is a choice that pays off, because there are always users and it is difficult to wait more than a handful of seconds to enter a lobby and then start the match. Different is the speech of the variety of the action, which would have benefited from different options, also and above all to further enhance the important strategic component of the game, the one that makes you avoid open-faced clashes in favor of studied assaults, in style ~ hit and run~, which produce much better results in the long run. Finally, the technical aspect: the need to create a free to play and the processing times (the project started in 2009) have clearly placed limits on a graphic that had to be as scalable as possible. However we know what CryEngine 3 is capable of, it has amply demonstrated it, and here the feeling is that the Crytek engine has not been fully exploited. The robots are beautiful, perhaps someone a little generic in terms of design, but otherwise we are only slightly above the average of free to play productions and decidedly below what one would expect from a title of this type and with these ambitions.", "date": "2013-10-22", "grade": "6.5"}