{"name": "L'Incredipede trasformista", "ref": "https://multiplayer.it/recensioni/124381-incredipede-lincredipede-trasformista.html", "text": "A long time ago, in an unknown and pristine land, various creatures characterized by rather strange body conformations lived in peace. One sad day, unscrupulous men reached the shores of the mysterious island and, as often happens, in contact with the new creatures they showed the worst of them, not hesitating to capture those ~monsters~ and take them away to show them as trophies. From that day begins the long journey of Quozzle, the only remaining creature of his village, intending to seek refuge elsewhere but forced to cross a strange land full of obstacles and threats. The aim of the game is, essentially, to bring Quozzle from a starting point to an arrival point within various levels, trying in the meantime to collect objects scattered within them in order to meet the requirements required to access the following areas. An apparently simple request, if it weren't for the fact that the difficulty actually lies in the protagonist's particular ability to move, being an eye that can be moved on iridescent and branched limbs. The initial vision of such a creature is somewhat creepy, but by leveraging the little Frankenstein latent in each of us, we soon learn to love Quozzle as our own bizarre creature, forged according to the needs that the contexts of the various levels impose from time to time . Control over the protagonist is not direct, but takes place by alternatively activating the various muscles that control the limbs, which have different effects depending on their length and the ramifications with which they are scattered, based on convincing physical reactions both in terms of movement of the limbs and the contact between them and the elements of the scenario. It is therefore necessary to learn to dose the movement of the different muscles and find the right rhythm to make the lanky creature move in the right direction, trying to maintain balance, avoid obstacles, collect special objects and finally reach the beam of light that represents the exit from the level. Here: having explained the premise, we understand a little better the intrinsic difficulty of simply going from point A to point B for a bizarre creature like the Quozzle. Physics, adaptation to the environment and strange creatures form Incredipede, a truly original puzzle game Evolution and adaptation The initial choice between Normal and Hard determines a fundamental gap in the approach to the game, because the variation in the level of difficulty is linked to the possibility, in the difficult option, to freely modify and elaborate the body conformation of Quozzle, which obviously represents a considerable thickening of the game structure, compared to the management of the already ~prefabricated~ creature present in the normal mode levels. The most demanding challenge, therefore, is not only represented by understanding which muscles to activate and with what timing to reach the foreseen points within the levels as in the normal mode, but also by the creation itself of a ~custom~ version of Quozzle, with the total freedom left to the player to apply limbs, articulation points and muscles to the slouching be based on the needs posed by the conformation of the levels. The control is based entirely on the simulation of physics, and at first it appears disorienting: in many respects it closely resembles QWOP, the famous flash game that makes an apparently simple action such as running extremely difficult, and the points of contact in fact they are not missing. Incredipede offers a much more refined interpretation of this concept, but it is still a question of managing a simple movement in an indirect way on the basis of forces, support points, balance and joints and moments of discomfort are not lacking, especially in the more advanced levels. It is not easy to have complete control of Quozzle's movements and in several cases the evolution of events seems to have something random, with the wildest ~trial and error~ that leads to the desired results not always passing from an effective evaluation of the actions and command execution, but also with a fair amount of chaotic luck. It must be said that this certain lack of rhythm seems to derive directly from the coherence with which the developers have carried forward the original concept, proposing a puzzle game all physics and creativity, with the inevitable roughness that such a particular idea can entail. The amount of content in Incredipede is also remarkable, with 120 levels in total to complete in the two main modes and an editor that allows for a practically infinite expansion of game solutions.", "date": "2013-10-17", "grade": "8.0"}