{"name": "Knock-knock", "ref": "https://multiplayer.it/recensioni/124346-knock-knock-chi-bussa-alla-porta.html", "text": "Ice-Pick Lodge is a strange developer. Just scroll through his portfolio to realize it. He has never made titles with very high production values and has always focused on the creation of works that we do not hesitate to define as daring. Pathologic, The Void and Cargo! they are works with an angular and unsettling realization, conceptually difficult, but profound like few others and worthy of memory compared to the great mass of pre-digested meatloaves that are regularly offered to us by the industry. Perhaps this is why they have never had a great success, neither with the public nor with critics, the latter easy to criticize at the time of publication and equally ready for post-mortem re-evaluation. Knock-knock became possible thanks to Kickstarter. Without the crowdfunding platform, no one would ever have produced it, even if the amount requested was laughable for a large publisher (we're talking about just thirty thousand dollars... if you think about how much an average triple A costs). Describing its mechanics is very simple: in the guise of a grotesque-looking little man, you have to wander through the rooms of his house and turn on light bulbs to protect yourself from some apparitions. The goal is to reach the morning safely. Coming into contact with one of the creatures of the dark rewinds the night, pushing away the rising sun. Every now and then you can take a walk outside the building, an apparently useless action, but necessary for the economy of the narration, which we will discuss in more detail in the next paragraph, and in case of need you can hide behind the objects made to appear by adjusting the light bulbs. The rest is vision, if we want to define it that way, that is, a succession of small events narrated by voices and noises, as well as by a certain logorrhea of the protagonist, who is particularly keen to provide details on his activity and on how he built his refuge in the forest, to protect themselves from the outside world. But if his house is the result of so much ingenuity, why does it keep changing every night to the point that not even he can recognize it? Let's go on a dreamlike journey in the company of the unlikely protagonist of Knock-knock Dream world But what about Knock-knock? In theory, it is a horror game with very classic foundations, which have their roots in the fear of the dark. Who wouldn't be frightened by hearing ominous voices and noises in the middle of the night? However, if we overcome the easy interpretations and dig deeper, it is not impossible to discover one of the most lucid representations of the dark side of the dream world of the human being, as well as a fierce social criticism of the contemporary world. Who is the main character? A man child who has built a fortress of cynicism in which to escape from the outside world. His inner misanthropy has only seemingly protected him, actually causing him to become increasingly paranoid. Going further in the interpretation, the next step becomes almost automatic. The onomatopoeic title refers to the act of knocking. But who is knocking on the door of a seemingly insignificant little man without a defined role in the world? Are they just monsters who want to kill him? Are his nightmares taking shape? Or is it reality that claims dominion over his life by taking monstrous forms? To suggest the pathological state of the protagonist is not only his appearance, with that wide open eye, that disheveled hair, and that long dressing gown that is very reminiscent of those worn in asylums. His madness is suggested above all by his house, decorated with childhood drawings scattered on many of the walls, which recall some photos of Roger Ballen and other artists who have depicted the world of the mentally ill, with underground rooms that look like isolation cells and with walled up doors, a sign of an extreme search for security. Broadening the gaze, it is not difficult to shift the focus from the particular to the general, discovering in this apparently small work a wider world view that embraces most of Western society, alienated and locked up in self-constructed prisons from which one is afraid to go out and in which it is feared that someone else may enter. But now, interrupting the flow of reflection, we must necessarily ask you a question. Let's assume that this interpretation is valid. Incomplete. Not exact. Simply valid. Do you think these elements are part of the game? If they hadn't been there, what would have changed? That is, putting it differently, should the examination of the issues raised by a videogame work have any weight in the final judgment? Or are they issues that don't count for anything and it's useless for them to be raised to the reader's attention? These are not specious questions. Understand how the pensate is important because if we examine Knock-knock only in its pure game mechanics, we are faced with a product of simplicity, even banality, at times disarming. Appreciating it or not depends above all on giving more or less weight to these aspects that are often little considered in the reviews of our sector. Doing so is the only way to really make the world of video games grow, automatically asking more from those who develop them, from those who talk about them (that is, from us ~experts~ in the sector, who automatically should start developing a different way of talking about object of our work) and also to yourselves, the final link in the industry's food chain, the decisive one for deciding its fate.", "date": "2013-10-15", "grade": "7.5"}