{"name": "Cercasi Susan disperatamente", "ref": "https://multiplayer.it/recensioni/124241-lost-echo-cercasi-susan-disperatamente.html", "text": "The setting is that of a not so distant future. Greg and Chloe meet in a park: she has something important to tell him, however it seems that the matter is thorny. Eventually the discussion is postponed, but something happens: as the girl walks away, she is hit by a beam of light that generates a tremendous white flash. Greg literally sees her disappear and then is blown away by the explosion, only to wake up a few days later in the hospital. Doctors tell him he has suffered minor brain damage, but is otherwise fine. The point is, however, that no one remembers Chloe, not even the protagonist's friends. Where have you been? Why is someone trying to erase her from his life? But above all: does it really exist? This is the incipit of Lost Echo, an adventure for iOS devices that proves ambitious right from the start but which, for its entire duration (about three hours) instead maintains itself in a precarious balance, the one that generally distinguishes triple-A productions from select independent titles. Yet the values in the field are indisputable, first of all a technical sector that boasts extremely clean and detailed scenarios, characterized by an excellent ~futuristic~ design, which move during the shots with a fluidity and precision that we have rarely seen in the mobile sector. The sequences that are proposed to us often take on the connotations of an exercise in style in terms of directing, which then unfortunately results in textual dialogues only (and only in English) which know how to intrigue and even elicit a few smiles, but which in general bit for long and don't even think about considering the ~portable~ nature of the experience. Lost Echo will certainly appeal to fans of adventures, even if it doesn't shine in terms of gameplay A future to touch We were talking about the precarious balance. The splendid scenarios we have talked about are contrasted with polygonal models that often taste old: devoid of details, full of edges, animated in a barely sufficient way. The management rightly dwells on some shots, but then proves too hasty during an exchange that would have needed more consistency, such as the initial meeting between Greg and Chloe; but the examples are many. In short, there is a lot of good in this KickBack debut title on the iOS platform, but at the same time there are elements that taste naive and that needed to be treated better. One of these is the interface, completely based on the touch screen and actually very intuitive: you have to touch a point on the screen for the character to move in that direction, with a double tap to run and the simultaneous pressure of two fingers to highlight all the interactive elements. The problem is that the three-dimensional connotation doesn't always make it easy to move from one area to another, and therefore you have to proceed a bit by groping, especially in some locations. The traditional mechanics of ~point and click~ adventures are re-proposed in Lost Echo without particular variations on the theme, were it not for the inclusion of some mini-games. The game flows in a fairly pleasant way, with no gameplay sharpness and some sections darker than others, but it's generally difficult to get stuck in one situation. To keep all the parts of the experience together is the plot, which in itself is not very original but in certain moments it also knows how to surprise, letting itself be followed until the end with ever greater interest. Thanks also to the great atmospheric accompaniment.", "date": "2013-10-14", "grade": "7.5"}