{"name": "SSX On Tour", "ref": "https://multiplayer.it/recensioni/ssx-on-tour-2.html", "text": "All around After having changed the cards on the table with SSX 3, with this fourth episode - subtitled ~On Tour~ - the programmers did not actually want to change much in the substance of the gameplay. Surely, however, they have distorted the presentation of the ~package~ a lot, understood as the style adopted in everything that surrounds the actual game. The artistic direction is in fact absolutely unique, with a decidedly bizarre and markedly ~metallic~ style that permeates all the menus and interludes; unicorns who launch into guitars, donkeys in a daze, tongues and eyes jumping, all hand drawn and in black and white. The result is really intriguing, fun and above all perfectly integrated with the parts played. The creation of one's character is the fundamental step before starting one's career; the various modifiable elements are sufficient to guarantee a good customization based on anyone's tastes, and obviously there is no lack of the possibility of changing practically every element of the clothing by spending the painstakingly collected money. Those who have played SSX 3 will not struggle to remember the organization of the events, scattered on the surface of the huge mountain that was the protagonist, without interruption. On Tour instead takes a step back with a more classic approach; although there is also in this situation a single and very large mountain on which the various tracks are present, access to the competitions is subject to a simple passage through a menu. However, all this does not preclude the possibility of starting from the summit and reaching the valley floor, passing through all the slopes as in the previous chapter, for a total of half an hour of extreme descent without stopping. The variety of challenges proposed and conceived by creative programmers is truly remarkable, and is undoubtedly one of the strong points of Electronic Arts production. In addition to simple speed or points races, obviously obtained through evolutions, it may be necessary to knock down a pre-established number of tourists, stay in the air for a certain number of seconds, grind a certain number of meters, collect certain objects and so on. The numbers speak of a total of 135 events divided over 13 tracks, which is more than enough to ensure excellent longevity. Forward slowly From the point of view of the gameplay, as already mentioned, there are no big news. The most interesting is certainly linked to the inclusion of skis, which go alongside snowboarding as a ~means of locomotion~ to choose in the phase of creating one's alter ego. The differences are actually more aesthetic than practical, and even if the use of skis is slightly less immediate, there will certainly not be major difficulties for fans of the series in getting their hands, or rather their feet, into this new approach to ski racing. SSX extension. The Uber Tricks, absurd and spectacular evolutions trademark of the series, have been replaced by Monster Tricks; their access has become slightly easier, no longer requiring multiple pressures of the back buttons but simply the inclination of the right analog stick, once the appropriate bar has been filled. From a technical point of view, On Tour changes very little compared to its predecessor, probably given that cross-platform development needs have already reached the maximum development point with SSX 3. Nonetheless, the EA title is far from being aesthetically mediocre : the settings are very rich in details and full of crossroads to face, the frame rate is constant (apart from the Gamecube), the characters are well animated and the effects are absolutely good. It's not a jawbreaker, but seeing SSX On Tour in action is still a real pleasure for the eyes. The music selection is also excellent, with the main theme entrusted to Iron Maiden and the soundtrack composed of a large amount of songs (Bloc Party, Queens of the Stone Age, Motorhead, etc.) really perfectly themed with the action. On the contrary, the decision by the programmers to completely remove the far from unforgettable online component introduced with the third episode is surprising; we certainly won't miss it, but we would have expected a heavy revision of it rather than a simple and drastic sponge blow. Comment SSX On Tour is a product that fans of the series will have no trouble appreciating. Even without making any major changes to the formula of the third episode, this new chapter in the Electronic Arts series proves itself in every aspect as a well-crafted, well-crafted and - above all - extremely fun product. The lack of originality is evident, and for SSX 5 it will be nenecessary to give a much more marked turn. But as the latest chapter for this generation of consoles, SSX On Tour represents a farewell that at least lives up to its name. Pros Gameplay still fun Great variety in challenges Technically very good Cons Little change from SSX 3 Online elimination Cross-platform The differences between the three versions are really small, if not imperceptible, especially for the Xbox / Ps2 combination. The latter is undoubtedly the preferable, for the simple reason that the series was born around the Dual Shock and this controller is the best way to deal with EA's product. The Gamecube edition is slightly behind, despite the presence of Mario, Luigi and Peach as bonus characters, due to a sometimes dancer frame rate and less graphic cleaning. One of the best original series that Electronic Arts has produced during this console generation is definitely SSX. Born practically in conjunction with the debut of Ps2 in the States, and then followed by the more than obvious sequels SSX Tricky and SSX 3, the title of the American giant has managed to establish itself as the best exponent of the category of arcade snowboard games, where by arcade we mean everything 'other than directed towards the goal of realism. Yes, because the fundamental ingredients have always been leaps beyond any human possibility seasoned with chain evolutions, obviously on routes with monstrous slopes and very rich in crossroads, obstacles and fierce opponents. If it sounds fun on paper, it's actually even more so; especially with the third chapter in fact, the SSX series has reached such a balance and richness as to truly deserve a place among the best sports games of recent years.", "date": "2005-11-14", "grade": null}