{"name": "Lone Survivor Director's Cut", "ref": "https://multiplayer.it/recensioni/124137-lone-survivor-the-directors-cut-terrore-in-pixel-art.html", "text": "When Lone Survivor debuted on PC last year, Jasper Byrne demonstrated how it was possible to make scary and anxiety-provoking horror games even using pixel art graphics and side-scrolling mechanics. An idea that even users a few years older had almost forgotten. With over eight hundred thousand copies sold and a loyal following of fans, the British author has been faced with a new challenge in the last nine months: to bring his particular survival horror to the small screen of PlayStation Vita without losing even an ounce of the wearing atmosphere bleak and full of anguish of the original. At the same time, the experience had to be enriched with new ad-hoc content, sufficient to revalue a game that has now been on the market for over a year and a half. And who knows, maybe even to recapture those who had already played the role of the lone survivor at the time. Few interesting news but Lone Survivor remains terrifying even on the small screen of Vita PSVita trophies Not only are the Lone Survivor Trophies all secret, but the game even recommends turning off notifications. If you are curious, however, know that most of the Trophies must be unlocked by performing particular actions in the adventure, such as listening to your radio, drinking a particular drink or trying to talk to a specific character. There is no shortage of more difficult challenges, including having to complete the entire game without firing a single shot or witnessing all the endings. Forever alone (in the dark) The incipit of the Director's Cut remains absolutely identical to that of the original Lone Survivor: the protagonist, a boy called You throughout the game, wakes up in his bedroom ready to start a new day in a world turned upside down by an inexplicable epidemic that turned all his friends, relatives and acquaintances into monstrous creatures. Wearing a simple surgical mask in the hope that it will help to avoid contagion, You thus decides to venture through the corridors of his apartment building, not so much to escape or find a solution to the Apocalypse, but rather to meet other survivors with whom to pass the time . Because, despite what the title might suggest, the protagonist is not the only survivor, and he certainly has no intention of ending his last days in solitude. In the span of five abundant hours Lone Survivor tells an oppressive and disturbing story, in which with a fast pace the line between reality, the nightmare and the paranoia of one's alter-ego is continually crossed. Byrne had fun teasing the player, it shows: after a few minutes it almost seems like he is taking him by the hand inside a room full of humans, but the illusion lasts a blink of an eye and shortly after he is immersed again in the inside the darkness. When starting the game, the author himself advises staying in the dark, turning off the notification of Trophies and strictly using headphones. And from this point of view, although the title is also compatible with PlayStation 3, it is probably on PlayStation Vita that it gives its best, even if only for the simple possibility of being able to play indoors. The OLED screen of the portable console undoubtedly enhances the pixel art graphics, but the improvements in purely aesthetic terms concern some small refinements and are mostly evident in the lighting effects. It is no coincidence that several rooms have been ~embellished~ with the addition or repositioning of some lights. The inspiration from the disturbing and anxiety-provoking imagery of Silent Hill is palpable, and the alien and unreal atmosphere that is perceived passing from one room to another recalls psychological horror along the lines of Eternal Darkness, where a few on-screen events give life to a cascade of paranoia and anxieties in the head of the player. All this, it should be remembered, while in front of us there is a series of pixel art characters and stylized creatures. If Lone Survivor is such an effective survival horror, however, it is not only due to the audiovisual component: the flashlight, essential for interacting with elements of the scenario that are found in areas that are too dark, discharges the batteries in record time; ammunition, on the other hand, is so rare as to push the player to face enemies only if he has no other choice, alternatively preferring a more stealthy approach, perhaps sneaking inside a hollow in the wall or distracting the monster with a piece of meat. Then there is a rather simple system of hunger and sleep management, whereby you constantly have to recover and store food or go back to your bedroom to take a nap. It's amazing howand everything is amalgamated in a coherent way, and with the analog stick and keys the adventure is even more enjoyable than we remembered it: the version for Vita also offers the possibility of navigating the inventory or the menus via the touch screen, but to be honest we continued to prefer the use of traditional keys. On the other hand, the automatic aiming turned out to be more useful, which corrects You's direction towards the enemy as soon as the gun is drawn. Unfortunately, some of the defects that we had already noticed in the original game remain, and in particular with regard to 2D navigation within an articulated map, which can be disorienting on several occasions. Finally, in terms of content, the Director's Cut is limited to a few unpublished screens, a series of new objects, a couple of additional alternative endings and some new songs, although most of these innovations can only be enjoyed by replaying the adventure a second time .", "date": "2013-10-10", "grade": "8.8"}