{"name": "A tutto Free to Play!", "ref": "https://multiplayer.it/recensioni/123919-ascend-hand-of-kul-a-tutto-free-to-play.html", "text": "The wave of ~free to play~ game on Xbox 360 with the strategic Happy Wars continues unabated but rather continues to offer truly interesting titles and, by their very nature, fully playable without paying a euro. The free to play mechanism is twofold, being enjoyable for free but suggesting paid shortcuts to achieve certain objectives faster and less complex. A new title has appeared on the Xbox 360 marketplace, also freely downloadable, this time in that purely action RPG genre that will delight all those who, on the one hand, love to ~grind~ in complex adventures full of collectibles, from another appreciate the action and immediacy of fast-paced, lively gameplay. It's called Ascend: Hand of Kul and is published directly by Microsoft Game Studios, even if developed by the guys from Signal Studios, already authors of another excellent Live Arcade title called Toy Soldiers. As we will analyze better later, the main feature of this new free to play is that it is extremely enjoyable even without being forced to microtransactions to compensate for any deficiencies in the game that may have been created ~ad hoc~ as often happens for this kind of title. In reality, this time, you don't even notice that you are facing a real free to play because the gameplay and the evolution of your hero go smoothly without ever running into a hitch or forcing us into long obligatory killing sessions. The game's virtual currency consists of Souls, extrapolated from enemy corpses and automatically earned after each kill. By accumulating them, you then have the opportunity to spend them to unlock new weapons, clothes, armor and potions... which is the essence of any self-respecting RPG. The purchase option is always lurking, obviously, but it is never proposed as a forced choice or in any case strongly encouraged and ~induced~ by specific elements of the game. For example, in some free to play games we often find ourselves faced with enemies that are always too strong for the natural level that our character can potentially reach, thus generating a refined frustration that the player naturally tends to eliminate by purchasing paid items, in a sort of induced purchase in a more or less elegant way. Ascend: Hand of Kul, on the other hand, is a free to play that is polite and without this kind of artificial trickery, always giving the impression (and so it is) of playing a ~real~ action RPG. Clash of Gods and Titans The plot from which Ascend: Hand of Kul starts is relatively simple and bewitching. We take on the role of a hero on the side of one of the three Gods destined to reign after the fall of the Titans. Our task is to help one of these three future emperors to definitively defeat the Chaos organized in armies of death and led by granite and huge bosses. After choosing which faction to fight for (the God of Darkness, Light or the Void) you start crossing the regions of the Highlands represented by a varied mix of wastelands, deserts, forests and swamps. The game settings are undoubtedly evocative and artistically well designed, betraying a certain inspiration from World of Warcraft and a style that will also appeal to Darksiders lovers, very colorful, with sharp edges and with ultra-marked and exaggerated physiognomies. The lands of Ascend are full of enemies to mow down in order to obtain their Souls and thus help our God to regain supremacy over humans to the detriment of the armies of the Titans. By accumulating Souls, these can then be converted into weapons, clothes and upgrades, mainly runes to be set in objects in our possession, but also spells and evocations. Some weapons can even be equipped by three runes at once, while even the best armor can house a single power up at a time. Our every action within the game has a direct effect on the supremacy of our God within the balance between Dark, Light and Void, being able to increase the influence of each of them on the surrounding world to the detriment of the other two (and obviously of the Titans as understood), annexing territories and enlarging our conquests more and more. The balance between the three can always be consulted through a map that displays the percentage in which the territories are dominated by the various factions, thus also combining strategic elements to the game. Ascend: Hand of Kul is a joy for all fantasy RPG fans! (and it's also Free to play) Xbox 360 goals Ascend: Hand of Kul offers 400 points to unlock through 30 objectives to be achieved. They are not all very easy to obtain, for example there is to reach the livello 50 three times, or upgrade an armor up to level 2000 and contribute 50 thousand points to your crusade. Half of the points will be unlocked automatically by completing the whole adventure, for the other half there will really be sweating instead! Let's invade enemy territories! As we lord it over the Highlands, annex territories under the influence of our favorite Deity and defeat Titans galore, we must always keep in mind that we are connected via some sort of space-time portal to the parallel realms where our friends play online. In practice we can always see what the other players are doing in that precise place where we are, visualizing them as an immaterial ~spirit~ with which, however, it is possible to interact. Everyone can help or fight the other players but not directly and physically, but through magic and numerous spells that can be used divided into ~blessings~ and ~curses~. For example, you can launch a ball of fire that helps our friend get rid of the enemy hordes, or make him materialize against armies of undead, warriors or black wolves. Our spells therefore have a direct effect on the matches of other allied (or enemy) heroes, and so vice versa, managing to create a sort of persistent online world that overlaps our offline adventure in a natural and innovative way. It is somewhat reminiscent of Fable's first attempts to create a mix between the offline world and online interaction. In addition to these important features, Ascend: Hand of Kul is a solid RPG with countless collectible elements. Speaking of the weapons available, for example, there are more than 350 different objects divided between axes, swords, two-handed weapons and hammers, each of which can be upgraded with one, two or three runes. The weapons are divided into common, uncommon, rare, special and ~purchasable only~ (let's remember: it's free to play). Then there are the elements of clothing and armor, also divided into categories based on availability. In addition to these objects, by leveling up we can unlock various emblems related to our Divinity. There are fifteen available for the Light faction, as many for the Dark and the Void. Each of these unlocks a specific quality such as doing more damage with spells, resisting more to enemy ones or increasing the chances of thwarting an attack. Our warrior slowly becomes bigger and bigger, bad and full of emblems that help him overcome the most difficult enemies, progressing from level 1 up to 60 which is the maximum achievable. Then there are also various ~boosts~ to be used to give certain advantages to your alter-ego and which work a bit like runes for weapons, only that these apply directly to the character. Greater energy recovery or attack speed, for example, but also specific boosts that allow us to enter some dungeons for a limited time, or that disable interactions between online players, preventing them from sending or being cursed. Inspirations and aspirations From a game so full of gameplay and inspirations (World of Warcraft, Darksiders, Dark Souls, Warhammer, Diablo, but there is also a lot of Robert E. Howard) you would like more and more. For example, a real co-op multiplayer would be desirable, a PvP, but also some sort of online ranking (for example for the combos made). The upgrades could be many and they are all at hand, also considering the great support that the team is giving ~post exit~. On day one, a patch was already available that corrected numerous graphical and gameplay bugs, another is coming to plug some imperfections such as the sporadic blocks from which the game suffers and disconnections from the network. In general, Ascend: Hand of Kul is still a very clean and refined game, without major bugs and with pleasant graphics. The audio-visual sector is decidedly well-finished and beautiful to look at, especially thinking of being in front of a Live Arcade, which is also free. The proprietary graphics engine does not work miracles but performs its tasks very well, giving a solid cosmetics with a distant horizon, full of details, effects and elements on the screen. The musical accompaniment is the classic western fantasy one: epic, orchestrated, worthily performed and never suffocating despite its typically RPG pomposity. Ascend: Hand of Kul is certainly one of the surprises of the year, and given its nature we would recommend the download, if only for a joypad test in hand.", "date": "2013-10-07", "grade": "8.5"}