{"name": "Facciamo il trenino", "ref": "https://multiplayer.it/recensioni/123991-pocket-trains-facciamo-il-trenino.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. Released last year, Pocket Planes turned out to be a pleasant surprise, effectively succeeding in proposing a simulation that is simple to assimilate but deep enough not to be too trivial, all served in an honest free to play format, i.e. capable of leave the freedom to those who wish to continue even without using a credit card. It is difficult for such an exploit to remain isolated, and therefore the Californian developer has put a similar setting back on its feet with the Pocket Trains present here, replacing the airplanes with trains and making some changes to the gameplay. Railroad take me away The similarities between Pocket Trains and the previous title mainly involve the basic play structure, which has remained substantially unchanged: the player's task is therefore to expand the transport network, starting with a small handful of vehicles and destinations and increasingly expanding the own domain globally. The absence of competitors and particular obstacles along the way that do not involve the purely economic aspect are the two key factors that traditionally distinguish NimbleBit simulations, and which regularly recur here: playing Pocket Trains therefore immediately proves as a light experience, to which it is preferable to spend a few minutes during the day rather than intense and prolonged gaming sessions. However, to say that the transition from aircraft to locomotives has led to the gameplay being a little more on the rails is not just a pun: Pocket Trains is actually a bit more guided experience than the previous one, starting by the characteristics of the transports. In fact, if in Pocket Planes the planes could reach any destination that was within their reach, here each train can only travel its own route which must be duly planned by the user. This is the most strictly strategic step of the entire experience: the ideal is to build a railway that guarantees sufficient (and profitable) wagon traffic without forcing the locomotive to travel excessive distances. There are several factors to take into consideration, starting from the characteristics of the engine in terms of fuel capacity, speed and towing capacity up to the mere cost for the inauguration of a new section of railway. Once this is done, we are faced with the same crossroads already known in Pocket Planes and in many free to play games, i.e. put your credit card to buy resource packs or get ready to make many trips to be able to scrape together the money necessary to expand the own railway empire. Compared to the previous one, however, a disproportion between outgoings and incomings is evident, in the sense that you literally have to pay to have any kind of service (from the opening of a new station to the simple commissioning of a new locomotive), often with very high ones that require a lot of work to be satisfied without going through the store dedicated to in-app purchases. Pocket Trains is a pleasant pastime for those who have a lot of patience or don't mind in-app purchases Even the system adopted to buy new trains or to evolve existing ones tastes like a bit of a scam: instead of simply putting the items up for sale in a special menu (as happened in Pocket Planes), the developers have decided to manage everything through boxes -prize with unknown contents, which require the disbursement of currency only to be opened and reveal what they hide. Considering that a tractor requires a certain number of pieces of the same type to be built - a number that increases the more the vehicle is valuable - it is clear that you end up spending much more time and money to have access to a single model. NimbleBit has therefore pulled the string a little more to push the user to spend real money, a totally legitimate action for a free to play but which inevitably makes Pocket Trains significantly less pleasant than its predecessor, as well as potentially much more repetitive given the extreme slowness with which wealth can be accumulated. That said, the bearers of great patience or those who don't mind resorting to in-app purchases are undoubtedly those to whom the NimbleBit title isdestined to give some more satisfaction, making itself strong of a tested structure and a simple but strangely exciting gameplay. All this is accompanied by the traditional and always enjoyable pixel art graphic design typical of the Californian developer's works, even if this time combined with more realistic landscape elements that appear a bit like foreign bodies in the aesthetics of the game.", "date": "2013-10-05", "grade": "7.5"}