{"name": "Operation Tango", "ref": "https://multiplayer.it/recensioni/operation-tango-recensione.html", "text": "It's been two months since the world was shocked by the unexpected success of It Takes Two, a new game by the chaotic but talented Josef Fares. Now, we have the opportunity to play another work that follows the same philosophy: Operation Tango. Two players, headphones and microphone within reach and pure cooperation are the key ingredients for this adventure. Let's see in our review of Operation Tango if this interesting proposal deserves your attention. Born spies Operation Tango takes us around the world to fight a cybercriminal Operation Tango takes you into the world of espionage. Players will take control of an Agent and a Hacker and will have to infiltrate six different locations in order to recover vital information to stop a conspiracy that could have worldwide repercussions. Operation Tango follows a very classic plot for the espionage genre and involves multinational corporations, a future that risks becoming dystopian and an evil hacker to track down and stop. Unfortunately, the story is very simple, a collection of very short generic cutscenes that give context to the missions and little else. It is more of a basic justification for us to travel around the world, not a real spy story with dramatic implications. Furthermore, the work does not even have the time to build a complex plot due to its limited longevity: we are talking about a maximum of three hours (99% of which are gameplay) to complete all the available missions with a single character. Fortunately, the number can double if you decide to revisit each mission from the opposite point of view and, as we will soon see, there is absolutely reason for it. You need two One of Operation Tango's greatest strengths is that it's two games in one. In fact, the Agent is in the field and must physically infiltrate protected places, avoiding drones and interacting with devices within reach. The Hacker, on the other hand, stays safe and, through his own computer, enters the security systems and interacts with cameras, plans and intercepts incoming information. These are two very different experiences, but equally fun. Of course, cooperation is essential: every few steps there is an obstacle, whether it's a closed door, an elevator that doesn't move or invisible lasers. Players have to constantly exchange information to figure out how to proceed. Most of the required actions, therefore, are simple to perform: press a button, enter a code, dodge a couple of drones. To make everything much more satisfying, however, is the fact that it is impossible to do anything without the support of the second player. Regardless of what is required, every player is always missing a fundamental component to do what they need to do. You are never silent, therefore, and the fairly sustained pace of the game helps never create a moment of emptiness. Operation Tango: some mini-games take us into virtual mazes The only more ~structured~ gameplay phases are linked to some cooperative mini-games, such as puzzle games in which you have to move a series of blocks to bring a key to the exit. Or even levels in which a player must create a path with a limited number of boxes available, to be positioned on the basis of the indications of the second player, the only one able to see mobile traps. Operation Tango, on average, is very simple and, even if the minigames can cause some game overs, the checkpoints are very frequent and often allow us to restart literally a second before the error. There is never a waste of time and therefore it is not necessary to redo entire sections in case of an error. Furthermore, the developers have included a system of suggestions to help the less experienced, in case you find yourself stuck and don't understand how to continue. In our case, however, we never needed to activate it, a symptom of a game with an optimally calibrated difficulty. Operation Tango is always very logical and clear in its objectives, so it's impossible to find yourself shooting without understanding exactly what you have to do. At the same time, there is always a moment in which you have to look around and discuss with the second player, trying to understand where you are, where you have to go and what information the other needs to move forward. This cooperative game therefore pushes for reasoning without ever being bizarre. The variety of situations is also excellent. There are very quiet missions, where you can act without haste. Others in which countdowns start. Situations in which the Hacker and the Agent are reversedrole tone. The aforementioned mini-games are perhaps the only element that repeats itself a bit too much, especially considering that Operation Tango is quite short: in any case they are not boring and that's what matters. Around the world Operation Tango's game environments are all a bit too generic The graphic and artistic side is a little less interesting. On a technical level we are talking about a low poly game and with areas that are always quite small. It is an indie work in every respect, but in our opinion there is no need for much more. On the artistic side, however, we would have liked a little more personality. The game, theoretically, takes us around the world, but we never perceive that we are in the East, South America or South Africa: all places are interchangeable and become a generic ~short-term future~. Adding the fact that the story is almost superfluous, Operation Tango lacks a bit of character on an artistic level. However, this is the least important defect in our opinion. Finally, the sound component does its job, but clearly does not have much space available. Remember that most of the time we will have the other player's voice in our ears, music and effects must be in the background, a must.", "date": "2021-05-26", "grade": "8.0"}