{"name": "L'Impero va in Tilt ancora", "ref": "https://multiplayer.it/recensioni/123817-star-wars-pinball-limpero-va-in-tilt-ancora.html", "text": "The goose that lays the golden eggs of Star Wars shows no sign of ending its production but, for the millions of fans scattered throughout the globe, this is certainly good news. While waiting for the announced continuation of the saga at the cinema, with the mysterious Episode 7 on which Disney is already at work, as well as, hopefully, an adequate title to play, perhaps on the new generation consoles, the guys from Zen Studios dust off a great classic of entertainment straddling the mechanical and the digital, i.e. the pinball machine, declined in an ~imperial~ sauce. The Nintendo 3DS version of Star Wars Pinball therefore adds three new settings to play compared to what is available on other platforms, a trio of tables that are very different from each other in terms of approach and graphic style. The 3D effect Activating stereoscopic 3D in Star Wars Pinball can have a double effect: on the one hand it is certainly positive, giving the game table an almost tangible depth and truly enriching the visual experience, but on the other it is a bit annoying, given that the inevitable movements due to the very nature of the title tend to move the screen from the best point of view, creating eye strain. Star tables After deciding whether to collect one's records in favor of the Force or its Dark Side, a choice proposed only at the first start of the game, the initial set available in Star Wars Pinball, in the version for the Nintendo laptop, is the one dedicated to the Episode V: The Empire Strikes Back, as known the second film in order of production but precisely the fifth chapter in the original history created by George Lucas. The pinball table, on which the dark figure of Darth Vader dominates at the start of the level, has a more airy structure and, if you like, simpler and more predictable to manage than the other two; accumulating high scores therefore seems, at least in theory, less difficult. Things get a little complicated already from the second game framework, dedicated to Episode II: Attack of the Clones. Once selected, the famous scrolling preamble text begins welcoming the player into a blaze of lightsabers and bright colours. The speed of the ball increases, as does the reflex skill required to control it. The last available option is the skin inspired by Boba Fett, the clone of the bounty hunter Jango Fett. Here the spaces become narrower, the sphere unpredictable and the speed decidedly high. Managing a game is not easy but there are many hidden bonuses, including score increases following funny skits. Star Wars Pinball on 3DS offers three new tables, but only if you play offline! The attack of the bugs While there is little to say about the actual gameplay of Star Wars Pinball (anyone who has only seen a pinball machine, live or digitally, knows very well how to use it), it is good to spend a few more words on the controls, which are really very intuitive . The Nintendo 3DS back buttons are responsible for repelling the ball and, despite the short stroke, they perform very well; the A is for the initial launch, the Y for changing the camera (the best is probably the dynamic one that follows the movements of the sphere, but there are three other shots) and the analog stick to perform the typical but dangerous ~tilt~. It is therefore a classic from all points of view, with the multiplayer mode usable by passing the console physically between the players and with the only online functionality linked to the rankings of the scores achieved. Right here, however, the big problem arises, detected immediately after the first installation: if you start the game with a Nintendo 3DS connected to the internet, Star Wars Pinball crashes and forces you to restart the console. Just turn off the WiFi switch and everything works fine, but giving up the comparison with the scores of other players. A very annoying bug, even if not very serious, which however blocks the only competitive ambition of the title; we hope for a quick solution of the problem by the developers through patches but, at the moment, the defect persists. The last note goes to the frame rate, not exceptional especially with the 3D active, while the epic soundtrack, able to give the charge, must necessarily be listened to with a pair of excellent headphones, in order to give it the right artistic merit .", "date": "2013-10-02", "grade": "7.0"}