{"name": "Assieme", "ref": "https://multiplayer.it/recensioni/123766-rain-assieme-sotto-la-pioggia.html", "text": "While everyone looks forward to the new generation of consoles, PlayStation 3 users are experiencing what is probably one of the richest years for the current Sony platform, and not only thanks to blockbusters like The Last of Us, God of War : Ascension and Beyond: Two Souls. Between independent games and small-scale projects, PSN has seen a series of extremely original exclusives since last year, from Sound Shapes to Journey, from Dragon's Crown to The Unfinished Swan. Since its presentation at Gamescom last year, Rain has presented itself as one of the most interesting pieces of this mosaic. Answering the question ~What super power would you like to have?~, invisibility is probably one of the most coveted. After all, who knows how many have fantasized at least once about mischievous actions and pranks that can be done knowing that no one sees them. Yet in Rain, invisibility is neither a gift nor a curse, but at the same time it is both. From the moment the boy protagonist sets foot out of his bedroom, he realizes his strange condition: his body can only be glimpsed when it is wet from the rain, but when it is indoors it is completely invisible. Thus begins a melancholy story of trying to save a little girl being pursued by an imperious and sinister figure, the Dark One. In order to reach it, one thus crosses a deserted city, where it is always night and the rain never ceases. Rain is a melancholy poem that holds you close even after you turn off the console Playstation 3 trophies In a decidedly unoriginal way, Rain allows you to unlock Trophies as you complete the various chapters of the story. The last three are then obtained by playing the adventure for a second time and collecting the memories hidden in the different settings. In the moonlight For about three hours we visit desolate neighborhoods, European-inspired architecture, in a sort of phantom Paris that becomes increasingly foreign and changeable. Chapter after chapter we go from an abandoned church to a huge factory, from a sewage system to a small circus, in a linear way and without freedom of exploration, right up to the final bars, where the setting becomes more illogical and irregular as the player understands what is the secret behind this rainy world. Too bad that this great revelation is not able to fully impress or surprise those who play, above all because of some perhaps too obvious clues that are given right from the characteristic watercolor introduction and which leave time to formulate more than one hypothesis. Despite this, and despite underlying sins of little courage, Rain's conclusion is still moving and effective, able to deal very effectively with the contrast between light and darkness, between life and death. Early on, the ability to only be visible in the rain hinted at a heavy emphasis on level design and puzzle-solving, but designer Tomokazu Ohki's work actually boiled down to a few interesting puzzles. Most of the time you take cover under a balcony so as not to be seen by enemy creatures, you jump into puddles or use objects to attract their attention, but even if you often die between one attempt and another, the adventure it never accelerates for the level of challenge and depth of play. The idea that the mud dirty the boy's feet, making him visible even in the rain, is never really exploited for interesting stealth sessions, while the interaction between the protagonist and the girl fails to reach in any occasion that degree of complexity that was seen, for example, between Ico and Yorda. When we met Yuki Ikeda at the last Gamescom in Cologne, the director of the game told us how the most difficult challenge for the team was managing the camera in the sequences in which the character is completely invisible. In fact, it is still possible to notice some screens in which ~blind~ navigation is rather difficult, and perhaps this was one of the major limitations to the puzzle design, but overall PlayStation C.A.M.P. he managed to pack an experience capable of not disorienting, so much so that it never happened to die due to the badly positioned camera. But the real protagonist of Rain is not one of the characters, it is not the rain or even the city, but the feeling of loneliness and uncertainty that now envelops and now leaves the player. Through a mixture made of gameplay, visual sequences and screen texts, Ikeda's game manages to make you feel extremely strong emotions: the sense of loss in a city athyena and deserted does nothing but accentuate the desire to reunite with someone, but the gift of invisibility becomes a curse when we try in vain to get noticed by the little girl. And when we finally stop being ~lost children~ and manage to reunite with her, the journey takes on a completely different flavor. The city is exactly the same as before, gloomy, desolate and rainy, but walking through it with someone almost adds liveliness to the cold and desaturated artistic style chosen by the authors. Then everything falls back into the greyness of before, and in a melancholy swing one experiences the discomfort of abandonment, the inalienable attachment to someone, the desperation of loss and the hope that sooner or later we can be reunited. Rain is a poem that vibrates more or less strong emotional strings depending on the sensitivity of the player, and on the experiences with friends, brothers or with the person you fell in love with, through a type of narration that holds you close during the journey and stays with you after you turn off the console. In this, the sound component plays a fundamental role, on the one hand with the incessant noise of the rain, on the other with a re-adaptation by Clair de Lune which accompanies a series of touching original songs.", "date": "2013-10-01", "grade": "8.8"}