{"name": "Ape Academy", "ref": "https://multiplayer.it/recensioni/ape-academy.html", "text": "Shock the Monkey Ape Academy is a collection of a lot of mini-games, all performed by brightly drawn and colored monkeys, clumsy in their movements and decidedly generous in producing the typical cries and screams of the species. The spirit of the game is similar, in feel and aesthetics, to the previous Ape Escape or EyeToy Monkey Mania, but this version for Playstation Portable follows a fully ~Wario Ware~ style of play: quick, simple, intuitive and repeatable Shock the Monkey . The mini games include reinterpretations of table hockey, football, racing of various kinds and other more or less sporting events such as juggling juggling, but the collection also includes rhythm games, quizzes and reflex games , all with a hilarious-monkey-unlikely theme. All mini-games are progressively unlockable, and offer the excuse for a six-year ~primate academy~ organization of the game. To pass each year of the ~academy~ the player will have to overcome the games offered by the console obtaining positive marks that will allow him to flesh out his own grid of successes and move on to the following years. In full Wario Ware style, overcoming the games offered at random by the console as the difficulty increases makes conquering the summit challenging. Starting from the Junior Level and conquering the mini-games, the player wins the academic year and the possibility of playing the games conquered in the Collection mode, as well as various types of bonuses collected in the Academy mode and surfable in the options and in the collector mode Showcase. There is also the possibility of using all the unlocked games in wireless multiplayer with another player equipped with a PSP, while some games allow multiple players to use different parts of the controls of the same console, a bit like what happened for the old MicroMachines ( even if the multiplayer mode is limited to proposing the same, identical games for several players). Shock the Monkey On paper, the premises and structure of the pick and play game full of mini-games are there. What makes one miss for the success of Ape Academy, however, is precisely the substance of the game. The first problem with Ape Academy is that there aren't that many mini-games. In all, there are about fifty of them, but net of the versions with different difficulties of the same game, the number of actually different games is quite narrow. Mostly, the mini-games are generally underwhelming. More often than not, the controls are imprecise and slow, in some cases even poorly implemented. The mini-trivia game case is hilarious by its outcome, not its intention: in asking for real historical data, it looks more like a game of Trivial Pursuit than a mini-game for a pick and play title. Although the themes of the mini-games, mostly based on Wario Ware and Mario Party, are generally amusing and proposed with a cartoonish and engaging look, the speed of the times required to overcome them does not correspond to a game design capable of offering a challenge for the player who is as much fun on paper as possible to overcome. This weakness in game mechanics is compounded by a couple of flaws in the game's design. For starters, the instructions that precede the mini-games say next to nothing about how to actually play, resulting in the kind of frustration that comes with losing in seconds without knowing what needed to be done - which is detrimental to games of for if not brilliant. Then there is the serious matter of loading. The waits between one minigame and another are unjustifiably long and tedious. Not only do they break the action of the game, which should be frenetic, but they also make the UMD driver of the Sony laptop look bad and unfair. Above all, loading destroys the very concept of a pick and play game, made to be frenetic, intuitive, devoid of not only playful but above all technical dead times: it will never be possible to turn on the game, pass two levels, pause it at flight and get off the bus stop, which is very feasible with the titles that Ape Academy tries to resemble. Ape Academy mimics Wario Ware, but proves he hasn't learned the fundamental lessons on the philosophy of the pick and play game. The mini-games are nice, in some cases enjoyable, but generally not at all original, with imprecise controls and instructions that make it difficult to understand what to do. Ape Academy is a very colorful and fun game, but it tends to be more fun to look at than to play. If a thousand monkeys can't write Hamlet, the Wario Ware game seems easy but it isn't. But the real sore point of this monkey-like and lively product is actually, is another: the inconceivable presence of long, boring dead times necessary for loading between one level and another, which break up the action and make the frenzy required by the genre impracticable. Not optimizing the loading times of a collection of Wario Ware-like mini-games on a laptop is a triple crime: to the philosophy of the genre; to Sony's portable UMD driver; and to Ape Escape itself, a nice game that could have turned out to be perhaps not excellent or original, but at least worthy of being tried. Waiting for a next repair episode, one wonders: will they really have invested enough time and monkeys in Ape Academy? Portable consoles would seem to be made especially for so-called 'pick and play' games, those equipped with frenetic mini-games, quick to play and finished in a matter of minutes and then turning off the console, putting it in the bag and getting off the tram. And although this ~hit and run~ gaming philosophy is much more represented on the Nintendo DS, both in terms of the possibility of tactile interaction with the screen and of dedicated games, the multi-media, stylish and powerful Playstation Portable certainly cannot afford not to host titles of this kind between the offer of its soft library, or between one UMD film and another. Ape Academy, a collection of mini-games conceived as an Olympian/academic competition between goofy and hilarious monkeys, is the answer to this line-up need. But if monkeys are mischievous, pick and play games aren't as easy to program as they are to play. Due to a number of game design and implementation issues, Ape Escape fails to shine, or even come close to the gorgeous minimalism of games like Wario Ware. And although it is by no means a bad game, the main mistake in its realization was precisely to try to make a hit and run game and manage to produce one that, paradoxically, is frustrating to play ~on the fly~ .", "date": "2005-11-12", "grade": null}