{"name": "Ritmo indiavolato", "ref": "https://multiplayer.it/recensioni/123767-f1-2013-ritmo-indiavolato.html", "text": "Last year, on the occasion of the F1 2012 review, we talked about how Codemasters was able in just one year to escape the sad ~refrain~ of sports titles that sees them change little over twelve months. The novelties on that occasion were the scenarios and the championship challenge; today we start from those well-chosen certainties but add another one of far greater depth: F1 Classics. Anyone who buys the standard version of the game will be able to test themselves with five cars that made history in the 80s on two ~mythical~ circuits, namely Jerez de la Frontera in Spain and the very fast race through the English woods of Brands Hatch. Those who buy the Classic version at a higher price, on the other hand, will also be able to challenge the great talents of the 90s, such as Jacques Villeneuve, Jean Alesi, Damon Hill and many others, on tracks where today (unfortunately) there is no racing more, such as Imola and Estoril. In short, a significant added value both for young Formula 1 fanatics and for the more elderly who trembled to hear the voices of Mario Poltronieri and Ezio Zermiani, and which represents the only novelty in a package that has changed little compared to the last edition , which highlights its unresolved ~long-term~ problems. New content and old issues for Codemasters Formula 1 2013 How you want it The game offer is, as per the textbook, very full-bodied and completely customizable by the player. The extreme scalability of both the driving model and the way of enjoying F1 2013 represent a notable plus for the work of Codemasters. This is certainly not new, but effective in making the English kids' Circus attractive to everyone, placing the game in that middle ground between arcade and simulation, perfect for the ~generalist~ console user. But it is enough to reduce or completely cut the aids to make driving decidedly demanding, which requires a handle, a lot of dedication and steady nerves to arrive safely at the finish line. By activating everything, the car practically goes by itself; only the curb and the braking point cause us some thought while, as written above, starting to lower the assists, the single-seaters immediately become more nervous, obviously not impassable, but much more fun to tame. By resetting everything, it's a completely different story: every full opening of the throttle means turning around; you must therefore learn to choke properly, wait for the brakes and tires to reach temperature. In short, you have to play with knowledge of the facts, and take into account a lot of practice before starting to shoot on good times. Career is the highlight of F1 2013: it allows us to live five seasons, starting from a low-profile stable (the results of the test for young drivers unlock the teams available to start with) to then move up to the teams that can aspire to the world title . Everything as per script, with objectives within the tenders to obtain developments for the car, and offers during construction. Really useful news is the possibility to save a session - even in the race - whenever we want. It seems like a trivial addition, but it's terribly useful even when we set the duration of the race to a minimum (minimum to be understood as 14 laps), let alone when we want to do a 100% Grand Prix. The choice of how to play the career affects not only the player's time commitment but also the quality of the game experience. Codemasters' desire to bring Formula 1 in its entirety to our monitors has fielded a whole series of real variants that we must take into account in order to try to bring home a decent season. Customization is everything, not just the level of difficulty. If setting the traction control halfway can put all those who only know throttle open/throttle closed into a crisis, forcing them to come to terms with a high sensitivity on the indexes that shouts loudly ~Give me a steering wheel with pedals!~, choose making the regulation and the flags realistic can play tricks on your nerves, effectively ruining a race that is all played on hundredths of a second. The problem is ancient, and not resolved, perhaps just a blunted edge compared to the past year. The artificial intelligence of the opposing pilots is undoubtedly aggressive (provided, however, that you set it at least to professional, the third of the five difficulty levels) and tends to attack us as soon as it sees a glimmer of light following its ideal trajectory, which is obviously also ours. Such routines create situations that we would hardly see in reality, with the result that we will often run into ten-second penalties for accidents that we did not actually cause, also because we did not see(and not always) that the nose of the other car for a fraction of a second. Without forgetting attempts to overtake almost on the grass. What to do then? Do we not defend ourselves, do we let those who are faster than us pass without trying to close the door or maybe we set the flags only on the cut of the curve, not caring about the integrity of the simulation? Obviously this doesn't always happen, but in the middle of a duel one is always uneasy, and if there are no more flashbacks, the omelette is done. The unpredictability... All this also corresponds to the usual, difficult to understand, management of damages, which does not seem to have evolved compared to the past. F1 2013 almost always tolerates rear-end collisions; the nose seems to be made of steel, it is not possible to understand exactly what is the line drawn by the developers beyond which something must be broken. It's all very random; the damages are undoubtedly there, and they weigh effectively on the driving model of the car, but they don't seem to enjoy real coherence with the race situations, even obviously by setting them to real. It's a bit of a pity, because between a credible and realistic simulation of tire decay, without forgetting an intriguing application of the race strategy, complete with re-entry management and the more or less ~explosive~ mixing of petrol, Codemasters has done a good job to allow us to effectively relive the Formula 1 Circus. Above all, however, the dynamic weather stands out, capable of upsetting any previously prepared plan in the blink of an eye. Attempting to (re)explain it makes little sense, it's just like we see on TV. It can rain, the track can dry more or less quickly, some areas of the track can be wetter than others, so choosing when to go back to the pits to change tires therefore becomes fundamental. And then there is also the possible safety car to take into account. A real lottery in certain situations, but not always perfect, we witnessed some erroneous calls from our engineers, who invited us to mount slicks despite a wet track and modest rain, and then ~scolded~ us to come back to change the tires from dry, after they had recommended it to us on the previous lap. In short, the usual problems, which cannot be solved year after year and which only thanks to the customization of the gaming experience can take a back seat, however to the detriment of total ~loyalty~ to the race weekend. The rest of the game offer is the usual one (apart from the classic single-seaters) and represents not a simple side dish to the career but something tasty, effective in cutting all the delays of the three days of competition. Championship challenge allows us to race in a shorter competition, ten races consisting of just five laps, with only one lap to attempt pole, and then straight into the race. Fast and uncompromising, you have to give your best right away without any single-seater management, to earn offers from the top teams and to win the championship. The timed, against the clock and single race modes are complemented by scenarios, both for the 2013 season and for classic cars. There are no less than twenty for the current season: they engage us in borderline situations, simulating the difficulties of a career from rookie driver to legend in his last year of activity. You go from being able to finish in front of your teammate, to recovering ten seconds lost after a penalty, up to those borderline situations in which you have to go all out under the water. In short, pure adrenaline, which must be experienced when you are familiar with the tracks, capable of condensing all the reasoned frenzy of Formula 1 into a few laps. Less electronics more handle And then alongside all this there are the classic single-seaters of the 80s, a real godsend for aficianodos, capable with their ~exuberance~ of entertaining if possible more than the current ones. The choice of cars and drivers is not very wide, rather bizarre for how it mixes drivers of the time and legends of the stable (seeing Shumacher on Berger's 1988 car is strange, isn't it?), but it is capable of giving thrills profusely once in track. We have already written about it, there are two tracks and ten riders, but of the caliber of Nigel Mansell, Alain Prost, Damon Hill, Emerson Fittipaldi and also an incomprehensible Nakajima, but it is still possible to race on the tracks of the current season too, consequently that which might seem like a skimpy game offer immediately earns sixteen more tracks. It being understood that there is no classic career, but only single races, time trials and the usual, well thought-out scenarios. The real strength of classic cars is their driving modelwhich returns a nervousness and a ~scatteriness~ light years away from today's missiles, but which is more fun and satisfying in the long run. The scalability is the same, but each help removed (or halved) feels twice as much compared to the electronic racing cars that are driven with the tip of gloves. Opening the throttle means losing grip, without traction control the engine screams at over-revving, giving rise to a recurring pendulum effect, braking times lengthen, the cars give the impression of being lighter, changes of direction they are more sudden, they almost seem to dance on the asphalt. In short, a good experience, which perhaps deserves a steering wheel more than today's Formula 1, and which hopefully is not unique in Codemasters' projects. Here too the historical problems of the series remain, but thanks to the smaller number of cars on the track, they are undoubtedly less noticeable. We conclude with the multiplayer offer, usually very full-bodied, complete with a cooperative career, split screen and local network. We can indulge ourselves in all the single player game modes; there are also cooperative scenarios, all obviously customizable as you like, both in terms of difficulty and simulation level. In short, here too much to play. On a technical level, the tested version, the PC version, flexes its muscles at every frame. The detail and modeling of the single-seaters is of a high level, the one on the seabed a little less, but objectively it is unlikely to notice a motorhome in the distance that is not exactly photorealistic when you are hurtling at 300 km/h at sixty frames per second. The fluidity (net of some sporadic micro shots) and the sense of speed are devastating on PC. They are on the console versions as well, no doubt, but the doubling of the refresh rate is something that gives the whole thing an even more photorealistic impact. However, where F1 2013 leaves its mark is when it rains, i.e. when the puddles on the track reflect the whole surrounding world (like the car bodies), when the water raised by the cars ahead of us does not allow us to see anything, and they make us clamor for the safety car. A terrible but beautiful show, in which you can do nothing but hope not to hit anyone, in which at the start you curse yourself if you haven't managed to get pole position. Even the particles are no joke, more generally the picture of the effects of Formula 2013 is undoubtedly flattering.", "date": "2013-09-30", "grade": "8.5"}