{"name": "La corona dei beat'em up", "ref": "https://multiplayer.it/recensioni/123421-dragons-crown-la-corona-dei-beatem-up.html", "text": "There are very few games in which the author's hand is so evident, but Dragon's Crown bears the signature of George Kamitani from the first to the last sprite. Those who have appreciated the magic of GrimGrimoire, the charm of Odin Sphere and the elegance of Muramasa cannot fail to see the common thread that binds them, but Dragon's Crown represents not only Vanillaware's most ambitious project, but also the closing of a circle born fifteen years ago. Ever since he worked on Dungeons & Dragons: Tower of Doom, Kamitani's dream has always been to make a 2D beat'em up that harks back to the tradition of Golden Ax and The King of Dragons, but at the same time capable of marking growth for the genre. ~What would 2D beat 'em ups look like if it had evolved over the years?~. It took the Osaka developer several years, six games and a port, but Dragon's Crown is the wonderful answer to that question. Dragon's Crown brings the 2D beat 'em up genre back with the times New Golden Ax or New Golden Age? While going through the splendid levels of Dragon's Crown, one cannot fail to see within them Kamitani's honest admiration for Golden Axe. From a gigantic minotaur armed with a golden ax to huge monsters to use as mounts, passing through a petty thief who occasionally appears on the screen to steal the treasures scattered around while the player is distracted. Yet the last born in the Vanillaware house is not only an old school beat'em up with a thousand homages to the classics of the past, but strives to give new life to the genre. And it succeeds, not only through one of the best examples that 2D has seen in recent years, but thanks above all to a level of depth rarely found in other beat 'em ups, which draws heavily on the advances made in the RPG arena. action and 2D fighting game to decorate a dynamic, fast and content-rich experience with bows. It is not surprising that the simple narrative component only serves as a common thread between one scenario and another. Having entered the Guild of Adventurers and having completed a few simple tasks, the player soon learns of the disappearance of the King, who vanished into thin air while he was in search of the Dragon's Crown, the magical artifact which, according to legends, would give the power to control the dragons. Although you meet other characters, and although you can devote yourself to a whole series of secondary missions, the plot has an absolutely marginal role and articulation when compared to that of Muramasa or Odin Sphere. Dragon's Crown is all gameplay, and you can see it right from the different characterization of the playable classes, only apparently divided into two different types, the melee tanks (Warrior, Amazon and Dwarf) and the ranged fighters (Elf, Witch and Magician). There's actually a huge differentiation even within these two categories, with the Warrior being the one most suited to newbies, perfect for button mashing and capable of taking a decent amount of damage; the Amazon compensates for the lower defense with aerial strikes and very powerful kicks, while the Dwarf is the only character capable of carrying out absolutely devastating holds. The way of playing changes considerably by impersonating the other three heroes, the slightly more difficult ones but probably also the funniest ones: the Witch is an excellent support character, being able to summon undead warriors from a pile of bones, whereas the Wizard uses the mana at his disposal to cast extremely powerful spells. Finally there is the Elf, a character that is not easy to master but very special, very agile in moving around the screen and able to chain physical attacks with rapid shots of an arrow in one direction or another. It has only two big problems: on the one hand, the low resistance to physical attacks, which forces it to stay in the rear as much as possible or run away if things go badly, on the other hand, the limited number of arrows, which go as follows: popped carefully and picked from the ground at the first good opportunity. To have fun you don't necessarily have to be an expert player, mind you, but the more experienced will be able to discover and appreciate different techniques that derive mostly from the fighting game genre, such as the possibility of canceling attacks to anticipate evasive moves or to be on the enemy with greater speed. PS3 or Vita? Since Dragon's Crown doesn't support cross-buy, PlayStation 3 and PlayStation Vita owners are faced with the need to choose between the two versions. In terms of content, the game is absolutely identical on both platforms, but there are pros and cons on both sides based on the needs of each player. On the TVat home it is possible to better appreciate the backdrops and characters in high resolution, while the OLED screen of PlayStation Vita risks being too small to be able to distinguish the various characters when the action becomes more chaotic. On the other hand, the touchscreen of the portable console allows you to directly touch the objects with which to interact without the need to move a slow cursor with the right analog stick. Finally, it should be noted that the PlayStation 3 version supports a local multiplayer option, although the PlayStation Vita still has its own online co-op mode. Go on an adventure to lead your hands Having a central city that acts as a HUB between one level and another has allowed Vanillaware to insert a whole series of RPG elements, starting from the Tavern where you can change your hero or hire new allies, passing through the Temple where you can resurrect new characters and pray for bonuses in battle, eventually ending up with a shopkeeper who buys, sells, repairs, or values your items. Maybe in the meantime you can drop by the Guild, to collect some side missions or learn new skills through a system of points and upgrades. However, it's only when you leave the capital and enter one of the various dungeons that Dragon's Crown proves to be THE beat'em up of the generation. The clashes are fun, frenetic and never repetitive, also thanks to the presence of elements of the scenario to interact with, such as cannons to fire, columns to collapse on opponents, pools of oil to ignite or secret passages to unlock to access hidden rooms. The same variety is found in the enemies, all different and which, although they rarely show off particular originality and inventiveness, still require different approaches, from fire-sensitive spectra to ghouls that explode in a fountain of poisonous acid. The problem arises when, all too often, a certain number of characters on the screen is exceeded, perhaps because the Witch has summoned an undead warrior, the Wizard an elemental creature and in the meantime there is a civilian to save and a thief who the shuttle between one chest and another. Opportunities like this are overwhelming to say the least, with the player not only failing to fully understand what is happening in the fray, but also risk losing sight of their hero. Thus, one often ends up dying, especially after a certain number of hours of play, when the adventure comes to life, branches off in new directions and offers a much higher level of challenge; not to mention the Inferno mode, in which grinding is no longer enough and the player's skills are seriously tested. When playing in the company of artificial intelligence, things get more complicated due to inadequate pathfinding, which often leads allies to calmly walk on traps or stop in the middle of the flames as if nothing had happened. However, the Japanese developer managed to set up a system of Continue and Game Over that is not frustrating but not permissive either, capable of recreating the feeling of ~last coin~ anxiety typical of arcade cabinets. And then, as already mentioned, there is a whole series of elements drawn from other games and other genres: the ability to open chests and search for hidden objects within dungeons clearly derives from Diablo, while one of the most interesting ideas of the component online is taken forcefully from Demon's Souls: once defeated, the player leaves a pile of bones at that point in the level, which in turn can be used by other players to summon undead or to resurrect an ally with the same characteristics of the original character; the ability to associate a series of personalized messages with your hero is another gem. Playstation 3 trophies The numerous secondary quests and the possibility of playing the adventure with different characters are accompanied by a whole series of secret trophies to unlock. Many are obtained simply by continuing in the adventure, but there is also a fair variety of alternative challenges, ranging from eliminating a boss within a certain number of minutes to inflicting an enormous amount of damage with a single blow, passing through others a little more details. Beat'em Art Paradoxically, the artistic style of Dragon's Crown was among the most praised elements, but at the same time also the one that most of all attracted criticism and controversy. In particular, pitchforks have been challenged for the design of the Amazon and the Witch, with overly highlighted curves and an appearance that almost exceeds the limit of sexy to invade the sphere of eroticism. Yet this, like it or not, has always been Kamitani's style, this time taken to the extreme and accentuated perhaps by a hybrid aesthetic between Eastern and Western art. Shapes have also been exaggerated for several male characters, but judging the work of Vanillaware artists by looking solely at the design of a couple of characters is a glaring mistake. The care for the backdrops, and the fact that each level looks like a real painting, once again shows the sensitivity and taste that the Osaka team has always shown from GrimGrimoire onwards. Sensitivity that can also be seen in the various references and tributes to Western culture and art, from Disney works to Greek sculpture, passing through the Renaissance period or ancient Egypt. The thousand sources of inspiration can also be seen in the spectacular boss fights, which once put in front of a gigantic Chimera, the next time face to face with Medusa, or again against a Kraken, a Cyclops or a Harpy. If it weren't for the chaos on the screen and the concentration at the highest level, one would gladly stop and admire them one by one, accompanied by a soundtrack that switches from epic themes to arabesque melodies or pirate pieces depending on the setting.", "date": "2013-09-19", "grade": "9.0"}