{"name": "MirrorMoon EP", "ref": "https://multiplayer.it/recensioni/123303-mirrormoon-ep-esplorando-lo-spazio.html", "text": "If you follow the Italian independent scene, the name Santa Ragione will not be unknown to you. Very active in the community, they initially made themselves known with the excellent Photonics, which we talked about in an old PC Magazine, and then dedicated themselves to various projects (not all videogames), including this MirrorMoon EP, their most important work for several reasons. The main one is certainly the landing on Steam, by now the commercial holy grail of the gaming world on PC, therefore the size and originality of the project itself, not for nothing selected among the finalists of the Nuovo award at the IGF 2013 (a selection that admission on the Valve platform without going through Greenlight was worth it). In short, we can count the Santa Ragione, without fear of contradiction, among the most internationally known independent Italian developers and those who, so far, have obtained the most awards. Having established the context, necessary for you to understand that we are not talking about a work that came out of nowhere, let's try to understand what MirrorMoon EP actually is. Describing it is almost disarmingly easy: it is an exploration game, in which you have to go around space to discover unknown planets and systems. Each planet visited has puzzles to solve related to the satellite that circles it, which is actually a smaller version of the planet you are on. Plot? Two lines that don't say much and, above all, that are not explained during the adventure. So, you might be wondering, is it simply a puzzle game? Not really, because in reality there is nothing mandatory and there is no sequence of things to solve to move forward. Having to choose a single word to define it, we would definitely focus on ~meditative~, with all the meanings that this term carries with it and all the controversies it risks opening. Let's discover the space and qualities of MirrorMoon EP, the new game by Santa Ragione A long meditation As soon as you enter the game you find yourself in front of the bridge of a spaceship. There are commands, but there is no explanation of their function. Let's clarify: in MirrorMoon EP the lack of any tutorial or explanation on the functioning of the game mechanics is a choice. If you're one of those who likes to be led by the hand with step-by-step instructions and panics whenever they feel stuck, then leave it alone and change your review. We are sure this is not the game for you. Here the initial confusion is part of the experience, as is the lack of any text that tells a plot or anything else. Starting MirrorMoon EP there will be you and the cosmos, which you will have to know in a slow exploration. But let's go back to our dashboard. By pressing a few keys trying to understand its function, you manage to land on the first planet (doing it is much simpler than it seems). Even here there are no precise points of reference: you hold a strange device and you can walk, encountering structures from time to time. If you're curious, you'll soon discover that the ~weapon~ allows you to grab the satellite planet and carry it around. If you are even more curious, you will soon realize that some actions lead to certain reactions and that by using the satellite planet in a certain way, you can unlock effects related to structures scattered across the various celestial bodies. In short, having entered the mechanism and understood MirrorMoon EP for what it really is, it finally becomes possible to understand what we mean by meditative videogame: each element of the gameplay invites calm and reasoning, with a general slowness that we do not hesitate to define programmatic. When everything about the first planet has been discovered, it will be possible to set out to discover the universe. A handful of planets will be visible immediately, while others will have to be discovered on their own. If desired, there is also a multiplayer mode, in which it is possible to name a still unknown planet. If you run out of available planets, new ones are unlocked. As we said, the rest is up to you. There are no clues on where to go and, after a few hours of play, it wasn't even clear to us whether there actually was any specific place to reach... but that doesn't matter. The goal, if we really want to talk about goals, is to go around and find out what each planet has to offer in terms of puzzles and visual solutions. Sometimes we will witness real vector shows, although the general minimalism may suggest that there is nothing nice to see in such a title; others will be a little disappointed; still others, the resolution of a puzzle will be discovered only by chance, remaining enraptured. In short, there is always somethingcapable of arousing the player's curiosity, curiosity which is one of the fundamental prerequisites for appreciating MirrorMoon EP. After all, this is precisely the biggest problem with which you find yourself fighting, given that, as you have been able to read, the requests made to the gamer are really many. Santa Ragione seems to have selected its target audience in a radical way, without giving in to any compromise. Starting from the visual aspect, full of style but probably inconceivable for die-hard technology lovers, there is not much that can attract the average user. It almost seems that the game wants to choose the player and not vice versa. However, whatever one may think, MirrorMoon EP remains a title with an original and experimental concept to the core. And it is only from here that you have to start judging it, trying to avoid paying heed to the prejudices that every product that tries to deviate from the crowd inevitably carries with it.", "date": "2013-09-17", "grade": "7.5"}