{"name": "The Movies - Recensione", "ref": "https://multiplayer.it/recensioni/the-movies-recensione.html", "text": "Creating... playing... Someone (especially among the younger ones) may even have never heard of it, and therefore rightly ask themselves: what is this The Movies that is talked about with so much emphasis? Well, said in a simple, and also quite trivial way, it is ~the revolution of the world of video games~, but more precisely, it is ~the possibility of creating~. Creating is something that has always been disconnected from the world of video games, it has always been closed to us. Of course, you will say ~and where do the editors put them?~, but the editors have always and only allowed us to take pieces that are part of a video game, and assemble them in another order to then use them anyway with the same game. Until now we could create game maps and scenarios, but it has never been possible for us, for example in the case of a game about restaurants and cooking, invent a cooking recipe, cook the ingredients in a virtual pan and then see the result on a equally virtual plate. Thanks to The Movies instead, we will be able to write our screenplay, choose the settings, the costumes, the props, the actors, what to make them do and what attitudes to keep, in other words ~to shoot a film~. And then decide and edit the soundtrack, dub it and subtitle it. Finally, export it and show it as any .wmv movie (Windows Media Video 9) accessible and visible to everyone regardless of ownership of the game The Movies therefore wants to give us the possibility to create a movie from scratch and see what comes out of it. The Movies is a huge game, made up of 3 distinct parts that overlap each other in some situations Creating... playing... Or at least that's the basic idea. The idea around which that great master named Peter Molyneux built the project of The Movies, a project so ambitious that in case of success it will have given birth to the most innovative game of the last twenty years, but that in case of failure the 'will have condemned to a flop of equally apocalyptic dimensions. There's no denying, he's someone who knows how to move the day ... But first, a little order. The Movies is a huge game, made up of 3 distinct parts which in some situations overlap each other: the management phase, the tool for the actual creation of the films, and the Star Maker which allows us to forge a star to our liking. Therefore, in order not to make unnecessary confusion, we will keep these three aspects completely separate, possibly making references to the other sections if it is indispensable. in fact, playing The Movies is basically a management game. At the beginning we will have a large empty field, the rest will be up to us. We will have to build the structures necessary for the production, make sure they are connected to the main road, hire workers to build, repair and keep the buildings clean, beautify the studio in short, the usual things that one is expected to do in any management system, only set in the world of cinema. Once the foundations of the newborn studio are well planted, we will see the usual gang of aspiring starlets and dear Nobodies enter, all with the aim of becoming famous. Among them we will have to choose the ones we consider the most promising and admit them to our directing and acting school (simply just ~catch~ them with the cursor and ~download~ them in the appropriate room and that's it, as in all recruitments...). Obviously we shouldn't choose at random! Each person is different from the other (tall, short, thin, fat, beautiful, ugly, funny, stressed, drunk, greedy, just to name a few), so we will have to be careful not to find ourselves a walking problem. Before hiring them we will have just a description of their peculiarities available, only once hired will we actually be able to see the respective ~scores~ represented by very comfortable bars that fill and empty, grouped by topic in nice comic balloons that appear complete with ~pop  when we click on it. We need crew members, screenwriters and, later, researchers and assistants of the ~stars~, and we will have to take care of selecting and hiring them However, actors, directors and extras are not enough to make a film: scripts do not rain from the sky; cameras and microphones don't move by themselves. We need the crew members, the writers and, later, the researchers and assistants of the ~stars~, and we will have to take care of selecting and hiring them. Be careful though, don't think it's that simple! The number of people who will ask to work for you will always depend on the level of the studio, so if you spread out too much you risk finding yourself, without even realizing it, short-staffed. As long as it's people who slip onbanana peels left on the floor are also fine (even if refusals reduce the level of the study); think, however, of what happens if a set in which you have to shoot a scene is unsafe and has been closed, or if there are no crew members or extras: filming is suspended! So as a general advice: hire everyone! You will never know when you might need them, so when you see someone in front of a door, assign them something to do, even a different job than the one they came for, so no one loses the experience accumulated previously, and in the future you can always put them back to work. right place (whoever had this brilliant idea deserves a statue!). For the rest, as in all management systems in this world, the usual 5 Olympic circles apply: Order, Order, Order, Order and more Order. Don't build in bulk or you'll dig your own grave! Small, annoying details It seems strange, but despite the maniacal care that has been lavished on every single aspect of the game, a defect has been sensationally overlooked which quickly becomes frustrating: I am referring to the mechanism by which we are allowed to disassemble, move or replace buildings and, above all, innumerable objects with which we will have to stud the study. As long as we are dealing with buildings everything is quite realistic therefore, however inconvenient, it is still acceptable, in fact, to move or demolish a structure we will have to take one of the builders and ~download~ it on the icon that represents what we want to do immediately next to the 'entrance. Obviously this will only be possible with active time, since we can't move anything during the break. The crux of the matter is precisely the impossibility of moving anything: moving or demolishing a building is a fairly rare event (even if you have to do it occasionally because I tell you right away that everything inside the studio doesn't fit!), but the ornaments, and the various objects that we cannot help but put will have to be changed continuously to keep up with fashions and technological improvements. Keep in mind that only around each star camper is it essential to place a couple of cars, some plants, various gymnastic equipment, statues and so on, multiply it by the number of stars to satisfy and you will easily realize that every update of the ~caravan section  costs an exaggerated amount of time, both personal and in the game. And the same goes for other details like garbage cans, telephones, mailboxes and so on, and you will have the picture. Honestly, a more comfortable system would have been much appreciated, at least for objects. An automated general replacement system was certainly not expected, but at least the ability to move and eliminate them during the break. The ~Stars~ ... (please read it with a highly snobbish inflection!) these great p ehm these wonderful people Cross and delight of producers from all over the world (which at this point also includes us who play The Movies), will soon become the main occupation and, immediately after, concern. ...with perhaps the only exception of relationships with other stars, which take up a lot of time and force you to choose whether to cultivate a good relationship or shoot a film The ~Stars~ ... (please read it with a highly snobbish inflection!) The more famous they become, the more demanding they are. The more demanding they are, the more they become insatiable. And the caravan, and the assistants, and the stress, and boredom, and the vices, and the beauty treatments; not to mention when you have to go looking for them throughout the studio because they are absent from the set. It will be quite tiring and frustrating at first, but with a little experience it will be possible to manage almost all skills, with perhaps the only exception of relationships with other stars, which take a long time and force you to choose whether to cultivate a good report or make a movie One could also think of forgetting the fame of the stars, but this is completely impossible, because it is essential to unlock most of the advanced buildings, such as the Advanced Movie Maker, around which the entire game revolves . So roll up your sleeves because it will be your main occupation Create a film (management system) Producing a film relying on the mechanics of the game is a long process, and only apparently simple. First you have to write the script, and to do that we just have to place the writers in the appropriate room. Obviously the success of a film is not only due to its quality, but also to what the audience wants at the moment: a sci-fi masterpiece could be snubbed if the audience only wants action films and comedies. So you have to be careful and choosethe most popular genre of the moment or, if a long production is expected, it will be important to anticipate people's wishes, and to do so, just check on the time bar above what awaits us for the future. Now that the script is ready, we can choose whether to send it immediately into production, wait, or dedicate some time to advertising coverage, in order to make it known to the general public, who will thus await its release with trepidation and will rush to theaters in greater numbers to see it. . The next step is the assignment of roles, in which it will be necessary to choose the director and which actors to assign the parts to. Even here, however, skill is not everything: stars who have a good relationship with each other will get along better on the set; and the same appearance, as well as age, will not be underestimated, given that, as it obviously is, a good-looking and fit actor will be more suitable than a skinny one for an action role, an unattractive one will be more suitable for a horror film, and a young cast for a romantic comedy. After waiting for everyone to learn their part, we can start filming. The director will take care of the rest, but every now and then it's always better to take a look at the situation in order to avoid the suspension of filming because someone is absent and thinks they have better things to do (such as go crazy or get drunk ...), which happens above all with longer films. In that case it will be enough, as always, to catch the lazy person on duty and unload him in his place to get work going again. A masterpiece can be destroyed by the critics and have catastrophic results at the box office if another film using the same sets was released six months earlier Create a film (management system) After the film we will have to decide how much money to invest in merchandising and then release it on the market. At this point we will see the summary of the characteristics of the film that we have just produced: the quality of the script, the direction, the acting, and a thousand other factors as you can easily see from the screenshots, followed by the effects of the film on those who participated and the comments of criticism. Many of these details in the filmmaking process can be conveniently ignored, but this will have a negative effect on the resulting outcome. What is missing is a modicum of influence in creating the script. In fact, one of the innumerable aspects that influence the result of a film is indicated by how recently the same set has been seen and used. A masterpiece can be destroyed by the critics and have catastrophic results at the box office if another film using the same sets had been released six months earlier. It would therefore be extremely useful to be able to select the sets to be used for a film before starting the writing of the script or, at least, to be able to exclude those that have been used more recently. Unfortunately, however, this is absolutely not possible unless the unwanted studios are physically demolished before the script is ready (this obviously provided that at the same time they are not shooting another film). A pity, considering that there are other aspects that affect the realization less and over which we have more control. The only way around it is to write the script yourself with the Advanced Movie Maker, but this takes HOURS, and is quite complicated. Create a movie (advanced system) And here we are finally at the heart of The Movies, its most publicized and awaited feature: the Advanced Movie Maker. The level of customization that we have available is very high. First we have to decide the genre of the film among the five available and the type of structure (simple, detailed or free, which represents how complicated the plot will be). Then we obviously have to choose how many actors to employ, never more than 3 anyway, and choose the cast and basic costumes, i.e. those that will be used most frequently. Then we move on to the definition of the scenes, that is the most complex part. For each scene there are basically 3 steps: choose the set; set the action to be performed; define tone, intensity and detail. The first is very easy: just select the set in which you want to shoot the scene among those present in the studio at that moment. Then we have to decide if we like it set up that way or if we want to replace the background, change the brightness or add objects to enrich the environment. Once we have chosen the set, we have to decide what to get the actors to do. For this we have an endless list of possible actions built by the Lionhead Studio programmers and a search engine to help us.", "date": "2005-11-11", "grade": null}