{"name": "Io sar una roccia", "ref": "https://multiplayer.it/recensioni/123169-giant-boulder-of-death-io-saro-una-roccia.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. Can love arise even between inanimate objects? The huge boulder at the top of the mountain looks kindly at a splendid rock with a pink bow, until the latter is captured by the evil mayor of the downstream city to tear it apart and build a statue with its likeness. That is enough for the boulder to get angry and decide to roll down, bringing death and destruction to take revenge for the cowardly act. In Giant Boulder of Death we control an enormous rock that descends from a steep mountain with the aim of overwhelming anything that comes within reach, like an episode of Katamari in which our character does not gradually become bigger by incorporating this with which it comes into contact. There is only death for those who block our way, unless they are the formidable barriers with steel spikes that the mayor has erected to defend his city, or the large mines which also prove lethal if we enter them. in contact. In short, during our stint we have to make sure to destroy the scenario as much as possible, overwhelming inhabitants, cows and even yetis, but at the same time avoid colliding with objects that can damage us, because one misstep is enough and it's game over. Giant Boulder of Death is a very simple and immediate ~endless~ action game, as well as free Woe to what touches you To develop such a simple but appetizing concept, the PikPok guys have opted for a precise and reliable tilt control system, which asks us to hold the device vertically and tilt it to one side or the other to make sure that the rock changes direction. The management of the trajectory is deliberately difficult and such as to require a minimum planning of the route to avoid traps, but if necessary it is possible to touch the screen to make a jump. The most interesting thing about Giant Boulder of Death, however, is the excellent system of objectives which, once achieved, result in the projection of further figures on our path and in the consequent multiplication of the final score, given that trampling some characters is worth more than crushing a simple fence. Then when the level of destruction reaches a certain point and the sidebar fills up, our boulder becomes a huge ball of fire and in this state it is capable of literally wiping out everything... too bad it doesn't last long! Using the coins earned in each game, however, it is possible to make our journey last longer and produce more fruit, for example by increasing the incidence of certain objects, the height of the jump, the duration of the invincible mode and so on. Street. In short, everything is very simple and intuitive, but it is a project created with great skill and flawless, assisted moreover by a technical sector that lives up to expectations, with funny and colorful graphics, accompanied by a sound that perhaps does not affect but it lends itself well to the type of action portrayed on screen.", "date": "2013-09-14", "grade": "7.5"}