{"name": "Da console a mobile", "ref": "https://multiplayer.it/recensioni/123021-2k-drive-da-console-a-mobile.html", "text": "Who expected this? The first project of Lucid Games, a team born from the ashes of Bizarre Creations, is a driving game for iOS devices. The sensation, right from the opening bars, is that of being faced with a console racer that has been transported to the iPhone and iPad, and considering the background of the developers, this could also have a foundation of truth. There are, moreover, other indications that point in this direction, although these are not exactly positive situations. 2K Drive, in fact, launches us onto the track within a playable introduction without, however, making us gain a minimum of familiarity with the philosophy behind this production, which differs clearly from the arcade character of titles such as Asphalt and offers us a control system that by default relies on the accelerometer for steering management and on separate commands for the accelerator (right side of the touch screen) and brake (left side). It is possible to adjust the sensitivity of the controls to obtain the right compromise or opt for a touch alternative which, however, at the moment is not convincing, as on the iPhone 4S it often played tricks on us, ~falling asleep~ during the touch balancing which, in fact, it doesn't require you to take your fingers off the screen. In short, the addition of an extra layout with two simple arrows would be extremely welcome, but in the meantime you have to be satisfied, especially if you use an iPhone 5, which is actually the device for which the game was designed. With lower terminals, unfortunately, problems are experienced with the frame rate and, consequently, with the aforementioned tilt controls, and the experience is clearly affected by this. The second clue must be found in the composition of the interface, which starts from excellent ideas (a connotation to Pinterest-style tiles, which includes social facets and informative articles on the world of motoring - clearly in English) but makes them lousy, proving to be confusing, especially at first. 2K Drive offers a solid and rich experience, which however requires a latest generation terminal Lots of stuff If 2K Drive has a problem, I'm not sure the deal numbers. First of all we are talking about a premium title, which is sold for 5.99 euros on the App Store and which therefore immediately places itself on a different level than the much-criticized Real Racing 3. There is an in-app purchase system which allows users to immediately unlock a certain number of cars (all really existing and well reproduced on the screen, let's add), as well as the traditional coin packs (the ~precious currency~ compared to the stars, which instead are given out in buckets at each race). Don't worry, though: if you have a minimum of skill you can access all the contents of the game without spending any more money, simply by completing the events. The fact remains that, in a game sold at a premium price, it is an element that appears a bit forced as well as annoying. And speaking of events, not only are we talking about an enormous number of races, divided into thirty championships, but also a fair variety of them, since we go from classic races to head-to-head, passing through elimination challenges based on overtaking and the rather original ones in which you have to avoid the crosshairs of a combat helicopter for as long as possible. There is also a whole series of extra events that are organized for the community every week, a very well implemented asynchronous multiplayer (complete with features to apply our big face to the pilot), the right attention to the social aspects of the experience and a quite a few options, even original ones, which concern the personalization of cars with paints, accessories and even trinkets to hang in the passenger compartment. The point, as mentioned above, is that we are dealing with a technically very heavy game, which as mentioned only runs best on the latest generation terminals and is unable to ~scale~ effectively when instead we have something less recent. In short, an elitist experience that we hope will be optimized with the next versions also in terms of controls. For the rest there is little to add: the technical realization is excellent, with detailed and convincing polygonal models for the cars, photorealistic scenarios (literally: the use of photographs catches the eye for their composition) and an abundant quantity of effects, responsible together with the physics of the aforementioned ~heaviness~ of the engine. The final result is solid, although not as spectacular as Asphalt 8: Airborne, and is accompanied by a sound that does quite well in terms of music but disappoints a bit for the effects, some of which soon turn out to be annoying.", "date": "2013-09-12", "grade": "8.4"}