{"name": "Top of the poppe", "ref": "https://multiplayer.it/recensioni/123028-dead-or-alive-5-ultimate-top-of-the-poppe.html", "text": "The mysterious trailer with Momiji four months ago had intrigued everyone, but probably no one expected the announcement of Dead or Alive 5 Ultimate for Xbox 360 and PlayStation 3. It is in fact the third edition of the game (after the ~smooth~ one released eleven months ago, and the Plus version for PlayStation Vita), which includes the beautiful ninja together with four other characters, as many unpublished scenarios, practically all the costumes released so far via DLC (and we're talking about many costumes: more than two hundred), a new Survival mode and finally a series of extra touches that include a photo mode to immortalize the shapes of the various wrestlers during the most intense moments. All at an affordable price, but up to a certain point. Certainly a good deal for those who may have postponed the purchase of the game waiting for some promotional offer, and can now take advantage of a complete and ~definitive~ package of the Team Ninja fighting game. There won't be other versions, after all. Real? Superfluous for those who own the standard edition, Dead or Alive 5 Ultimate remains an excellent fighting game Where were we? Dead or Alive 5 Ultimate rewards fans of the series, allowing them to import any saves from the standard version so as to immediately obtain all the objects already unlocked and progress in the long and complex single player campaign. Campaign which, however, to our great regret, has not changed one iota and therefore does not exploit the newcomers in any way, only putting us in the shoes of the characters who made up the original roster during events that take place in parallel and which culminate with the new Dead or Alive tournament. We've probably talked about this in the past, but the level of narration is actually very low, and the developers have not been able to do anything other than use the temporal device (~a few days later...~) to present us with hackneyed stories of people who he wants to test himself against worthy opponents, find redemption from a life spent in the shadows or simply have fun pulling some sganassone. The structure of the mode is substantial and fairly long-lasting, at least compared to the scrolling fighting game genre, and is supported by a traditional arcade mode in which, however, there are no final cutscenes to unlock. Certainly the fan service is not lacking, even if more could have been done even in this juncture, but perhaps it was better not to go into the morbid and leave to the pervs... um, the most demanding users the possibility of deepening the discussion through the aforementioned photo mode. Xbox 360 goals The forty-eight Objectives contained in Dead or Alive 5 Ultimate are fairly simple to obtain, given that many of them (even the ~heavy~ ones) are obtained by performing almost obligatory actions, for example accessing each mode for the first time, completing all the paths in Arcade Mode and so on. Then there are the Objectives linked to the online sector, which we often and willingly bring home based on the quantity of our efforts rather than on their quality. What changes Needless to quibble about the qualities of Dead or Alive 5 Ultimate as a fighting game, since we already did it in the first review and in the PlayStation Vita review, to be precise). The game is fast, frenetic, with good animations, spectacular combos and gameplay based on timing and reflexes rather than strategy, thus differentiating itself from other exponents of the genre and carving out its own slice of audience. The five new characters certainly add substance to the roster, even if some of them are not exactly new: Leon and Ein in fact come from the previous episode of the series, while Jacky is one of the many wrestlers from the interesting crossover with Virtua Fighter (very well placed in the context of the title of Team Ninja, however). Finally, Momiji and Rachel come from the narrative universe of Ninja Gaiden, who however has always been on excellent terms with Dead or Alive, see also the permanent presence of Ryu Hayabusa. They are two atypical, very ~placed~ warriors (especially Momiji, who is also quite tall compared to her colleagues), capable of delivering powerful blows but also of performing, when necessary, in quick sprints and flying catches. As for the ~survival~ mode, we find a traditional interpretation, in which you have to select a character and a difficulty level and then try to beat as many opponents as possible by being able to count on a single energy bar. aiming to set a record (which is then uploaded to the online leaderboards). No change however, on the front of online multiplayer and comparto technical, which however did not suffer from any problems and indeed offers us a fluid and convincing graphics, albeit with some concessions to the past as regards the quality of the polygonal models.", "date": "2013-09-09", "grade": "7.8"}