{"name": "Echoes of Mana", "ref": "https://multiplayer.it/recensioni/echoes-of-mana-recensione.html", "text": "A little late compared to the thirtieth anniversary of the Mana series, the new mobile chapter with gacha elements has finally arrived, an initiative that is practically a must considering the now standard modus operandi of Japanese publishers. So here we are at the review of Echoes of Mana, a game that arrives after the remasters of Trials of Mana and Legends of Mana to inject new life into the historic Square Enix series (Squaresoft, at the time) also in the new form of the specially developed RPG for smartphones. Also in this case, the idea is to throw down a simple outline that justifies a long sequence of quests more or less connected to each other, with the protagonist intent above all on gathering a veritable army of characters from various chapters of the main series through the gacha system. As you can easily guess, this mechanism necessarily leads to a forcing at the narrative level, having to insert disparate characters and contexts within a single story, which in this way is superficial and frayed, as usually happens in gacha-setting mobile RPGs. If you think that the narration should represent a cornerstone of the JRPG, especially as regards a historical series like this, it is easy to understand how Echoes of Mana somewhat distorts its own roots, as almost all projects of this type do, but the question is now secondary. Here it is above all about pushing players to go ahead with the collection of characters and keep them glued to the progression system through its complex mechanisms, and enthusiasts can easily get carried away by this new production of Square Enix too, although there are certainly exponents more interesting also in this specific field. Gameplay between quests and progression Echoes of Mana, a screenshot from the game The protagonist, who can be chosen between male or female, is called by the spirit of the Mana Tree to recover the Mana Sword and give new life to the magical plant, threatened by dark powers. From here on, it's simply a matter of taking part in the various quests that appear on the main screen by spending energy to take part in missions, try to summon new characters and progress them through its complex menus and systems of currencies and materials. Nothing new compared to the dozens of other titles of the genre, with the difference that, in this case, the characters and settings are taken from the old Mana series, thus being able to count on a certain charisma and above all on the powerful nostalgia factor. this connection with a historical series, however, Echoes of Mana does not offer anything new compared to the many other similar games: also in this case it is a question of dividing the game time between the quests on the field - which consume rechargeable energy with waits or micro-transactions - and management of the characters in the complex menus, all focused on the progression of the fighters and of the individual components of armor and weapons, each requiring a certain amount of materials (obtainable in game or, of course, purchasable with micro-transactions) to be evolved. Echoes of Mana, screenshot from an in-game encounter There is a stratified system of different evolutions between Ascension, Unleash and Awakening, which respectively increase the level cap, the usable skills and the rarity of the characters, making the management of fighters and equipment particularly deep, but consequently also rather cumbersome and strongly inclined towards in-app purchases. For the rest, the actual gameplay sees us explore various environments represented with a simple 2D scrolling, facing various enemies and bosses with an almost completely real-time combat system. We directly control a single character while the rest of the party is managed by artificial intelligence, but we can switch from one to the other on the fly by exploiting the different classes and abilities of each one, also because the characteristics and fighting styles (between categories and elements reference for each character) must be well matched and used to be able to face the most advanced threats. In the middle of the action, it is simply a question of managing simple and special attacks by pressing the keys and taking care of the usual cooldowns without particular strategy, with the possibility of activating the usual auto-play. Gacha and characterization Echoes of Mana, a cutscene The fulcrum of the game lies in the collection of characters and their evolution, as befits a good gacha, and the historical characterization of the Mana series certainly contributes to increasing interest in this mechanism. For qAs far as we have been able to see, the rate of summons is expected on the standard levels of the genre, with the rarest characters (at 4 stars) being decidedly difficult to obtain through the standard procedure, outside of the special summons that must be purchased and guarantee the achievement of more coveted rewards. Materials and fruits of the mana tree (which allow access to summons) are obtained with fair regularity between gameplay and daily rewards, but in still very low quantities compared to all that is needed to evolve characters and equipment, which combined with the he consumable energy suggests that Echoes of Mana lean heavily towards micro-transactions. The characters of Echoes of Mana The 2D graphics are pleasant and recall the tradition of the series, giving life to characters that are an excellent emanation of the original character design, but the use of vector animations makes everything a bit wooden and awkward, compared to the accuracy of the static designs. In any case, the design works well to build up a large and colorful cast, while a truly remarkable care has been put into the anime-style animations, even if these show up in rather small quantities during the game.", "date": "2022-05-08", "grade": "6.0"}