{"name": "Cacciatori di teste", "ref": "https://multiplayer.it/recensioni/122569-killer-is-dead-cacciatori-di-teste.html", "text": "The latest madness born from the fervid mind of Gouchi Suda, aka Suda 51, Killer is Dead recovers - not only in the name - the coordinates of Killer7, passing through the recent No More Heroes. In the same way, the game presents a cel shading aesthetic with a strongly authorial cut, unequivocally Japanese in nature, but also inspired by Western cinema and literature. For example, it is impossible not to feel several similarities with the works of Quentin Tarantino, who in turn is ironically inspired by the East, creating a cultural fusion of undoubted charm. The main character has a name that alone says it all: Mondo Zappa. But we're only at the beginning, since the handsome young man even shows up with a bionic arm and no memory of his past. The only fixed point for Mondo is his incredible skill with the katana, a talent that leads him to be hired in a decidedly particular agency, as it is in charge of carrying out executions on commission. The game's campaign is divided into thirteen chapters structured as short films, in each of which the agency is contacted by various wealthy clients who provide data on the intended victims. Don't expect anything conventional; among the objectives we will find an ear thief, a mysterious man who lives on the dark side of the moon, a monk protected by the spirit of a tiger, and so on. At the end of each chapter, Mondo delivers the victim's head to the client, causing more or less hilarious effects that we leave you with the pleasure of discovering for yourself. But there is also room for a more serious narrative line, which slowly makes its way through these improbable episodes, telling the past of our character with a formula that we found very similar to that of Cowboy Bebop. The similarities with Shinichiro Watanabe's work don't stop there, given that all the agency's characters have more or less obvious ties, starting with the black boss with cybernetic grafts, the hottie of the moment and the light-hearted girl. It's tough being tough Killer is Dead is the typical Japanese-style action slasher: third-person view, profusion of combat and fast pace, all anchored to a combat system that makes simplicity its flag. The development has resulted in a very concise title, almost entirely focused on the fights to the sword, but with a number of defections quite significant. One of these is the impossibility of jumping, a factor that greatly reduces the variety of relaxation phases, however present, and eliminating any trace of platform elements. It must be said that even from the point of view of pure combat we missed not being able to hit enemies with air or mid-air attacks, ringing together devastating combos in pure Devil May Cry style. Fortunately, the programmers have worked hard on the bases, drawing more than one idea from Platinum Games' Bayonetta, in this case in the evasion moves and related counterattacks. Mondo has two offensive moves, the first is entrusted to his katana and represents the main blow, while the second is a blow made with the bionic arm with the aim of breaking the enemy defense. The same arm is capable of firing shots at a distance, a feature that proves useful both against blatant bosses and for defeating more distant enemies. However, the show only begins after unleashing the Adrenaline Rush, a series of devastating special moves that can be activated with the right trigger. These shots use Mondo's dark powers and can be performed by consuming a quantity of blood, represented in a special bar, which can be recovered by killing enemies. The bodies also release lunar crystals that are useful for buying new moves and skills, such as the one that allows you to consume blood to recover life points. A structure that therefore adopts role-playing elements to give a certain variety, but the surprises of Killer is Dead do not stop there. Killer is Dead confirms Suda 51's talent for producing action packed with personality Playboy life Once a chapter of the campaign is completed we are transported to the agency, where we can choose whether to face the next one or dabble in some alternative activity, or buy new items in the internal shop with the money earned in the various missions. Worth noting is the possibility of paying Mondo's personal assistant, in order to reveal himself in the event of death to bring him back to life after passing a ~quick time event~. The most bizarre addition is that of seduction simulations, Mondo has in fact the possibility of spending moments of intimacy with charming girls, a parenthesis that activates a real prits sexy minigame. The aim is to fill the protagonist's arousal bar, observing the girl's body without crossing her gaze. Once the objective has been completed, we have the possibility of giving her a gift, provided that we have previously purchased it in the aforementioned shop; it ranges from very expensive watches to perfumes, up to special objects that can only be recovered after defeating certain bosses. You can imagine the outcome of the operation: following spicy skits we can enjoy interesting bonuses, such as new weapons to be mounted on the bionic arm which include a deadly drill, a wave cannon and a freezing ray, without excluding the inevitable objectives. Although undoubtedly hilarious for being totally unrelated to the context, these mini-games are not that fun to play and get bored too quickly, considering the fact that it is necessary to complete them several times to get to the result. The same must be said for the sidequests that are gradually activated on the world map, little more than a series of more or less successful variations that only serve to lengthen the broth. The campaign certainly does not stand out for its length, settling at seven hours and with a chapter repeated twice, but with a good replayability determined by the objectives and the possibility of tackling everything at higher difficulty levels. Xbox 360 goals 47 objectives for a total of 1000 player points are the numbers that distinguish Killer is Dead. Completing the main campaign allows you to win only a third of the total points, for all the others you need to roll up your sleeves to win the various extras, starting from the various suits, side quests and romantic adventures. Good luck! Long live sobriety Technically Killer is Dead relied on the timeless Unreal Engine, here truly unrecognizable. The whole production is dominated by a very marked stylistic cut, by the cel shading used everywhere to give a manga aspect to the artistic ideas of the introductory animated scenes. As mentioned, we are faced with a multicultural amalgam full of references and quotations, including gore excesses, comic interludes and situations bordering on the absurd. The reinterpretation of Carroll's Alice up to the persistent presence of a busty nurse who appears astride a flying syringe is an annals. The climax comes in the boss fight which sees us face a possessed locomotive (sic!). The graphic exasperation is unfortunately not without consequences, especially for the immoderate use of filters which often makes the image too dark and the scenes not always legible, when not exactly visually unpleasant, while the characterization of the monsters, called wires, does not keeps pace with that of the protagonists. On the other hand, the graphic gimmicks to highlight the Adrenaline Rush and the galvanizing counter-moves prove to be excellent, with the images that switch to black and white leaving only the color of the blood, which obviously flows in rivers, exalting the viewer. In a therefore quite variable picture, the only security comes from the audio sector, entirely managed by Akira Yamaoka. The historic composer of Silent Hill unleashes in a soundtrack that draws from various genres, from electronics, jazz, rock and classical music, to create a fusion full of personality and which manages to become a real sounding board for Suda's eccentric style. A masterful work that does nothing but confirm the talent of a great musician. Last note that will please purists: the game features both English and Japanese dialogues, while in both cases Italian subtitles are guaranteed.", "date": "2013-08-27", "grade": "8.0"}