{"name": "Una recensione top secret", "ref": "https://multiplayer.it/recensioni/122187-the-bureau-xcom-declassified-una-recensione-top-secret.html", "text": "The Bureau: XCOM Declassified seems to perfectly bring together all those difficulties typical of the gaming market which over time, in one way or another, have influenced many important projects. A game whose development began at the launch of the console generation that is now about to end, based on a universe that gave birth to turn-based strategy games that are still considered among the best exponents of the genre today. But rather than attempting a simpler route, subsequently undertaken by Firaxis with the excellent remake XCOM: Enemy Unknown, the guys at 2K Marin wanted to attempt the more complex route, that of transporting the peculiar elements of the original title. The reveal to the public took place only at E3 2010, after a series of internal changes to the development team and rethinking of the concept, but the negative reaction of prints and the public was so strong that 2K Games, the publisher, was forced to call back all in the pipeline with the aim of finding a better compromise. The rest is history: first a series of postponements of the release date, then absolute silence and, suddenly, at the beginning of the summer of this year, a new reveal accompanied by a change of title and important news on the artistic, aesthetic and above all gameplay front. But we know that when the gestation of a video game is so long and above all full of substantial changes, it becomes really hard to get an excellent title out of the hat. Did the guys from 2K Marin surprise us in a positive way? Not really, or at least not that much, and now we'll explain why. XCOM Declassified is a third-person shooter that will satisfy the most experienced players Where do we start? The year is 1962 and the Cold War between America and Russia is at its height. John Fitzgerald Kennedy is the current president of the United States and the nation is on the verge of unleashing a nuclear war against its archenemy if only the latter dares to make a few more military moves. In this critical and high-voltage scenario, America has set up a secret organization known only to the president and a particularly restricted military and scientific council, the Bureau of Strategic Emergency Command. The task of this secret force is to act as the first line of defense in case Russia suddenly decides to invade the Stars and Stripes territory and at the same time to protect the people from information leaks that could generate mass panic or even real city riots. Within this narrative background, the player will take on the role of William Carter, a former CIA agent who made his reputation by personally intervening in some dramatic events in recent American history and who has now been recruited by the Bureau to train and lead a specialized assault squadron in adverse and disadvantageous situations. William has a stormy past and an alcohol addiction he's struggling to overcome, resulting from the sudden death of his wife and daughter in an accidental fire at his home while he was away from his homeland on a secret undercover mission. The game opens with an unexpected and bloody alien attack that will force Carter and a handful of military and scientific forces to take refuge in a secret base that will soon become the operations center of the newborn XCOM. If the incipit immediately proves to be extremely interesting and engaging, however we must cool our hearts because, although well written and full of numerous dialogues and insights, the story soon loses its edge, becoming rather obvious and also decidedly phoned in the (few) strokes of scene. The narrative evolution is certainly to be appreciated, which ends, among other things, with a couple of pleasant detours on the theme, but perhaps we would have expected something more from a title with such a full-bodied background which, however, is reduced to intervention discussions military with some scientific and moral digression between characters whose personality seems outlined with an ax and whose psychological thickness is practically reduced to the bone. And among other things it is a great pity that references to the classic titles of the series (or to the recent remake) are practically non-existent from a plot point of view. However, dissecting some numbers concerning the narrative, the game was concluded by the writer in exactly twelve hours according to the internal counter of the game, using the third of the four difficulty levels and carrying out all the missions available in the game, both the mandatory and the optional ones . Through a map of the United States, present in the smain wing of the secret base, we will in fact be able to choose to carry out the main ones in order to carry on the story, or a handful of secondary missions that will become available with the continuation of the plot and which serve to make Carter and the selected allies gain experience, or to pick up some new technology. Sometimes there will also be some tasks available for reserve agents. These are ~automatic~ missions where it will be enough to select the agents to send and, once one of our levels has been completed, we will be able to collect the rewards (technology or new higher level agents). There is no possibility of defeat and, also for this reason, we struggle to understand the usefulness of this addition. On the other hand, our judgment on the missions that can be carried out in the first person is more than good: there are about fifteen in total, all quite long and demanding and also with some interesting gameplay deviations. From this point of view we can only speak well of the work done by 2K Marin to differentiate these adventures sufficiently and it must be emphasized that the secondary missions do not disfigure compared to the main ones except for a sometimes showy recycling of the settings. And once in the game? Before going down to the battlefield it will be a must to configure our squadron. We will have a total roster of eleven agents to be able to work alongside Carter. Their recruitment is free: we will be able to recover them through side missions or create new ones from scratch. Apart from a minimum of aesthetic customization, we will have to choose one of the four classes of belonging (Engineer, Commando, Reconnaissance and Support); each brings skills that can be used as you level up, a specific tree of talents, and a specific weapon proficiency. Unlike the protagonist, who can be equipped with two weapons, a type of grenade and a support kit, simple agents can only be configured in the main weapon and in the kit. The latter is in all respects a permanent bonus and ranges from a faster reload speed of skills, to a more precise aim, to bonuses for damage inflicted on targets with shields or armored and so on. These kits, but it would be more correct to call them backpacks, can be recovered during missions in the form of technological projects; consider them the only true collectible of the game, scattered in the most hidden corners of the levels. The choice, at the end of the game, is really very wide if you have dedicated some time to exploration but, unfortunately, you will always find yourself using the usual two, three decidedly more incisive than the others. Weapons must also first be retrieved on the battlefield before they can be equipped on Carter or allied agents. We talked about levels a little above and in fact XCOM Declassified offers a light role-playing character progression system. Carter will be able to go up to the tenth level, his agents stop at the fifth instead. Simply by killing enemies and completing various missions you earn the experience points necessary for promotion, and this allows you to choose a permanent upgrade within a class-specific skill tree (William will have one of his own). For the most part, these are new powers that can then be used in battle, but there are also passive upgrades and improvements in the energy of the characters or in the damage inflicted. Once the battle has been tackled, the game looks like a third-person shooter with rather classic controls and strongly focused on managing cover and teammates. Anyone who has played Brothers in Arms or Full Spectrum Warriors (in some ways also SOCOM), knows what to expect. By pressing the Space key it will in fact be possible to activate the Battle Focus: a sort of ~slow motion effect~ that will allow us to give specific orders to our allies and to Carter himself through a specific screen interface. In this way we will be able to tell the agents to take certain positions, hit a specific enemy and, above all, activate the various skills, all with a command queue that allows you to put several on the stack and then dedicate yourself to something else. The focus also allows you to observe a portion of the map of the level and to make enemies and any interaction points of the scenario immediately visible. Precisely this peculiarity of XCOM Declassified makes the clashes very tactical and strategic, with the need to constantly surround the enemy and keep the shelters offered by the scenario and the movement of fellow soldiers under control. The energy of the soldiers is in fact low and it will be enough to remain in the open to be mortally wounded in an instant. The game is unforgiving and if you are not quick to rescue an agent, starting on the second difficulty level, he will die permanently. It must be emphasized that this particular nature of the clashes makes them very repetitive since we will spend a large part of the time choosing where to place the soldiers and making them attack specific targets while waiting for the skills to recharge before being able to use them. In fact, the enemies offer an acceptable variety in behavior (although they are few in numerical terms), they tend to move a lot and as the game progresses we will meet enhanced versions of them with better shields or weapons. In short, if you are a fan of Gears of War or Uncharted you could get burned given that in The Bureau the trigger pressure is rather low and making an order wrong can be paid dearly, often with the loading of the last automatic checkpoint set by the developer, with wise malice, at the beginning and at the end of each fight. Being such a crucial element for the gameplay, the artificial intelligence of the teammates is constantly under the watchful eye of the player and unfortunately it will happen on some occasions to see them position themselves autonomously in uncovered points, perhaps next to a sheltered opponent for escape a grenade thrown by enemies. As much as we appreciate this glimmer of suicidal cunning, the result is a micromanagement that will force us to keep a close eye on the soldiers to make sure they haven't wandered around the level of their own free will only to find them slaughtered on the ground and too far to reach them before they bleed to death. On a couple of occasions we've also seen rather major pathfinding issues with one of our soldiers willing to cross the enemy barrage of fire to get to a certain position rather than using a quiet back road. At higher difficulty levels this can prove to be very frustrating but the occasions in which we have been forced to restart from the last load can be counted on the fingers of one hand. What else remains? In between missions, XCOM Declassified allows the player to roam around the Bureau's base quite freely. In these situations, in addition to consulting the map of assignments, we will be able to chat with the key figures of the organization and read documents and notes left and right, consult photographs and listen to pre-recorded tapes. In all cases, these are small insights in the form of collectibles, which try to offer a little additional material to the player interested in the story. Even the dialogues are all optional, with the obvious exception of those preparatory to the advancement of the story, and appear very similar to those seen in Mass Effect, with a circular ring that allows you to choose certain topics or close the conversation. In some, sporadic cases, we will also be able to face secondary missions inside the base which, if completed, will allow us to unlock some tasks for the agents in reserve. These micro-missions are absolutely forgettable and have unfortunately left us with a bad taste in the mouth: probably in the original design they served as a bridge to a more in-depth system of interaction with NPCs but in the restyling of the game it is possible that everything was cut for a more fluid and immediate result. More generally, facing The Bureau: XCOM Declassified a sense of incompleteness is perceived, as if some element cut out for production needs was always missing (emblematic is the lack of the element of researching technologies or studying aliens, the backbone of the series) . It's all nice and works well but there's not a single element of excellence. The same goes for the technical aspect of the product as well. The game uses the Unreal Engine 3 and is therefore pleasant but not incredible from a graphic point of view. The scenarios are in fact rather sparse and immobile, however beautiful at first glance, and a little general dirt is noticed, thanks to the rather basic particle and post-processing effects. Among other things, on the test PC at 1920x1200 resolution and with all the details set to high, the frame rate tended to be very uncertain, highlighting a not particularly accurate engine optimization. For information, XCOM Declassified also supports DirectX 11 and Tessellation. On the other hand, the animations of the characters are good, even if the response to Carter's commands is always on the razor's edge and sometimes appears a bit woody and not very imm", "date": "2013-08-20", "grade": "7.5"}