{"name": "Fiori-to-play", "ref": "https://multiplayer.it/recensioni/122116-plants-vs-zombies-2-its-about-time-fiori-to-play.html", "text": "When Keith Zentner, brand director at PopCap Games, told us that Plants vs Zombies 2 was the riskiest, most delicate and most important game the Seattle developer had ever worked on, it certainly wasn't a PR gimmick. The 750 million dollars behind the acquisition by Electronic Arts have put the Bejeweled and Peggle company on a sturdy but very narrow seat: on the one hand there is the economic security of a publisher with big shoulders; on the other, the need not to disappoint expectations and to have to make some compromises. Because while PopCap may have retained his creative freedom, it's hard to believe that the choice of the free-to-play model for Plants vs Zombies 2 wasn't in the least bit influenced by EA's growing love for the microtransaction formula. During the weeks following the soft-launch in Australia and New Zealand, our concerns mostly concerned the balance of the game economy. Only now that the title is available on all markets around the world have we finally been able to sum up and find out how lucky the innovations introduced with the new Plants vs Zombies have been. From the pyramids to the old west If Plants vs Zombies 2 had been set again in Crazy Dave's courtyard, the impression of being in front of a more of the same instead of a real sequel would certainly have been more evident. Just to add a minimum of variety both in aesthetic and narrative terms, PopCap Games has thus decided to resort to the clich of time travel, catapulting Dave and his talking camper Penny into past eras. The fact that the objective of the mad protagonist is to eat a delicious taco should give an idea of the insanity of a story that never tries to be too articulate and which is limited to being a pretext for setting the levels earlier in the Ancient Egypt, then in the world of Pirates and finally in the Wild West. However, things could get more interesting with the next game updates: once the last level is finished, Professor Zombatron is introduced, a new and curious character who in all probability will be the enemy of the fourth futuristic-themed setting. Yet, despite the scenario changing compared to four years ago, the game formula remains identical to that of the first chapter. A horde of zombies try to overcome the player's defenses by crossing the grid from right to left and attacking everything in its path; the goal is therefore to stop the enemies by collecting suns and spending them to arrange the plants according to their skills and your game strategy. Even the vast majority of plants and zombies have remained almost unchanged since the first Plants vs Zombies, but some unpublished additions give way to new challenges and new strategies. The Coconut Cannon, for example, is capable of defeating a large number of enemies within its range, but in addition to being expensive, it takes a long time to reload. Then there is the Bloomerang, which as the name suggests launches boomerang-shaped petals capable of hitting the zombies in front of it twice. Even among the ranks of the undead there is some nice news, but the most interesting aspect is that for each type of enemy there is a plant that is particularly effective: the Bidirectional Peashooter can K.O. zombies that somehow manage to get past their plants, while the Lightning Rod can instantly fry the army of chickens summoned by the Fighting Chicken Zombie. However, Plants vs Zombies veterans will notice that the number of unlockable plants has significantly decreased compared to the past. From 48 of the first episode, in fact, we have passed to ~only~ 32 plants, a skimming linked above all to the absence of aquatic and nocturnal levels, although nothing excludes that the latter will be reintroduced thanks to future updates of the game. Plants vs Zombies 2 is the perfect example of how to make a free-to-play game. Braaaainz! Micro-plantations The vertical structure that characterized the campaign of the first Plants vs Zombies gives way here to a map made up of crossroads and secondary paths. The same mini-games, which in the previous chapter were collected in separate menus, are here integrated in the form of levels in the different settings. However, this is an expedient to entice the user to replay old levels and explore each setting, although a minimum of grinding is required to unlock every corner of the world. The most important novelty in terms of gameplay, however, concerns two new elements: the fertilizer for plants and the special techniques.The first is collected by taking out rare colored zombies, and allows you to activate the secondary ability of any of your plants on the field. The Sunflower unleashes a barrage of suns, the Walnut Wall is protected by heavy armour, and the Lightning Rod generates a cloud that stalks and zaps enemies one by one. The fertilizer for plants was then joined by three special techniques that can be activated by spending money and which require simple inputs via the touch screen: pinching a zombie instantly decapitates it, tapping it upwards throws it in the air and holding a finger on the screen is pulverized with an electric discharge. Although these additions are designed to help the less experienced get by in the most uncomfortable situations, it is clear that they represent the gears of the free-to-play mechanism at the base of Plants vs Zombies 2. Through microtransactions it is in fact possible to obtain extra fertilizer or further money from spend on special abilities, but luckily the development team has done a great job of balancing, and the gaming experience never proves too frustrating or unfair to those who decide not to pay. The speech of the premium plants is similar, five exclusive units that can only be purchased using real money: among these, some of the favorites of the first chapter stand out, such as the Zombiesmash or the Burning Log, but even in this case the player can make use of less and continue using only the free unlockable plants.", "date": "2013-08-17", "grade": "8.9"}