{"name": "Sul trono d'Europa", "ref": "https://multiplayer.it/recensioni/122011-europa-universalis-iv-sul-trono-deuropa.html", "text": "Some things are so boring to explain how exhilarating, fun and memorable to experience firsthand. Trying to describe the rules and functioning of board games, for example, is exhausting but a couple of games are enough to get into the mechanics of the experience and you can't do without it anymore. Europa Universalis, a series that not by chance is inspired by a famous board game, suffers from the same syndrome: the grand strategy genre requires you to pay attention to an endless amount of elements and the action is almost non-existent, but if you don't let the quiet start and boredom of the dedicated articles put you off, you'll soon get totally involved. In recent months we have told you several times about the fourth chapter of the series and today the time has come to sum up the work done by the Swedish development team. We can anticipate that we liked the game and, without being a revolution, it represents an interesting step forward for the franchise. In short, if you are afraid of getting bored reading the following lines, a piece of advice in a nutshell: don't miss it. Europa Universalis IV is a successful sequel to one of the best strategy series available The story game The clock of Europa Universalis IV starts running on 11 November 1444 and stops almost four hundred years later, after covering the most interesting and crucial centuries for defining European and world boundaries and balances. Although nations are divided into groups according to importance, a scale that reserves the largest number of dedicated events and systems to those of prestige, the player can take any of the forces of the era and guide them through a sandbox experience on horseback between historicity and total freedom of choice. The game engine is the same already used for Crusader Kings II, a powerful tool that on the one hand has made possible a three-dimensional rendering of the map, buildings and units that has no precedent for Paradox Interactive, and on the other has proved versatile enough to allow the developer to pursue another important goal, namely the rationalization of the gaming experience. Instead of aiming for a further increase in complexity, which after the numerous expansions of Europa Universalis III would have cut off a large portion of possible users, it was in fact decided to look back to rework the true beating heart of the series, i.e. the supremacy of historical simulation on everything else. This does not necessarily mean a simplification of the game - which in fact does not present itself in terms of options and complexity in a way unlike the chapter that preceded it - but rather a better interface and mechanics that make the games even more engaging. The historical event system, for example, was created at the time of the second release, way back in 2001, and has hardly been revised since. Today Europa Universalis IV can count on a greater number of events that actually occurred, capable of having a more realistic impact on experience and with better management of the conditions necessary for these to occur. The national ideas have grown and are divided into groups, so as to suggest to the player a coherent and credible path throughout the development process of his own nation. The best result of this new episode, probably, is precisely the ability to mask and make certain gameplay gears natural that usually contributed to making the series a mysterious and inscrutable object for many. Endless changes How many times in the last ten years have you opened the box, physical or virtual, to find a manual of almost one hundred pages inside? Very few, but Europa Universalis IV is an exception to this rule and for good reason. Sitting on the throne of a nation is complex, requires considerable skill and knowledge and the period imposes tough challenges. For each system called into question, Paradox Interactive has developed small and large innovations: it is not possible or even useful to list them all, but there are some that seemed particularly significant to us. The concept of Monarchical Power causes points to be added each month to the total of those available for each of the three classic items - administrative, military and diplomatic. These points are to be used for everything from technological advances to decreasing the rate of inflation to choosing certain National Ideas; they are the currency required for each decision made and their accumulation is affected by the choice of advisers. Commerce has been completely revised: the complexity of the previous challenge, soprat all in terms of the effort required to manage the merchants, he ended up suggesting automating their movements, while now things are a little more intuitive. On the map, the trade routes meet in precise nodes, strategic points where you have to send your envoys to build trading offices. It is necessary to grab the most interesting nodes and direct the most interesting trades to them: it is not simple but at least the mechanics have gained in clarity and interest. Getting in touch with other nations, whether for commercial or war purposes, requires the immediate setting in motion of the diplomatic machine which is substantially modified by the passage between the third and fourth episode of the series. Relationships of friendship or rivalry are influenced by a greater number of elements and above all you can choose three arch-enemies, so as to have bonuses with any other forces in the field who share the same hatred for one or more of our rivals. The disappearance of the spies has caused the diplomacy panel to take charge of some of their options. So whether you want to arrange a marriage, arrange a peace treaty, instill rebel uprising in your neighbor's territory or build a belli cause, now everything is orderly and easily accessible in the same place. When things get really serious and you have to arm yourself to take the field, Europa Universalis IV shows some significant differences with the past. War technologies, for example, are numerically lower but more significant, so as to give a sense of progression with each new step reached. Furthermore, troops can enter a state of ~disorganization~ when their morale is too low - even in case of victory - by standing still or even retreating into a province controlled by us until normality returns. Furthermore, among the numerous modifications and additions, the choice to give greater weight to the terrain on which the units are located stands out: in this way, a good positioning can give a decisive margin of advantage to a numerically inferior team. The list goes on and involves aspects of the religious management of the state, the removal of other figures such as magistrates, unpublished options that bring into play stability statistics and so on. Anyone who has tried the demo or followed the dozens of development diaries of these months will know that the count of introductions is very high and that it does not only involve the single player ... All at the same table Over time we have tested numerous versions of Europa Universalis IV choosing a good number of different sides. We have thus ascertained that once again the challenge is virtually infinite. Each nation is really well characterized and moving to ~secondary~ continents, one realizes the variety and customization that countries like Japan and China have also obtained. Territories out of the running for power in Europe but equally interesting to explore. Of course, taking into consideration the third episode complete with all the expansions, the number of contents could be unsatisfactory for some, but the additions make the experience new and interesting so the complaint is marginal. Those who are not satisfied with playing alone should know that the multiplayer mode still hosts 32 users, but is enriched with some unpublished additions. Meanwhile, it is possible to enter the game in progress, taking the place of a nation up to that moment managed directly by artificial intelligence. Furthermore, this can be instructed in some simple tasks to return to replace us if we have to be absent from the map for some time. An improved net code, completely revised matchmaking based on that of Steam and advanced server management complete a picture that is not revolutionary but of substance. Anyone arriving at Europa Universalis just now, however, is likely to take some time before launching online. The advice is to play and enjoy the endless sandbox campaign first, perhaps starting from the tutorials and the ad hoc introductory scenario. We greatly appreciated the reorganization of all information, the more rational interface and the notification system, they are important aspects for a title that requires you to spend enormous amounts of time between the menus and will make both novices and experienced players happy. In general, the technical component is pleasant although certainly not amazing. Let's just say it does its dirty work convincingly. The music that does a lot when it comes to immersing the player in long game sessions stand out. Unfortunately Italian is not supported and thisfor some it can make a difference. Let's say that it's not at all impossible to play Europa Universalis IV without having a perfect knowledge of English - or French, German or Spanish - but it certainly helps a lot to understand at least the basics. So be warned.", "date": "2013-08-13", "grade": "9.0"}