{"name": "RACE: Rocket Arena Car Extreme", "ref": "https://multiplayer.it/recensioni/race-rocket-arena-car-extreme-recensione.html", "text": "What are the ideal ingredients for a mobile combat racer? An immediate and precise control system, fun and sufficiently varied gameplay, fluid graphics and finally an approach to racing that rewards fast and impromptu use. And if it is also possible to play for free without waiting or constraints, all the better. As you are about to read in the review of RACE: Rocket Arena Car Extreme, the new title developed by SMOKOKO for iOS and Android devices basically satisfies all the above requirements and not only that, going even further with support for Bluetooth controllers and a progression system that unlocks new modes as you go. Structure RACE: Rocket Arena Car Extreme, our monster truck in pursuit of others Let's start right from the contents, which in the case of RACE: Rocket Arena Car Extreme become available by leveling up, thus giving a precise meaning to the progression and increasing the variety of the experience as the time invested increases. It starts from a traditional Career and then accesses the Events, the Tournaments, the Battle mode and the Rocket Arena, all names that describe the relative stipulations in a rather precise way. In the same way it is possible to switch from the starting vehicle to other vehicles more powerful, but in this case there are some limitations and therefore it is necessary to put a hand in the wallet or wait patiently to have collected the credits and resources useful to be able to take this step. In all cases, the presence of advertising is frequent, but well dosed, with short trailers or which in any case can be skipped after a few seconds. Through an in-app purchase (currently only 99 cents) it is however possible to eliminate them altogether. Gameplay RACE: Rocket Arena Car Extreme, an extra mode with rings As mentioned at the beginning, RACE: Rocket Arena Car Extreme also supports Bluetooth controllers for the maximum possible precision, but the starting layout uses well-arranged and sufficiently reactive touch controls, with also an option to assign the steering to the accelerometer where prefer this solution: a particularly complete set of options, as well as an excellent calling card for those who play the game for the first time. Once on the track, the gameplay reveals itself to be traditional, solid and with few frills: acceleration is automatic, the monster truck can be managed by touching the edges of the screen and there are also four buttons to operate boost and electric charge, missiles and shields. An equipment that allows you to deal with increasingly aggressive opponents, who will above all try to ram us to slow down our race. On balance, crashing into a wall during a race turns out to be the most annoying situation in the game, given that the vehicle continues to accelerate and getting back on track is not a very simple undertaking. In the event of major difficulties, the inevitable icon for repositioning appears, but at that point recovering positions will not be easy, thanks to the always fairly limited duration of the events. The system is coherent and works, the controls support it adequately and any needs for greater variety in terms of action are fulfilled through the unlocking of the additional modes, as mentioned. In short, the feeling you get already in the first hours is that of a pleasant and well-made racer, even if not very original. Graphics and sound RACE: Rocket Arena Car Extreme, the energy bar indicates how many hits we can still take The technical sector of RACE: Rocket Arena Car Extreme can count on graphics that are neither revolutionary nor particularly spectacular, but are always fluid and detailed, moreover with a series of adjustments that allow you to obtain decent performance even on older devices. With an iPhone 12 Pro, however, we were able to use the Ultra preset without any problems. If monster trucks tend to look a bit too similar, the same cannot be said of the scenarios, which boast a certain degree of visual variety thanks also to lighting conditions and specific color tones, but the assets tend to be quite generic. The sound is only functional, which accompanies us with discreet music and essential effects.", "date": "2022-05-06", "grade": "7.7"}