{"name": "Brothers: A tale of two sons", "ref": "https://multiplayer.it/recensioni/121944-brothers-a-tale-of-two-sons-un-viaggio-avventuroso.html", "text": "Brothers: A Tale of Two Sons marks the debut of the new Starbreeze, a reality drastically downsized following a commercial flop, that of Syndicate, which led the software house to decide to move away from the triple A market to rediscover its freedom and create new intellectual properties. From this transformation a project inevitably less impressive than the previous ones was born, but the Brothers concept is anything but modest and aims to involve us in a unique narrative experience, a puzzle adventure enhanced by the collaboration with the Lebanese director Josef Fares . The story begins with the death of a woman, mother of two very close brothers who, already marked by the tragedy, find themselves fearing for the life of their father, who is struck by a serious illness. The situation appears desperate but the two protagonists have no intention of giving up and set off in search of a gigantic enchanted tree in which a miraculous fluid flows. Thus begins a journey against time between kind ogres and strange cults, magical winged creatures and threats of all sorts. Two guys one pad The gameplay of Brothers: A Tale of Two Sons is collaborative or involves the use of two protagonists with different characteristics who can interact with each other to overcome insurmountable obstacles and to make up for each other's limits. This type of formula is certainly not new in the gaming landscape and has exceptional representatives starting from the classic Vikings and Goblins to get to more lively formulas such as Ico and the latest Prince of Persia. But in Brothers the peculiar control system transforms this kind of experience into something new. The title Starbreeze, in fact, allows us to control the two protagonists, who are the two brothers we talked about in the introduction, simultaneously. A solution rarely adopted before, probably also due to the intrinsic difficulty of having to control two different entities independently. But the developers have managed to make something so peculiar possible by simplifying the gameplay to the extreme and exploiting the symmetry of the pad. Each stick controls a specific brother and its trigger is the only key needed to interact with the game world. Jumping is automatic and to throw an object or leap from one ledge to another, simply tilt the stick in the desired direction and release the relative trigger. Nothing transcendental, in short, and very often it is possible to move one character at a time. But in some cases the simultaneity of the action becomes important, perhaps to distract a dangerous creature with a character so as to allow the other to move freely. Even in these junctures, however, things remain rather simple and the initial puzzles, elementary to say the least, are more than sufficient to understand the mechanics of the game which does not include any type of combat, excluding a juncture in which we are given the possibility of wave a torch, and which also puts stealth situations, boss fights and climbs into puzzles. In the latter case, to be honest, a bit of extra attention may be needed, given the risk of falling, and there are a couple of moments where timing and action matter, but the title is quite generous against any mistakes and almost always remains focused on solving puzzles. And even the latter hardly ever get really complex. There are very few puzzles that require the use of gray matter and there is no risk of losing the path which is almost always obligatory. What is left, then, to support the experience? Xbox 360 goals Brothers: A Tale of Two Sons is one of the few titles where objectives are an integral part of the gameplay. The loot amounts to 400 points divided into 12 achievements, none of which is related to skill or advancement. To unlock them it is necessary to find secrets and complete miniquests consistent with the fairytale spirit of the title and this means that it is possible to complete the title without obtaining a single point. The pleasure of discovery The strength of Brothers: A Tale of Two Sons is the extreme variety of situations. You never know what element we will interact with, who will help us, where the monster that stands in front of us will end up, which creatures we will be able to exploit to our advantage and above all how we will be able to exploit them. The Starbreeze title is a real kaleidoscope of situations, a continuous discovery, a fluid set of situations that are almost never difficult to deal with but not boring thanks to the encounter with delightful, funny or threatening creatures, thanks to the mechanics that adaptno to the situation in a surprising way and thanks to the movements of a delicate soundtrack that suddenly rears up in vocalizations and symphonic flashes to enhance particularly intense moments. Moments that, among other things, often delight the eye and this is a fundamental element to support the title's desire to continually surprise. The Unreal Engine has undoubtedly shown us better from a technological point of view but Brothers stands out from an artistic point of view with fantastic and at the same time credible architectures and with always different environments, inspired by various fantastic worlds but always coherent with each other, clearly belonging to the same universe. To this we must add simple but spot on models, fascinating creatures, suggestive rays of light, breathtaking backgrounds and a high draw distance that is masterfully exploited. The result, as we have anticipated, is excellent and all goes to the benefit of the atmosphere which is clearly set on a fairy-tale register. But in this case the fairy tales are the ancient ones, the ones that don't try to protect children but try to teach them to appreciate that magical combination of amazement and finitude that is life. There are spirits and comforting forces but the dimension of death remains dramatic and the game world is built to support this approach. And here hanged bodies make the black forest even more disturbing while eyes and fangs await us on the edge of the shy luminous halo generated by the torch. Immersed in this magical but terrifying world, the two brothers look around, physically manifest the pain of distance, support each other in the face of horror and perform macabre deeds. Then they smile, express their relief and face their fear with a series of comedy skits. Unfortunately some of these are not particularly elegant and there are several moments in the title which in another context we could define as trivial. But in Brothers they work, they are elements that contribute to that extreme variety we were talking about before and which give life to an adventurous journey,  la Gulliver, enhanced by a gameplay specifically designed to support the narrative dimension and to involve the player. Unfortunately the trade-off is a short running time, roughly four hours, due to both the lack of challenge and the modesty of the project. And the latter factor inevitably also influences some elements of the technical sector. Collisions are inaccurate, some animations are forgettable and the water foam is really bad. But considering the price and genesis of the title, when made by Starbreeze it is still massive and the excellent artistic direction, supported by more than good camera movements during the numerous interlude scenes, puts the defects in the background preventing small flaws from interfering with the ability of the title to involve and amaze the player. Final note, Brothers: A Tale of Two Sons is currently available exclusively for Xbox 360 but will also be released for PC and PS3, respectively via Steam and PSN, in early September. Brothers: A Tale of Two Sons takes advantage of simplicity to surprise us again and again", "date": "2013-08-09", "grade": "9.0"}