{"name": "L'orrore venuto dal mare", "ref": "https://multiplayer.it/recensioni/121906-the-drowning-lorrore-venuto-dal-mare.html", "text": "You shoot zombies like a lot of other video games, but The Drowning doesn't go unnoticed in the flood of titles released in recent weeks on iOS and competing mobile platforms for at least a couple of reasons. The first is given by the particular horror setting created with considerable attention to the graphics sector, which results in non-trivial artistic choices regarding the scenarios and the general atmosphere, although there are evident ups and downs. An invasion of aberrant figures (or zombies) is not exactly the height of originality, but the way it is told, especially in the early stages and the idea of the mysterious black tide that swallows men and returns monsters gives a rather original touch to the otherwise obvious canvas, also allowing us to glimpse possible ecological interpretations of the story. The second reason of interest, probably more incisive, is given by the control system adopted by the developers, which has caused people to talk about this game as a sort of ~revolution~ of FPS in the mobile sector, no small thing, if we consider the popularity of the genre, the expansion of the mobile market and the fact that the first-person shooter has never managed to find perfect harmony with portable devices. The experiment has succeeded up to a certain point: the controls are actually valid but do not exactly correspond to a complete transposition of the dynamics of the FPS in mobile form, and the fragmented structure of the game fails to compose a convincing picture, especially when compared to the depth of a standard title on PC or console, to which The Drowning would have the ambition to aspire. The main problem is given by the splitting of the experience into many levels that can be tackled in rather short fractions of time and based on the principle of grinding, with the need to repeat them several times in order to find objects, weapons and components necessary to unlock further areas to explore. also organized according to this logic. It is clearly a structure that derives from the freemium approach, being filled with expectations, limitations and reductions that can be avoided, eliminated or augmented by spending various sums of money through micro-transactions. A solution to which we are accustomed, but inserted within a game that promises a narrative line of a certain level causes some bewilderment, since the traditional level-by-level progression is completely crumbled in a series of fleeting repeated installments within the same settings just to set aside a few points and unlock some objects that allow us to continue. Good cues on controls and atmosphere fail to bring out The Drowning Search and shoot, shoot and find So let's talk about this alternative control system, which probably proves to be the most important element of production. Instead of presenting the classic setting with the virtual sticks (still selectable but definitely not recommended), the developers have seen fit to create a system in which, simply, you touch the arrival point on the screen for a move and shoot by touching the screen with two fingers, with the projectile hitting the area between the two points of contact. The system is intuitive and pleasant to use but has at least a couple of negative consequences: the first is the covering of elements on the screen due to the need to press with two fingers, which on an iPhone proves to be very annoying. In fact, already on an iPad the position of the hands becomes somewhat invasive, but with a smaller screen it practically covers a large part of the field of vision. The second consequence is the inability to move while shooting. There is a key that allows front flipping 180 degrees, but beyond that it is not possible to move while shooting (strangely, you can do this by selecting the traditional control system) beyond looking away, what which translates into a sort of mobile rail shooter, with the need to move towards a point in the scenario, stop, shoot the incoming wave of enemies (which are limited, in most cases, to running towards us without any strategy of attack), move to another point, shoot another wave and so on. Such a setting goes well with a rather flat level design, which alternatively requires you to ~attack~ or ~defend~ an area but essentially places us in front of these ~on-rail~ shootings within a rather limited time limit , at the end of which points are earned which lead us to automatically unlock objects, components and weapons. The sense of progression is herelinked solely to the collection of points for the conquest of objects, which seem somewhat disconnected from the game action, while the latter turns out to be a continuous reply to the attacks of the monsters interspersed with frequent runs from one point to another on the maps. It's a shame also because the settings are made with great care thanks to a high-profile graphic sector and the general atmosphere, with this particular interpretation of the zombie apocalypse coming from the sea, could have offered more ideas for the story and the structure of the levels , perhaps giving a more complete sense to the exploration of the scenarios and to the structure of the game itself.", "date": "2013-08-08", "grade": "6.0"}