{"name": "Quel verme di un robot", "ref": "https://multiplayer.it/recensioni/121299-blastron-quel-verme-di-un-robot.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. In the not-too-distant future, humans are building robots to fight their wars. Machines so sophisticated and capable of killing humans that they can't help but carry out their goals... resulting in a planet completely devoid of life. Once the human race has been eliminated, the robots just have to fight each other, transforming the Earth into their battlefield. This is the incipit of Blastron, a strategic action game for iOS devices created by Kabam (team that has already authored the excellent Fast & Furious 6: The Game) and published on the App Store using the usual freemium model: the game can be downloaded and used for free, but there are several in-app purchases that allow you to buy extra tickets (necessary to try the missions that make up the single player campaign), as well as weapons and upgrades of various kinds. From this point of view, it is impossible to hide it, Blastron knows a lot: our robot can be customized in various ways on the aesthetic front, with substantial practical repercussions, and to fight it needs weapons and ammunition that we must get for it by accessing the integrated shop and spending the virtual currency (dice) and real currency (bolts). Launching into battle without effective weapons and / or with few bullets is equivalent to suicide, so the game leads us to check our stocks from time to time and to act accordingly. This doesn't mean that you can't play without spending money and with a little patience, mind you, but the freemium element is not a little noticeable. We must also acknowledge the developers for having included an online multiplayer mode (for now with only deathmatch) which is played without the need for tickets and proves to be an excellent source of dice, ergo there is always something to do and there is no bored nor forced to wait for the ~refills~. Blastron looks like a Worms clone, but a successful, fun and fairly varied clone Blasta passing you Once in action, Blastron reveals his nature as a clone of Worms, quoting the classic Team 17 weblog in various ways. The game mechanics are effectively identical: within a completely destructible scenario, a certain number of robots (including ours) must face each other using the available weapons and acting during a turn that lasts a few seconds and which allows you to move and attack. The management of the weapons is also very familiar, with lines that draw the trajectories and must be evaluated differently depending on what we want to use: missiles tend to respect the launch forecasts, while grenades move differently and finally there are melee attacks. Among these there is also the shoryuken, the fiery uppercut, which definitively confirms the cloning work carried out by Kabam. The differences compared to Worms are to be found mostly in the abundant outline, which we mentioned earlier: weapons, objects, armor and boosts are in fact very numerous and shape the experience depending on the equipment. Our robot also has capsules for teleportation which, used like grenades, allow us to move quickly around the stage and, perhaps, remove ourselves from a position too exposed to enemy fire. The missions that make up the single player campaign are not only many, but also fairly varied, which makes you turn a blind eye to some uncertainties of the control system, given that sometimes the character tends to ~get stuck~ and it is not always easy to move where we want. As far as the technical sector is concerned, the yield of destruction with respect to the locations is obviously basic, ~chasms~ are created as if someone were simply erasing a drawing, which from an aesthetic point of view is certainly not the best but the work continues of Worms quote. The various customizations and the discreet design of the robots still give the necessary freshness to the product, however equipped with a slightly weak sound accompaniment.", "date": "2013-07-20", "grade": "7.8"}