{"name": "Ombre dal passato", "ref": "https://multiplayer.it/recensioni/121190-face-noir-ombre-dal-passato.html", "text": "In the beginning it was Gabriele Papalini. The bold game designer, fresh out of the IED in Videogame Design, began in 2008 to rack his brains over an amateur project. Time passed and he was joined by Marco Sgolmin, who provided the indispensable performance of the programmer. The project at that point grew in complexity and the idea of developing a marketable graphic adventure appeared in the minds of the duo, since this was the genre that had fascinated Papalini since the days of LucasArts (and who can blame him). If you want to know more about the development of Face Noir we advise you to read Papalini's blog on the official site, in fact it contains very interesting material for those interested in game design. At the moment it is enough to tell you that the meeting between Papalini and Sgolmin led to the birth of the Mad Orange development team and to Face Noir, the team's debut game. The adventure was released in Germany by Daedalic Entertainment in 2012, with German dubbing. In Italy, however, it arrived only later towards the end of the year, without dubbing but subtitled in Italian thanks to the Zodiac edition. Now a new edition distributed by Phoenix Online Studios faces the market. Finished, dubbed in English and subtitled in Italian. This is probably the definitive edition of the game and we have therefore stepped forward to reveal the mystery hidden among the docks of the dirty port of New York together with Jack del Nero. From the title of the game and the photos, smart kids immediately understand that this is a noir adventure. The references are already noticeable in the first seconds of the game: the protagonist's surname brings to mind Rex Stout's Nero Wolfe, while the Marlowe cigarettes he smokes are a quote from the private investigator Philip Marlowe born from the imagination of Raymond Chandler. In the background the cynical and disillusioned New York of the Great Depression of the 1930s, a gloomy hodgepodge of mediocre dreams. Talented starlets dreaming of Hollywood, alcoholic hustlers, eccentric millionaires and career-minded criminals haunt the neighborhoods where ordinary people face the specter of failure. Jack del Nero is the classic noir character, an ex-cop who was framed, had to hand in his badge and is now a private investigator. In his head and on the screen the incessant interior monologue takes place, which makes irony the defense mechanism from himself and from the world. Like the last Max Payne, in short. As always, the story begins with an assignment, entrusted to him by a wealthy father determined to recover the money he is forced to pay to his squandering young daughter. Del Nero's job is to photograph the exuberant scion in a compromising situation that allows her father's lawyers to ask for the suspension of maintenance. A squalid affair like many others, except that soon only the thread of a dense plot connected to del Nero's past is revealed. The solitary investigator will therefore be forced to do what all men like him do: desperately try to save someone other in the hope of saving himself. Face Noir is a dark and reflective adventure that plays the ace at the end Clear mind, despite the whiskey Face Noir is a classic point and click adventure, as almost all of them are. You therefore know very well what to do: look around, click on points of interest and solve puzzles. The three-dimensional inventory is perhaps the most attractive graphic element but it suffers from some unfortunate design choices. In fact, every time we have to open the objects screen, click on the one we want to use, go back to the game world and see if it works. Otherwise we have to select it again. A mechanic made less frustrating by the fact that there are few objects to collect or interact with and it is never necessary to combine them within the inventory. Also, most of the puzzles can be solved with whatever is nearby. It is rare to have to move between screens that are far from each other, except during the later stages of the game. In these cases, however, del Nero almost always suggests the destination and can count on a trusted Chinese taxi driver to get us around. You will therefore have understood that Face Noir is a fairly simple, albeit long and complex adventure. It takes an average of ten hours to finish it, especially thanks to the large amount of detail that can be examined in each screen. Most are of no practical use but serve well the purpose of enriching the game world with believable information that increases engagement. Furthermore, the information that we find in this way and during the dialogues occasionally provide elementthe keys to a very interesting investigation mechanic. In fact, in some moments del Nero stops to reflect and a screen appears in front of us with various clues scattered in the background. If we connect the right ones together, our detective has an illumination that allows him to advance in the investigation. The idea is very good, even if immature. It can certainly be explored further and hopefully Mad Orange will make even more use of it in the sequel to the game. The connections are not complicated and above all serve to make us feel part of a realistic investigation. On the other hand, the simplicity of the puzzles goes precisely in this direction: without looking for too daring solutions, but making use of common objects, Mad Orange has created a very plausible adventure. At all times, one gets the impression that progress is due to our ability to conduct research and connect clues rather than the ability to overcome obstacles with improbable logistical solutions. Indeed, the least successful parts of the game in our opinion are the interactive moments in which we have to reassemble broken objects. The checks in these cases become cumbersome and it is more of a hassle than a pleasure. Perhaps the developers are also aware of this and, at least for the sections in which we have to pick a lock with a lock pick, they allow us to skip the test. Other dynamic puzzles turn out to be inspired and well thought out, as in the case of the notebook to decipher. There are even two short sections where we have to get over a stretch of road undetected and a dark walk through the sewers. They are all pleasant ideas that we gladly welcome. They just need to be polished better and distributed more sparingly throughout the game. Black mood Playing Face Noir we got the idea that Mad Orange knew his limits well and decided to move within them, carrying out the task with great diligence without taking risks. This turned out to be good and bad. The setting, details and storyline are in line with the genre and consistent with each other. The evocation of a noir atmosphere is therefore successful and convincing. Unfortunately, however, this is a slow genre, which leaves room for long reflections and silent and realistic gazes on the surrounding reality. In order to engage and keep attention high, a highly evolved writing is therefore necessary, which digs deeply into the characters while unraveling the mess of their lives. Face Noir, on the other hand, willingly slips into hackneyed images, remaining for the rest of the time on the safe ground of the already beaten roads. Even if there are strong emotions at stake, we never get to fully experience them, and everything seems distant. However, this judgment is not a criticism of the work of Mad Orange, who has created multifaceted characters with strong motivations. You feel that underneath there is a creativity that wants to put out into the deep. Unfortunately, he only dares to do so in the final, when an esoteric turn suddenly awakens the player's attention. Too bad that at that point there are just a few minutes left until the end of Fac Noir and everything is postponed to the second chapter. We can only hope that in the sequel the developers dare more, thanks to the experience gained. When it comes to presenting Face Noir, budget constraints are unavoidable. The drab screens with recurring shades convey the moral delcino of the time well but the art direction has yet to find its personality. The character models and voice acting are sufficient and do their job. The only sore point is that ~damn~ that often comes from del Nero's mouth. For an Italian born in Calabria to an Italian mother, his English accent when pronouncing the curse is painful to hear. The music is a carpet that is there but is immediately forgotten and ignores the emotional changes in the mind of the protagonist and the twists and turns of the narrative. A point that Mad Orange needs to work on. Despite its shortcomings, adventurers will still like Face Noir. Indeed we advise all of them to try the demo without delay. The substance is there and the feeling of conducting a real investigation is worth the many hours of play. With a little patience you discover intriguing scene elements such as an old punched-card reader and an ingenious analog archive research machine. And then there are the many moments of reflection and meticulous search for clues. Jack del Nero may not be a memorable anti-hero, but he gets the job done.", "date": "2013-07-18", "grade": "7.0"}