{"name": "Figlio di un Deus minore", "ref": "https://multiplayer.it/recensioni/121170-deus-ex-the-fall-figlio-di-un-deus-minore.html", "text": "Since its announcement, Deus Ex: The Fall has been received in a prejudiced manner by a large part of the gaming community due to its nature as a mobile game, despite all the efforts made by Eidos and Square Enix in demonstrating how the product aimed to tell a parallel story to that of Adam Jensen, complete with all the gameplay elements that had made the fortune of Human Revolution on consoles and PCs. Now that the title is finally available for download on the App Store, it's time to check which of the two parties involved was closest to reality... Stealth by necessity Needless to say, the truth lies somewhere in the middle: therefore, if on the one hand Deus Ex: The Fall is a product that has few equals in the mobile sector for the complexity and depth of the playful experience offered, capable of truly including every ingredient of Human Revolution, on the other hand, inevitably ends up colliding with the limitations of a touch device, proving to be unable to match the pleasure of the original. Certainly one cannot deny Eidos a great deal of praise for the effort made in terms of setting and presentation of the title: the plot of Deus Ex: The Fall stands as a direct sequel to the novel Icarus Effect, and has for protagonist Ben Saxon, a soldier with cybernetic implants who, together with the former secret agent Anna Kelso, finds himself in the uncomfortable situation of having to flee from the mercenary group of Tyrants and at the same time make up for the lack of Neuropozin, the anti-rejection drug essential for his health. Beyond the ties that will please all those who have played Human Revolution (the events narrated take place during Adam Jensen's six months of rehabilitation and the members of the Tyrants are the same bosses who faced each other on consoles and PC), the care taken by the developers to provide Deus Ex: The Fall with a respectable context is evident. Sure, the story doesn't have a particularly broad scope and the moments of real pathos are distributed with a dropper, but we still find ourselves above the mobile gaming standard in this sense, considering that the adventure lasts around five hours and that of Square Enix this should be the first episode of a series. Even moving on the strictly technical front, Deus Ex: The Fall shows record-breaking qualities, with graphics that amaze above all for the excellent realization of the Panama City scenarios (the freely explorable center from which all the primary and secondary missions of the game unfold ), generous in size and enriched by all the ocher light effects already the undisputed protagonists of Human Revolution. Exceptional in many respects, Deus Ex: The Fall sadly misses the mark in its shooter phases The fall of the Gods The more than ambitious undertaking of transporting the typical gameplay of Adam Jensen's adventure to iOS has instead been the victim of inevitable compromises, some acceptable when not downright pleasant, others that essentially end up imitating the experience only with the stealth component. The problems are an inaccurate targeting system - albeit widely customizable - a barely sketched detection of the blows suffered by enemies in different areas of the body as well as the poor artificial intelligence of the opponents themselves, all components that end up making the action approach to the game infinitely less appreciable than the silent one. It is therefore a pity to note that while the same freedom of choice of Human Revolution has been effectively re-proposed on a formal level in the design of Deus Ex: The Fall, with situations that can always be faced in a more or less direct way at the discretion of the user, in fact that of stealth is an almost obligatory choice due to the unsatisfactory contribution given by the shootings. Anyone who can live with such a gap is however destined to be fascinated by the playful offer of the title created by Eidos and N-Fusion: the adventure is full-bodied, the scenarios are full of elements and characters to interact with, objects and weapons there are many (with the latter susceptible to upgrades just like in Human Revolution) and the whole RPG-style structure with experience points to be accumulated to evolve the protagonist's cybernetic systems has remained almost unchanged. The developers have also been good at adapting some gameplay details to mobile use, for example by making the shop accessible at any time from the pause menu or by placing comfortable virtual keys in the corners of the display for quick access to special items and abilities . Although the interface has finally been made as streamlined as possible, playing Deus Ex: The Fall on iPhone can be a much less comfortable experience than its iPad counterpart, due to the many on-screen indicators and buttons that are often even small in size.", "date": "2013-07-16", "grade": "7.9"}