{"name": "Down in the valley", "ref": "https://multiplayer.it/recensioni/121142-trackmania-2-valley-down-in-the-valley.html", "text": "TrackMania 2: Valley arrives a very short distance from Stadium offering us 65 new challenges to be faced with particular caution. This time Nadeo has in fact decided to explore the dynamics of rallying, with a heavier vehicle launched at full speed on tracks made up of tarmac and slush. This does not mean, and those who know the series will have already guessed it, that the title has any simulation ambitions. The formula, in fact, remains the classic one with only five buttons that allow you to fully control the vehicle. An extremely simple structure but which is enhanced with the editor, from this release blessed by full Steam Workshop support, and which is enhanced by the amazing online infrastructure of Nadeo. Navigating the ManiaPlanet menus is not yet the most intuitive but, once in the game, with a couple of clicks it is possible to save replays, change tracks and confront a specific ghost which is automatically saved in the online database when a player registers once official. And it is precisely the saving of official times that is one of the most peculiar elements of the new TrackMania, with the possibility of recording an official record attempt only once every five minutes. In this way, although luck is still relevant in the case of single times, only those who work to master all the tracks have the possibility of putting together a series of excellent times and climbing the rankings based on the score. These, in ManiaPlanet, are divided by region, nation and macro-region and allow for a detailed classification of the players and implicitly generating dozens of rankings to conquer along the road to fame. In any case, returning to the driving model, however limited the changes are, they have a significant impact in the universe of precision curves of TrackMania 2. Tackling the dirt road, for example, is all a game of inertial slides with the vehicle sideways at every hint of a bend. These must be minimized, in order not to lose traction, with tight and precise trajectory sequences. A whole serpentine of detours must be calculated even before the vehicle takes it and it is very difficult to recover errors with the classic handbrake which, in the slush, often ends up making the situation worse. In essence, controlling the car is more complex even if, as we anticipated, the steering response times remain those typical of the series and the supernatural reactivity of the vehicle allows for micro-corrections that would be absolutely impossible in a simulation. All of this is obviously functional to the competitive component which, as we have said, remains focused on filing the times along a series of small and medium-sized tracks. But the greater number of variables still increases the margin for improvement of the times, making it more difficult - than it is in the previous chapters of the series - to follow the ghost of the champions to find the perfect sequence of trajectories for each track. The wonders of the valley Among the novelties of TrackMania 2: Valley there are not only accessory features and new terrain blocks for the editor but also some visual improvements. Nothing striking, especially since in relation to the gameplay what Nadeo has done is already more than enough. On the other hand, at 200 per hour the textures become blurry, the morphology of the tracks changes rapidly and the need to look at the road surface keeps the player's attention away from any defects. In this type of setting the background and the colors are more important than the detail and in the TrackMania formula it becomes more attractive to be able to quickly load the next map to challenge its records, instantly restarting the race for each attempt gone wrong, rather than having a monstrous yield and having to wait several minutes for the track to load and several seconds to reset the ride after a crash. In any case, the improvements are welcome and produce changes which, while not revolutionary, are undoubtedly tangible. Valley gives us lush vegetation, a few more animated elements to enrich the scene, real-time reflections on the vehicle body and a less flat lighting system, already seen in TrackMania 2: Stadium, capable of increasing the depth of the scene. Small touches, certainly not comparable to the amazing rides of Daytona USA, but capable of increasing the liveliness of the scenario, making everything more engaging without particular burdens for the engine. On the other hand, some of the graphic elements introduced by Nadeo show, when the camera lingers on the details, a quality that is anything but exciting. The vegetation, egFor example, it is thriving but in terms of definition it leaves something to be desired and the same can be said for the soil and the rocks. On the other hand, the yield of the water is excellent, although this is absolutely still and free from any splash or effect when our vehicle crosses it. But the overall result, as we have anticipated, is to be admired at 200 km/h, with eyes fixed on the track, the sole and absolute king of TrackMania, darting between dozens of ghosts in a multiplayer server or aiming to overcome just one, downloaded by sifting among the records of champions. Ultimately, the work done is good and once again highlights the ability of the developers to alter the gameplay just enough to give us a significantly different experience, while keeping the competitive core of the series intact. But the valuation cannot fail to be affected by the price which is double that of Stadium. An incomprehensible choice given that even the latter, released a few days ago, offers a peculiar riding style and includes the same number of races. And the support of the Steam Workshop system for the editor, offered free of charge in the case of many other titles, is certainly not enough to justify such a substantial price gap. And, among other things, after three releases, one may wonder why Nadeo doesn't introduce some new way to make the experience even more varied while giving greater weight to the new sub-chapters. TrackMania 2: Valley is like a beautiful woman, dangerous curves and constant risk of slips", "date": "2013-07-15", "grade": "8.0"}