{"name": "Esercizio di stealth", "ref": "https://multiplayer.it/recensioni/121083-dark-esercizio-di-stealth.html", "text": "The premises were good, indeed they were excellent. Developed by the German team Realmforge Studios, DARK puts us in the shoes of Eric Bane, a man who wakes up in a daze in a club full of chicks and tunz-tunz music, without remembering how he got there. The vision of a white angel seems to guide him inside the room, together with excruciating pains which, we will discover, are due to his recent transformation into a vampire. Not a ~complete~ vampire, however: apparently whoever made him one didn't complete the process, which requires that the victim also drink the executioner's blood. If she doesn't, in a matter of hours she is doomed to turn into a ghoul, a pathetic creature, more like a beast than a man. Made aware of the situation by Rose, the owner of the Sanctuary (the place mentioned above), which is not by chance run by vampires, Eric finds a possible solution to his problem: to suck the blood of a being like him but of purebred ~ noble~, which would be equivalent to completing the transformation process. Rose offers to help him via radio, guiding him inside the buildings and possibly supporting him by hacking the security systems, and so an adventure consisting of six chapters begins in which we will not only have to try to find a vampire capable of ~saving us ~ thanks to his blood, but also understand what is hidden behind that mysterious angelic vision. Is she really an angel or...? Hide and seek DARK, without too many words, is a stealth game. But just stealth, to the core. Eric can hide behind chairs or low walls, in bushes and of course behind walls, also using his vampire powers for the purpose, such as an ~infrared vision~ to pinpoint the position of enemies and the ability to teleport in an instant from point to point in the scenario, as long as I can see it. However, the character is also unusually fragile for a bloodsucker, and this means that once discovered by a guard he will die within seconds under his bullets. In the early stages of the game this factor is a source of great frustration, because in practice you can't make the slightest mistake, under penalty of game over and the recovery from the last checkpoint, which is never as close as we would like. Clearly, in the field of stealth mechanics the developers have indulged themselves: Eric can silently eliminate the enemies he surprises from behind, always walking low, or choose to feed on their blood. This operation is not silent and therefore must be carried out at a safe distance from any other opponents, it lasts a few seconds but fills one of the ~notches~ that allow us to use the other dark abilities, all of which can be upgraded using points that we earn as we finish the missions and kill people. One such ability is the Shadow Kill, for example: Eric teleports as usual, but instantly kills his target. Or the shadow claws, which allow the character to eliminate a guard thanks to his own shadow, from a distance. DARK is a stealth game with an interesting story, but also limited gameplay Roundabout The other powers implemented by the DARK developers revolve around the distraction of the opponents and silence, but the skill that we would do well to enhance immediately is undoubtedly the character's resistance, which allows us to resist many more bullets and therefore to flee in case of sighting and hide while waiting for the state of alarm to pass. But forget about Metal Gear Solid: in this case it will take a good ninety seconds for the guards to forget about us and any corpses on the ground (which fortunately we can move to hidden areas). The increase in Eric's resistance actually affects the balance of the gameplay, modifying it substantially: if in the first mission it is practically impossible to get caught and come out alive, after having pumped up the character's defenses it will sometimes be possible to give a damn about everything and everyone, launch the attack and reach the next area of the level. Crossing this threshold, in fact, the situation will ~reset~, even if up to a meter before they did nothing but shoot at us. The problem is that DARK, as we have said, focuses on stealth ignoring everything else, and that is why the protagonist's combat system only works when he is hiding, showing his side to obvious limits in the open field. Considering the budget available to Realmforge Studios, it is possible that the team has decided to focus on a single aspect of the experience to take care of it with dignity and leave everything else alone, but in this way the enjoyment of the gioco is undoubtedly affected. The same can be said for the technical sector, with cel-shaded graphics at times pleasant but decidedly ~old gen~, especially in terms of animations, and badly recited English dialogues.", "date": "2013-07-13", "grade": "5.5"}