{"name": "Sognando la maglia gialla", "ref": "https://multiplayer.it/recensioni/120929-le-tour-de-france-2013-sognando-la-maglia-gialla.html", "text": "If you thought that a historic sporting event like the Tour de France could not be interpreted in a video game key you really have to think again, Cyanide Studios has been trying for years to represent the competition on our monitors and Tour de France 2013 is probably the culmination of the experience gained by the team, also thanks to the use of a completely new graphics engine. Representing a complex discipline such as that of cycling is not a trivial operation, especially on consoles where it is not easy to find a balance between complexity of real competition and the frenetic rhythms typical of the video game. The developers have taken the path of customization, leaving full freedom to the user in planning the stages, and embracing mechanics from rather elementary racing games to set up the actual race. Le Tour de France 2013 manages to capture attention with the beauty of the sceneries No hurry As expected, the game allows you to face the twenty-one stages of the tour with your favorite team, they are present all the official teams and stages thanks to the license, which is manifested through a series of splendid HD movies in real time that help breathe the excitement of the race. The next step is to choose supplies to be exploited in the race, for a maximum of two, each with precise characteristics based on the strategy adopted. The athletes have three energy bars related to the ability to maintain sprints and endurance, the first is runs out quickly and represents a sort of turbo to be used sparingly, the second is shorter in wearing out but causes a crisis for the cyclist which should be avoided. Finally, there is a third bar relating to general durability. The various supplies, which include fruit, drinks or crackers, have variable effects on the energy bars and are crucial in relation to how we want to face the stages, whether through pure sprinters or specialists in climbs. The heart of the game as mentioned is represented as a typical racing, with the cyclist accelerating using the right trigger and the x key to shoot, however Cyanide hasn't forgotten the strategic aspect. It is possible at any time select the preferred cyclist in order to discourage individual performance, once the detachments between the competitors the team vision is quite evident as it is stimulating for those looking for a more reasoned experience. Each team then has specific objectives to be carried out according to its own peculiarities. The stages are represented in depth in the length, so as to require even an hour each, characteristic which doesn't help the pace much but which can be scaled up by accelerating the run through a graphic simulation. In this case obviously the race is managed by artificial intelligence, attention must be paid to how it unfolds of the various attacks, in order to return in an incisive way to the game. Xbox 360 goals Tour de France 2013 features 27 goals for a total of 1000 player points. Cyanide will not win the prize for originality in this area, as completing all the stages leads to conquering more than half of them. If you are looking for a title that can offer objectives in a rather conventional way and without major headaches, you have found it. Just arm yourself with a lot of patience. The merry outings The flagship of Cyanide production is represented by the graphic characterization. Although far from impressive in terms of polygonal load and detail, the engine accurately paints the wonderful locations French towns, starting from the suggestive Champs Elysees, but the coasts, the rural and above all mountainous sceneries abound, with breathtaking views and an almost surreal summer atmosphere. Crowds on the side of the road cheer on the athletes vigorously and there is virtually no shortage of visual variety. What is most striking is that, despite being viewed as a racing, Tour de France 2013 cancels the typical frenzy of the genre by exploiting the extremely dilated rhythms, so much so that it often happens to look around to enjoy the view rather than focus on the race. Unfortunately, the downside is considerable, unless you are extremely passionate of the tour of France or more generally road cycling, the title is likely to get boring after just a few hours and it does not benefit from a particularly elaborate control system, furthermore seeing the cyclist pay with the simple loss of speed for any contact with the edge of the track is very unrealistic. Graphic glitches are felt through an asphyxiating presence of tearing, the screen is constantly split in two, resulting not only in compromisestter the visual quality, but to distract from the actual game. The low production values can even be found in the menus, which are spartan, confusing and characterized by anonymous music. It must be said in defense of the Cyanide production that the aggressive price could overlook these defects. Also noteworthy is a multiplayer mode for two players online.", "date": "2013-07-12", "grade": "6.0"}