{"name": "La Rivoluzione pu attendere", "ref": "https://multiplayer.it/recensioni/120931-tekken-revolution-la-rivoluzione-puo-attendere.html", "text": "When you imagine a three-dimensional fighting game, your mind almost always runs to any of the 8 episodes (Advance and PSP versions excluded) of Tekken. Born with PlayStation and, despite the two episodes also converted to Xbox 360, inextricably linked to it, the Namco-Bandai title has represented for many years the first choice for millions of passionate gamers around the world; the great success has meant that an undergrowth of boys and girls was created, gathered in communities, committed to continuously challenging each other in competitive tournaments and friendly competitions. The culmination phase, according to many reached with the third chapter of Tekken and the first Tag, was then followed by other certainly experimental episodes but, for reasons repeatedly analyzed in the course of the various reviews, not loved by the fans of the first hour and by the players so-called ~pro~, that is those used to challenges and world stages. In Tekken Revolution, which returns exclusively to PS3, for the first time two elements never seen in any other classic fighting game appear: the free-to-play formula and the experience points capable of altering the values of the characters. How I develop you the wrestler The approach to reviewing a title like Tekken Revolution immediately poses a basic problem, linked to the level of experience of the reader: in fact, in Tekken, a professional player sees the fights, the characters and the whole game context with expert and hypercritical eyes ; the ~Sunday~ player, on the contrary, seeks only spectacularity and entertainment, ignoring any balance or frame problems. For example, the experienced player immediately turns up his nose at the formula chosen for the distribution: the term free-to-play takes on the sinister meaning of ~pay if you want to win~. Fortunately, but we will see it in the appropriate box, more correctly you could shell out a few euros just to play frequently, given that access to the modes is limited; alternatively, as always in these cases, to save money, just wait for the right amount of time. The second, more serious, element of disturbance concerns the setting of Tekken Revolution dedicated mainly to the online mode. The reason is easily understood, especially if you have tried to seriously play any episode of the series via the internet in recent years: the lag is in fact in some cases embarrassing, such as to force you to rely completely on chance during the fight. In addition, even in the presence of an acceptable signal, the entire gameplay is slowed down, forcing sudden changes of style, not to mention the natural curses due to easy combos that are almost always wrong online. The first two selection menus are therefore entrusted to the Ranked Battles and those of the Player, while the only offline mode remains a sad version of the Battle Arcade, with difficulty that cannot be changed and opponents managed by artificial intelligence that are particularly impractical. The revolution present in the title is instead linked to the menu item dedicated to enhancing the character, a feature that no longer concerns only the aesthetics, as in all the latest Tekken, but changes the performance parameters of one's virtual alter ego. Through skill points, obtainable by leveling up and therefore often winning both online and offline, it is possible to buy upgrades for Strength, Stamina and Vigor, in order to respectively increase the damage inflicted, the life bar and the possibility of critical hits or activation of the life bar. anger. Also in this case a very strong dichotomy manifests itself: on the one hand the undoubted charm of the enhancement, the stimulus given to new players to join Tekken and participate in many fights in the hope of growing an ever stronger character; on the other hand, the real ~blasphemy~ of seeing the handicap between two players substantially modified, violating the sacred principle of tournaments which sees the challengers starting as equals in any case. Tekken Revolution, but is this Revolution really necessary? Playstation 3 trophies Tekken Revolution, despite its Free-to-play nature, includes 13 trophies, divided into 9 bronzes, 3 silvers and one gold; no platinum. Most are goals that can be achieved simply by playing the title with a minimum of constancy, by accumulation; the least easy to unlock, for obvious reasons depending on the opponent's skill and above all on the quality of the line, is the one linked to the level increase, obtainable only after a series of won online games. Experience yes, but up to a certain point To mitigate, at least in part, this conceptual distortion of fighting games, the len takes care of itrate with which skill points and therefore the various upgrades are accumulated; furthermore, based on a consistent number of matches, the better handicap, i.e. a higher level, translates into little or nothing once in the ring, above all if in the presence of a strong technical difference in level between the human players. Basically, the situation is created, known to the most shrewd players, in which the strongest player manages to defeat the weakest even if the latter increases his handicap, confirming that only the strongest, in the long run, win. And going back to talking about real fights, Tekken Revolution follows, almost perfectly, the styles and mechanics of Tekken Tag Tournament 2, including the graphics sector, and we refer you to that review for further details in this sense; the fundamental difference however, in addition to the obvious absence of the Tag Mode, is the lack of the much talked about Bound System, the typical ground bounce at the end of each aerial combo, which still allows you to chain other hits by increasing the final damage inflicted. Without Bound, much of what was learned in Tekken 6 before and Tekken Tag 2 after loses meaning and the total damage inflicted, the moves remaining identical (apart from the animations of the critical ones, now in ~ultra-speed~ style with trails) is reduced drastically. The developers' goal is probably to lengthen the duration of the matches but, we repeat, in the event of a strong technical difference in level upstream, one can only witness rapid carnage. Finally, the roster of wrestlers should be noted, significantly reduced compared to the mammoth one of Tekken Tag 2, even if as you advance in level, other wrestlers gradually become usable. Iron Fist Shopping Each Tekken Revolution action costs digital currency. In particular, facing an offline Arcade battle, for example, costs an Arcade Coin and a maximum of 2 can be accumulated; the ~recharge~ time is one hour. Playing online involves investing a Battle Coin, which is ready in half an hour and can be accumulated in a maximum of 5 pieces. The Premium Coupons, which are obtained by winning, are a sort of Joker that can be used instead of coins and, when used, they give away extra prizes. Finally, the Premium Coins are the real game currency, which can be purchased from the store, and work like the Coupons, however without the final extra prizes; of Coins and Coupons you can accumulate up to 999.", "date": "2013-07-11", "grade": "6.2"}