{"name": "Miasma Chronicles", "ref": "https://multiplayer.it/recensioni/miasma-chronicles-recensione.html", "text": "Mutant Year Zero: Road to Eden is a much loved game. An experience that is certainly not perfect, but with enough of that charisma to push those who survived the first tough hours of the campaign to love its protagonists and their epic. Even if these were an anthropomorphic boar and a duck, moreover not very beautiful to look at. However appreciated, Road to Eden has for its developers, the Swedish studio The Bearded Ladies, a major flaw: it is based on the Mutant Year Zero board game license. However, it is a very strong imaginary, something that, according to them, has greatly limited their creative freedom. For this reason, for their third effort, the ladies with beards have decided to create their own universe from scratch and, thanks to the support of 505 Games, to try to take all the glory. In the review of Miasma Chronicles we will try to understand if the studio has managed to achieve its goal and if a successful series can be born from this strategic RPG. The evolution of Mutant Year Zero: Road to Eden The character design of Miasma Chronicles is certainly original All those who loved Mutant Year Zero: Road to Eden will have no difficulty in familiarizing themselves with the game mechanics of Miasma Chronicles. It is, in fact, once again a role-playing game which, during the fights, turns into an XCOM-style turn-based strategy game. The experience of the Swedish studio has allowed it to make the amalgamation of the various elements more cohesive and compact, in order to make the experience more fun and malleable, without the difficulty peaks of the debut game. This also made it possible to introduce some elements that could give the possibility of approaching Miasma Chronicles even to non-lovers of the genre. Miasma Chronicles blends role-playing with real-time strategy This happens mainly by giving the possibility to choose first the difficulty level, which goes from ~Story~ to ~Alpha Editor~, and then also what is defined as the game mode. In this case you can choose between Light Tactics, which allows you to have a statistical reading of the fights less linked to chance or other elements (such as distance), and Complete Tactics, which instead will throw at you all the variables that The Bearded Ladies has introduced into its combat system. This range of options should allow anyone to find the challenge that best suits their needs, as well as avoid those bottlenecks that made the first hours of Mutant Year Zero: Road to Eden an insurmountable obstacle for many. Two other elements that we really appreciated are the alternation between stealth and combat phases and the variables introduced for the equipment. An important element of Miasma Chronicles, in fact, is the preparation phase for the clash. While searching for his mother, Elvis and his friends will encounter various enemies that stand in their way and that cannot be avoided due to a linear map design, which makes use of so-called ~gatekeepers~ to prevent hasty access to parts of the advanced scenario. At that point there will be two alternatives: either try to face everyone head on (good luck) or try to thin out the enemy lines first. By sneaking up on them, characters with silenced weapons can try to take out opponents without alerting their comrades, perhaps by taking advantage of flanking or surprise bonuses. Despite this, not all enemies can be eliminated in this way, unless you have a hyper-powered group of heroes, but this does not mean that it is not worth simplifying a fight in this way, also because a key is enough to enter and exit stealth mode, something that allows you to reposition yourself quickly and intuitively. The fights of Miasma Chronicles are inspired by those of XCOM Furthermore, as the hours go by, Elvis and his allies will acquire a whole series of weapons, accessories and truly extensive skills which, combined with everyone's skill tree, is able to heavily modify the way of approaching a battle or using a certain character. For example, weapons can be upgraded or not. Also there are some with long range, some with short range, some with bouncing bullets. All this without counting Elvis' arm powers, which add another layer of variables and effects that should not be underestimated. The Story of Miasma Chronicles Miasma Chronicles will begin in media res The growth of Elvis' arm powers goes hand in hand with the maturation of the protagonist of Miasma Chronicles. The game, in fact, opens in the middle ofthings with the young man, accompanied by his robot big brother Diggs, who is trying to open a gap in the miasma to reach his mother. We don't hide that we were a bit blown away by the situation, but - also due to the fact that the boy initially does a lot of things he knows nothing about - we will slowly begin to familiarize ourselves with the game universe (a North America that fell victim to yet another cataclysm) and with its protagonists. In the more than 20 hours of campaign we will therefore know why Elvis has a mechanized arm, why the world has been invaded by miasma, why the protagonist's mother is at the center of all this, but above all what must be done to save his skin (even synthetic) of the various heroes. In this way the story of Miasma Chronicles pushes the player to go forward and, mission after mission, to discover a well-drawn and also fascinating universe, despite some ingenuity of the plot and an originality not quite worthy of a Nobel prize for literature. Matter of cleanliness The scenarios of Miasma Chronicles are quite fascinating Despite the team's experience (we are on the third game, pretending that Corruption 2029 does not exist), Miasma Chronicles has arrived on PC, PlayStation 5 and Xbox Series X|S with some defects that somewhat affect the quality of the experience. We're not just talking about technical problems that can be solved through the inevitable post-launch updates, but some flaws that lurk a little deeper than the experience. For example the fact that teammates teleport near the controlled character if he opens a chest or other, thus nullifying their positioning, or the unintuitive controls to select objects or targets, something that could lead to the mistake. The faces of the protagonists, then, are all rather inexpressive and some dialogues and characters could have been developed with more care. Stealth phases are very important in Miasma Chronicles Moving on to the fights, in some cases the enemies don't seem to behave in the smartest way possible, repositioning themselves when they could very well have struck, while other times they seem like relentless snipers, but in this case it could all be the result of bad luck. Nothing that affects the enjoyment of the game, but that takes it away a bit from excellence.", "date": "2023-05-26", "grade": "8.0"}