{"name": "Grand Theft Auto: San Andreas - Un gioco mastodontico", "ref": "https://multiplayer.it/recensioni/grand-theft-auto-san-andreas-un-gioco-mastodontico.html", "text": "K-DST Genre: Classic Rock DJ: Tommy The Nightmare Smith, played by W. Axl Rose 1. Foghat Slow Ride 2. Creedence Clearwater Revival Green River 3. Heart Barracuda 4. Kiss Strutter 5. Toto Hold The Line 6. Rod Stewart Young Turks 7. Tom Petty Running Down A Dream 8. Joe Cocker Woman to Woman 9. Humble Pie Get Down To It 10. Grand Funk Railroad Some Kind of Wonderful 11. Lynyrd Skynyrd Free Bird' 12. America A Horse With No Name 13. The Who Eminence Front 14. Boston Smokin' 15. David Bowie Somebody Up There Likes Me 16. Eddie Money Two Tickets To Paradise 17. Billy Idol White Wedding K-JAH WEST Genre: Dub/Reggae DJs: Marshall Peters, played by Lowell Sly Dunbar and Johnny Lawton, played by Robert Robbie Shakespeare1. Black Harmony Don't let It Go To Your Head 2. Blood Sisters Ring My Bell 3. Shabba Ranks Wicked Inna Bed 4. Buju Banton Batty Rider 5. Augustus Pablo King Tubby Meets Rockers Uptown 6. Dennis Brown Revolution 7. Willie William Armagideon Time 8. I Roy Sidewalk Killer 9. Toots & The Maytals Funky Kingston 10. Dillinger Cocaine In My Brain 11. The Maytals Pressure Drop 12. The Pliers Bam Bam 13. Barrington Levy Here I Come 14. Reggie Stepper Drum Pan Sound 15. Black Uhuru Great Train Robbery 16. Max Romeo & The Upsetters Chase The Devil K-ROSE Genre: Country DJ: Mary-Beth Maybell, played by Riette Burdick 1. Jerry Reed Amos Moses 2. Conway Twitty & Loretta Lynn Louisiana Woman, Mississippi Man 3. Hank Williams Hey Good Lookin' 4. Juice Newton Queen of Hearts 5. Asleep At The Wheel The Letter That Johnny Walker Read 6. The Desert Rose Band One Step Forward 7. Willie Nelson Crazy 8. Pasty Cline Three Cigarettes in the Ashtray 9. Mickey Gilley Make The World Go Away 10. Ed Bruce  Mama Don't Let Your Babies Grow Up To Be Cowboys 11. Merle Haggard Always Wanting You 12. Whitey Shafer All My Exes Live In Texas 13. Eddie Rabbit I Love A Rainy Night 14. Statler Brothers  New York City 15. Statler Brothers Bed of Roses RADIO X: The Alternative Genre: Modern Rock DJ: Sage, played by Jodie Shawback1. Helmet Unsung 2. Depeche Mode Personal Jesus 3. Faith No More Midlife Crisis 4. Danzig Mother 5. Living Color Cult of Personality 6. Primal Scream Movin On Up 7. Guns N' Roses Welcome to the Jungle 8. L7 Pretend We're Dead 9. Ozzy Osbourne Hellraiser 10. Soundgarden Rusty Cage 11. Rage Against The Machine Killing In The Name 12. Jane's Addiction Been Caught Stealing 13. The Stone Roses Fools Gold' 14. Alice In Chains Them Bones 15. Stone Temple Pilots Plush SF-UR Genre: House DJ: Hans Oberlander, played by Lloyd Floyd1. Jomanda Make My Body Rock 2. 808 State Pacific 3. The Todd Terry Project Weekend 4. Nightwriters Let The Music (Use You) 5. Marshall Jefferson Move Your Body 6. Maurice This Is Acid 7. Mr. Fingers Can You Feel It? 8. A Guy Called Gerald Voodoo Ray 9. Cultural Vibe Ma Foom Bey 10. Ce Ce Rogers Someday' 11. Robert Owens I'll Be Your Friend' 12. Frankie Knuckles Your Love 13. Joe Smooth Promised Land 14. 28th Street Crew I Need A Rhythm 15. Raze Break 4 Love 16. Fallout The Morning After Menu In order not to get lost in the long coverage of San Andreas, we have prepared a handy menu for you! - The review - The gangs present - Feeding and surviving - The radios and the songs - The images - The videos The movies - Grand Theft Auto: San Andreas movie #1 The movies - Grand Theft Auto: San Andreas movie #2 The movies - Grand Theft Auto: San Andreas movie #3 The gangs of San Andreas In San Andreas, unlike the previous chapters, the gangs will play an even more important role, both in the course of history and as ~life~ elements within the three cities that make up the world of this chapter. Each gang differs from the others for the different background (practically always in underworld colors), for the area on which it ~operates~ and (very interesting aspect) for the type of clothing that its components wear, easily recognizable and through which we can immediately understand who we are dealing with, and who will be our sworn enemies. If you find yourself in a border area between one gang and another, be careful, you could be involved in the middle of a shootout! The gangs of San Andreas Gangs present in the city of Los Santos:1. The Families Signature Color: Green Orange Grove Families  Once the most powerful gang in Los Santos but now, mainly due to numerous internal strife, has lost much power to favor the Ballas, who surround this family's ~possessions~. It is to this gang that CJ belongs, a gang recognizable by the complete use of clothing dthe green color, from the trousers to the bandana. Temple Drive Families  Another of the older ~families~ in Los Santos, who reside in the northern part of the city and are on good terms with CJ's gang, who can ask for help if they get into trouble with the police or factions rivals. Seville Blvd Families  This family now owns a small territory in the southeast area of Los Santos, due to the continued expansion of the Aztecas and Vagos. They too will help CJ should he get into bigger trouble than he is. 2. The Ballas Distinctive color: Purple Front Yard Ballas  They can be considered as the most bitter enemies of CJ's gang, their ways are in fact often brutal, not to mention that the major income comes from drug dealing. They control the Jefferson area. Rollin Heights Ballas  They represent one of the fastest growing gangs in the city of Los Santos. They currently control the Glen Park neighborhood, but their expansion is continuous and is heading towards Idlewood, one of the most contested areas in the entire city. 3. Los Santos Vagos Distinctive colour: Yellow This gang, of Latin origin, controls the north/eastern part of Los Santos, precisely between Las Colinas and Los Flores. Even for the Vagos, the biggest profits come from drugs, while they are currently engaged in a bloody struggle for control of East Los Santos. 4. Varrios Los Aztecas Distinctive colour: Blue Also of Latin origin, they have the Vagos as their fierce rivals. Among these stands out Cesar, the boyfriend of CJ's sister, Kendl, famous above all for his gangster skills. The Aztecas are also the major organizers of dangerous and illegal races in Los Santos. The gangs of San Andreas Gangs present in the city of San Fierro:1. San Fierro Rifa Distinctive colour: Dark blue Another gang of Latin origins, which manifests its influence in the San Garcia district, thanks above all to the drug trade. Be careful, they are extremely dangerous. 2. The Tongs and Triads Distinctive color: Red The Tongs are in command of the Triad, an organization based in Chinatown, ~specializing~ above all in extortion and protection through high payment. 3. Da Nang Boys Distinctive colour: Brown Very violent street gang, mainly found near the port and ghettos of San Fierro. Racketeering, drug dealing and piracy are its main activities. The gangs of San Andreas Gangs present in the city of Las Venturas:1. Mafia: Signature Color: Black The Mafia needs no further introduction, suffice it to say they control virtually every underworld business in Las Venturas, from robberies to extortion. Menu In order not to get lost in the long coverage of San Andreas, we have prepared a handy menu for you! - The review - The gangs present - Feeding and surviving - The radios and the songs - The images - The videos In order not to get lost in the long coverage of San Andreas, we have prepared a handy menu for you! - The review - The gangs present - Feeding and surviving - The radios and the songs - The images - The videos Feed and survive As already mentioned in the review phase, in San Andreas there are some components usually the preserve of role-playing games. In fact, it will not be enough for you to run around CJ for all three cities, in this episode you will also have to take care of his health, nutrition and physical fitness, otherwise you will not go far. What if we said you have to earn respect in San Andreas through your actions, and success among the fairer sex through your sex appeal? garages to store and reuse your cars at a later time, while to save we will be able to take advantage of special homes. The first at our disposal will be located in an old apartment of CJ's mother, continuing we will be able to take possession of new ones both automatically and through the acquisition of new properties. Feed and survive Nutrition/Fitness CJ will need to eat to restore his energy and store fat. To keep him in shape you should feed him at least a couple of times a day, just like in real life. You can feed yourself and buy food in restaurants, shops or hot dog vendors scattered throughout San Andreas. Be careful though, if you eat too much you risk CJ starting to gain weight, a physical condition that will negatively affect his skills and his racing. In this regard, you will also have to be careful about the foods you eat, a salad for example will only allow you to acquire energy, without itadding fat. If it were too late, you have several ways to return to maximum physical shape: first of all you can go on a ~diet~, not eating for some time; be careful not to overdo it, however, after about 3 days you will begin to lose muscle mass and finally vital energy. Another way is to exercise, by running, swimming or cycling. The best solution, however, remains to exercise in the gym, which will also be useful for increasing muscle mass. Feed and survive Going to the gym: Going to the gym will help increase your muscle mass, stamina and also the respect that gangs will show towards you, thus allowing you to sprint better, be able to swim and run faster and for longer time. To always have these values at acceptable levels, it is advisable to go there at least once every two weeks. Each city has its own gymnasium, with various equipment machines and even an exercise bike inside. There will also be instructors, each of whom will be experts in a particular fighting style, who will be able to teach Cj new and lethal moves. Feed and survive Weapons Each weapon has a skill level (whose status can be checked by pressing the L1 key when in possession) associated with CJ: in a nutshell, using the weapon to a greater extent will increase CJ's confidence level with the same, and we will be able to improve some important factors, such as the reload time, the frequency with which the projectiles can be fired, the accuracy of the shots and the unlocking of new skills (such as the possibility of moving while shooting, making fire faster or move backwards), as well as the ability to use two weapons simultaneously. Feed and survive Respect Respect will be acquired by performing certain gestures, completing certain missions, accumulating more money and so on. It will be very useful as it will allow you to recruit more members of your gang and will allow you to be treated better by the people who populate San Andreas. This characteristic therefore depends on three main factors: CJ's actions, such as conquering a new territory, which will affect about 40%; another 40% is conditioned by mission progression, 20% finally by everything else (success with the fairer sex, money, clothing and so on). Feed and survive Sex Appeal Well yes, sex appeal will also be important for the handsome CJ and will determine his success towards the fairer sex. This factor will be influenced by the physical appearance (clothes, haircut and tattoos) and by the type of cars that Cj will drive. Not all clothes that will increase sex appeal will help increase respect, however, sometimes they will tend to decrease it, and vice versa. For example, dressing sporty and in green will help increase popularity among Orange Grove members, but will not be appreciated by the female populace. Wearing expensive clothes, important watches and so on will instead increase both factors. It is one of the most anticipated games of the year. It is the fifth chapter of a saga that has sold dizzying figures overall, crumbling every sales record and collecting exceptional successes from audiences and critics everywhere. Furthermore, without forgetting the good dose of controversy that the series has inevitably dragged along (the most mischievous could see a clever marketing game behind it) for contents that defining ~strong~ and politically incorrect could be an understatement. Ladies and gentlemen, Grand Theft Auto: San Andreas is finally here, ready to conquer us thanks to an experience improved and evolved in practically every respect, a feat that is almost miraculous given the quality of the previous chapters and the limited time frame that Rockstar took to give birth to this new jewel. We played it first in the American version, and then in the Italian one, are you ready to make your way back into the world of the underworld? Welcome to San Andreas! It's 1992, a decidedly black year for our Carl ~CJ~ Johnson, forced to return to San Andreas, his hometown, due to the untimely death of his mother. The investigations seem to unequivocally indicate a murder, however who may ever have an interest in carrying out a similar gesture, now that his gang, the Orange Grove Families, have now fallen on hard times and are out of the big underworld, it really appears a mystery. In fact, since CJ ~emigrated~ to Liberty City, 5 years before the murder, his gang has started to lose ground, ending up counting for little in the criminal scene", "date": "2005-11-01", "grade": null}