{"name": "La sottile linea rossa", "ref": "https://multiplayer.it/recensioni/120756-redline-rush-la-sottile-linea-rossa.html", "text": "We have emphasized it several times: the endless runner genre is among the most inflated on the App Store and Google Play, so it's really difficult to propose something new. Some people tried to introduce some variations on the theme, but in the end the result was always the same and you ended up feeling a sort of deja vu after just a few games. Well, the guys at DogByte Games thought they finally had something concrete to refresh the genre: racing cars. No more guys who flee very fast, chased by who knows what monster: if we have to run, let's do it aboard a custom-built one and perhaps with a plausible reason, in this case an entire police district at our heels. This is the incipit of each game with Redline Rush: we find ourselves at the wheel of a dream car (the initial squad includes eight different models) and we have to make our way through the traffic of a state road to avoid arrest, trying to to avoid vehicles that proceed in the same direction as us and not to end up in the traps that the police helicopter places for us along the way. All within three very different scenarios: Highway, Canal and Greenwood. However, only the first is included in the initial purchase of the game: to unlock Canal and Greenwood you need 25 thousand and 75 thousand gold coins respectively, which is the virtual currency of Redline Rush. You got it right: the game doesn't belong to the freemium category (at least on the App Store) but it behaves exactly as if it were. Redline Rush is an endless runner that is different from the usual but with a slightly too stringent freemium vein Never stop How did the guys at DogByte Games structure the gameplay of their endless runner with cars? In the first place they have transformed the product into an action game rather than a driving game, given that our car can move within the roadway but is not required to swerve to face the curves, which flow in the same way as the straights. Secondly, they have avoided placing the classic three ~lanes~ on the screen, but have made the lateral movement of the vehicle completely free, through a very reactive and precise touch control system, which in the default configuration has two large arrows on the sides of the display. The interesting thing is that each of the cars that we can buy (and which cost relatively low prices) is equipped with different characteristics in terms of speed and handling, i.e. they respond differently to our inputs and therefore allow us to avoid obstacles at the last minute or they force us to plan actions well in advance to avoid the collision. The game over in Redline Rush, in fact, occurs if we simply hit another vehicle, a barrier or a concrete column, while nothing happens if we ram the cars sideways, an action that instead costs us some extra points. Along the way you collect the traditional coins, diamonds or bonuses such as a powerful boost that makes us semi-invulnerable for a few seconds, but even in the best case, scraping together the money needed to buy the new scenarios is almost impossible and you have to dig into your wallet . The technical sector of the game seemed decidedly less bitter to us, which indeed is among the strong points of the production: the settings are detailed and full of objects, however they flow fluidly on the screen and in the same way the polygonal modeling of our cars is more that good, with even a ~dismantling~ (albeit basic) when we crash. Little to say instead about the sound, which did not impress us.", "date": "2013-07-04", "grade": "7.3"}