{"name": "Giallo  bello", "ref": "https://multiplayer.it/recensioni/120344-cattivissimo-me-minion-rush-giallo-e-bello.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. Let's face it: the real protagonist of ~Despicable Me~ is not Gru, but the small and very nice Minions, little creatures who live to serve their master by carrying out the most varied tasks. The incipit of Despicable Me: Minion Rush is the awarding of the prestigious ~Minion of the Year~ award, which is definitely tempting for the character we will play during our games. The little yellow man gives himself momentum, jumps on a trampoline, hangs on to his companions as if he were part of a close-knit group of trapeze artists and then off he runs in an endless context that is divided between two different scenarios: that of the underground , in this case the endless metal galleries of the Gru base, and the surface one, in which one moves around avoiding cars and buses. By resorting to this particular videogame genre, which is popular on mobile devices (see the well-known Temple Run) and by adopting the equally well-known freemium model, Gameloft has in short performed an infallible operation on paper, but which in fact did not start in in no way benefited. The reason is easy to say: the running game trend has now said it all and the risk of incurring a deja vu was very high. To overcome this inconvenience, the French house has played its cards in the best possible way, first of all taking a cue from one of the best endless runners around, namely Subway Surfers, and therefore using different mechanics compared to the Imangi Studios blockbuster, thanks to the three well-defined ~lanes~ and a control system that uses the touch screen almost exclusively. A running Minion The watchword for Despicable Me: Minion Rush was therefore only one: to innovate. Or at least try to do so, within the limits allowed by a heavily inflated trend, as we have said. The developers have therefore opted primarily for a reasoned gameplay, with the speed that does not increase in a few seconds but rather gives us the possibility of going far, face boss fights (yes, there are those too and it's a first for the endless runner genre) and change scenery again. The world of the subsoil and that of the surface therefore present themselves as two sides of the same coin, but the action is much more varied thanks to this alternation, although in our opinion the dynamics that characterize the surface are more captivating. In fact, our Minion will be able to run down the street, avoid cars, jump on the roof of buses, slide under strong jets of water and even enter houses, jump out of the window and go down a slide back to the asphalt. In some situations, just see the slide or the special bonuses of the rocket and the ~maxi Minion~, the control system switches to the accelerometer and therefore our task becomes that of tilting the device to collect as many bananas as possible (the in-game currency, at least the virtual one, which allows you to upgrade bonuses and unlock items). Still with regard to the variations on the theme, in some moments the view switches from the traditional third person to a lateral overview. This is also new, but we found it too ~accessory~ and even annoying compared to touch controls. We then come to the element that stands out most of all: the technical sector. Despicable Me: Minion Rush is in fact, without a doubt, the best endless runner out there in terms of graphics, which are really rich in elements and have style to spare. The character we control moves in a world full of objects and things to see, colorful and full of surprises. The downside is represented by a frame rate that often shows the side to some uncertainty, at least on the test device, but we are sure that with some updates it will be possible to work on the fluidity of the experience. Despicable Me: Minion Rush is one of the best endless runners currently available on mobile", "date": "2013-06-22", "grade": "8.3"}