{"name": "Wario ed eventuali", "ref": "https://multiplayer.it/recensioni/120296-game-wario-wario-ed-eventuali.html", "text": "We could have done much better in these first months of life of Wii U, that's clear; rather than shed tears over what was not, and before singing the de profundis of the new Nintendo home console, it would be appropriate to at least wait for the system of the Kyoto house to blow its first candle, a goal that will actually allow a realistic and concrete budget and at the same time to analyze future prospects. This is because the turbodiesel with which the successor to the very successful Wii seems to be equipped is probably starting to warm up properly, and after a phase of authentic lean cows one can - especially in the first party field - see more than one light at the end of the tunnel. Waiting for the news announced at E3 to reach the shops between the end of the year and the beginning of next, there is a whole series of titles that are now ready for release and to try to convince users of the goodness of this much-maligned game Wii U. One of the first games of this ~new spring~ is Game & Wario, a sort of spiritual successor to the WarioWare series which, since 2003 with its debut on the Game Boy Advance, has practically touched all Nintendo systems. Sixteen 'til i die To provide a description of the title created by Intelligent Systems, perhaps it is easier to say what Game & Wario is not: although it is in fact based on the same characters and the same crazy idiocy that has distinguished WarioWare, the gameplay is considerably different from that of the series original. A disappointment perhaps for fans of the collection of microgames, but up to a certain point: because if the genius of the first chapters is still well impressed, in the same way it is evident how missteps and an inevitable creative crisis have impoverished the quality of the latest releases, thus making a decisive change necessary. This was basically framed by the programmers through the total (or almost) abandonment of the concept of microgames from a few seconds one after the other in favor of a series of 16 minigames well separated from each other and in turn divided into a variable number of internships. A formula that is certainly much less original but which in any case does not deserve to be criticized excessively, above all when one realizes that Game & Wario is basically a tool to illustrate the qualities and capabilities of the GamePad, in the hope that could be more effective than the unforgetable Nintendo Land that accompanied the launch of the console. The creative effort of the game designers is in fact evident at all times, and the will to give life to a whole series of situations that obviously would not be possible to replicate in the absence of the Wii U controller is clear. It is no coincidence that all the mini-games, including the multiplayer ones, must be faced only and exclusively via the GamePad; here there are no Wiimotes in the middle of the boxes that prevent the clear line of distinction between Wii and Wii U from being drawn which so far seems to have been poorly communicated to the public, and it is therefore impossible to confuse Game & Wario with a product that would have been possible to play even on older Nintendo hardware. However, the now well-known genesis of the title, which was born precisely as a sort of demo of the GamePad - even in the original intentions to be pre-installed on the console - only to be adapted and framed in the Wario franchise, however, lends itself to a lack of cohesion and continuity that is absolutely evident. In fact, there is no common thread between the tests, which are totally different from each other not only in terms of content, but also in terms of style, quality and depth. All this determines an experience that seems like a roller coaster ride, between ups and downs one after the other: if with one game you can lose hours, with another one you find yourself almost forced to continue to earn tokens, the only real and authentic replayability incentive, with which to unlock 240 objects, movies, gadgets and various amenities. The absence of rankings and online modes weighs heavily, and the gratifications for overcoming one's records or the best possible result appear too weak a stimulus in the long run. Ups and downs We prefer to avoid the boring descriptive list of all 16 minigames, rather useless as well as harmful to the pleasure of discovery for those who choose to buy Game & Wario; in fact, unlocking and trying the different experiences for the first time represents a large part of the fun, especially for those who appreciate the peculiar and demented humor that has always distinguished the titles starring the unlikely Nintendo anti-hero. Certainly, as mentioned earlier, the effort of game designers in thetrying to create the most varied and different experiences possible using the touch screen controller is appreciated. In Game & Wario you can shoot arrows, take photos, jump cliffs, drive taxis in the fight against aliens, play bowling, play Warioware microgames while being careful not to get caught by mom, solve puzzles with scraps of fabric and much more . Of the 16 total, 12 experiences are dedicated to the single player, while the remaining 4 to the multi; in the latter group is what is probably the best of the lot, the exhilarating Islands which can be faced by up to 5 challengers. Paradoxically, however, some minigames also highlight the limits of the GamePad, the shadows that it would have been better to pretend not to see; for example in Disco, dedicated to two players who act simultaneously on the screen, the absence of multi touch is evident and limiting. Others are simply poorly thought out, like the bad Ashley: a kind of old-school 2D shooter so basic and banal that it is embarrassingly basic, which for some strange reason requires you to use the gyroscope to control the wizard rather than the much more suitable analog stick. Even Ski, almost identical in concept to the Captain Hawk minigame in Nintendo Land, struggles to convince and entertain, as well as the boring Kung Fu. Finally, others would also have potential, but these are blocked by the lack of depth; it's amazing how Patchwork offers 90 stages while Design is limited to the same level repeated in a practically identical way without variations. But perhaps Game & Wario's biggest problem is its late arrival on the market; it would have been an ideal product in the very first months of the console's life, when it would have made a good game of the peculiarity of the Nintendo console despite the shortcomings in terms of content. But today it is inevitable to ask Wii U for more, and the Intelligent Systems title can only ultimately represent a half-disappointment. Game & Wario, whether interpreted as a spin-off or as a turning point for the franchise, is not fully convincing", "date": "2013-06-21", "grade": "6.6"}