{"name": "La leggenda della pista sull'oceano", "ref": "https://multiplayer.it/recensioni/120109-ocean-city-racing-la-leggenda-della-pista-sulloceano.html", "text": "Move in a completely open environment, using a first person view; observe the walk of some passers-by with obvious walking problems; admire a sports car and be able to drive it without problems in what seems to be the city of dreams for lovers of custom-built cars, available at every corner with the keys already in the ignition. This is the idea that the Indian developers of Onur Uca had in mind when they created Ocean City Racing, an open world driving game that basically allows us to do whatever we want, use any vehicle among the more than twenty present (none of which reproduced under license, of course) and go around bumping here and there. All for $4.99, an absolutely competitive price for a product with such ambitions, but which in the end turns out to be practically its only strong point. The reason is obvious: there is not a single aspect of Ocean City Racing that has convinced us. Let's try to explain... All mine the city We certainly didn't expect a ~triple A~ style use of Unreal Engine 3, it is clear, and therefore our reasoning goes beyond the technical sector, albeit mediocre, and revolves mainly around the gameplay. Firstly, the cars are too similar to each other in terms of handling and systematically prevent cornering without taking off the accelerator, because the car simply does not steer enough. We therefore find ourselves having to act in an embarrassing way on the handbrake (embarrassing because it is necessary to do it despite the low speed) to ensure that the car can overcome the hairpin bends without practically stopping and remain competitive from the point of view of the races. Secondly the physics, which is defined by the developers as ~the most advanced ever seen in an indie game~, is absolutely unrealistic and in many ways even pathetic, so much so that you will laugh a lot by observing the reactions of the vehicles when they collide. Try to launch yourself in a frontal aboard a sports car and you will see the other vehicle literally take off, using you as a launch pad even if you were driving the car used by the villain of ~Fast & Furious 6~. Not to mention the spins, which are triggered for no valid reason. We then come to the artificial intelligence of the opponents during the races. Well, at this juncture the shortcomings of the developers are fundamentally in favor of realism, given that the other pilots tend to crash into walls or each other, self-eliminating miserably. Lots of freedom, little substance Another flaw we found in Ocean City Racing concerns the game modes available. It is in fact possible to access free roaming, try your hand at time attack or traditional style races, therefore with your opponents on the track. In the latter two cases, however, the experience is rather limited, in the sense that one cannot choose which event to participate in or which vehicle to use, but must instead adapt to what the convent goes through. At this point an obvious problem of balancing the difficulty emerges, given that it is possible to complete all the events within a handful of hours and without an apparent challenge, simply trying not to crash and to cross the finish line among the top three (or within the time limit, in the case of time attacks). Added to this are the major shortcomings of the aforementioned ~free roaming~ mode, which is precisely a tour of the city free from any constraint, for the pure pleasure of driving, which however is questionable due to the problems we have listed a little while ago. 'indeed and that undermine the gameplay of this indie production. So let's go back to the technical aspect. The game natively supports the Xbox 360 controller and this is undoubtedly a good thing, but the graphics leave something to be desired: the polygonal models of the cars are mediocre, the buildings look like cardboard and the interactivity with the environment is fluctuating, in meaning that sometimes light poles are knocked down without problems, sometimes we get stuck in a stone. Also the user interface is bad, somewhat reminiscent of the era of 8-bit home computers. How could one react, after all, in front of the huge yellow writing ~you lost~ which appears at the precise moment in which, for example, time runs out in a time attack? On the sound front, the bad audio effects are accompanied by two types of music: the instrumental ones are decidedly ugly, while the songs by the Swedish Christopher Amott can sometimes be listened to. Ocean City Racing undoubtedly represents an ambitious experiment but with too many flaws.", "date": "2013-06-18", "grade": "4.0"}