{"name": "Due dita di violenza", "ref": "https://multiplayer.it/recensioni/119057-combo-crew-due-dita-di-violenza.html", "text": "Do titles like Double Dragon, Final Fight and Streets of Rage tell you anything? Between the end of the 80s and the beginning of the 90s, thanks to the popularity of the film ~The Warriors~ and the entire cinematic vein of the gangs, the scrolling fighting games were a reference genre both in arcades and on consoles. As happened with other types of video games, the transition from 16-bit to 32-bit platforms and the introduction of polygonal graphics proved traumatic for these titles, which quickly disappeared from the scene to reappear, in various forms, only in the course of the last few years. Well, the French developers of The Game Bakers, already authors of the excellent Squids series, have decided to pay homage to scrolling fighting games with Combo Crew, an action game for iOS and Android devices that provides us with four different warriors with the The goal is to defeat a powerful boss through various levels that become increasingly complex and full of enemies to face. There are two characters that we can select at the start: the mysterious Parker, a nerd with a strange Saiyan-style tail, an expert in martial arts, and the lethal Gina, capable of even using her long hair to cause damage to opponents. The squad is completed by two further unlockable warriors, the enormous Dolph and the little Sammo, a creature as cute as he is cunning. wow! The characterizing element of Combo Crew is undoubtedly the touch control system based exclusively on gestures. Forget the virtual d-pad and the traditional on-screen buttons: holding the device with one hand and touching the display with the other, you will have to manually select your target among the enemies present, then draw lines with one or two fingers to carry out single moves or elaborate combos. The initial confusion is soon replaced by the awareness of the effectiveness of certain maneuvers which, as often happens in scrolling fighting games, we will tend to perform constantly to the detriment of the variety of the action. However, the excellent feeling of the shots will fill this gap, well enhanced by the graphics and spectacular bullet times when the combination of punches and kicks successfully concludes a stage. Under the vital energy bar we find that of fury, which fills up as we land attacks and allows us, once complete, to release a devastating super move. Since the game is completely based on fights, with a succession of increasingly difficult arenas and an increasing amount of opponents to beat, it is nice to see how the guys at The Game Bakers have tried to diversify the enemies not only in terms of appearance but also and above all for their attack and defense routines. The upgrade system of our four warriors, which works by spending the coins earned on the field, finally adds a further substrate to the experience and allows us to increase resistance and power permanently or temporarily. It is a pity that these ideas are not supported by a technical sector up to par, given that the scenarios are too small and repetitive in aesthetics, while the polygonal models in cel shading are not fully convincing. Combo Crew is an immediate and spectacular game, characterized by an original control system", "date": "2013-05-30", "grade": "7.7"}