{"name": "Immersi nell'oscurit", "ref": "https://multiplayer.it/recensioni/118757-might-magic-heroes-vi-shades-of-darkness-immersi-nelloscurita.html", "text": "Might & Magic Heroes VI arrived on the field with a rich single player and interesting multiplayer implications, but connection problems and numerous bugs, including the macroscopic one that saw the formation of monstrous and unbeatable enemy armies, hindered a snappy start. Luckily we live in the age of patches and in the case of strategy titles these are now part of the offer, ensuring that balance deficiencies are fixed later, as well as bugs. A strategy also exploited in the case of Might & Magic Heroes VI which, although still imperfect, has somehow matured since its launch and which, thanks to the new expansion, should be able to count on a further extension of support from the developers. Shade of Darkness is a stand-alone expansion featuring two complete campaigns, centered around an all-new faction that enriches the entire gaming experience, including multiplayer. The Dark Elves of Tuidhana, part of the faction called Dungeon, act differently than the others introduced so far in Might & Magic Heroes and exploit tactics based on invisibility and traps. Powers that allow specific units to escape the game of ranged attacks that characterizes the early stages of turn-based battles, bringing devastating close combat attacks already in the initial stages of a battle. Obviously there is a downside, given that the enemy automatically focuses on the other units which in some cases, such as that of the beholder, inflict a lot of damage but lack resistance. For this reason it is likely that the optimal strategy is to mass assault the opposing units capable of striking from a distance, combining the stealth advance of the assassins with a nice cover spell based on darkness followed by the advance of the more robust troops. In this way the gameplay flattens out a bit but the initial attack proves to be decisive. In some cases, however, waiting for the enemy is a valid option, especially when the opposing forces are mainly composed of infantry units, who easily fall into the trap of our assassins strategically placed on the tactical map grid. With the launch of the expansion, all sorts of problems arose which even led to a server blackout. The developers have placed the responsibility on the latter by ensuring that the update works properly. The title is currently working properly again even if there are still some update problems in relation to the Uplay version which for some users remains stuck at 1.8, thus precluding access to the contents of Shade of Darkness. In this case you need to download patch 2.1 manually and install it. You can find it at this address together with the patch for the retail version of the title. The dark side of Ashan From a technical point of view Shade of Darkness does not show obvious improvements but, from an artistic point of view, the dark elves are more inspired and the models of some units, as well as those of the new monsters, are embellished with puffs of black smoke that underline the dark nature of the energies at play. News that affect, to a certain extent, also the map of Ashan. In fact, the Dark Elves have their capital and the neutral creatures that enrich the gameplay and make the buildings that allow them to be hired more useful are also increased. The novelties also include the more material side of the experience with magic items and scrolls, an unlockable mount, a special hero, new skills, new structures and various characters related to the theme of darkness, the backbone of this expansion focused on a decidedly peculiar. A race whose inspiration comes, as in the case of several other elements of the series, from the everlasting Dungeon & Dragons role-playing game from which Shade of Darkness also inherits the historical separation between the Wood Elves, the classic ones, and the cousins refugees in darkness, here protagonists. Inevitably this theme also enriches the campaign of this expansion, already complex and also linked to the narrative sector of Might & Magic Heroes VI, which does not let us miss the nuances typical of the series in this case exacerbated by the triviality of the Dark Elves, by the unpredictability of the Dragon Goddess Malassa and her creatures that haunt the game world. Creatures that are not always easy to deal with such as the elementals of darkness, which are capable of teleporting, and the fearsome black dragons which represent one of the most difficult challenges. Basically Shade of Darkness is a full-bodied expansion, which can be played without having to buy Might & Magic Heroes VI, including all the interface and themultiplayer from the base game plus two new campaigns. A richness which, unfortunately, is reflected in the price and which makes the full version of the title much more attractive, with all the extra contents included. Furthermore, in all this there is a big problem related to the artificial intelligence of the game which, despite the latest patch and the numerous updates, is still based more on tricks and tricks than on an actual ability of the machine to face the player . A huge flaw that prevents the game from expressing its full potential and which should have been at the center of the ultimate patch. From the darkness of Ashan emerges an interesting stand-alone expansion", "date": "2013-05-27", "grade": "6.5"}