{"name": "The Warriors", "ref": "https://multiplayer.it/recensioni/the-warriors.html", "text": "Gangstar Paradise The impression that the bold boys of Rockstar Toronto have artfully reconstructed every step of the film of the same name arises almost in conjunction with the first bars of the game. All with game graphics, the first frames faithfully capture every single joke that starts the gang war. Arriving at the key episode of the night odyssey of the warriors, or the murder of Cyrus, the game instead of continuing to faithfully retrace the footsteps of the famous film, makes a violent reversal to go back 3 months. Here begins a completely new story, which before flowing into the famous final night - the one portrayed in the film, to be clear - will peep into several stations, in which to stop to analyze and get to know every single character who takes part in the film. In fact, the work of the Canadian softco is maniacal in proposing situations and anecdotes aimed at fully eviscerating the premature inputs dictated by the cult movie. The wonder weel in the initial menu, which is nothing more than a Ferris wheel, is just a taste of the binge of details and first fruits that will invest every player. As well as the foul-mouthed DJ, who if in the film accompanied each event of the protagonists with comments that were anything but comforting, in the game she will be a sort of reporter with the task of assisting the player and introducing the events. At certain moments you can almost smell the foul stench of the streets of Coney, this title is so well cared for and empathizing. The deeds of the Warriors, and in parallel those of each player, start rather with rose water. Small and short tasks to be completed successfully in order to practice with pads and game mechanics. As each of the nine 'deputies' of the gang, each with their own unique moves and fighting style, the player will have to embark on ever more elaborate missions in order to meet the needs of the gang. Delimiting the territory, as well as protecting it from other gangs, soon becomes the key to the game. A beat'em up, this by Rockstar, which in addition to setting itself the goal of distributing violence in industrial quantities, also tries to give variety and constant rhythm to each mission. The game situations will alternate moments of pure fight with other types of crime, such as stealing a car radio or robbing a passerby, or placing the Warriors brand with spray paint or, again, destroying a shop. Not only that, but the articulated epic proposed by the Canadian softco manages to insert authentic stealth sessions in which to use the gray areas in one's favor, thus killing the enemy with a single, lethal move. Obviously, in one's raids it becomes imperative to be careful not to attract the attention of the policemen, who can also be called by passers-by who are alarmed by our brute movements. To a main game as tasty and full-bodied as a vintage red, tons of goodies and methods are added. Nearly 500 unlockable bonuses, including characters, environments, mini-games and some really delicious goodies. In addition to unlocking the possibility of organizing brawls, in which the various contenders to be placed in the arena will be chosen in perfect fighting game style, it is possible to add history to the already abundant game plot. With the Flashback mode it is in fact possible to see, again thanks to a series of targeted missions, how the Warriors were formed, starting from when the gang leader Cleon was still under the 'jurisdiction' of the Destroyers up to seeing everyone's entry into the gang of the most illustrious members. It will also be possible to freely roam Coney without the burden of having to complete any mission, or by choosing specific ones in order to unlock additional bonuses. At certain moments you can almost smell the foul stench of the streets of Coney, this title is so well cared for and empathizing. Warriors, shall we play war? I brought Risiko and the lead soldiers... Come on, don't be antisocial... On the battlefield it becomes clear that being part of the Warriors is both a burden and an honor. Commanding, fighting and offering one's shoulder to comrades in need. These are the main requests dictated by a game whose fulcrum is precisely the fights. Assisted by an effective and balanced control system, the most violent part of the entire game manages to take place excellently, as well as achieving the goal of bringing brawls stuffed with people to the screen. Like self-respecting beat'em ups, The Warriors offers the possibility of choosing powerful rather than fast blows or vice versa, the ability to grab the enemy and then launch deadly combos, perhaps with the help of a partner. Counter moves and parries also have their relevance, especially in the most chaotic situations. How to accessborn it is possible to direct the companions through a practical interface of orders, almost vital in certain situations. For example, you can steal a car radio by having your back covered, and in this way protect the success of the theft in the event of a possible charge by the police. Particular cues are also given by a background full of destructible objects, which can eventually become dangerous weapons. We have had to destroy cars of rival gangs and get caught by them. What better way to destroy the car than to take one of the enemies and then slam him into the car until both are demolished? The multiplayer voice also responds to the call, albeit with targeted mini-games even if they are not very pressing and a cooperative mode that is more accessory than studied. ...you can steal a car radio by having your back covered, and in this way protect the success of the theft in the event of a possible charge by the police. Warriors, shall we play war? I brought Risiko and the lead soldiers... Come on, don't be antisocial... The big problems of this ambitious project all end up, or almost all, with lining up one by one to form a huge procession in the presence of his majesty graphic creation. As efficient as it is and as far as it is at the full service of exceptional gameplay, the graphics disappoint not a little. The rough polygonal models compete with washed out textures in a hypothetical contest of ugliness. Certainly better animations, even if not always credible. Sound sector instead from standing ovation, which with the music and sounds of the film, as well as a terrific dubbing, recreates in all respects the atmosphere of the vintage film. Textual translation into Italian almost impeccable, but there is no dubbing in our beautiful language, and we don't know if it's a good thing or a bad thing given the quality of the Anglo-Saxon one... The Warriors is the classic Matryoshka game. Its ability to give surprises is directly proportional to the player's desire to discover. The work done by softco is manic at times, especially in the attempt, more than successful, to reproduce the sensations experienced in the famous cult movie. However, they went far beyond Rockstar Toronto, giving their tie a very specific identity and adding numerous ideas to the famous script. Fat, thick, full and abundant, this scrolling fighting game also shines for variety of situations and solutions. Just a shame for a graphic creation that, in perfect Rockstar style, pays more attention to substance than to aesthetic quality. However, it remains a must buy for all lovers of the film of the same name, for all fans of the genre and for all those who like the good game. Cross-platform The Warriors was released in PlayStation 2 and Xbox versions. In the second case, the title has higher resolution textures and a slightly higher frame rate, otherwise the two copies are mirror images. Have you ever thought about which movie you would like to see turned into a video game? Red light film titles are not accepted. Would you like, for example, the idea of playing the role of the immortal Lambert in a Highlander artfully transformed into an evocative fighting game located between different eras and civilizations? Or be the fast paced brutal sport set in the future 23rd century of Death Games. This is the charm of the tie-in, or the art of reliving the emotions of the films in the first person. Anyone who has played video games for some time has known how numerous there have been attempts to 'playful reconstruction' of more or less famous films, and how many have failed miserably. This is also why the news of a Rockstar Games at work on The Warriors tie-in has aroused joy and confidence everywhere. On the other hand we are talking about the softco famous for its violent and well-kept games, as well as the brutal cult movie of the late 70s which we call The Warriors of the Night. Apparently a perfect partnership", "date": "2005-10-28", "grade": null}