{"name": "Nello spazio nessuno pu sentirti sferragliare", "ref": "https://multiplayer.it/recensioni/118904-the-starship-damrey-nello-spazio-nessuno-puo-sentirti-sferragliare.html", "text": "The first round of collaborations between Level 5 and some of the most imaginative Japanese designers, the Guild01 compilation, resulted in a series of games, three from us and one more from the motherland, which, while not totally free from defects, remain however, among the most delicious titles that can be purchased on the Nintendo eShop. Liberation Maiden, Aero Porter and Crimson Shroud, some more, some less, each with its pros and cons and each suited more to one group of players than another by virtue of the totally different genres to which they belong, are all three to consider at least good, also because of the very attractive price, and it is therefore not surprising if the authors of Ni No Kuni have decided to start this second compilation, this time, apparently, even more in the name of inventiveness and imagination. The Starship Damrey is the first Guild02 to be published in our area, placing itself as the standard-bearer of the new series: is it a good choice? I, robot Since the announcement, The Starship Damrey has been advertised as a game in which discovering what to do by yourself, almost completely devoid of indications and premises, is a central point of the whole experience; this is resolved in a very, very concise digital manual, and the total absence of tutorials and in-game explanations. Panic in the reviewer: how to explain to readers what game it is without doing an injustice to the will of the development team? Fortunately on the one hand, unfortunately on the other, this centrality attributed to the player's discoveries concerns more the story and the atmosphere of the game than the gameplay in the strict sense, as we will see clearly in the following lines; at the helm of The Starship Damrey there are two gentlemen, Takemaru Abiko and Kazuya Asano, who perhaps won't say anything to the general public, but whom those who have been following the Japanese market closely (and for some time, perhaps) will know like the authors of The Night of the Sickle Weasel, a Chunsoft Super Famicom title from 1994 that was a great success at home, subsequently being ported to various platforms and also dramatized for radio and television. Kamaitachi no Yoru, this is its real name, was basically a graphic/textual adventure of the kind that have been the rage for years in the Land of the Rising Sun and which have only recently begun to be appreciated by Western audiences as well (they come to mind at first glance the Ace Attorneys by Capcom, just to give an example), whose plot was ascribed, like many other products in the category, to the thriller genre with notable horror veins. The times, the interfaces and the means to immerse the player in the story have greatly evolved from the years in which these games had some not even animated drawings and tons and tons of text based on which the player made his own choices and continued in the plot, but The Starship Damrey remains, at its core, true to the cornerstones. This is because, although the spaceship of the title can be fully explored in first person (in the guise of a maintenance robot, but we won't explain why) and there are numerous interactive elements as well as a whole series of puzzles to tackle, there is effectively one and only way to get to the end, with all the actions to be performed already foreseen by the programmers in a development that certainly does not stand out either for originality or even for difficulty: the puzzles, thanks to the heavy linearity of the whole and the fact that our robotic avatar can only carry one object at a time, they are almost all of obvious solutions from the very moment they present themselves, and there is no particular satisfaction from a strictly playful point of view in solving them and thus having access to new areas. The only exception to all this is the very first part, perhaps the only one in which The Starship Damrey keeps its promises regarding the gameplay, and which we will not reveal to you all the more so as not to ruin the experience. The regret remains that, if the philosophy of the first minutes of the game had also accompanied everything else, we would probably be faced with a delicious product not only in its, let's say, ~atmospheric~ part. The 3D effect Little to say: in two or three moments stereoscopy makes sense from a purely aesthetic point of view, never from a playful one; for almost the entire game, turning 3D on or off makes no difference. Consequently, the effect is not very pronounced and, if it does not add anything significant to the experience, in any case it does not take anything away either. Dead space Oh yes: if reading the first paragraph made you sick, resist and go on, there is still hope! We were talking about delightful atmosphere, and actually when it comes to talking about history, diving, and tEverything that, gameplay aside, a video game can put in place to cause the player to experience the classic state of suspension of disbelief, the tones are decidedly positive; here too nothing that cannot be found, perhaps made even better, in other titles, but remembering that we are dealing with a game created for digital distribution and which is offered to the public at a price of 8 Euros, then you can in this scope to consider Level 5's mission to let the player discover for himself and with great gusto the mysteries that revolve around the Starship Damrey as successful. The corridors of the spaceship are cold and very dark, and the small flashlight that equips our little robot, which lacks, among other things, great possibilities for movement, immediately creates that air of anxiety and tension, of imminent danger, which you expect from a good thriller. So imagine what happens when you turn a corner and it appears... We won't tell you what it appears, but here and there the game manages to give real blows to the heart with means already seen and not particularly subtle, but always effective. It is clear that something terrible happened on the ship, and perhaps is still happening (never in front of you, but those distant noises of doors opening and closing are bloody disturbing...); discovering it little by little until the final twist, with exploration, the collection of textual, graphic and sound details, is a pleasure that all lovers of suspense will greatly appreciate. A certain affection even develops for the cute little robot, paradoxically the only spark of humanity in this cold and dark environment: clumsy and heroic, he is also the protagonist of a comic and quotationist divertissement that is all to be savoured. On balance, it can be said that not even in the context of the story itself we are dealing with something memorably original, some homages to classics of science fiction cinematography and not only are they even obvious, but the authors in this field definitely know do, totally capturing the attention of the player / reader even more so when he is in a dark room and equipped with his beautiful earphones. All this for a duration of three hours, minute plus minute less, to which a series of exclusively textual contents are added by completing a certain side mission and having on the same SD card where the game is saved the data of any Guild01 . In a title of the genre graphics and sound have their own importance: as far as the graphics are concerned, if from a technical point of view we sail lazily around the sufficiency (overall the ship is clean and looks good, but the few polygons and the bland and always the same textures certainly don't make your eyes roll), from the aesthetic point of view instead everything is used to the fullest to create the famous atmosphere; the same can be said for the sound, which almost totally devoid of music makes the most of the effects to generate constant tension and discomfort. However, the few FMVs present are a negative note, due to the poor resolution that makes them look bad compared to the good cleaning of the in-game sections and the fact that, unforgivably, the environments in them seem much brighter than the genre allows. Final note on the language of texts and voices: the entire game is in English, not a difficult and incomprehensible English, but those who struggle with the language of Albion may not fully appreciate the small details that build the story. The Starship Damrey is a bland and linear adventure, but it knows how to involve because it has a great atmosphere", "date": "2013-05-23", "grade": "6.7"}