{"name": "Accadde in un garage", "ref": "https://multiplayer.it/recensioni/118860-game-dev-tycoon-accadde-in-un-garage.html", "text": "Game Dev Tycoon by Greenheart Games is exactly what the title suggests: a management system dedicated to software houses. The attempt is to make the world of videogame development seen from the inside into videogame mechanics. BioShock Infinite is in stock! It starts in a garage, with a small market made up of a few reference cars. The technologies available are scarce and you essentially work alone, hoping to be able to produce a successful title, in the meantime trying to do some work to get by and to do technological research to improve the products offered. Once the first title is closed, there is therefore the thrill of sending it to the various specialized publications which will have to judge it, determining its success or otherwise. Once the votes have arrived, all that remains is to wait for the response of the market to then devote oneself to the development of a second title... and then a third, a fourth and so on up to the triple A ultra-commercial blockbusters. How does development work? In a very simple and intuitive way. First you need to choose the genre, the setting, the platform on which to publish and the engine to use, without forgetting to give your work a name. Then we move on to development, divided into three distinct phases that we can divide into design, actual development and refinement. Each has three entries to occupy and various selectable extras, which however must be researched first. At the beginning there is only one developer available, but as you level up and expand your business, you can hire more, who can be assigned to individual aspects of production. Our small development studio has to grow with the market, which will become more and more complicated due to the increase in gaming machines, the need for marketing, the definition of project sizes, the increase in complexity of the technologies used and so on. Street. The aim is obviously to sell copies and make money, trying to stay on the market with valid products and avoiding failure. From a certain point on, it will also be possible to work for publishers, limiting revenues on individual copies sold, but greatly increasing the sales themselves. In short, will we be able to become the Valve of the situation? Victims or perpetrators? Game Dev Tycoon owes much of its fame to an apparently rash gesture by its developer, Greenheart Games, namely the release of a pirated version on Torrent ... to try to curb piracy. The peculiarity of this version is that at a certain point it becomes impossible to go on, because a message on the screen warns us that, despite its success among gamers, the created software has been pirated to the point of having cut off sales and made the software houses. This small protection, which was only aimed at practically showing how piracy can kill the gaming market and damage individual developers (certainly not multinationals), has produced truly surprising results, leading many pirates to contradict what are usually the principles heralded to justify their being thieves. In fact, many gamers, believing that piracy was a feature of the game and that there was some way to fight it, started asking on the official forum how to stop it in order to move forward. In short, the paradox of pirates hoping they can beat piracy in order to finish a pirated video game has led to an almost parodic representation of the ~heroes of software freedom of expression and dissemination~, with many starting to ask the developer to create an update to allow you to search for DRM to... stop pirates. Yes, precisely the much reviled protections against which every time we talk about it there is a massive outcry, well beyond reasonableness, because they would be an attack on who knows exactly what acquired right. The briefly narrated facts had such a strong resonance as to have led some illegal software trading channels to remove Game Dev Tycoon from their circuits and to make many wonder if after all gamers do not deserve to be treated with such suspicion by the software house and publishers, since they also massively steal titles that cost as much as a couple of cappuccinos. On the development side Game Dev Tycoon was evidently born with the desire to go beyond the casual gameplay of Game Dev Story for mobile systems. Greenheart Games has managed to make the story and the growth of the gaming market quite well, with its problematic fragmentation, creating for this purpose a flow of side events that form the background to the main action. The problem though is that up frontto so much good will and so many good ideas, often the realization is too hasty. The software house has grown Let's try to explain better with a concrete example. As already mentioned, once a video game has been developed, you have to wait for the judgments of the specialized press, expressed in the classic votes, and then test the reactions of the market. The problem is that the reactions of the critics are very volatile and it is difficult to determine a modus operandi to do well (is it some message not even too hidden?). Often it seems that the votes are given at random even if all the necessary precautions have been applied, for example by investing in a new graphics engine and assigning high-level developers to the various aspects of the production. In short, in many situations one is forced to ask oneself why the desired results have not been achieved, but there are no tools in the game that allow one to understand it. You have to go by intuition. But does intuition pay? Not always. For example, it is not clear why in one game the creation of a life simulator for PC has made us rich, while in the next it has produced a negligible number of copies sold and lukewarm reviews. It's true that sometimes the reason for the failure is obvious (if you produce a horror simulator for a portable console you shouldn't expect big sales), but in many cases you find yourself with inexplicable failures, while in others with equally inexplicable successes. In the long run, the perception of randomness in certain mechanics ends up annoying and alienating the interest in the game. The review of Game Dev Tycoon, the game that most of all hurt piracy.", "date": "2013-05-22", "grade": "6.0"}