{"name": "Barone Rosso non ti temo", "ref": "https://multiplayer.it/recensioni/118806-sid-meiers-ace-patrol-barone-rosso-non-ti-temo.html", "text": "Whether it's Peter Molyneux and his Curiosity, Jeff Minter's crazy retro games, or Ron Gilbert's attempt to have his say in the match-3 puzzle genre, when a famous name releases an original project for the mobile market may not arouse the attention of enthusiasts. Sid Meier, the historic game designer behind franchises such as Civilization and Pirates!, has recently added to the list, who without too much anticipation has created Ace Patrol, a free-to-play strategy game entirely focused on combat between vintage aircraft . If some developers take advantage of tactile interfaces and low-risk projects to experiment with completely new mechanics and experiences, the impression is that Meier has instead wanted to sail more familiar skies, drawing inspiration from already tested ideas and mixing them together to create an experience ultimately unprecedented. Ace shooter The air battles that marked the First World War represent the scenario chosen by the Firaxis team for its first original game to be published on the App Store. The free version allows you to access the first part of the English campaign, a sort of full-bodied tutorial that gives you the opportunity to get a concrete idea of the rules and to familiarize yourself with the type of challenge that is proposed again, good or bad, always in the same way. in the paid chapters. In fact, anyone who wants can unlock the rest of the English countryside, in addition to that of the Germans, the Americans and the French. The missions are generally divided between offensive and defensive, with the player who is called upon to escort airships, defend an allied base, pursue an enemy reconnaissance patrol or plan devastating surprise attacks in hostile territory. In short, the developer has tried to enrich and vary the formula at the base of each level, but despite this, the only real difference between one faction and the other seems to be purely aesthetic: whether you find yourself leading a German squadron or a group of British reconnaissance aircraft, the player's objectives are always the same, as are the characteristics and abilities of the different battle planes. However, Ace Patrol is made interesting by a set of rules and mechanics that combine the air battles already seen in SteamBirds with the complexity of a hexagonal map, typical of wargames and board games. Anyone who has played Andy Moore's strategy game will certainly notice a large number of similarities, and it is really hard to believe that Meier himself has not drawn heavily on them: unlike SteamBirds, however, the 3D scenario and the structure in boxes have allowed to Firaxis to elaborate a more articulated and complex system, more similar to a game of chess. On his turn, the player must choose which square to move each of his planes to, using particular stunts to perform course reversals, change altitude or increase his speed; the flight techniques that can be used in each round change according to the orientation of the plane or its altitude, thus prompting you to reflect on each move and the consequences it will have in the following rounds. If initially you limit yourself to aligning the trajectory of your units to the enemy's tail, already after a few levels it becomes essential to anticipate the opponent's moves, try to guess what his next maneuver will be and neutralize it before he is able to enter in trajectory. All this also taking into consideration any handicaps or elements of the scenario, such as the clouds in which to hide or the land bases committed to targeting all enemies within shooting range. Being able to complete a level without suffering any damage is a huge satisfaction, but challenge lovers can choose from five difficulty levels that make the opponent's artificial intelligence even more combative and unpredictable; as the difficulty increases, the multiplier of points earned on completed missions also increases, with which to unlock new planes, upgrades and additional flight techniques. It must be said that all these game elements are presented in a slow manner and through confusing and not very elegant menus, with the risk that the user is initially disoriented and needs several missions to familiarize himself with each element of the interface. At the time of writing Firaxis has finally corrected the problems that made it impossible to play online, now allowing you to compete in multiple asynchronous matches simultaneously. The modes currently available hark back to single-player missions in one way or another, but again, underneath it all, they look alike.they all work together: in Capture the Flag you have to shoot down the enemy aerostat first, while in Key Information you are asked to photograph the enemy headquarters; in Sudden Victory you have to shoot down one of the enemy planes first, but more interesting is Ace against Ace, in which one of the two players is outnumbered but with more powerful units. If desired, it is also possible to challenge a friend locally, but passing the iPad at each turn trying to hide one's moves from the opponent immediately proves to be an uncomfortable and boring practice.", "date": "2013-05-21", "grade": "8.0"}