{"name": "L'ora della vendetta", "ref": "https://multiplayer.it/recensioni/118593-way-of-the-dogg-lora-della-vendetta.html", "text": "Way of The Dogg sounds like one of the more bizarre experiments in recent years. And playing is exactly the right term, since this strange hybrid between a rhythm game and a fighting game uses the image of a well-known musician. As can be guessed from the title, it is Calvin Cordozar Broadus Jr, aka Snoop Dogg, the famous rapper with a sly gaze who managed to break down the barriers between underground hip hop and pop music. In fact, his participations with singers of the caliber of Katy Perry and Red Hot Chili Peppers are known, as well as his willingness to experiment by collaborating with the major electronic music producers. In short, a truly eclectic artist who manages to tread different scenes thanks to a great sense of humor and genuine arrogance. In Way of the Dogg we see him mentor a young black American whose girlfriend has been killed by a mysterious assassin. Eager for revenge, the boy decides to follow the path of the warrior, following the advice of the master Snoop to face a long line of fights to discover the identity of the culprit. The story becomes more and more absurd, until it flows into science fiction film solutions, resulting in little more than a mere pretext for setting up various pieces by the artist as a background to the clashes. But what is it actually about? Rhythm is life Way of the Dogg is made up of about twenty chapters, each of which represents a clash with a particular opponent, in the most classic school of fighting games. However, our aim is not to actively participate in the battle, but to press the keys displayed on the screen interface in time with the music, clearly inspired by classics such as Guitar Hero and Rockband. The fight takes place automatically in the seabed and is linked to the precision with which the commands are entered, at the end of each combination an extremely simplified quick time event is activated which allows the protagonist to carry out deadly attacks. The secret is therefore to correctly conclude the various metrics to activate these moves and keep your energy bar high. In story mode it is not possible to actually beat the enemy, since victory comes by concluding the song that accompanies each fight without dying prematurely. A questionable ploy that already speaks volumes about the ingenuity of the entire project, but we are only at the beginning of the list of many problems. Despite the use of a cel shading polygonal engine, the graphic creation is decidedly elementary and devoid of details, such as the facial expressions of the wrestlers, and undergoes significant slowdowns which affect playability. In fact, the collapse of frame rates ends up altering the response times and the precision necessary to press the commands in time, with the result that in the second part, thanks to the greater complexity of the metrics to be addressed, it becomes almost prohibitive to go on. As mentioned, the story introduces surreal elements such as magical clocks and time travel, interesting on paper but bad in the economy of the game, especially after having ascertained that they are just a sinister expedient to face the same fights a second time. Excluding some variations, we are therefore forced to repeat the entire story twice for a total duration of no more than two hours, it is clear that the developers have found themselves forced to adopt gross stratagems to lengthen a far from generous broth. Xbox 360 goals Way of the Dogg features a total of 400 player points, split across 12 objectives. Compared to other titles, that of Echo Peak is quite generous, so as to offer almost half of the points by simply completing the story. The rest, however, must be conquered by obtaining the maximum evaluation in the tests, an operation that will take you away a considerable amount of time. Music and punches Despite everything, the first half hour of Way of the Dogg manages to entertain for a number of reasons, starting from the cutscenes, made like strips of an indie-style comic, passing through a simple but fun interface, and culminating right in the splendid pieces of Snoop Dogg which, despite being present in small numbers, manage to paint the action beautifully. Impossible not to mention ~Murder was the Case~, which will thrill the aficionados of the artist's early days, ~Raised in Da Hood~, ~GZ and Hustlas~ and above all the famous ~Who am I?~. The participation of the artist, who also contributed to dubbing his digital counterpart Snoop Lion, is a decidedly full-bodied plus that unexpectedly manages to get in tune with the madness of the project, so much so that it doesn't seemand a mere window dressing. The biggest problems unfortunately emerge in the second part, where playability is heavily compromised by the defects listed above, without considering that once the short campaign is over, there are very few incentives left except for local multiplayer. On this occasion, at least you are not forced to face guided battles as in history, but the presence of some online competitive modes would have been largely preferable. The Challenge bonus mode is absolutely negligible, which does nothing but recover the chapters of the adventure, with the same cutscenes.", "date": "2013-05-16", "grade": "5.0"}