{"name": "Mondi fluttuanti", "ref": "https://multiplayer.it/recensioni/118187-eador-masters-of-the-broken-world-mondi-fluttuanti.html", "text": "Eador's universe is made up of infinite fragments of worlds floating in the great nothingness. Each fragment is different in population and geography. Above all, the fragments are not in contact with each other and wander alone, unaware of their surroundings. At least so they believe, because in reality there are powerful entities, the Masters, who vie for their control. The player is called upon to play the role of one of these super creatures who must try to unify the fragments into a single mass of land. Whoever succeeds will become the lord of the universe. Eador. Masters of the Broken World is the remake of a Russian strategy released in 2009 Eador: Genesis (our review here). Never as on this occasion the word remake is not used by chance, given that it is, at least in single player, the exact same game, with the same exploration and combat mechanics, only with better graphics. Not bad, you might say, because the first one is now old and technically it wasn't that great. In reality, the situation is a little more problematic, because it is true that Eador: Genesis was released for the first time in 2009, but only in Russia. The rest of the West was only able to enjoy a version translated into a more proficient language, namely English, only in December 2012, about six months ago. Ergo, if you already have the other and are not interested in playing it in multiplayer, Eador. Masters of the Broken World offers very little news, so few that to talk about it it would be enough for us to invite you to read the review of Genesis, which is also largely applicable to this chapter. The basics You have read? No? Do you want us to rewrite everything? What wouldn't we do for you readers? As already mentioned Eador. Masters of the Broken World is a turn-based strategy where you have to try to conquer land masses to create a single larger world. The game starts with a world/tutorial that serves to illustrate all the mechanics in a very clear way. At the beginning of each world, the Master must select a hero to send into battle and provide him with an army. The hero can belong to four different classes: Warrior, Commander, Magician and Ranger, each with its own skills and each with its own specializations, which must be selected after making it grow by a certain number of levels. For example, the warrior is a very strong unit that will tend to develop its combat skills, while the commander is thought of as a support unit for all other friendly units on the battlefield. If desired, during a game it will be possible to guide more heroes (just hire them by paying), which will become necessary as soon as you find yourself on more complex worlds than the basic ones and you will have to face contending Masters. The gameplay is divided into distinct stages. There is an exploratory phase, which consists of conquering and exploring individual territories. There is a management phase, in which buildings must be built in the capital to obtain new troops to hire, new spells for the heroes and a whole series of other bonuses that have enormous importance in the course of the game. Finally, there is the actual combat phase in which the troops are deployed on the battlefield, divided into a chessboard, and must give each other some healthy blows. Is everything easy? Not really, because each stage has its complications. The exploration Eador. Masters of the Broken World is a complex title in its execution and requires careful planning of your moves, if you don't want to be wiped out immediately. At the beginning, resources are scarce and new territories must be conquered to increase them. By resources we mean: gold coins, needed to buy new units for the hero's army, to build infrastructure, to buy equipment in shops and so on; and magic crystals, useful for carrying out rituals and generally linked to all that is magic. Unfortunately conquering a territory is not enough: if you want to get the most out of it in terms of resources, you must first explore it as much as possible. Exploring a territory is a lengthy operation that takes a hero an entire turn. Doing so allows you to discover secret places, where more or less strong enemies can usually be faced to obtain items and money, and to enlarge the habitable area for the population, thus making it grow and prosper. Exploring a territory to the maximum you get bonus resources, which never hurt. The more territories you conquer, the more likely it will be to face random events that will require our indirect intervention. For example, it happens that you have to repress bloody revolts, or you have to choose whether or not to sacrifice part of the population to powerful enemies and coyeah go. Usually these events are resolved by spending money or crystals and, especially when you have few resources, they are a big nuisance, because a negative result decreases the happiness of the local population who become more prone to rebellion. The fight The combat phase is the clearest one: having deployed the troops on the field, you have to try to defeat the enemies without getting overwhelmed. Usually the fights require a lot of planning, especially at the higher difficulty levels, where the obvious victories are few and far between (in case of clear superiority on our part, you can press a key to have the CPU calculate the outcome of the battle) . Whether the enemies are an army led by a CPU Master, or monsters found while exploring some territory, you will always have to place your troops on the left side of the battlefield, then move them in turn with your opponent. Obviously you have different types of units, all capable of leveling up by accumulating victories. Without quoting them all, let's say that they can be divided into three macro categories: melee combat units, long-range units and magical units, with all the necessary variations. The first type is usually the most resistant, but has to hit the enemy in order to attack him, while the other two types are more fragile, but can keep themselves at a certain distance by throwing bolts or arrows. Obviously the hero is not missing, who represents the real fulcrum of our strategy. In fact, each class changes the way of facing battles a lot, with for example the commander more suitable for a passive role, or the magician who can count on spells to produce various effects and so on. Usually it is clear from the description of the forces in the field if there is any chance of victory, with the hero who will do his utmost to let us notice the possible result of the battle with a specific comment (optimistic in green, pessimistic in red). Some special enemies, such as vampires or dragons, are relentless war machines and should only be fought by high-level heroes with a full army at their disposal. To do otherwise involves the extermination of the troops and the death of the hero, who of his own can be resurrected in the capital (the troops must necessarily be re-hired). 3D graphics and multiplayer If everything written so far by Eador. Masters of the Broken World is also perfectly adaptable to Eador: Genesis, let's now see what are the real novelties of the title, namely the renewed graphics and multiplayer. On the first there is little to say: compared to Genesis, rather rough, this is pleasant to watch in its colorful 3D. Of course, the animations are few, but it is still a small flaw for a title that has many other cards to play. Unfortunately, the interface has not changed, the same cumbersome one as in the past, even if in some respects it is slightly clearer. In some cases there remain some major shortcomings on the side of the information offered, some of which had to be made more evident, and in general we can say that more work could have been done on this aspect, in order to make the similarity with the previous Eador less evident . The real novelty of the game, which alone may or may not be worth the purchase, is the multiplayer side. Basically it is a question of spending a few points to create a hero and set off to conquer a world to contend with other human players, in the modes already seen for the single player. Unfortunately it is a rather controversial side, both because it is very buggy (especially in the first versions, then some patches have fixed instability and various problems), and because a whole series of options are missing, especially in the search for opponents, which make the organization of a match a challenge in itself. In short, it will seem strange to you, but what was supposed to be the strongest side of the game is currently the weakest one. Anyway, especially if you can try online, Eador. Masters of the Broken World truly offers many hours of gameplay and a depth that is hard to find elsewhere. If you are a fan of the genre, give it a chance.", "date": "2013-05-07", "grade": "8.2"}