{"name": "Shadow of the Colossus", "ref": "https://multiplayer.it/recensioni/shadow-of-the-colossus.html", "text": "Colossal extras Once the game is completed, the duration of which can vary between 10 and 12 hours on average, three new modes will be available. The first is represented by the possibility of tackling the adventure with a higher level of difficulty, in which the giants will be more difficult to knock down, will inflict more damage and will have a different location of weak points. The other additions are instead represented by two modes in which we will have to knock down the giants in sequence within a certain amount of time (to access them, just pray in front of each of the statues in the temple). Every time we eliminate two giants we will be rewarded with a weapon or an object, which will be used to increase one's power or resistance and can be used in the ~regular~ adventure. Finally, there is the possibility of obtaining a white version of your horse, with the I of Ico as a crest, but it's up to you to find out how to do it... When a developer comes from a title that has met with considerable success, especially from critics, he often chooses the simplest path, namely that of the sequel. Let me be clear, a title that manages to survive the expectations aroused by the first chapter and perhaps surpass it is certainly to be commended, but those who decide to abandon the previous path for a new one, at least in substance, are equally to be appreciated. This is the case of Shadow of The Colossus, a video game born from the mind of Fumito Ueda, father of that ICO as much appreciated as it is misunderstood. The concept is completely new, but in the end the situation is not that much different in terms of expectations... And so we find ourselves impersonating a boy named Wander (which in Japanese is pronounced Wanda, hence the erroneous writing seen on many occasions) who, riding his inseparable Agro, reaches the forbidden land in an attempt to bring back alive a mysterious girl. Inside an imposing temple he meets Dormin, a supernatural entity (?) who claims that it is not due to mortals to be resurrected, even if with the sword in Wander's possession this thing might not be impossible: to succeed in his purpose, however, he will have to face , in sequence, sixteen giants who personify the sixteen statues inside the temple in which Wander has ventured. But what will be the price to pay? Colossus are scattered across the vast lands that populate Shadow of The Colossus. On foot or riding Agro, if we want to accomplish our goal we will have to take courage and go through these impervious challenges, in the more classic dualism of David against Goliath. If you thought you've seen oversized enemies in some other video game, you'll redefine your standards with this one. Some behemoths are extraordinarily large, in height or size, while Wander is there, small and seemingly unable to prevail. Fortunately, the sword in our possession will give us a hand in finding them: raising it to the sky and in the presence of sufficient lighting, it will emit a beam of light that will indicate to the main protagonist the direction to follow to reach the next ~enemy~, as well as his weak points (after all, the myth of Anchilles has taught us something), once reached, provided that we discover the way to reach them. Between one colossus and the next there is a whole world to explore, right from the start, just waiting for the player. If in Ico the action was concentrated inside a castle, with flights of fancy that foreshadowed the vastness of the surrounding lands, in Shadow of The Colossus we will be able to explore them far and wide and at any time, perhaps on horseback steed. Look out towards the sea, dive into a waterfall, cross the desert or face the rain, walk along a bridge that seems to have no end: it's up to you to decide what to do. There will therefore be no one else to interfere or interact with your ~crusade~, other than you, your horse and the colossi. This sense of smallness in front of the world that surrounds you is rendered in an excellent way by the artistic and technical component of the game, truly excellent: the reproduction of the environments and their characterization, the alternation of atmospheric events, help to identify the player, and to restore that sense of loneliness that we have already experienced in Ico. The animations of Wander, Agro and the Colossi are extremely convincing, with natural and realistic movements. On the other hand, already from the previous work of Ueda and associates, their skill in this sense could be appreciated. In particular the realization of the Colossi is truly commendable: they are large in the true sense of the word, equipped with a high number of polygons (which makes them seem powerful) well diversified andcared for, with attention paid to every single detail. For their realization, the development team studied different architectural structures, and tried to re-propose them in different versions in the form of these living creatures. The negative notes are instead all related to the Playstation 2 hardware, which has now reached its limits: first of all the frame rate which, although for most of the adventure remains around 30 frames per second, in the most crowded situations it almost reaches halving, or even the aliasing and shimmering that make the outlines of the characters and some settings not exactly clear, defects with which PS2 owners are resigned to live with. Defects as mentioned related to the hardware on which the game runs, because as far as the rest is concerned, the work done has very few yardsticks around. The sound sector expands the game atmosphere with the chirping of birds, the noise of waterfalls, the strong wind that passes through the hair, the sandstorms that peep out on the horizon. The actual music arrives during the combat sequences, accompanying the different moments of the challenge with tones that change in intensity, but which are all united by an extraordinary realization (it is no coincidence that they were composed by Mr. Kow Otani, a well-known Japanese composer ). Imagine a scene: after discovering the weak point of the colossus and stunning it, it lies away from you, while the music changes making it clear that the time has come to attack without second thoughts. After bridling your horse, set off on a deep and swift ride towards the behemoth, in a race against the clock before it rises again. Arrived in its vicinity it is time to launch towards him, to end it all. The feeling in doing all this? Priceless, as rarely happens. If from an artistic and communicative point of view the game, in our view, has fully achieved its goal, not even the actual playable part is outdone. The dynamics of development is focused on exploration (actually at the player's discretion) and the clash with the giants which, by Ueda's own admission, is the focal part of the action. These fights combine action, puzzle and platform elements, as it will first be necessary to understand how to find their weak points (observing their behavior or the surrounding environment), then dedicate themselves to achieving them and finally to inflicting mortal damage. At our disposal we will have two weapons, a bow with related arrows and a sword, which will prove indispensable depending on the occasion. The way to deal with the giants and their weaknesses change with each encounter, and a tactic adopted for one will be completely ineffective for the next. Also in terms of conformation and characteristics they will visibly differ from each other, in fact there will be no shortage of volatile giants that will be faced in the race. All this therefore translates into an excellent variety and a decided satisfaction on the part of the player, who will feel gratified after having found a way and having defeated the colossus. The game mechanics so atypical the scenic impact of the clashes are so well thought out that you will not rarely find yourself in a position to imagine what the next colossus will be like, if even bigger and more difficult to overcome. Going further into the details, with the triangle key it is possible to jump, with the square to use one of the two available weapons, with the circle instead to use the sword to bend the light in the direction of the colossus, and therefore have a point of reference in order not to get lost in the vast lands that will characterize the game. The X key is instead delegated to interact with Agro, our horse, equipped with an independent artificial intelligence, certainly among the most advanced for a ~support~ animal: we will be able to recall it with our voice or with a whistle, jump on it and direct it in one direction instead of another by pulling the bridle, but it will refuse, for example, to run near a cliff or in front of insurmountable obstacles, sometimes finally it will not be necessary to call it back to see it run to our rescue, it will act on its own. Its use will be vital to traverse game locations faster and to face some of the game's behemoths. Returning to the protagonist, the R1 backbone is used instead to cling to ledges, brushwood or obviously some parts of the colossus, it will also be used together with the triangle key to climb walls or find weak parts where to attack. The right timing will therefore be necessary to avoid falling and to reach the affected body part of these immense creatures. To give an example, without revealing too much about the phases aadvance, in the first fight we will have two solutions: go around the colossus and look for a point on the back of the leg where to jump and cling, and then hold down the R1 key in such a way as to keep the grip firm and prevent the jolts of the colossus from dropping the main character. As soon as the colossus has ~calmed down~, it will be possible to try to continue the ascent, perhaps jumping from one leg to the other and looking for the best points. Or still let the colossus attack with the huge club in his possession, avoiding it and taking advantage of the fact that for a few seconds the club will remain anchored to the ground and can be climbed. Obviously it will not be enough to alternate this practice to be sure of achieving the goal: in addition to the canonical energy bar, there will in fact be another indicator, relating to Wander's resistance; when it runs out completely (following a prolonged hold over time), it will no longer be able to hang and it will inevitably fall to the ground. Ueda and his team have packaged another little video game jewel, an experience that, in all its facets, you will rarely try elsewhere. To these elements is added the landslide following the movements or actions of the giants, which will make the movements of the protagonist and his horse more difficult, even causing them to stumble. The camera will position itself semi-automatically behind the player, and can be controlled at any time with the right analog button. In the vicinity of a Colossus, pressing the L1 key will allow you to keep the view always blocked on it, in such a way as to concentrate on avoiding its attacks and on finding its weak points. The control system, also due to the fact that it offers the player many combinations, can be a little difficult at the beginning, but after the first giants it will become easy to master and, with the help of the visual, it will make the clashes even quite spectacular. Saving can be done after defeating each colossus or in the vicinity of mini times scattered throughout the game area. Finally, it will be possible to increase the energy and resistance bars, literally going on the hunt for small lizards scattered near these times and by dropping some fruits present on part of the trees that populate the forbidden land. The shadow of Ico's coat of arms was at least threatening, but Ueda and his team have packaged another little videogame jewel, an experience that, in all its facets, you will rarely try elsewhere. It is not yet a title for everyone, and some will probably remain indifferent as happened with Ico. Those who will be captured by it will find a brilliant technical system for artistic direction and attention to detail, a spot-on sound sector of excellent workmanship and a satisfying gameplay, which forces the player to think and act at the same time, giving incredible satisfaction to every giant beaten. The final battle and the epilogue also represent some of the most intense moments ever to appear in a video game, as well as having the ability to literally explode the narrative component and understand how much the game, more than the (few) words inside it, sent something to the gamer. Surely they will leave room for numerous theses and discussions on its meaning, on the connections with its spiritual predecessor and on the balance between good and evil, in a way that only great titles like this can do. Pros: Atypical and engaging game mechanics Excellent atmosphere and player identification Sound compartment of exquisite workmanship Excellent artistic direction Cons: Frame rate dancer Not everyone will be completely captured by it", "date": "2005-10-26", "grade": null}