{"name": "Chirurgia d'urgenza", "ref": "https://multiplayer.it/recensioni/117926-surgeon-simulator-2013-chirurgia-durgenza.html", "text": "How difficult is the surgeon's job? Every day, between a coffee and a sandwich, he has to open and close someone to try to save their life, paying painstaking attention to every movement. In short, you're always there fighting against death, bearing a huge responsibility. This must be why even the laymen, like us, can only admire those who are able to keep their nerve in such extreme situations. If we were to judge Surgeon Simulator 2013 by the claim inherent in its title, namely that of being a simulator, we would crush it without too much mercy. But just start it to understand that here we are faced with something else and that that ~Simulator~ is just a piece of the irony that permeates Bossa's work, born from an old contest and finally became a complete game in its own right. The concept that regulates it is very simple and sees a surgeon who has to perform some operations as the protagonist. The operating table is displayed on the screen, with a patient already prepared for the operation on it, some surgical instruments, such as a scalpel, a saw and so on, and the surgeon's hand, which is also the interface with which to interact with the various items, including option menus. We confess that the first moments in the company of Surgeon Simulator 2013 were truly unsettling, in a certain sense atrocious, given the extreme difficulty of the control system, which only a ninja can completely tame. Actually describing them is not too complicated: with the mouse you move your hand, with the various keys you rotate it, while with the keyboard you can close your fingers (each key is connected to a finger). The rest is done by the slightly over the top physics and the player's desire to slip into a similar absurdity. We are required to move the floating hand on the operating table and grab the various instruments by closing the fingers at the right moment, to then perform the various prescribed operations, trying to cause as little damage as possible to the patient. Easy to say... The scalpel in the heart In short, we have before us a table full of surgical instruments, a patient to be operated on and a control system beyond any concept of usability, what to do? If you take Surgeon Simulator 2013 too seriously at first, you end up feeling a certain tension, wondering why it's so damn hard to grasp anything and why after a few seconds the very tidy operating room has become a primordial soup of objects scattered everywhere . After a few minutes, the conviction develops that one will never, ever be able to finish an operation successfully and one is taken a bit by discouragement. Only after spending more time fighting with the cursed hand and the various effects caused by errors (the hallucinogenic effect produced on the screen by mistakenly injecting oneself with the syringe is splendid) does one come to understand that the beauty paradoxically lies in the awkwardness of our movements, due to the clunky interface. Take or leave. Thus one begins to try to discover ~the effect that everything has~; you take objects and throw them here and there to see what to break. More than surgeons, you end up feeling like muppets who are putting together an episode of their show without having the faintest idea of what to actually do and disinterested enough. Should we perform a brain transplant? Via a good hammer to break through the braincase, then a clean blow of the scalpel as if we were samurai (going for precision is crazy, trust me) and then we rip out the brain as if it were a dry plant to then attack a new one finally obtaining our hard-earned points! Easier said than done, with that damned wrist watch coming off at the most unthinkable moments ending up inside the patient on duty who then needs to be cleaned up. In short, you will have understood that we are dealing with a parody of surgery, rather than an attempt to really simulate this ancient and noble profession, where the player's incapacity becomes the fulcrum of the gameplay and where absurd situations, such as operating on an ambulance in motion, they become the way to stage curtains that seem to mimic American medical dramas, with vital organs becoming toys and the apparent drama of the situation to enhance the extraordinarily soothing effect of the whole. Jumped skulls It's not for nothing that Surgeon Simulator 2013 has become one of the most used titles in funny videos on YouTube, with the various videomakers having fun showing the absurdities they are capable of during operations, or trying to perform perfect scores (at the end of each surgery is scored based on the patient's blood losses and other factsri), and it is not for nothing that sales seem to be going very well, despite someone not digesting the control system. In short, can we blame Bossa for making a title based on him being ridiculous of him? Can we blame him for playing with a fundamentally delicate matter by bringing it to the point of paroxysm, with blood splashing everywhere as if the patient's body were a fountain? Definitely not, however we can underline that there are only three types of operations and how the general variety is really scarce, even if it must be said that the replayability factor of each single mission is very high. Let's also include the extras hidden in the operating rooms and the objectives, some of which are very difficult to achieve, others crazy, and you will understand that for less than ten euros you can take home a product capable of surviving several hours without problems. Can the craziest control system of recent years also be one of the funniest?", "date": "2013-04-29", "grade": "7.5"}