{"name": "Luchador dell'altro mondo", "ref": "https://multiplayer.it/recensioni/117341-guacamelee-luchador-dellaltro-mondo.html", "text": "Regardless of the problems and defects of a country, living abroad for years and years, one cannot fail to miss one's homeland. Augusto Quijano, an animator who grew up in Yucatn and is currently employed by the Canadian developer DrinkBox Studios, knows this well. The lack of visibility of a console like PlayStation Vita did not allow the team to gain the right notoriety in the mass audience with the excellent Tales from Space: Mutant Blobs Attack, but the inspiration for their new game was born from Quijano and from his nostalgia for Mexican traditions. At first glance Guacamelee! is just that: an explosive tribute to the land of luchadors and pots, mariachi groups and nachos, but above all of Da de Muertos, the traditional day of the dead which in this title is the basis of the plot and many gameplay ideas. A smoothie between popular culture, customs and folklore which, surprisingly, forms the backdrop to what is undoubtedly one of the funniest, most lively and original metroidvanias of recent years. Between masks, tortillas and suplexes Not far from the small village of Pueblucho lives Juan, a big man who spends his monotonous days between work and siesta, even though deep down he has had a crush on El Presidente's daughter for years. You've already figured out where it all ends. In fact, Carlos Calaca takes care of making sense of our story, a charro who, after having sold his soul to the devil and becoming a skeleton, has found nothing better to do than kidnap the beautiful girl to sacrifice her and reunite the kingdom of the living with that of the dead. In an attempt to save his beloved, Juan beats them up and is sent straight to the afterlife, where he transforms into a fearsome luchador and gains the necessary skills to begin a journey that will lead him to fulfill his revenge. It is therefore immediately noticeable how the developers have managed to characterize and give a strong personality to a clich as trivial as that of the damsel in distress. In a 2D metroidvania, among the most important aspects there are undoubtedly the map and the game world: the paths must be articulated, but never dispersive or too linear, they must stimulate exploration without however causing the rhythm to collapse. While not offering a gigantic map and perhaps sinning a little in the amount of secret areas and side missions, DrinkBox has shown that it has done its homework, and find a comma out of place in the level design of Guacamelee! it really is a feat. Going forward in the adventure, the inspiration from the classics is evident, but also from more recent or less famous exponents, so much so that some design choices demonstrate a clear influence from Cave Story. Constantly showing the next objective, the map makes it nearly impossible to get lost, while the various areas will become accessible as you gain new abilities: from double jumping to wall running, passing through a headboard capable of shattering walls or the ability to slip into narrow tunnels. The special statues from which it is possible to obtain these abilities have the appearance of Metroid's Chozo, almost as if it were a tribute to the franchise that most influenced the birth and creation of the game. Moreover, it is only one of the many references and cameos hidden here and there in the scenarios: from Castle Crashers, Super Mario, Viva Pinata, Journey, all so obvious and yet all inserted in an absolutely coherent way within the setting, to the point that finding them becomes a real game within the game. Playstation 3 trophies Guacamelee's! it is a Platinum that is anything but easy to conquer. Although many Trophies are unlocked simply by progressing through the story and obtaining new skills, some of these require you to finish the game on Hard mode, collect every single chest hidden in the map and complete secret dungeons so difficult to remember the baddest levels of Super Meat Boy. Mexican slaps Where Guacamelee! it moves away from the other metroidvania, however, it is in the combat system, intuitive yet able to give a lot of satisfaction. Here the contaminations from the beat'em up genre can be seen in the possibility of chaining combos, aerial holds and wrestling techniques with disarming simplicity: with an uppercut you can throw an enemy into the air and fill him with punches, before being able to grab him with a hold and crush it on the floor, taking the combo counter to the stars in a few moments. Special techniques such as headbutts, suplexes and bellies are activated simply by combining a single button with a specific inclination of the analog stick, making the action even more fluid and immediate.The enemies, even the most common ones, vary a lot in their attack patterns, while in the more advanced stages they are even covered by colored shields that can only be broken by a specific move. The bosses are also hilarious, including winking witches, cowboys with heads on fire and proud anthropomorphic jaguars. If an excellent job has been done in the control and combat system, the Canadian developer has also paid equal attention to the platform component, which is increasingly important as you progress through the game and get new skills. One of these allows you to switch at any time between the world of the living and that of the dead, changing the surrounding scenario and giving the green light for some truly diabolical puzzle platform sequences. Never overly frustrating, Guacamelee! softens the trial and error moments thanks to an instant respawn that, with rare exceptions, makes Juan reappear on the last platform he was on. In short, there is no game over and the fluid, fast and immediate gameplay of the game actually stimulates speedrun even in the most delicate moments. Cross-buy and cross-save support between PlayStation 3 and Vita, as well as the co-op option (local only and PS3 only) are certainly a welcome addition, but it's thanks to the remarkable attention to detail that DrinkBox Studios has made one of the flashiest, craziest and funniest games on PSN. Guacamelee! is a riot of colors, surprises and funny mariachi music, and the apt Italian localization manages to keep all the humor of the original jokes alive (despite a slip made with the ~Move List~ page which literally became ~Move List~). If you ignore the side missions, secret areas and Trophies to unlock, the main story can be completed in less than five hours. A little bit, some might object, but after all it's the quality that counts, and in these few hours the development team has managed to keep the pace high, continuously introducing new mechanics but giving the player enough time to play and have fun with each.", "date": "2013-04-16", "grade": "9.0"}