{"name": "Trenino di eroi", "ref": "https://multiplayer.it/recensioni/117191-nimble-quest-trenino-di-eroi.html", "text": "Having become famous thanks to management software such as Tiny Tower and Pocket Planes, capable of combining a discreet depth with an uncommon formal simplicity, the microscopic team of Nimblebit has opted for a decisive change of register for its latest production: set aside for a moment administrative activities and pixel art typical of the aforementioned titles, the Californian developer embraces a graphic style close to 16-bit RPGs that is linked to a gameplay inherited directly from the progenitor of mobile gaming, namely Snake. So let's see if the bold combination of Nimble Quest can be attractive... Historical revisionism To tell the truth, it must be said that Nimblebit's idea was not a 100% original idea: a play structure quite similar to that of the game subject of this review had already been set up by Magic Cube Games with its Call of Snakes, albeit in a decidedly more crude way. However, the concepts are the same, with the user having to command the character on the screen with the same dynamics with which the movements of the snake were managed on the monochromatic displays of old Nokia mobile phones: framed from a top view, our hero proceeds autonomously following a straight line, turning at 90 angles according to the direction given via a swipe on the touchscreen. The aim of the game is to defeat all the enemies on the screen without succumbing to their attacks and crashing into the walls that surround the stages, on pain of immediate game over. The concept of having to attack opponents does not add any complexity to the gameplay, given that the practice is liquidated by an automatic system that inflicts damage on targets in its path, with a different type of blow depending on whether the selected character has a short or long range weapon. From time to time, the annihilation of an enemy causes another hero to appear inside the arena who lines up with the main protagonist, following him step by step and helping him in the fights: and it is here that the mechanics inherited from the old Snake peep out again, given that the lengthening of the ~train~ of warriors makes it more difficult to maneuver and increases the risk of collisions with opponents or obstacles. This basic formula that forms the backbone of Nimble Quest has been enriched by the developers with a whole series of small features that justify the choice of a classic old-school RPG fantasy setting. So here is that the members of your party all have a health bar that can be replenished by potions that are occasionally found on the ground, together with a whole series of power ups that guarantee momentary bonuses related to attack or defense. The same characters (which refer to the paradigms of the genre such as the paladin armed with a sword, the thief with a bow and arrows and so on), in addition to having different characteristics, can level up and become more powerful as they accumulate kills . Furthermore, the gems that are collected during the games serve as a bargaining chip to buy upgrades of various types which tend to increase the effectiveness of the various bonuses that appear on the playing field. All these aspects added together make Nimble Quest an immediate and enjoyable product, but also inevitably repetitive given a game structure perhaps excessively devoted to the most absolute simplicity. Even the aesthetic component seems to have the handbrake on a bit, especially if we consider the previous works of Nimblebit: even if we are talking about a deliberately classic and competent 2D in its realization, a certain lack of inspiration is evident. Then there is the question of in-app purchases, rather intrusive even if absolutely not necessary to be able to play: the game uses a system of tokens (purchasable with real money) which allow you to restart from the last level faced in case of death instead of start over, to quickly upgrade your character, to have bonuses for the duration of a single stage, to unlock new heroes and so on. Many elements that do not absolutely affect the enjoyment of the experience but that can make the user experience the unpleasant sensation of being the chicken to be plucked on duty.", "date": "2013-04-11", "grade": "7.0"}