{"name": "La foresta incantata", "ref": "https://multiplayer.it/recensioni/117152-badland-la-foresta-incantata.html", "text": "BADLAND is a universal paid app without IAPs. You buy the game once and you get the whole gaming experience to your every iOS device. With this introduction, contained in the game's launch press release, the Frogmind guys have already started off on the right foot. No in-app purchases: 3.59 and Badland is all yours. If the move away from such popular sales models is certainly a courageous choice, on the other hand there is evidently the great faith that the Finnish team has in its debut title. And in fact, since the first screenshots released in recent months, one could guess, or hope, that there was some good in Badland; an optimism corroborated by the pedigree of the only two members of Frogmind, Johannes Vuorinen and Juhana Myllys, both with a recent past in RedLynx on Trials Evolution. The first programmer, the second artist: in the end it doesn't take much to put a project into practice, the important thing is to have a good idea. And luckily, the idea behind their independent project is in full swing. Courage is not enough Badland is a forced side-scrolling action adventure set in an exotic forest, and the protagonist is its small and bizarre inhabitant: a sort of ball of fur capable only of fluttering around lazily, but with an iron will to find out what is going wrong in his world. There's more to know because Badland is deliberately a minimalist title in terms of narration, interface and control system; the beginning of the adventure is therefore abrupt, with a slightly unsettling effect but nonetheless far from traumatic. This is because the couple of programmers decided to develop Badland on the basis of a very simple play structure: in practice you only have to touch the screen at any point to make the ~wings~ flap and thus make the protagonist creature take off. The goal is basically to avoid traps and pitfalls along the way to reach the end of the level and move on to the next. To expand and make the gameplay interesting, we think about a whole series of bonuses which in fact give the creature skills that are fundamental for overcoming the various situations. We talk about increasing or reducing its size, slowing down or speeding up time, ensuring a constant rotation, weighing down, making the little hero bouncy or sticky and so on. These attributes are positioned exactly before the section in which they will be needed, thus reducing the player's task to collection only; nonetheless, the exceptional variety of situations offered thus ensures constant progression and a high pace of play while always keeping the user's interest high. However, one of the most important and interesting bonuses is the one that allows you to create clones, real copies of the little creature to be controlled simultaneously in the same way as the individual. However, being able to bring them all to safety is not only complicated, but often impossible; the concept of sacrificing dozens and dozens of clones is in fact an integral part of Badland, because rotating blades, huge pistons, very heavy rocks or mines ready to explode are the norm. A normality to which, however, it is hard to get used to completely, and hearing the ~splat~ that accompanies the terrible death of some of your travel companions is always a moment of macabre sadness. The beauty of the forest What the Finnish team wanted to create is basically a fairy tale, but a dark and somewhat cynical one; the graphic style is in fact a fundamental element of the overall picture of Badland, an ingredient whose quality appears extraordinarily evident from the first moment. Certainly perhaps not totally original, because the reference to that Limbo which has in fact created a real artistic genre in itself is evident. Also in this case, in fact, the protagonists are the silhouettes although, differently from the title of Playdead, here the color is not completely banned; on the contrary, if black dominates all the elements in the foreground, the background is represented by an extraordinary glimpse of the forest that dynamically changes one level after another, with four dominant shades that represent the phases of the day in which the story unfolds (dawn, noon, dusk and night). The result is splendid, highly distinctive and extremely fascinating, full of atmosphere, with a glance that is certainly among the most evocative of the entire App Store offer. The sound accompaniment is also exceptional, strictly to be appreciated with headphones. Forty or so levels overall may seem like a few, and in fact it doesn't take long to reach thereat the end, yet even in this juncture Frogmind wanted to commit himself by offering the possibility of repeating the levels both simply to save a greater number of clones, and instead to obtain 3 eggs that correspond to as many sub-missions for each stage. Also nice is the ability to review replays of your exploits, record them and share them with the community. And as if that weren't enough, there's also a competitive multiplayer mode for up to 4 players which isn't there just to increase the number, but which on the contrary represents a section which in terms of quality and content could very well be sold separately. Finally, the promise of a future update intended to extend the adventure with an entire ~second day~ should be noted.", "date": "2013-04-10", "grade": "9.2"}