{"name": "I cavalier", "ref": "https://multiplayer.it/recensioni/117007-knight-storm-i-cavalier-larme-gli-amori.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. Medieval architecture enthusiasts never give up visiting a beautiful castle, but more often than not they don't imagine what it was like to live in such a dark and terrible historical period, in which violence reigned sovereign and very few lords were benevolent towards their ~subjects~. Knight Storm puts us in the shoes of a knight who not only has the task of managing his fortress in the best possible way, organizing the internal works in order to optimize the efforts of the people involved, but also of leaving its walls, riding a powerful steed, and do everything possible so that the immediately neighboring lands also enjoy his loving protection. All this takes place through a rather multifaceted structure, at first even quite obscure, which divides our work into various sections. There is the aforementioned management part, with the castle shops that can produce new potions, improve our experience level and devote ourselves to the construction of weapons and armor that can improve the statistics of the character we control. We then move on to exploring the map and accessing the quests, which bring with them adventure elements (in fact, decisions that lead to certain consequences must be made) and can lead to duels with white weapons or horseback battles. The former, rendered in a rather simplistic way, start by simply touching an icon but are not interactive and therefore are won by whoever has the best statistics at that particular moment. The horse fights, on the other hand, are much more fun and detailed, and in many ways constitute the most interesting and lively part of the gameplay. Take my bat When we decide to confront an opponent on horseback, Knight Storm sets in motion a situation that follows the famous medieval ~jousts~ in which, in fact, two knights face each other using a long spear and a shield. In this specific case, the first step is the presentation of one's seal to obtain a bonus in terms of attack or defense (the seals must be built in the forges of the castle, using the fragments collected during the exploratory phases), then we start the charge and you have to move the tip of the spear within a ~grid~, trying to impact the enemy's shield as precisely as possible, so as to cause the greatest damage. The consequences of a powerful attack carried out with precision are spectacular: the enemy's spear explodes into a thousand splinters of wood, like his shield, and the victim is unseated during a spectacular bullet time that alone is worth the price of the ticket. Of course, being the victims of this event may not be very pleasant, but the title developed by MunkyFun from this point of view proves to be extremely generous and does not make the adoption of the freemium model weigh that much, given that after a certain number of minutes automatically recharges health and energy. It is certainly possible to put your wallet in order to play longer, explore more areas on the map and face more fights, but even without shelling out a penny you can proceed, level up and gain experience ... simply with a little more patience. The duels on horseback undoubtedly represent the best part of Knight Storm also on the technical front, thanks to great attention to detail and convincing polygonal models, but we would have appreciated the same care also towards the interface and other surrounding elements.", "date": "2013-04-06", "grade": "7.4"}