{"name": "L'oro di RedLynx", "ref": "https://multiplayer.it/recensioni/116850-trials-evolution-gold-edition-loro-di-redlynx.html", "text": "It is the return of the prodigal son. Or rather, of the son who left on the sly then returned, matured and raised. Unsurprisingly, RedLynx chose a downhill road to bring the brand that projected the software house back to the PC among the many hardcore gamers around the globe. Trials Evolution: Gold Edition takes the episodes released on XBLA (HD, Evolution) and combines them under the guise of an apparently updated graphics engine, without making any changes to the gameplay or content offered by the previous chapters. The result is a title unable to offer more to those who have already used it on the console of the Redmond house, but ready to jump on board all those numerous fans who have been following its deeds from the top of their keyboards for some time. The result of the operation? Positive, as RedLynx tradition, but there remains a bitter aftertaste of a well-executed homework. This Gold Edition embodies the spirit of the brand better than any other iteration, even if it is undeniable that the software house could have spent more time optimizing the title. Now, enough talk, all aboard. Something hasn't changed It is fair to admit that without Sebastian Aaltonen, RedLynx would hardly have become what it is. The lead programmer still remains a true wizard of programming, and it is precisely for this reason that it makes you smile bitterly to notice that lack of polishing which instead commendably characterizes the previous works of the software house. Don't worry, it's nothing serious, it's just that there are some elements that have started to go out of tune in the transition from console to PC. The first, in reality, is attributable to both versions and concerns the sound sector. It seems incredible to begin an examination from the audio side, yet the lightness - at times pure inconsistency - with which RedLynx has maintained, despite the feedback received in the past, the same insufficient sound accompaniment of the versions that make up this Gold Edition is disconcerting, without modifying any of inherited flaws. Flat tracks, sometimes in contrast with the game situation, detached from the context and almost placed there to acoustically fill the general picture. On a purely technical level, what made a fine show on consoles fails to shine on PC. Not even enviable specifications will be able to remove occasional tearing or improve some textures visibly designed for the Microsoft platform. All this is pure pique in a universe made up of very different technical elements fundamental to the gameplay, but in the face of almost eleven months of time since the console version and the possibility of exploiting the much higher limits imposed by PCs, it is sad to note how visually not there has been evolution. I want the medal They are more than 120, at least counting the challenges present in this fusion of HD and Evolution. So many tracks to choose from, disparate objectives and that substrate of unhealthy pursuit of perfect execution create a lethal whole, in a positive sense of course. This generation has not shone for peaks of challenge and when a title chooses to follow the dictates of hardcore gaming, the result is pure and simple addiction. With a pinch of masochism, the good one, which has accompanied generations of gamers in the old era of screen pixels. Trials is back in good shape from a playful point of view, offering its usual system of painstaking perfection which between one quick retry and another will clearly show why the RedLynx brand has been able to create such an important following. Speed, physics, balance. It is in knowing how to combine these elements that the title shines. The level design is never taken for granted and there is no obstacle inserted by mistake as everything is functional to provide the maximum challenge on every occasion. Comparisons with a Demon's Souls of engines may seem risky, but certainly those that compare it to the Excitebike of the present are decidedly more credible. Citationism aside, the strength of the title lies precisely in challenging the player to offer ever better performances, in the face of a Story mode that raises the bar and whose completion will be anything but a walk. In addition to the fusion of the objectives of the games that Trials Evolution: Gold Edition includes, it is interesting to note how the digital platform Uplay has contributed to the management of the online sector, excellent as always. The infrastructure born on Xbox 360 returns thanks to the contribution of Uplay, which will constantly provide new user-generated tracks and times against which to compare. High replayability, which if added to all that is unlockable within the title makes Trials Evolution: Gold Edition a quality pastime with which to wait for the nextmo AAA title, and perhaps to which to return later to savor once again a pleasant sense of challenge. A lot of content, it's true, a pity about the absence of the DLCs proposed for the XBLA versions, but basically nobody forbids adding them later. And if the concept of ~free~ has almost disappeared in the minds of publishers, it is also true that the laws that govern the PC world are very different from those that govern the realm of consoles. After all, hoping costs nothing. It's time to change gears Well yes, the time has come. Trials can still express a lot, but the impression is that Ubisoft and RedLynx are squeezing the brand, drawing on what good there is still. Fear, as history teaches, is the development approach that the Finnish team will inevitably have to change for the next iteration of the franchise. Beyond the content, the methods, the inclusion of all the best expressed up to now by Trials, the need for renewal appears all too obvious. Trials Evolution: Gold Edition does not betray its essence as a compilation, and for this reason you cannot ask for much more, but Ubisoft has a not indifferent digital cornucopia in its hands that must not be burned. If we add the hardcore appeal of the title and the awareness that in such a situation modifying an iota of gameplay can cause a tsunami in terms of user reception, the task that awaits Redlinx is not easy. Although the software house is currently divided into two teams, one linked to the Trials franchise, the other working on a new racing IP, Aaltonen (lead programming) and Ilvessuo (creative director) are both firmly at the helm of the developer. The hope is that the support of the French giant's development tools, infrastructure and services will help the phenomenal brand to get out of a possible stalemate that would not do it justice at all.", "date": "2013-04-03", "grade": "8.0"}