{"name": "Guerra al Cartello", "ref": "https://multiplayer.it/recensioni/116776-army-of-two-the-devils-cartel-guerra-al-cartello.html", "text": "Third chapter of the Army of TWO series, here comes the episode called The Devil's Cartel for all the fans of the saga (and there are many of them), which as can be easily seen from the title itself sees us as protagonists against a dangerous and bloody Mexican drug cartel , of those ruthless and without any humanity. And to stop certain criminals you don't need ordinary soldiers but as many ~war animals~ as are the two new protagonists Alpha and Bravo, godchildren and colleagues of the two terrible Rios and Salem already appreciated in the previous chapters who we will also find in this last game. Once again by Electronic Arts, the new chapter passes from EA Montreal to the American experts of Visceral Games (already authors of the successful Dead Space series, as well as the old shooters related to 007 during the last gen and the ~The Godfather~ series) . Army of TWO, let's say it right away to understand what we're dealing with, is one of the most popular series of this generation in terms of two-player cooperative play, both via the internet but above all live. This franchise exploits (or in any case tries to do so at all times) the union on the battlefield of two characters who help each other, demolish together, cover, unite, cooperate with a single common goal: to destroy everything and everyone and save your skin in situations worthy of the best Hollywood action movies. Yippie ki-yay! Once Army of TWO: The Devil's Cartel has started, we are already in the action zone after just 5 minutes of quick tutorial, just enough time to learn how to cover, how to get around enemies, attracting their attention and basic use of primary and secondary weapon. Boys stuff for those who chew shooters. Luckily the game does not dwell on the theme and precisely throws us into the fray directly in Mexico where, once we meet the old Rios and Salem, we are informed of our mission which is to protect a politician called Cordova, linked to the fight against drug trafficking and whose head all the bad guys want. It goes without saying that things will get complicated and the story will unfold through many different locations and missions ranging from rescue to infiltration, from total destruction to the protection of secondary characters, all always and only executed in close cooperation with our companion Bravo, controlled by an online friend, or by the artificial intelligence of the game. The characters and their ~macho~ personalities are barely mentioned, never deeply investigated for obvious gameplay reasons: it is a 100% shooter without any sort of moral, philosophical, ethical or any other narrative pretext. Simply the script consists of two lines, the personality of Alpha and Bravo from only one. But we like it that way, after all: hard and raw. Indeed, if we really want to find an immediate difference with the previous chapters, we can say that it is a more ~serious~ game and without the pomp of the previous one, all too ironic and almost annoying in some situations where the brutality of gratuitous destruction clashed with the purely Yankee goliardic and iconographic celebrations of Rios and Salem. This time Alpha and Bravo do their homework almost in silence, without laughing, cheering or getting excited like a basketball player after a dunk. Surely some criticism has had the right effect on the sweetening of the game action. Compared to the first two chapters, in addition to the ~decrease in black humor~ there are other substantial changes. First of all in the gameplay: the Overkill from the first Army of TWO is back, or the possibility of having a few seconds advantage over the enemy with a doubled rate of fire, slowed down time and active invincibility, but only after a certain number of kills and in cooperative mode. Factor which, moreover, makes the most intense and complicated parts of the game much simpler and more linear. The difficulty level set to ~normal~, on the other hand, is too simple in itself: the advice is to start at least from the higher one. The ~Overkill~ attacks have been added, however, numerous other features that have always distinguished the series have been cut, such as the possibility of going on ~shoulder to shoulder~. There is no ~aggro~ that gave the game an unexpected and hinted attack strategy by distracting the enemies on our partner, and there are not even the moves and gestures of the couple. The ~moral~ moments where it was necessary to make precise choices dictated by our personality were also cut. In short, this is the least cooperative Army of TWO of the three, certainly the most simplified and least full-bodied, given that there is also no online mode any chand it's not story mode in co-op. So no competitive multiplayer, which also had distinguished the previous two chapters well and which, precisely by virtue of the characteristics of the game, could fit us perfectly (just think of the various 2 vs 2 modes of Halo). Given the lack of many online modes and a certain ease in the continuation of the story, the total longevity of Army of TWO: The Devil's Cartel is decidedly low and below the average of its genre. And even entering the score is not enough to give this title a worthy replay value. Xbox 360 goals As is the natural order of things and of the universe, Army of TWO: The Devil's Cartel also offers the player the classic 1000 points to unlock, this time through 46 objectives, almost half of which are secret. Well we reveal that there are no particularly difficult actions to perform to obtain them all: only destroying continuously will be enough to unlock them, as well as killing, demolishing cars and objects. Fire at will! Global total destruction The developers of Visceral Games have been very able to take advantage of all the graces offered by the latest Frostbite Engine 2 graphics engine, after having ~retired~ the Unreal Engine 3 previously used for the other Army of TWO. The new engine allows for a clearly superior destructibility of the environment and therefore a spectacularization of the scenography now ~at the service~ of the explosions. Blowing up objects, cars and barrels of petrol is not only satisfying, but there are also specific objectives attached to these actions so we feel practically obligated not to leave even a twig standing. In practice however, this exaltation of the war scene was only half successful. The amazement somewhat disappears when we notice that not everything reacts to fire in the same way: for example, wooden barrels can be blown up, but not chairs, sofas and furniture in houses. Cars and wagons can be destroyed, but not trees, bushes and much less resistant objects than a car. In short, it could have been done better, or not insert this interactivity halfway at all. Another field in which we are in strong doubt is enemy artificial intelligence. Too often they launch and move on the same ~script~ enemy after enemy, performing the same runs and movements, as well as actions such as cover and shooting in almost rhythmic tempo. At times he even recalled (albeit vaguely and with due distance) the good old and dear Virtua Cop. The previous Army of TWO did a more refined job on the movements of the opposing CPU and we remember enemy encircles and covers than in The Devil's Cartel latitano. On one occasion we even found ourselves, while shooting like madmen from a fixed position, with an enemy on our side who was shooting at us endlessly without moving and continuously hitting the metal plate to protect us, while behind us we were completely uncovered. Some gifts that an AI worthy of the name shouldn't give, honestly. Having said that, and in any case, the guys at Visceral Games have done an excellent job on the technical front by designing very heterogeneous maps ranging from Mexican luxury hotels to the desolate lands of the countryside, from the small typical town to the guerrilla in the city, always with a large horizon ahead and a polygonal computation worthy of this gen. The textures and their general quality are excellent also thanks to the optional installation of almost 1.5 GB on the Hard Disk. Some glitches and imperfections here and there in the polygonal interpenetrations are sporadically noticeable to a careful eye, but nothing really serious. However, the real strength of this Army of TWO: The Devil's Cartel remains the very strong customization component, both of the characters and of the weapons, which is possible both before starting to play and between one level and another, by accessing via the main menu to the armory and shop option. Here you can buy and equip dozens and dozens of weapons, objects, gadgets, camouflage and war suits, uniforms and uniforms, and last but not least the famous ~masks~ that characterize the series and its characters. It is also possible to draw them in the first person by creating overlapping ~layers~ just like you did when drawing the hoods of cars in Forza Motorsport. There is no doubt that, despite the many defects from which this last chapter of Army of TWO suffers, it still proves to be a title that, as the English would say, delivers, or that does its duty as a shooter giving a certain satisfaction in shooting , destroy and shoot down enemies. However, the significant cuts to gameplay, multiplayer and the pure co-op component turn it into the worst chapter of the series and into an inexorable missed opportunity to be fatidico and much coveted ~quality leap~ that is definitely missing. We look forward to the next chapter, probably ~next-gen~.", "date": "2013-04-03", "grade": "6.2"}