{"name": "Lame ruggenti", "ref": "https://multiplayer.it/recensioni/116668-fire-emblem-awakening-lame-ruggenti.html", "text": "Writing the review of Fire Emblem: Awakening is very difficult, believe us. The titanic vote has nothing to do with it, the problem is simply to stop playing it to sit down at your desk and explain why the latest effort from Intelligent Systems and Nintendo is probably one of the best strategic RPGs of all time. First of all, it seems right to devote a few lines to the history of the franchise, as someone will surely be frowning. How to blame him; after all, the series has also been famous in the West for a relatively short time. Do you think that the very first episode for the NES dates back to 1990, but it took Nintendo twelve years to start locating the series from the sixth episode onwards. It was 2002 and at that point Fire Emblem was already well known to most through emulation and unofficial adaptations. Since then, almost every subsequent episode has been released worldwide (except for the 2010 remake Shin Monsh no Nazo) but at least two or three years have always passed between one and the other. Also for this Awakening there was a long wait, the European version comes out two months after the American one and a full year after the Japanese one. The most obvious question in the world: was it worth it? You awaken Players approaching the franchise for the first time need not fear, because Fire Emblem: Awakening is not strictly connected to the previous episodes and is therefore a purely stand-alone chapter. Here and there, however, fans of the franchise will recognize many quotes that make the development of the story even tastier. And then of course there is the Emblem of Fire, the mysterious artifact which, as usual, is relegated to an absolutely secondary place, performing the function of a real MacGuffin. The protagonist this time is Chrom, commander of the army of Ylisse, a nation worn down by a double threat: on the one hand there is the kingdom of Plegia, ruled by the psychopathic Gangrel, and on the other a mysterious army of the undead who wreak havoc and terror wherever they appear. It is not known who controls these so-called ~resurrected~ and it is during one of these skirmishes that Chrom comes across two enigmatic characters: a masked swordsman who wields a sword incredibly similar to his Falchion and calls himself after the legendary hero Marth, and an enigmatic strategist... whom we personally created at the beginning of the adventure, choosing his gender, appearance and tone of voice. The creation screen is simple but satisfying, and allows us to further identify ourselves in our role as puppeteers since our task will be to fight alongside Chrom and his companions, deciding their every move. Soon, Ylisse's delicate situation will force Chrom and his companions to face a long journey in search of allies and revenge: at this point we stop, because the plot of Fire Emblem: Awakening is so full of twists and turns that every detail it could spoil the many surprises for you. The characters make the story above all, as per the tradition of the franchise: characterized to perfection through an infinite number of dialogues and the beautiful artwork by Yusuke Kozaki, heroes and villains are full of personalities and not just anonymous units to be sent to slaughter. The narration takes place above all through cutscenes and textual dialogues accompanied by very short vocalizations that summarize the emotional reaction of the character; from time to time, however, they also take splendid animated films, fully dubbed, which describe the salient moments of the story. The excellent soundtrack by Hiroki Morishita and Rei Kondoh accompanies it all: the inevitable opening fanfare of the series is just the appetizer of a menu composed of a great variety of melodies - some of which are even sung in Latin, so to speak - who manage to perfectly underline every situation, especially the most epic clashes. The Italian adaptation deserves a final note, undoubtedly one of the best we've ever come across: the quality of texts and translations is always excellent, the characters express themselves in a realistic and convincing way, the nomenclature of objects and skills is faithful and appropriate. In a word: perfect. The 3D effect Not being able to influence the gameplay in any way, the stereoscopic effect is limited only to playing with the general cosmetics: ironically, the result is impeccable. The superimposition effect of menus and boxes is pleasant, but the best result is contemplated in battle: the visual complexity of the maps is even more convincing, especially in the presence of animated elements or elements placed between the units and the player's eyes, and the sequences combat animations manage to be even more spectacular thanks to thea combination of 3D and framing. Sword wins over ax... ... ax on spear and spear on sword. The entire combat system of the franchise is based on this very simple Chinese morra, deepened over the years by the introduction of new mechanics, classes and weapons. Archers are deadly against flying units such as Pegasus Knights while Great Armored Knights scoff at edged weapons but would do well to stay away from spells and hammers. The wizards? They're made of tissue paper, but they can attack from a distance and hurt like hell. Fire Emblem: Awakening from the very beginning also introduces hybrid races, such as manakete and teguel, and within a couple of missions, a few pages of tips explain the basics and main mechanics of combat and management of each unit. Learning to play is very simple, becoming an expert will take dozens and dozens of hours. And yet, despite its more or less obvious complexities, Fire Emblem: Awakening is the most accessible and user-friendly title in a series famous for its deadly level of difficulty and the most obnoxious permadeath system in the history of video games. The Intelligent Systems guys thus found themselves at a crossroads: on the one hand there was a wider and more modern audience that would have turned up their noses if they were told to start a mission over after forty-five minutes for a miserable mistake evaluation; on the other, a host of fans ready to fight if they distanced themselves from a tradition that has lasted for twenty-three years. The solution? Satisfy both factions with two basic difficulty levels, a third for sadomasochists and yet another, secret, for those who believe they are more cunning than Light Yagami. The first two difficulty levels, on the other hand, are the perfect compromise: one allows saving during battles and brings defeated characters back to life, the other does neither to the delight of purists. Having filed this dilemma, we find ourselves faced with the classic Fire Emblem, with the player's army and that of the enemy acting in turn on a squared battlefield. When two units interact, the scene changes from a bird's eye view and two-dimensional sprites to a sequence that represents the actual clash between the characters involved. In this case, Fire Emblem: Awakening completely abandons the two-dimensional graphics of the previous portable iterations in favor of a polygonal engine reminiscent of the one already seen in the episodes for GameCube and Wii, embellished by the typical, well-kept and exaggerated attack animations. The care taken in the creation of the battlefields and polygonal models is evident, above all because the lower screen of the Nintendo 3DS allows us to manipulate the scene: we can interrupt it, speed it up, pause it, choose the type of shot between dynamic, fixed and even in first person. The options menu also allows you to further customize the way we want to watch the fights, perhaps by disabling those of certain characters rather than all of them. In short, from this point of view, great strides have been made to meet the needs of every type of player, even those who would like to see different weapons in the hands of their heroes, depending on the object in question. In short, the developer seems to have really thought of everything. The game of couples Upon reaching the tenth level, almost all units can use two particular items. The Supreme Seal allows you to evolve the class of the unit in question, transforming it into another of your choice between two specifications: the Knight, for example, can transform into a Grand Knight or Paladin; the Special Seal, on the other hand, allows you to completely change the class of the unit, perhaps transforming a Wizard into a Warrior. The reason is simple, and it's all based on the special skills that each class learns at certain levels: when you change or evolve the class, the unit in question restarts from the first level, while maintaining the statistical bonuses and previously learned skills and learning new ones at the right time. Theoretically, each unit can learn almost all the skills of the game, but can only equip five of them at the same time: in short, for strategy lovers, an infinite number of possibilities opens up which at the lowest difficulty level may even appear irrelevant, but when come to terms with permanent death become nothing short of crucial. Skills are also central to the Support system, which serves a dual purpose: essentially, units fighting next to each otheror to the other, or combined in the same box thanks to the Duo system, they make friends, and their relationship evolves gradually through nice dialogues; moreover, in the case of units of the opposite sex, this friendship can turn into love and marriage. Support, therefore, determines whether a unit will defend another or attack the enemy together with it, it also guarantees very useful bonuses to the various statistics of the character in or under attack. Marriage, on the other hand, generates a child who will inherit the skills of the parents: in other words, just like the '96 chapter for NES (Seisen no Keifu), Fire Emblem: Awakening also hides a real management system that allows the player more forward-thinking to create his own characters and, consequently, the perfect army to face every threat. The variables are innumerable and in this sense one feels practically spurred to start a new game to discover every Support dialogue and every consequence of all the possible relationships between the dozens of characters in the game. And if you're wondering how it's possible for the children of the protagonists to fight with them, just know that you won't send children or babies to war... and we just can't add more. Additional content Since a main campaign of about twenty hours with two endings, a dozen optional missions, four difficulty levels and an avalanche of variables and dialogues to discover in several games seemed like a small thing, the guys from Intelligent Systems also found the time to prolong the experience with a generous amount of extras. Might as well start with the weakest one, the local multiplayer mode, which is actually a kind of turn-based cooperative mode where you control a team of only three characters per player. A little useless, but we think we can not lose sleep over it, especially if you consider the side dish. The StreetPass system allows you to save a personal team and send it to another player, who will see it appear on the game map: at that point he will be able to buy the special items on sale, face the first player's team or recruit his avatar in his own army. The SpotPass system works in much the same way, but for fans of the series it is a real treat: in addition to being able to download bonus items, special bosses for coop mode and a series of unpublished optional missions - also called Appendices - which in addition to those normally unlockable by completing the various chapters of the main campaign, it is also possible to download extra characters who will appear in random points on the map just as if they were random encounters. They are the main protagonists of the previous Fire Emblems, from Roy to Marth via Eliwood, Ike, Micaiah, etc., accompanied by teams that imitate the supporting characters of the corresponding games. By interacting with these characters, you can buy the excellent items for sale in their special shop or engage them in combat to recruit them. This real heart sinking for fans is cemented by various DLC maps which unfortunately we were not able to download and play in the European version during our test: we will therefore have to wait a few weeks to be able to buy the various extra characters and related missions bonuses.", "date": "2013-03-29", "grade": "9.6"}