{"name": "Universi da camera", "ref": "https://multiplayer.it/recensioni/116572-terraria-universi-da-camera.html", "text": "If you think of the indie world and a miracle there is not only Markus ~Notch~ Persson and his Minecraft, you have to learn new names. Those of Andrew ~Redigit~ Spinks and Finn ~Tiy~ Brice, the members of the tiny Re-Logic team and authors of Terraria, the 2011 phenomenon that really has a lot in common with the Mojang masterpiece, but not too much. For many, this title is considered a two-dimensional Minecraft with Japanese role-playing sprites, and as a summary description we must say that it would fit quite well, however the work of Re-Logic knows how to walk with its feet to go far. The goal is the golden world of consoles, the business card after two years is a roundup of new features to justify a far from indifferent expense (about  15). Let's find out together if this edition is able to earn a place of honor in the catalog of Live Arcade and PSN titles. Fast clouds Once the game has started we are asked to customize our character, from gender to haircut, to the color of clothes. Already from this phase we are introduced to the graphic style, clearly minimal and pixelated, which inevitably recalls the old RPG productions of the sixteen bit era. The side shot instead brings to mind the glorious school of platformers, an element that, although not focal, is strongly taken into consideration by Re-Logic. Terraria is undoubtedly a sandbox game based on the collection of materials and the wildest crafting, just like Minecraft, from which it also shares the randomly generated world and the day-night cycle that leads to nasty surprises once darkness falls. If during the day the settings are populated by creatures called Slimes, by night we lose count of the itinerant pitfalls capable of jeopardizing our hero's life, starting from the inevitable zombies up to the disturbing eye of Cthulhu, a gigantic eyeball bloodthirsty. The protagonist has only one attack available, so it is essential to build ever more powerful weapons and armor, but above all to exploit the free manipulation of the environment to build a shelter capable of defending it from enemy attacks. A notable vertical development is also guaranteed through the possibility of digging ever deeper caves, after lighting with torches. As you may have already guessed by thinking (and playing) of Notch's older brother, there is no real purpose other than to tickle the sense of exploration and your imagination, the only real limit of the game. From the personal to the living room The console version of Terraria presents an interesting series of innovations compared to the PC version. To begin with, a completely new and rather exhaustive tutorial has been included (there is also a linked objective, watch out!), totally absent in the original, a lack that forced you to consult the network to understand certain mechanics. In this case we are dealing with a decidedly more user friendly package, but Re-Logic didn't stop there, adding new monsters, items and armor, and redesigning the crafting interface for pad commands. The possibility of facing the adventure with other human players has also been included, locally through the split screen, while the online functions remain unchanged, to be absolutely exploited since the bosses are structured precisely to be faced in a group. From what has been read so far it seems that Terraria is a carbon copy of Minecraft, but it is not quite so, since the Re-Logic product is more oriented towards traditional mechanics related to platformers and role-playing games, and in some ways it even manages to be more incisive in certain respects than Notch's masterpiece. Primarily due to the presence of NPCs that make the experience less individual, due to the greater importance of the fights in the game economy and a lower severity in the event of the death of the protagonist, in fact on this occasion we do not lose all the painstakingly accumulated equipment. Another factor to take into consideration when comparing the two products is represented by the possibility, as mentioned, of digging underground to look for caves and dungeons full of treasures. In this case, however, the possibility of using the hand torch is really appreciable, whereas in Minecraft it was forced to hang it on the walls to illuminate the surrounding area, an eventuality in any case also contemplated in the Re-Logic title. Xbox 360 goals Terraria offers 30 objectives for a total of 400 player points, many linked to the defeat of the bosses in the game, but to get the juiciest ones you need to invest countless hours in the creation of objects and armor, get ready for a considerable investment oftime, good luck! Go with the pixels Just like Mojang, Re-Logic relies on a free lance composer for the music, Scott Lloyd Shelly and his Resonance Array, a very eclectic artist who has tried to harmonize with the graphic style of the product. The effort translates into an interesting contrast between orchestral arrangements and the use of analogue sounds, with an abundant presence of retro synths and references that will make the heart beat really hard for the more seasoned user. The general mood is much more extravagant and less intimist than Minecraft, unfortunately also less memorable. Graphically Terraria is aimed at a very specific niche of users, that is all pixel art enthusiasts and nostalgics of the old two-dimensional school. The wave of memories, however, is not sufficient to justify an approximate technical realization lacking in details. The animations lack frames, the characters are tiny, the backdrops static, the jumping is horrendous and the scrolling is practically unusable until the game loads all the assets correctly. The screen is then pervaded by a really excessive blurring effect, probably to soften the pixel angularity, but on a TV it's not exactly a pretty sight, a feature that at least aesthetically resizes the Re-Logic production. If it is true that the dress does not make the monk, we are not in a price range that allows the aesthetic aspect to be left totally in the background. The product betrays the strongly indie nature and the low production values of a studio made up of only two people, it probably wouldn't have been a bad idea to get help from some external studio for this console incarnation, like Mojang did for Minecraft.", "date": "2013-03-27", "grade": "8.5"}