{"name": "Winter Ember", "ref": "https://multiplayer.it/recensioni/winter-ember-recensione.html", "text": "The stealth video game genre isn't particularly healthy in the AAA arena. We certainly have high-level products such as The Last of Us, which however do not make stealth their mainstay, but use it as an alternative approach to the direct one. If you are looking for a real stealth game, nowadays the public has to focus on Hitman, which has not surprisingly achieved great success. The rest of the panorama, however, is stained by small failures, such as Dishonored, which has not really managed to conquer the general public, but also Deus Ex Mankind Divided, which seems to have denied any possibility of seeing a sequel to the Square Enix saga. It also seems useless to mention titles such as Metal Gear and Splinter Cell, which are constantly at the center of rumors and nothing more. It is from the indie field that more proposals arrive and, starting from April 19, 2022, there will be one more: Winter Ember. In this stealth adventure, the watchword is to exploit the shadows and the multiple resources at our disposal to get the better of the environment and enemies. To find out if the Sky Machine Studios game has convinced us, all you have to do is continue reading our review of Winter Ember. Artorias Arthur Artorias fights in the shadows in Winter Ember We are the young scion of the Artorias, Arthur, a wealthy family who was erased from history eight years earlier. Mysterious killers have decimated our family and set our house and us on fire. But luck assisted us and we survived. Now, we must find answers and above all revenge. Arthur then returns to his home, to his city, which has changed enormously over the years. A new cult has seized power, and the background to the destruction of the House of Artorias is darker and more complex than initially anticipated. The plot of Winter Ember is convincing and will be one of the main reasons why the player will want to continue within the adventure. Above all, it will always be pleasant to reach a focal point of the plot, as these are told through animated cartoon-style scenes. It is a particular and pleasant choice, given that they are made with care after all. Winter Ember isn't a story-only game though. There is no shortage of small secondary missions, which however tend not to surprise either as a playful structure or from a narrative point of view: these are small distractions that give us the opportunity to obtain some additional rewards, always very useful. It's also a little funny that Arthur, who has become a thief and a ruthless murderer, wastes time helping a lady who is asking for help because she has had a necklace stolen or decides to run across the city in search of a noble's suitor, who clearly he wants to steal her inheritance. However, the player will always have the opportunity to loot, even stealing in front of the face of the owner of the house he entered, who will not bat an eye, so every question mark on the map will always become of interest. The loot can be sold for money, which allows us to buy resources, treatments and more. Arrows, lock picks, dagger Arthur can use various arrows in Winter Ember But let's talk about the heart of Winter Ember, its gameplay. As mentioned, we are talking about a mainly stealth game. There is also the possibility of facing threats head on and, in some situations, it is even an obligation. Unfortunately, the combat system is not well done at all. Basically, Arthur can perform simple attacks, one after another. The enemy can position himself in a parade, which must be shot down with a charged shot followed by a combo. The problem is that the controls are often unresponsive and get stuck. The game doesn't always recognize the pressing of the button and the charge doesn't start, making us lose the ~turn~ of the enemy's guard, who can then start attacking us while we do the combo. At minimum difficulty, if you have many treatments available, it is also possible to fight a few fights to get beaten up without too many consequences, but at high difficulty, death is around the corner after a few hits. There is dodging and parrying, but these are tricky moves to use effectively. This becomes even more complicated with two or more enemies. Not only because we are clearly surrounded and suffer more damage, but also because the attack system is based on an automatic lock-on: it is the game that decides, based on our position, who we will attack and if we have two enemies in front of us. as soon as we parry or break the guard on an enemy, the crosshairs move towards the other opponent. Winter Ember is a stealth focused game and fighting is not an option that many takegift into consideration, so a portion of the public won't find these flaws a big deal. At the same time, the system is clearly badly done and it is not possible not to mention the thing. Winter Ember The real heart of Winter Ember is the interaction with the environment. As we progress through the game we will in fact obtain a series of special arrows, for example arrows with a rope, to create an access point to an elevated place, or electric arrows to activate machinery or impact arrows that allow us to break down fragile wooden structures and create steps. By finding them in the scenario or by creating them, we can access multiple types of arrows, which are also useful in combat. Obviously, there is no lack of the possibility of approaching every situation with an ~aggressive stealth~, that is, taking every opportunity to kill enemies silently. If desired, it is also possible to stun them without killing them: the advantage in this case is that no traces are left and if the unconscious guard is hidden, no enemy will realize that something is wrong. The truth, however, is that the guards tend not to have a particularly large patrol and above all they are not very intelligent. We soon realized that it is always better to eliminate the enemies and leave them where they are, so as not to risk running into the enemy again once he awakens. It is a pity there is not a greater focus on a peaceful approach. Overall, it's the interaction with enemies that leaves something to be desired. As already mentioned, the fights are poorly done and stealth favors indiscriminate elimination. In general, however, even the way in which enemies are positioned is not very interesting. Either they're set up in such a way that it's super easy to get behind them, or they just block the way and push you to take them out directly. You can use various types of arrows to get the better of it, but using the bow is extremely uncomfortable, especially with a controller. Winter Ember features a top-down view and the arc is based on the movement of a pointer, which is controlled with the right stick. Sometimes, even hitting a stationary object can be difficult, resulting in the loss of a precious arrow. The player is not inclined to use them in combat, because the controls risk becoming frustrating. Problems Winter Ember Even out of combat the controls react strangely. For example, there is a roofing system, which allows you to lean against walls and shelters. It's useful for peeking around corners, but awkward to activate. In fact, if you are too close to the wall, it is no longer possible to go into cover: you must necessarily be a certain number of steps away, but obviously not too far. This system should be completely redone. Stealth takedowns of enemies are also a bit awkward, as there needs to be enough space and you need to be in a straight line behind the enemy for the auto-aim system to figure out that that's an enemy and that you can stealthily eliminate. Winter Ember is above all uncomfortable, that's the problem. Interacting with the environment and enemies often takes that second too long to complete and, in a stealth game where a mistake causes a fight to start (unpleasant and very difficult on higher difficulties), it's not pleasant always feeling limited by the commands. Let's also add the fact that the view is far too narrow. The camera distance should have been a bit more generous. In a stealth game we should be weaker, but we should have a lot of information to understand in which direction to go and how to get around the enemies: in Winter Ember instead we see only a handful of steps in front of us. We close the list of problems with one that is not massive but regularly present: the environments are poorly finished and the character often gets stuck against an invisible corner or struggles to walk in a narrow passage (and if you are on an elevated walkway you fall to the ground) . A glimpse of Winter Ember It is a pity that there are so many small imperfections of this type, because the design of the rooms is pleasant. There are often multiple methods of getting into the main plot locations: there are secret passages that require the use of one of many arrows, you can steal keys from enemies to open doors or break them in with a simple mini-game, or you can even complete Dedicated side missions to create an alternate access point. There's no shortage of ideas, but they're kept in check by a product that deserved a little more care: and by this we mean more budget, because that's always the limit. A little more money would have also made it possible to find a better voice actor for the protagonist. Youthey are secondary characters dubbed much better than Arthur, who unfortunately talks too much. Finally, we emphasize that the game is completely in English, even if not of a particularly high level.", "date": "2022-04-18", "grade": "6.8"}