{"name": "Cuore di tenebra", "ref": "https://multiplayer.it/recensioni/116192-starcraft-ii-heart-of-the-swarm-cuore-di-tenebra.html", "text": "Blizzard Entertainment opened the doors to StarCraft II: Heart of the Swarm on the evening of March 11, with a spectacular launch event that lasted over twenty hours. One minute after the official release it was already playable and finally we witnessed a perfect release. In short, the traumatic start of Diablo III is a distant memory. Expectations were high, however, especially as competition in the competitive video game industry is getting fiercer every day. Let's not forget that many of these titles follow the free-to-play model and can therefore be played for free. For this reason, Blizzard had and has the burden of going further and offering a qualitatively better product capable of justifying the purchase. In particular Battle.net, the infrastructure on which Starcraft II relies to offer all its contents, had received various criticisms since its arrival with Wings of Liberty. It was considered lacking in player support options and its graphical interface itself was now becoming dated and somewhat disorganized. Thankfully Heart of the Swarm has radically improved the whole experience, offering a single player campaign worthy of the name and a complete revolution of Battle.net. Playing Starcraft II today is a much better experience than it was just a month ago. Kerrigan is real A few weeks have passed since the events narrated in Wings of Liberty and Sarah Kerrigan has been taken by Jim Raynor to a secret base, where she is subjected to a series of tests to verify her effective return to human nature. The artifact that made this transformation possible has disappeared and in the meantime the Zerg Swarm has fragmented, split by the disappearance of the Queen of Blades. Our adventure begins right in the laboratory where Sarah is studied: after a short mission that introduces the mechanics of the game, we guide her during the escape from the outpost put under siege by the Dominion forces. One of the main novelties of the campaign is the physical presence of Kerrigan in the various missions. It is a special unit with unique abilities that are often essential to successfully completing objectives. As we progress, he gains additional levels and has access to increasingly complex powers. The good thing is that we can change his active skills before each new mission - in fact, taking one implies the impossibility of activating others - but none of these choices is definitive and at the next mission we will be able to modify them freely, adapting them to need. After the prologue, Kerrigan takes possession of the Leviathan, an imposing Zerg creature capable of moving in deep space. From this point of view we must say that Jim Raynor's ship in the first chapter was more complete, with better characterized environments that allowed the player to immerse himself more in the gaming experience. Inside the Leviathan we have only three areas available: the bridge of the ship where you can interact with the secondary characters, the area dedicated to Kerrigan where you can select her skills and finally the Evolution Pit. Within the latter we can enhance the units that we gradually unlock and even make them evolve by completing special levels. In total there are seven evolutionary missions, all very short and with the sole aim of letting the player try out the possible improvements to the individual units directly. Unlike all other previous customization options, evolutions are permanent: once a choice is made, it will remain so for all subsequent missions. For example, as regards the Zerglings, we will be able to decide to evolve them into agile Raptors or into prolific Shamids. The former have the ability to jump on enemies, while the Shamids are generated in groups of three. It is good that the possibility of trying the two versions is offered before the actual choice, unfortunately, however, these side missions are very similar to each other and not properly characterized. The campaign in total still has twenty main missions, to which are added the seven mentioned above. Being an expansion, the proposed offer turns out to be adequate and its overall duration is good. Except for the evolutionary missions, the others are interesting and the more classic ones that involve the construction of a base and the formation of armies alternate with those where we directly control Kerrigan or other special units. Cutscenes and high-definition cutscenes complete the single-player package to perfection. In short, those who enjoyed the Wings of Liberty campaign will not be disappointed.Perpetually at War In addition to the campaign, StarCraft II: Heart of the Swarm brings a whole series of innovations expressly dedicated to the multiplayer environment. For each race, new units have been introduced and in total we will have seven more available than in the past. The Terrans see the addition of the Hellbats, a transformation of the Hellions useful for dealing with melee battles, and the Mina Widow. The Protoss have the Mothership Core, the Oracle, and the Tempest. The Zerg can now field the Swarm Host and the Viper, a particular unit capable of drawing in enemy forces and thus wreaking havoc on opposing deployments. In addition to this, a new progression system makes its appearance: players gain experience in the various modes for the race they are playing. Each unit created or destroyed provides points which will then be awarded at the end of the game. In total there are 30 levels for each of the three races, 90 in total, by obtaining which a whole series of portraits, emblems, new unit graphics and special animations are unlocked. We can consider it a complementary system and in part a substitute for the classic companies, which is able to provide a reward even in the event that we lose the game in progress. In fact, obtaining experience is independent of the final outcome of the battle. It remains to be seen how fast it will be to get to the top level, given that once this goal is achieved, there will again be a possible lack of stimulation. It is difficult to imagine an indefinite expansion of this system with the continual addition of new goals; we'll see how Blizzard develops it in the future. For the moment we can only consider it a positive and interesting addition. Likewise, the new units for multiplayer will require some balance polishing, but considering the excellent support provided in the past to Wings of Liberty we have no doubts that the game will continue to be very competitive and a point of reference in the esports arena. . Battle.net 3.0 and beyond StarCraft II: Heart of the Swarm went way beyond that and fundamentally changed Battle.net. After years of requests from players, Clan support has finally arrived. Now we can get together with our friends in a group, choose a name, a tag and have a private chat available with an internal news system. Nothing surprisingly groundbreaking, but definitely a long awaited feature. In addition to this, the Clubs also make their appearance, a system similar to that of the Clans, however intended to bring players together around specific activities, interests or prominent figures within the community. Like commentators and professional players. All the access menus to the various game modes have been revisited and the Battle.net graphical interface has undergone an overall lightening. Information is shown more clearly than before. Blizzard has also tried to solve one of the main problems of Wings of Liberty, the lack of a proper guided transition between the campaign and the online battles. For this reason, some specific training missions have been added that gradually and in a guided way introduce multiplayer and all the actions that we will commonly have to perform in each game. Once this first introduction is completed, skirmishes are proposed in which we will challenge different levels of Artificial Intelligence. The icing on the cake is the possibility of playing unranked games that do not affect our position in the official ladder and allow us to play more calmly, with less pressure. All positive changes that make access to the multiplayer mode more gradual and above all add new game options in addition to the classic ranked matches. Technically we are dealing with a respectable product. The high-definition movies of the campaign and the cutscenes between the various missions have been the reference standard for years for the entire industry of the sector and Heart of the Swarm continues on this path. In the same way, the physics of the game has been improved: when we destroy an enemy unit or a building we see more accurate and realistic effects than in Wings of Liberty. Also making its debut is Global Play, the ability to access any region's multiplayer ladder while playing in your own language, and a whole new set of technologies that make it possible to watch a replay of a match with your friends right at the inside the game. Small additions that help complete the offer and in the complete adds depth to the entire Starcraft II experience.", "date": "2013-03-19", "grade": "8.7"}