{"name": "Una citt per giocare", "ref": "https://multiplayer.it/recensioni/116190-lego-city-undercover-una-citta-per-giocare.html", "text": "As was already known before the actual release of the console on the market, the months immediately following the launch of Wii U were rather stingy with exclusives, leaving Nintendo console owners in the position of having to satisfy their gaming hunger only with conversions and titles cross-platform. To interrupt this diet, TT Games thought about it with its new product focused on the LEGO universe, choosing the Nintendo console as the sole destination of a title that leaves behind the (atypical) tie-in past of its predecessors to throw itself in an unprecedented sandbox context a la Grand Theft Auto... Brick by brick In LEGO City Undercover, you take on the role of police officer Chase McCain, returning home after a forced exile only to be told that dangerous criminal and archenemy Rex Fury is on the loose again: it is obviously up to our hero to hunt him down and put him back behind bars before the city is overwhelmed by the escalation of crime, in a style, however, radically different from all the stories similar to this one that have already been proposed a thousand other times by films, series TV and video games. In a way not dissimilar from their previous works with the LEGO brand, the developers of TT Games enjoyed making fun of the subject of the story, this time with the added value of not being tied to any film franchise: here, therefore, is the story basis of the game not only serves as a glue between one mission and another, but also and above all as a background for a constant series of gags that exploit parody in equal measure - both gross and extremely subtle and refined - and the self-irony of a scenario entirely composed of plastic bricks. The result is a product that, from this point of view, proves capable of entertaining the widest possible audience, from younger players who will enjoy watching characters act in a funny way and crashed vehicles literally lose pieces on the road, to users adults who will surely let go of a few laughs listening to the jokes of some supporting actors or recognizing tasty quotes from Titanic, Matrix, Starsky and Hutch and many others. A universal appeal of which the gameplay of LEGO City Undercover can also substantially boast, albeit in different ways. Not having to be based on a pre-existing universe as in the previous titles dedicated to Star Wars, The Lord of the Rings and company, the developers of TT Games were able to indulge themselves with an open world that winks at Grand Theft Auto, therefore consisting of a generously sized metropolis vaguely resembling San Francisco, with thematic districts and even peripheral areas in which urban planning gives way to nature. The main difference compared to the Rockstar series lies in the total absence of any tinge of violence: pedestrians dodge the passage of vehicles, accidents are liquidated with jokes on the costs of insurance, and even the drivers forced by Chase to give him the wheel agree to willingly, sometimes even taking a seat in the passenger seat. The city itself has also been conceived as a real playground in which it is a pleasure to get lost wandering around, full of LEGO tokens to collect, secret bonuses to discover and mini-games to activate. Particular relevance in the exploration phases is covered by the Super Bricks, hidden almost everywhere and capable of increasing the calculation of this particular type of currency in the player's possession by thousands of units in one fell swoop. Even in the driving phases, the user is encouraged to have fun with the elements of the scenario, since knocking down structures such as light poles, road signs, bus shelters and so on activates a multiplier which increases the accumulation of bricks and which it even grants a temporary invulnerability of the vehicle when raised to its maximum level. It is an almost childish form of entertainment, which nevertheless works great despite the fact that the game does not offer particularly attractive rewards for the most attentive collectors. The LEGO tokens are used only to unlock new skins to be applied to the protagonist or to buy cars that can then be recalled at any time from the appropriate stations scattered throughout the city; the bricks, on the other hand, are spent to assemble the so-called Super Constructions, large works made of LEGO which serve minimally as fundamental elements to continue the adventure (as in the case of bridges or ferries) and otherwise give small advantages in the scenario exploration process. Nothing to rip forin short, yes the hair, also considering the lack of a multiplayer mode through which to show off one's trophies: despite this, resisting the temptation to collect all the tokens and bricks that happen in sight is practically impossible ... The dress makes the monk If the adoption of an open world setting is the most important novelty of LEGO City Undercover, when it comes to real missions the game returns to the path traced by the previous works of TT Games: during the various investigations by Chase that mark the progress of the story, the user will find himself engaged in more limited scenarios such as prisons, caves, temples and so on, within which the achievement of the objective of the turn passes through already known mechanics. Exploration plays a fundamental role again, together with the consolidated practice of destroying certain objects to use the LEGO bricks that arise from them in order to build a structure essential to advance. The game does not disdain frequent excursions into different genres, peppering the levels with platform elements, environmental puzzles and even hand-to-hand combat with a counter system inspired by that of Batman: Arkham City: the end result is captivating and non-trivial, whose general pleasantness allows you to quietly overlook the extreme superficiality of all the facets of which it is composed. An assist to the variety then comes from the incredible transforming skills of Chase, capable of changing clothes with a simple pressure of the back buttons: there are eight costumes to unlock during the adventure, all customizable at will by the player and exclusive bearers of different ability. Here, therefore, that in his standard policeman's uniform, Chase is able to read the clues with his scanner and to use a grappling gun, wearing the clothes of a miner he can destroy rocks with a pickaxe and use dynamite, while his dressed as a thief allows him to pick locks and open safes. TT Games did not miss the opportunity to exploit this playful expedient to give life to a totally accessory form of backtracking and which therefore is not in any way annoying or forced: it will therefore be up to the tastes of each individual user to evaluate whether to replay the missions already completed to get 100% thanks to the new costumes or whether to beat the city inch by inch to find that inaccessible point without the ability you just conquered. As is evident, it is a choice that substantially affects longevity, destined to go well beyond the 10-15 hours necessary to complete the main story if one decides to ~waste time~ with the mammoth amount of objects to collection of which the title is stuffed. Competent in terms of gameplay, LEGO City Undercover carries out an appreciable job also from a purely technical point of view, showcasing well-kept scenarios, full of destructible elements and capable of even giving discreet glances over long distances, with the only drawback of some occasional hiccups in the frame rate. Stylistically, then, the game is a real delight, and it's hard not to smile at the look of the various characters and some of their animations, not to mention the little touches of class like the cars that lose bricks and dismantle as they suffer of accidents. A positive mood to which the music also contributes, skilful in mimicking the characteristic themes of crime films and which always effectively punctuate the action on the screen. A series of good qualities that does not in any way justify the very slow loading that afflicts the software, which is particularly tedious in passing from one mission to another and which the developers have not even tried to remedy by scrolling useful information or images on the waiting screen. Finally, let's talk about how LEGO City Undercover takes advantage of the Wii U GamePad, assuming that it is not possible to play on the controller screen: the touchscreen is in fact occupied by the city map, and with simple touches you can set destinations, open menus containing statistics and news of various kinds and answer the video calls of the secondary characters. The display also acts as an interactive catalog when it comes to selecting the items to buy or the vehicle you want to drive, while it only becomes an active part of the gameplay on occasions when you have to lift it towards the TV to use it as a scanner or machine photographic. In short, it is certainly not the product of TT Games that is destined to expand the boundaries in the exploitation of the scontrol system of the Nintendo console.", "date": "2013-03-19", "grade": "8.0"}