{"name": "Cattivi risvegli", "ref": "https://multiplayer.it/recensioni/116128-dead-space-3-awakened-cattivi-risvegli.html", "text": "Received with rather mixed opinions, the third iteration of the Visceral Games saga is one of the most controversial. Starting with decidedly horror and intimate flavors, the sci-fi series has incorporated heavily action ingredients into the formula, magnifying the spectacular at the expense of the scary factor. Dead Space 3 is the culmination of this concept, a production constantly poised between the desire not to betray old fans and pack a real blockbuster in step with the times. So much so that the game was literally divided into two almost antithetical parts, from the narrow corridors of the space wrecks to the frozen expanses of Tau Volantis. A feature that led to a long campaign full of different situations, without excluding the presence of online co-op, obtained by placing a new character alongside the historic protagonist Isaac Clarke. A lot of meat on the fire for an impressive production, an effort rewarded in Giorgio Melani's review. After a long series of (discussed) micro transactions functional to make life easier for the player, the turn of the first real expansion of the title has arrived. Dead Space 3: Awakened does not play only on the name to look for similarities with the previous Severed for Dead Space 2. Also in this case it is a small campaign of about two hours that goes backwards through the main one, but instead of telling a parallel story, Visceral has decided to offer us an epilogue capable of acting as an antechamber to the next inevitable chapter. Endless nightmare In essence, the story of Awakened picks up exactly from the ending of Dead Space 3, a feature that obliges you to have finished the base game in order not to ruin the story. We will take this for granted in this review, otherwise read on at your own risk. Isaac and Carver miraculously survived the impact of the necromorph moon on Tau Volantis, after realizing the situation they begin to organize themselves to leave the planet and return home. The situation precipitates after a series of hallucinations involving both characters, the voice of the Mark manifests itself again in Clarke's head, just like in the times of the Sprawl, unleashing a new necromorphic invasion and making escape highly problematic. After recovering an abandoned shuttle from the fanatic Jacob Danik, the two find themselves forced to return to Terra Nova, the gigantic spaceship in orbit over Tau Volantis, unaware of the horror that awaits them. The ship is now at the mercy of a unitologist fringe dedicated to supernatural cults, determined to bring the influence of the Mark to the land. The DLC therefore retraces the campaign settings in reverse, leaving the division of the two parts unchanged, but in a decidedly more concentrated period of time. Visceral seems to want to recover more material from the previous episodes, proposing hallucinatory sequences, many of which are playable, which see Isaac pitted against the evil forces of the Brand. These sections somehow manage to raise the tension, almost to the point of resurrecting the atavistic suggestions of the saga, thanks above all to the use of subliminal images and the contrast of colours. Dreamlike and infernal atmospheres overlap with reality confusing the player's senses, just like the protagonists, representing a pretext for setting up almost surreal clashes. Like the new boss fight, repeated several times, with poor Isaac persecuted by the head of the Sitologists, a terrifying hooded figure who is apparently invulnerable and able to evoke tantalizing links with the Pyramid Head of Silent Hill. Playstation 3 trophies Dead Space 3: Awakened adds eight new trophies for you to proudly display. Unmissable is the one dedicated to the game in Co-op, also present in this DLC, in addition to those relating to the completion of the story. Watch out for some secondary objectives, such as a very particular choice towards the end and the section in the Terra Nova reactor: if you are particularly fast you will be rewarded with a nice bronze! Back to Earth The part set on Tau Volantis is little more than a roundup of fights with all the necromorphs encountered in the main game, including two appreciable additions recovered from the second episode, and represents a sort of frenetic preamble to what we will find on Terra Nova. Here we finally see a reduction of the pace in favor of the atmosphere, with the maps transfigured by the presence of candles, profusion of blood and macabre altars obtained with the bodies of necromorphs. A claustrophobic scenario that will delight those who saw the Visceral saga increasingly purged of horror elements. The idea also serves to ward off the induced feeling of dj vufrom revisiting already extensively memorized environments, although those who haven't completed the Terra Nova's additional missions may enjoy this content more. The hallucinations increase and the presence of text logs paint the deleterious effects of the Mark on the human psyche, in a death spiral in which mysticism and madness reach new boundaries. The feeling of alienation is certainly among the merits of this DLC, even if it lacks the depth of other works which Visceral is clearly inspired by. The story culminates with a cliffhanger that will surely cause discussion, even if called several times in history and even recognizable by combining the initial letters of the titles of each chapter in the basic campaign. It is not easy to assess the legitimacy of the Awakened content, the sensation of a separately sold epilogue is rather annoying, even if the developers have ensured that the DLC was developed by a subsidiary of Visceral in parallel with the base game. A statement that seems supported by several factors: the first is that Dead Space 3 is anything but a short or unfinished experience, the second is the very nature of Awakened, more devoted to horror themes and endowed with its own peculiar balance, despite the brevity. For once, therefore, we believe in the good faith of the programmers. The most thorny issue remains that of the price, decidedly high for the material offered in the two hours necessary to complete it, a time that can go further down if you are not interested in collectibles. The lack of additional weapons and the recycling of already seen settings, even if skilfully retouched, are further elements that could discourage the outlay. Despite what has been written, there is no doubt that Dead Space 3: Awakened will be widely appreciated by the most avid fans of the Visceral saga, a feature that wins our consent, even if with a lower price it would have been a purchase to be recommended without reservations.", "date": "2013-03-18", "grade": null}