{"name": "La terza dimensione della caccia", "ref": "https://multiplayer.it/recensioni/116133-monster-hunter-3-ultimate-la-terza-dimensione-della-caccia.html", "text": "If just a click away we told you about the Wii U version of Monster Hunter 3 Ultimate, on these pages it's the turn of the 3DS version which, just like the other one, is an ~enhanced~ porting of Monster Hunter Tri for Wii, now out three years ago. Confused? And how can you blame yourself! But let's put things in order: the famous Capcom franchise landed on Nintendo consoles in 2010 with the episode Tri (in 2009 in Japan) after driving the Japanese crazy especially with the previous iterations for PSP. To understand the success of Monster Hunter you must first understand the methodical and rigorous Japanese mentality, but this does not mean that the series has not received acclaim in the West as well where, indeed, over time, it has been acclaimed and awaited by more and more fans. In short, by grabbing this brand, the big N could have secured a real international system seller. At this point, however, we must ask ourselves some questions: how does Monster Hunter behave on 3DS? What type of user is this version aimed at? And above all, is it worth going back to killing monsters after having already done it in Monster Hunter Tri? In the following lines we will try to clarify these doubts. Monster Hunter... First of all, it is good to have a small overview of what type of game Monster Hunter is because maybe you haven't read the review of the Wii U version or of the various Monster Hunters already released on PSP; maybe you lived in the rocky mountains or you are aliens from Alpha Centauri who are spying on us to understand our customs and traditions before conquering the Earth. In short, if you don't know what Monster Hunter is, it is easy to say: it is a simulator of violence against animals. No, it's not true, we're kidding, but there's a bit of simulation since it's not your average action game or the usual third person RPG adventure, although there is a pinch of both. There's no plot, to begin with, apart from the reason that drives you to kill the various monsters (a seaside village in danger, even if it doesn't seem to be doing so badly) and at the beginning it can even feel a bit ' discouraged, practically half naked with a cheap gun, a pickaxe and a barbecue perch. The introductory phase of Monster Hunter 3 Ultimate can last even several hours for a novice who, guided by the advice of the NPCs, will have to learn how to hunt monsters and skin them, collect herbs and mushrooms, catch insects, combine objects, improve the country's resources , cultivate his personal garden and so on. The amount of things to do and items to keep an eye on is exorbitant and when you finally started to get used to the somewhat difficult control system (which, among other things, does not include a lock-on system ) we haven't even met a prey worthy of the name yet, but only herbivores and small predators. And the first encounter with a dragon almost always ends with our character on his stomach. The first games can be daunting, let's be clear, and the defeats really bitter, but then, slowly, almost by magic, a new world opens up made up of tests and counter-tests, experiments with different weapons and armor, minutes spent observing the movements of the enemy to understand when and where to attack, where to find him when he flees, which objects, antidotes or potions it is necessary to carry or combine on the spot. Eventually, the true hunter learns about the terrain and his prey, and there is little gaming-speaking satisfaction quite like knocking out an almost elusive subterranean dragon with a single homemade sonic bomb, making him a helpless target in front of to the power of our brand new two-handed hammer advancing inexorably towards his horns. And in case it wasn't clear: yes, bloody Diablos, we're talking about you. ... 3 Ultimates... As you may have understood, Monster Hunter is not a game for everyone: it requires great patience, dedication and planning. As incredibly exciting as it may seem to face so many different huge monsters, it must be specified that the aim of the game is only one, and that is to kill them over and over again, to obtain the materials necessary to forge new weapons and armor that make our life easier when we will face another monster. In short, it is a repetitive and constant farming of objects, made compelling by the depth of the game system and the various creatures, intelligent (perhaps too much) and full of skills and behavioral patterns to memorize. The repetitiveness and complexity of the game have always alienated the more casual players, preventing them from appreciating every nuance of the enormous fresco painted by Capcom that reit goes out to conquer the daredevils for literally hundreds of hours. Capcom has tried to smooth out this problem with Monster Hunter Tri for Wii, proposing an episode that is much simpler and more accessible than the previous ones, despite the introduction of new mechanics such as swimming and exploration and underwater combat. Ironically, the most ardent fans have criticized the simplification of the content of their favorite franchise, while pledging to dissect every aspect while waiting for a new chapter. The latter saw the light on PSP and PlayStation 3 a couple of years ago, but it hasn't come out of Japanese territories; therefore remedy this new version which, in essence, is a kind of fusion between Monster Hunter Tri and Monster Hunter Portable 3rd. Players will therefore find all the monsters faced in Tri plus all those of Portable 3rd, to which are added some creatures, such as the Brachydios, and brand new variants, such as the Ceadeus with the golden mane, for a total of seventy-three enemies. Compared to Tri, Monster Hunter 3 Ultimate offers all the weapons, including the sword ax seen for the first time on Wii and all the other weapons that weren't on Wii: the bows, the bagpipes, the twin blades and the gunlance. The crossbows have also been revised to make their use and customization more intuitive. Naturally, the increased amount of weapons and creatures translates into a huge variety of new armor and tools of death to build, modifications and upgrades to decide and make to weapons and armor, power foods and so on and so forth. There are also three new areas compared to the Wii version, and about two hundred more missions, divided between online and offline. As if that weren't enough, players now have a new companion to accompany them: Cha-cha, already present in Tri, is joined by Kayamba, and this means, needless to say, new dances and new masks to discover to personalize them. Considering the exorbitant amount of content, it's impossible not to define Monster Hunter 3 Ultimate as the definitive portable version of the franchise. The 3D effect The stereoscopic effect in Monster Hunter 3 Ultimate is one of the best we've had the pleasure of seeing in action on the Nintendo laptop but, as often happens, it stops at the simple aesthetics without affecting the actual gameplay. A trained eye will be able to take advantage of the 3D to better study the positioning of the character against the beast of the moment, but in most cases it only serves to make the various clashes even more exciting. It must be said, however, that the 3D effect tends to dirty the image a bit and on a standard 3DS it makes it difficult to read texts, figures and descriptions. ... for 3DS Okay, we've sung the praises of a game that you either love or hate, that you may like or dislike and that we, personally, really love; we have made it clear that this new version for 3DS (and Wii U, let's not forget) is not a mere port but something more, a real summation, the best of the best that closes a generation in view of the ~revolutionary~ Monster Hunter 4 (always on these small screens, in an unspecified number of months and let's hope it won't be years)... But how does Monster Hunter deal with the new Nintendo laptop? If from a purely technical point of view we definitely cannot complain, given that graphically we are faced with a top-level product that runs constantly at at least forty-five frames per second complete with a 3D effect to embellish its cosmetics, as regards everything the side dish we can only turn up our noses at a series of really unfortunate choices. To begin with, it goes without saying that those who own a Circle Pad Pro will enjoy the experience much better than those who, like us, have played Monster Hunter 3 Ultimate without the additional analog stick: the difficulty in managing the camera using the analog cross or the ~virtual~ on the touch-screen is felt, and often too, and although it is possible to get used to it and not suffer too much from it, it still represents a considerable annoyance, especially during the first game sessions. The combination to enjoy the experience to the fullest is, in short, 3DS XL with its special Circle Pad Pro, there is little you can do. Before moving on to another painful note, which fans or the well-informed will have already guessed, it seems right to us to break a spear in favor of the aforementioned touch-screen, which makes the general experience infinitely more satisfying than the PSP iterations: the interface can be customized in many different ways so that each player can set the preferred layout in a few moments, perhaps memorizing it for future use. You can even transfer the entire interface from the upper to the lower screen and manage the combination of objects on the fly, pressing the icons on the lower screen without opening menus and consulting a thousand lists while dodging tongues of fire and poisonous bullets. Virtually every parameter can be changed at will, and this is certainly a very strong advantage of playing it which confirms the rosy future of the franchise on the Nintendo platform. In this case, the problem, if anything, is the impossibility of enjoying multiplayer by connecting directly to the Internet. It is actually possible to do so, but the procedure is needlessly expensive and complicated: in fact, you also need to have a Wii U and a LAN Adapter, then connect to the standby Wii U and, consequently, to the game servers to be able to join a game where at least one player is playing the Wii U version. Complicated? Yes, quite a lot, and totally useless. Whatever the reasons for this choice, it goes without saying that the experience is nothing short of neutered: the best part of Monster Hunter is going on a hunt for monsters (including some otherwise inaccessible) with three other friends and collaborating to roll them out, celebrating together each new weapon or armor forged. Since this component is missing, unless one lends itself to the complicated procedure described above, the 3DS version of Monster Hunter 3 Ultimate is severely penalized. It is possible to play it alone, mind you, or to connect locally to three other 3DS or even to a Wii U but, in the absence of these alternatives, to fully appreciate the multiplayer mode of the franchise, Western 3DS owners can only wait for Monster Hunter 4 and already confirmed online support.", "date": "2013-03-18", "grade": "8.5"}