{"name": "Un nuovo sindaco", "ref": "https://multiplayer.it/recensioni/115833-simcity-un-nuovo-sindaco.html", "text": "After ten years you can't come back, kick in the door and yell, ~hey, I'm home.~ Other loves will have passed, new passions and interests will occupy the days of those who are left behind. Ok, someone hasn't forgotten you and still remembers you in your full splendor, but for all the others a decisive blow in the sponge is needed. Affected by the launch of SimCity? SimCity does exactly that: it returns after a long time abandoning a legacy that would have required an increase in variables and therefore complexity, with the risk of being anachronistic. Don't get us wrong, the fourth chapter of the original series has been loved, modded and played endlessly, but today the hardcore audience is not focused solely on PC and it is necessary to try to draw from a wider pool if you don't want to go multiplatform. SimCity tries to speak to those looking for a complex and innovative product, succeeding in part. The Tilt Shift effect works wonders up close But it is also aimed at the heterogeneous audience of The Sims and in general at all those who do not want to give up immediacy, aesthetics and social features. Succeeding very well in at least two of these three specific aspects. The compelling and at the same time dramatic thing about the game's early days is that Maxis' willingness to speak to as wide an audience as possible has been enormously successful, at the same time causing a flood of technical problems from which one is slowly recovering. Servers and connections aside, is it worth buying? The answer is largely yes, although some clarifications are necessary. Under the eyes Glassbox Engine is the name of the SimCity engine, the operation of which governs the entire experience and gives the tare of how similar this chapter is but at the same time different from the previous titles in the series. Previously the player observed and interacted with a representation of what was calculated in the background, the city was an animated staging of spreadsheets and equations. Now every sim, commodity and useful value for the simulation is represented and processed on the screen: the streets are the arteries through which everything moves and on the edges of which each building must be placed, also acting as conduits for resources, waste, energy and so on. As a side effect compared to the past, the planning phase, which for example required attention in order to avoid having problems with the management of underground pipes, has been greatly streamlined. The GlassBox Engine allows enormous imagination in the design of the city... SimCity is a more modern and immediate game which, let's make things clear right away, sacrifices part of the simulation depth in favor of an experience geared more towards fun and immediacy. Not that this is a negative at all costs, simply those who want a super hardcore city building will be disappointed. A logical approach makes it possible to administer a town with the reasonable certainty of never or almost never having insurmountable problems, so as to be able to devote oneself to the growth of the city. A bit as if it were a highly evolved electronic LEGO. The size of each map, roughly like the medium-sized ones of the past, and the impossibility of accessing tools for modifying the morphology of the terrain are other elements that distance themselves from the originals and which we hope will be resumed in the future next. ...although the classic grill is possible The remaining systems, on the other hand, are familiar to veterans who once again have to decide for what specific purpose - between commerce, industry and housing - to reserve a certain space, seeing different sims converge according to the value of the land. In this sense, the true masterpiece of the game is the immediacy with which it introduces the mechanics and the effectiveness of the interface, which abandons the temptation to insert redundant commands and places every action, graph and option where it is expected. In just a few minutes, the new road editor, through which you can draw any shape without limitations, allows you to create complex plans with just a few clicks from the very first game. Simulated world The typical SimCity game is divided into two main moments. Choosing a map, selected reflecting which resources you want to have underground or which position guarantees greater value to the buildings that will be built there, the roads must be traced and then the structures necessary to guarantee basic services must be installed: water, electricity, waste disposal but also the police, firefighters and healthcare. Administering these systems is a game-long process, increasing in complexity as the population grows. TOThere will come a time when the traffic problem will have to be tackled by guaranteeing citizens public transport, whether it be buses, trams or even ferries, trains and planes for SIMs coming from the rest of the region. Intelligently managing land values is one of the most complex aspects of the game The same goes for example for education and the building of schools, not necessary but recommended if you aim for a prosperous city. The routine of the good mayor is broken by the installation of special structures that define the specialization - or specializations - of one's inhabited center: whether one decides to focus on tourism, gambling, extraction and processing of resources or trade and industrial production have specific viable paths. Not very many indeed. Moreover, whatever direction one takes, it soon becomes necessary to integrate the new services with other specializations or a strengthening of the basic functions. Focusing strongly on tourism, it becomes imperative to have a well-orchestrated urban plan while those who have the structures to dig the ground to extract metal will take little time to understand the usefulness of warehouses for storage and sale or purchase on the global market. Mining ends when the resources stored in the ground run out In short, every aspect of the game interacts with the others, creating an experience that flows constantly in crescendo. Rather, the desire not to prolong the life of each individual city for too long, already fully functional after five or six hours of play, so as to stimulate the occupation of a new space within the same region and create extra-city interactions. SimCity proceeds, amuses and entertains effectively demonstrating the goodness of the design of Maxis Games. At the same time, however, the simplification of the level of difficulty puts us in the presence of a not exceptional longevity, especially if compared with that of the old SimCities: there is a lot of irons in the fire, don't get us wrong, but we doubt that after creating a municipality for each specialization, tried the sandbox mode and played with friends for a few dozen hours you want to go back to the same content again and again. This fear of ours may be swept away by the modular nature of the title, which lends itself to being integrated with additions of all kinds, and we hope that the post-launch process will be managed intelligently. To the inevitable and already present downloadable paid content, purely aesthetic, we hope other free ones will be added in the form of patches, so as not to break the user base and keep the title alive in the months to come. After all, this is what is expected of a title that can only be played online today. One World Since its announcement, SimCity has been presented as an evolution in city interaction and multiplayer capabilities. A step forward for this kind of experience, in the past already chased by other experiments such as Cities XL. In fact, each city map is located within a larger region that can accommodate up to sixteen municipalities and as many mayors. Regions have different set ups for cities Theoretically, a player can occupy all the spaces by himself but, with the cities remaining in stand-by if the mayor is not connected, the development of the region is greatly slowed down. By playing together, resources can be shared to create great works such as the international airport or the space center, but above all, one's activities and services grow at a rapid speed having a higher number of outlets. Just switch from the city view to the regional one to observe your Sims moving towards a neighbor to enjoy the evolved tourist and commercial facilities, while your Sims move to our place to work in the factories or use the regional buses to come and study in the schools we have so painstakingly developed. Having someone who, for a reasonable fee, lend us their steering wheels or extra garbage trucks means that we have time and resources to spend on taking care of our specialties. It is also interesting how, especially within the larger regions, singular competitions are created: one's own tourist city, for example, happens to see itself drained of visitors if another player sets up a similar but better realized project. The inevitable catastrophes return to upset cities and citizens It is still an asynchronous multiplayer, with very limited direct interactions, but all in all the idea works and represents a large part of the long-term appeal of the game. It's worththe speech already made for the development of the single city: to date certain elements, especially the number of specializations, do not seem to guarantee a stellar longevity. Even major works on a regional scale are a bit of an end in themselves and do not open up all the new possibilities one would expect. Collaborations and local competitions between players are actually only an intermediate outlet, because Maxis with the name of SimCity World identifies a complex system of rankings and challenges to test the efficiency of one's project on a global scale. When activated, the first challenges will ask to attract a large number of citizens in a short time or to create a commercial network capable of exchanging a certain number of resources with the global market. But there is no limit to this kind of initiative, in which we look forward to taking part personally. Unfortunately at the moment these and other functions, such as the articulated leaderboard system, have been deactivated due to the same problems that have made it difficult to use SimCity in a convincing way since the American launch. Do you need water for the new nuclear power plant? Just ask a neighbor The disconnection and lag problems are slowly disappearing but limitations remain, such as the one to scroll the time at the maximum speed allowed. The slowdowns are mainly due to the player load, apparently unexpected, so much so that the improvements are occurring simultaneously with the increase in servers. The decision to impose a permanent connection, required a little to facilitate data management and a little certainly also to stem the piracy problem, had already been the cause of enormous discussions at the launch of Diablo III and once again struck : it is the taste of a trend that in the future will only take more and more ground, especially among the so-called triple A productions and not only on PC. In short, let's get ready, because the discussions generated in recent months will continue for a long time to come. Animated model Visually the work done by Maxis is really good. Even without resorting to who knows what effects or advanced techniques, the combination of a hyper-saturated palette and the tilt shift effect give the perception that the city is a sort of interactive animated model. As the density increases, you can observe the sims opening construction sites, assembling the scaffolding and building ever-increasing buildings. The game has undeniable visual qualities, even up close The evolution of buildings, triggered by population growth, land value changes or player intervention, is convincingly represented by a number of different models. Even the decision to make the buildings of the services modular, with new departments or blocks that expand hospitals, schools and police districts, has a positive impact on the visual experience as well as making the playful one immediate. Too bad not having any map editor, because with such a pleasant overall rendering it would have been even more rewarding to be able to work on the ground to create customized scenarios. Having already spoken positively about the interface, we can only repeat ourselves for the high number of information graphics available, in some cases even more beautiful than useful. Buildings and models adjust by themselves as you use the terrain to lay out roads and railroads Overall, SimCity is the perfect title for anyone who wants to take a large number of screenshots; as indeed those who embellish this page, taken by the cities and regions played in recent days, can testify. The music is also interesting, which varies depending on the view in accordance with what the player is observing at that instant. As far as optimization is concerned, with the test configuration we had no problems playing at maximum detail without encountering huge slowdowns. Fluidity problems that instead seem to arrive, even if it depends on the moment and to a lesser extent in the last few days, due to the clogging of the servers which have given many headaches. Online drama A bit like Diablo III, the request for a permanent line and the post-launch problems are a considerable nut to crack. Also for those who have to review the game. Quantifying a similar problem during the final evaluation, which can end at any moment, is not easy and for this reason we have chosen not to consider the connection problems of the first few days in the vote. Nor for the same reasons the request for a permanent connection itself. There remain defects and pre-requisites to take into account before buying the game, which can ra", "date": "2013-03-12", "grade": "8.0"}