{"name": "After Us: la recensione di un ottimo platformer", "ref": "https://multiplayer.it/recensioni/after-us-recensione.html", "text": "After Us is a great platform game. It's versatile, accurate, creative in level design, and very forgiving when it gets wrong. It could have been a great platform game were it not for the plethora of clichs on the theme of environmentalism with which it has decided to populate its levels. There is a need for titles that raise awareness of environmental problems, but in our opinion not so, because an overly simplistic approach takes the whole debate back by years. Developed by the Spaniards of Piccolo Studio, this game has a noble mission and tells its story with very scenic levels to see, very fluid to cross and with the right amount of collectibles for those who want to explore the proposed locations even more. The plot has its why as well as the progression which immediately makes clear the commitment required by each level and by completing the game, which took us about 15 hours. The only real problem (apart from some sporadic slowdowns and a single crash) is that, as far as he has chosen to talk about the environment, this title seems to be stuck in 2008, the year Wall-E was released. In this review of After Us we will tell you about the many ways in which this game can entertain you thanks to its excellent platforming system as long as you can bear a few too many moments in which the blame for the destruction of the Earth is all unloaded on individuals , called devourers, guilty of consuming too much. Accurate and fun platforming In After Us the tools available are many and varied but above all they make the exploration very fluid, fun and not very punishing Before talking about the subtexts we need to look at the substance and After Us is, undeniably, a good 3D platformer. In fact, during the first two levels, the player has access to all available skills and is thus free to explore the game levels as he sees fit. There are bridging sections that require the use of specific talents, but otherwise the exploration is very fluid and fun. It also helps a lot that there is no game over screen, there are no health points and a lot of barriers that interrupt the flow of the game have been removed. The developers told us that they approached the level design with the aim of penalizing errors as little as possible and this translates into very frequent saves that allow you to interrupt the game at any moment and respawn points that are never too far from where you are fallen. In addition to the classic jump, double jump and dash, After Us will allow you to walk on some special walls, ride electric wires and other steel ropes like Sonic and Ratchet and even teleport yourself using old CRT televisions . Each of the levels then introduces a new mechanic that is the protagonist for that section of the game and returns at later moments to add more and more variety to the experience. From this point of view After Us has done a really great design job because we have not encountered a section equal to the other and each new mission has managed to put a new perspective on the set of skills that we already took for granted. Many parts of the game are one-way so it is not possible to retrace your steps but, through the oasis system (forests that act as checkpoints created by the life force of the protagonist), it is possible to revisit previous sections of the game in case you are left back a collectible. Determination and perseverance The protagonist of After Us is a nymph charged with saving the spirits of animals and is stubborn and determined, perhaps too much, to complete her mission In After Us you will take on the role of Gaia, a nymph charged by a creator spirit to save the vital energy of extinct animals in order to rebuild the ecosystems that humans have destroyed. This mission will take you through ruined cities, burning shopping malls, abandoned power plants and many other environments that are intended to personify the impact humans have had on the natural world. To purify the corruption brought by man, which almost always has the form of an oily black substance similar to petroleum, Gaia has at its disposal a pulse of vital energy that covers everything around it with grass and plants. Initially this power will serve to activate the oases and unlock points inaccessible due to corruption, but then you will have to learn how to use it in combat. In fact, during the first mission, you will meet the devourers for the first time, human beings so consumed by corruption that they they have become part and are now bent to his will. These creatures (of which existvarious types with varying degrees of strength) want to eliminate you and will try to catch you to destroy you. With your impulse of nature's energy you can reject them but to purify them you will have to use the heart of Gaia, a light that she can cast and call back to her. Hitting enemies and clearing them will return them to normal and see them dissolve. The most powerful opponents, then, will give you access to one of the two collectibles available in the game or the memories, comic-style images that tell the corruption of that place and are one of the first places where the ingenuity of the developers emerges. The second collectible hidden in the most inaccessible parts of the levels (and which often requires extra platforming sections) are the spirits of the animals to be rescued. To find them, however, you can make Gaia sing, whose voice will generate small colored pieces of paper that will guide you to your destination. A partial approach After Us almost completely misses the point of what an environmental video game can be in 2023 by using an outdated and ineffective approach to really change things The main problem with After Us is that it's coming out almost fifteen years late. His approach to the environmental problem is not only partial, but it is dated because for most of the game he aggressively points the finger at individual human beings and generalizes the discourse on what can be done for the environment and what is important to talk about. When Wall-E was released in 2008, it gave a significant boost to the environmental struggle because a large production represented, albeit with clichs, a serious problem and until then largely ignored. That way of representing man's impact on the planet, however, has long been considered obsolete because experts believe that it is not by making people feel guilty that tangible results are achieved. It is true that everyone's commitment is needed to help the environment, but without systemic interventions by the institutions it is difficult for things to change. After Us, on the other hand, wants to make us all feel guilty because we live in the present, idealizing a bucolic past where nature was flourishing, ignoring the limitations of that kind of society.", "date": "2023-05-24", "grade": "6.5"}