{"name": "Nuove mappe in arrivo!", "ref": "https://multiplayer.it/recensioni/115435-halo-4-majestic-map-pack-nuove-mappe-in-arrivo.html", "text": "After the first DLC called ~Crimson Map Pack~, clearly dedicated to the Halo 4 special team, the second expansion file finally arrives on the digital shelves of the Xbox 360 Marketplace containing three other unpublished maps dedicated to the immense Halo 4 universe. Three maps that can be used in multiplayer matchmaking at a cost of 800 Microsoft Points (now a standard, or about 10 euros). We remind once again all those who have purchased the official season pass of the game that they will not have to download this DLC directly because it is already included in their previously paid subscription, but will rather have to confirm the automatic message that appears on the screen by launching the game, thus starting the download of the expansion. Xbox 360 goals As often happens, the DLCs also contribute to increasing the ~loot~ of player points by bringing new objectives to unlock. The ~Majestic Map Pack~ adds ten objectives to Halo 4 for 250 points, all linked to specific actions to be performed while staying in one of the new maps. Quite simple actions for those who normally play online: make 5 kills invisible, kill enemies with the jet pack, stealth kills, kills with promethean vision active, and so on. In short, bread for your teeth. Back to the origins! The doubts posed by the new team in charge of the Halo 4 project were legitimate and made the community of enthusiasts fearful but at the same time excited for the new creature developed by 343 Industries. Halo 4 has been able to win back the hearts of fans and not only thanks to undoubtedly excellent skills in the single player (the campaign) but above all, once again, in the online multiplayer (matchmaking to be clear). The support given to the latest Microsoft effort is massive: where the Spartan Ops have fleshed out the main campaign, today we already have the second DLC for new maps to be played online, called ~Majestic Map Pack~, penultimate of a planned series of 9 maps in total. This new update includes three new maps to discover. One of the ~criticisms~ (if we can call them that, given the intrinsic goodness of the game) consisted in the fact that Halo 4 has maps that are too vast, large and often asymmetrical for 16 players, and that the best of this series were much smaller maps and ~intimate~. 343 Industries seems to have listened to the fans, producing a new series of maps clearly inspired by the best ever appeared on Halo and giving it once again an excellent level design, but contained in decidedly more welcoming and intimate spaces. The first map of the package is called ~Landfall~, small and asymmetrical, ideal for modes such as Infinity Slayer where only the ability of the single player in the ~versus~ counts. Landfall has no vehicles, just a series of narrow, vertical corridors connected by stairways, set in what could be defined as a sort of indoor military base. The map is full of ups and downs and covers, so as to enhance the camouflage properties of some, or the holographic ones of others. The very nature of this map makes it ideal for testing the new mode introduced with this DLC: ~Infinity Rumble~ is nothing more, nothing less than a ~Regicide~-style all-against-all deathmatch, with the difference that no longer counts the points but dry kills. Landfall is not only a closed base, but includes some small open areas full of structures and trucks behind which you can take cover and fight back. From an artistic point of view, we cannot fail to notice that this kind of maps made in corridors actually all look a bit alike, even if Landfall is appreciated for the stupendous panorama that confronts us once we leave the military structure. The sea, the horizon and the city certainly make it appreciable even from a purely scenic point of view. The second map in the DLC is called ~Monolith~ and is also a rather contained and symmetrical map, factors that make it also suitable for ~capture the flag~ style modes. As the name would already suggest, the map is characterized by the structures erected by the Forerunners and already seen in the Halo 4 campaign. ~Monolith~ has 4 cardinal points from which to respawn connected by as many gravitational cannons that manage to catapult us directly into the action of game without many frills, face to face with enemies. Unlike the other two maps in the ~Majestic Pack~, in this one there are much fewer elements of cover and ~disturbance~, leaving the war field clear of any object that can defend us or recharge our energy. This factor also makes it particularly suitable for playing modes such as Team Objective or Slayer. Last but not least, the characteristic of being able to take advantage of long-range weapons to strike from base to base, given that nothing blocks the view as the crow flies. The fact of ~mixing~ this last factor with the presence of closed bases makes ~Monolith~ very balanced for carrying out short or medium range attacks. From an artistic point of view, it is certainly not one of those maps that will remain imprinted in the collective imagination, also because it takes up settings and ~themes~ belonging to the already appreciated campaign: nothing new and striking from this point of view, the map ~ does its dirty work~ no-nonsense, and does it very well. The general feeling, purely from a visual and artistic point of view, is that these last maps are definitely too dark, dark and claustrophobic. And our desire to play in tighter spaces and smaller maps shouldn't necessarily lead to this, the best Halo maps prove it: compact, open, full of light and exotic environments, such as Battle Creek, Ascension, Zanzibar and many others. The feeling of visual oppression becomes almost certain that 343 Industries does it on purpose by looking at the third map called ~Skyline~, set on the top floor of a skyscraper... obviously at night. Undoubted the nocturnal charm of the urban landscape, in any case. This is also a symmetrical map (therefore ideal for ~Capture the flag~ and ~Team Objective~) developed on two levels, plus a third from which you can access by taking advantage of some points where you can jump. ~Skyline~ is a very compact map but developed vertically, in which we can face enemies either in close combat with the classic weapons (rifle, shotgun, magnum) or by aiming from top to bottom and hoping not to be attacked by the shoulders, since each level ~goes in a circle~ and therefore we can always be taken from behind. Moreover, on the lower floors it is full of crevices, hiding places and corners in which to shelter and regenerate. Ultimately it is obviously an obligatory purchase for all those who hang out in the virtual worlds of Halo 4 constantly and online, as in addition to adding three unpublished maps it also brings the new ~Infinity Rumble~ mode which is always nice to have more . Although artistically very high peaks are not reached, the maps are always well thought out and designed as usual, nothing is ever left to chance and you will learn to love them from the very first games. For those who do not have the season pass, we remind you that you can click the link in the box at the beginning of the review to download this DLC directly to Xbox 360.", "date": "2013-03-07", "grade": null}