{"name": "Un castello tutto nuovo", "ref": "https://multiplayer.it/recensioni/115709-castlevania-lords-of-shadow-mirror-of-fate-un-castello-tutto-nuovo.html", "text": "Nintendo portables have been a sort of stronghold for the Castlevania series in recent years, the only environment in which two-dimensional titles managed to find meaning and popularity by escaping the obligation of the polygon. From Circle of the Moon on the GBA to Order of Ecclesia on the Nintendo DS, Koji Igarashi's vampire stories continued to live on in the line of lore, meanwhile more or less unsuccessful 3D experiments were attempted on the Nintendo 64, PlayStation 2 and Xbox . But it was quite clear that such a situation could not last for long, and for this very reason Konami chose to make a clear change by entrusting the reboot of the series to the little-known Spanish team MercurySteam supported by Kojima Productions. Thus was born in 2010 Lords of Shadow, and the good feedback from critics and the public was more than enough to make Konami understand that the road was the right one; for this reason the trust in the Iberians was therefore confirmed for Lord of Shadow 2, soon to be released on Xbox 360 and PS3, and also for the creation of an exclusive chapter for 3DS, entitled Castlevania: Lords of Shadow - Mirror of Fate, which is going to be placed at the center of this trilogy. God of the Castle Given the precedents just described, it is obvious how this debut on 3DS has attracted a lot of attention, as well as the inevitable criticisms from the public of loyal devotees of Igarashi's works; at the same time however, MercurySteam seemed to have gained such consideration as to allow us to wait for the release of the game at least with a little hope. In reality, we say it immediately so as to make the skeptics grin with satisfaction, the final result did not seem extraordinary to us, although very far from being able to be defined as catastrophic. Castlevania: Lords of Shadow - Mirror of Fate certainly does not suffer from awe, which is why the Spanish team did not have major problems in moving away in a decidedly radical way from the guidelines drawn by the traditional episodes, shuffling the cards of the most ~Metroidvania~ classics. But let's start from the points of contact: despite the transition to fully 3D graphics, the gameplay remained absolutely two-dimensional, as well as the setting inside a huge castle capable of containing an improbable but necessary variety of different locations and styles. Right from the start, however, it is evident how the team has chosen to shift the balance towards the element of combat, operating both on the protagonist's abilities (or rather on the protagonists, which we will not talk about to avoid spoiling the surprise) and on the commitment necessary to get the better of the enemies, who in practically all cases require many shots and a bit of strategy to be eliminated. Although at the beginning the skills available are very few, it only takes a handful of minutes to start seeing the possibilities of attack expand, based on a formula that allows you to ~unlock~ new moves by collecting experience. The final result is very similar to that of a God of War, which, even with the due proportions, seems to have been definitely the inspirer of MercurySteam; a scent that is perceived, for example, also by the final moves with which the hero can eliminate the stunned enemies, by the crudeness and violence of the action, and also by one of the bosses with the features of a very prosperous and scantily dressed charmer inside an inviting harem, a situation that closely resembles the moments of ~leisure~ of Kratos with similar ladies in the various chapters of the series. Unfortunately, however, the quality of the Spanish team does not appear comparable to that of the boys from Santa Monica, and the fight is much flatter and less satisfying; beyond the absence of a comparable ~sense of scale~, and of a level of violence in any case aped but sweetened to be included in PEGI 16, it is precisely in practice that the clashes appear less satisfying, seasoned with avoidable QTEs, with trivial enemies, and above all you are almost never stimulated to use the different moves available, finally leading to always relying on the usual 3 or 4 most effective. Similarly, even the skills and spells, four for each character, are marginally useful in battle and trivially applied in the exploration phase. The boss battles are pleasant and challenging. The 3D effect The game offers a good depth effect, albeit rather an end in itself for two thirds of the adventure; the obvious and by now very well-known need for perfect alignment of the screen with the eyes, combined with the fact that 3D generates a little more ~confusion~ in the action, however suggests a deactivation that in the end does not suffer too much . Too bad you use them insteadmore original and interesting than the feature appear only in the third act, when the adventure is almost over. Acts of force Said of a derivative and seamless combat system, which therefore cannot go beyond an abundant sufficiency, obviously the other ~slice~ of the gameplay of Castlevania: Lords of Shadow - Mirror of Fate, or the exploratory element, must also be considered. As mentioned at the beginning, although it is always a Metroidvania, also in this case MercurySteam has chosen to take some liberties from tradition; because if platform elements and simple puzzles are in line with those seen in the past, backtracking has in fact been almost completely eliminated in favor of a much more linear and simple progression. The perennial presence of a red arrow indicating the direction to follow to reach the next objective almost completely eliminates any exploratory element, which is supported only by the search for scrolls and chests to extend energy and magic (another reference to God of War). The level design appears pleasant, but again completely devoid of moments of great quality or particular intuitions; we proceed almost always without surprises and without difficulty, with the only frequent interruptions linked to the already mentioned demanding, and also repetitive towards the end, fights. Then there are factors which are not entirely convincing, and which leave us somewhat perplexed; above all, the choice to divide the adventure into three acts (with three different protagonists). The first two are actually complementary and symbiotic, as well as very similar to each other; the only big difference, in the second, lies in the impromptu presence of two large (in terms of size) environmental puzzles which in reality seem to be forcibly inserted into the adventure and which constitute more of a slowdown than entertainment. The third act, on the other hand, appears more disconnected, in some respects different, and it was probably also the one on which the programmers started building the game; in fact, the beginning is incredibly linear in the level design, largely empty, and with a repetition of some elements of the tutorial that leaves at least perplexing given that they arrive after about 6 hours of play in which they have already been widely assimilated. In addition to this, the difference from the first two acts is also denoted by a greater use of the three-dimensional element, with for example the sequence with a boss or the entry onto the scene of an enemy ~from the back~ of the room which have the flavor of a graphic experimentation pushed much, much more than in the other acts. Finally, as regards the graphic component, on a purely technical level the effort of the Spanish team is distinctly perceived; even with a low frame rate and which suffers some collapse in the heaviest situations, the polygonal complexity and the work on the detail of characters, enemies and environments is remarkable. It is in the style that we find ourselves least in agreement: the decision to abandon the gothic inspiration for a much more banal and ~American~ solution makes the final result poorly characterized, with the only exception of the non-playable narrative sequences of cartoon-like interludes in very nice cel shading.", "date": "2013-03-07", "grade": "6.8"}