{"name": "Slipstream", "ref": "https://multiplayer.it/recensioni/slipstream-recensione.html", "text": "Slipstream is a retro-style arcade racer, which refers to the classic Out Run for the aesthetics and the SEGA series in general for the gameplay, completely based on the drift mechanism. However, in the game there is also a pinch of Initial D, which never hurts, and vaporwave and synthwave sound atmospheres that are expressed in the context of a captivating soundtrack. This is not a new project, in reality: financed on Kickstarter way back in 2016, the game landed on PC two years later, after quite a few delays by the developer ansdor, but without getting the response it deserved. Now the author tries again on Nintendo Switch: is the Japanese hybrid console able to make the most of this experience? Read on for our Slipstream review to find out. Gameplay Slipstream, aboard the Type 23 we race towards the sunset As mentioned, Slipstream takes up the retro aesthetics of the original Out Run, but on the gameplay side, the game refers to the most recent episodes of the SEGA series, those that focus on drifting to offer an absolutely arcade driving experience, in which never have your foot off the accelerator and it is possible to tackle any curve by putting the car sideways, if this maneuver is carried out with the right timing. The default control layout, with accelerator on A and brake on B, soon proves unsuitable for the task, but fortunately it is possible to modify it at will and therefore resort to the triggers, then assigning the rewind function to any other button, which clearly allows you to rewind time for a few seconds in order to remedy a sensational error, but which in reality facts is not easy to make the most of due to the great speed of the action. So you launch yourself onto the road at full speed, giving a hit of the brakes to start the rear of the vehicle and then managing the drift with the analog stick to avoid collisions with other cars and above all with the objects surrounding the track. given that a violent impact can result in a spectacular pirouette of the car and the loss of precious seconds. To gain the cue often necessary to overtake, you also need to slipstream for a few moments and thus activate the boost that gives the game its name. Slipstream includes various options in order to adjust the degree of challenge, but without renouncing a balance of difficulties that we would define as lively, and which will hardly see you win a race on the first try. Using the automatic drift, in fact, will slow you down in the curves, while the ability of the opponents can be set on three levels going to emphasize their acceleration rather than the final speed. Likewise, we will be able to change the approach to the race by choosing one of the five cars in the game. Contents Slipstream, a drift on the seashore The system is therefore captivating, very immediate, but at the same time difficult to master, and is declined within different modalities. There is clearly the one that faithfully reproduces the Out Run experience, called Gran Turismo: the long path with crossroads and checkpoints with a bonus represented by direct opponents who from time to time we will have to leave in the dust, but there are also several alternative stipulations. In addition to the single race on one of the fifteen tracks available, the grand prix on five races and the possibility of upgrading the car with the money obtained from time to time, the rally-style event, the time trial and the elimination battle royale, Slipstream includes a local multiplayer via split-screen for two or four users, to be played by holding the Joy-Con horizontally: a nice possibility, but which forces you to use that default layout that just doesn't exist has convinced. Graphics and sound Slipstream, one of the least successful scenarios in the game The game draws on the graphics of the original Out Run, simulating with polygons and textures the very fast zoom of low-resolution sprites that was the trademark of the SEGA game. In the same way, the car we're driving boasts very few animation frames that describe its movements on bends: this too is a tribute, but with some awkward implications on the possibility of controlling the vehicle's reactions really well. movement, with a rocky 60 fps and a sensation of speed that becomes even difficult to manage in the curves in succession, especially when we are in the slipstream of other cars; but the quality of the fifteen available scenarios moves between ups and downs, with some frankly bad tracks and a recycling of assets that is heavy at certain times. Slipstream, a raceat night Honestly, looking at the screenshots, you wouldn't give it two lire, but in action Slipstream has its reason, both in docked and portable mode, in the latter case placing itself as an experience at times psychedelic and alienating, thanks to the mix of peculiar shades and electronic songs capable of really catapulting us back in time. The soundtrack, signed by the American musician eff, in fact includes a really interesting selection of pieces, made up of rhythms and melodies that easily enter your head and try to stay there as long as possible , although on the effects side things are decidedly less brilliant and inspired. In any case, this is a title to be played with headphones, there is no doubt.", "date": "2022-04-13", "grade": "7.5"}