{"name": "Ossu! Tatakae! Ouendan!", "ref": "https://multiplayer.it/recensioni/ossu-tatakae-ouendan.html", "text": "Crazy rhythm The introduction above describes nothing but the first sequence that is shown to the eyes of those who play Ossu for the first time! Tatakae! Ouendan!, decidedly unconventional rhythm game by the same team responsible for Gitaroo Man. By discovering new frontiers in the field of insanity, the title Inis confronts the user with a whole series of stories whose common denominator is the presence of a small/big drama: the aforementioned student who can't do his homework, the young man in love with a girl but opposed by his father, the violinist suffering from an intestinal problem on the subway, the teacher dealing with a hostile class. These are just a few examples of the 14 scenarios that make up Ossu! Tatakae! Ouendan!, stories of ordinary madness narrated through wonderful manga-style cartoons, so eloquent as to make themselves perfectly understandable despite the prevailing ideograms. Each of these comic incipits ends with the protagonist of the moment who, exasperated by the difficulties he is forced to face, bursts into the cry ~Ouendan!~, thus evoking the three protagonists of the game -Ryuta, Suzuki and Raitou- improbable dancers in student who with their propitiatory dances are able to solve any problem. And here the actual game begins, with the upper screen of the DS occupied by tasty skits describing the adventures of the various characters on duty and the touchscreen dedicated to the polygonal representation of the cheerleader trio. The game mechanic of Ossu! Tatakae! Ouendan! is extremely simple: all the user has to do is press the circular indicators with the stylus following the numerical order in which they are represented, obviously trying to follow the rhythm of the song as best as possible (the task is facilitated by a peculiar graphic device , a circle that tightens around the icon indicating the right time to perform the action). The difficulty of the whole increases with the succession of levels, with the more advanced ones presenting many indicators in sequence or to be pressed several times as well as signs of different kinds that require the user to follow a path with the stylus or to perform frenetic rotational movements on a disk. Dance will save the world Obviously, a dynamic and sparkling formula like that of Ossu! Tatakae! Ouendan! it wouldn't go very far without proper music support. Fortunately, the Inis product offers a series of extremely cheerful and catchy J-Pop tracks, which in addition to marrying perfectly with the gameplay, prove to be very capable of getting into the user's head and tormenting him with their captivating refrains. Such a pleasantness of the audio sector then makes the user's playful process even more fun and enjoyable, so much so that it is absolutely possible to play Ossu! Tatakae! Ouendan! without worrying too much about the rhythmic indicators and always going by ear. Already excellent as a rhythm game in itself, the Inis title boasts an indisputable added value such as that of humor, which as previously mentioned, is truly phenomenal. Observing the comic dramas of the different characters is exhilarating, as is seeing our Ryuta, Suzuki and Raitou emerge without batting an eye in the most preposterous places (an internship is even set in ancient Egypt) and unperturbed begin their miraculous dances. Ossu's Incredible Hilarity! Tatakae! Ouendan! it's really hard to put into writing, but it's definitely the best we've seen on DS so far alongside Wario Ware: Touched! It even goes so far that one often gives in to the temptation to look away from the frenetic action of the lower screen to observe the insane skits proposed in the upper one to have a good laugh. Humor aside, the Inis product is still a thoroughbred rhythm game, which certainly suffers from the innate defect of the genre - the relatively poor longevity - but which is undoubtedly capable of giving sessions of pure fun accompanied by a musical background of great impact. Even from a strictly graphic point of view, Ossu! Tatakae! Ouendan! does its job impeccably, with the never too praised comic sequences which are accompanied by a careful polygonal modeling of the three protagonists, moreover equipped with animations that are as funny as they are fluid. Last note regarding the multiplayer mode of the title, which can be used wirelessly by up to four players: playful mechanisms and music remain the same, but the stories represented on the screen vary, some absolutely delusional. Comment Ossu! Tatakae! Ouendan! is certainly one of the funniest titles available for the Nintendo DS, thanks to both a gi structureimmediate and captivating (strong of a truly excellent set of music) and an exhilarating humor that permeates the entire Inis production, with its characters and the demented adventures they face. All topped off with an up to date technical sector, with functional and well-finished in-game graphics and spectacular manga-style sequences to say the least. In short, Ossu! Tatakae! Ouendan! is a real jewel, which every user even minimally interested in rhythm games should not miss. Pros: Fast-paced and fun gameplay Catchy and captivating music First-class demented humor Cons: Rather short lifespan Only available in jap version A young Japanese student sits at a desk, intent on doing his homework. The boy is visibly frustrated: he is unable to maintain concentration due to the hubbub caused by his family members, who carelessly watch television in the living room amid screams and shouts. Our protagonist finally blurts out, and in an authoritarian tone he orders mum, dad and little brother to turn down the volume and respect his needs. But nobody listens to him. What to do? It's simple: just yell ~Ouendan~ loud!", "date": "2005-10-19", "grade": null}