{"name": "Pixel by pixel", "ref": "https://multiplayer.it/recensioni/115373-puzzle-restorer-pixel-by-pixel.html", "text": "Being able to emerge in a crowded segment such as that of puzzle games for iOS is not a simple undertaking, and to do so are usually those products that manage to combine fresh and stimulating gameplay with ease of use capable of meeting the widest possible range of users . So let's see if the Puzzle Restorer present here, by the same team responsible for the appreciated Qvoid, manages to keep these two golden rules true. Tracing lines The premises are certainly excellent, given that the play structure of Puzzle Restorer follows the best paradigms of the genre to the letter, thus presenting itself as very easy to assimilate in its basic mechanics but at the same time a dispenser of a depth that becomes more and more tangible as you continue in the schemes. And as is often the case with the most deserving titles, describing the rules of the game makes them seem much more complicated than they really are. The user's task is to recompose pixel art paintings, taking as reference the image of the target that stands out at the top of the screen. By dragging your finger on a grid made up of blocks, it is therefore necessary to draw one or more lines to paint the desired squares until the required result is achieved, keeping in mind a couple of fundamental constraints: you have a limited number of moves to make, the tracks cannot overlap and you have to start and finish in contact with one of the blocks that are already colored at the start. If the first handful of the 64 puzzles that make up the package flows away without too many worries - all while the software spreads out the minimum wage in terms of tutorial messages - it doesn't take much for the matter to start to get quite bizarre, both due to the ever-increasing complexity of the paintings, and for the introduction of new rules, for example those which impose the superimposition of two or more lines of primary colors to form the secondary tonality necessary to satisfy the demands of the scheme. In this sense, Puzzle Restorer proves to be a puzzle game for many, but not for everyone: despite a basic gameplay that certainly cannot be defined as difficult to assimilate, the Gavina Games title has a very steep learning curve, compared to the which the user is left practically alone. Therefore, it is up to everyone's individual attitudes to evaluate whether such an approach can be an incentive to try and try again the same level until the desired solution is reached, or a premature invitation to abandon the game in favor of similar, decidedly more indulgent products. What is certain is that completing an internship following many attempts is accompanied by a very pleasant sense of satisfaction, an aspect that reaches a real climax on the occasion of the special schemes, equipped with separate rules that must be discovered in total autonomy from the user. Just the commitment required by the software to complete most of the levels of which it is composed is one of the main players in defining the excellent longevity of the product, especially considering the very low price at which it is offered on the App Store. Also not to be underestimated is the pleasantness of the technical sector: graphically, Puzzle Restorer boasts a very successful design, and it's nice to see objects, animals and even works of art all reduced to a mass of large pixels. Finally, a relaxing musical carpet in a jazz key helps to maintain the user's concentration while trying to solve the various puzzles.", "date": "2013-03-01", "grade": "7.6"}