{"name": "Planet Zoo: Wetlands Animal Pack", "ref": "https://multiplayer.it/recensioni/planet-zoo-wetlands-animal-pack-recensione.html", "text": "Frontier Developments follows a very precise model of support for its games: on the one hand it aims to create very rich basic packages, on the other to launch DLCs that satisfy certain tastes of the public, without wanting to convince everyone every time. It's a bit like selling different dishes, hoping that customers will always find something they like. This philosophy has already been applied several times by the English studio, for example with Jurassic World Evolution or Planet Coaster, proving to be successful in some ways, disorienting in others for those who love to have all the contents of a particular game. If we want, it is the same economic mechanism adopted by EA with The Sims 4, the latest chapter in the series, which now boasts dozens of different expansions that cost several hundred euros overall. For this reason, the review of Planet Zoo: Wetlands Animal Pack is only a formality, in the sense that it is easy to understand what already awaits us from the title and it is equally easy to make purchase evaluations starting from it, if you know the game well. Animals The new pets are very friendly In terms of amount of content, Planet Zoo: Wetlands Animal Pack offers eight new animals and a challenge scenario, plus various items to make our parks more swampy. It is a quantity in line with that offered by the other expansions and, as we will see, even the feasible considerations in this regard do not deviate by a millimeter from those made for the other packages. The eight new animals are: the capybara, the platypus, the dwarf otter, the spectacled caiman, the Nile lechwe, the wild water buffalo, the red-crowned crane and the Danube crested newt. There are seven habitat animals plus one for exhibition. As always, the player is called upon to create each one's enclosures, making them pleasant to inhabit for the joy of the animals and tourists, who will flock to see them (in some cases even up close). In terms of gameplay, it doesn't change much compared to the standard Planet Zoo formula, except for some particularities of the habitats, such as the presence of essentially flooded areas, which make the creation of the environments more peculiar. However, everything is handled in the usual way, so it's just a matter of placing more importance on the water than on the habitats of other animals. As always the animal models are done to perfection, both in appearance and animations. After all, one of the pleasures of Planet Zoo is precisely that of watching while the guests of our zoos live their virtual lives, as if we too were tourists and from this point of view, Frontier has not disappointed expectations, between dances of mating, evolutions on the water of the otters, dives of the platypuses and many other pleasures in which the animals do their utmost when satisfied. Challenge scenario Water is the main element of the whole expansion The challenge scenario is also in line with that of the other expansions. Set in Brazil, in the Pantanal, it sees us grappling with a zoo to fix and make it flourish that allows you to get in touch very quickly with all the new animals. The objective is the one seen in the other scenarios: to take over the structure and manage it in such a way that it returns to profit, arranging the existing habitats and adding new ones. The challenge offered has no particularities compared to the other scenarios (the more you increase the difficulty level, the less time you have available to succeed in the enterprise), but it is undoubtedly an excellent way to take advantage of the new contents immediately, without having to grow the zoo. The scenarios of Planet Zoo: Wetlands Animal Pack are very natural Speaking of new decorations, we liked the ones included in the Planet Zoo: Wetlands Animal Pack less than those of other packs, such as the Europe Pack for example. It must be said that it is really a matter of taste: if you like marshy environments you will love it, with its set of aquatic plants and natural passages. We are probably faced with one of the most naturalistic scenarios ever.", "date": "2022-04-12", "grade": null}