{"name": "Tre volte pelato", "ref": "https://multiplayer.it/recensioni/114640-hitman-hd-trilogy-tre-volte-pelato.html", "text": "The remake fever, or rather, the revival of old PlayStation 2 classics in high definition and in special collections, which seems to have hit practically all the major video game companies in recent years, does not seem to know any decrease. On the other hand, it is quite understandable in some ways that in a moment of crisis like this, a software house tries to maximize what it has available, perhaps occasionally creating productions that require little change (and effort) in terms of investments and work , in exchange for often more than good earnings. Without forgetting that, beyond the purely commercial operation itself, these compilations are for many users an optimal way to be able to play (or replay in some cases) titles of a certain quality level otherwise no longer usable, if not relying to the used market to recover consoles and copies of the original games. Hitman: HD Trilogy is in this sense a collection that includes three important episodes of the Hitman series, namely Hitman 2: Silent Assassin, Hitman: Contracts and Hitman: Blood Money, with remastered high definition graphics, achievements and trophies, plus Hitman Sniper Challenge is a twenty-two page artbook with tables and drawings illustrating the best moments of the three titles mentioned. Compelling situations, a charismatic character in his own way and gameplay focused on the so-called trial and error capable of offering users in each episode a level of challenge that is always appropriate to the context, these are in principle the key ingredients of the success of the series. agent 47. Hitman 2: Silent Assassin Hitman 2: Silent Assassin is in chronological order the first episode released on the Monolith and therefore the one contained in Hitman: HD Trilogy that we take into consideration to start our review. From a narrative point of view, he picks up from where the first game left off, i.e. Hitman: Codename 47, therefore with 47 who tries to hide his tracks by taking refuge in a church in Sicily, where between prayers and a monastic life he intends to redeem himself from his violent past. Unfortunately, things don't go as man wishes and so, without wanting to spoil too much of the story, let's just say that our bald hero is forced to get back on track and carry out missions around the world again for his old employers. As far as the more purely playful part is concerned, the product obviously places great emphasis on the stealth component of the action, pushing in this direction ideally the gamer to complete each session in a clean way, that is, without triggering any alarms or killing enemies silently, perhaps then wearing their clothes to blend in, and taking advantage of certain specific objects as needed to create diversions. However, even if the product invites you to move in the shadows rather than with guns blazing, it still leaves the user the freedom to act more decisively and loudly if he wishes. The arsenal made available to him in this sense is quite large and varied, but in our opinion it is unlikely that he will abuse it much. For each action to be made by the protagonist, the player can count on a control system which, while proving to be quite precise and functional, shows its age a bit, is not very easy to master and sometimes it takes very little (a wrong touch on the pad) to frustrate a long stalking or an action performed behind a guard. The latter, among other things, in certain circumstances seem to have paranormal powers, as for no apparent reason they notice 47's camouflage and fill it with lead, forcing the user to restart the scenario. Still on the subject of defects, the biggest one in our opinion of Hitman 2 however remains that certain basic repetitiveness of the action which occurs after a few hours of play: although the missions are in fact set in very different scenarios, it is it is also true that in almost each of them it is necessary to redo the same scheme which roughly foresees a disguise, the killing of the target and the escape and nothing more. Hitman: Contracts Things improve in this sense in the second title contained in the compilation, i.e. Hitman: Contracts, where, even if not making one cry for a miracle, more evident variety of situations and differences in the areas in which to act make the product more attractive than its predecessor, even if they remain unsolved some problems related to artificial intelligence, especially of conceptual origin. Just to give an example, the reaction of the enemies is sometimes too exaggerated in relation to what is happening on the screen to be fairficata: perhaps it happens to enter a private place unarmed and instead of being chased away by the guards verbally or with some shoving, there is the risk of being shot. For the rest, of course, Hitman: Contracts keeps all the fundamental canons of the franchise firmly in place, improving the controls here and there and leaving the player the power to decide how to deal with each situation, it being understood that the stealth approach is the most rewarding one. albeit challenging at the same time. During the various game sessions, this time set in the past, among the memories of the bald killer, agent 47 can, as always, change his appearance by wearing the clothes of the victims, so as to be able to act undisturbed trying not to arouse suspicion among those who observe it. In this regard, keep an eye on the special indicator that signals the level of suspicion that the guards have towards the protagonist, and on the game map, from which to obtain valuable information and follow every step of the victim of the case and those of his acolytes. At the end of each mission, a screen is displayed with all the statistics of the completed scenario complete with a ~report~ of the player's behavior and the approach taken to achieve the set goal. In short, Hitman: Contracts is a step forward compared to Silent Assassin, even if it is not without flaws. Xbox 360 goals The product contains 50 unlockable achievements for a total of 1000 points. They are divided more or less equally within the titles of the collection, and are mostly obtainable by continuing normally during the course of the adventures, for example by completing the first missions or by reaching particular scores upon completing a level. The more difficult ones to unlock, however, require the achievement of certain results related to the end of each game, the difficulty level adopted and certain challenges in the challenges, such as the number of headshots made or general victims killed in a single mission. Hitman: Blood Money The best of the titles contained in the Hitman: HD Trilogy collection is in our opinion Blood Money, the fourth official chapter of the saga of the most famous commissioned killer in video games. While also remaining anchored to the tradition of the series, the product introduces some important novelties and improvements in the gameplay, such as the so-called notoriety system, the presence of which radically changes the difficulty of the game depending on the mistakes made by the gamer, of which he evaluates time to time the way he accomplishes the missions. To be clear, everything that agent 47 does wrong (or good) in a given phase of the adventure affects what will happen in the following ones. In fact, every time he commits a murder, the police carry out investigations, and if, for example, he finds witnesses about the events, the level of suspicion of the same in subsequent missions will be increased. In short, if the user leaves more or less evident traces of his work, the artificial intelligence of the enemies can undergo an upward increase, thus making things much more difficult than expected in the missions that will come later. Among other things, the latter finds its almost total maturation in this fourth episode since it behaves quite well, especially when compared to that of the two previous titles covered in this review. Of course, even here there are some gross errors such as when the killing of a guard does not arouse the slightest suspicion in the colleagues who are perhaps next to him, or when he is still discovered without a real reason. But overall, as mentioned, it behaves better than in the past and therefore offers a level of challenge that remains high and continues for all the fifteen interesting missions that make up the adventure. This is also thanks to the excellent level design which features maps that allow different ways to reach the goal and numerous hiding places added for the occasion to operate in the best possible way, in silence. These range from the classic wardrobe in which to close up to the chests in which to hide the corpses. Speaking of victims, Blood Money offers gamers an infinite number of weapons and above all objects to eliminate enemies, even particular ones, such as for example throwing knives, barbells, clubs, syringes and the icing on some melee moves. Hitman Sniper Challenge Dulcis in fundo, as mentioned at the beginning of the article, the collection also includes Hitman Sniper Challenge. It is a stand-alone ~title~ that connects to the main series by sharing its characters and settings, but which presents itself as a game with a somewhat different structure.a, since this is focused in particular on precision fire, with agent 47 in the guise of a sniper. Released months ago as an exclusive bonus downloadable via code to redeem on PSN and Xbox Live for those who pre-ordered Hitman: Absolution, in it the user controls the bald assassin who is on the roof of a skyscraper in Chicago, where he is in charge of assassinate, with a sniper rifle, Richard Strong Jr, CEO of Stallion Armaments, a company that produces weapons and who is a guest at a party that takes place in the skyscraper in front of where the protagonist is. The killer therefore has fifteen minutes of real time to find the right moment to take out the target and as many bodyguards as possible, obviously trying not to be discovered. The player accumulates points by killing and as a result earns points and upgrades for the sniper rifle, useful for increasing its power, accuracy and rate of fire. At the end of the game, the player's score can be uploaded to a special world ranking where it can be compared with those of other users (although we have not had the opportunity to fully verify this option firsthand due to time constraints). Going to close this review, let's take a look at the technical aspect of the trilogy. Excluding the aforementioned Hitman Sniper Challenge, developed on the basis of the new Glacier 2 engine, and therefore aesthetically excellent, the three video games of the saga contained in the collection present themselves graphically between ups and downs. From this point of view the best is Blood Money, on the other hand it is the most recent, from 2006, and the worst is Silent Assassin from 2002, which also lacks in terms of animations, woody and not very fluid. In all cases the textures are those that are taken directly from the PlayStation 2 versions, ditto the polygonal models of the characters, with the secondary ones rather flat and, especially in the first game of the trilogy, even angular. What therefore gains from the transposition in HD are the colors, lively and brilliant, and the luminous effects. The sound is also nice, which does its job very well, and in general also the dubbing, which in the Xbox 360 version is only available in English (in Italian it is found only in the PlayStation 3 edition).", "date": "2013-02-15", "grade": "7.0"}