{"name": "Sesta contro prima", "ref": "https://multiplayer.it/recensioni/114717-boob-wars-big-breasts-vs-flat-chests-sesta-contro-prima.html", "text": "Aside from genocide, famine, riots, discrimination, One Direction, popes resigning, popes not even resigning to pay them and so on, planet Earth is a pretty peaceful place. But what if one day all the breasts in the world standardized on two sizes, the first and the sixth? That is, if the entire female population of the globe were divided into super overweights and surfboards? It would be total chaos, with jealousies of all kinds that would lead to an inevitable war, called the Breast Contest (that's how we translate it, but if you want... cough cough), despite the commitment of the underwear industries to produce garments more and more varied and sexy so as not to displease anyone. In such a context, the only hope for the return of peace is an ultra-horny hero with an impressive broadsword. Who Said Cloud? No, Cloud is already busy with Final Fantasy VII. Besides, everyone knows she's a virgin. In short, he does have a big broadsword, but not the kind we need. Kratos? No, too prone to carnage. Who said Mario? We hear you know? You don't bring up Nintendo games when it comes to R-rated stuff. Every time it happens a Japanese child is sacrificed to the emperor and a Pokmon dies in excruciating suffering. And then everyone knows that Luigi is much more gifted. Let's get back to ourselves and we won't digress anymore. The task of the upright, ahem, the elect will be to bring women of any size to reason. As we let you imagine, it was already difficult to describe the plot of Boob Wars: Big Breasts vs. Flat Chests, a hentai video game with a crystalline title, without falling into easy jokes about sex (look what you fell for, idiot ndUmbertovestitodaputtoconlealuccerosa). You do not understand? Broadsword, women in sexy dresses, hentai...add, divide, multiply and... Are you undressing or shall we play cards? Boob Wars: Big Breasts vs. Flat Chests is a fairly classic hentai game. Normally it is a genre little frequented by Westerners, but lately, thanks to the meritorious work of translation and adaptation of the publisher MangaGamer, we are seeing a little more of it too. It takes very little to explain its mechanics: you have to read a lot of dialogues, often with sexually explicit content (in English only), you have to see the various porn scenes in pure Japanese style and, every now and then, you have to fight against various opponents, in this case all girls, via a card minigame. The important thing, as a genre commands, is that the whole interface can be managed via mouse with one hand, leaving the other free for... epidermal exploration. In fact you will have understood that there is very little to do. In truth we are quite below the standards of the average hentai, with a structure that to define as poor is an understatement. There are no choices to make (you can only decide the order in which to face the girls and little else) and the fights tire at a speed equal to the time to finish the first and start the second (come on, we don't count the tutorial). But, since the latter are the only active element of gameplay, let's try to understand something more. Sword versus mace At the beginning of each fight, five cards are dealt with numbers ranging from one to seven on them. Each turn, one to three are selected to carry out an attack or to try to defend themselves. The player with the highest sum of card values always wins. This translates into more or less marked damages, caused or suffered, depending on the difference between the two sums. After each turn, two cards are reassigned. The first player to use up all of their opponent's energy wins. The only variations are two special cards, one that allows you to change the cards in your hand and the other which awards three more cards in the same turn, increasing the viable choices. Winning or losing is often a matter of luck (or stupidity of the CPU), rather than skill, because it can happen that the assigned cards are all of very low value, ie easily surpassed by the opponent. The exact opposite also happens, with fights that should in theory be very difficult turning into health walks. Generally Boob Wars: Big Breasts vs. Flat Chests has a really poor game system. One almost regrets that of Seduce Me, in which at least the developers have made an effort to vary the card games based on the type of interaction. Here we are at the ABC of nothing and it is not even the excuse of belonging to a niche genre, which one certainly does not follow by looking for complex gameplay or who knows what playful content. The truth is that there are vastly better hentai games than Boob Wars: Big Breasts vs. Flat Chests and it is with those that vto compared. Sure, in the West the choice isn't as wide as in Japan, but in this case the effort to create something valid, beyond the clichs, was really scarce.", "date": "2013-02-14", "grade": "3.5"}