{"name": "Quattro rotelle motrici", "ref": "https://multiplayer.it/recensioni/114649-table-top-racing-quattro-rotelle-motrici.html", "text": "The idea of a race between plastic toy cars is not new to video game enthusiasts, who have been able to try their hand at the titles of the Micro Machines series in past years thanks to Codemasters. Getting behind the wheel of cars that challenge each other between boxes and glasses, racing on laden tables rather than in a pretty ~game room~, hasn't lost its charm, however, and so the Playrise Digital developers have decided to focus on this subgenre for their App Store debut. We're not talking about industry newbies, far from it: the team members come from various backgrounds, are industry veterans with a curriculum of games like WipEout and WipEout 2097, and have seen fit to amaze iPhone and iPad owners with a series of special effects. Specifically, we are talking about polygonal graphics that are decidedly close to the capabilities of current home consoles, which not only run in high resolution and at sixty frames per second, but boast impactful visual effects such as bloom and a system of advanced lighting. The ten vehicles available in Table Top Racing, to be unlocked as experience points are acquired by winning races, are decidedly well done and out of line, as they are not racing cars but mostly vans, vans, jeeps and pickups . Even in the middle of the action, the intention is clear not to push the accelerator on speed (interesting play on words), but on memorizing the circuits, on the choice of trajectories and, finally, on the expected use of the weapons scattered on the track. Yes, there are those too. Under the plastic the fire burns The main mode of Table Top Racing is the ~Career~, which is a series of three championships each consisting of eight races plus a small points tournament. In some events we are simply asked to cross the finish line first, in others weapons are involved and therefore the balance of forces on the field changes substantially, given that we will be able to launch homing missiles against our opponents, drop bombs on the track , emit electric shocks or take advantage of short boosts. There is no shortage of further variations on the theme, such as the elimination race (in which the last of the group is eliminated at each lap of the track), those in which only certain weapons are present or the timed challenges with no opponents other than the stopwatch. The point is that you have to win to earn gold tokens and use them to purchase upgrades, the latter essential for completing the championship. Furthermore, the championship cannot be considered concluded if all three stars are not earned in each race, i.e. you finish first. When you find yourself unable to win a particular challenge, you can fall back on the fast run or special challenges to collect the virtual money needed for upgrades ... or dip into your wallet and buy a pack of coins, a practice that it can make our progress faster but we didn't find it mandatory at all. What you really can't escape from in Table Top Racing is rather the focus, the attention to the trajectories, the cutting of the curves in the right way to gain that minimum cue that allows us to score the last overtaking. A gameplay so focused on precision is fortunately supported by a control system at the height, which in the default configuration works through two simple touch icons (to turn right or left) plus the brake, where acceleration is automatic. There is also a tilt variant, but inevitably less reliable. Finally, we were also able to try the online multiplayer for four players via Game Center: matchmaking is currently fast but sometimes there are problems related to lag.", "date": "2013-02-12", "grade": "8.3"}