{"name": "Aliens: Colonial Marines", "ref": "https://multiplayer.it/recensioni/114597-aliens-colonial-marines-nessuno-puo-sentirti-urlare.html", "text": "Corporal Winter was nervous. After receiving a distress call from the USS Sulaco, the Colonial Marines had reached the ship and were proceeding to search for any survivors, but the operation had proved difficult from the start and the first teams sent had not returned. Winter was tasked with observing and reporting everything he saw to his superior, Captain Cruz; but ~see~ was a strong word, in the thick darkness that enveloped the corridors of the Sulaco, and which the torches barely pierced. The disturbing thing, however, is that there wasn't just darkness waiting for him and his companions. He could have sworn he saw something move and hiss ominously, something large yet swift and elusive like a lizard. The only thing he could do was concentrate on the mission and hope that everything went well, but the sight of some corpses with a strange hole in the chest did not bode well. We can certainly speak of a troubled development for Aliens: Colonial Marines: SEGA and Gearbox Software had announced back in 2006 that they were working on a project related to the Aliens franchise, revealing the official title two years later. Work has progressed slowly for various reasons, so what is being delivered to us today is, similarly to Duke Nukem Forever, a first person shooter a bit out of time. The plot stands as a direct sequel to the film ~Aliens: Final Clash~ as you may have understood from the first lines of the introduction, and sees us take on the role of corporal Christopher Winter during a rescue operation by the Colonial Marines against the crew of the USS Sulaco, the ship on which Hicks, Ripley, little Newt and the android Bishop were. From the fucking walls The Aliens: Colonial Marines campaign consists of eleven levels and can be completed in about five hours, which seemed decidedly little even compared to what Rebellion did in 2010 with Aliens Vs. Predator. The action takes place within different scenarios, from the already mentioned Sulaco to the surface of LV-426, the moon which is the backdrop to the first discoveries of the film ~Alien~, and our character is almost always accompanied by other marines, this element is closely linked to the possibility of playing the campaign in cooperative multiplayer mode for four players (see box on the online sector). It should be noted, however, that Gearbox did not intend the presence of allies as an excuse to completely ~script~ the execution of the missions, with the companions who go on and we who have to follow them without making the slightest thought about where to go and what Do. No, fortunately we were spared this interpretation in favor of a more solid and traditional approach, in which it is up to us to make the choices and dictate the line, and then enjoy the possible support of the allies on duty. And so here we are to weld or unsolder doors, just as we saw in the sequel directed by James Cameron, to deactivate automatic turrets by finding the best path to avoid shooting at us and to use the famous proximity detector to determine the presence of enemies in the surroundings . Unfortunately, this last feature has not been implemented in the best way, in the sense that after some experiments we will find ourselves putting the device away and trusting only the ~beep~ emitted when there is a very close signal. The matter would have been different if the Xenomorphs had often taken advantage of the ventilation channels to take us by surprise, but since in most cases their presence is clearly visible, the use of the scanner is limited to pure fan service. Compare versions We tested the game in the PC and Xbox 360 versions, eventually noticing few differences beyond the higher resolution and a frame rate which, in the test configuration, maintains 60 frames per second without problems with all parameters at maximum . As mentioned in the body of the review, Aliens: Colonial Marines unfortunately does not support DirectX 11 and the video options available are relatively limited: you can select the resolution, activate or not vertical sync and FXAA (the only anti-aliasing available), then possibly scale the field of view and level of detail of textures, background and shadows to achieve more fluidity on less powerful PCs. The computer version natively supports the Xbox 360 controller and the layout of the controls is identical to that on the Microsoft console, but of course you can also use the mouse / keyboard combination. On Xbox 360 the frame rate is pegged at 30 FPS and the resolution is 720p, but in terms of detail and field of view there is no abyss at all, indeed catching the differences is often revealedor difficult. I want to introduce you to a personal friend of mine There is certainly a certain progression in the story that we are told by Aliens: Colonial Marines, even if the situations are basically what any fan of the series expects to see. Even on the opponents' front: we go from ~spiders~ to classic Xenomorphs, from sightless variants to those that spit acid from afar, ending with the biggest and most dangerous specimens, including the queen. In the middle there are also the mercenaries in the pay of Weyland-Yutani, the mega corporation interested in studying aliens to try to control them and make a weapon of them. It is a pity that the same approach has not been dedicated to the management of weapons, which are not only assigned to us in a confused way but without even the due valorisation. Let's try to explain ourselves better: the basic equipment of our marine is made up of a pulse rifle (equipped with the same, identical sound effect of the film ~Aliens~, for the record), a shotgun, a service pistol and from a grenade. In short, the traditional quadruple slot of many FPS, which however is soon enriched with some variants: assault rifle, battle rifle, machine gun, tactical rifle and assault pistol. Each of these weapons can be upgraded by accessing the appropriate screen, replacing the default sight with a red dot and modifying the appendage to allow it to house a flamethrower rather than a grenade launcher, and so on. The problem is that by tackling the campaign on the ~normal~ difficulty level (there are four in all) not only have we never run out of bullets, but we haven't even felt the need to try all the weapons available. We never threw a grenade, nor did we find ourselves using the pistol except in the sequences where a ~scout~ Xenomorph swoops down on us and, from the ground, we open fire with the first thing at hand. It's obviously a design problem when you have a certain amount of weapons, individually more than good and have a decent ~personality~, but you don't in any way spur the player to try them, you don't create situations where it's necessary ~ get by~ and therefore perhaps discover the advantages of a specific machine gun rather than the shotgun. The multiplayer modes The online sector of Aliens: Colonial Marines includes a cooperative multiplayer mode for four players and four competitive modes for up to ten players: ~Death Match~, ~Extermination~, ~Escape~ and ~Survivor~. The offer is in many ways similar to that of Left 4 Dead: in competitive modes you can enter the marine team or the Xenomorph team, and in the latter case you can select the type of alien (soldier, spitter and lurker ), each with their own special attacks. The problem is the many glitches and the extreme lag we encountered during the games, and which in particular makes it difficult to play with the Xenos. The cooperative mode is much better, which especially at the highest level of difficulty can represent an extra value compared to the single player campaign. We take off and nuke At the beginning we defined the new Gearbox Software title as a first person shooter a little out of time, and this description proves to be particularly fitting if we analyze the technical sector of the game; even more so if we consider the PC version and compare it with the Xbox 360 version, since we have tested both. Colonial Marines runs on a modified version of the Unreal Engine 3, called ~Red Ring~ and equipped with an advanced lighting system. The rendering of lights and shadows is actually more than good and the level design helps in this sense, alternating completely dark scenarios with others in which there are few light sources. Unfortunately, however, the strengths end here and leave room for a lot of perplexity, primarily as regards the quality of the polygonal models and the degree of general ~refinement~. Beyond details such as the interpenetrations and the nice bug of the enemy soldier who becomes gigantic as if it were Ultraman (see image), we are absolutely not at the level of the latest console productions and, in the PC environment, the comparison with a certain Crysis 3 is merciless. We're talking about different generations, really. That Gearbox has worked on Xbox 360 and PlayStation 3 and then converted to PC is also clear from the lack of advanced options for graphics, where the aforementioned Aliens Vs. Predator supported DirectX 11 and tessellation, but not only: despite being released three years ago, the Rebellion title boasted more convincing animations (especially on the Xenomorphs front) and curedsubstantially better the death sequences, which in Colonial Marines are really botched, with a pathetic surveillance camera-style gray screen. Fortunately, better has been done for the audio sector, which boasts not only the original music of the film and, as already mentioned, various effects that fans will immediately recognize, but also a very well done dubbing in Italian, apart from a few small flaws (and a particularly unhappy choice, but we don't want to anticipate anything).", "date": "2013-02-12", "grade": "6.8"}