{"name": "Supereroi a tavoletta", "ref": "https://multiplayer.it/recensioni/114519-marvel-avengers-battaglia-per-la-terra-supereroi-a-tavoletta.html", "text": "Marvel Avengers: Battle for Earth represents a more than discreet attempt to combine some of the most famous superheroes of American comics, such as Spider-Man, Iron Man and the Hulk, with casual fighting game mechanics, designed for a movement. To make an immediate comparison, the developers of Ubisoft Montreal have certainly done a better job than that of Spike with Dragon Ball Z Kinect, however based on similar prerogatives. Goku's Kamahameha wave or Vegeta's Big Bang Attack are in fact comparable to a bolt of lightning emitted by Thor's powerful Mjolnir hammer or Iron Man's uniray, and the fact of being able to perform these maneuvers ~live~ translates into a great hype for fans of either franchise. Our intention is not to draw a parallel between manga and comics, but simply to express a concept: bearing in mind the current, undoubted limits of motion detection controls, it would have been hard to create something more ~effective~ than Battle for the Land under the Marvel license. In its Xbox 360 version (here the review), in fact, the game exploited the features of Kinect in a commendable way, from the perception of movements to voice recognition, offering us a casual experience, we reiterate it, and without the typical depth of fighting games. , but in the same way the more engaging and fun the higher our liking for the various superheroes was. And on Wii U? What solutions have been adopted to carry gameplay of that type on the GamePad? We tell you right away. Two games in one Based on the events of the ~Secret Invasion~ saga, in which an army of dangerous Skrulls took on the guise of some heroes in order to carry out a powerful attack on Earth, Marvel Avengers: Battlefield Earth is a kind of tag team fighting game with a visual in the third person, in which we are asked to control two characters from time to time (who can take turns at any time) and face a pair of shape-shifting aliens who have also acquired the abilities of the various Spider-Man, Thor, Magneto and etc. First of all, let's clarify one thing: to fully enjoy what the game offers to owners of the Nintendo console, you must also have a sensor bar, a Wii-mote and a Nunchuk. The reason is obvious: this new edition of the Ubisoft title can be played both on the GamePad only with the TV off, using the stylus on the touch screen to draw the symbols that characterize each attack maneuver, and keeping the TV screen as a reference and using motion detection in a similar way to what was seen on Xbox 360. Similar but, let's face it, not the same: where Kinect detected the exact assumption of a ~pose~ for a couple of seconds, so as to activate the move connected to that specific gesture, on Wii U not only is the range of positions generally lower (to be honest, there are characters who perform their entire repertoire of moves through the same action) but also in terms of precision the level is much lower: many times just shake the Wii-mote for the software to understand a command that was not actually sent. Furthermore, the ~icing on the cake~ of voice detection is missing: although the GamePad has a microphone, this is not used and the most ardent fans will therefore have to give up verbal commands. Finally, there is a pressing balancing problem: on the Microsoft console it was necessary to lean left or right for our superhero to dodge, while in this edition it is enough to act on the analog stick, with all the comfort in the world but creating a problem in the already delicate management of the difficulty. Ultimately we are talking about a casual production, very pleasant for a young enthusiast but at the same time devoid of particular depth and quite easy to complete in the forty stages that make up the campaign. Superheroes to touch We talked about the first and best experience with Marvel Avengers: Battle for Earth, or the one that can be enjoyed by equipping yourself with a sensor bar, a Wii-mote and a Nunchuk. But what if we don't have such peripherals? In this case the game works only on the GamePad screen, in a mode let's say ~natively with the TV off~, with the various moves that must be performed first by touching an icon on the screen, then drawing a drawing as accurately as possible. It is an imaginative and effective interpretation, which moreover paves the way for possible conversions in the mobile sphere (it would be a pity if it didn't happen), but which when tested does not stand comparison with the physicality and involvementmotion detection controls. Moreover, the already mentioned balancing problem is felt even more on the GamePad, given the greater simplicity with which it is possible to ring together devastating combos and knock out your opponent. This Wii U version unfortunately lacks online multiplayer support, but on the other hand it is possible to organize tournaments for up to four participants and play in co-op or against each other by crossing the controllers, or by referring to the 'one to the TV and the other to the touch screen. Finally, as regards the technical sector, we have not noticed any differences compared to the Xbox 360 edition: the polygonal models are well made, they faithfully represent the cartoon counterparts of the various characters and have a good set of animations, but above all it is the visual to play a fundamental role thanks to its incredible dynamism, between zoom and movements that contribute substantially to liven up the action. The music, effects and dubbing in Italian are also good.", "date": "2013-02-08", "grade": "7.0"}