{"name": "Escher sarebbe contento", "ref": "https://multiplayer.it/recensioni/114354-antichamber-escher-sarebbe-contento.html", "text": "The first time you start Antichamber, you can't help but notice its minimalist visual style, made up of elementary geometric shapes and sharp colors, almost without any frills. Then the first steps are taken, a little displaced, in the initial room, where there is the options wall (a real wall with the various settings that can be modified in real time), an interactive map, which we will soon discover very useful for navigating the bizarre maze in which we will get lost, and an empty wall, which in the continuation of the adventure will be filled with advice with drawings and texts. Once you enter the labyrinth, you look around and don't notice anything in particular, then suddenly you find yourself without points of reference. We are told to jump, we do, but end up in a new room with a design printed on the wall. By clicking on it, a tip appears, which looks like a kind of life maxim. An aphorism? We will soon discover that this undefined place is full of these little squares that carry the wisdom needed to interpret what happens on the screen. Antichamber acts continuously on the perception of the player, displacing him, bewildering him, forcing him to rethink some typical attitudes of the gamer, forcing him to experiment and, in general, asking him for a cognitive restructuring. Alexander Bruce, the developer, plays with space by creating an environment with indecipherable boundaries, where every line and every wall can be a lie; simple images that hide an access route to another environment or the resolution of an enigma. It only takes a few minutes to feel trapped in a kind of interactive Escher painting, in which geometry defies logic and everything one does seems to produce only unexpected, as well as unsettling, outputs which seem to distance any possibility of understanding, as if everything happens it was an end in itself. Out of the labyrinth Let's take a simpler puzzle. Ended up in a room with only one access, we follow a black corridor that takes us, after a series of turns, in front of two flights of stairs: one goes up, the other down. Taking the one that goes downwards, you find yourself back in the first corridor and moving forward you reach the stairs again; taking the ladder that goes upwards you find yourself in a dead end. If you want, you can go back to find yourself in a new corridor that allows you to go back to a previous point on the map, where you can deal with a modified puzzle compared to the first time we were in the same place (even the description is quite convoluted, there are we realize, but it is precisely this conceptual labyrinthineness that is the beauty of the game). Continuing along a path dictated by natural reactions to various visual stimuli, we come to one of the numerous and already mentioned pieces of advice which invites us to look for a road where we thought there was none. It wasn't easy to interpret it at the time, but our wanderings meant that we found ourselves in the room with only one access described at the beginning of the paragraph. Taking the already traveled black corridor, the advice came to mind and we finally saw a hidden corridor, very difficult to identify in normal conditions. Starting a new game and returning to the same place, we immediately found the corridor, which therefore was not actually related to the council except in terms of the approach needed to find it; letting ourselves be guided by our perception, we hadn't noticed the presence of that access, but starting with the right cognitive doubt, we interpreted that black in a different way and there, where we hadn't seen anything, because we were convinced that there was actually nothing, we finally found an essential way to continue in the game. And this we have told you is only one of the countless situations in which Antichamber invites the player to re-evaluate and re-read his perceptions to find the right path. A new Portal? Looking at the images and trying to understand the style of Antichamber, many will surely think of Portal from Valve. If it is true that both titles share the desire to experiment with playful solutions using space in a creative way, as only video games allow, Antichamber has an extremely different focus from that of Portal, the latter more concentrated on proposing a series of puzzle with a recognizable thread linked to the idea of portals and their intense exploitation. Antichamber instead tries to vary the puzzles as much as possible, basing its essence on the player's loss in his metaphysical canvas. Gestalt Antichamber theorizes in the best way that denying the player's logical and gameplay expectations does notit is a crime but, on the contrary, it allows us to open up to him creative and different worlds, otherwise impossible. There are original elements even when events seem to take the already seen path. For example, when you find rifles that allow you to collect colored cubes, useful for various purposes, you expect a greater linearity in the plot of the puzzles, a linearity that never comes. Some might argue that the game is short (we finished it on the second go, about three hours total), but that would be a bit unfair, as the developer has gone to great lengths to avoid repetition, in order to create the most intense and varied experience possible. If he had started to recycle the same puzzles he would certainly have lengthened the broth, but the result would have been worse and less fascinating, as well as more complicated to manage in terms of involvement (if you base your work on Gestalt psychology, you cannot repeat times the same trick, otherwise you lose the bewilderment in the viewer necessary to make the experience credible). In short, you will have understood that Antichamber is a title with many facets that deserves to be played even if only as an impromptu experience. Avoid it only if you hate puzzle games and if in your heart of hearts you think that De Filippi is a beautiful woman.", "date": "2013-02-06", "grade": "9.0"}