{"name": "Italia's got shooter", "ref": "https://multiplayer.it/recensioni/114288-syder-arcade-italias-got-shooter.html", "text": "First work of the Studio Evil team from Bologna, Syder Arcade was released in April of last year in digital delivery on PC and Mac, gathering considerable acclaim thanks to a retro style that brought back to the classic Amiga shooters and a more than good technical realization. all assisted by an extremely attractive selling price. Since this is a genre that lends itself very well to mobile gaming, the developers have well thought of creating the iOS version here, already available on iTunes for only 89 cents: let's see if the transition from the big to the small screen was painless. All around you Syder Arcade is a hard and pure conversion, which therefore does not include content additions compared to the original released on PC and Mac, of which we invite you to read our review if you want to know more. We're talking about a multidirectional scrolling shooter, made up of six levels that don't follow the classic pattern of the genre but look more like arenas, with enemies attacking from both sides of the screen. The story that forms the background to the action is small, and only serves to give the minimum wage in terms of setting: the space colony of Miza is stormed by an unknown hostile force, and it is up to the user to jump to board a spaceship and make the lasers talk. As mentioned above, the campaign consists of six stages with slightly different objectives, but all linked by the common denominator of blowing up the enemy ships that peep out on the display. To do this, it is possible to choose between three distinct aircraft, which perfectly reflect the stylistic features of the great classics: there is the slow but powerful medium, the agile one but with lighter shields and the inevitable middle ground, each capable of provide a palpably different feeling than the others. On the control system front, the work done by the Studio Evil guys is to be considered more than good, given the satisfactory reactivity that the virtual keys have been able to demonstrate both on the iPhone and on the iPad: the left side of the screen houses the stick to direct the spaceship, while on the right are the two icons useful for launching the special weapon and changing direction of travel, with fire managed instead automatically. In the comparison between the two Apple devices on which we tested the game, the Cupertino tablet comes out the winner not so much for the convenience of the controls, but rather for the larger screen size that guarantees a more defined view of the game action. The main graphic elements of Syder Arcade (ships, projectiles, upgrades) are in fact rather small, and the display of an iPad allows them to be better appreciated together with the interface placed in the upper part of the screen, with a particular mention for the radar, indispensable for identifying the most pressing threats to neutralize. Beyond these small differences, the Studio Evil title is equally entertaining on any device you use it, thanks to a frenetic and pleasantly old-school gameplay, which winks at the shooters of the old guard especially when selecting the levels of higher difficulty. Once the campaign is completed, there is still room for a demanding Survival mode and obviously for the leitmotif of every self-respecting shooter, that is to retrace one's steps to aim for better scores: seen from this point of view, Syder Arcade offers absolutely satisfactory in relation to the price at which it is sold, another arrow in the bow of one of the most attractive titles of the moment on the App Store. Finally, it doesn't hurt that the Studio Evil product is also very graceful from a technical point of view, with defined graphics, with attention to the smallest details and with truly noteworthy special effects, while the soundtrack reiterates the nostalgia effect thanks to music inspired by the Amiga era.", "date": "2013-02-05", "grade": "8.8"}