{"name": "Siamo una squadra mortissimi", "ref": "https://multiplayer.it/recensioni/113989-undead-soccer-siamo-una-squadra-mortissimi.html", "text": "After Slant Six Games' experiment with The Bowling Dead, other development teams decide to try their hand at ~flick~ mechanics applied to the zombie theme. The protagonist of Undead Soccer, for example, is a footballer who has to deal with hordes of dangerous zombies who suddenly begin to emerge from the ground and who approach him with bad intentions. With no other weapons at his disposal than a virtually infinite supply of leather balls, the brave player begins to throw some set pieces and hit the undead between the eyes, realizing that the technique seems to work all too well. The action that is proposed to us by CGMatic in this new BulkyPix production develops through seven scenarios, without interruption and relying on the more traditional ~survival~ structure, in which therefore you play until game over with the aim of reaching as far away as possible. Each level involves the elimination of a certain number of enemies, which appear, however, not only in the central part of the view but also on the sides, well hidden from view. This factor leads us to tilt the device precisely to understand if there are threats coming from the lateral areas, which constitutes a nice change compared to the genre while giving the impression of an approximate implementation. The presence of any zombies out of sight, in fact, is not reported to us in any way and we may notice their arrival too late. Tiger Shot! Unlike the aforementioned The Bowling Dead, the freemium dynamics of Undead Soccer are anything but stringent: the balls at our disposal in each stage are infinite and in the same way the completion of the levels translates into the earning of a fair amount of credits , which can be spent to improve the character's abilities (for example making the shot stronger), increase the slots for special powers and the effectiveness of the latter. As we throw balls at the zombies, various objects are released on the ground that give us special abilities. In the case of the pistol, you immediately enter a fire mode and just touch the targets to eliminate them, but in all other cases the upgrade will be stored in an area on the right of the screen, which can be recalled at any time. In general, it is possible to get rid of opponents with simple shots, but some monsters have greater resistance and it is necessarily necessary to resort to a special shot, even in the perspective of a boss fight (yes, there are also bosses). From the point of view of the variety of enemies, special shots and the upgrade system, the developers of Undead Soccer have done an excellent job, and in fact the games flow like a pleasure, also made pleasant by a rather precise and reliable control system . The limits of this title are found in the aforementioned presence of unmarked enemies on the sides of the view, but above all in the management of collisions when a monster eventually gets close enough to hit us. In that case, in practice, the game over is incurred but without having fully understood what happened. It is possible to activate a shield (regulated by a cooldown) to defend against certain attacks, but in the end this element does not seem to fit well into the gameplay and ends up being ignored even when perhaps it could be useful. Finally, the pleasant graphic style and the successful characterization of the monsters collide with a truly essential animations, which could certainly have been more accurate.", "date": "2013-01-31", "grade": "7.5"}