{"name": "Canta che ti passa", "ref": "https://multiplayer.it/recensioni/113889-sing-party-canta-che-ti-passa.html", "text": "Shown to the public for the first time at the last E3, SiNG Party promised a slap-up party game, thanks to the peculiar characteristics of the GamePad. In the trailers the game was shown in action with all its ~social~ facets, friends participating in the choir and, most importantly, the lyrics of each song shown directly on the screen integrated into the controller instead of just on the TV, so as to allow anyone to sing with their faces turned towards each other instead of glued to the TV. Elements that may seem irrelevant to those who have never tried karaoke, but which make the difference between a ~single~ or ~collective~ use of the experience, provided obviously that you share the room with the right people. For example, a group of girls at a birthday party would have a great time with SiNG Party, but this does not exclude that the tracklist can also arouse interest in decidedly more mature people. There are fifty songs present in this new casual production by Nintendo but, at least for the moment, there are no expansions or extra packages available for purchase on the eShop. We hope that this will be done quickly (there is already a reference on the official site, but no news yet on when) because, in our opinion, the initial offer is not heterogeneous enough and the competition (particularly SingStar on PlayStation 3 , recently switched to free-to-play format) offers much more choice. Songs and modes From the Beach Boys to Queen, from Alanis Morissette to Lionel Richie, from Bruno Mars to Lady Gaga, the guys from FreeStyleGames (formerly authors of DJ Hero) have tried to create a tracklist that includes the most representative songs from various eras, but the the impression is that instead they have fished from a cauldron of pieces that often and willingly do not correspond to the definition of ~classic~ or ~hit~; see Nickelback's ~How you remind me~ (does this sound like their forte?), Rihanna's ~Only girl (in the world)~ or Michael Bubl's ~Haven't met you yet~. We admit that we are used to listening to other things, but never as in this case have we been faced with an almost completely unknown tracklist, and this cannot be considered a point in favor of SiNG Party. So check the songs included in the game well before proceeding with a possible purchase, otherwise you could be very disappointed. The package includes a USB microphone equipped with a sufficiently long cable and the synchronization operations between audio and video are very fast, so it is possible to start singing after just a few minutes, without any particular tutorials or adjustments. There are four modes available: ~Party~, ~Singing~, ~Team~ and ~Test~, with the latter serving precisely to become familiar with the system and with the software's evaluation meters, which in certain situations analyzes our intonation, the power of emission and the ability to vary on the notes to assign us a score at the end of the performance. Ciro, sing jamme! The ~Party~ mode is the most engaging, at least on paper. In fact, while a person sings, his friends can possibly connect Wii-motes and contribute simple sounds to the execution of the song, or sing in chorus or even dance following the choreography that is shown on the screen. Let's say that at this juncture fantasy matters more than technique, given that the game does not evaluate our performance in any way nor can it detect the movements we make or understand whether we are dancing or not. In short, it's a bit like standing in front of the stereo with friends and playing silly while our favorite song plays, nothing more and nothing less. It's a different story when you switch to ~Singing~ mode, for one or two players. In this case the selected songs are evaluated by the software taking into consideration, as already mentioned, our intonation, vocal emission and ~talent~, producing a score at the end of the performance that we can also share on Miiverse. Then there is the ~Team~ mode, in which two teams compete on the basis of a playlist that can be determined by a player excluded from the competition, who at the end can also play the role of judge and assign their votes. Some considerations In some circumstances the GamePad is exploited well and allows, for example, to add songs to the list or to adjust the levels of the microphone or of the original voice (it can be kept high or eliminated), even adding a pinch of reverb to make the sound more convincing. However, the potential of the Wii U controller is quite different and we thought that a karaoke-style application wouldand lent very well to highlight them, which instead occurs only minimally with SiNG Party. The point is that many of the features that the game boasts on paper are only ~imaginary~, and this will only disappoint users with a minimum of experience. Furthermore, the tracklist, as mentioned, seemed rather lacking to us and at the moment there are not even packs of songs that can be purchased on the eShop, which means that we will have to wait to have a little extra choice. That being the case, our suggestion is to wait for some DLC to appear on the eShop, or in any case to carefully evaluate whether the songs present are suitable for a party with your friends. SiNG Party tracklist ~All About Tonight~ - Pixie Lott ~Alone~ - Heart ~Always on My Mind~ - Pet Shop Boys ~Baby~ - Justin Bieber ~Call Me Maybe~ - Carly Rae Jepsen ~Dancing on the Ceiling~ - Lionel Richie ~Daydream Believer~ - The Monkees ~Don't Hold Your Breath~ - Nicole Scherzinger ~Don't Leave Me This Way~ - Thelma Houston ~Don't Stop Me Now~ - Queen ~Firework~ - Katy Perry ~Flashdance... What a Feeling~ - Irene Cara ~Glad You Came~ - The Wanted ~Go Your Own Way~ - Fleetwood Mac ~Groove Is in the Heart~ - Dee-Lite featuring Q-Tip and Bootsy Collins ~Haven't Met You Yet~ - Michael Buble ~Higher~ - Taio Cruz featuring Kylie Minogue ~How You Remind Me~ - Nickelback ~I Believe in a Thing Called Love~ - The Darkness ~I Got You (I Feel Good)~ - James Brown ~I Think We're Alone Now~ - Tiffany ~I Want You Back~ - The Jackson Five ~I Will Survive~ - Gloria Gaynor ~I'm Yours~ - Jason Mraz ~Ironic~ - Alanis Morissette ~Jar of Hearts~ - Christina Perri ~Just a Kiss~ - Lady Antebellum ~Just The Way You Are~ - Bruno Mars ~Kids in America~ - Kim Wilde ~Le Freak~ - Chic ~Love You Like A Love Song~ - Selena Gomez & the Scene ~Mercy~ - Duffy ~Only Girl (In The World)~ - Rihanna ~Party Rock Anthem~ - LMFAO ~Satellite~ - Lena ~Sexy Chick~ - David Guetta ~Show Me Love~ - Robin S. ~So Good~ - B.o.B. ~Surfin' U.S.A.~ - The Beach Boys ~The Climb~ - Miley Cyrus ~The Edge of Glory~ - Lady Gaga ~The Power of Love~ - Huey Lewis and the News ~The Shoop Shoop Song (It's in His Kiss)~ - Betty Everett ~Theme from New York, New York~ - Frank Sinatra ~Walking on Sunshine~ - Katrina and the Waves ~Y.M.C.A.~ - The Village People ~You Can't Hurry Love~ - The Supremes ~You've Got the Love~ - Florence + The Machine", "date": "2013-01-30", "grade": null}