{"name": "Coromon", "ref": "https://multiplayer.it/recensioni/coromon-la-recensione-di-questo-intrigante-pokemon-like.html", "text": "The Pokemon-like genre, or monster taming games, is a very complex genre to judge. In fact, there are few titles that have managed to emerge on the market by winning a large share of fans and revenues. The last exponent of the genre (which still boasts numerous releases every year) to have succeeded in this endeavor was Temtem. However, for some years now, a title has attracted the attention of fans, it is Coromon. The game has had a fairly long development, with the possibility for players to test a substantial demo that is constantly updated over time. Finally, on March 31st, the definitive version of the game made its market debut and we are ready to tell you about our adventure in the hunt for new monsters to collect in the Coramon review. Not a simple Pokmon-like Coromon: the fight Coromon offers a simple and clear narrative, a plot that is not too layered, but still full of interesting and original ideas. In the Velua region resides Lux Solis, a scientific research center of which we are the new dueling researchers. Once our alter ego has been created with a decent depth of customization (net of the usual possibilities offered in this genre), the narrative incipit will be revealed to us and the adventure will begin in the most nostalgic way possible for fans of the first Pokmon games The structure is the classic one: the adventure continues by trying to capture as many Coromon as possible, training those captured and discovering the various mysteries of the plot. Obviously, the Spinners have taken over the most famous Pok Balls and the various potions and the like have been replaced by cakes, sprays and other various trinkets. One of the most interesting found is certainly the use of the Glove to solve some environmental puzzles. This technological glove will be updated as the adventure progresses and will allow you to interact with objects such as boulders, logs, etc. to unlock otherwise inaccessible routes. Finally, there will be the bad guys on duty: the Wubbonians. An organization that wants to exploit the Titanic Essence for evil purposes at all costs, but we won't tell you anything else to avoid excessive spoilers. Freedom and depth Coromon: a frozen cave However, the real peculiarity of Coromon is another. Speaking of gameplay, in fact, if on the one hand we have the classic turn-based combat that exploits the use of up to four actions in addition to objects, changing Coromon and escaping, on the other we have a different progression of Coromon growth. In addition to the usual exp level, Coromon can unlock their potential from time to time by allowing the player to modify (by adding points manually) the stats of the monster in question. It is therefore possible to grow one's Coromon following a very specific strategy, this offers the player a considerable depth which increases the feeling of being faced with a title that really has its own peculiar charm. The monsters will be 114 and their types 13, but to this is added the possibility of finding Coromon with rare traits. The system works the same as with Shiny Pokmon, with the difference that in this case, the rarity also affects the power, making these versions much more powerful than their normal counterparts. What makes the nose turn up a bit is the design of the Coromon. In fact, there are few memorable monsters in the game. Most of the Coromon are very impersonal or too similar (in some cases bordering on plagiarism) to their Game Freak counterparts. What makes TRAGsoft's title very interesting is the whole substratum of secondary missions and puzzles created by the developers. Coromon in fact breaks the monotony of the classic system of monster taming titles through a series of original ideas linked both to the settings and to the characters we will meet during the adventure. For example, there will be a very difficult quiz to face in a library, and we won't tell you anything else to avoid making too many spoilers of the most original parts of the adventure. Other points in favor of the experience offered by Coromon are the quality general of the pixel art and the visual feeling of Coromon, which especially in the settings tries to give a great sense of variety, but also the sound sector that tries to accompany both the fights with sounds associated with monsters, and the exploration with suitable music to locations and encounters with peculiar characters.", "date": "2022-04-09", "grade": "8.0"}