{"name": "Knytt Underground", "ref": "https://multiplayer.it/recensioni/113389-knytt-underground-storie-dal-sottosuolo.html", "text": "~My games are nothing great, but one has become quite popular.~ This is how, with an ill-concealed thread of modesty, the Swedish developer Nicklas Nygren summarizes his fame within the community of independent developers on Twitter. Many of the video games he has made so far are linked by a particular red thread, in the name of exploratory experiences and the fascination of discovery, but the Scandinavian author undoubtedly owes his fame to the Knytt series, and in particular to that Knytt Stories that with its level editor it has become a small cult among the most creative players, confirming Nygren as one of the most interesting exponents of the Scandinavian independent scene. First released on PlayStation Network and later on PC, Knytt Underground is not only a new chapter larger and more accurate than the previous ones, but it is the summation of the main works created by the Swedish author, combining the taste for the aesthetics of NightSky, the singularity of the landscapes of Saira, and that mix of immediacy in the controls and narrative ambiguity that characterized Knytt and Within a Deep Forest. Speechless adventure The first two Knytts were decidedly atypical platformers, with very minimalist graphics, almost non-existent enemies and a plot that was barely mentioned but then left completely in the background. The focus was all on the atmosphere and simplicity of the controls, ensuring an almost relaxing experience as the player clambered up walls and leapt from ledge to ledge in an attempt to seek out new passages. Knytt Underground takes this concept and embroiders on it, again telling a vague story full of questions. Set in the same universe as Within a Deep Forest and the previous Knytts, the adventure takes place in an underground world colonized by fairies and bizarre creatures, after the surface has turned into a contaminated and unlivable place. The author's first and most interesting device concerns the interaction with the secondary characters. In fact, the player takes on the role of Mi, a small mute creature who, due to his handicap, can only communicate with the help of two fairies encountered very early in the game. For each dialogue, it is thus necessary to choose which of the two spirits to intervene, not knowing the answers but bearing in mind that each fairy has a particular character and very specific interests: Cilia, for example, hates religion and always seeks rational answers, going on a rampage if he is faced with a preacher, while Dora has a more calm and helpful personality towards others. While remaining a side element, the amount of dialogues and subplots is much higher than in previous games by Nygren, who in some cases appears in the game as a sort of external narrator. Playstation 3 trophies Knytt Underground is not a simple platinum: the twenty unlockable Trophies not only challenge you to reach well-hidden secret rooms, but also to solve side missions, complete puzzles and witness an alternative ending. The charm of exploration Knytt Underground is divided into three chapters, two of which act almost as a tutorial: in the first you play as Mi, practice her climbing skills and get familiar with some environments, while in the second you control a bouncing ball named Bob , able to weigh down and reach previously inaccessible areas with a jump. It is a rather linear prelude, which leaves a certain freedom of exploration but which ultimately guides the player towards the third and final chapter. It is precisely here that the game is shown in its entirety, allowing the user to transform into Mi or Bob if necessary, and thus giving him the possibility of combining their jumping and climbing skills to access the entire map. Map that is five times that of the original Knytt in size, challenging you to explore 1800 rooms full of little secrets and environmental puzzles. In short, the mechanics of Knytt (Mi) and those of Within a Deep Forest (Bob) are mixed within the same game, but the result is decidedly coherent and has allowed the development team to indulge themselves in creating a more level design complex and interesting. The ultimate goal is to play six bells hidden underground, but in an attempt to reach them you often end up exploring alternative routes or tackling small side missions. Knytt Underground is pure exploration: no more and no less. Despite the presence of some traps to overcome, the game is a sort of Metroid from which they have stripped away the action component, focusing all attention on the discovery of new areas and on thepuzzle solving. Such a choice obviously ends up alienating those who love a certain type of progression in games, both in mechanics and in narrative, but Nygren's formula has once again led to a relaxing, almost Zen platform. Change of style In Underground, one of the most evident innovations compared to Knytt and Knytt Stories undoubtedly concerns the aesthetic component, which while remaining simple and not showing off particular graphic effects, offers visually spectacular moments. Much of the credit goes to backdrops full of charm and a successful game of silhouettes, lights and colors. Perhaps the extremely simplified sprites and the rough pixel art gave the previous chapters more personality, but also from a graphic point of view it is evident how the author wanted to mix together the most distinctive features of his latest games, such as the choice of black for the silhouettes of the platforms and environments, clearly derived from NightSky, or backdrops that mix photographic and vectorial material, an evolution of what has already been done with Saira. Similarly, the music is a real homage to Nygren's longtime fans, as it mixes new songs with arrangements of some already heard in Within a Deep Forest, while we appreciated that the soundtrack just sits on the background and to accompany the player's adventure in a sober way, without ever taking over.", "date": "2013-01-18", "grade": "8.5"}