{"name": "Patrick's Parabox", "ref": "https://multiplayer.it/recensioni/patricks-parabox-recensione.html", "text": "Creating a puzzle game is not easy at all. Not only must you have a good starting idea, but it is essential to be able to iterate that idea over and over again, varying it, finding a new facet. You also need to make sure that the difficulty increases in the right way, at a pace that is satisfying for the players but at the same time does not impose sudden difficulty spikes. Patrick's Parabox manages to do all of this. Here is our review of Patrick's Parabox, a puzzle game based on boxes that fit inside other boxes. Boxes and paradoxes Boxes inside boxes, this is Patrick's Parabox The starting idea is very simple. We are a box with eyes and can move in the four basic directions. Our goal is to move a colored box within a specific space and then position ourselves in an arrival place. To be generous, we could say that Patrick's Parabox is just that and nothing more. That wouldn't be an incorrect explanation, but it clearly wouldn't do justice to the brilliance of Patrick Traynor's game. Very clearly, the game is divided into a number of areas, each of which introduces new ideas that allow you to move the boxes in a different way. We start, for example, with boxes that are themselves a space within which to enter and move. We soon find ourselves traveling from inside one box to another, it being understood that we must find the right point in which to block it so that it does not move. Spaces then begin to be inside other spaces, so an exit becomes an entrance and vice versa. We know that put into words it seems to make no sense, but this is the genius of Patrick's Parabox: despite being a continuous physical and logical paradox, it works perfectly and the solution is always understandable. As mentioned at the beginning, one of the strengths of Patrick's Parabox is that, despite being one of the most immersive puzzle games we've played for a long time, it's never unfair or unclear. Each new area introduces the new mechanics in a simple way and offers very simple first puzzles so that you can immediately practice with the idea just proposed, whether it is a box that clones other boxes or one that repeats every action but in a mirrored version. The first levels, as a rule, are completed in a few seconds and only in the following ones do you find yourself having to really think about how to find the solution. There are also many optional levels of seriously higher difficulty. The latter are the real highlight of Patrick's Parabox, as they offer the best ideas. In various areas the number of optional levels equals or exceeds the number of levels required for advancement. For this reason, while it is true that even those who are less experienced can reach the end of the game, it will above all be the players who want to be tested who will have the most fun. Even longevity can easily double if you are to complete all the puzzles. There are also some extras with a completely different style (you'll find out), to which can also be added some special Objectives that ask you to create paradoxes within the paradox (such as extracting a box from itself and reaching the end of the universe... we are not joking). Graphics, sound and style Say hello to yourself in Patrick's Parabox Everything perfect, then? Depends. If you are looking only for raw gameplay from a puzzle game, then Patrick's Paradox will not disappoint you even for a second. If, on the other hand, you are looking for something more, then you have to deal with its indie nature. Patrick's Parabox, pardon the repetition, is a game about a colored box that moves a colored box into a colored box. There aren't many ways to shuffle the cards on the table and, aside from some color variations, the game is all the same in terms of visuals and stylistics. There is not much that can please the eye and after a while you may feel tired. The speech is similar with music: pleasant, above all because it is never annoying, but also in this case there is no space to propose sound effects or intriguing music. It also lacks a plot or some kind of context that knows how to intrigue. We are not dealing with a project like The Witness, for example, but neither with a simpler but still sophisticated Braid. Patrick's Parabox just wants us to play, one level after another, without a second of pause and therefore without downtime. For some it will be a strength, while for others it may be a demerit. If you are in doubt, know that a demo is also available: you will probably fall in love with it right away.", "date": "2022-04-08", "grade": "8.8"}