{"name": "Incastro bionico!", "ref": "https://multiplayer.it/recensioni/113406-anarchy-reigns-incastro-bionico.html", "text": "The future depicted by Anarchy Reigns is a dark and dangerous place, where genetic mutations due to a particular type of pollution have paved the way for cybernetic implants to replace deformed or missing limbs, while outside the cities controlled by the government reigns the most absolute anarchy. Within these no-man's lands, full of unscrupulous criminal gangs, bounty hunters like Jack Cayman move, who after the killing of his adopted daughter is hired by Jeannie Caxton to capture her father before the agents do of the government, since the latter have received the order to kill him. There's just one problem: Max Caxton is the very man accused of firing the shot that killed Jack's daughter, albeit unintentionally, back when he was the commander of the same strike team that's now hot on his trail. . Let's face it right away: narration is not the strong point of the latest Platinum Games title, which arrives in the West with a monstrous delay compared to the Japanese release but with two important bonuses: an attractive budget price ( 29.90) and some interesting extra content (the character of Bayonetta and two multiplayer modes: ~Dog Fight~ and ~Mad Survival~). Although the plot of the game has its elements of interest and represents in many ways a sequel to the events of MadWorld (the protagonist is the same), the way things are told is so confused and smoky that in the end we reach the truth of facts by intuition. Not bad, because in the end it is only a pretext to beat hands and in this situation the authors of Bayonetta damn well know their stuff. White or black? After a brief cinematic introduction (in Anarchy Reigns there are many, at the beginning and at the end of the stages, all of excellent workmanship) which presents the forces in the field, the single player campaign asks us to choose between the aforementioned Jack Cayman and police officer Leo Victorion, referring to a ~black area~ and a ~white area~ respectively. We tell you immediately that both campaigns must be completed twice, in both orders (black and then white, white and then black) to access the same final levels of the game, for a total of about twenty hours of gameplay. Of course, the events of each story mode remain the same regardless of the order in which we choose to face them, but the experience turns out to be quite pleasant after the somewhat confusing first stages, so it is a ~sacrifice~ that fans of scrolling fighting games will certainly agree to do. If the narrative direction of Anarchy Reigns is not the best, on the other hand the characterization of the characters is really excellent, especially in terms of design. Jack is a beefy bounty hunter, with a bionic arm that hides a double plasma chainsaw, while Leo is equipped with cybernetic implants in almost all of his body and powerful blades protrude from his forearms that are very reminiscent of those of Baoh (does anyone remember this manga, by the same author as JoJo?). The latter's companions, Nikolai and Sasha, are one the expression of power, with its huge electric forearms, and the other of speed, thanks to the sensual and agile shape. Then there are Jack's friends, in this case the ~pimp~ Baron Blacker (voiced by the legendary Massimo Corizza, who the more elderly will remember for having lent his voice to Devilman or Daigo in ~Gordian~ - hence the title of the review), with her fiery gloves, and her partner Mathilda, equipped with various BDSM-style tools. The roster has a total of sixteen characters that are unlocked during the single player campaign and can then be used in multiplayer modes, along with Bayonetta. In short, the guys from Platinum Games did not miss anything. Where anarchy reigns The story mode of Anarchy Reigns has a very simple structure, with eight ~phases~ set within four scenarios, each consisting of a certain number of main and free missions. The latter can be repeated indefinitely or even snubbed if we find a way to reach the score necessary to unlock the former, which actually move the plot forward. Understanding the mechanisms that regulate the unlocking of the missions and the design of the maps is not very simple at first and being faced with hordes of mutants who attack us relentlessly could appear hopelessly repetitive, but luckily the dynamics of the game gain in variety and protect us from the boredom of objectives such as ~kill a hundred enemies~ or ~survive for certain minutes~. During these phases we can move within ldecidedly large ocation, with various ~neighborhoods~ connected to each other by ramps, cables or powerful jets of air that project us from one side to the other in a few moments. Unfortunately, there are decidedly few internships that have impressed us, above all that of Hong Long, with its bold colors and a personality that instead we generally seemed to lack in the others, which are divided between ruined cities and ~building sites~, functional to the action but rather anonymous in appearance. An approach that is very reminiscent of God Hand, in which the backgrounds were bad but all the attention was focused on the fights; fights that in Anarchy Reigns obviously dominate and can count on a repertoire of moves that are not only wide but also terribly spectacular, with an excellent impact rendering and a sensible arrangement of the commands. At first, getting used to holding down the right trigger to parry attacks (and possibly dodging them by pressing A on the Xbox 360 controller or X on the Dual Shock) isn't such an intuitive practice, but you get the hang of it quickly and you understand that this choice was made to allow the left lat to activate aiming when a firearm is available. The lock-on system works well but not very well and the confusion is great when the opponents begin to be very numerous, reaching situations of real chaos when four gigantic mutants surround our character while he is with the back to the wall. Xbox 360 goals The objectives of Anarchy Reigns undoubtedly reward replayability, as it is possible to unlock several of them both by completing the levels on the normal difficulty level and on the ~hard~ difficulty level. Objectives are also obtained by obtaining all the characters on the roster, making a certain number of kills and performing particular moves a certain number of times. Multiplayer and technical sector There are really many multiplayer modes made available by Anarchy Reigns, thirteen if we also count the two extras to be unlocked via voucher. The most impressive is the ~Battle Royale~, where as many as sixteen players clash within an expansive map, each with the task of obtaining the most points and taking advantage of infinite respawns but with a ten-second wait for each respawn . It is an exceptional test bed for testing the game's netcode, and Platinum Games really comes out on top, managing to offer excellent matchmaking on both Xbox 360 and PlayStation 3 and, above all, decidedly acceptable and compatible latency times with fighting game mechanics, in which timing is essential to open the opponent's guard and respond effectively to his attacks. Of course, being sixteen to fight is a lot confusing, but we reiterate that the result obtained is excellent from the point of view of functionality. Although we cannot make precise and reliable measurements, we have however noticed several problems on the Sony console that make the online experience much less enjoyable, in particular a dancer frame rate and a lower degree of definition of the graphics than the Xbox 360 counterpart. comparative made with all the trappings to understand what the truth is. There are several team multiplayer modes, with and without respawns, as well as variations on the theme such as the classic ~Capture the Flag~ (for two or three teams), in which you have to collect a flag and bring it to your base to score points. The offer, we repeat, boasts extraordinary numbers for a title of its kind and for the moment the response from the public seems to be decidedly positive, in the sense that the waiting rooms are full and the budget price has certainly contributed to a greater diffusion of the produced in the west. Finally, moving on to the technical sector, as already mentioned, an excellent job has been done in terms of design and in the characterization of the characters, with cybernetic equipment that recalls those of the manga ~Alita~ (definitely an inspiration for the developers), very beautiful animations to see and spectacular cinematic sequences, while the scenarios instead appear a bit too sketchy and closed in their marginal role, a mere background to the action. On the other hand, there is nothing to say about the soundtrack and the Italian dubbing: the first is an incredible mix of genres and strikes you right from the start, the second, as mentioned, has been entrusted to professionals of undoubted ability, who know how to play with their roles and which have undoubtedly added something to the experience, even if the limitations of the direction of voice acting in video games are unfortunately still there and are all noticeable. The problem will be solved only when the actors can see the scene and the context in which their charactersor pronounce the joke, until then let's resign ourselves to hearing phrases pronounced calmly where instead the situation is excited, and so on.", "date": "2013-01-14", "grade": "8.0"}