{"name": "Incontri ravvicinati", "ref": "https://multiplayer.it/recensioni/113101-the-denpa-men-they-came-by-wave-incontri-ravvicinati.html", "text": "The Denpa Men is a somewhat strange story that is worth telling. The developer in question is Genius Sorority, a name that most will not say anything, but that some fans should recognize. In recent years these guys have signed some Pokmon spin-offs, in particular Coliseum and XD: Gale of Darkness for GameCube, and we recently saw them again in Learn with Pokmon: Adventure between the Keys. However, Genius Sorority is a company founded by former employees of Heartbeat, a Japanese software house that between the 80s and 90s signed titles of the caliber of Dragon Quest VI and Dragon Quest VII, plus some remakes of the very famous Enix series. This would therefore explain the vintage flavor of The Denpa Men: They Came by Wave, an RPG that will surely appeal to those who remember those golden years with a pinch of nostalgia... The power of wifi The first thing to do when starting to play The Denpa Men is to activate the wi-fi connection of the Nintendo 3DS: the infamous battery-sucking stick is a fundamental prerequisite, because the Denpa Men hide in the airwaves. One of them, who in our case is called Richie, will explain it to us: he is desperate because ~someone very special~ has been kidnapped by the Evil King, and he needs our help to save him. Alone, however, we will not be enough: we will in fact have to build a small army of Denpa Men, and the first step consists in ~capturing~ them by detecting a wi-fi signal and using the console's camera to find them in a kind of reality-based mini-game increased. Just like the first Denpa Men we'll meet, the others are randomly generated based on the wi-fi signal we're receiving: this means that it's virtually impossible to find two Denpa Men with the same name or physical characteristics. However, it is important to understand the basics: some Denpa Men are bigger than others, and this also makes them tougher; others wear overalls of different colors that distinguish the natural elements similar to them; others sparkle, meaning they know a spell, which is also randomly assigned. At the beginning of the adventure we will be able to capture more than a dozen Denpa Men, but our party will consist of only four of them, carefully chosen based on their stats and abilities. Once this step has been taken, the real game begins: we will return to capturing the Denpa Men over and over again, but the heart of this weird RPG is the exploration of the various dungeons and the growth of the characters. It is at this moment, in the first fight with enemies taken in first person, that one realizes how similar to Dragon Quest the latest Genius Sorority effort appears. In this case, however, we are faced with a kind of old-fashioned clone, and this dive into the past soon becomes the main problem of the whole package. The 3D effect The stereoscopic capabilities of the console are expressed above all in the mini-game based on augmented reality that allows us to capture the Denpa Men. In that case the effect is convincing, and it almost seems as if these bizarre Teletubbies are really fluttering around our rooms. Without infamy or praise however, the depth effect applied to the rest of the game. Child's play? At certain moments The Denpa Men almost seems to want to go overboard, putting too much meat on the fire without cooking it to perfection. For a simple low-cost downloadable game, the amount of content is impressive: leaving aside the randomness of the dungeon layout or the variety of Denpa Men, the Genius Sorority title boasts a quantity of environments, enemies, skills and objects that would not be out of place in a full price jRPG. On the other hand, however, one soon realizes that most of these elements are recycled a little too often: many enemies meet again from dungeon to dungeon, only in different colors; many skills look alike to the point of being identical, except for the name; even the bosses at the end of the area are repeated with very slight variations between one and the other. However, to finish the game it will take a dozen hours and a lot of patience, precisely because the vintage spirit that distinguishes it also characterizes the level of difficulty, decidedly high right from the very beginning. In fact, we said that choosing the right Denpa Men for our party is very important. We want to correct ourselves: it is fundamental. As the adventure progresses, we will find ourselves exploring the dungeons in the company of more and more Denpa Men, up to a maximum of eight. And it will take fewer enemies to take us out in the blink of an eye, if you don't pay attention to the balance of forces between the natural elementsor to the equipment worn by our characters. The discovery and consumption of healing objects soon becomes imperative, also because the deceased Denpa Men at the end of a dungeon return to the ether and can only be regenerated by spending large sums of money. Alternatively, new Denpa Men can be captured and raised anew, but at a certain point the effort put into improving the lost ones makes this alternative impractical. The limited arsenal of the Denpa Men also contributes to raising the difficulty, substantially attributable to a single spell per character, and the poor artificial intelligence of the group in case you want to take advantage of the automatic combat system, a bit too simplistic and not very customizable: much better to assign actions manually, unless you are facing low-level enemies for which you don't need to work too much.", "date": "2013-01-07", "grade": "7.0"}