{"name": "Questa  una storia vera", "ref": "https://multiplayer.it/recensioni/questa-e-una-storia-vera-recensione.html", "text": "It is not easy to write a review of This is a True Story because, in fact, it is not really a game, therefore the typical evaluation schemes inevitably jump and we find ourselves talking about a short and intense experience, the purpose of which is reveals above all after having come into contact, outside the action itself. The title of Frosty Pop, created in collaboration with charity: water, is essentially an interactive short story rather than a narrative adventure, in which we find ourselves following Bontu's long, painful and in some respects fascinating and melancholic journey in his daily search for water. We limit ourselves to a few simple interactions and take part in some small puzzles, but we are above all passive spectators of this journey, staged with a more informative purpose than entertainment, however endowed with a considerable weight. The development team is one of the most active in supporting the new Netflix games catalog, accessible for free by all subscribers to the video service, but in this case the work carried out has above all the intention of making users aware of a pressing and underestimated issue : the difficulty of accessing resources of vital importance such as water for many populations, especially in the African area. As reported on the official page of This is a True Story, ~sometimes we have to share difficult stories~, said Frosty Pop, who after joyful experiences like Krispee Street decided to get in touch with activist Angela Ahrendts and charity : water to build this little story that gets everyone involved in the incredible feat that is collecting clean water for a terrifying amount of people every day. A long way This is a True Story, a picture of the game, with its particular painted graphics Everything takes place during the long walk that Bontu, the protagonist, must make to reach a source of water that is not too contaminated, in order to be able to fill the tank and bring it home. The woman's village is located near a mouth, but in the summer the river dries up and water reserves are scarce, forcing the local inhabitants to look for water further upstream, often at more or less hidden aquifers, in case where there is no functioning well. The journey is divided into small sections with different settings, during which Bontu tells something about her life and the reality that surrounds her, through anecdotes and considerations that manage not to fall too much into the didactic and emerge as realistic and lively, despite being matters of considerable weight, which lead us to reflect on the conditions of some populations. From the point of view of the gameplay there is very little to discuss: most of the time we limit ourselves to pressing on the edge of the screen to make the protagonist walk in the direction established, with some moment of interaction varies according to the situation. This is a True Story, a moment of gameplay with a little challenge These are rather phoned and predictable phases, which have practically no real challenge element: hold down to calibrate a jump, stop behind the rocks so as not to get hit by the storm or solve simple puzzles such as composing puzzles or solving basic operations. There is practically nothing ~game~ in This is a True Story and the moments of interaction serve above all to make us more involved in the protagonist's journey and emotions: it is completed in less than an hour and offers no ideas in terms of ~fun~ or skill challenge, but it is still a story that stays in the mind and can stimulate reflection on issues of great importance.", "date": "2022-04-07", "grade": "7.5"}