{"name": "Il bagaglio a mano di Yoot Saito", "ref": "https://multiplayer.it/recensioni/112771-aero-porter-il-bagaglio-a-mano-di-yoot-saito.html", "text": "Back in 1994, a Japanese boy, Yutaka ~Yoot~ Saito, appeared on the international game design scene and, inspired by the timeless SimCity, began to transpose its mechanics into a more limited and unusual context, a skyscraper: thus SimTower was born, a simulation so well done that outside Japan it was published by Maxis itself, and which gave rise to various sequels. But if a certain innovative vein was already glimpsed in the first title, it was in 1999 that Saito exploded as a visionary designer: with his new company, Vivarium, he released a title that puzzled more than one Dreamcast owner. It was Seaman, a sort of evolved Tamagotchi in which instead of a chick, the player had to take care of and interact (through voice commands, a feature that still today struggles to find decent realizations) with a strange fish with a human face, which he also had the habit of entertaining with various anecdotes and insulting his ~master~. In 2006 Saito confirmed himself as a habitual consumer of psychotropic substances and completed for GameCube, in collaboration with none other than Nintendo, Odama, a game halfway between Real Time Strategy and pinball (!), with a large ball that roamed deadly between the battlefields of feudal Japan, suitably filled with obstacles and buffers. A scene like that of the eShop, in which the costs and small size of games often allow designers to dare a little more than in large and risky traditional productions, should be the natural habitat for characters like ours: and in fact, published by Level 5 and part of the ~Guild01~ line, a lot of things can be said about Aero Porter, except that it is not a peculiar and radical title in the premises, in the setting, in the relationship it establishes with the player. Let's go to work! With the crisis gripping the global economy, it doesn't seem true to the unknown protagonist of Aero Porter that he has been chosen for what appears to be a dream job: handling baggage handling in a small regional airport, but with excellent possibilities for expansion . This is the premise of a very action-packed puzzle game, which immediately, in full Saito tradition, slams its frenetic and complicated reality in your face. But let's go in order: the player is presented with a series of conveyor belts for each working day, each of which is associated with a departing plane distinguished by the same color. As passengers check-in, their bags, also colored according to the plane on which they are to be boarded, arrive on the belts, and it is up to us to associate them with the correct one. The problem lies in the fact that these ribbons do not seem to have been arranged in the most efficient way possible: they are in fact circular, and are located one above the other. The possibility of making the belts ~communicate~ with each other is delegated to the back buttons: with R the upper belts are ~lowered~, thus allowing the luggage to pass to the belt which is immediately below, with L instead they ~go up~, allowing the reverse move. However, it is not possible to select the belt on which to act, they all rise and fall at the same time, and this thing, combined with the fact that the bags are immediately presented to you without apparent criteria and that the planes will always and in any case leave on time, without waiting for their hold is full, it begins to give you an idea of the difficulties you will encounter: the least that can happen to you is in fact that, proud of having moved the yellow baggage onto the correct belt, you will realize that in the meantime, however, that too is finished red. Then you will have to restore the situation and maybe you succeed, but in the meantime a green baggage has arrived to complicate everything. Meanwhile, time passes inexorably, more and more pressing music and sound effects start and the manager (a certain Bob Saito) interrupts you every two by three to introduce different variations on the theme. Oh yes, because if already in its basic concept Aero Porter requires great intelligence, spirit of observation, dexterity, coolness and quick reflexes, just a couple of well-managed aircraft will pass and you will immediately be faced with countless complications. If the fact that the airport will grow more and more depending on your performance and from three belts you will have to manage up to seven at the same time appears quite regular, less predictable however is the management of the fuel that keeps the same belts in operation, represented from a special bar: to prevent it from running out from time to time together with the luggage, a fuel can will arrive, which absolutely must not be embarked on the planes but left to arrivenot at the lowest level. If necessary, you can also turn off the lights of a single ribbon to save money, but in this way the color will no longer be displayed, or reduce the speed, with the risk of not doing everything in time for the various departures. The 3D effect In Aero Porter stereoscopic 3D is simply absent, apart from in the Hangar secondary mode: in fact, with the expansion of the airport you can collect a series of aircraft to view in 3D and to exchange via Streetpass. Let's assume that the choice was made for reasons of readability, with the many elements on the screen to be managed with speed and precision which in itself generate some confusion, but we honestly don't believe that the addition of 3D would have made the situation worse. The airport strike Does it end here? Not at all: speaking only of complications that will be slammed in your face in the very first moments of the game, there are for example several special bags, ironically inspired by current events. From those of VIPs who must be embarked before all the others, to those of politicians who request the same treatment but who, for reasons of discretion, are not recognizable by color but by a tiny plate, up to suspicious ones, represented by a 'bomb icon which hints at what might happen if you make the mistake of routing them to an outgoing vector... We could go on, but the truth is that you can't get a precise idea of the roughness of Aero Porter except by playing. We are faced with a truly no-half-measures title, as slender and peculiar in its premises and implementation, as intriguing and difficult to manage, and radical in its choice not to leave a breather: we don't have time to digest an element that immediately introduces a new, even more diabolical one. This intransigence also heavily affects longevity: it's not a long game, theoretically just over an hour would be enough to complete it, but, without considering that everything is based on the classic scoring system, its difficulty makes it quite long lasting; then how much one is willing to tolerate this difficulty is another matter, which we will address in the commentary. Meanwhile, we note how even graphics and sound don't know half terms: dry and modern style for both, which favors legibility at the expense of spectacularity, effectively useless in this context. Almost didactic graphics, with the pleasant detail of the silhouettes of passengers and operators at the top of the upper screen that somewhat recall the titles of the film ~Catch me if you can~, also with an airport theme, and simple sound effects, precisely, ~from the airport ~, with sparse anxiety-producing tunes popping up here and there, just to press you a little more.", "date": "2013-01-02", "grade": "7.5"}