{"name": "Il dato  tratto", "ref": "https://multiplayer.it/recensioni/112740-crimson-shroud-il-dato-e-tratto.html", "text": "Yasumi Matsuno doesn't seem to have found the office of her dreams yet. After conceiving the first Tactics Ogre and Ogre Battle on behalf of Quest, during his long tenure at Square he signed titles of the caliber of Final Fantasy Tactics, Vagrant Story and Final Fantasy XII, entering the video game firmament by right. Leaving Square in 2006, he worked on the remake of his first hit, Tactics Ogre: Let us cling together, and then teamed up with Level 5, another behemoth in the Japanese RPG market, to make smaller-sized games on which to have but complete control: Crimson Shroud is the result of this brief union, a title included in the Guild 01 compilation. In Europe we have seen it ~in pieces~: after Goichi Suda's Liberation Maiden and Yoot Saito's Aero Porter, Matsuno's work. Everything seems perfect, but there's a catch: Crimson Shroud is an RPG ... in the purest sense of the term. There are RPGs and RPGs When we talk about RPG, in videogame terms, we use a somewhat ambiguous acronym. RPG means Role Playing Game, that is, a role-playing game, and was coined to identify board games such as the evergreen Dungeons & Dragons, based on dice rolls. Since the first computer ~RPGs~ were based on the same concept, the term has extended to include them as well. Over the years (indeed, decades) the genre has transformed and the dice are no longer seen, even if basically they are still there. Furthermore, the Japanese have their own way of making RPGs, it is no coincidence that for a few years the acronym J-RPG has been officially used to distinguish Japanese ones, such as Final Fantasy or Dragon Quest, from Western ones, such as Baldur's Gate or The Elder Scrolls. All this pappardella is important because, being Crimson Shroud a Japanese product, one could think that it is a J-RPG or, alternatively, a Western-style RPG, when in reality it is a real RPG, with a lot of text to read, a kind of ~dungeon master~ who tells the story and dice to roll practically with every breath. It is clear that this type of structure may appear as unusual as it is fascinating, but we believe that it is only tempting to a small circle of super enthusiasts of the genre. Fortunately, the many and very long texts are written beautifully: translated by the same Vagrant Story team, their care and obsessive refinement makes the story much more intriguing in the face of its short duration. The localization is completely in English, mind you: this is a detail that could easily discourage non-English speakers, especially if we consider that there is really a lot to read. In short, if you don't understand written English well, you can also close this browser page: the whole game is in fact told and described by a superimposed text on static screens that depict the protagonists and supporting actors in the form of real gaming figurines tabletop, immobile in fully polygonal scenarios. And yet, the story still manages to be quite intriguing. The 3D effect Unfortunately, the stereostopic effect in Crimson Shroud is really disappointing: apart from producing only an imperceptible depth during the static game screens, it also tends to increase aliasing, confusing and worsening the rendering of polygonal models. Much better to turn it off. Where did that d20 go? Giauque, Frea and Lippi are three bounty and treasure hunters in a fantasy world where, it is said, magic has been given to men by the gods. Some, however, think that it is not a real divine gift, but even a temptation from the devil. Be that as it may, a tip leads our heroes to ancient ruins where an ancient object, the source of all magic, seems to be found. Soon, this treasure hunt begins to affect many parts and within the walls of the crypts our heroes will have to deal with friends, enemies and themselves. Interested? Well, because the story, divided into three chapters, is a further flashback and is described in great detail partly by the external narrator and partly by the protagonists themselves. The game develops in a single location divided into several floors: the map on the touch-screen will allow us to explore every room and corridor in search of enemies and key objects to continue the adventure. Almost any action is linked to the roll of dice, polygonal models of the mythical d4, d16, d20 etc. that accompanied our Dungeons & Dragons sessions. The dice play an even more important role during the fights, of course: each character can attack the enemy figurines, use special abilities or cast particular spells, displayed only by flashes of light and brethere vibrations of the figurines. Each skill or power is linked to the equipped items: the heroes do not level up as in a traditional RPG and their improvement is based solely on the items found by defeating enemies or opening chests. During the fights it is essential to play strategy: the skills that enhance the party's characteristics or worsen those of the enemies are very important, as is the management of the elemental ~combos~ which allows you to roll bonus dice to increase the results of our actions. The better you conduct a battle, the more treasures you will receive as a reward. The problem is that the difficulty appears a little too ~hardcore~ at times, with enemies often having an advantage over the party and the need, on multiple occasions, to have to kill dozens of them to find that random loot that will allow us to progress in exploration . In short, everything is very strange, from the graphics to the gameplay: how many players could be interested in this type of experience?", "date": "2012-12-26", "grade": "7.0"}