{"name": "La forgia del PvP", "ref": "https://multiplayer.it/recensioni/112644-forge-la-forgia-del-pvp.html", "text": "If there's one thing we've always hated, even in the inevitable period of obsession with online role-playing games, it was the obligation to indulge in the so-called grinding, physically and psychologically forcing ourselves to spend hours in front of the monitor to advance level up your virtual alter-ego. Anyone who has taken hold of one of the many massive online games at least once knows what we are talking about: it is precisely this that, at the time of the announcement of Forge, aroused a certain curiosity, given that the effort of Dark Vale Games seemed to offer that right compromise between the role-playing component of growth and more dynamic mechanics belonging to a Team Fortress or even, in some cases, to a first person shooter. No PvE frills, but only and only PvP: in fact Forge doesn't even have a story, but only an excuse to put players in the middle of the map to start beating each other up, getting experience points to spend to grow and specialize your character . An idea capable of making a difference but at the same time a possible double-edged sword, which however convinced Steam Greenlight by getting the ~green light~ from the Valve platform: infinite joy for the development team, now called to carry out all the promises made. I am Pdor son of Kmer As we said, Forge only uses a pretext to throw us into the fray: an evil entity, The Devourer, has trapped the gods who force some of the greatest warriors to face each other within a world called Forge, in a battle intended to sacrifice the weakest to increase the powers of the deities. The game offers us five different classes from which to choose our character at the beginning of each game: all five are taken from other exponents of the fantasy role-playing game genre. We therefore find the Assassin, able to move in the dark to deliver blows behind the enemies; the Pyromancer, endowed with a destructive power thanks to the use of magic and fire; the Ranger, a ranger skilled in ranged attacks; the Shaman, a defensive class capable of healing companions; and finally the Guardian, a tank capable of launching melee attacks. Quite common classes for those used to chewing role-playing games, equipped with equally classic skills to carry on through the 99 levels that the game offers. The only way to gain experience is to jump headlong into the four maps of Forge, which offers game modes that are also quite well known: in fact, they range from the inevitable deathmatch to capture the flag (Capture the Relic, in this case), passing through King of the Hill. In a second moment, shortly after the release, the Arena mode was inserted, in which the player can count on only one life without respawn to spend in 10-minute rounds, with the aim of controlling the tower that appears at game end. Violent punches An obligatory step before playing is the tutorial: useful for learning the basics of movements and the use of the skills of each class, it has been slightly modified by Dark Vale Games compared to the standards of online role-playing games. The first peculiarity that catches the eye is that of assigning to the various special attacks the keyboard letters positioned near the WASD movement combination: a choice that turns out to be non-random, given that in Forge it is not possible ~lock~ a target or automatically switch it with the Tab key, thus finding yourself forced to resort to your aim to score a hit. A more first-person shooter feature, a genre from which Forge inherits the need to be constantly on the move. From this point of view, the development team had a brilliant idea in allowing you to jump on walls, thus adding verticality to the battles. Obviously, the maps are also designed with this possibility in mind, supporting it properly. The game's matchmaking is bare-bones: excluding the possibility of joining a friend, the only option available is quick play without any ability to see active servers. As often happens in online games, all matches end up being roughly a deathmatch, losing sight of the objectives of Capture the Relic and King of the Hill also due to the lack of skill in describing them. Probably an additional section in the tutorial could have helped to better educate those who play an online game. In the end, however, the game is fun, thanks to the frenetic pace of the action. The balance between the various classes is also excellent, invited to collaborate to move forward in the best way. A game in the making From a technical point of view, the work done by Dark Vale Games on the Unreal Engine 3shows ups and downs, highlighting what is actually somewhat the main flaw of Forge. In general, despite being enjoyable, the game still has many aspects to complete, as announced by the developers who are preparing to release patch after patch. This is for example the case of the introduction of the guilds and the party system, promised for a later time, as well as the arrival of new modes and maps to add variety to the game, possibly also enriching the customization faculties of the alter egos through a more sophisticated growth system. Although generally inspired by the stylistic point of view in the creation of the characters and levels, the graphics lose a bit in terms of cleanliness especially in the animations, occasionally suffering from losses of frames per second which, for a change, should be fixed with the upcoming patches.", "date": "2012-12-26", "grade": "7.0"}