{"name": "Super Hexagon", "ref": "https://multiplayer.it/recensioni/112746-super-hexagon-super-indie.html", "text": "Cavanagh has done it again. In a moment of almost total absence of ideas, the indie designer from Cambridge returns to the stage to forcefully claim the limelight. Terry Cavanagh puts the triple A franchise on one side, Hollywood-style interlude scenes on the other and just before Christmas he gives the market the maximum expression of his concept of ludus: simple, pure and quality gameplay. Born as a flash game and evolved into Super Hexagon, Cavanagh's latest creature is the most minimalist of his works, with a basic but tremendously stimulating audio-video design and with a hardcore soul that will put even the most expert to the test of his fans. The reputable indie designer's new creature didn't take long to arrive on Steam, after its iOS success, adding to the package five difficulty levels, some online leaderboards and a couple of audio tracks created by the skilled artist Chipzel. It's a world of hexagons Describing Super Hexagon is very simple, its philosophy makes it such an immediate product that it almost seems like a pastime rather than a title with its own playful dignity. Like a sort of running game, the two-dimensional game board will hurl concentric geometric obstacles at the small arrow that must be avoided by moving clockwise or counterclockwise, shifted from left to right on the keyboard. The continuous simultaneous and totally random rotation of the plank intervenes to enrich the plate, which will slow down or accelerate the movement of the arrow precisely based on the synergy of the direction of rotation. The concept that permeates the title reflects Cavanagh's philosophy, which aims to offer products that are simple to use, immediate but which, if completed, repay all the mental energies expended. It's a basic idea that unites many indie titles which, almost as if to rediscover the joys and pains of video games of the past, have become a bit the ideal representatives of the arcades of yesteryear. Six sides of challenge Easy to describe, impossible to finish. Or almost, of course, as the well-known difficulty underlying Cavanagh's products reaches a new peak in Super Hexagon and imbues each session with the right amount of randomness and even frustration. The positive one though. The skill of the English designer has produced such a basic and direct gameplay that the error will never depend on defects in the development or construction of the game infrastructure, but only and exclusively on the player's eye-hand coordination, which will be put heavily under stress from the first of the 6 difficulty levels available. With very fast game sessions (we are talking above all about those of a few seconds, they will be the most frequent) there will be no time to get used to a generation pattern of the approaching barriers. To make everything more complex there are some obstacles that can only be overcome if the direction of rotation of the arrow is identical to that of the bridge, benefiting from the higher speed necessary in many situations. Hearing the usual ~Game Over~ will become routine in progress attempts, all characterized by a completion bar which, coherently with the title of the game, makes the names of geometric shapes the dividers between the style of the various areas that make up the level. A nice find, which together with the psychedelic style and a minimal techno-style soundtrack creates a perfect visual and acoustic framework in its accompaniment.", "date": "2012-12-24", "grade": "S.V."}