{"name": "Piccoli platform crescono", "ref": "https://multiplayer.it/recensioni/112631-mighty-switch-force-hyper-drive-edition-piccoli-platform-crescono.html", "text": "The cyberpolice Patricia Wagon has the task of catching the fearsome Space Hooligans, five fascinating criminals who escaped during transport to a maximum security prison. With the help of the inseparable robot Corporal Gendarmor and his special helmet, capable of altering reality, the agent will have to complete twenty-one levels (sixteen plus five bonuses) gradually more complex as well as, in this case, a ~remix~ version of the same, with the aim in each of them to find the five blonde sisters, wherever they are hiding, paying attention to the thousand pitfalls they have put in place to make their capture more difficult. The developers of WayForward Technologies have therefore taken the original Mighty Switch Force!, released on the eShop for Nintendo 3DS exactly one year ago, and have enriched its structure and technical sector, redesigning the graphics in high definition, for the landing on Wii U Once the game has started, it is possible to touch the GamePad touch screen to decide whether to view the action on the TV or on the screen integrated into the controller: in the first case, the latter will be used as a radar to locate the position of our targets on the map, while in the second case this task will be performed by a small icon. Hit the switch! Patricia can move, jump and open fire with her powerful Pellet Gun, but at the same time suffers from ~Mega Man syndrome~, which means she cannot duck or direct her attacks at will. This is an element that is inextricably linked to the gameplay of Mighty Switch Force! Hyper Drive Edition, which forces us from the first moments to think ~horizontally and vertically~ to solve the puzzles that characterize each level and which depend on the use of the Helmet Siren, the flashing light that the policewoman can activate at any time (via pressing the A button or, better, one of the ZL or ZR back buttons) to make a ~switch~, actually changing reality with respect to the objects in the scenario. The mechanics related to this feature are introduced very gradually, with some boxes that become tangible or intangible depending on the use of the siren and allow us to reach otherwise inaccessible platforms. But be careful not to materialize an object while we occupy its space: this would translate into an instant game over, where instead three little hearts represent our vital energy with respect to the attack of the monsters freed by the fugitive sisters. The more we proceed in the levels, the more the mechanics related to the ~switch~ acquire complexity and facets, introducing two types of boxes, to be made intangible simultaneously or in turn, as well as devices which, once materialized, make us jump in one of the four cardinal directions or they can be used to make explosive monsters take the same route, destroying any walls that we cannot hit, the elimination of which is essential for completing the stage. Quick reflexes The twenty-one levels that make up the single player campaign are characterized by a degree of difficulty that increases gradually but which, in the last stages, puts us in front of a truly demanding challenge from the point of view of timing and quick reflexes. Once the first sixteen stages are completed, not only five bonus missions are unlocked, but also the ~Hyper~ mode, with all twenty-one levels in a new remix version, structurally identical but featuring an increased challenge. This is a welcome and even necessary addition, given that the twenty-one starting levels are theoretically completed within an hour and a half, even if it all depends on your timing skills, while the monsters that ~crowd~ the stages they're pretty easy to take down and most of the time they won't even be able to touch us. The most difficult parts of the game turn out to be those in which you have to act on the ~switch~ at the right moment to activate a propulsion device, an element that from the tenth level onwards will become not only constant but also difficult, condemning us to a large number of dead. The gameplay aims at a ~speed run~ style approach and therefore at replayability to get the best possible time in each scenario, a factor supported by the presence of Hyper levels, but it is a ~hardcore~ approach that not everyone could appreciate. Finally, but the question is purely subjective, the graphic style and the sound accompaniment did not completely convince us. The design winks at Japanese manga, but it didn't seem very successful, see for example the appearance of the protagonist, who is not understood to be a girl. The animations are fluid, but the scenarios rather anonymous and empty. The mufinally, taken individually they are nice but more often than not they are ~out of place~ with respect to the action.", "date": "2012-12-21", "grade": "7.4"}