{"name": "Sparatutto a caso", "ref": "https://multiplayer.it/recensioni/112456-big-sky-infinity-sparatutto-a-caso.html", "text": "Especially in the bullet hell sub-genre, among the elements that most distinguish one shoot 'em up from another there is undoubtedly the complexity of the trajectories, the arrangement of the upgrades and the appearance of the enemies. The entire level is a precise scheme elaborated by the developer, which thanks to an invisible timer marks the rhythm and offers an experience that can be frenetic or slow, unpredictable or monotonous. The race to the top score itself is closely tied to the ability to memorize the formation of enemies and incoming projectiles. That's exactly why, by making a scrolling shooter in which everything is procedurally generated, the British team Boss Baddie took a big risk. Big Sky Infinity will turn up their noses among some purists of the genre, but it manages to bring to PlayStation 3 and Vita a game that is always different for each game, which adapts to the player's skill but which at the same time pushes the latter to adapt to turn to different formations and new bosses. An ever changing sky Despite a fairly clear tutorial, the first impact with Big Sky Infinity is quite unsettling. We often die and in some cases it is not clear why. At the next attempt everything changes, and you find yourself forced to relearn the behavior of each obstacle and each opponent. From exploding and multiplying enemies to those arriving in formation from all sides of the screen, from narrow tunnels you pass through to black holes that suck up everything that comes your way. In some cases it is necessary to activate a drill to cross planets and meteorites, temporarily sacrificing the possibility of firing. The classic mode of the game draws strong inspiration from endless runners and arena shooters: although the journey is paced by some bosses, there is no real division into levels as occurs in most shoot 'em ups, and the aim it's simply to survive as long as possible to get your score through the roof. Of course, the further you progress, the more chaotic the action becomes, with the screen filling up with enemies and the player making his way through a thousand explosions. The graphics of the game, which at first seem to be yet another attempt to re-propose the neon and minimalist shapes of Geometry Wars, soon transform into a pyrotechnic show of particles, distortions and other various graphic effects, passing from the lively colors of laser beams to fascinating monochromatic moments. The visual impact of Vita on the screen is absolutely remarkable, but between nebulae and extremely rich backdrops, from time to time you risk confusing your eye and losing sight of some stray bullets. In spite of some below average sound effects, the music that accompanies the action is successful and engaging, and it's a real shame that the work done is partly ruined by a completely inappropriate external commentator. What happens on the screen is accompanied by a voice-over that lets itself go into continuous screams, humorous exclamations and battle cries, but although it is a touch of personality and although some jokes are more successful than others, the final result is very jarring , to the point that many will prefer to jump into the options menu to deactivate the crude narrator once and for all. Even the control system inherits more from the twin stick sub-genre than from more traditional shoot 'em ups, with the right analog allowing you to direct fire to all corners of the screen. Each destroyed opponent then scatters some fragments into space that can be collected and spent by the player to upgrade their ship into a large number of different abilities and characteristics. Playstation 3 trophies Fourteen trophies are not much, but they manage to enrich the game with some alternative challenges. Some of these are unlocked simply by improving between matches, for example by reaching a certain multiplier or destroying a certain number of enemies. Others are nicer and more particular, perhaps requiring you to stay inside a meteorite for several seconds. Challenges between donkeys However, the endless game structure in which each game is always different leads to a series of compromises, both in terms of the sense of progression of the single-player modes and for the creation of absolutely epic moments. The randomness of the opposing formations also weighs predictably on the multiplayer experience, since each user faces a different level from that of the others while competing within the same ranking, but it is in the Donkey mode that the competitive heart of Big Sky resides Infinity. In this sympathyIn this option it is possible to send a challenge to a friend or to one of the players scattered around the world, choose a mysterious word and start a series of games in which, in turn, you try to score the highest score; after each match the challenger with the lowest score receives a letter, and once the mystery word is completed he will have lost. Fortunately there are quite a few unlockable options that enrich the single-player component, although most of the modes are nothing more than small variations on the Classic one: the Countdown is a simple timed option in which to score as many more points in just two minutes, Boss Rush challenges you to take on all the bosses one after the other, while the Inferno option throws you in the middle of a hail of lasers and bullets from the very first moment. Thumbs up for the emphasis given to the statistics and the social component: not only can you check your friends' score and the global leaderboard of each mode at any time, but between matches you can check your personal statistics and compare them with your average performance, immediately getting an idea of how much you are improving.", "date": "2012-12-18", "grade": "8.0"}