{"name": "I conigli e il gioco dell'oca", "ref": "https://multiplayer.it/recensioni/112371-rabbids-land-i-conigli-e-il-gioco-delloca.html", "text": "Although it is not possible, at least for the moment, to play on Wii U using more than one GamePad (moreover, considering the price of the controller, this would imply a considerable investment), Nintendo has demonstrated that the compatibility of its new home console with Wii -mote and Nunchuk can overcome this limitation effectively, especially in the party arena. Obviously, the game must be designed around this peculiarity, allowing the person holding the GamePad to assume a different role than the other participants, or using the device in question as a ~hub~ to enjoy the experience with the Wii controllers. In the case of Rabbids Land, a title that marks the debut of the crazy French rabbits on Wii U, however, Ubisoft has made a different and, in many ways, questionable choice. Faced with sessions in which up to four players can participate, in fact, only two of them can take action at the same time, challenging each other in about twenty minigames in which the GamePad and the Wii-mote / Nunchuk combination correspond to roles different. And the other two participants, like it or not, are watching. The Game of the Goose The main mode of Rabbids Land, not surprisingly entitled ~Board Game~, can be tackled in single player or, as already mentioned, together with up to three friends. Whether you play in two, three or four people makes little difference, in the sense that the empty seats will be occupied by a rather shrewd artificial intelligence, especially within certain mini-games, which will not fail to give us a hard time. The four Rabbid, each characterized by a different color, are placed on a board formed by three concentric circles, in boxes, which is a modern interpretation of the classic game of the goose. Our goal during the game, as in the classic board game, is to get hold of a certain number of trophies (ten or twenty, we can decide at the beginning) and then reach the central part of the board first so as to obtain victory. Not a very simple undertaking, because to complete it we will have to count not only on our possible ability, but also on a pinch of luck. At the beginning of each turn we are in fact asked to ~roll the dice~ (by touching it while it rotates on the GamePad screen) and go to one of the boxes corresponding to the result of the roll; the problem is that to earn a trophy we will necessarily have to play a minigame and win it, ergo any result different from the golden box could translate into a small loss of time or even damage (see the red box with the drawn skull, which corresponds to the loss of a trophy). However, there are pleasant destinations, characterized by the drawing of a gift (in which case you receive a random bonus) or by the face of a Rabbid, with the latter possibility turning into obtaining a special ability to spend during our turn or in the introduction of a variable on the board, whether positive or negative. The hilarious animations of the Rabbids do everything to make the wait between one round and another sweeter for us, but the attempt fails after the first few games. Rabbit against rabbit The fulcrum of Rabbids Land gameplay obviously lies in its minigames, to be played on the GamePad alone (which must therefore change hands) or, as mentioned, in combination with the Wii-mote and Nunchuk. Every time we try our hand at the main mode, new mini-games come to the surface and become accessible from the starting screen, usable both in single player and in competition with a friend. Among these we have the nice ~Deep Russian~ endless run, in which the Rabbid we control is in the middle of a sort of ~space skiing~ and you have to tilt the GamePad to allow him to avoid the fireballs that are constantly being fired at him from the ~motorboat~ of the situation; or ~The Lost Spheres~, in which the Wii U controller is held like a tray on which characters and spheres ~slide~, with the former having to collect the greatest number of objects before being crushed by a boulder. Then there's the ~Olympics~, a competitive minigame in which a Rabbid is tasked with drawing shapes in the sand while his opponent must quickly erase them to stop him; and ~Luci, Camera... ZAP!~, one of the numerous applications in which the stylus and touch screen are used to trace the path of the character and make him come into contact with some bonuses by hiding from the view of the security cameras. In short, there is a bit of everything, from the platform of ~Stealing Stolen Rubies~ to the challenges in which the gyroscope is used and you have to keep the GamePad in front of the face to identify and/or intercept targets. However, we cannot speak of a constant quality level, indeed a good half of the minigames (especially those that must be controlled with the stylus) have left us perplexed as they are decidedly anonymous and not very incisive. Funny or not? In short, what is the value of Rabbids Land in the panorama of party games and, specifically, how is the Ubisoft title positioned within the current Wii U play offer? Our feeling is that the experience ends up being very limited by the fact that the minigames have a maximum of two participants, which necessarily forces someone to stand by and watch. Despite having the possibility of inventing something in this sense, therefore, the developers have preferred to remain steadfast in a structure that highlights some problems from the beginning, however managing the double screen in an impractical way since we are constantly called to look at the touch screen instead of TV. Some minigames are nice, others less so, but the point is that the total count is small compared to what was done with the previous adventures of the Rabbids. In short, if you are looking for a party game for the new Nintendo console, currently the best choice remains Nintendo Land, while for the Ubisoft rabbits a second roll of the dice may be needed.", "date": "2012-12-14", "grade": null}