{"name": "L'eredit dell'Uomo", "ref": "https://multiplayer.it/recensioni/112266-primordia-leredita-delluomo.html", "text": "~In singular contrast to my ardent sense of justice and social duty, I have never felt the need to approach men and society at large.~ So wrote Einstein in As I see the world, and so must think Horatio, the protagonist of Primordia. Horatio lives retired in the wreck of a spaceship, the UNNIIC, and survives thanks to an energy core. Around him there is only the desert, made even more melancholy by the wreckage that emerges like fossils from the dunes. His only company are Crispin, the Gospel, a gramophone and a radio, eternally tuned to the frequency of Metropol, a remote city that incessantly broadcasts proclamations of eternal happiness as only the worst dictatorships can do. Except that Horatio Nullbuilt v5 is not a human, he's a robot, and Crispin Horatiobuilt v1 is his best creation. The study of the Gospel is equivalent to reading a sacred text: it speaks of Man, the Great Builder, that first divine robot who assembled all the successive automatons to take care of the world. At this point the player will wonder if that Man wasn't actually mankind, and what happened to him, or why the robots don't remember anything about it. Questions that would have remained unanswered if a menacing robot hadn't stolen the precious energy core that allowed Horatio and Crispin to live isolated in the desert. The theft forces the couple to embark on an adventure that will take them from the metal hermitage of the uprooted spaceship to the belly of Metropol, the city of lights and energy, a destination coveted by Crispin but opposed by Horatio, who, regarding the large agglomeration he always repeats the same thought: Metropol means trouble. All ways of the Gospel Primordia is produced by Wadjet Eye Games, the New York-based independent software house founded by Dave Gilbert, but the development team is formed by the three members of Wormwood Studios. After the great Gemini Rue and Resonance, Gilbert once again guesses where a successful adventure is hidden, and is smart enough to bring it to market. In the case of Primordia it is a classic graphic adventure, with no novelties in the game structure. We therefore repeat the mantra of this genre: there is an inventory, the possibility of collecting and combining objects with each other and multiple choice dialogues. There is also a practical datapad that collects the main clues unearthed during the adventure and a monitor with which to choose the next destination to move instantly from one point to another in the game world. Finally we can select Crispin to ask him to reach inaccessible points, since our little creation floats in the air, although, to his regret, it has no arms. With these simple elements Primordia weaves a network of intelligent and satisfying puzzles, but above all perfectly integrated into the game atmosphere. Horatio is a builder, and he doesn't tolerate things breaking: if he can, he fixes them. Here then is that the many puzzles that ask us to fix a device or steal a numerical code are consistent with the personality of the protagonist and, thanks to the exchange of jokes between Horatio and Crispin, they become an opportunity to find out more about them and on the world of Primordia. Another positive aspect concerns the search for objects. Despite the low resolution graphics, the pixel hunting nightmare has been averted. The objects with which to interact are in fact few for each screen and the sensitive areas large enough to allow us not to lose important pixels along the way. The most interesting aspect, however, concerns the possibility of choosing alternative solutions for some puzzles and being able to skip others. In one case it was possible to solve a mathematical problem instead of tackling the puzzle in the classic way (we obviously failed and, sadly, we resorted to the old point and click to overcome the obstacle). It's nice to find that the game gives us the possibility to unravel a difficult situation through dialogue but without allowing us to try all the answers. After two attempts, if we haven't been careful with what we've read before, we'll have to find another way. The most striking case concerns the last numeric code of the game, a sequence of sixteen digits. This riddle can be solved even without the help of a key character, using a little logic, a pencil and a piece of paper. But if we want all the pieces to the puzzle, then we have to tackle a verbal puzzle, probably the most creative puzzle in Primordia. The beauty is that all these crossroads, which are almost hidden in the game, influence the plot and in the last scene they lead to different endings.We have seen three but there are ten in all. If you are worrying about the difficulty, we can reassure you: there is enough to keep the more experienced ones busy for about ten hours, but without excessive frustration, thanks also to the fact that Crispin, if we ask him, shows us in which direction to direct the our efforts. An aid that the hard and pure will still be able to deactivate. I, robot Despite the low resolution graphics, Primordia looks great. The prevalence of grays and browns does not cause any monotony, thanks to the care with which the details in the backgrounds have been placed and the skill in the choice of shades. Indeed, the harmony of the elements ensures that Primordia captures the player from the first minute with its electric and melancholy atmosphere. The sources of inspiration for Wormwood Studios are diverse and range from Dune (the desert, Horatio's appearance reminiscent of the first Fremen) to Blade Runner (the self-determination of robots, the cyberpunk megalopolis). The sense of secular decadence is omnipresent and, precisely for this reason, the hope of a rebirth, of which Horatio is the spokesperson, is even more heroic and desperate. In stark contrast to the dark tones of the setting stands Crispin, tireless comic shoulder who sweeps away the black mood with his pleasant cabaret irony, which in no way envies that of the best Max from Sam & Max. Unlike the pessimistic Horatio and of the inflexible Clarity (the third character who joins Horatio towards the end) Crispin is attuned to the bizarre levity of the inhabitants of Metropol. The discrepancy between the oppressive setting and the comedy tones works because, behind the characters, there is a complex structure. Indeed, Horatio, Crispin and Clarity have nuances and motivations that give them a minimum of dramatic depth. In some situations Primordia is even touching. In addition to the excellent dialogue writing and aesthetic cleanliness, this adventure boasts an above-average English dubbing, thanks above all to the voice of Logan Cunningham (Bastion). If Primordia is not already a classic, it is only because its philosophical system is not fully expressed, instead veering towards predictable conclusions. It touches on important topics, but after touching them, it moves away. Also missing is that share of artistic originality, if we want to define it that way, which would have consecrated it among the best adventures ever. Nonetheless Primordia remains a great game and a notable first effort from Wormwood Studios. Now there's a bunch more developers to keep an eye on.", "date": "2012-12-14", "grade": "8.3"}