{"name": "Ci vuole un liquido bestiale", "ref": "https://multiplayer.it/recensioni/112256-puddle-ci-vuole-un-liquido-bestiale.html", "text": "Clearly inspired by the excellent Hydroventure (here, refresh your memory), Puddle also lands on Wii U and does so by taking on the burden of launching, together with a handful of other titles, the digital offer of the new Nintendo console on the eShop . For those unfamiliar with the production by Neko Entertainment, which is already available on Xbox 360, PlayStation 3 and PlayStation Vita, let's say that it is a puzzle game based on the physics of liquids that offers us a fairly challenging campaign, made up of about sixty levels they take shape within nine different contexts. In each of these scenarios we control a different liquid, starting with traditional water and then moving on to acid, oil, even nitroglycerin and molten metal. Each liquid boasts unique characteristics in terms of specific weight, density and ability to react with the elements found within the locations such as fire, plants or even the human digestive tract. What we have the task of doing is ~tilting~ the scenario to allow the liquid to slide, supporting the force of gravity, between surfaces and pipes until it reaches the exit. All with the lowest degree of dispersion possible and being careful not to lose too much volume, otherwise it will be game over. To move the plane we can tilt the GamePad, thus using the accelerometer integrated in the controller, or use traditional solutions, such as the left analog stick or the ZL and ZR backbones. This last configuration proves to be the best from the outset, as it is very immediate and sufficiently precise (although the back keys of the GamePad are digital rather than analogical...), while the movement control is disappointing, decidedly slow in translating our solicitations. However, the Wii U version of Puddle also boasts a pleasant advantage: it can be played with the TV off, in handheld mode, making it equally good. The anthem of the loose body Once the game has started, we are catapulted into the action without frills and with very few incipits. We are briefly described the type of liquid we are dealing with, but for the rest we will have to figure out how to proceed and what to be careful of. The inertial context works well and on more than one occasion we will be called to swing the scenario once to one side, once to the other to obtain the speed necessary to jump a chasm or avoid an object capable of eliminating part of our mass . In short, it will be necessary to combine decision and delicacy, in a gameplay that immediately takes on the connotations of the most extreme ~trial & error~, because it is simply impossible to predict how the liquid will behave in certain situations and we will therefore have to ~take the measures~ to the more challenges of each level until you hit the right moves and reach the exit unscathed. The concept is therefore simple but sets clear and obvious stakes to the experience, which must be experienced in one breath, without checkpoints to underline the fact that the paths must be tackled in one breath. In the event that an internship seems too difficult and frustrating to us, we can choose to ~whine~ and therefore skip it to proceed immediately to the next one, but it is a strategy that can be used in a very limited way. Certainly the challenge makes itself felt, also and above all in situations that act as ~boss fights~ and mark the end of a scenario with a challenge to be completed within a certain number of seconds. Slow water Let's go back to the comparison with the aforementioned Hydroventure for a moment, because anyone who has played with Curve Studios' WiiWare title is well aware of the type of gameplay it proposed, based yes on the physics of liquids but in a decidedly fast and dynamic way. Well, Puddle does exactly the opposite and this, in our opinion, is its biggest limitation. Liquids move too slowly, so much so that in some situations it almost seems like living an eternal bullet time and this really doesn't stimulate the involvement in the soul of those who perhaps already don't appreciate this type of puzzle game that much. The level design in many situations marries with this slowness, adapting to relatively reasoned maneuvers, but the fact remains that a greater speed of the action and a greater responsiveness of the controls with respect to the inclination of the plane would certainly have made the game more captivating and less boring despite its undoubted ability to pose tantalizing problems. On the technical front there are no differences between the Wii U version and what we have seen on the other consoles, therefore we have fairly detailed locations, some very nice ideas (see the human bodyX-rays) and, as mentioned, the appreciable possibility of playing using only the GamePad screen. Too bad for the too essential sound and for the controls via accelerometer, as mentioned, not reactive enough to represent a valid solution.", "date": "2012-12-12", "grade": "6.0"}