{"name": "LEGO Star Wars: La saga degli Skywalker", "ref": "https://multiplayer.it/recensioni/lego-star-wars-la-saga-degli-skywalker-recensione.html", "text": "There was a moment when TT Games' LEGO-licensed video games seemed to have nothing more to say. The British developer had tried and tried to renew the proven formula, riding one brand after another while experimenting with new game dynamics, but by churning out a couple of video games a year he had ended up saturating a niche of the market which, absurdly, practically it was all hers. Furthermore, the fact that LEGO Star Wars: The awakening of the Force had not followed up on the release of the following films seemed like a wake-up call. Indeed, in recent years, LEGO video games had lost their momentum and perhaps it was good that it happened well, whatever forced TT Games to continuously postpone the new LEGO Star Wars, announced in 2020 and finally only now on shelves which is 2022 forwarded. At this point, all that remained was to play it to understand if the Force had awakened again, and in our review of LEGO Star Wars: The Skywalker Saga you will find out if we liked it or not. The LEGO Skywalker saga LEGO Star Wars: The Skywalker Saga, a scene from Episode IV For the uninitiated, TT Games began its adventure with LEGO video games way back in 2005 with LEGO Star Wars: The Video Game. That very first game laid the foundations for all those to come, as it reinterpreted the trilogy starring Anakin Skywalker and Obi Wan Kenobi in a brick and ironic key. The next year followed LEGO Star Wars II: The Classic Trilogy, which is self-explanatory. The British developer had then combined them into a single package, entitled LEGO Star Wars: The complete saga, while also giving itself to other brands such as Indiana Jones, Batman or Harry Potter. In short, LEGO Star Wars: The Skywalker saga is not the first themed compilation, but there are two crucial differences compared to the games of almost twenty years ago. Firstly, it represents all nine films, including Episode VIII and Episode IX, for the first time in LEGO form. And above all it is a completely new product. For the avoidance of doubt, in fact, we are not dealing with a kind of remaster or remake, but with a product redesigned from scratch in almost every aspect, from graphics to gameplay, and this also applies to the stages inspired by Episode VII: The The Force Awakens, which was also already a LEGO video game a few years ago. TT Games has concentrated all its efforts on the nine films that make up what we now officially call The Skywalker Saga - and hence the title of the game - and for this reason the appeal is missing LEGO Star Wars III: The Clone Wars, a release of 2011 which was based on the homonymous computer graphics animated series. , from the most famous Jedi to supporting actors who don't even know George Lucas. Because even this LEGO Star Wars, like all LEGO video games, speaks to two types of people: to those players who simply want to relive the nine films of the most famous space opera of all time and also to those who love to spend hours and hours on a title to unlock every content. Either way, LEGO Star Wars: The Skywalker Saga is a very successful product, and probably the best in the long history of this brand. Of course, we must appreciate the peculiar way of telling the stories of TT Games, which takes up the key moments of the various films in a parody key, summarizing the script in a handful of stages and cinematics for each Episode. The narrative can therefore appear a bit incoherent and forced, but nobody expects anyone to play LEGO Star Wars to discover the cinematic saga in this way. Also because humor is much less effective on those who don't know the original scenes and dialogues. LEGO Star Wars: The Skywalker Saga, we can also explore Otoh Gunga It must be said that LEGO Star Wars: The Skywalker Saga is also one of the most successful LEGO parodies. TT Games' humor doesn't always hit the spot and there have been much less funny tie-ins than the writers believed, but in this case the cinematics got more than a hearty laugh out of us. In the options it is also possible to choose the incomprehensible mutterings that characterized the first LEGO video games to replace the traditional dubbing: the latter leaves something to be desired, not so much for the Italian voices that rarely remember the iconic ones we have known in the cinema and on TV - and employing the original tracks would have posed more problems than solutions, and those who have played LEGO The Lord of the Rings will agree sensuz'altro - but above all because it distorts some legendary jokes that even the stones know, and one really doesn't understand why. It's hard to believe that the Italian trackers didn't think to verify such beloved scripts, which many fans simply know by heart. A LEGO that is almost an RPG LEGO Star Wars: The Skywalker Saga, the internships aboard the fighters are reminiscent of Battlefront games In general, however, we are faced with a successful adaptation of the nine films, which exploits the key passages of the story and the most spectacular action scenes, to put the player in the role of the protagonists and take him from the iconic opening credits of each Episode to those of the queue. In this sense, LEGO Star Wars: The Skywalker Saga adopts a structure more similar to that of the latest TT Games titles than the LEGO Star Wars of many years ago. Each Episode is divided into large hubs in which we will be able to wander around freely, looking for collectibles and collecting bricks - the so-called studs - before reaching the objective of the story which, after the usual cinematic, will start a limited and scripted stage. You then switch to a new hub and the procedure starts all over again, but at any moment it is possible to suspend the session and choose another Episode or the so-called Free Play, in which it is possible to replay the completed levels by controlling any already unlocked character rather than the ones imposed by history. LEGO Star Wars: The Skywalker Saga, to understand some aliens you will need a protocol droid It is not a divertissement for its own sake, as there are puzzles and paths that only certain characters can face. The game divides the endless roster of characters into categories: Jedi, Droids, Heroes, Rogues, Villains and so on. Each of them has one or more specific functions: the Jedi and other users of the Force, for example, can move objects with telekinesis and solve material puzzles from a distance, but they cannot interact with terminals accessible only to astromechs nor can they destroy chests for which you will need to roll a nice thermal detonator supplied to Bounty Hunters. The player can take control of a character in the party at any time, and swap them if the game mode allows; TT Games has introduced a series of visual clues that help identify the most suitable category to solve a certain puzzle, but some puzzles are much more subtle and may require very specific characters that we will have to unlock by first completing some secondary objective, and then dropping a variable amount of bricks in the appropriate menu. LEGO Star Wars: The Skywalker Saga, the combat system has been perfected Everything revolves around the bricks and we advise you to destroy everything you can because you will really need millions of them to unlock each character or ship. Fortunately, the latest TT Games effort offers a plethora of different content and activities, including platforming sessions, mini-games, shooter sequences and much more. The various Episodes are often characterized by an alternation of different situations and game modes: now you are facing a boss in a duel, the next stage you are piloting a fighter and in the next stage you are beating hordes of imperial stormtroopers with your bare hands. The British developer has balanced the different types of gameplay well, and although the traditional stages are significantly more numerous than the others, this makes the boss fights or space battles even more exciting. LEGO Star Wars: The Skywalker Saga, one of the first DLC unlocks the characters of The Mandalorian The control system is extremely intuitive; after all, LEGO Star Wars is a game also designed for the little ones, but although it is practically impossible to go into Game Over, we must admit that the latest TT Games effort seemed to us much more demanding than the previous ones, both in terms of structural complexity, both in terms of gameplay sophistication. We said, in fact, that the various scenarios hide a plethora of secrets and collectibles; what we have not yet pointed out is that in these situations LEGO Star Wars: The Skywalker saga becomes a kind of RPG with lots of characters to talk to to start side missions, collect clues or trade. The game no longer hides only the traditional minikits that are used to unlock new means of transport and other extra content, but also the so-called Kyber bricks that we can spend in a special screen to enhance the various categories of minifigs. In fact, each has a real tree of skills that cost Kyber and stud: their effectsranging from increased movement speed to an increase in attack or defense in combat, passing through passives that, among other things, bypass the puzzles to be solved or simplify some aspects of the game. LEGO Star Wars: The Skywalker Saga, the upgrade system could have been more incisive Considering that there are over a thousand Kybers to find, it is clear that TT Games has been very attentive to the collecting aspect, but sideways, there is no challenge in the game that cannot be overcome without investing even one point in the various skills, which thus turn out to be a bit superfluous and tend to thicken a title already full of screens, interfaces and collectibles. At the same time, the British developer has taken a major step forward in terms of sophistication, bringing together the best of its most successful titles in a single package. This consideration applies above all to the control and combat system, always intuitive and essential, but enriched by additional features such as perfect dodges complete with slow motion, counterattacks, unique combos, shelters behind which to crouch during shootings and so on. The player can approach enemies in the most disparate ways, especially if he controls the Force users who, between telekinesis, lightsabers and mind tricks, are undoubtedly the most fun characters to control. From Tatooine to Exegol LEGO Star Wars: The Skywalker Saga, could not miss the most famous duel of the saga LEGO Star Wars: The Skywalker Saga is undoubtedly TT Games' most successful title, also from a technical point of view. Passing over John Williams' soundtrack, which comes directly from the films and which it doesn't even make sense to discuss, it is precisely the graphic sector that strikes us and makes us think of what a serious Star Wars videogame tie-in could have been in the hands of programmers so passionate. It is obvious that the various scenarios are not a 1:1 reconstruction of the sets seen in the cinema and on TV, but taking inspiration from films and television series such as The Mandalorian, the artists of TT Games have managed to design stages and hubs full of details and details that will drive Star Wars fans crazy. The solution used is that of the most modern LEGO licensed titles: not everything is made of bricks, and indeed much of the scenario is roughly realistic. The image is always spotless; the number of characters on the screen roaming around locations like Mos Espa, Theed or Coruscant is impressive, and the play of lighting and shaders works wonders when you consider that the characters are identical 3D models characterized mostly by different textures. LEGO Star Wars: The Skywalker Saga, some characters can wear the armor of enemies The care is such, however, that these minifigs, at a close shot, appear indistinguishable from their real plastic counterparts that you may have on your desk. The same goes for the means of transport, spaceships and fighters, which have been rebuilt in bricks, replicating the most famous kits on the market. Somehow, this combination of reality, bricks and fantasy works better than expected. Playing in Free Play, it is possible to choose whether to start a stage directly, reach a hub or start the game in the space above a planet: from here we will be able to fly to that world or the closest ones, perhaps fighting the enemies who will attack us by surprise during the voyage. A touch of class that reminded us of the moves in games like No Man's Sky, a bit of an end in itself but certainly appreciable. LEGO Star Wars: The Skywalker Saga, Kylo Ren in a scene from Episode VIII Despite all its efforts though, TT Games keeps slipping on the proverbial banana peel when it comes to optimization. LEGO Star Wars: The Skywalker Saga is a beautiful game to look at, but certainly not a masterpiece of polygonal complexity, yet there are occasional dropped frames if we start destroying everything, lifting hundreds of colored bricks in the most populous open world scenarios. And so far, a blind eye is being turned a blind eye, also because fortunately we have never encountered these uncertainties in the most elaborate and spectacular stages. At the same time, it is incredible that the titles of the LEGO series continue to present the same bugs after all these years. It happened to us that the camera, which is already unaccommodating by itself, got stuck in the same shot, forcing us to restart the game, or that the enemies in space became invulnerable right at the end of a particularly long secondary mission, which also served to unlock the legendary Biggs Darklighter, so that was even more annoying.", "date": "2022-04-04", "grade": "8.4"}