{"name": "Morti che fanno strike", "ref": "https://multiplayer.it/recensioni/112121-the-bowling-dead-morti-che-fanno-strike.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. Do you remember the grindhouse atmosphere of The House of the Dead: Overkill? Here, the new action game by Slant Six Games (the team behind the recent Resident Evil: Operation Raccoon City and the SOCOM series) puts us in a very similar context, in which the world is invaded by ravenous zombies and only one man stands to face them... with a can of beer in one hand and a bowling ball in the other! In recent years the theme of the living dead has definitely come back into fashion and these pathetic creatures crowd all the media, especially mobile games, so it was really difficult to come up with something new to involve them, yet the developers of The Bowling Dead (which in the title clearly recalls ~The Walking Dead~) they succeeded, inventing this absurd bowling game in which striking can save our lives... literally. Available in freemium format on the App Store, therefore downloadable for free, the new Activision production does not base its appeal on simple survival mechanics, but provides us with a rather substantial and demanding single player campaign, consisting of about eighty levels set within of four different scenarios. The goal in each stage is to take advantage of the bowling balls at our disposal to hit the approaching zombies who at a certain point begin to move following particular trajectories, sometimes unpredictable, making things increasingly difficult for us. Decaying skittles The control system adopted by The Bowling Dead is based exclusively on the touch screen and allows us to perform various types of shots, starting with the traditional one (which can also be loaded for greater power) and the ~flying~ one, capable of hitting the zombies in the head so as to get a higher score. To throw the ball, all we have to do is drag it on the screen, pulling it backwards and then forward in the case of the classic throw, giving it the desired trajectory so as to hit the undead that advance in the center or on the sides of the scenario. The enemies are not always the same, and so sometimes we will be faced with real monsters, to be killed with various launches, as well as sections in which we must consider not only a ~corridor~ in front of us but also equally dangerous side areas. By spending the virtual money earned on each stage completed, we can unlock more bowling balls, buy cans of beer (which work as a tonic for the protagonist), access various upgrades and spheres with special abilities, such as those explosive or those with rotating blades. Finally, the default knife can be replaced with a longer and more resistant blade, to be used when a zombie has now reached us and we have to hit it quickly (following the trajectories indicated on the display) to shake it off and avoid game over. There are two limitations of The Bowling Dead, in our opinion: firstly the controls are not always as precise as we would like, and this causes the loss of precious throws; secondly, the freemium dynamics appear rather stringent and the money given for each victory is too little to do us any good. In short, the temptation to put your hand in your wallet is high...", "date": "2012-12-08", "grade": "7.5"}