{"name": "Una missione in trasferta", "ref": "https://multiplayer.it/recensioni/112084-the-elder-scrolls-v-skyrim-dragonborn-una-missione-in-trasferta.html", "text": "After the small Heartfire and after the valid but always too expensive Dawnguard, here we are in front of the third DLC for Skyrim which presents itself as the richest and most ambitious. To begin with, Dragonborn adds a large area to the Bethesda title and this means new cities, animals, creatures and a different setting from the one he has hosted us to date. Furthermore, the quest takes up the main trend, namely that of the Dragonborn, recovering part of the epic that convinced us back in November 2011 of the goodness of the fifth The Elder Scrolls. True Dragonborn To start the dance it is enough to visit a city, as in Dawnguard, to be automatically attacked by a handful of disreputable guys. The scoundrels are conspicuously linked to dragons and, while wanting to eliminate us, their only result is to turn our attention towards their cult. Not only that, the fanatics bring with them all the clues necessary to trace the instigator of the attack who, among other things, makes the unfortunate mistake of proclaiming himself the true Dragonborn. It goes without saying that the adventure starts with intentions of revenge which, although not very noble, are decidedly invigorating and motivate us in a way that hasn't happened since the first moments of the game, a year ago. To find the commander who brought the unfortunate cultists to Skyrim, it is necessary to visit the Winhelm sucker from which we will be able to reach the coasts of Solstheim with a short but welcome cutscene. Many of us have already been there, in the Morrowind DLC called Bloodmoon, but this is certainly not a point against Dragonborn. From the outset it is clear that Bethesda has worked carefully to fill the new area with books, dialogues and missions. Those who have already been to Morrowind will still find unpublished information and those new to the series will fill in various gaps on the Daedra and the continent of Tamriel. There are also objects related to the cultures that populate the island. Despite being far to the north and partially covered by ice, Solstheim is in fact an integral part of Morrowind and is inhabited, and dominated, by the noble families of the region. Roccia del Corvo, for example, is in the hands of the Redoran who at this juncture find themselves fighting strange ash creatures capable of throwing flames and striking powerfully. However, these are not the most fearsome creatures we will meet. The new adventure, in fact, confronts us with fearsome threats including humanoids born from the fusion of a sabipod and a Mad Max survivor. There are also increasingly powerful enchanters and there is even a strange race of tentacled beings linked to the prince Hermaeus Mora, which also blend into the main storyline and which are reminiscent of creatures from the myth of Cthulhu. The Daedric prince of fate himself is a large interdimensional octopus who welcomes us to the realm of Apocrypha where all the forbidden, forgotten and dangerous knowledge is hidden. So much is the power enclosed here that we are given the opportunity to enhance some of our powers even reaching the point of summoning a dragon of flames. The versatility of animal collagen Solstheim, a frozen land to the north and dusty land to the south, mixes the architectures of Morrowind with those of Skyrim, placing normal houses side by side with mushroom-shaped buildings and chitin houses that resemble enormous insects. Many will come back to that first impact with the town of Balmora and this thanks to the armor made of fused and kneaded bones that are popular among the peoples of the area. Predictably these protections, as well as those of chitin, enrich our possibilities as a blacksmith but are not particularly powerful. Indeed, we have not found anything more powerful than what is already available in Skyrim and it is unlikely that there is anything better than, perhaps, a legendary equipment based on an extremely rare mineral. In any case, the absence of powerful items is not necessarily a bad thing since it allows you to maintain a minimum of challenge even with high-level characters. Acting in the shadows with a bow in hand grants, as always, a huge advantage to the player but the main quest line includes some situations where this modus operandi is not possible although the arrows remain extremely powerful even in the middle of the action. To complete the main quest with a medium-high level character, Apocrypha included, it takes about 7-8 hours, proceeding relatively calmly. To this estimate must be added various secondary quests that lead us to interact deeply with the houses and which, between dialogues and books, can exceed 10 hours. In short, the total is around 18-20 hours, enhanced by the relatively small size of Solstheim which minimizes downtime and gives us a ratherI'm dense. An experience, as we anticipated, which also grants us completely new dragon screams. Aspect of the Dragon summons an ancient power in the form of armor and a sort of translucent avatar. Apparently inspired by the Knights of the Zodiac and Ken the Warrior, this power increases stats and protection, proving to be quite useful when dealing with archpriests and new creatures. But the powers also involve dragons who obviously follow us to Solstheim. By bending the will of the large flying lizards we are given the long-awaited ability to ride them and it is right here, where we least expected it, that the only real disappointment of Dragonborn arrives. In fact, flight remains a matter for dragons with our extremely limited control possibilities. In short, escort Panzer Dragoon and think of something heavily scripted and superfluous. The camera also throws tantrums in various situations, also compromising the visual amazement. Therefore, only fast travel remains to make sense of this feature which, given the small size of Solstheim, has a relative value. Xbox 360 goals The objectives shouldn't take too much time since they are almost all related to important elements of the DLC such as story, new powers and dragons to ride. Probably the most complex are, paradoxically, the exploratory ones which, to be completed, require the creation of an object with the mysterious Stalhrim material and the exploration of all 30 areas of Soulstheim. Let's get to the point About 20 hours of play for 1600 points are, more or less, what is offered by the two Dawnguard questlines, but the quality of Dragonborn is much higher, also from the point of view of the code, bringing the DLC closer to the status of an expansion. It is certainly not the objects or powers that enhance the experience, even if they are welcome elements, but the main plot and the encounter with the ancient houses that reserve several surprises for those who appreciate the narrative component of The Elder Scrolls series. As icing on the cake, the DLC also brings us a fair number of new creatures among which, in addition to bloodthirsty monsters and tentacled deities, we find the old luminous flying cows of Morrowind with great joy. Basically if you enjoyed Dawnguard we can only recommend the purchase of this new downloadable content which is the first to repay (almost completely) the purchase price.", "date": "2012-12-07", "grade": null}