{"name": "Un mattoncino per domarli", "ref": "https://multiplayer.it/recensioni/112057-lego-il-signore-degli-anelli-un-mattoncino-per-domarli.html", "text": "After Indiana Jones, Harry Potter, Star Wars, Batman and the DC superheroes, TT Games tries its hand at another cult brand and does so, for obvious reasons, in conjunction with the release of ~The Hobbit~ in cinemas. LEGO The Lord of the Rings inevitably represents a large and complex project, which condenses the three films directed by Peter Jackson but not only into a single video game, giving fans of Tolkien's work more than a welcome extra compared to the story that was told on the big screen. Characterized by long cinematic sequences, a novelty for the LEGO series games, the playful part of the product opens with the rise of Sauron and the spectacular battle between the latter's army and the opposing forces, which culminates with the defeat of the Dark Lord of Mordor and the consequent betrayal of Isildur, who decides to keep the One Ring for himself instead of throwing it into the flames of Mount Doom. This phase is a bit like a tutorial, illustrating some of the mechanics that will characterize the entire experience but which do not differ from what has already been seen in TT Games games: you can instantly switch from one character to another in the party to take advantage of everyone's skills, you have to face a certain number of enemies in duels that are still very unattractive from a gameplay point of view (in fact, the usual ~slipperiness~ and the lack of an appropriate impact sensation remain) and above all explore the scenarios looking for interactable objects of any kind, because they could hide treasures and/or resources useful for accessing the wide list of unlockable elements included in this production. The Fellowship of the Ring A few millennia after the battle of Mordor, the ring is found by chance by the hobbit Bilbo Baggins and finally ends up in the hands of his nephew Frodo, who is invested by Gandalf the Gray with the great responsibility of guarding it until its destruction. It is at this point that LEGO The Lord of the Rings officially opens the dance, projecting us into a detailed and ~substantial~ Middle-earth, which takes up the excellent work done with LEGO Batman 2: DC Super Heroes to once again offer us a sandbox to which to leave for the various places where our presence will be requested, with the possibility, however, of going back if necessary and accessing the quests that will have become available in the meantime. Even a vague knowledge of the events narrated in the film trilogy can make you guess how many hours of entertainment the game is able to offer, alternating standard action and special sections in a very well-matched mix, which manages to remain faithful to the original work without ever expiring in hasty or evidently sketchy solutions. Just like in the latest LEGO Batman, here too the cutscenes are spoken and the dialogues are precisely those of the films, unfortunately in English (with Italian subtitles), as has become tradition for the franchise. The comedy is therefore only visual and resides in the absurdity of what the characters do while reciting certain sentences, such as Gandalf who in taking leave of Frodo during their meeting at Bilbo's house does nothing but bump into the chandeliers, or the ridiculous attitude of Aragorn every time Arwen enters the scene, or even the fixation of Pippin and Merry for food even during the most agitated situations. Gameplay and technical sector If in terms of numbers there are no doubts about the quality of LEGO The Lord of the Rings, in the same way it must be said that this latest effort by TT Games does not introduce particular innovations on the gameplay front. Beyond the interpretation of Middle-earth as a huge hub for accessing the various levels, a solution - as already mentioned - introduced with the Gotham City of LEGO Batman 2: DC Super Heroes, there is in fact very little that differs from the mechanics we've been used to for years. Strong emphasis has been placed on exploration and interaction with the environment, a factor which here too exerts an indisputable charm and holds up the situation, but in the same way the challenge is completely missing (our character dies and comes back to life in an instant , as if playing with the infinite lives cheat) and nothing has been done to make the fights more interesting. Moving on to the technical analysis, the Wii version obviously pays duty compared to what was seen on PlayStation 3 and Xbox 360 (also as regards the number of stages present), given that it cannot boast the same level of detail or the same fluidity and this it translates into environments that are often ~dirty~ and lacking in definition, with the frame rate struggling when we decide to move the view within densely populated scenarios. The systemcontrol ema with Wii-mote and Nunchuk works well, moreover it is widely tested, while nothing can be said about the soundtrack, which is the one signed by Howard Shore for the films.", "date": "2012-12-07", "grade": "7.9"}