{"name": "Connessione persa", "ref": "https://multiplayer.it/recensioni/111995-sports-connection-connessione-persa.html", "text": "As even stones know by now, Wii Sports was not only the title that literally baptized the previous Nintendo console, but also the strongest supporter of the platform's incredible sales. However, Wii U is completely different hardware both in terms of characteristics and philosophy, and the Kyoto giant has rightly preferred to entrust the role of forerunner to a game of a completely different genre such as Nintendo Land, leaving the box relating to multi-event sports titles uncovered. Ubisoft certainly didn't miss the opportunity to occupy this space with Sports Connection, which unfortunately proves to have very little in common with its illustrious predecessor... Better to play outdoors And to think that Sports Connection starts with the good intentions of offering immediate and no-frills multiplayer fun, offering six different sports specialties (tennis, golf, soccer, American football, baseball and kart racing) in which a user uses the GamePad and its built-in screen, while up to four other remote-equipped players follow the action on their TV. Unfortunately, beyond raising the number of people who can be involved simultaneously compared to a ~normal~ console by one unit, the Ubisoft product does little to broaden the discourse concocted by Wii Sports six years ago, actually resulting lower for many wait for the Nintendo title. To begin with, Sports Connection immediately denotes a lack of attention to the aesthetic system and design, showing off anonymous menus, unpleasant avatars - which can only be minimally customized - and in-game graphics which certainly do not represent the best showcase for Wii U performance, on the contrary: not only do the settings appear bare and the characters made and animated in the best possible way, but the game also denotes a dancer frame rate that gets worse as the number of users involved in the matches. However, that it is a product made on the cheap can be understood from various other signs: very little variety of scenarios within the disciplines, continuous (and unjustifiable) requests for calibration of the Remotes, incredibly long uploads and often extremely summary explanations of the commands, intended to create a lot of confusion in less experienced users. To all this must be added the most serious aspect of all, namely the fact that the six mini-games, despite the innovative hardware on which they run, arouse a boring feeling of deja-vu which often leads to irritation caused by their malfunctioning . Only tennis and golf are ~saved~, in fact bad copies of what was already offered by Wii Sports in the same specialties, however distinguished by an infinitely less precise detection of the movements of the Remote even if Motion Plus is used. the remaining four disciplines instead borders on the dramatic. American football and baseball, already unattractive to the vast majority of our local public, respectively demonstrate an unacceptable cumbersomeness and a lack of intuitiveness of the movements to be performed by the user armed with Remote, undoubtedly revealing themselves to be the two weakest mini-games of the internal package. The kart race is instead debased by a few anonymous tracks, by a very imprecise control system and by a crippled frame rate despite the poverty of the graphics. It doesn't go better with football, too limited to be even remotely entertaining and which finds a minimum of inventiveness only for what concerns the execution of penalties, with the person in charge of the shot having to trace the desired trajectory on the GamePad touchscreen and the goalkeeper who throws himself based on the direction given by the Remote. If we exclude this example and very few others, Sports Connection also fails as regards the application of the concept of asynchronous multiplayer, i.e. that system inaugurated by the Nintendo console through which whoever uses the GamePad performs a different function from whoever wields the Remote facing the TV. It is here that the lack of commitment of the Ubisoft developers manifests itself in all its evidence, with almost no inventiveness that explodes in cases such as golf, in which the GamePad has a completely marginal function and users have to play turn using only the Remote. In short, Sports Connection represents the most apt expression so far of what gaming on the new Nintendo console should NOT be: instead of trying new ways with conviction to exploit the peculiar characteristics of Wii U, the Ubisoft product limited itself to proposing trite ideas and tired by awkwardly updating them to the new standards of Nintendo hardware. The result is a coflat-paste of rare superficiality, a real mess of poor technique and unfortunate design ideas that has resulted in a multi-event sportsman that literally ends up leaking everywhere.", "date": "2012-12-06", "grade": null}