{"name": "L'ora della verit", "ref": "https://multiplayer.it/recensioni/111997-modern-combat-4-zero-hour-lora-della-verita.html", "text": "The hardware is updated and becomes more powerful, the development teams learn to know it and make the most of it over time, and this is how products that a few years ago we thought impossible to create in the mobile sector are now a consolidated reality. Like the Modern Combat franchise, which together with its ~cousin~ N.O.V.A. represents the spearhead of the Gameloft catalog, as well as the iOS and Android experience closest to what is offered by the various Call of Duty on home consoles. We are in fact talking about a ~triple A~ production in all respects, created by a large team who dedicate themselves body and soul to the project for several months, in search of a dimension that the game is denied only because of the limitations systematics of the devices on which it runs. But let's go in order. As with the previous chapters, the plot of Modern Combat 4: Zero Hour is quite clearly inspired by Black Ops II, at least as regards the theme of war drones and their control, which ends up in the hands of Edward Page , a former Green Beret now convinced anarchist, determined to destroy the economic and war empire of the United States by pulling off a colossal operation, whose target is none other than the US president. Within twelve missions (lasting an average of ten, fifteen minutes each) we will take turns in command of some soldiers and special agents intent on putting an end to the terrorist threat, as well as Page himself, in a campaign that therefore plays the card of ambivalence and shows us the sick point of view of the ~bad guy~ at the same time as that of the people who will have to try to stop him. crash! Boom! Bang! It only takes a few seconds to realize the qualitative level reached by Modern Combat with this fourth episode, given the goodness of the direction and the variety of explosive situations in which you are already in the first level. Beyond the traditional firefights, open-faced or in the presence of numerous objects to take shelter behind, the action alternates frenetic racing aboard jeeps while a helicopter chases us, sections that see us control a drone to pave the way in an area full of hostile soldiers, phases in which we have to eliminate distant targets by shouldering a sniper rifle, the classic bullet times when one breaks into a room full of enemies and still a series of quick time events in which we are asked to draw trajectories on the screen to knock out an opponent who took us by surprise with a melee attack. Let's imagine that the Gameloft developers have created a sort of list of things to include in Modern Combat 4: Zero Hour, because perhaps seen in some console shooter, and only later framed everything within a story. In terms of direction and structure, however, everything works very well: there's a great feeling of variety, limited to the genre, and a nice pace. It lacks originality altogether, but we had taken this into account. The age-old question of controls Can you develop a great FPS for touch-enabled devices? The answer is yes, but compromises clearly have to be made. A frenetic action like that of COD is in fact unthinkable in such a context, because the touch screen cannot in any way offer the responsiveness, precision and ~support~ of a real controller. We have therefore become accustomed to games with a more reasoned approach in many ways, in which we face one situation at a time, determine the position of the enemies, expose ourselves to be able to hit them and then maybe take cover again. Surviving an assault on various fronts and even quickly framing an opponent who suddenly falls in front of us may not be so simple, on the contrary, and therefore elements such as level design, the artificial intelligence of hostile units and the gameplay in its entirety are shaped in a certain way, keeping these factors in mind. Modern Combat 4: Zero Hour does this and even more, providing us with a variety of configurations and customizations for the controls that are incredible. Beyond the three ~styles~ available for the commands, in fact, it is possible to adjust the position and size of all the elements of the graphic interface, activate or not the automatic aim (which in any case is never ~invasive~, limiting itself to hooking a target when the viewfinder is very close to it) and even use the gyroscope to manage the view, a suggestive solution but not always practical nor precise enough. What's missing, and we're really surprised that nobody thought of it, is an option to enable auto-fire when the reticle lands on an enemy. In a FPS hook atarget is the operation that immediately precedes the opening of fire, so what's the point of stubbornly opting for a manual fire button? In this way, not only is it impossible to effectively manage aim and fire, but the entire control system becomes terribly awkward and cumbersome. Multiplayer and technical sector Beyond the single player campaign, which is completed in a couple of hours if you proceed quickly (which is no small feat for a mobile FPS), the Gameloft title offers a truly promising multiplayer sector, which we were unable to test at background (the game comes out today on the App Store) but which boasts respectable numbers. In this case we have eight different modes: ~Battle~, or all against all; ~Teams~, the traditional deathmatch; ~Capture the Flag~, which needs no introduction; ~Manhunt~, a sort of ~capture the flag~ in which everyone is on their own; ~Area Control~, the inevitable territorial mode; ~Capo~, in which each team has a leader and must be eliminated; ~Survival,~ a hardcore-style, unaided team deathmatch; ~War~, a variant of ~Area Control~ but with some extras. There are also eight maps at our disposal, characterized by a good variety and moderate size, while the management of perks and upgrades takes place by spending the experience points that we earn both in single player and in multiplayer, and which we can buy in various sizes if we want to to the wallet. As for the technical sector, the images of the game speak for themselves and we can only confirm the goodness of the work carried out, certainly among the best things that have been seen on the iOS platform. The use of the Havok engine has guaranteed a whole series of interesting features, such as the scenarios that are damaged under the bullets of our weapons, the enemies that fall in various ways after being shot to death and more. However, we cannot speak of infallible graphics management, given that in the most agitated situations there are frequent drops in the frame rate, especially on the New iPad (evidently due to the high resolution), and this is invariably reflected in the precision of the touch controls . Excellent sound effects, discreet musical accompaniment, while the English dubbing did not impress us well.", "date": "2012-12-06", "grade": "8.5"}