{"name": "Calci al passato", "ref": "https://multiplayer.it/recensioni/111833-fifa-13-calci-al-passato.html", "text": "As you will have seen, with the reviews of Wii U games that have already appeared on other platforms, we have previously chosen to focus on the GamePad news and the conversion work, referring to the PS3 and Xbox 360 test article for all common details between the different versions. In the case of FIFA 13 for the new Nintendo console, however, it would have been incorrect to indicate the link to the review of the same chapter, simply because on Wii U it is not the ~real~ FIFA 13, despite what the experts in charge of marketing at EA wanted to claim judging by the cover. Yes because, as has been clear for some time, the edition in question is largely based on last year's game, thus finding itself deprived of all the refinement work and improvements that the owners of the Microsoft and Sony consoles were able to enjoy. Of course, considering the quality of the Fifa chapters that appeared on the Wii, this could already be considered as a step forward for Nintendo users, yet evaluating the potential and technological freshness of the Wii U instead, one can only remain with a bad taste in the mouth. A goal from 2011 Certainly the reasons related to this choice are more than credible: in essence, the team responsible for the conversion work on Wii U barely had time to adapt last year's edition to the new hardware, finding itself forced to leave out elements such as the First Touch Engine, the Skill system, the refinements to the Player Impact Engine, the EA Sports Football Club, the FIFA Ultimate Team and all the physics and gameplay improvements that have instead distinguished the ~real~ FIFA 13. This essentially translates into an obviously quality product, but which lives in the contrast of being sold at the same price as a homonymous one which on the other consoles is undoubtedly superior in form and substance. A problem, this, which could be at least mitigated by a convincing and positive exploitation of the GamePad; in this sense there is actually some good, even if there are elements that are less successful or that are simply not entirely convincing. The ~simplest~ thing, that is the possibility of playing with the TV off on the controller screen, is absolutely present here; the fluidity and the frame rate are not up to the standard mode, nevertheless the situation remains more than acceptable. On the other hand, the absence of any graphic element such as radar, indication of the result or progression of the time of the match is strange. Instead, those who choose to play in the traditional way on a television will be able to take advantage of a whole series of menus, divided by tab, with which to modify different aspects of their team in real time by interacting on the touch screen. We are referring both trivially to the management of substitutions, both of the markings and of the tactical attitude and of the formations deployed. If on the one hand being able to act on these aspects without interrupting the flow of the game is an intriguing solution that does not fragment the action, on the other it is obvious that one must be careful not to divert attention at important moments. Similarly, often moving your gaze between the TV and the GamePad leads to a certain sense of annoyance that has already been reported on other occasions. More generally, the interface structure of FIFA 13 clearly demonstrates that it has not been designed for interaction via touch screen; often and willingly, for the elements that have not been designed from scratch for this version, we are in fact faced with microscopic buttons that do not lend themselves to interaction with the fingers, soon prompting us to prefer the more banal navigation solution with cross and keys. On the other hand, the innovations introduced at the level of pure gameplay are completely negligible, which appear more as false additions destined to be soon forgotten. In practice, shaking the GamePad (or pressing the right stick) near the opponent's goal causes the same goal to appear superimposed, allowing you to choose which area to shoot towards with a touch. Similarly, free-kicks can be taken by raising the controller towards the TV in order to have a sort of ~field~ view, and tapping on teammates and opponents generates passes and tackles respectively. Lastly, with quick finger slides it is possible to trace the trajectories to be followed by teammates without the ball, so as to promote insertions and offensive movements. Unfortunately, very simply, the precision of the keys remains unattainable within mechanics that have been designed for them, and above all it is extraordinarily uncomfortable and deleterious to remove your hands from the normal grip to go and touch the screen. Gameplay closed, wedeng to add that our online experience was rather disappointing; less than a hundred people present, great difficulties and long waits to start a meeting, and a rather frequent delay. The situation is likely to improve, but it is clear that we must refer to the situation encountered at the time of the test. The absence of voice chat is then undoubtedly intended to resize the mode in question. Finally, the co-op mode is pleasant, which allows you to play in local multiplayer with the user with the GamePad busy managing the tactical and strategic component of the team. The graphic component is good, which with the exception of some frame loss remains on the levels of the other versions of last year.", "date": "2012-12-03", "grade": "7.0"}