{"name": "Le operazioni nere di Wii U", "ref": "https://multiplayer.it/recensioni/111778-call-of-duty-black-ops-ii-le-operazioni-nere-di-wii-u.html", "text": "The Wii U launch line-up demonstrates a remarkable third-party support that bodes well for a future rich in content for the new console: alongside a Batman: Arkham City and an Assassin's Creed III, (without obviously forgetting Mass Effect 3, FIFA 13 or Darksiders II) we find the latest chapter of the blockbuster series par excellence of recent years, Call of Duty: Black Ops II, which thanks to the renewed Nintendo hardware arrives on the shelves with its head held high, challenging for the first time on equal terms PC, PlayStation 3 and Xbox 360 flagship versions. In this review of ours we will not go back to examining all the components of the game in detail, for this reason we refer you to the full-bodied and exhaustive review of the home computer version, but also and above all to the video review and the dedicated Superdirect. We will therefore focus on the peculiar aspects of this version, namely the use and functionality of the GamePad and obviously the graphic part, which has always been the cross and delight of the franchise. But if someone had only just now listened, we can simply say that this new chapter offers a non-linear single player campaign with six endings, a multiplayer sector that is in some ways profoundly renewed with the aim of pushing a lot on the side of team play and an expanded and content-rich Zombies campaign. In short, there is a lot new to play, just to silence all those who judge the franchise ~the usual heated soup~. One more screen But no more talk, what does this version of Call of Duty: Black Ops 2 offer us more than the ~old gen~ counterparts? In short, what is the gaming experience via GamePad? Playing the campaign, the touch screen is practically unused, we are only notified of the mission objectives and a panel for changing options. But it is possible to switch to playing with the pad at any time, turning off the TV if we want. In this case we did not experience any bandwidth issues for game streaming, and the visual quality, subject to the maximum 480p resolution of the screen, remained (obviously) the same; with the charm of being able to play a Call of Duty almost on the move, we could say. Zombie also offers no additional features other than screen switching. It is in multiplayer that the GamePad offers us something more: nothing exceptional is understood, but a couple of features are undoubtedly interesting and useful. In addition to the level map always visible (with friends and enemies displayed) it is possible to use the Scorestreaks reached directly by touching them on the screen, similarly the class change can be done in the same way on the fly with a simple tap. Furthermore, both in the campaign and in multiplayer, thanks to the possibility of changing the sensitivity of the aim with a simple pressure of a finger in the game, obviously without going through the menus, the game allows us to significantly streamline a calibration process that we felt was necessary given the lack of precision of the default settings of the right stick. But the GamePad's real winning feature is how it's used in local multiplayer. A gamer can use the TV, but at the price of one frame rate one thread unstable, the other that of the GamePad. In short, a non-divided split screen, with all the details in their place (except for a quantitative lowering of the shadows), in short, without that sense of ~blindness~ typical of the shared screen. In short, more than the extra tactile features, it is the sensible exploitation of the hardware features that gives the game an edge. Finally, it should be noted that, once you enter the pre-multiplayer game lobby, the poor population of the game servers has invalidated our test. Not so much in terms of netcode, but the choice of actually playable game modes; in fact, only teamdeathmatch allowed us to test the game for a long time. Ultimately, what matters most now, more than graphical comparisons that leave the time they find at the dawn of this new generation, is in fact the GamePad gaming feeling in hand, especially in comparison with a title like Call of Duty in which ergonomics and quick reflexes go hand in hand. Our impression is that, once you get used to holding a very different controller in a short time compared to what you have had in your hands so far, the use is completely similar to that of PlayStation 3 or Xbox 360. And indeed if you choose to playing it on the GamePad screen one realizes that it is not a simple extra possibility, but a mode that has nothing to envy compared to the classic television one and which in some ways, thanks to the ~portable~ effect, is undoubtedly surprising; one was almost driven to play it this way given the goodness of the qvisual quality of the images and the lightness of the GamePad that does not tire your arms. On a visual level, Call of Duty: Black Ops 2 suffers a little from being a launch game, probably due to a pinch of inexperience of the developers in the face of new development systems. In terms of textures, shaders, effects and polygonal mass there are no differences between this version and that, for example, Xbox 360. Perhaps we can detect on some models a little more aliasing and plays of shadows that are not exactly flawless, but the impact is the same. What was most worrying was the frame rate, even in light of the other titles just released. We are not in the presence of dramatic drops or conspicuous slowdowns, but in some situations a lower speed is felt than the canonical 60FPS. Nothing that compromises the goodness of the gaming experience, but still perceptible.", "date": "2012-12-01", "grade": "8.8"}