{"name": "Paura e delirio a Quahog", "ref": "https://multiplayer.it/recensioni/111643-i-griffin-ritorno-al-multiverso-paura-e-delirio-a-quahog.html", "text": "The less English-speaking of you will be amazed to see Family Guy written on the packaging. This is in fact the original name of the work by Seth MacFarlane, renamed in Italy Family Guy probably as a reference to another famous series of cartoons. Activision and Heavy Iron Studios thought that the show could work in the video game field, and so here we are in the role of the brilliant little Stewie, who in the company of the talking dog Brian will have to travel through various parallel dimensions to avert the end of the world. Incipit that vaguely draws inspiration from one of the recent episodes of the series, functioning as a mere pretext to give away a coarse third-person shooter. Of course, all the key characters of the program peep out, including the initial theme song, faithfully reproduced. The game itself makes extensive use of both pre-calculated cutscenes and a polygonal realization based on the cel shading technique, in an attempt to replicate the atmospheres of the cartoon. Unfortunately, that of tie-ins is always a very delicate sector, where it is often difficult to understand the difference between inspired product or specious fan service. Let's find out together how this Family Guy: Back to the Multiverse fared. Victory is mine! The adventure begins with our two heroes catapulted into another dimension, all through a sinister portal controlled by a remote control. Each level is in fact represented by a different scenario that requires the fulfillment of specific tasks. The same portal appears multiple times during a chapter and can be used to access the weapon shop. Stewie and Brian use a fair number of weapons that are accumulated during the campaign, imaginative for the little one, more traditional for the dog, as well as a long series of ridiculous objects completely comparable to smart bombs. The screen is quickly saturated with enemies, which include drunken students, fanatical farmers, girls with pepper spray and paralytics who use their guns as crutches. There doesn't seem to be any limit of decency in Heavy Iron Studios' product, even worse than the series it is inspired by, given that it stages situations and objectives animated by an absolutely insane end in itself. As a further reference, the historical exclamations of the characters can be heard, almost always unrelated to the events represented and also in this case inserted as a vulgar fan service. The vulgarity, the explicit sexual allusions and the cynicism of the dialogues are incredible, so much so that it often leads to bad taste. We are on releases like: ~I can't have children, fill me up~, or ~It's nice to put your butt in the face of the one-armed, because they can't react~, the word gay is used to exhaustion, so much so that all the characters are called with this appellation. The disabled level is particularly outrageous, culminating in a final boss represented by a giant formed from baby carriages. Admittedly, the game manages to elicit sneers and laughs from time to time, but such a wave of nonsense is hard for outsiders to the show to stomach, even if they don't represent the developer's target audience. Xbox 360 goals Also 1000 player points for Family Guy: Back to the Multiverse for a total of 48 achievements. Completing the campaign will guarantee you more than 200, for all the others you need to roll up your sleeves and satisfy the various conditions required. Oh shit! In terms of gameplay, Family Guy: Return to the Multiverse is an archaic production that would struggle to stand up without the scaffolding of the cartoon, just hinted at in the dynamics, and afflicted by a lack of balance. The aim in the various levels is always to reach a predetermined point, with minor variations such as having to activate certain switches or destroy key objectives, including relevant backtracking sections. The two protagonists can be changed at any time, as well as the equipped weapons, but for both solutions it is never clear how they work, also due to a confusing key mapping that forces you to proceed by trial and error. In this sector, however, the biggest problem is represented by the clumsy aiming system, which makes it difficult to aim at enemies and is certainly not helped by the impracticality of some weapons. The stimulus to continue is fueled mainly by the increasingly ridiculous situations that the game is able to set up, from the grotesque characters to the abundant quotationism (very eighties). The flaws do not end up burdening the experience too much thanks to a very lenient death system, which makes the character be reborn a few meters from death withoutinterrupting the action and not forcing you to repeat entire sections. On the other hand, the end-of-game boss significantly raises the difficulty bar, as a sort of afterthought by the programmers. In any case, the single player experience is shorter than average, leaving very little to replay value if we exclude the challenge mode, which offers scenarios to be faced with all the characters from the show, and a multiplayer mode completely devoid of online functions. The technical realization is average, with a rather poor engine but sufficient to replicate the simplicity of the cartoon, even if the micropauses that occur in conjunction with the loadings annoyingly break up the action. The title is spoken in English with menus and subtitles in Italian.", "date": "2012-11-30", "grade": "5.5"}