{"name": "Mario su WiiU! Serve altro?", "ref": "https://multiplayer.it/recensioni/111766-new-super-mario-bros-u-mario-su-wiiu-serve-altro.html", "text": "It was since the beginning of the 90s that a two-dimensional Mario did not accompany the launch of a Nintendo console: at the time the couple was made up of SNES and Super Mario World, and was preparing to take the platform to the heights reached, before and later, only from another handful of games. We'd like to say otherwise, but New Super Mario Bros U isn't among them; the occasion was propitious, because in recent years the 2D platform has regained dignity and importance, and who if not the plumber, together with the launch of a new console, could have given it back that luster, that leading role that still holds missed in the new century? We would have liked to, but it is not possible to write it. Instead, we can write that there is another fact to be given importance, namely that for the first time in history two unpublished Marios were published in the same year. Not only that: two unpublished Marios developed by the same team, EAD 4, which is certainly not the most celebrity-rich among the Nintendo ones. And it is also the fourth episode of the New Super Mario Bros series released over six years, a title which, despite being published on a console that is enormously more performing than the others, continues to use the same engine as the progenitor. Always Mario These are the not exactly encouraging premises, but we are forced to make another one: it is always about Mario, and if for many this may be bad news, on the other hand it is a statement that guarantees certain fixed points. First of all, the codes with which this title communicates with the player, i.e. the paths made of coins, the paths between plants and goombas, the pipes that lead to the sub-levels, are elements so well mastered by the developers as to represent a guarantee: a Mario internship , however uninspired, hardly expires in mediocrity. Talent cannot be disguised, and Nintendo are the masters of this genre. Another fixed point is the control system, which still represents the state of the art: in any two-dimensional Mario, let's talk about the main episodes, if a player makes a mistake it is his fault, not due to the lack of precision of the commands (it may seem granted, but in the vast majority of games this is not the case). This is no exception: jumps, triple jumps, slides and runs, the same interaction between character and environment is always the best that the genre can guarantee. You should all know the game, it is made up of linear scrolling levels that mainly cross from left to right, grouped into the canonical eight worlds (plus obvious surprises) each of which offers a different setting. The latest arrival takes up the most important novelty of Super Mario World, namely the unified map, in the sense that the various ~worlds~ are not separated from each other, but united by a single, long and branched path; predictably, however, everything has been simplified and softened, so as to fit effortlessly into the context of New Super Mario Bros. The roads are less complex and intertwined than in the illustrious predecessor, and the mono-map is more visually interesting than from the playful one: few hidden passages, scarce directions to take arbitrarily, equally rare the roads that unite two distant worlds. Jump'n'run This terminology has now fallen into disuse, but in the heyday of the genre, someone alternated the definition ~jump'n'run~ with the more widespread one of ~platform~. It is not a mere encyclopedic notion, and you will soon understand why. The level design of New Super Mario Bros U is academic: precise, clear and, as mentioned before, always guarantees good quality. However, the feeling is that these new two-dimensional Marios are created more by the nerd of the class than by the genius: precise, but almost never surprising. Beautiful, but never extraordinary. Interesting, not overwhelming. The most worrying doubt, however, is that the years of separation have caused Nintendo to lose its special bond with its favorite genre: the jump'n'run, in fact. As in Mario Kart the rally tracks, the imprecise ones, have gradually supplanted the flat circuit ones, in New Super Mario Bros the anomalous stages have taken over the main ones. Or at least they are now on the same level: the exception has become the rule. What are abnormal internships? All those who go beyond running and jumping, all those who put other characteristics in the foreground. And in New Super Mario Bros U it almost always happens, so much so that the pure platform levels can be counted on the fingers of one hand: to vary the experience, rather than acting (only) on the level design, it was decided to alter the address thematic of the internships. And here are the fortresses that go upwards, here is the enormous amount of tunnels from throughpour by leaping from wall to wall, here are the forced-scroll levels, here are the ones where you think more about collecting than advancing, (above all!) avoiding obstacles rather than jumping over ravines, looking for an exit rather than reach her. They are all interesting experiences, which in the old episodes represented a variation on the theme from time to time, but which have now supplanted the good old jump'n'run. And given the lack of games of this genre, it can only be a problem for fans. You can check this yourself: just turn on one of the Marios for NES and SNES next to New Super Mario Bros U. But also Donkey Kong Jungle Beat, developed by the ever-praised EAD Tokyo, or Donkey Kong Country Returns. Creativity The prevarication of anomalous stages over pure platform ones, and their consequent condemnation, is not so much a subjective factor as an exaltation of the mechanics: just like the 2D parts of Super Mario Galaxy are among the worst in the game, the controls and The engines of New Super Mario Bros are made to sublimate themselves in the sequences of running jumps, in the millimeter leaps, in the dosage of the rhythm, all things that in narrow, closed or vertically developed environments can almost never be implemented. The other big problem of New Super Mario Bros U is the too deeply rooted link with the past: Iwata said that this series will never be overturned because fans like it this way, and this is true, but apart from the fact that the statement goes against the trend with what we have reported so far, it's one thing to alter the mechanics (which shouldn't be touched) it's one thing to add new content. There are rare levels that could not be translated to older consoles, few that exploit the possibilities offered by the console. Moving and rotating platforms, objects that fall, move and adjust in real time: there are, but there aren't many, and they are never at the center of the experience. As well as the camera changes, or in general the focus on the alternation of dimensions, the ratio of size between Mario and the environment: things that could not have been done on the SNES, which can be done now and are great when they happen , but appearing too rarely. Just as stale are the worlds: grass, desert, snow, water, fire. Repetitive to say the least. As we have also written in the case of the episode for 3DS, the same Super Mario Bros 3 which introduced the ~worlds~ theme presented some less obvious ones, such as that of giants, pipes and clouds, which was half on the ground and half in the sky. In New Super Mario Bros U the only surprising thing is the jungle, which seems to have been created by other people due to its innovative drive: it fits together two themes (jungle and giants), proposes a variation in progress with a spectral theme (also visual) and in general it shows the way that Nintendo should go in this area. Because it's one thing not to alter the mechanics, it's one thing to always re-propose the same settings. Super Mario World, which also came after Super Mario Bros 3, had tackled the question with a very different class and originality. U! New Super Mario Bros U certainly does not show all the graphic potential of the new Nintendo console, since it is practically the predecessor brought to high resolution. Still pleasant to see, perhaps in some cases the difference between the elements inherited from the past and those created specifically for this episode is too markedly noticeable, such as the backgrounds, sometimes really valuable. More than the technical component, however, what annoys is the style, now unchanged since 2006: if you take the first four chapters of the saga, between NES and SNES, you will notice that they all offer something different. The New Super Mario Bros, on the other hand, are all the same in this too, and the music makes no difference: too recycled, too soft, the best ones are inherited from the (far) past. It goes without saying that the most interesting component of the game is still the multiplayer: the interaction between the characters is very accurate, and tackling the whole experience in this way enriches it enormously. From this point of view, the ~deus-ex~ function guaranteed by the U pad is not revolutionary, but still appreciable for the little ones and inexperienced ones who can enjoy helping others, or annoy them, by creating platforms simply by touching the screen. This feature should not be underestimated even for the most competitive players, who can appreciate its potential in the challenge mode, the real surprise of the game: in addition to this ~combined~ discipline there are others, among which the timed race stands out, perhaps the section that offers the best level design of the entire game, the one that offers the purest platform experience, as we said before more ~jump'n'run~. The fact that Nintendo still knows forging things of adamantine quality on the one hand is disturbing, because the whole game could be like this, on the one hand it leaves hope for the future. The hope that sooner or later Super Mario Bros 4 will arrive, and not another New Super Mario Bros... if you know what we mean.", "date": "2012-11-30", "grade": "8.5"}