{"name": "Planet of Lana", "ref": "https://multiplayer.it/recensioni/planet-of-lana-recensione.html", "text": "It's been six years since Adam Stjrnljus Photoshopped an image of a girl and an alien pet silhouetted against a lush natural landscape, intent on staring at a robot resembling the aesthetics of the spiders found in so many homes - black, large body, thin legs. The astonishing fact is that Planet of Lana has remained completely consistent with that initial concept, so strong and powerful that it has guided Stjrnljus towards the foundation of Wishfully Studios and the development of the adventure starring Lana and Mui. It is a lean video game , Planet of Lana, without obscure collectibles, optional locations to explore or weapons in quantity. Lana is a defenseless girl, but thanks to the collaboration with little Mui she manages to overcome every challenge present on Novo, a world kissed by a splendid sun on which abundant vegetation grows. There is no shortage of tributes to classic experiences in the cinematic adventure genre - Another World above all - but Planet of Lana manages to distinguish itself and stand out thanks to the incredible care lavished by the team in the design of every aspect of the game. We talk about it in depth in our review of Planet of Lana. An unexpected meeting Little Mui is central to the gameplay and plot of Planet of Lana, and is very reminiscent of some little creatures designed by Studio Ghibli Young Lana's journey begins in a bustling human settlement on the mysterious planet of Novo. The girl chases her older sister, Elo, and so we learn the rudiments of movement: running, jumping, crouching. Leaving the village built on the edge of the water, the two see mysterious spaceships falling from space: one of these kidnaps Elo and other human beings, and Lana, desperate, begins the pursuit of the robot that has captured her sister. the unfolding of the plot of Planet of Lana are far from original in the world of science fiction (videogames and otherwise), but the methods of the story keep the player's interest lively for the entire duration of the adventure, equal to approximately five hours. There is only one type of collectible, of particular interest for those who want to delve into the history of the origins of the planet of Novo; moreover, very soon the entrance of a particular character will take the story and the gameplay in unexpected directions. We are talking about Mui, a small animal similar to a black kitten who, initially imprisoned by robots and then freed by Lana, will prove to be an incomparable ally in chasing down the automatons who have kidnapped Elo, revealing the mysteries of the planet and surviving its pitfalls. Novo is a planet full of mystery, and Lana and Mui's exploration will take them through environments that speak to the player and tell the story of this alien world Traversing the wastes of Novo, with no descriptions of objects or long lines of dialogue, players are able to intuit many things about the planet, the purpose of robots and the role of humans. We greatly appreciated the final crescendo, exciting and capable of enhancing both protagonists of Planet of Lana, with their skills and peculiarities. The language of collaboration After being saved by Lana, Mui will stay by her side and help her in her mission to save her sister Elo: this feat is the backbone of all Planet of Lana The gameplay of Planet of Lana is based on the dialogue between Lana's human abilities - climbing, running, jumping, hiding - and Mui's animal ones. Their communication takes place through verbal orders from Lana; in this regard, the Wishfully developers have created an ad hoc, simple and intuitively understandable language. However, it is rather strange to see Mui get along perfectly on his own in the first bars following his release by Lana, to then become a sort of puppet who does nothing but follow the orders of the protagonist: the choice is understandable in view of providing a total control to the player, called to solve puzzles that require the accurate management of both Lana and Mui's movements, but it turns out, in practice, dissonant with the way in which the little animal, courageous and perfectly capable of getting away from only, it is presented in the initial stages. Beyond these considerations, Planet of Lana presents a very successful alternation of puzzles based on logic, time management, observation skills and movement in space. Only on a couple of occasions did we find ourselves stuck for a few minutes, but for the rest of the adventure we were amazed by Wishfully's ability to kindly provide clues to players, without ever taking them directly. It helps the choice to insert checkpoints at the beginning of oeach puzzle and in the intermediate stages of the most complex puzzles, in such a way as to remove any possible sense of frustration and encourage experimentation. Over the hours, Lana and Mui gain new skills, such as to allow different interactions with the environment and with the animals that inhabit planet Novo and to continuously renew an experience with a perfect duration, expertly proportioned in its various components. Each of the two protagonists has its weak point: Mui's is water. Lana will have to help him overcome water obstacles to continue Like any self-respecting cinematic adventure, Planet of Lana is an alternation of solids and voids, of excited gameplay sequences and walks capable of making us guess the past and the present of a verdant and stupendous world, in which the human being it feels more like a parenthesis than a constant presence, and with a War of the Worlds-like invasion as the backdrop for Lana and Mui's continuous gait. Under an alien sun Plains, caves, deserts, beaches: in its short duration, Planet of Lana lets the player explore a great variety of sublimely designed environments We said at the beginning that Planet of Lana has developed in a completely consistent way with respect to its initial idea, admirably condensed into an artwork that can still be used today to ~break down~ the distinctive elements of the adventure, both from a visual and of gameplay. The relationship between Lana and Mui is constantly at the center of the scene, even in the phases in which the two are forced to be separated; planet Novo is aesthetically unforgettable, halfway between the essential beauty of Another World and the exuberance of a Studio Ghibli film. The elements of the various levels of the scenario are never intrusive for the visibility of what is happening on the screen, and indeed help to focus attention on the components useful for solving puzzles and understanding the events of the story, never illustrated in words, but always entrusted to what setting and interaction with the inhabitants (and invaders) of the planet are able to express in a non-verbal way. This does not mean that words are not important, on the contrary. The maniacal study made by the Lead Sound Designer Francesco Ameglio and the audio team is palpable, capable of giving centrality to the communication between Lana and Mui in any situation: if a robot is nearby, the girl's commands will be a simple whisper, broken by sobs in some moments of particular excitement; if, on the other hand, there are no dangers in sight, Lana's voice will be ringing, and Mui's sweet verses will resound without fear in the spaces crossed by the two. Whether they are plains, caves or more markedly man-made environments, the scenarios outlined by Wishfully are always capable of astonishing for their beauty and coherence in the artistic direction, also thanks to the accompaniment provided by the magnificent music by Takeshi Furukawa (already composer of the soundtrack of The Last Guardian). Planet of Lana is a masterpiece from the point of view of visual and sound design, and always manages to stand out for its chromatic and directing care This picture of excellence is completed by a technical sector practically devoid of hiccups or imperfections, with an enviable cleanliness in the rendering of the movements of the characters and their interactions with the elements present in the environment. There is a translation into Italian, naturally limited to the command prompt only (since there is no translation of the very few dialogues present). We point out the absence, at the moment, of accessibility options and reconfiguration of the controls: the developers have communicated that everything will be added at a later time.", "date": "2023-05-22", "grade": "8.5"}