{"name": "Norco", "ref": "https://multiplayer.it/recensioni/norco-recensione.html", "text": "Video games can often have a much more complex background than it might appear at first glance. Take Norco for example, a title that owes its name to the city in which it is set: before even playing it, we did a quick web search to find out if the place really existed or if it was just the fruit of the authors' imagination. We found that not only Norco is a real place in Louisiana, but also that its history has a lot to do with that told by the game, between a past made up of immense sugar cane plantations, where hundreds of slaves and two dramatic news events, linked to the refinery set up in 1916 by a subsidiary of the multinational Shell. Precisely the latter, the first, which occurred in 1973, the death of a boy and an elderly lady, incinerated by an explosion caused by a leak in one of the plant's pipes; the second an explosion that killed seven Shell employees in 1988, seem to have almost been paraphrased by the game's writers, who reworked reality in a very personal way, without ever losing sight of it within the story. After all, the head writer and other members of the development team grew up in those places, which explains many things in terms of building the settings and game situations. The discovery was inevitably reflected in Norco's review, because it made us take a completely different perspective towards the whole experience. Deep America Norco is full of eccentric characters Norco is a first-person point-and-click adventure with pixel art graphics, in which you collect and use objects (not very many actually), delve into the scenarios for clues and talk to the various non-player characters looking for traces of Blake, the brother of Kay, the protagonist, who disappeared under mysterious circumstances. Kay has just returned to Norco from a five-year road trip that took her across the United States aimlessly and didn't allow her to be present when her mother, Catherine, died. The prologue tells us precisely this detachment and the inevitable return, with a truly remarkable lyricism both textual and graphic, which immediately makes us understand how the authors want to fly high. The real adventure begins in Kay's room, where it is possible to examine objects and elements of the setting, as well as begin to develop one of the key elements of the gameplay: the psychic map, in which the relationships between the characters and their role in the story, starting with the girl's family. The player of his own must not only read the memories, but also direct them in some way, making choices about what composes them. The possibility of choosing is also very often given in the dialogues, thus making the player more active in carrying out some events. Actually the first steps don't say much about what we have to do. The protagonist does not yet know of the disappearance of her brother and behind the death of her mother there is nothing mysterious, since she was taken away by cancer. But it is precisely here that Norco begins to reveal his being imbued with that magical realism that ends up captivating throughout the adventure, albeit stretched with science fiction elements. The pixel art is great We soon realize that we are in the most typical of provincial American cities, with places that inevitably recall some of those seen on Kentucky Route Zero, albeit with the obvious differences in vision, even if they are merely aesthetic. Norco is a twilight city where the pond, the pub, the gas station and all the other places that make it up are dominated by the profile of the refinery. At the same time, in these places, typical of American culture, you meet over the top characters, including an android friend of Kay's family, above all the woman's first travel companion (there will be several, with even some changes of protagonist) , which give life to really well written dialogues, ranging from the crazy, to the surreal, passing through the philosophical. Some decline Kay will have several traveling companions Norco's problems almost all begin with the second part of the adventure, where inexplicably much of what was built with the first is a bit watered down, between characters who get lost along the way and the introduction of narrative elements that trivialize some situations, making them lose some of their drama. The writing of the dialogues is always excellent, including the use of a different dialect for each character, but it is a bit the desire to necessarily go in a certain direction that limits the overall impact of the story. The reThe result is that on the one hand we arrive at the final sequence enraptured by the visionary nature of the whole, often evoked by a writing capable of alternating several registers and of passing from an almost depressing realism to a sublime oneirism, but on the other we feel that some choices have finished a bit to limit the overall impact. The puzzles are really simple Puzzles also contribute to this sense of incompleteness, so simple that often you don't even realize they are there. The same goes for some mini-games, which seem to have the aim of reinforcing the author's vision, but end up being the weakest part of the entire production, because they are poorly made. Let's think, for example, of the fisticuffs (talking about the combat system seems excessive to us), which we do not hesitate to define as harmful to the general atmosphere. A final note deserves the lack of an Italian translation. We simply limit ourselves to not recommending Norco to anyone who doesn't know English well, because some dialogues can be really complex to understand, also considering that they often deliberately don't have an easily graspable sense.", "date": "2022-03-30", "grade": "8.0"}