{"name": "Scazzottate preistoriche", "ref": "https://multiplayer.it/recensioni/110836-punch-quest-scazzottate-preistoriche.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to shell out even a cent. In the first instant of the first game of Punch Quest, the excellent Jetpack Joyride cannot fail to come to mind, released last year and today considered one of the best exponents of the running game genre. A clearly inflated genre, mind you, but which despite everything still manages not to get moldy, occasionally proposing original ideas or very amusing mechanics. As the game's protagonist breaks through the castle doors and begins his endless run through enemies, traps and power-ups, the comparison is inevitable, but while it doesn't have the same presentation or immediacy as Joyride, the new title by Rocketcat Games reveals gameplay of unexpected depth, match after match. Punch for punch The first and obvious difference between Punch Quest and many other running games, including the aforementioned Jetpack Joyride, lies in a very subtle concept: instead of simply dodging obstacles and enemies with slides or jumps, the protagonist of the game must make his way by punching everything in front of you, with two keys associated respectively with a frontal blow and a jumping one. What may seem like a ploy to mask an almost moldy mechanic instead has enormous repercussions in the rules of the game, giving it an absolutely unexpected depth. It takes the user a while to realize this, especially since the first few games are spent throwing hits at random and taking a huge amount of attacks, but the more you lose, the more you play and the more you assimilate new strategies and new ways of approaching a particular enemy. When you finally realize that surviving as long as possible isn't the only goal to follow, things finally get interesting: to bring your multiplier to the stars it's not enough just to stand, but it's essential not to interrupt a chain of shots to enemies and objects in front of you. The result is a flow of well-timed punches, creating remarkable combos and creating chain effects capable of knocking down a group of opponents like a pile of pins; a typical example would be hitting a bat in mid-air, crashing it into a skeleton, and using the newly detached skull as a projectile against incoming creatures. By collecting coins during the ride and following the same ~three objectives~ formula of Jetpack Joyride, Punch Quest then allows you to obtain credits to spend to unlock not only costumes and gadgets for your avatar, but also and above all a long series of skills and techniques, some of which are permanent, others can be equipped, both active and passive. The strategy adopted also changes according to the perks that are unlocked, with the possibility of stopping attacks, slowing down the descent or deflecting incoming blows. A parenthesis should be opened here regarding the free-to-play model adopted by the developers, since, although it is possible to obtain extra credits through in-app purchases, the game economy is never too severe towards those who are reluctant to open their wallets. and indeed in principle it is always possible to unlock something after every good game. From sprites that launch magical spheres, bats that dive and zombie explosives, each of the numerous enemies requires a different approach, and reflexes and concentration become two essential factors as the pace of the game and the amount of monsters on the screen increases. Also thanks to a simple but very precise control system, Rocketcat's running game manages to take away a lot of satisfaction, while the variety of experience is also ensured by a series of temporary power-ups and crossroads along the way. The latter, in particular, allow access to special areas that hide fights with bosses, upgrades or even bonus areas on the saddle of laser-spitting dinosaurs, where another minigame transforms the protagonist into a gnome who, by jumping and rolling, must make his way among hordes of wasps. Where Punch Quest fails to shine is in its somewhat spartan presentation; not ugly, don't get it wrong, but which clearly disfigures when compared to the liveliness and care of the Halfbrick Studios title. Added to this is the repetitive structure typical of running games, which despite this time trying to always keep fresh through a large amount of unlockable extras, brings the inevitableprompts the player to always repeat the same routine in pursuit of the highest score and as many coins as possible.", "date": "2012-11-10", "grade": "9.0"}