{"name": "La leggenda dei Super Saiyan", "ref": "https://multiplayer.it/recensioni/110747-dragon-ball-z-budokai-hd-collection-la-leggenda-dei-super-saiyan.html", "text": "Ten years later and with the franchise still churning out new titles (even if the recent Dragon Ball Z for Kinect proved to be a mediocre product), Namco Bandai has decided to create a collection by putting together the first and third episode of one of the most successful tie-ins for the series created by Akira Toriyama: Dragon Ball Z Budokai. Where with the subsequent Budokai Tenkaichi we tried to explore the potential of a three-dimensional action context, Budokai stands as a traditional fighting game, which in some ways tries to take stock of the situation after years of experimentation, even started at the time of Super Nintendo, or as soon as the hardware of home consoles allowed developers to make a beat'em-up using the various Goku, Vegeta, Piccolo and so on. When Dragon Ball Z Budokai was released on PlayStation 2, way back in 2002, there was really a lot of enthusiasm around the project and fans of the manga were immediately won over by the new approach, with fights and sequences much faster than the slowness they had been at previously accustomed. While the experimentation card was played once again for the sequel, the third episode, Dragon Ball Z Budokai 3, did nothing but confirm the good things done by the series, enhancing each sector and inserting truly spectacular sequences, such as those related to special moves, capable of literally devastating an entire planet. All together passionately Dragon Ball Z Budokai HD Collection therefore contains two games on a single disc, and it is possible to start one or the other at will, managing them as separate entities. The impact with the first Budokai, we say it right away, wasn't the best: beyond the cutscenes displayed in 4:3 with two ~curtains~ on the sides of the screen, the game has aged very badly both from a technical and from the gameplay point of view, and obviously the high resolution is not enough to make the product current. In fact, we have rather angular characters with barely discreet animations, who move within completely empty scenarios, a factor already highlighted at the time of the original review. Three modes are available: story mode, versus mode and the traditional Tenkaichi Tournament. The latter represents a nice extra and allows us to freely use all the characters on the roster in the context of clashes that can even end in an instant, if one of the two contenders is thrown out of the ~ring~ with a powerful enough attack. The story mode is clearly the fulcrum of the experience and starts from the advent of the Saiyans on Earth, with the arrival of Raditz, up to the Cell saga. The management of this mode is classic, i.e. you change character to depending on how events unfolded, mostly playing the role of Goku but also controlling excellent supporting actors on many occasions such as Gohan, Vegeta, Trunks, etc. On the actual gameplay front, the difficulty in connecting the current controllers with the key combinations required by the game are evident. We are in fact talking about a period in which fighting games were always played with the d-pad, and as we well know the directional cross is perhaps the only weak point of the Xbox 360 controller. Being able to choose, therefore, the superiority of the version is clear PS3 from the collection, also because performing special moves with the analog sticks is practically impossible. Xbox 360 goals There are forty-three Achievements that can be unlocked in Dragon Ball Z Budokai HD Collection, for a total of 1000 Gamerpoints. Most of them are obtained simply by completing the various chapters of the story modes, completing the Tenkaichi Tournament at various degrees of difficulty and obtaining the hidden scenarios. Then there are several secret objectives related to unlocking the characters. There's no two without three Dragon Ball Z Budokai 3 is probably the high point Dimps has reached with the series, and while it can't compete with the current offering in terms of HD console fighting games, it boasts a much better cosmetic, richer elements on the screen, with greater attention to detail and higher quality design than the first episode. The experience turns out to be richer also from a content point of view, thanks to the presence of the ~Universe of the Dragon~ mode, which retraces the DBZ plot here too from the advent of the Saiyans but reaching up to the GT series. In short, many more events, but above all an approach that allows us to choose any character and play the moments that have seen him involved in the story, moreover with the introduction of elementsworks and objects that at a certain point become vital in order to proceed and successfully face our opponents, such as skill enhancement capsules. Therefore, both the roster and the moves available increase, which also means multiple transformations for Goku, Vegeta and the other Saiyans, essential to bring home the result during the more advanced stages. The execution system of the special maneuvers does not change, which are activated by hitting certain combinations of punches, kicks, the direction of the d-pad and the button for the emission of spiritual energy. On the technical implementation front, the ~remastering~ work carried out by Namco Bandai unfortunately seems to us just enough. In fact, simply increasing the resolution does not mean actually making a ten-year-old product current, which, moreover, already on the previous generation consoles did not represent something extraordinary in terms of graphics. If we add to this the very sad cutscenes in 4:3, it goes without saying that a little more effort could have been made, above all to justify the selling price.", "date": "2012-11-08", "grade": "5.5"}