{"name": "Farming Simulator 2013", "ref": "https://multiplayer.it/recensioni/110779-farming-simulator-2013-che-ne-sai-tu-di-un-campo-di-grano.html", "text": "All right editorial staff, now we have land. It's time to get serious work. There's some weed on it and it's been years since a soul has touched it. What do we do with it? Shall we play soccer? (and here Tanzen made the hola) Where to start... We can use Rubbini as a plough. No, too short (yes, even in the magical world of agriculture attributes count). We need a better and more durable solution (much more durable, as women always say before giving up). Let's squeeze our brains. All right, let's tie plows to some video game players and put some naked women across the field. The power of love (let's call it that, come on) will do the rest. How do we not have naked women in the newsroom? Are there really no women? Nothing? Not even a hardcover? Idea: put the Pugliese in a guepiere behind a semi-transparent cloth, maybe they'll fall for it. Better in latex? Do we really want to kill our beloved readers so brutally? And now that we have plowed? Let's sow... No, oh well, you can't do it with sowing. Let us raise our hands and recline in the flames of the god Baal. Of course he too has a name that he can pull a couple of jokes out of you. On the contrary, let's organize a big competition: help the poor disoriented editor find a joke with the verb to sow that is not prohibited for children under 18. We know, it's difficult even for an expert in country life. The nature factor There is no doubt that a title like Farming Simulator 2013 can leave many people dumbfounded. We can already imagine the most common question: what will be fun in such a title? Let's not make the mistake of underestimating him. It must have some appeal if new editions are produced every year and if sales regularly exceed 500,000 copies. The game concept is very simple to explain: you have to manage a farm in all its aspects. Don't expect to find yourself in front of just any FarmVille, because here we are talking about a pure, decidedly complex simulation. And here comes the first problem. The 2013 edition seems designed for those who already know the mechanics of the previous ones properly, because the numerous integrated tutorials don't explain much about the economic dynamics of the game. Most of them are just for practicing with the different agricultural vehicles. Unfortunately this makes it difficult for newbies to get into the game, especially for those who are not convinced. All right, after all we're talking about agriculture... we had to take into account having to work a bit. Once in the game, the first field to plow and sow awaits us. The company has every type of agricultural machine necessary for the work, but by accumulating money by selling agricultural products, it is possible to buy better ones and expand the available space. However, at the beginning you will have only one field to tend with love... Pure simulation When we talk about caring for a field with love, we really mean that it must be plowed and sown directly. No, a few clicks on boxes are not enough to do everything. You have to take a tractor, attach the right work tool to it each time and then start traveling the field back and forth while also moving the selected tool. You can't even run too much, on pain of detaching the instrument. When carrying out these operations, various factors must be taken into account, many of which will only be learned by working. For example, seeds are expensive and don't go to waste, just like petrol. So it can be deduced that the best farmer is the one who manages to work the fields with the least number of steps. Waste is paid for with slower growth or with bankruptcy (it almost seems like an allegory of Italy). Some of the steps to take to get to the harvest can be delegated, but others, such as giving fertilizer, are operations that must be performed manually. It is here that the player is called to decide: if all the operations described have not aroused the slightest interest in you, forget Farming Simulator 2013. Obviously it is not the game for you and in reality it does not even want to be. It's just slow, very slow. But getting to the first harvest and getting paid for your efforts is satisfying. Just as it gives satisfaction to improve the fields or increase one's possessions. It is at this moment that you understand the true charm of the game, which is then that of the most accurate simulations: making an effort produces results and the improvements you perceive in your performance are real. After all, it's the same difference between a car simulation like Assetto Corsa (for example) and an arcade like Gran Turismo 5 (for example): in different playful forms both offera videogame representation of the racing world, but the simulation requires a skill and dedication that the arcade game cannot afford, and which cannot even hide behind thousands of cars or dozens of circuits. Money and defects As already mentioned, once you have accumulated enough money, you can move on to buying new tools. Many are already included in the game, others can be downloaded from the game's official website, which is extremely vital. Unfortunately for the enthusiasts we have discovered some defects and now we will explain why. We confess that we are newbies to the genre, which is why we did some research on previous editions of Farming Simulator. Well, as is quite normal, the 2013 edition has very few differences compared to the 2012 one, but also compared to the 2011 edition. This is true both from the point of view of the contents and from the purely technical one. In short, the game is always the same, with graphics that reproduce the vehicle models well, but do little for the rest. Sure, when you have to bring out a new chapter in a series every year, you don't have much room for revolutions, even triple A titles know it well, but this should never be a justification, especially for a title like this which, as revealed , sells very well. It is also true that making graphic improvements that are too marked could alienate part of the gamers, who probably aren't the type who go after all the technological innovations. In short, even in these areas the choice made by the developers is to aim for a very precise and defined user, who probably buys the new edition of Farming Simulator every year without getting into too many problems. Country life can make you very wise.", "date": "2012-11-07", "grade": "7.0"}