{"name": "Crusader Kings 3: Console Edition", "ref": "https://multiplayer.it/recensioni/crusader-kings-3-recensione-ps5-xbox-series-xs.html", "text": "The review of Crusader Kings 3: Console Edition cannot ignore the excellent and still current one written by Simone Tagliaferri on the occasion of the game's debut on PC. This is the Crusader Kings 3 you've probably heard of, uncut, no difference, except for a completely reimagined interface. No regrets Crusader Kings 3 Console Edition: In the game you can impersonate thousands of nobles, including dukes, counts and kings of both genders Crusader Kings 3 is a game made up almost entirely of menus and windows, often open simultaneously, and in such circumstances nothing is more responsive than a mouse cursor. It is therefore surprising that Paradox, together with the team that dealt with this conversion, decided to discard the classic control system a priori to invent one from scratch. On Xbox Series X|S as on PlayStation 5, Crusader Kings 3 is playable only and exclusively through the gamepad. Luckily for us, not only are we talking about a game that can be played with all the calm in the world, unlike an RTS this is also playable when paused, but the work done to make the complexity of Crusader Kings compatible with accessibility of the consoles is of the highest quality. The paradise of shortcuts Crusader Kings 3 Console Edition: once adults, we will have to choose one of the five lifestyles offered, which are in turn divided into three trees Crusader Kings 3 is not the first Paradox game to arrive on consoles, the wonderful Stellaris, for example, has been adapted quite well to the use of the pad, but on this occasion a more radical approach has been chosen. The new interface is based on brand new shortcuts and new graphic elements, such as the function wheel which can be displayed in full screen or only in part, allowing you to jump between the countless game options in a precise and fast way. Users already accustomed to the PC version will inevitably feel awkward, how could it be otherwise? But it's just a matter of muscle memory, of habit: in the majority of cases this new version of Crusader Kings 3 can be controlled without any problems, in others it is even clearer than its counterpart for Personal Computers which still brings home the victory by allowing free of some windows. In the console version the windows are fixed, but can be recalled at any time, and more than one at the same time, using the triggers of the respective pads. Furthermore, the aforementioned function wheel allows you to call up other very important options of the game and practically instantly, thus skipping several steps that would actually appear superfluous with a pad. Would it have been nice to have a mouse and keyboard compatible version on console as well? Without a doubt, but given the commitment and the result, we don't feel like complaining too much. A unique experience Crusader Kings 3 Console Edition: the radial menu is one of the new features of the console version Crusader Kings 3 is therefore perfectly playable even on consoles, this is ascertained. But why should you do it? For those who love quick and concise answers, let's say that Paradox is simply one of the most amazing games of... all time? It is true that Crusader Kings 2 after years of patches and expansions is a game superior in content to this third and youngest chapter, but Crusader Kings 3 is built to fly much higher than its predecessor. Above all, it is much clearer, more playful, colourful, more compelling and more modern. Crusader Kings 3: Console Edition is the first in the series that can conquer even unsuspecting Sunday gamers, or even you who live by feeding only on action games. That's how amazing this is, let's call it strategic? After all it is, it requires short, medium and long term strategy. Crusader Kings III: Console Edition also has tactical veins and damn it, it falls fully into the field of RPGs. The idea behind the project leads us to the more understandable definition of dynasties simulator. You start by choosing a noble, and you follow and influence him to the end of his days, managing his lands and trying to make his house proliferate, both economically and in prestige. What is immediately striking is that such a wide-ranging game works through such meticulous details, which in any case has its accuracy given that at the time, history was made by families if not by individuals, and not yet by nations. An RPG? Also! Crusader Kings 3 Console Edition: with a little effort you can re-found your initial religion or even create a new one. The biggest problems will come later It's never so easy to choose wives and husbandsthe strong, intelligent and healthy, to consolidate the lineage. Desperate military alliances can push marriages of convenience, bringing into the family traits that could adversely affect the health of our heirs for centuries. However, the more cunning could marry, exploit the alliance, and then kill the weak wife before she can give birth to a child; others would advise imprisoning the bride and, with the help of some torture, having some unmentionable secret of the powerful father revealed. But beware, karma is also an ugly beast in Crusader Kings 3, where a hastily chosen court doctor could even lead to our nobleman's emasculation. This can also happen in Crusader Kings 3: Console Edition, where the web of knowledge, alliances, friendships and family members, as well as the credibility of their actions and their human characteristics, creates ideal terrain for that little computer miracle called emergent narrative, real star of the game. And all this happens through icons and menus of which even after hundreds of hours you still haven't seen every item, because not all characters have access to all options, and not all personalities will be compatible with the most extreme and significant actions. Everything is possible Crusader Kings 3 Console Edition: the family tree will help you trace the entire history of your family Around the year one thousand the world was experiencing a geopolitically fluid era, its borders were in constant flux and the death of a single ruler could still cause imbalances capable of involving and upsetting an entire continent. Everywhere there is a struggle for hundreds of different, regional cultures and religions, chasing sacred writings and promised lands. Years in which the offspring is often a bargaining chip, expendable for military alliances, religious favours. Human sacrifice and cannibalism are still practiced in the north of the Jarls, in the hot Arab south and in some remote county in the heart of Europe. And all this plus hundreds of other aspects, you will also find it in Crusader Kings 3. On an economic level, the game is not so thorough, not even the war part is so complex, this is because the center of everything will always be our character. If you want you can choose any one, from the king of France to the most insignificant count of Apulia, sandwiched between the Kingdom of Italy, the Byzantine Empire and under the ever more menacing shadow of the Berbers. We are talking about thousands of nobles to choose from, each with its own characteristics, each as historically accurate as possible (accuracy tends to decrease moving away from Europe), each with a digital DNA that will develop from generation to generation, crossing each other, erasing and enhancing genetic and hereditary traits of all kinds, from gigantism to schizophrenia. Or, alternatively, we will be able to create a personalized character, with which to start your own dynasty. Just deep Crusader Kings 3 Console Edition: building and maintaining armies will be a constant in the game, but the battles will be won above all by the great generals. Make sure you have enough and able ones Among the many characteristics of a Crusader Kings character there are some that determine his natural nature; if we don't respect the nature of our alter-ego, this will start to accumulate stress. Exposing yourself for a loved one or imposing your own tactics during a war meeting can be a source of happiness for a brave nobleman, a source of stress for a shy character. We could also educate a child in the arts of subterfuge, make him a feared king, but if this is not cynical enough, how can he kill a rival, deceive an ally or educate a hundred torturing one? Stress can be soothed through different options that will change based on civilization, religion, historical period. Some characters will be able to rely on reading, others on prayer, in general almost everyone will be able to organize banquets and hunting trips. But this will not always be possible, and if stress exceeds the guard levels our nobleman will risk becoming a prisoner, thus damaging diplomatic relations, or even worse an alcoholic; there are those who, on the other hand, will prefer the dear old hair shirt or even more deviant and dangerous practices. In near real time Crusader Kings 3 Console Edition: everyone would like a board made up of the best in each field, but sometimes this will not be possible, unless you pay the consequences Crusader Kings 3 further departs from other seemingly similar games by adopting a continuous progression of time, instead of the more classic turns. It is possible to pause to operate in peace, the minimum speeda instead forwards the events by one day every two seconds. The game is also made up of events, some random and others resulting from our choices and those of the AI. Naturally these will tend to repeat themselves over time, but being born mainly from simulation and therefore being perfectly cohesive with the context, they are not contents that are consumed but much more interesting common pieces of every life. It should also be considered that these events never present right or wrong choices, they do not become trivial the second time around because you already know what to click, the options proposed instead are like rolls of dice influenced by the skills, knowledge and experience of our character . What each choice could entail is always specified in the description. Legendary stories Crusader Kings 3 Console Edition: here are the controls of the PlayStation 5 version. The game also supports the DualSense function, making the triggers harder as it increases the stress of our character Crusader Kings 3: Console Edition isn't here to betray you, it doesn't want to make you lose because as we have already said the game over in this game is a fleeting concept, totally unrelated to death. Of the matches that in other games we would have declared lost, here is the opportunity to continue to rewrite human history also in its drama. Experiencing the fall of a once-bright and beloved king can be as thrilling as experiencing his rise. Examples of what can be done in Crusader Kings could be done endlessly, and often the game has become famous precisely for the incredible stories it is able to generate, as well as for the more extreme possibilities it can grant players . Feed on the Pope? Done. Create a new religion devoted to naturism? You just have to try. To do great things, you need great people. Who will educate your offspring? According to what values will you make it grow? Will you indulge their personality or will you impose on them an already established life path? What you invest in your children is what you will be when the noble you command draws his last breath. Moment that leads to one of the most delicate phases of Crusader Kings 3: Console Edition as well as one of the most difficult aspects to understand: managing its succession, preventing the kingdom from being partitioned too much. One duke leads to another Crusader Kings 3 Console Edition: the game allows you to start between two different dates, from 867 and 1066 after Christ, choosing between the historical characters proposed or freely from the map There are several things to think about, consequently Crusader Kings 3 needs a long learning period. Even after a hundred and more hours it is not said that you have seen and understood everything, I personally have not succeeded. Luckily, Crusader Kings III: Console Edition is also the Paradox-developed game with the best tutorial, though while it's pretty good at showing you how to do things, it doesn't do anything to figure out why you should do them. Because the most difficult thing about this masterpiece is precisely to enter the logic of its atypical structure, capable of accommodating the most diverse styles of play. There are many, for example, who play the series as if it were a sort of The Sims, and it is no coincidence that Maxis is another great generator of dynamic stories. Well, basically this is exactly the reason why Crusader Kings is so extraordinary, you can use it however you want and he will always and only tell you in return great stories, so deep, detailed and credible that they seem to come from a real history book. We used Xbox Series X for testing, but while we couldn't test DualSense support, we at least enjoyed Microsoft's quick resume which makes a huge difference in games like this. It's a pity that there isn't Italian yet and that this latest version doesn't start immediately with the same contents as the PC one, for which the Royal Court DLC is already available and console users will have to wait a few months. However, the will of the developers is to bring the two versions into parity as soon as possible, in order to subsequently make them grow in parallel.", "date": "2022-03-29", "grade": "9.3"}