{"name": "Il profumo del Most selvatico", "ref": "https://multiplayer.it/recensioni/110723-need-for-speed-most-wanted-il-profumo-del-most-selvatico.html", "text": "2010's Hot Pursuit represented Criterion's debut with the Need for Speed franchise, marking the beginning of what appeared on paper to be a stellar partnership: in practice, the result was an undoubtedly excellent racing game , which however was not the disruptive product that would have been legitimate to expect from the symbiosis between the creators of Burnout and the substantial budget guaranteed by a giant like EA. So let's see if this Need for Speed: Most Wanted has what it takes to make the proverbial leap in quality. Storyline is for losers Criterion has never cared much about providing a real narrative background to its racing games, and this Need for Speed: Most Wanted is no exception: unlike the original developed by Black Box in 2005, there is no story and there they are protagonists with first and last names, but only the streets of the fictitious city of Fairhaven on which to whiz in an attempt to beat the ten most wanted drivers by the police referred to in the title of the game. Having said that, the product does not deny itself the pleasure of a short but stylish introduction created with the excellent Chameleon graphics engine, which on the evocative notes of Butterflies and Hurricanes by Muse scrolls on the screen rapid frames relating to the races that will be faced in the single player, all while a female voice provides information on the most basic rules of play structure. The ball therefore passes into the hands of the user, who without a break in continuity immediately finds himself at the controls of a flaming Porsche launched on the motorway, the first opportunity to test the driving model of the Criterion title. The choice of the English developer was not to stir things up too much, basically proposing a response from the cars very similar to that of the previous Hot Pursuit: accelerator, brake, turbo and handbrake are the only inputs needed to drive in Need for Speed: Most Wanted, with drifts easily executed with a flick of the left dorsal trigger before entering a turn. Nor do the rules that underlie the increase in the turbo bar change, which fills up in relation to the user's recklessness in running against traffic, skidding the tires, skimming collisions and so on. Although it is nothing new, the charm of this driving model has remained substantially unchanged, and if on the one hand we can only commend the immediacy of the controls and the pure enjoyment of such an arcade setting, d' on the other hand, in certain situations you can feel the lack of pinpoint steering precision and extreme reactivity typical of the latest Burnouts. On the other hand, it is difficult to find something to regret as regards the graphic packaging of the product, to all intents and purposes a real jewel for the racing game genre. The city of Fairhaven is so beautiful and full of postcard views that it almost regrets having to face the streets at the excessive speed imposed by the style of play: Criterion's work on scenario planning can be seen and heard, with typically urban settings that in the lap of a few seconds, they give way to mountain roads rather than industrial areas marked by dirt tracks, with effects that are immediately perceptible in the behavior of the car on the various surfaces. Nothing in the technical sector of Need for Speed Most Wanted seems to be left to chance: the reproduction of the cars is faithful down to the smallest trimming, the cutscenes that introduce the various races enjoy a highly sought-after style, the powerful roar of the engines goes hand in hand with a really spot on tracklist and the frame rate doesn't give a step even when the light effects are wasted, and we guarantee you that it happens often. However, it's too early to start playing fanfares... Wishlist A city like Fairhaven, where you can find a supercar at your disposal on every street corner, can only exist in dreams or video games: sports car enthusiasts will therefore find what they are looking for, being able to get behind the wheel of racing cars like the Dodge SRT Viper GTS, the Maserati GranTurismo MC Stradale, the Porsche Panamera Turbo S, the Nissan GT-R and more. There are also ~impossible~ cars such as the Alfa Romeo 4C Concept, the Koenigsegg Agera R or the Pagani Huayra, and there is even room for amarcord with historic models such as the Lamborghini Countach 5000 QV or the unforgettable Lancia Delta HF Integrale Evolution 2. Fortune favors the bold? If from a technical point of view Need for Speed Most Wanted marks a clear step forward compared to Hot Pursuit, for whatconcerns the structure of the single player component, the title is divided between lights and shadows due to the ambiguity of some of the new features introduced by Criterion. Let's start from the fundamental node concerning the procurement of cars: instead of unlocking new and more powerful cars with the points obtained from winnings, here the new vehicles are obtained simply by exploring Fairhaven, given that most of the 41 models are more or less hidden inside. within the game scenario. Once you have identified a car likely to be added to your collection (they can be recognized thanks to the obvious manufacturer's logo floating above them), you just need to approach it and press a button to get it and get behind the wheel, despite the sense of progression of conventional racing game: if in fact this aspect can be a stimulus to beat inch by inch the streets of the city, on the other hand it is undeniable how the lack of a more conventional system of rewards is felt. The only exceptions to the rule are the ten most wanted cars, given that to obtain them you must first reach a certain amount of points (called Speed Points) and then beat them in dedicated events. Also in this case the sensations are mixed, because Need for Speed: Most Wanted brings with it almost en bloc the strengths and weaknesses found in the Hot Pursuit challenges: therefore, these are undoubtedly frenetic and adrenaline-pumping races, which however seem to depend more on luck than by the skill of the user. You can ride flawlessly all the way and maybe even throw your opponent off the road a couple of times, but one mistake at the end is enough to throw everything away, considering how the drivers guided by the CPU miraculously tend to always make up the ground lost in seconds. Even the cops who act as antagonists in the numerous chases seem to play dirty, and escaping a patrol can for this reason become more of a nuisance than a reason for challenge. Another choice by Criterion destined to split users in two is the one concerning the competition system and the consequent power-ups: every car found around Fairhaven is connected to five different competitions of increasing difficulty, once the which you are forced to abandon the vehicle in favor of another to accumulate more Speed Points. Unfortunately, the events related to each car never differ too much from each other, and switching from one steering wheel to another so often, repeating such similar processes sharpens the nostalgia for a more classic progression mechanism. The same goes for the upgrades to be unlocked, given following a placement in the first two positions in each of the five races combined with a car: not only are these changes that slightly affect the vehicle's statistics without altering its aesthetics, but the their variety is very limited and the sequence in which they are given away is always the same. In short, in the single player of Need for Speed: Most Wanted one is pervaded by the sensation of carrying out many small micro-cycles rather than a wide-ranging campaign, an aspect that could make purists of the genre turn up their noses but which on the other hand will make happy anyone who prefers to have immediate access to a greater amount of content. Playstation 3 trophies Perhaps realizing the lack of a real sense of progression in the single player, Criterion has abounded in trophies related to this mode, which grabs the vast majority of the 47 total, of which 35 bronze, 9 silver, 2 gold and one platinum. These are mostly rewards that can be obtained by progressing normally in the campaign, with some exceptions relating to objectives to be met in some very specific races, plus the usual goodies for 100% fanatics such as finding all the Fairhaven billboards or driving every single car. Fairhaven's social side Playing Need for Speed: Most Wanted, the innovative intention of Criterion is evidently perceived, which perhaps ran into too many naiveties in the single player, but which in any case must be acknowledged for having tried to break new ground in a genre often static like that of racing games. Two points on which the English developer has fully hit the target are those relating to the slimness of the menus and the strong social components that accompany each play session. In the first case, the introduction of the Easy Drive system proved to be excellent, an elegant name to identify a menu accessible in real time via the directional cross that allows you to fulfill every need without practically ever having to stop: change cars, modifyicate power-ups, set a destination or launching a race already discovered on the game map are just some of the accessible features for a system that proves to be the perfect partner for setting up the free roaming of the EA product. The Autolog introduced for the first time in Hot Pursuit returns in a revised, corrected and enhanced version, i.e. a social superstructure that takes into account all the progress made by the user and instantly compares it with that of one's friends. In this area, Criterion has certainly leveled up, blending these mechanisms even more harmoniously with the normal playful routine: for example, just whiz past a speed camera to immediately see on the screen if the recorded speed is lower or higher than that of other users, or even the player who manages to make the longest jump after breaking through a billboard will have the honor of seeing his name imprinted on that same sign in the games of friends connected to Autolog. A taste for interaction that extends to the entirety of the online multiplayer component, probably the best part of the whole package offered by Need for Speed: Most Wanted. The possibility of exploring Fairhaven in the company of friends not only offers endless opportunities for entertainment, but also puts the most entertaining races in the field, given the absence of the unfair drivers led by the CPU: in this mode, everything revolves around the so-called setlists, i.e. sets of competitions to be faced in rapid succession that alternate traditional competitions with more exotic challenges, which reward the authors of the best stunts or the fastest to reach a given goal. And this is undoubtedly the real strength of the Criterion racing game, and to say that the product loses much of its appeal if deprived of online support seems anything but exaggerated.", "date": "2012-11-06", "grade": "8.0"}