{"name": "Da creatura al creatore", "ref": "https://multiplayer.it/recensioni/110579-natural-selection-2-da-creatura-al-creatore.html", "text": "We have already dedicated two proven ones to Natural Selection 2, one older and the second based on a much more recent version of the game. We are not reporting the old articles for reasons of laziness, but because we are actually dealing with a very particular title, starting from how it was managed. Unlike what happens for many other games, on which developers and publishers drop a sort of smokescreen from which from time to time they release morsels for use by the press for news and previews, those who wanted, by supporting the project in advance, was able to take part in the last stages of development, following its evolution and all the filing work of the gameplay. So for many, the publication of Natural Selection 2 was nothing more than the umpteenth update of a project that has been evolving for years now, for which there are already numerous modifications given the open nature that distinguishes it. Let's say that what has reached the general public is a title that has already largely ~naturally selected~ its internal elements and which in recent months has presented itself as increasingly definitive, despite the continuous adjustments. In short, the descriptions of that time are also valid today, given that the backbone of the game has not changed and the aliens, called Kharra, and the space soldiers continue to beat each other up where no one can hear them scream. All that remains is to try to understand if the promises have been kept. Gameplay For those who don't know or don't want to read the other articles, let's make a brief summary: Natural Selection 2 is a first-person shooter mixed with a real-time strategy game that pits space soldiers against terrible aliens. Each of the two factions has its own peculiarities and can evolve in various ways during the game. The player is therefore called to master a much more complex strategy than a normal shooter, because he must manage the evolution of the match, studying the situation and choosing which creature to evolve his space animal into, or which weapons to use in combat with his soldier. This alone would be enough to define an enormously dynamic gameplay with a quantity of facets such as to annihilate most of the other multiplayer shooters currently on the market for complexity and charm. To enrich everything, however, there is also the role of the commander, that is a supervisor of the team who has a very important role: tactically managing the attack and defense. Through an interface that is not exactly easy to master, the player / commander will have to keep the map under control, give indications to the team via microphone, distribute healing items, direct scientific research, build the various structures and so on. It is a real game within the game which, if well managed, has an enormous specific weight on the action. A commander can be discriminating for victory or for defeat. Above all, a good commander is the key to enjoying Natural Selection 2 to the fullest. Never as in this game has one felt the difference between joining a server where everyone does what they want and joining one where everyone ~interprets~ the his role and plays together with the team. Server problems, of course As tradition has it, Natural Selection 2 also had problems with the servers on launch day. The story of the employees of Multyplay, an English company which Unknown Worlds Entertainment has entrusted for the management of the game servers, woke up in the middle of the night to counter the unexpected influx of players by adding memory dedicated to the servers is already legend (let's not exaggerate, come on) . Oh well, Diablo III has been forgiven for several days of blackouts, so we don't believe that the few hours of down of the Natural Selection 2 servers represent a big scandal. Without compromises Obviously we are not talking about a title that is easy to approach. Not that in principle it is difficult to play, because by dealing with it superficially you can even go so far as to ignore its potential for developing the gameplay. Of course, in doing so you soon end up abandoning it in favor of something else. The truth is that the work of Unknown Worlds Entertainment tends to select its players, avoiding any form of compromise. Natural Selection 2 requires the development of the dear old skill, but it also requires the ability to think about one's moves without jumping into the fray as a kamikaze. Sometimes it's a game of stalking and waiting, other times it becomes a bedlam in which the clash is a pure confrontation of skills. You will never find shortcuts to get to the frag or concessions ~ruin games~ to playersthe casuals. To obtain this result, not yet perfect according to the developers themselves, years of testing took place which led to the individual values of each aspect of the game being adjusted from time to time. Creating acceptable balances in such a complex title was not easy, but we can say that the mission has been accomplished successfully, even if there will be new updates to further streamline the online experience. In fact it is not difficult to speak of Natural Selection 2 as a constantly evolving project that could take unpredictable paths, given that modders have been given a very large room for maneuver (basically it comes from one of the most famous Half-Life mods, could not deny his origin). For now, what we can play now is an outstanding multiplayer shooter that we hope to see soon also used in big competitions. Natural Selection Natural Selection is one of the most famous Half-Life mods, which reached version 3.2 before Unknown Worlds Entertainment dedicated itself body and soul to its sequel, which takes up part of the gameplay. As it seemed logical to everyone, Natural Selection 2 was initially supposed to be developed using the Half-Life 2 Source, but soon the developers preferred to switch to a proprietary graphics engine.", "date": "2012-11-05", "grade": "9.1"}