{"name": "Torna il Mago pi famoso di sempre!", "ref": "https://multiplayer.it/recensioni/110663-harry-potter-per-kinect-torna-il-mago-piu-famoso-di-sempre.html", "text": "Harry Potter Kinect is a new game exclusively for all those who own the Microsoft console and a Kinect camera. It differs from the previous chapters developed by Electronic Arts in terms of structure and target audience: no longer an adventure in which to wander around in the role of Harry, but a series of challenges and events linked to the imaginary world of the saga, freely drawn from all films released in theaters and not necessarily linked by a plot. Harry Potter Kinect was born and built to please and be played especially by children, even before teenagers. Return to Hogwarts The incredible success of the creature born from the mind of the English writer Rowling does not seem to stop, the goose that lays the golden egg that has produced dozens and dozens of books, films and video games continues to churn out new and always different ones. Harry Potter Kinect was born along the lines of any multi-event like so many have seen, but obviously entirely based on the adventures of the heroes of Hogwarts. The game is virtually divided into two phases: the first is made up of events related to life itself within the school of magic; in the second, however, we dive into the action to fight the Death Eaters up close, perhaps even together with a friend. In the canonical ~Story Mode~ various sequences taken from each film released so far are faced, chosen among the most significant or evocative, but still adaptable to a gameplay that works on Kinect. We are left free to decide whether to impersonate one of the protagonists (but without the relative original voices!) or to create our digital alter ego through the camera, made with our real face applied to the digital character of the game. The effect is not exactly perfect but it is still believable and fun. The various mini-games offered are fun and the target to which they refer is immediately clear, i.e. the younger fans of the series. The detection of hands through Kinect works very well, without particular technicalities or strange moves, the gestures of the body and arms are practically perfect on the screen, with functional and quick menus, contrary to what is often seen in similar games (too often very complicated to manage for the little ones). The variety of the action is guaranteed by a series of very different challenges: ranging from the creation of magic potions to the execution of spells as if we really had a wand in our hands, passing through the famous Quidditch competition or exploring the depths of Gringotts racing on a mine cart, avoiding obstacles and shifting your weight just like you do in Kinect Adventures. Proceeding with the mini-games unlocks some secondary missions, and each of them must be repeated three times, trying to gradually obtain the best scores. Perhaps one of the best games is precisely the one aboard our trusty Nimbus 2000: moving sideways to change direction we have to try to stay as long as possible in the wake of the golden snitch, simultaneously resisting the charges of the opponents and trying to grab the snitch once time at hand. Another moment experienced in the game is when in the role of Harry Potter we have to defend Sirius from a group of Dementors, alternating spells with our magic wand at the moment of defense in which we are called to dodge their attacks. Misdeed done! Some games have the option of being played with a friend next door to help us, while in others there is a head-to-head challenge in competitive mode, but no possibility of playing online via Xbox Live. The amount of options available in Harry Potter Kinect is appreciable, even though it is essentially a ~compilation~ of various mini games rather than a traditional adventure. The menus are very accurate and work well with Kinect, or there is no going crazy to select and confirm what we want to do. The sound sector is great as always, made up of historical melodies and orchestrated motifs taken from the films, with which they share the absolute quality of everything we hear during the game. The visual cosmetics, or the ~look~, or how it appears graphically if you want, has a good impact but certainly a little subdued compared to the standards of the latest Xbox 360 releases, even if rarely have you seen better in dedicated titles than this guy. Many effects on the screen, many well-defined elements that make the world of Harry Potter Kinect very credible and beautiful to see, but the effect is still perhaps too ~fake~, especially looking at the faces and characters, and comparing them with the latest Harry games Potter seen on the same Xbox 360. Some good animationsn games (for example when we have to cast spells, or when we fly on quidditch), less in other challenges. Obviously the goal of the game is not to visually amaze young viewers, but to make them ~participate~ in that world through the innovative interaction of the Kinect. From this last point of view we can say that Eurocom's mission (as the team responsible for this game is called) has definitely been successful, having created one of the most immersive, well-finished and simple titles to appear on Kinect. Nothing further from the promise of ~revolutionizing~ video games, but certainly something different from what we have seen on our screens to date. This latest Harry Potter game will appeal to the little ones and turn up their noses to the historical fans of the series.", "date": "2012-11-05", "grade": null}