{"name": "Medievil: Resurrection", "ref": "https://multiplayer.it/recensioni/medievil-resurrection.html", "text": "We've been waiting for him for five long years, as mentioned in the introductory hat. One of the most beautiful platformers of the last generation of 32bit consoles, the ~ghost & goblins~ for Psx really seemed one of the most suitable titles to see the light again on the Ps2 in a more ~evolved~ and improved version. Unfortunately, however, for a series of reasons unknown to us, this prospect has never come true and the cute Maxino has only partially filled the nostalgic fans of Sir Dan's adventures. Today, however, fortunately the internal Sony team that created the two previous titles, has decided to break the delay and bring back, finally we add, to the light one of the best titles of the last millennium. Let's say it right away though: Medievil: Resurrection is an ~upgraded~ remake of the first chapter of the series, not a real new episode. This obviously involves all the pros and cons of these cases. If for those who loved playability, immediacy and the unmistakable irony that permeated the entire original adventure, this can only constitute a pleasant variant to the new titles of the genre, with a return to the recent past of videogame history, for the others a game design clearly ~inspired~ (trait) by the old generation of consoles could make you turn up your nose. Sir Daniel Fortesque... The inhabitants of the Kingdom of Gallowmere have been transformed into soulless creatures by the evil wizard Zarok, who has returned from the afterlife with very bad intentions. In every county, on every street corner, restless spirits and monsters of unknown provenance have invaded the lands from north to south, mocking any resistance and making the few humans who had survived the mutation enslaved or insane. Hordes of the undead pour out of the tombs and for the locals it seems to be truly over. Unless Unless a fearless and unblemished hero, a knight of yesteryear, brave and brave, can appear out of nowhere and fight for good so that the kingdom is freed from the curse. Too bad, however, that there is a Dark Age and a similar hero does not exist! And then there's nothing left to do but bring back some of them from the world of the dead, and maybe settle for a knight with questionable principles, shot to death by an arrow shot during the famous battle of Gallowmere 100 years earlier by the soldiers of the revived's army Zarok, and resting in peace in the damp, cold crypts of a ruined fortress. His name? Sir Daniel Fortesque. Among the gravestones wrapped in weeds, the ~brave~ leader rests the sleep of the righteous, when a genius who has been living in his skull for some years, Al Zalam, brings him back to life. Ready to once again face the powerful wizard Zarok and his army of undead to regain the honor lost in battle, the knight throws himself, trembling, against the enemies... The structure of Medievil: Resurrection repeats, and as mentioned before, it could not be otherwise since it is a sort of remake, as seen in the episode dated 1999. It is therefore a platform based on the exploration of vast three-dimensional environments with a gothic look, even if revised in a humorous key, and on battles blows of more or less conventional weapons (at the beginning our hero uses his detached arm as a club...) with the enemies on the screen, both to continue the adventure and to accumulate Power-Ups and the like capable of increasing the ~destructive~ power of our Dan, as well as making him acquire new fighting techniques, new weapons and new skills, the latter then essential for overcoming certain areas of the game. Go-go restyling As far as the innovations proposed by this title are concerned, some interesting additions scattered here and there by programmers, committed to offering the end user a product that is not too old, should be noted. Starting with an improved management of the game's cameras by the CPU, a real ~Achilles heel~ of the original on Psx. This change finally allows the gamer to fully enjoy certain phases in pure platfom style (read ~jumps and the like~) without having to worry about ominous shots that limit the correct vision and the subsequent action to be performed ~blindly~, cursing every fall the ~ geniuses who have devised such a system of rooms. The SCEE title also offers other interesting variations on the previous episode to which it refers, such as a more logical and less dispersive articulation of the game levels and a greater variety of enemies, the latter, however, equipped with an AI that is certainly not excellent. Which means that the longevity of M: R is not high, actually hovering over less than ten hours of play. To overcome this shortcoming, programmers have therefore invented aSome nice ~separate~ mini-games, that is detached from the main mode, playable in single or in multiplayer by sharing via WI-FI. In this case the two gamers will have to own two separate copies of the game. As for the technical aspect itself, the programmers have done an excellent job by exploiting the potential of the small Sony home console quite well. Medievil: Resurrection can, for example, boast a respectable graphic sector, certainly better than its predecessors, with vast three-dimensional environments covered with textures with attention to every detail, dynamic and better used light effects, and a general design of sure visual impact, all things that help the player immerse himself even more in the surreal atmosphere of the world of Sir Dan and Co without actually affecting the gameplay since there are no significant slowdowns despite the amount of ~stuff~ moved on the screen. Finally, the interlude films (often made with the same engine as the game) and the audio sector are beautiful, with amusing tunes that alternate with other decidedly more evocative, gothic ~compositions~ and dialogues without infamy and without praise, intermantely dubbed in Italian. Conclusions Despite a respectable technical sector that seems to exploit almost the full potential of the PsP and a very likeable and charismatic character, in its own way, Medievil: Resurrection is one of those titles which, due to an overly dated game system and a longevity reduced to a minimum, their potential and their appeal to the average gamer are drastically reduced. The SCEE title is not bad, mind you, especially with the additions we were talking about during the review, and let's not forget that it is the first platform game available in Europe for the newborn portable Sony, however it tastes outdated, already seen. With a little more attention and some tweaks to the gameplay it could have been more interesting and in line with the expectations of the fans. At this point we just have to cross our fingers and hope for a sequel that fills these gaps. For the rest, in the meantime, we recommend it to all those who loved Dan's character and his world. Pros: Great graphics. Captivating characters, Dan above all. Fun even if stylistically dated. Cons: Gameplay needs to be updated. Poor longevity.", "date": "2005-10-06", "grade": null}