{"name": "Vent'anni e non sentirli", "ref": "https://multiplayer.it/recensioni/110578-football-manager-2013-ventanni-e-non-sentirli.html", "text": "When the Collyer brothers created the first Championship Manager in their bedroom in 1992, they probably didn't expect to see their creature become what it is today, exactly twenty years later. In addition to a ~simple~ video game, the series (which in the meantime has changed its name to Football Manager) has become a real cult in the electronic entertainment landscape, gathering ranks and ranks of fans over time. A phenomenon that has gone even beyond the world of video games, allowing its creators, together with the current Studio Director Miles Jacobson, to obtain official honors from the United Kingdom for their achievements. An important milestone that of the twentieth birthday, which comes together with an equally important design decision for Sports Interactive: that of separating the game into two parts for the first time, giving life to two different ways of conceiving Football Manager 2013. Speed and depth, simplicity and dedication, or to put it as it is fashionable in a summary, casual and hardcore way. A division that the development team has put in front of us since the moment of the announcement, thus promising a very special version for this anniversary of the series: after having seen it and reviewed it in the beta version, the time has finally come to judge the work of Sports Interactive, going into the intricacies of Football Manager 2013 and its novelties. Because this time, more than ever, there really are plenty of them. Long live the tradition In an inverse way to what was done during the hands-on, this time we want to focus first on the traditional mode of the game, to be clear the one inherited from past years and which we all know as Football Manager. Improving a product that has gone through editions after editions without ever missing an appointment is certainly not easy, but Sports Interactive has shown that it is able to justify its work time after time, making more or less radical changes that have often seen the involvement of the online gaming community. What the latter had been clamoring for for some time was a new training system, which was finally served: so let's forget the old sliders and welcome a completely renewed screen, made up of a single calendar where both the games to face, that the chosen training program. It is now possible to operate directly at team level, choosing how much time to dedicate to the preparation of a single match compared to how much time to dedicate to the players' growth over the months, for whom it is still possible to define a personalized training program with which to fill any physical or technical deficiencies. A system that undoubtedly makes this section more interesting, for years it has always remained the same. In the roundup of innovations introduced in Football Manager 2013 we also find greater collaboration between staff members, increased in number in such a way as to have a hierarchy and enhanced in the tasks assigned to them: at this point a small dilemma opens up for the player, who could see himself overwhelmed by the ever-increasing number of options and additions that Sports Interactive has made to the game over time, thus deciding to download some of his work. Between negotiations, training sessions, conferences and so on, the temptation could be, for example, to delegate part of the administrative tasks to the sporting director, who, as in reality, will have to be up to the situation to prevent him from doing any irreparable damage within the our rose. The possibility of delegating some tasks can be an extra concern in some ways, fueled by the constant feeling of having left something out, but everything can help those who don't want to apply themselves in every single aspect of the team, leaving for another example whether it is the assistant coach who makes some decisions or acts as our spokesperson in the renewed press conferences, now equipped with the choice of mood for our statements. Complete restyling The assistant manager himself takes on a more prominent role during the match, where his updates on the unfolding events constantly appear in the corner of the screen. A kind of conversation with the coach, as is often seen on the benches during real matches on TV. It stands to reason that if you want a second to carry on your footballing philosophy, you'll have to hire one with the same characteristics as you. Staying on the game, the main screen has seen further optimization work by Sports Interactive,which has managed to almost totally eliminate the need to pause for make changes even in the most agitated phases of the match, during which it is perhaps preferable to set a slightly slower speed than in the past, in order to keep everything under control without missing anything. To move the players on the field is the usual 3D engine, which is also the object of the efforts of the developers to add further realism: the intentions are certainly good but there is still work to be done between animations and movements on the field, sometimes not understandable and able to make the team lose the ball in a bizarre way. Taking a small step back, we also take note of the optimization of the game menu interface, already revised in the past to better manage the space offered by widescreen screens: the customizable elements have been increased, while in just a few clicks it is now possible to reach even the most hidden of menu items. From the point of view of the resources used, an improved loading speed can also be seen on not very powerful machines, which will certainly please. Under the banner of renewal we also count the online mode, which has finally abandoned the need to enter an IP address in favor of a system of dedicated servers via Steam. Beyond the technical aspect, alongside the classic network match we now find the possibility of accessing the online leaderboards and exporting one's team to challenge our friends. Football Manager Classic We talked about it for a long time, postponing any consideration to this moment: Football Manager Classic is nothing more than a reduced version of the main mode, designed by Jacobson and his team as a way to give those who have little time to devote to the game the opportunity to carry your team forward over the years. To give an idea of what we are facing, consider a Championship Manager from about ten years ago as a basis, to which we can add most of the most successful innovations introduced in the meantime, while eliminating all the aspects and complexities that are not useful for fast game progress. What in the traditional mode could be the first week of the game, spent only between pre-season and a few games, in Football Manager Classic can even become a couple of seasons played in full. Fortunately there are various levels to reduce the complexity of the match, thus allowing those who want to choose whether to compete with a simplified version of the training system, with matches and with everything else that makes up the essential experience of a manager's life . In the same mode, a system of microtransactions has been introduced, thanks to which you can obtain various types of bonuses if necessary. By paying small sums in the shop present in the game, everything becomes possible: from raising new funds out of nothing to the immediate discovery of new talents, up to being able to keep players interested in transfers, no longer getting rejected. That of the DLCs is an ~extra~ fortunately confined to the Classic mode, which therefore shouldn't worry too much those who prefer to play the full version of Football Manager. Within the Classic mode we also add the new Challenges, intended to place the player in a certain game context such as a miraculous salvation to be achieved or having to face a wave of injuries.", "date": "2012-11-02", "grade": "9.2"}