{"name": "I tre giorni del Connor", "ref": "https://multiplayer.it/recensioni/110429-assassins-creed-iii-i-tre-giorni-del-connor.html", "text": "The long-awaited moment has finally arrived: in a few hours many people (others not, damned Italian practice of breaking the day one) will be able to get their hands on Assassin's Creed III, the fifth ~regular~ title of a saga that has managed to carve out a space really important in the videogame landscape, surrounded by a hype that now shines in its own light. Ubisoft has in fact been very good at creating charismatic characters, a fascinating world (and here Rome-Florence-Venice have had the lion's share) and embracing a genre that is certainly among the most popular in this generation of video games. We have already finished the title over the course of two intense weeks, analyzed it with a cold mind and finally tried to understand in which direction this lucky saga is going. The introduction that is proposed when starting a new game is perfect for reviewing the events that have involved Assassin's Creed from the beginning. The end of the world is near with the fateful date of December 21, 2012 which repeats itself insistently; Desmond Miles and his team are ready thanks to the Apple of Eden obtained previously to find out what to do to avert this catastrophe. A final barrier stands between them and the showdown and therefore, having archived the events of Altair and an Ezio Auditore particularly dear to the developers, it is time to move to the years of the American War of Independence, to understand where the last artifacts and the key to access the truth. Between Boston, New York, the border and some excursions to the Caribbean, the protagonist is Connor, a native American whose growth is explained in the first game sequences, a sort of well-disguised mega tutorial that introduces the ~new~ game dynamics, makes the most cohesive and interesting story and leads the narrative for all twelve available sequences, interspersed as always by sections with Desmond Miles in command which act as the glue for a story that is thrilling millions of gamers. More than side missions! The structure of Assassin's Creed III is inevitably the same as the previous episodes: a third-person adventure that is divided between main missions and a bunch of side activities, which probably reach their peak in this chapter in terms of diversification and quality. Between collectibles, side missions, skills available to the main protagonist, among the most disparate activities, there are so many things to do. However, it would be simplistic to make a simple list, much better to talk about the most significant ones to explain how they positively affect the entertainment and variety offered. Assassin's Creed III also has the merit of introducing almost all of these components through the main story, to then delegate their deepening to secondary missions, which allow you to unlock trophies, skills and earn a nice nest egg for your purchases. Finding ourselves in America during the war of independence and with an indigenous protagonist, hunting through the various settings available could only be present. Connor can use arrows, traps, decoys, daggers but also his own gun to knock down the animals and then obtain skins, bones and more, to resell or reuse to enrich his estate. The ~game within the game~ of this chapter is in fact to decorate, enlarge and populate a huge colonial house with a large plot of land available. By completing the dedicated missions it is possible to obtain craftsmen, buildings of various kinds and the possibility of producing goods of various kinds, from minerals to wood. Inside the house there is an account book thanks to which the discovered blueprints can be used to manufacture objects such as clothes or furniture up to land and sea convoys that can be sent to the various warehouses; after a certain amount of time, barring negative events (indicated by a clearly evident percentage of risk), these vehicles return with the proceeds collected from the sale. A good system to get money therefore, to spend on weapons, maps, clothes and naval upgrades, however undermined by an extremely cumbersome interface, which requires several steps for each single selection, and by the fact that in the end, beyond wanting discovering everything, we are reduced to always producing and selling the most expensive things. Having said that, the estate's missions are decidedly interesting, hunting is pleasant and can be easily limited to when you ~walk~ between one mission and another; in general this part is perfect for collectors, perhaps the most complete of all those implemented in the various Assassin's Creeds. Next toat the main house, the possibility of obtaining a ship of its own is unlocked later, the Aquila, which can be upgraded as per the script and gives rise to a whole series of maritime missions, absolutely among the best in the game. At the direct command of the rudder it is possible to stop, hoist half or full sail and take advantage of the wind to sail along the coast up to the Caribbean; with the upper backbones to engage enemy ships thanks to cannons and more, even boarding other vessels when required by the mission itself. The control system works perfectly, the variety is adequate and the sense of empathy perfect. From nothing Ubisoft has managed to create a naval navigation system that could easily be implemented in a game of its own, and even the noises and phrases of its crew are particularly believable. Connected to the possibility of sailing the seas are Kidd's trinkets, collectibles which, after being collected in a certain quantity, ~unlock~ missions which in part recall those of the Tombs of Nero in the second chapter, or platform sections in specific settings ( ships on fire, snow...) albeit of a shorter duration but very entertaining. Finally we have the assassin adepts, who can be recruited by freeing portions of the city thanks to small local missions, and can be sent around America in order to gain experience and bring back money and objects. They also allow you to have skills to unleash with the lower left back, such as the classic assassination, the kill from a distance or the possibility of unleashing popular unrest. It goes without saying that in the light of all this good things, the time span with which it is possible to complete the game varies profoundly; you can go from ten to twelve hours for the pure main campaign - but it would be crazy to play the title in this way, given its structure - to easily get to the abundant thirty necessary to get 100%. We finished it in 21 hours, with quite a few side activities completed and several still to be completed. Repetitiveness and boredom therefore seem to be a distant memory: Assassin's Creed III has that positive syndrome of leading the player to continually ~distract~ himself from the main mission, dedicating himself to exploration and collecting. The multiplayer To extend the longevity of Assassin's Creed III we think multiplayer, ~accessory~ increasingly appreciated by the most ardent fans. We have not been able to try it extensively due to the few sessions available, but having said that, the renewed interface allows access to various options that represent an evolution compared to the previous chapters. The usual three-part tutorial perfectly explains the game dynamics, based on the hunter-prey concept, there are sixteen characters to choose from, while between skills and upgrades there is a lot to customize one's growth. For example the possibility of throwing coins and thus discovering the prey that does not collect them, transforming a nearby character into his double, becoming almost invisible and so on; all in seven maps that cover the game settings, including naval ones, and in different weather conditions and times of day. Among the modes we see the addition of herd and dominance, which allow you to work as a team in a sort of deathmatch rather than defending or conquering a portion of the map. Furthermore, after completing the game, there is a surprise for those who play connected to the network, directly on the single player map ... Is the story? However, the series has become famous for the story it created and the charismatic characters that characterize it; the third chapter does not lose sight of these characteristics and answers all the questions we have asked ourselves over the years (hallelujah!), however opening (who would have thought it?), new implications for future chapters. The quality of the main missions is quite good, there are few boring ones, and taking advantage of some iconic moments of the War of Independence, such as the battle of Lexington, there are some variations on the theme such as the scene where Connor on horseback gives orders to the infantry of the patriots against loyalists, bluecoats against redcoats. The same goes for the already mentioned idea of introducing side activities directly into the main story. Extreme variety, quality and excellent longevity, we are sure that the story will spark great discussions and Assassin's Creed III does not disappoint fans by offering what they expected, with a very high production value. Why then a good vote but without those decimals necessary to define it as a masterpiece and the best AssasSin's Creed Ever? It is clear that over the course of the various chapters Ubisoft has created an extremely pleasant game, mitigating if not erasing the repetitiveness and boredom that characterized the original chapter. All while embracing an increasingly vast and disparate audience, but necessarily neglecting the improvement of the gameplay and all those aspects that make a good video game a masterpiece. First, there are still shortcomings in terms of combat and artificial intelligence; in the first case there remains an extreme ease certainly enriched by a scenographic component on the occasion of the bloodiest killings, there are very few novelties and the impression is strong that by now the clashes are an accessory compared to the rest, with the exception of the excellent naval battles. Artificial intelligence, never the strong point of the series, here is even more marked in its deficiencies, it ~ruins~ the stealth phases to which you always prefer, except when they can only be tackled in this way, the warlike approach armed with Tomahawk or sword, which allows you to get the better of even dozens of enemies in sequence. In some cases it is completely unnatural and we will give you a single example to make the idea clear. We are inside a prison with bare chest and clearly fugitives, a guard notices us from not too far away and calls us, without ~activating~ for the chase. We flee quietly into a bush outside, the guard reaches us and a few steps away from us he doesn't see us and goes back, because the system that manages the detection is too dependent on parameters that in such a varied game and often set in spaces open, they visibly clash. Therefore, the challenge is missing, and it is undoubtedly in the same way that New York and Boston of the 1700s have nothing to do with Renaissance Florence and Venice rather than Istanbul, both in terms of charm (but this thing is also very subjective), and in architectural and narrative terms. In fact, the story told is extremely interesting in general, especially in the part of Desmond, in the American one it experiences ups and downs depending on the event narrated (with George Washington and some pitched battles between the positive moments) and in general it could have been told better, even in technical terms: there are too many uploads that break the narrative, too many sketchy non-interactive sequences, including the ending, always American, which could have been much more explored. In short, Assassin's Creed III excels in variety and fun, but carries with it critical issues that after five chapters begin to weigh more and more and indeed in some cases seem to have gotten worse. Playstation 3 trophies Assassin's Creed III offers 51 trophies, of which 2 are gold and 14 are silver. By completing the game and doing a part of the missions or side activities you get between 45% and 60%, the rest can be obtained by completing the rest and playing multiplayer, which sees five trophies attached to it. Something is missing? We have not forgotten the technical aspect! Assassin's Creed III is excellent in terms of graphic impact, it boasts of atmospheric conditions such as rain and snow, of superior quality lights and has the creation of the forest and the fauna that populates it as its flagship. Perhaps even more beautiful are the missions at sea, at sunset and at dawn, or under a beautiful Caribbean storm; the colors explode and also in this case the impact is excellent; we see overall that Assassin's Creed III has benefited from all the experience gained by the developers over the last few years. However, the graphics engine is still far from being completely stable; as soon as the disc is inserted into the console there will be a patch to download that fixes most of the bugs we encountered during our test; however, some imperfections remain, the frame rate dancing in the most agitated situations and the more or less accentuated aliasing depending on the case; tearing, on the other hand, seemed to us to be extremely reduced. Dulcis in fundo the soundtrack which serves as an excellent accompaniment as always, in some cases it takes over in terms of beauty, in others it is a good supporting actor. The dubbing in Italian is of discreet workmanship and depending on the case it causes deja vu, like the good Claudio Moneta (Shepard!) who dubs a main character, or does his honest job between ups and downs.", "date": "2012-10-30", "grade": "9.0"}