{"name": "Di nuovo sul ring", "ref": "https://multiplayer.it/recensioni/110376-wwe-13-di-nuovo-sul-ring.html", "text": "Punctual as always, WWE returns again this year in its video game incarnation to inflame the hearts and living rooms of millions of fans around the world with fights between the most famous wrestlers of all time in this sport. The new edition, strengthened by the complete license of World Wrestling Entertainment Inc. and full of many new contents aimed at improving, where possible, the gaming experience, returns to the public with a title that continues along the path traced by the previous episodes of the series . In fact, WWE '13 combines all the options already present in the past with some interesting modes, plus the important improvements to the gameplay to try to repeat the success of its illustrious predecessors. But let's see what's new and what are the individual unpublished elements on which we will focus more, for obvious reasons, in this article. WWE '13 offers a respectable roster, as per tradition, with many athletes including Superstars, Divas and Legends equally divided among the stars of the various WWE categories. Available among others are World Heavyweight Champion, Sheamus, WWE Championship CM Punk, Intercontinental Champion Kofi Kingston, United States Champion Antonio Cesaro and various Dolph Ziggler, Triple H, Kane, The Undertaker, Randy Orton, Daniel Bryan, Alberto Del Rio and the timeless Rey Mysterio. There are also some of the greats in the history of American wrestling who are no longer properly active (although they still sometimes participate in shows), such as ~Stone Cold~ Steve Austin, Mick Foley, The Rock, Bret Hart and Shawn Michaels. To this plethora of fighters who already in themselves guarantee the product many variations and great longevity, are added those that will be made available through DLC (for example Mike Tyson) and those that can be recreated from scratch through the usually powerful internal game editor, through which you can customize almost everything from moves to entrances, from cutscenes to rivalries and friendships, as well as entire arenas; moreover, to offer even more ~material~ with which to have fun, there are an infinite number of game modes divided into many sub-sessions which are in turn rich in options and content. WWE Universe Listing them all would be a titanic undertaking for which we prefer to mention the most important, among which we always find the mode called WWE Universe, here in version 3.0. It, we remind you for newbies of the genre, is a sort of combination between that Career and that Exhibition. In this session, the gamer is called upon to play a practically infinite season that can last for the entire professional existence of the champion he has chosen to impersonate, whether real or created from scratch. If you decide to start from scratch with perhaps a customized wrestler, the apprenticeship is obviously much longer than normal. In this case, his competitive life is planned in relation to his ranking, public approval and his rivalries: in short, the more important the wrestler is, the more commitments the card has, linked to a calendar of events related to WWE or to what is chosen by the user himself. In all cases, every gesture or choice made by the avatar will influence the development of the game itself, generating, in relation to what is combined in the ring or outside it, alliances, rivalries and everything that can determine the continuation of a wrestler's career . In this way you have the feeling of being part of a real world, where friendships between athletes are formed and broken, the characters change their attitude from face to heel, belts pass from hand to hand. This year, then the fans have greater freedom of action and are no longer necessarily obliged to follow certain situations within the individual federations (although in this sense there is no lack of variety since Paul Heyman himself worked with the developers to devise over two hundred cutscenes for this mode) but they can program some aspects of their stories, deciding the weekly structure of the shows, the roster, and so on. Furthermore, among the most interesting novelties of this mode, it is worth mentioning the possibility of disabling the wrestlers, ie deciding which ones you want and which ones not to have active, modify the rankings so that you can remove the people you do not want to have in the same, decide which storylines must be active or not during Universe, disable injuries, etc. In short, the section is very rich in content and a special menu displays the various options, statistics, which matches are scheduled for the evening or in the next few days (and in which the user can take part by siding with an athlete of his choice or simulating the challenge), the rankings of the federations, the news from the backstage with the related cases which, as mentioned above, gradually come to light (quarrels, assaults, etc.), and many other functions. Playstation 3 trophies WWE '13 offers gamers 49 Trophies: 36 Bronze, 10 Silver, 2 Gold and 1 Platinum. To obtain them, users are called as always to the most disparate feats in all game modes, for example by performing a single final move with a subsequent pinfall on an opponent after offending him with a special insult, winning 10 ranked matches, defeating Sheamus using Daniel Bryan in Exhibition mode or by completing one of the proposed stories such as the one called ~Mankind~. Attitude Era Another very important mode of WWE '13 is the new Attitude, which this year replaces the one called Road to WrestleMania. The Attitude Era, for the uninitiated, was a period in the World Wrestling Federation that began in 1997 and ended in 2001, as a direct consequence of the so-called Monday Night War, a challenge between the then WWF (today's WWE) and its rival World Championship Wrestling (WCW) to corner the ratings. The chronicles of the time narrate that to satisfy the tastes of its fans, the WWF gave more prominence to heel fighters by transforming its shows into a product that was no longer suitable for families, but aimed more at an adult audience and a lover of a certain way of fight, certainly violent and based on a style closer to the street one. In the case of the video game we are reviewing, the Attitude Era only covers the period between 1997 and 1999 and the session is divided into chapters of variable length to relive the deeds of eight great protagonists of the time: ~Stone Cold~ Steve Austin, Mick Foley, D-Generation X, The Rock, Bret Hart (the protagonist of the controversial Montreal Screwjob), Kane and Undertaker. Many of the matches that have made the history of the Stamford federation can be played here, but since it is not possible to make the dozens of challenges that have characterized the seasons and careers of the athletes mentioned above available to users, Yuke's has decided to include in the mode about twenty videos that are used to better understand the phases that perhaps led to a particular feud between two wrestlers, to the match that the player is about to dispute or to show how a particular story ended up. But that's not all: to encourage users not to act almost ~passively~ in the already written ending of the matches in which they are engaged, perhaps by pressing a button that activates the sequence that recreates the move that ended the challenge in reality, the developers a system of bonuses and objectives to be achieved are invented. In practice, just to give a concrete example, by controlling The Undertaker in Hell in a Cell at the 1998 King of the Ring pay-per-view which saw him triumph over Mankind, one can, following the specific indications given by the CPU, beat the opponent in a different way, pinning him or with a chokeslam rather than with the fatal tombstone piledriver of the original match, thus obtaining special prizes and extra unlockable content in exchange. After analyzing the main game modes, it's time to talk about gameplay. In this sense, once you enter the ring, the immediate sensation is that of being faced with the previous episode of the series, with some improvements in the control of the wrestlers due to the more realistic management of their masses to differentiate the two titles. The developers have in fact refined and cleaned up those more angular elements of the playability of the 2012 edition, which had already brought about the complete rethinking of the game mechanics, and at the same time performed a total redesign of the skeleton models and character animations. Ring of fire Factor, the one just described, which has allowed THQ not only to bring athletes into the ring that are visually even more realistic especially as regards their dimensions, which are now extremely more similar to those of their real counterparts, but also to redesign, for the better , the system that manages the physics inherent in the contacts. Consequently, the game takes weight differences into account in a more credible way than in the past, both to inhibit the use of certain moves or holds when the distance between the two wrestlers is excessive, and to ensure that he is the most powerful athlete at take advantage of its mass to knock out a less physically gifted opponent faster. Which undeniably offers a new tactical element in managing your avatar within a match. Unfortunately, as already highlighted in our previewima, the feeling of a physicality taken to excess is still strong with a control system that is sometimes not very reactive when certain moves are activated in sequence that it seems really difficult to interrupt. Furthermore, the artificial intelligence, albeit improved, still remains a little below expectations and every now and then the athletes in the ring managed by the CPU seem to make somewhat questionable choices. There are also a couple of bugs related to animations, especially in actions on the ground or outside the ring. For the rest WWE '13 remains strongly linked in its gameplay, as mentioned above, to its predecessor, therefore it is devoid of all those technicalities related to the combination of keys and levers in favor of a certain immediacy which, subject to the right timing, it is exalted in large part in the rapid strokes, in the grips, in the reverse and in the much loved comebacks. Another important novelty is then the new function of the Triangle key (Y in the Xbox 360 version) which can be used to perform the finisher and to perform particular choreographic moves relating to the context and the position in which the two wrestlers are. The former, which can be set at the beginning of the fight to be present or not and possibly in a limited number, can be performed by simply pressing the aforementioned button by positioning the wrestler next to the stunned opponent, while the latter are linked to a particular function called OMG. When the contender is close to a certain element of the scenario or in a particular position, the writing we mentioned a few lines above appears on the screen, therefore pressing the Triangle button starts a real interlude sequence that stages a certain move particularly scenographic with lots of shot change, replay and skyrocketing cheering. For example, CM Punk can throw the unfortunate Daniel Bryan onto the commentator's table, causing Jerry Lawler and Jim Ross to flee desperately, or climb the post at the corner of the ring and set the crowd ablaze before performing a spectacular swan dive on the contender. TV show We spend the last few lines to focus on the game on the net and on the technical part of the product. As for the online component, in WWE '13 we have a series of modes largely similar to those of last year, including the possibility of being able to participate in any type of match on the web, including the Royal Rumble with 40 wrestlers. Unfortunately, it was not possible for us to fully test the game via the web since we had the title available long before its release on the market and consequently there was practically no one to deal with in any meeting or participate in particular events. However, THQ has guaranteed us that the game's servers this time will not betray the expectations of the fans and will be more efficient. Regarding the technical sector, while not showing great differences from what was seen in the 2012 edition, the game has graphics that are further refined, especially as regards the textures and aesthetics of the wrestlers, whose physical features, as mentioned before, follow faithfully as proportions those of their respective true counterparts, and the external elements to the ring. The glance as the athletes enter the scene and the square, each with its own choreography and background noise, effectively manages to immerse the player in the hubbub of the competition and more generally in the typical atmosphere of the show. Of course, some flaws remain in some animations, especially when the fighters find themselves moving outside the ring, but in general, from a visual point of view, WWE '13 is confirmed as a further small step forward for the series. As for the audio part, here too the excellent work done by the development team can only be highlighted, which has packaged in this sense a product as close to reality as can be. The first thing you notice as soon as a match starts is also in this case the atmosphere that surrounds the event: everything becomes immediately engaging, in particular thanks to the behavior of the public, and once the fight has started it is certainly interesting to appreciate the constant changes in the chants and chants of the crowd that take into account the increase in intensity of the fight itself, as well as the existing rivalries between the fighters and their alignment with the show. Controlling, for example, a heel and with it giving a thrashing to a wrestler face immediately starts the boos of the public, while vice versa the crowd reacts differently, bursting into screams of joy and choruses of incitement to beat up the villain mercilessly when it is the good athlete to win. The result", "date": "2012-10-30", "grade": "8.5"}