{"name": "Il cavaliere dell'abisso", "ref": "https://multiplayer.it/recensioni/109667-dark-souls-artorias-of-the-abyss-il-cavaliere-dellabisso.html", "text": "Dark Souls is without a doubt one of the most important games of the generation. In an almost purist balance, the integration between progress, playful offer, difficulty and bestiary, is structured to shine independently. The growth paths are multiple, there is no shortage of narrative pieces, there are no gameplay shortcomings, nor are we dealing with a developer accustomed to creating downloadable content. Dark Souls is the ideal example of a title that didn't need DLC to remain in history and satisfy all its past and future buyers, or at least those aware of the essence of the title. From Software itself had promised that it would include all the existing material in the game, in line with that philosophy halfway between hardcore and nostalgia that had so tickled the somewhat masochistic gaming soul of the old fans of the saga. Then came the cold shower, and here is the publisher Namco Bandai announces the release of the Prepare to Die Edition, within it a downloadable content almost unrelated to the main story line and able to give a few hours of progress in parallel with the main quest. The DLC in question has been called Artoryas of the Abyss, in honor of the deeds of the knight Artoryas in his fight in the deepest corners of darkness. Some fans will surely have rejoiced, others a little less at the thought of having to redo all of Dark Souls just to unlock some additional gameplay, but this, unfortunately, is the harsh law of videogame triggers. For around thirteen euros, is it really worth going for a picnic on Oolacile? Art a little aside Lordran is a wonderful place, and all the players who have walked its lands will have the castles, the spiers, the forests, the underground worlds made of lava and ice, the bosses engraved in their minds. The setting has been artistically evolved compared to Demon's Souls and enriched with scenarios and environments that have touched all of the western fantasy iconography, resulting in a very organic, coherent and at times almost dreamlike. We expected a different downloadable content, which could give other types of visual and playful emotions, instead From Software has chosen to rest on easy commercial laurels. The new areas of Oolacile don't shine enough to warrant a year of development, nor do its residents. The initial confrontation with the Guardian of the Sanctuary passes, but the forest motif that permeates the entire first half has a sad taste of dj-vu, the Dark Root Garden soon comes to mind, much more characterized than the new Oolacile Forest both in terms of atmosphere, of lighting but above all of enemies that populate it, little characterized and with limited attack moves that can be learned immediately. Visually, the effect of the sunset gives tranquility to an almost poetic environment, contrary to the devastation that should instead have occurred in Oolacile, resulting in a somewhat incoherent narrative framework. An easily forgettable first half fortunately gives way to the clash in an evocative mausoleum, which raises the morale of the players waiting for an improvement in what has been downloaded, but there is little to rejoice. The County of Oolacile is very particular, both from a visual and an acoustic point of view, with screams in the distance to create tension, but it is not clear why insert a setting as beautiful as it is bare on a playful level. The choice of inclining the angle of the buildings and the game plan is splendid, but in addition to the pleasant smoke and mirrors, a little roast would also have been appreciated. The two categories of enemies present in this area are unconvincing, almost obvious and without bite. The decision to make the County a viable track could have made sense if the platforming phases external to the advancement had been multiple, with so much material to be found around the roofs at the risk of one's life, but From Software inserts only a few items that are easily accessible and just when we were about to get attached to the atmosphere, the Shire already ends. The monotonous duotone of the Abyss is around the corner, but just long enough to advance without problems given the questionable choice to insert a new type of enemy that practically does not attack and Magnus stands between us and the end of the DLC. And trust me, it's certainly not an impassable wall. But is there more? Yes, that's right, in addition to the three bosses of the main quest of the content, there is a fourth one hidden. Badly hidden, mind you. It is enough to have activated a simple trigger and a few seconds of detour from the path to get to the Black Dragon, finally a boss dragon, and moreover a complex one. The dragon is the real boss of the DLC, as you will have to drastically increase the level to be able to take him out, and not without problems. A welllla frame for a clash that establishes, in fact, the total completion of Dark Souls, since if you beat the dragon, completing the rest of the primary plot will be a breeze. In keeping with From Software's sadistic tradition, the game does nothing to warn adventurers to leave the fight with Sif after exploring the Abyss and defeating Magnus, as freeing young Sif from a cave in the dark will grant a nice additional scene before the fight with the wolf in the main story. Taking a look at the other characters present, Gough is the only one who has a minimum of background, the others appear and disappear with the same speed, leaving the players dissatisfied, eager to know more and with more doubts than they had in previously, helping to create that sense of shy effort put into making characters that appear too ethereal. Bitter consideration, also considering how much the lore factor was an exciting fulcrum in the primary quest of Dark Souls. A separate mention for online, which with a choice of single or team PVP system provides a place where lovers of hand skill and advanced equipment can let off steam at will. Adding up the high few, it is not easy to give a dry judgment on this downloadable content. Four bosses, a few new items and a few more areas: the material would also be there, but the lack of commitment and passion instilled within the DLC by the team is evident, which has packaged superfluous content that adds little to nothing to what Dark Souls provided with all the more charm already a year ago, even considering the price of the DLC higher than the standards. From Software has always loved to amaze with the explosion of many small well-placed fireworks along its products. This time he chose a large and very expensive one, just a pity that it exploded a little too far.", "date": "2012-10-25", "grade": null}