{"name": "Trivial Pursuit Live! 2", "ref": "https://multiplayer.it/recensioni/trivial-pursuit-live-2-recensione.html", "text": "The world of video games has always been invaded by recurring titles which, cyclically, find space within the market. Examples of this are the now ~mass productions~ of the sports by Electronic Arts and 2K, Just Dance, or the more sporadic returns of Rock Band and Guitar Hero. These titles have the ability to carve out their large audience of enthusiasts, who come back every time eager to see what's new that led to the creation of a new chapter. How to behave when there seems to be no real claim that justifies a comeback of one of these products? That's the question that came to mind when playing Trivial Pursuit Live! 2, the second ~field test~ (although, in reality, there were several before Ubisoft's interventions) of the successful board game transposed into videogame form. It is sufficient to propose a new graphic layout and some aesthetic improvements to justify a new version on the market? Let's find out together in this review of Trivial Pursuit Live! 2. Game mode Trivial Pursuit Live! 2: A nice Quickstarter to warm up the mind Anyone who hasn't played the previous Trivial Pursuit Live! you might be surprised by what the video game offers. However, those who, on the other hand, have had the opportunity to spend several hours in the company of its predecessor, will soon realize that there are not many differences between the two titles. In the main menu we have the possibility to choose whether to play online or offline, whether in classic or versus mode (all against all or in teams), for how many rounds (three or five) and how many players (offline it is possible to play alone or up to four players, locally or against the artificial intelligence, the latter can also be deactivated if you don't want to challenge the computer and try your hand, for example, only in a ~duel~ between two players). Once the game has started, we find the videos introductions (that can be skipped, fortunately) which explain the rules of the game and mark the break between one round and another. The shifts, depending on the duration chosen, are always structured in the same way. We start with the Quickstarter, a series of multiple-choice questions that test your knowledge of each topic (divided, of course, into the classic categories History, Geography, Science, Art and Literature, Entertainment, Sport and Leisure). Then we proceed with a random one between Grab Bag and Close Call, the two rounds that use the cursor selection of different boxes containing correct or incorrect answers, both in the normal version (answers one player at a time), and in their ~Blitz~ variant ~ (everyone answers at the same time, going to rely more on the ~gut~ choice than on the weighted one). Then, if you have opted for the five-round game, you proceed with Switchagories, where, in turn, each player has the possibility to choose a category from two available, obtaining bonus points if he manages to answer the question correctly. Finally, after another round of Grab Bag or Close Call (if the ~Blitz~ version had not been released before, it will now appear, and vice versa), the final round is reached, consisting of a series of affirmations that must be associated with one of the two choices available (for example, Rome and Paris or Coppola and Scorsese): whoever manages to guess each answer without making a mistake, gets a ~wedge~ (which joins those obtained thanks to the points accumulated during the previous rounds). Whoever gets to six wedges first or whoever earned the most wedges wins the game. In case of a tie, victory is determined by the final score. Trivial Pursuit Live! 2: in Colse Call no answer is wrong, but whoever selects the most relevant to the question wins The structure of the game is nice, easy to understand and quite balanced. However, what we have described to you, from the selection in the menus to the end of the game, is very present in Trivial Pursuit Live! 2 as in the previous chapter. What changes is that some questions are more topical, but otherwise everything remains unchanged. The only real new element is the possibility of linking the game to your Twitch account and playing against your favorite streamer or challenging your audience, all thanks to the implementation of live chat that allows you to play with only one copy of the game. Pay attention to the game language We would like to underline that the game, despite the presence of various languages, is not localized in Italian. Coming from the previous Trivial Pursuit Live!, played on Nintendo Switch, we are now used to it, also because we have the opportunity to play together with people who know the English language in a way, all in all, sufficient to be able to compmake the questions of the game (then, when someone's knowledge is not enough, we help each other understand). But it is understandable that a video game designed for family use starts to become more of a frustration than an amusement if it is not possible to play in one's native language. Personalization Trivial Pursuit Live! 2: many characters to choose from and to customize Burned by the dazzling structural similarity between Trivial Pursuit Live! 2 and its predecessor, we couldn't help but cling to the only real novelty that the game offers: more in-depth customization. While in the other video game it was possible to select a character and change its skin and color, in Live! 2, in addition to the introduction of completely new characters (and, in our opinion, visually more charismatic), you can intervene on the appearance of your alter ego in a more targeted way, choosing accessories, headgear, suits and colors (which often they also modify the ~fantasy~ of the selected model), in addition to the now inevitable victory emotes. At the opposite extreme we find the ~titles~, or rather the phrases that we can show off in the match to show our opponents in which subject we are more knowledgeable, which return substantially unchanged compared to the previous edition. Trivial Pursuit Live! 2: The titles to show off against your opponents are back It should be emphasized that at least the possibility of unlocking rewards (cosmetic elements and titles obtained through the completion of certain objectives) has been granted for all participants who have created a profile within the game, so as to allow them to customize their own too alter ego without the need to participate in each game. Having the opportunity to give space to one's individuality through the appearance of one's character is something that is always pleasing in a video game, but how much it can affect in a title where you spend most of time to read questions and find answers? Focusing on something like customization in a game like this wasn't perhaps the best move. Technical compartment Trivial Pursuit Live! 2: the new game arena When the game first opened we took a second off to fetch a glass of water before jumping into the ~who knows more~ fray. While the main screen awaited our return, a playmate pointed out to us how the musical theme that passed in the background was the same as the previous chapter, only with a more pressing rhythm. Initially we had not found the link, but, after a few seconds, we realized that they were actually very similar. So far, however, nothing too strange, given that the recurrence of a musical theme is not only common, but it is also essential for creating that identifying link between products of the same franchise. However, that first hint of ~renewal~ has gradually intensified going to include the technical sector in its entirety. Which, again, is definitely not a bad thing. Or, at least, it isn't until it becomes a constraint. The technical sector seems to have undergone the reverse process compared to that of the game: the audiovisual elements do not give the idea of a careful and thoughtful evolution of the previous design, of a forcing that would allow to justify the existence of a new chapter without going to discredit the link with the previous title. Basically, priority has been given to the design of the characters rather than to the visual aspect that punctuates the games, the variation of which is so insignificant as to end up in the degree of smoothness of the corners of the game boxes.", "date": "2022-03-24", "grade": "6.0"}