{"name": "Nostalgia canaglia", "ref": "https://multiplayer.it/recensioni/109935-marvel-vs-capcom-origins-nostalgia-canaglia.html", "text": "It must be admitted that it is difficult to find meaning in this new digital proposal from Capcom. It's called Marvel Vs Capcom: Origins, but in reality the key element is missing, the first game that started the Versus series, namely X-Men Vs Street Fighter. Perhaps also thanks to the success of The Avengers, the recent film by Joss Whedon focused on the most powerful heroes on Earth, Capcom has well thought of including the very first Marvel Vs Capcom and the even earlier Marvel Super Heroes in a single package . The latter had been developed in the wake of the success of X-Men: Children of the Atom, also by Capcom, and allowed you to control only heroes and villains from Marvel comics; therefore, also in this case, we struggle to justify its presence in the compilation. X-Men Vs Street Fighter or even Marvel Vs Capcom 2 would have made more sense, but that's it... Rogue nostalgia However, we are talking about two games that are truly from another time. Do you think Marvel Vs Capcom dates back to 1998, while Marvel Super Heroes even dates back to 1995! Nowadays they could represent a decidedly old-fashioned vision on the screens of our very modern HD televisions, but perhaps the point of this compilation is just that: to reproduce them in their entirety, as they were, to impress the old gamers, those nostalgic ones who will surely remember with a smile the wonderful feeling of controlling Captain America for the first time to beat up that so beautifully animated Shuma-Gorath sprite. Seventeen years ago, the two-dimensional graphics of Capcom arcades reached peaks of excellence that today are perhaps more difficult to notice. Yet they are there, hidden among huge sprites and well-kept backdrops, accompanied by those slightly rough MIDIs that were hard to hear properly in the arcade. It's the vintage party, and Capcom doesn't intend to hide it, on the contrary: just take a look at the options menu to realize it. In addition to maintaining the original pixelated graphics, you can choose an interlaced display to simulate the effect of CRT screens or even distort the image, curving it to reproduce the typical effect of a cabinet. Do you remember when you waited your turn to play, looking over your shoulder at the player who probably would have inexorably torn you apart in five minutes? Well, this sensation is also reproduced, albeit a little summarily, by another option that distorts the image just as if we were looking at it from a precise angle. From this point of view, the work done by Capcom is commendable and almost moving. This nostalgic triumph marries a decidedly more modern online infrastructure: there is everything you could wish for, including ranked and unranked matches, spectator mode, waiting lobbies and Achievements/Trophies, artwork and movies to unlock. Playstation 3 trophies The number of Trophies to unlock is modest: 13 Bronze and 4 Silver, obtainable by completing the Arcade mode of the two games in the compilation with the various characters and by overcoming the various stages of the dynamic challenges. Superheroes with superproblems This videogame archaeological excavation has a great downside: by proposing the two games in their full and original version, Capcom has also dusted off the nightmarish balance that already characterized them at that time. Mind you, we are not talking about incredibly technical fighting games as the various Street Fighters could already be, but about refined fanservices that amused above all for the possibility of controlling some of the most iconic characters from Capcom and Marvel Comics. Marvel Vs Capcom, in particular, is one of the least balanced fighting games in history, with a roster of fighters that is nothing short of bizarre, characterized by almost completely useless characters and others that are much more versatile and powerful. Add to that the absurd secret characters, and that's it: online people play to win, so expect to face dozens of gold War Machines, red Venoms and orange Hulks. If you thought the first few weeks of Marvel Vs Capcom 3 were a nightmare, between Dante and Sentinel, you have no idea what to expect here. Not to mention that Marvel Vs Capcom is already quite different from its most recent sequel: the teams are made up of only two fighters, instead of three, and another can be chosen from a list of extra characters destined to appear for a moment on the screen to attack and disappear immediately. But this is where the borderline super moves and infinite combos started to appear, so fans of Marvel Vs Capcom 3 will feel a little at home. The gameplay of Marvel Super Heroes, on the other hand, is a little more traditional: it doesn't existtag-team but normal one-on-one fights; on the other hand, the infinity gems of Thanos' glove appear randomly on the ground: by collecting them, it is possible to enjoy a temporary power-up that can regenerate lost energy or make characters faster, stronger or more resistant. Collecting the right gem before our opponent is crucial, but as you may have understood it is difficult to imagine a more unbalanced fighting game when an already very powerful Hulk is able to move faster and deal even more damage than usual.", "date": "2012-10-19", "grade": "6.8"}