{"name": "Doctor Who: L'orologio dell'eternit", "ref": "https://multiplayer.it/recensioni/109856-doctor-who-the-eternity-clock-geronimo.html", "text": "Right from the start, Doctor Who: The Clock of Eternity almost seems to catapult the player into a typical day of the Doctor. Needless to say, the adventure opens with the Tardis tumbling through spacetime, accompanied by that musical theme which, albeit with various reinterpretations, has opened one of the most popular science fiction series on British TV for almost fifty years. This isn't the first time the BBC franchise has been used for a video game, let's be clear, but in recent years attempts to get to consoles have resulted in terrible Wii and DS titles, despicable graphic adventures and a barely decent puzzle game for iPhones. This time the intention was to follow the simplest path, creating a 2D platformer with a minimum of environmental puzzles and some enemies to face, while the boundless imagery of Doctor Who would have taken care of catching the fans, from time travel to war with the Daleks, from the Cyberman army to open doors using the infallible Sonic Screwdriver. Unfortunately, after being beaten by critics at the release of the PS3 version, The Clock of Eternity arrives on Vita in an edition that not only keeps intact all the flaws and problems of the console counterpart, but even manages to make worse. Evidently there are things that not even a Time Lord can solve. Shall we play Doctor? After the initial theme song, the scene passes inside the Tardis, with the Doctor struggling with yet another breakdown. Obviously we are talking about the eleventh incarnation of the character, the one played by Matt Smith in the last few seasons of the popular TV series. However, Smith has not only lent his face to his virtual counterpart, but has also dubbed all the dialogues of the adventure, a plus considering that the game is chock full of the typical nonsense conversations and crazy monologues that characterize each episode of the series. The music explodes as you exit the cabin, and starting the first level to the tune of I Am The Doctor, one of Doctor Who's most epic themes in the 21st century, will be enough to excite fans of the series. With the combination of the original voices and the excellent music composed by Murray Gold, the sound component is perhaps the only truly successful element of The Clock of Eternity, since everything collapses after just a few seconds of gameplay. Through dull platforming sessions and some puzzles in which you simply move boxes and activate switches, the player is called to cross London in different historical periods, while in the four chapters that make up the single-player story we find ourselves face to face with some of the the Doctor's most iconic enemies, such as the Cyberman, Silurians, Daleks and the Order of Silence. In some fixed points you are asked to impersonate River Song, and many of the puzzles require the cooperation of the two characters and their particular gadgets: in particular, River can use the gun to break chains and destroy windows, while sneaking behind enemies can knock them out. with a single soporific kiss. It is immediately evident how the level design, however approximate and confusing, is designed for two players to interact with each other, but unlike what was seen on PS3, the Vita edition completely lacks the multiplayer mode. Played in single-player, The Clock of Eternity is a very frustrating experience, also and above all due to a slew of bugs which on several occasions forced us to restart the game. One of the most sensational examples sees River Song committed to surviving for 10 minutes while the Cybermen besiege the London underground. After repeating the mission countless times due to too frequent and poorly placed enemies spawning, the last attempt only succeeded because, ironically, a new error made all enemies disappear from the screen for the entire duration of 10 minutes, allowing us to pass the level by simply standing still and waiting. One of the novelties of this version for Vita concerns the implementation of some mini-games to interact with via touchscreen, but in addition to being very trivial challenges, in some cases they are also the basis of the most frustrating moments of the adventure. Everything is due to the fact that the action continues to flow while you are dealing with the various mini-games, with the risk of being attacked from behind without even realizing it. From an aesthetic point of view, it was not enough for the Supermassive Games graphics to use the Unreal Engine to set up a visually pleasing game, and the fault lies above all with a London made in a bare, repetitive and uninspired way.", "date": "2012-10-17", "grade": "4.5"}