{"name": "La politica del distruggere", "ref": "https://multiplayer.it/recensioni/109769-liberation-maiden-la-politica-del-distruggere.html", "text": "By now we are used to it: there are so many video games and anime that have staged a future Japan brought to its knees by an alien attack, that ascertaining the fact that Liberation Maiden starts from these same premises is neither hot nor cold. The cards on the table, however, change as soon as it is discovered that the person designated to repel the attackers is none other than the young newly elected president Shoko, who launches into battle aboard a winged mech determined to free her nation and avenge the recently deceased father. So let's see if the Grasshopper and Level 5 shooter manages to combine these intriguing premises with an equally valid play structure. President we are all with you Released at home in May of this year as part of the Guild01 compilation, Liberation Maiden is offered individually on the Nintendo eShop at a rather attractive price, and it could not be otherwise given that the product's content offer would have been objectively too narrow to a retail title. Taken for what it is, instead, the latest creation of Suda51's visionary mind turns out to be a pleasant divertissement, albeit far from the complexity and ambitions of the Japanese designer's most successful projects. The game doesn't get lost in chatter too much, and a short but intense anime-style introduction is the only sugar given to the user before throwing him into the fray: fortunately, the mechanics that underlie the gameplay are simple as is the system control, and to feel at ease in Shoko's shoes, just follow the instructions in the few text boxes that act as tutorials. The analog stick is used to move the vehicle, with the possibility of performing a comfortable lateral strafe by combining the pressure of the left backbone, while to fire, simply trace the desired trajectory on the touchscreen which will be faithfully reproduced on the upper screen that frames the action of game. There are two primary weapons made available: multiple hook-up rockets that work exactly like in Rez and a continuous flow energy beam that follows the direction given by the user, but there is also room for the inevitable smart-bomb made up by an explosive lightsaber that recharges as you take down enemies. Another peculiar feature of Liberation Maiden concerns the shields that protect Shoko: in essence, the use of offensive tools gradually consumes the charge of the defense system, which vice versa fills up when the blows are successful and in a especially when making chain attacks. An ingenious system that discourages a head-down approach, forcing instead to face opponents with that minimum of strategy useful to give a little more bite to battles: the effects of this mechanism are however felt in a really marked way only at the maximum level of difficulty, given that in other cases Liberation Maiden is a health walk ... and not too long. 3D effect Although it is a title with production values calibrated downwards as far as the aesthetic sector is concerned, Liberation Maiden can boast a depth of the three-dimensional effect that is much more convincing than many much more important games in terms of budget: in this sense, the developers took full advantage of the three-quarter shot cut, which allowed them to use the console's 3D screen to make the gap between Shoko and the other flying elements with the scenery and ground structures more marked. Good thing Shoko is there Even considering its nature as a downloadable game and the price at which it is offered, it is useless to deny that Grasshopper Manufacture's is an objectively very short shooter even for the non-exemplary average of the genre. With five stages that are completed in about fifteen minutes each, it is easy to reckon on the duration of the single player adventure, assisted only by a stage attack mode useful for improving one's scores: the (totally) unjustified absence in this sense is an online leaderboard that would have increased the value of the challenge, while an extra section peeps out in which to see cutscenes, artwork and documents that provide a minimum of background on the plot. However, it is a matter of trinkets, for a product that more than many others perfectly embodies the prototype of the good game that does not last long. And yes, because it must be said that Liberation Maiden is a fun, frenetic shooter with a solid play structure and a good amount of destruction on the screen. The levels consist of large freely explorable arenas, interspersed with three main missionsi and a sub-mission that the user can decide to face or ignore: the objectives are always very simple, and generally expect to destroy all the enemies in an area to summon the mini-boss on duty, who always assumes the shape of a kind of drill to be destroyed piece by piece. The last assignment of each scenario instead consists in the clash with an opponent of generous dimensions and characterized by attack patterns and defense systems different from all the others, and it is here that Liberation Maiden gives its best, staging adrenaline-pumping battles, well structured and also discreetly stimulating and spectacular: Suda51's eclectic touch is not missing, embodied by the so-called Sacrifice Drive, or Shoko's final blow, a kind of kamikaze attack that can only be successful if the user draws fast you search on the touchscreen. It's a pity that the player's destructive work is visually reproduced by blocky graphics, with scenarios characterized by a limited and generally poorly defined visual horizon, further and more glaring proof of the low-budget tenor of the project: a sort of ~I wish but I can't~ which reaches its climax when Shoko purifies an area of enemy presence, an event that leads to the awakening of nature represented by a flowering of unwatchable green cubes...", "date": "2012-10-16", "grade": "7.0"}