{"name": "Gocce di fiaba", "ref": "https://multiplayer.it/recensioni/109719-the-unfinished-swan-gocce-di-fiaba.html", "text": "Having filed the disappointing Datura, Sony and Santa Monica Studios continue in the search for the most interesting independent teams to build an ~alternative~ offer to the usual franchises on the PlayStation Network. In the case of The Unfinished Swan, the Japanese house was favorably impressed by a tech demo released in 2008, which precisely showed the starting concept of the title developed by Giant Sparrow: a first-person adventure in which you have no knowledge of the space that surrounds us as completely white, and so we need to throw drops of ink to color the outline of the objects and figure out where to go. We were really curious to get our hands on this original and particular production, above all because of the many questions about its structure and gameplay, and we must admit that the final result not only surprised us but really conquered us. But let's go in order. The experience of The Unfinished Swan is presented to us as a book of fairy tales, whose pages tell the story of a child named Monroe who, at night, sees the painting of the ~incomplete swan~, the only memory of his mother, taking life and escape through a magical door. Monroe follows in the footsteps of the swan and is projected into a completely white place, whose outlines cannot be distinguished except by using a brush to throw drops of black ink around. Why is it there? Where has the swan gone? We will discover it through four chapters of pure videogame experimentation, in which original concepts are introduced and others already seen in the action puzzle genre are reworked. Everything is held together by the impeccable direction of Ian Dallas, who never seems to lose his train of thought and leaves nothing to chance. Furthermore, in the case of the local edition, the excellent narration in Italian certainly helps to push certain emotional keys, in a crescendo that finally shows its cards and leaves us satisfied, even moved, despite the brevity. Sympathetic ink Finding out how the developers have carried out their ideas in The Unfinished Swan is in itself one of the strengths of the experience, but it is impossible for us not to talk about it, albeit briefly, in the review. In fact, each of the seventeen or almost seven stages introduces some new element capable of shuffling the cards on the table, increasing the variety of the action and avoiding dead spots with class in which we were practically certain to come across. As mentioned, at the beginning of the game you find yourself in this completely white, aseptic environment, and to understand its connotation you have to shoot ink drops around. At that point walls and objects acquire a minimum outline and the path to be taken can be distinguished, looking for the footprints left by the swan during its mysterious escape, the colored balloons (which can then be spent for the purchase of various bonuses) or the letters d gold on some walls, which once hit ~open~, telling us a new part of the story. However, this does not continue until the end: after an unexpected dip in the water, Monroe's brush begins to splash nothing but drops of water, and so the initial dynamics become more complex, because the liquid does indeed reveal what surrounds us, but only for a few moments before drying. Therefore, mechanisms to activate and numerous platform sections intervene in which you jump from one wall to another, from one shelter to another, trying not to end up in the canals that make some areas of the kingdom a sort of small Venice. To err is human, but ending up in the water only translates into a very temporary ~game over~ and a quick restart: the title of Giant Sparrow wants to tell us a fairy tale using puzzle mechanics of various types, but never in a punitive way. Playstation 3 trophies The Unfinished Swan contains a total of ten Trophies. Getting them is quite simple: just complete the four game chapters, reveal all the pages of the ~book~ from which you access the stages, create blocks at certain heights and complete some basic actions. Straight to the bushes At a certain point, the drops of water that we can throw become a fundamental means for growing some miraculous climbing plants, on which we can climb to overcome otherwise insurmountable obstacles. We've learned that there are virtually no limits to the development of these plant wonders, so if you find yourself bogged down at some point go ahead and water them: something is sure to happen. From ink to water, passing from vines like new assassins who scale the facades of very tall buildings, the gameplay of The Unfinished Swan finds in the final part theand its more virtuous and refined applications, such as when the concept of light becomes so important that we are forced to never deprive ourselves of it (on pain of being attacked by dangerous spiders that live in the shadows), or when we revisit an interesting puzzle section which remember the one seen in Assassin's Creed Revelations, with the possibility therefore of creating polygonal structures from nothing and being able to walk or jump over them to reach their destination. In short, for a handful of hours we find ourselves unexpectedly busy doing new and original things, visiting a scenario that acquires greater charm as the adventure continues, also and above all thanks to some magnificent panoramas from above. The control system provides for three possible configurations: the classic Dual Shock, the PlayStation Move alone or the combo consisting of Move plus Navigation Controller. In the first case, needless to say, the experience perhaps loses in immediacy but gains in comfort and precision, especially during the platform phases. Playing with the Move the approach is more ~casual~, if you will, and you can throw the drops more quickly, but this is a far from essential requirement. Finally, the presence of the Navigation Controller allows us to be able to move the character more freely and scroll through the menus without having to resort to the traditional pad. In any case, it doesn't seem to us that Giant Sparrow's game represents a valid reason for buying the motion-sensing peripheral for PlayStation 3. Finally, as regards the technical aspect, it is clear that we are faced with an exercise of style rather than a demonstration of strength, and in this sense some slight uncertainties of the graphics engine can only surprise, given the almost total absence of textures to manage. However, there are some images that alone are worth the price of the ticket and confirm the artistic quality of this production, together with an excellent narration in Italian and perhaps essential music, but with a great atmosphere.", "date": "2012-10-15", "grade": "8.8"}