{"name": "All'arme", "ref": "https://multiplayer.it/recensioni/109685-royal-revolt-allarme-miei-prodi.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. A young prince is locked up by his father in a school of magical arts, with the aim of making him a legendary leader. When he returns, however, the king is dead and the kingdom has fallen into the hands of his evil brothers, who have divided thirty castles and have a powerful army to defend their walls. Will it be enough to stop the fury of a prince who wants at all costs to take back what is his? Characterized by a cartoonish and extremely pleasant graphic style, Royal Revolt! stands as a sort of ~reverse tower defense~, or a game in which our goal is not to manage a series of stations trying to resist the attack of enemy troops, but the opposite. At the beginning of each mission we find ourselves in the role of the prince and we must call a certain number of troops to accompany us in our assault, destroying everything in their path, whether they are soldiers in the pay of our evil uncles, towers, walls and finally castles. As mentioned, during the story mode we will find thirty of them, better and better defended and surrounded by troops with different abilities, which often require particular tactics or maneuvers in order to defeat them. The control system adopted by flaregames recalls that of the RTS, asking us to touch on the screen the point towards which we want our character to move, while his allies follow him undaunted. Let's say right away that this solution basically represents the only questionable element of the entire production, because a classic virtual d-pad would have made certain maneuvers, especially those performed in an emergency, much simpler and more immediate. The Castle Breakers Only one flaw? Well yes, beyond a sound sector that could perhaps accompany the action in a more engaging way, there is very little to complain about Royal Revolt!, a title that is not only very beautiful to look at but also fun to play, thanks also to a solid and full-bodied structure, which progressively unlocks new spells for the prince, new soldiers and new upgrades. The interface appears well laid out and works perfectly: in the lower left part of the touch screen there are the icons that are used to recall the various types of units (whose availability is regulated by an indicator that fills up over time), while in the lower right part there are the buttons for activating the spells, each with a different cooldown. At the top center there is a scheme that indicates the position of allied and hostile troops, while at the top left there is the icon of the prince, which once pressed acts as a reminder for our units. The action soon turns out to be anything but trivial: the continuous turnover among the enemy ranks forces us to make wise use of defense and attack spells, taking advantage of downtime to attract new allies and trying never to get caught unawares. If the prince is defeated, however, it is possible to bring him back to life by spending a few gold pieces. And speaking of coins, Royal Revolt! makes a really correct, almost naive use of its free use: although it is possible to spend real money to buy tokens with which to upgrade units, the reality is that the simple completion of missions, perhaps with a couple of attempts to obtain out of all three stars, that's enough to provide us with the currency necessary to go all the way.", "date": "2012-10-13", "grade": "9.2"}