{"name": "Law & Order: Giustizia  Fatta - Recensione", "ref": "https://multiplayer.it/recensioni/law-order-giustizia-e-fatta-recensione.html", "text": "Is justice the same for everyone? Unfortunately in real life the answer is no, but in this game our job is to do our best to get a murderer what he deserves: a due process that lands him behind bars. It all begins when a young tennis player finds the body of her colleague Elena Kusarova in the locker room of the training camp at Flushing Meadows in New York. Every detail immediately suggests a murder, and it is at this point that detectives Lennie Briscoe and Ed Green, of the 27th police district, enter the scene, who will have to carry out meticulous investigations in order to deliver the culprit of the alleged murder into the hands of lawyers. . As tradition of the TV series, the game is also divided into two clear and well-defined parts: the investigative part where the detectives have to collect the evidence necessary to nail the perpetrator of the crime and the procedural part, where the player will have to help the district attorney Serena Southerlyn to get the just conviction for the murderer. [C] As you can see Briscoe is the only one who has a strong reputation. similar... but not too much! John McEnroe gives a great cameo playing... Patrick McEnroe! [/C] [C] Claire Thomas, arrogant and arrogant young tennis player. Reminds me of someone! Strange, I don't know that this model has video calling... [/C] Where were you on the morning of the murder? What strikes you first of all about ~Law & Order: justice is done~ is the ability to make the player identify with the New York police universe right away, starting from the introduction in full motion video that recreates the theme song of the series TV complete with unmistakable musical theme (not to mention the famous cynical puns that Briscoe allows himself as soon as he has the opportunity, sometimes even looking towards the camera, as if to seek our complicity). Initially in the role of the two detectives Lennie Briscoe and Ed Green, the player begins his game at the scene of the crime, where he has the first opportunity to get hands on with the game mechanics, which are actually not at all complex. The interface, which practically follows all the canons of point-and-click adventures, stands out right from the start of the game for its intuitiveness and convenience, as does the inventory, from which you can access four categories of elements: witnesses, evidence , analysis of evidence and documents. At any time, thanks to a handy pull-down menu, you can access the city map, the mobile phone (with some characters you only have telephone contacts), a detailed log of the events and the main menu of the game for loading, saving or exiting. The game mechanics can be a bit repetitive in the long run, but they never get really boring and manage to make the user feel like a real New York policeman. In addition to exploring the environments to collect valuable evidence, it is vital to question witnesses and suspects, asking them the right questions. In addition to exploring the environments to collect valuable evidence, it is vital to question witnesses and suspects, asking them the right questions. Where were you on the morning of the murder? Choosing the wrong questions never definitively leads to dead ends, but by following the right path, interesting additional information can be collected. At any time you can go to the office and fill in the appropriate forms to obtain various results: have the evidence collected analyzed in the laboratory, find more detailed information on the evidence collected by the research center, have a doctor draw up a psychological profile of the suspects, have suspects watched to monitor their movements, ask for search warrants or arrest warrants (provided you have the necessary evidence, otherwise the judge will not sign the documents). The puzzles, of medium difficulty and quite varied, do not have an obsessive frequency and are always well integrated into the context and plot. To meet gameplay needs and not make the player suffer dead moments, particular expedients that are not exactly realistic are adopted: for example, the result of any laboratory test, psychological profile or surveillance is made available a few seconds after the forwarding of the request. A speed that even the Flash would feel embarrassed about. In the second part of the game, although some investigative elements persist, the attention is focused on the trial, which must be faced in the role of the prosecution. To nail the culprit it is vital to carefully choose the evidence to be presented and ask the right questions, as defense attorney Morton seems well equipped to dismantle any invective. Graphics and sound Analyzing Justice is done from the point offrom a technical point of view, especially from a graphic point of view, it is necessary to remember that we are talking about a game originally released a year ago, for which we therefore have to go back a bit in time with the terms of comparison. The clarification is actually made purely for the record, because the Legacy Interactive title, while not particularly shining under any point of view, does not disfigure even in the presence of more recent productions. The atmosphere so familiar to lovers of the small screen is simply perfectly transposed, and the only real flaws can be found in the discreet 3D models of the characters: in addition to not always being completely similar to the real actors, they sometimes bare their sides to some rough animation and sometimes imaginative lip-syncing with the dubbing. The only usable resolution is 800x600. Even the sound sector shows good things but it is not without flaws. The dubbing, largely entrusted to the real actors of the TV series, is superb, but given the circumstances there is nothing to be surprised about (you can tell me how hateful the tennis princess Claire Thomas is). Also great is the tennis legend John McEnroe, who we find in polygonal form to interpret the coach of the victim, Patrick McEnroe. The more tennis savvy among you will know that Patrick is his real middle name. The music, taken directly from the small screen, including the unmistakable opening theme, gives the right atmosphere while being a bit repetitive in some sporadic circumstances. The real flaw in the sound aspect of Law & Order is the low quality of sampling of the dialogues, which especially in some specific cases is noted for the ~croaking~ effect, which could annoy players with the most demanding auricle. [C] One of the most important characters hate the game. Who has some skeletons in the closet? Even a seemingly useless parrot could reveal valuable information [/C] The TV series Dick Wolf The crime TV series ~Law & Order~ was created in 1990 by Dick Wolf, is set in New York and has the particularity of treating each crime from two different points of view: that of the detectives of the 27th police district, who collect trials and find the guilty, and that of lawyers and prosecutors who then have to try to obtain conviction for the defendants. With very rare exceptions, each episode is a small chapter in itself, since there is no narrative continuity between one episode and another, and from one series to another the cast of actors is often changed to ensure dynamism to the show. Although in Italy it has not become famous at the levels of CSI, E.R. or other telefilms of the kind (also due to an unjustified lack of trust on the part of our broadcasters), in the United States Law & Order immediately enjoyed great success both from the point of view of critics and from that of audience, so much so that in 1999 producer Dick Wolf decides to create a parallel spin-off series called ~Law & Order: Special Victim Unit~, focused on solving sexual crimes. Even the success of this derivation from the original series was not long in coming, and in 2001 the second spin-off called ~Law & Order: Criminal Intent~ was created, starring the excellent Vincent D'Onofrio (the soldier Ball of Lard from Full Metal Jacket), where the emphasis is placed on the psychological aspect of criminals. Instead, the creation of a further chapter in the series, ~Law & Order: Trial by Jury~, in which the attention is focused on the political-judicial ties of American society, dates back to this year. Despite competition from fierce rivals such as CSI and its own spin-offs, the main Law & Order saga is now in its sixteenth season, second only to Matt Groening's indestructible Simpsons in terms of TV series longevity. A more than discreet graphic adventure, which manages to make the player identify with himself and make him feel part of the New York police and legal system. Divided into two sections, Law & Order almost never loses its edge thanks to the right atmosphere, an apt succession of events and sufficiently difficult but not obsessive puzzles. A real must-have for lovers of the TV series, and a product to be taken into consideration also for all lovers of graphic adventures in general, who could find a welcome surprise in a little-advertised product like this. N.B. The game undoubtedly deserved a better Italian adaptation. A skimpy two-page html ~manual~ isn't enough: this title was at least worthy of subtitle localization. Also in the original version of the game it was given as a giftbundle the first chapter of the series, ~Dead on the money~, of which there is no trace in Italy. A real pity. Pros Quite engaging, it makes the player identify with the role Sufficiently long-lived Atmosphere and charisma of the TV series Cons Completely in English, including subtitles With a little more care the 3D models would have been much better In the Italian version the first game in the bundled series As we all well know, the point and click graphic adventure genre is no longer on the crest of the wave as it could have been two or three decades ago, but despite this, different exponents of the genre try every year to gain the attention of gamers, with results quite alternate. Last October, Vivendi Universal Games released in the US the third game that can boast the franchise of the crime TV series ~Law & Order~, called ~Justice is served~. After about eleven months of exile in limbo, Microids Italia also brings this title to the Bel Paese. Finally!", "date": "2005-09-30", "grade": null}