{"name": "Shredders", "ref": "https://multiplayer.it/recensioni/shredders-recensione.html", "text": "We are now at the end of winter, but the Shredders review reminds us that it can always be the right time to launch yourself down snow-capped mountains aboard a snowboard, with the return to the scene of a genre that has practically disappeared from the radar. Yep, what happened to snowboarding games? In the early 2000s there was the sacred triad that dominated the genre with 1080, SSX and Amped, three series capable of bringing snowboarding to the covers of sector magazines, even representing large-caliber releases for the winter period, but subsequently even this type of game has fallen into ~disgrace~, finding a home in much more modest and underground environments. Not that this represents a problem: indie productions have still managed to offer interesting games while also enjoying greater creative freedom, but it is clear how the weight of these titles has become much smaller, in a market increasingly divided between standardized maxi-productions and independent ones. Right from the full indie buzz comes Shredders, a game on which the FoamPunch team has been working for years and whose evolution we have followed with a certain constancy, since it is also a special watch among the games arriving on day one on Xbox Game Pass , in other words on Xbox and PC. After various postponements, it managed to arrive just in time for the winter 2022 closure and currently represents one of the best examples of a snowboard video game. Well, in fact it's also practically the only recent snowboarding game, at least according to the classic conception of the genre, with the exception of Ubisoft's Steep. In several respects, however, Shredders distances itself from tradition, trying to get closer to simulation or at least to a more technical interpretation of snowboarding, thus remaining far from certain drifts typical of Amped, SSX and 1080. Two madmen below zero Shredders, a screenshot of the game from a replay There is also a sort of story to follow, through various missions that lead us to discover new settings and characters in Shredders. It is certainly not easy to build an interesting narrative on such a topic, but FoamPunch managed by focusing above all on sympathy: in the game we play a promising young snowboarder accompanied by the ubiquitous ~Scotty~, a sort of improvised cameraman/manager, which gradually pushes us to get to know various stars (even real ones) of this sport by putting us in rather crazy situations. Being absolute nobodies in the field, the fastest way to make yourself known to the public is to burst onto the scene in a crazy and spectacular way, introducing ourselves into races without a permit, destroying flags scattered on the tracks and other very unconventional systems, all to be filmed and published on YouTube to gain new followers. Each mission introduces objectives of this type, as well as putting us in contact with professional snowboarders (some of whom have lent voices and movements to the game) who illustrate new maneuvers and open up other areas to explore on the mountains, in a progressive opening of the scenarios and possibility of playing in the ~career~ mode. There is a coarse-grained humor behind all the intermission skits, sometimes so forced as to flow into pure cringe, but a game of this genre that does not take itself seriously, despite being damn demanding as far as it concerns performance on snow, given that the average level of difficulty is absolutely not to be underestimated. On the snow Shredders, a gameplay scene Shredders seeks a mediation between the arcade approach and the simulation, but in principle it is closer to the latter than to the standards of the old SSX and the like. What makes it more realistic (again taking into account that it is a rather labile interpretation of reality) is above all the simulation of physics, which perhaps never as in this game intervenes in a convincing way in managing the movements of the character and the reactions to impact with the snow. The controls are mainly based on the use of analogs, with the left hand managing the movements of the body and the right hand those of the board, together with the backbones for the grabs and assorted combinations for the numerous standard tricks to be performed, but you can forget the exaggerated combos that characterized games of this type in the early 2000s, because here the jumps are more concrete and the seconds of time to execute the maneuvers are somewhat limited, with the physics of the impact upon landing which is always ruthless. All this translates into the need of quite a bit of training to be able to achieve high-level performances and scores, but also in a considerable satisfaction given simply by the riuski to ring some tricks not too flashy but maintaining a flow of movements as regular as possible. Shredders, a screenshot in the middle of a trick On the other hand, this ~simulation~ use of physics returns excellent sensations even just from the descent, with a good yield of the contact of the boards with the different surfaces between groomed snow, fresh snow, ice and so on, convincingly transferring us to his wonderful mountain landscapes. In principle, this approach tending to simulation and also the control scheme are somewhat reminiscent of Skate and in fact Shredders could be a consideration for the EA title as far as this sport is concerned, filling a niche that certainly has its own public. Modes and styles of play Shredders, an image during a grind There is the possibility to explore the seven mountain areas in a free way as in a sort of open world on a snowboard, to follow the missions progressively within the story or to engage in single missions on specific objectives, in addition to taking part to multiplayer sessions in the shared online world. All this should be easily accessible from a general menu of options, if only it were understandable: let's say that Shredders communicates its being out of line also in terms of interface, if you will. The options are not perfectly understandable also due to the confusing way in which the various modes are identified starting from their very name, to which we must add a real disaster in the Italian localization that mixes - at least for the moment and waiting for any corrections via patch - our language in Portuguese in a rather casual way. The story mode is certainly the most engaging, because it is structured in such a way as to be more spectacular, with a succession of missions designed to show the most daring and adrenaline-pumping moments that can achieve on the digital snowboard. However, there is perhaps an excessive fragmentation, with missions that are far too short and fragmented, as well as a certain lack of indications on what to do and above all not to do, given that sometimes you find yourself cut off from the race without understanding exactly what it happened. Shredders, an image of a moment in the air Let's be clear: in an era dominated by invasive HUDs, constant tutorials and guided steps, these gaps are also positive, but a greater study on the level design of the missions would be appreciable, considering that to savor freedom there is still the open mode, which end is probably the best gaming experience. Also the multiplayer is not fully understandable: the playing area is a shared online open world (in case you keep the option for multiplayer turned on) and it is possible to find players around the slopes, but there don't seem to be any specifically structured challenges for multiple players at the same time, beyond going down or pulling tricks together. A raw crystal Shredders, an overview of one of the mountains The look is notable in Shredders, which presents a convincing representation of the snowy mountain, although obviously the scenario does not present great complexity in terms of modeling and graphic variety. The seven explorable areas are however characterized by different elements that make them somewhat unique and the rendering of the snow is also remarkable, with a realistic texture in contact with the snowboard and truly remarkable refraction effects and light reflections, as well as some atmospheric variations which modify the lighting system and visibility. However, there are also many technical imperfections that can be detected: from this point of view, it is clear that the game derives from an indie production of modest dimensions. The care with which scenarios and riders are created is remarkable, but there are obvious limits in the technical implementation: the performances are never constant and, although they are not particularly problematic, the drops in frame-rate are perceived (although the test was carried out on Xbox Series X with VRR in action), moreover there are also frequent phenomena of pop-in and visible construction of the scenery elements over the distance. Shredders, a screenshot showing something of the lighting system These are imperfections that could easily be corrected with post-launch updates, but at the moment they hinder the enjoyment of the game a bit. Otherwise, in addition to the confusing interface we mentioned, the characters are quite well animated, despite the fact that are all practically the same being represented only with a mask and balaclava. Also in this regard,we must mention the self-irony with which the developers make a character say that he wears the headband due to the ~laziness of the game designers~, underlining how this solution has made it possible to avoid the modeling of faces and other complex elements of the riders. Pleasant, but without particular exciting moments, also the original soundtrack, as well as the audio accompaniment in general.", "date": "2022-03-20", "grade": "7.4"}