{"name": "Un pianeta tutto mio", "ref": "https://multiplayer.it/recensioni/108685-ecolibrium-un-pianeta-tutto-mio.html", "text": "It is not the first time that we have dealt with free software for PlayStation Vita, and it must be admitted that so far there have been no major disappointments. After Frobisher Says! and Treasures of Montezuma Blitz, Ecolibrium is a solid addition to a far from obvious playground, though probably not enough to stabilize the console's delicate commercial situation. Moreover, unlike the titles mentioned, Ecolibrium is definitely not a ~casual~ product: in fact, it aims at a precise and restricted circle of users, those enthusiasts of simulators and managerial who rarely come across titles of this type in the console field, let alone on laptops. It is therefore not a title for everyone, but given that it is free, weighs little (just two hundred mega or so) and does not require a lot of time to dedicate to it every day, it is worth giving it a chance. genesis The universe (indeed, the multiverse) of Ecolibrium has a clean and colorful appearance, but don't expect a marvel of graphic technology: exploiting the power of the Sony console in these terms is not its purpose, yet the audiovisual sector turns out to be unexpectedly pleasant , thanks to a good attention to detail, especially as regards the environmental sound effects which also include a good variety of atmospheric conditions. The setting deliberately recalls our planet, but plants and animals are decidedly alien: despite the obvious references to really existing creatures, such as horses or lions, the style of these extraterrestrial animals is decidedly spot on. Pressing the R key allows us to enter a free visualization mode: by moving the console in real three-dimensional space it is possible to observe our world at three hundred and sixty degrees, a feature which not only increases the degree of immersion, but which allows us to see from nearby the fruit of our work. And whatever exists in this world is our work, from the smallest plants to the fiercest predators. Someone will probably remember Black & White, a historical management of 2001 made by Lionhead Studios and Peter Molyneaux; the two games are similar in the premise, although developing in a completely different way: you are essentially the God of this world and you can shape it at will, or almost. All in all, as gods you suck a bit because there are various limitations to curb your creative powers: money and energy, first of all, but also the precarious balance of the ecosystem you have created. Being a Creator is a serious matter, and the concise but clear introductory tutorials, completely in Italian, constantly remind us of this. Furthermore, our progress can be shared with our friends on the PlayStation Network, in a sort of leaderboard that allows us to find out who is the best Creator in the universe. PSVita trophies As if that weren't enough, Ecolibrium also offers a fair number of trophies: 7 bronze, 4 silver and 1 gold. Unlocking them is not easy at all: for example, you have to complete some challenges, meet specific ecosystem requirements, exchange creatures with other players and rank in the top 100. From great powers... But what really is Ecolibrium? As we have said, it is a game halfway between a simulator and a management system and, as you will surely have understood, your role is to create a functioning and balanced ecosystem, as the title suggests. Doing so is, apparently, very simple. The game offers a few menus, intuitive and essential, through which it is possible to know the situation of our planet and choose what to add to the environment. There are parameters and ratios, however, to keep in mind. For example, the ecosystem must have a certain level of moisture and minerals in the soil and to control this we will have to plant trees and mushrooms of various kinds. But too many trees would excessively increase the humidity, so something is needed that limits its expansion, such as herbivorous animals. By placing two of them we will ensure the continuity of the species, but also the extinction of the plants on which they would feed. This is where carnivores come into play, whose purpose is, of course, to feed on herbivores. But there are also larger carnivores that gobble up smaller carnivores, animals that feed only on fish and so on, each with its own ecosystem needs. Balancing everything following the food chain is not easy at all, even if it is possible to cheat with creatures and devices that directly alter certain parameters: these units cost a virtual currency that can be purchased in the digital shop or which is sometimes obtained by winning Challenges, ~ missions~ unrelated dto our personal ecosystem in which we will have to alter a critical situation with few resources and a time limit. Time, among other things, is the most ruthless opponent of the player: the device that allows us to create the various animal and floral units has a battery that is consumed within a few selections and takes about a day to recharge. This means that you can actually dedicate no more than a few minutes a day to Ecolibrium: if for some planning in advance can represent an appetizing challenge, for others it could be an excessive brake on the use of the title.", "date": "2012-10-02", "grade": "8.0"}