{"name": "Mazzate incrociate", "ref": "https://multiplayer.it/recensioni/108964-street-fighter-x-tekken-mobile-mazzate-incrociate.html", "text": "When it was announced more than a year ago, Street Fighter X Tekken somewhat surprised the whole world of avid virtual fighters. The style differences between the two games are in fact so evident that imagining a fusion seemed almost impossible. In reality, as we have seen from almost all the reviews, the result was more than satisfactory, in particular as regards the optimization of the fighters from the Namco Bandai title, rendered credibly even in the 2D version. As we know, however, the public has not shown the expected interest, perhaps because a title of this kind, in theory aimed at fans of both games, may have partially disregarded their expectations due to its certainly simplified and less technical approach (but , of course, not casual). A valid game therefore but perhaps without its own personality, abundant both in the Street Fighter saga and in that of Tekken if taken individually. Capcom, after the positive debut of two titles and a collection dedicated to Street Fighter, has decided to transfer Street Fighter X Tekken Mobile to Apple platforms, an almost inevitable destination given the large profit margins guaranteed by the famous online distribution channel . Better a few but... good? The first thing you notice when starting the Street Fighter X Tekken Mobile application is the absolute paucity of content present, (de) merit of one of the mearest menus ever. In addition to the online rankings screen, present on the left, the choice is in fact limited to the single mode, with only the arcade and training sections, the local multiplayer and via the internet via Game Center, the inevitable shop for in-app purchases, the setting the settings and finally the news about the game released by Capcom itself. In the sign of saving also the roster of characters, one of the prides of the console version (especially PS3, thanks to 3 more exclusive presences) and reduced here to 10 in total, 5 from the Street Fighter world (Ryu, Chun-Li, Guille, Hugo and Dhalsim) and as many from Tekken (Kazuya, King, Paul, Nina and Howrang). If you think that it is necessary to choose at least two fighters every time, the combinations of possible pairs become really narrow. The situation improves, fortunately, once the actual combat starts; the impact is in fact very positive and those who have played the home version thoroughly will feel at ease almost immediately. The interface, necessarily, is simplified and optimized to the maximum for touch devices, starting with the left virtual stick, precise as far as possible, ending with the classic 4 action keys (punches, kicks, special shots and cross tag). Both the stick and the buttons are then totally configurable, i.e. they can be positioned anywhere on the screen; in particular, however, the action keys are managed independently, which will please players accustomed to non-ordinary configurations. In terms of actual gameplay, if nothing or almost nothing changes regarding the nature of the clashes, always very spectacular and with a much higher than normal number of hits, the real revolution takes place in the management of the partner during the ~tag~ changes. In fact, in the console version of the game there were no major differences between the two selected characters, i.e. the ~first choice~, in addition to facing the fight first, had no other particular characteristics. In Street Fighter X Tekken Mobile, on the contrary, the selection of the main fighter is fundamental, because the reference life bar is exclusively his. The partner therefore does not participate in the fight normally but comes to the aid of the ally for a set time limit, after which he returns ~to the bench~. The time spent in combat depends on the amount of damage suffered but, and this is the real revolution, it can never end up KO. In fact, the end of the match occurs only when the main character ends his life, which recharges by a small percentage during the ~tag rest~ period. Naturally, should you find yourself in a situation where a first selection collides against a second one, the damage inflicted by the latter will normally affect the opponent's life bar. In this mobile adaptation, therefore, the whole game strategy substantially changes, favoring the attack phase when using the secondary partner and the more prudent one when the main character is competing. The gem system is then resumed, albeit reduced in quantity and quality, the functioning of which is similar to the ~perks~, and which are activated after a predefined combination of inflicted blows or parries. Whilethe work from a technical point of view can be defined as more than good, the comparison with the major versions reveals both a lower framerate and, above all, a less fluid management of the animations, with sometimes evident breaks. In terms of gameplay this will perhaps count for little but an attentive observer, also thanks to the very close-up shot of the fighters, cannot help but notice it. It should be noted that, at the moment, the online mode is practically unplayable due to slowdowns and persistent lag.", "date": "2012-09-28", "grade": "6.5"}