{"name": "Super Castlevania IV - Recensione Virtual Console", "ref": "https://multiplayer.it/recensioni/super-castlevania-iv-recensione-virtual-console.html", "text": "Castlevania vs. Vampire Killers The infinite story of this series was born in 1986, the year in which Konami introduced the adventures of Simon Belmont, a vampire hunter on the trail of his most bitter enemy, Dracula, to the videogame world. Super Castlevania IV (first public release for the Belmont family on SNES) was released in 1991 and actually represents the remixed version of the very first chapter simply called ~Castlevania~ (or Vampire Killer, depending on the publishing console). The game probably represents the first real step towards the success of the saga in the West, expanding and improving the game structure proposed a few years earlier thanks to the new technologies offered by Nintendo's 16bit. Simon could now use his whip in eight directions, spin it infinitely in the desired direction, use it as a tool to overcome particularly large ravines, adjust the power and direction of the jump, and climb terraces suspended in mid-air. In addition to the main weapon, the player had the trusty sub-weapon (knives, boomerangs,...) available to the player, the use of which depended on collecting the classic hearts obtained by destroying the candles along the way. The game structure was different from the ~modern~ Castlevanias, Simon's adventure unfolded along 10 consecutive levels in which the protagonist passed settings (later to become true game classics) such as the city, the dungeons, the castle up to to get to the stairway that preceded the final battle against Dracula. A very important part of the title was played by the soundtrack, enriched with songs that have since made the musical history of this splendid saga, pieces such as ~Vampire Killer~, ~Bloody Tears~, ~Beginning~ and the by now very recognizable theme associated with Simon Belmont, now used in many other chapters of the saga. Castlevania vs. 800 Wii points Super Castlevania IV represented a real stepping stone for the series in the past, is this stepping stone still valid today? The answer can only be one: yes. Although the evolution in the field of consoles has been evident and important, it is also necessary to note that Castlevania is a saga that has refined over time, trying several times to make the generational leap without unfortunately any positive results. Castlevania is now hand in glove with the two-dimensionality of settings, characters and enemies, a two-dimensionality that has been able to perfect itself, smooth out but which in the end has remained the same as always. The game structure, perfect since its first release, fits perfectly with the Wii emulation via Virtual Console: music, animations and colors are the same as 15 years ago as if only a few weeks had passed since then . To play you will need: a classic controller (or gamecube pad) and 800 Wii-points, but above all a great dose of love for this series. By crippling a famous quote, history is being remade here. The Castlevania saga needs no special introduction, the name alone is capable of causing an unstoppable flow of memory made up of undead, bats, jellyfish heads and never tamed vampires. Castlevania has been able to write the story of a genre that is too often imitated and really never reached, and Wii - a console that looks to the future with a wink at the past - thanks to the Virtual Console will allow all players to play/replay Super Castlevania IV: a dive in the history of this incredible saga for the price of 800 wii-points (8 euros).", "date": "2007-02-19", "grade": null}