{"name": "Flower power", "ref": "https://multiplayer.it/recensioni/108923-lili-flower-power.html", "text": "The first work of the BitMonster Games team, made up of six former Epic employees, Lili arrives on iOS, showing off decidedly uncommon credentials: beyond the prestigious curriculum of its developers, the product can in fact boast a playful structure in many ways original and above all a sumptuous technical realization, made possible by the evident familiarity of the programmers with the Unreal Engine. In short, with such premises, missing the target may seem practically impossible: yet Lili, despite the undoubted merits, fails to fully convince. Lili Croft The story behind the game is simple, but functional to the creation of the ~magical~ scenario desired by the developers: Lili is a young botany student who goes to the island of Geos in order to collect and catalog flowers, but who soon she finds herself involved in the clash between the spirits who rule the island and their slaves, obviously finding herself on the side of the latter. An incipit that paves the way for a gameplay strongly focused on exploration and dialogues with the various characters of the place, but above all that has allowed BitMonster Games to literally indulge themselves with fantasy and polygons, giving birth to one of the visually best ever seen on iOS. In fact, the absolute fluency with which Lili's graphic engine manages extensive and luxuriant settings is surprising, characterized by extreme attention to detail and at the same time very generous as regards the visual horizon: all made even more pleasant by a wise using brilliant colors and lighting effects, and never giving rise to hiccups or dips in frame rates. The polygonal models and the animations of the protagonist are also excellent, a judgment that can easily be extended to all the creatures that you meet on your path, moreover outlined with a style that recalls Miyazaki's works on several occasions. By shifting the focus to the gameplay, however, the enthusiasm towards Lili unfortunately diminishes a bit, since it is a game that is basically boring in the long run. There is no other term to define a play structure that requires the user to walk far and wide across the island of Geos collecting flowers, opening chests and solving trivial secondary quests, interspersing everything with clashes that are anything but exciting with the spirits. Once an enemy has been identified, Lili has to chase him until she can jump on his back: from here the real ~action~ phase begins, in which you have to tear the bulbs that sprout from the opponent's back, being careful to avoid the malus and to fend off the bombs before they explode. A procedure that proves to be not very stimulating from the beginning - in addition to being badly assisted by an imperfect touchscreen detection - and continues without sudden changes until the more advanced stages of the adventure, when the length and difficulty of the clashes undergoes a drastic surge: a method like any other to favor the inevitable in-app purchases, which in this case translate into coins to be spent to improve the protagonist's skills or to buy useful items to simplify the fights. The alternative is to wander around the island even more than expected in search of hidden treasures, but that's not exactly quality time in gaming terms. It can be said that Lili has the ~only~ defect of not having a bite in terms of gameplay, because all the rest of the BitMonster production is at the highest levels: the aforementioned graphic quality is in fact followed by a sound up to par, a plot all in all interesting and peppered with well-crafted dialogues, a complete interface and an intelligent and functional control system, given that it is enough to give a tap on the screen to make the protagonist walk and swipe her finger to move the view and therefore the direction of movement.", "date": "2012-09-27", "grade": "7.0"}