{"name": "A tutto volume!", "ref": "https://multiplayer.it/recensioni/108936-rocksmith-a-tutto-volume.html", "text": "Music games have been one of the most successful trends between the last and current generation of consoles. Guitar Hero, between the PlayStation 2 version and then Xbox 360, Wii and PlayStation 3, has sold millions of units, made the general press write and interested in the news, so much so as to make one think of being faced with the new Pro Evolution Soccer. That is, that game capable of bringing together young people and adults, not gamers, in front of a television for evenings with friends and even alone, since it was a Mr. video game. The stubbornly annual serialization, the duplication of Rockband and the repetitiveness of the formula have decreed the end, demonstrating the fact that even a good game, even if it doesn't last for a short time, certainly cannot last forever. After that whirlwind and after much of the interest in the genre can be said to have waned, the development of a project like Rocksmith might seem strange: what's the point of yet another rhythm game now that nobody seems to be interested? Because Rocksmith is not just a game. It's a way, as fun as a game, to get close to a guitar and become familiar with the instrument or, better still, make a path that you've already decided to take more fun. Possible? Yes The technology behind Rocksmith is amazing. You connect an electric guitar (or an acoustic equipped with an electric or pre-amplified pick up) or a bass to a special jack/usb cable to the console or PC and you're ready to go. There is also a bundle with an Epiphone for those who don't already have an instrument, while bass is supported, but there is no package that includes it. The developed software, at that point, is able to interpret any note or chord played and translate it into a digital impulse that is transposed on a virtual neck in order to give an indication of which is the right key to press, the chord to play and, above all, whether the player/musician has to go up or down the strings depending on which note he is playing, if wrong. The main modality, as with other titles before this one, consists of a series of concerts in increasingly large and populated venues with fans. For each level, there are 11, more and more pieces are offered to play, for which a minimum of RSP or Rocksmith points must be achieved before moving on to the next concert and repertoire. It's not a game, you don't get interrupted if you get it wrong, and there are no special powers to activate. There are only the songs to play as best as possible, receiving an evaluation that leads, among other things, to unlocking mini-games (more on these later), guitars, basses and, above all, effects to be able to play in amplifier mode, i.e. the one that allows you to use your TV and console as a normal amp plus effects bank. There is no level of difficulty and each song is proposed either with the need to play single notes, by chords or in combos, more often alternating the single notes of the riffs with power chords. We start with Satisfaction by the Rolling Stones with Rocksmith asking to play a note every few beats, so as to become familiar with the neck. By playing correctly and stringing together sequences without errors, the difficulty automatically increases, until, on a hypothetical level, the song will be identical to the original in all respects (doing it is another matter, because it's not a game, in fact) . The surprising thing is that, if Rocksmith realizes that he has pushed too hard and that too many notes start missing, the difficulty is scaled back down, without interruptions or shocks. Whenever a new guitar technique is encountered in a piece, the possibility of carrying out the relative exercise immediately after the musical execution is presented. Exercise introduced by an example video and a series of examples. In this version, all texts, video tutorials and explanations in general have been entirely translated into Italian and in an excellent way, even if some are necessarily not exhaustive. Rocksmith's technology is such that, for example, when bending is required (i.e. when you have to pull the strings to play higher notes starting from the one you are actually pressing on the keyboard, with the typical sustain effect), on the virtual neck , not only is the exact fret to be pressed indicated, but the relative string bends, indicating to the player how far he must ~pull~ it while playing, so as to give a double visual reference. Playing for hours and realizing things like this, one can only be amazed and also involving a friend, since two people can play in multiplayer. Curiosity One of Rocksmith's problems is the delay with which the sounds of theguitar/bass sounds from the TV, latency or lag. Especially in amp mode, playing in time can become virtually impossible if you don't take the proper precautions. In the digital booklet, contained in the options, there are all the necessary indications: disable any TV video effect (super black, 100hz or +, etc.); turn off any additional audio effects; activate, if present, the game mode or the PC connection; do not use the HDMI cable and switch to VGA or Component. The difference is clear and, above all trying to play with headphones, the experience is completely similar to that given by a normal amplifier plus effects. Only when playing with the bass emulated on the guitar, given the sound conversion operation that the console has to carry out, does the delay exist significantly. So I don't have to go to class? Rocksmith is the best way to familiarize yourself with a stringed instrument (both bass and guitar), to launch yourself with a little boldness with techniques such as bending or muting, trying your hand at one of the over 60 songs that you normally a novice, it would not even occur to try to play. Rocksmith follows you, pampers you, partly explains you. Every single song can be played by slowing down its tempo, selecting the part that doesn't quite work out perfectly, be it by repeating its riffs, rather than the chords (which in fact can be learned). But is it possible to replace the smile of a teacher who says ~What the hell are you doing?~ or ~Put your hand like this and with the pick put the right intensity!~ with this software? The answer can only be negative also because there is no chord handbook, i.e. a simple vademecum in which each chord can be played repeatedly with a total list of at least the chords in first position or open (the chords are explained only when combined with the different songs , which you have to resort to if you don't remember how to play an E minor -Em-, rather than an A major -A) or even just because, if on the one hand the acronym of each chord is indicated when asked to play it, the notes of solos or riffs are not indicated, so that for a novice the 12th fret of the high E string will remain the 12th fret of the red string and may never become the E played an octave higher than the thinnest string played at empty. But there is no doubt that Rocksmith is an important tool and a fun way to help yourself learn and pick up an instrument, to press strings and understand the effect that playing with pedals, effects and amps that would cost a fortune bought individually. In short, one enters lightly into a world that can give great satisfaction. Playstation 3 trophies To get to platinum, you will have to sweat. In short, you have to achieve objectives such as finishing a master concert and scoring enough points to reach the last level - eleventh - among those available. Then there are the objectives that come from the mini-games and from the flawless concatenation of notes and chords which necessarily entail having improved one's skills as a bass player or guitarist (there are additional trophies for the bass mode, even in emulation). In short, it will take time, but Rocksmith will be able to reward you. Ready to play The package is also rich, given that there are some very effective mini-games, some pseudo-genius like a colums in which you have to move the blocks on a grid by performing slides on the ropes, which are undoubtedly cleverly designed to help you delve into some things (although it is not very clear how they are unlocked along the way), which are however explained with long video tutorials. The technical realization is essential, but clean and effective and, in the end, only the couple of things mentioned above are missing, an overview that makes it a real music course and you just have to be careful of the lag problem. clearly marked in the appropriate box. Maybe it won't be able to replace the complicit relationship that develops between a student and a teacher and it won't even be able to avoid the need to have the desire to sweat on an instrument, but Rocksmith is a good help and a brilliant idea that can bring tangible benefits to those who want to play a bass or a guitar. Perfect if combined with a specific study, even on its own it manages to remove fears, entertain and be an excellent purchase, if you consider that we are not talking about a real game. Also, pay attention to how you are with the set you intend to play on due to the lag, but, apart from a couple of things, which you find indicated in the article, here is what you need to feel special. Because that's what music does when you play it.", "date": "2012-09-26", "grade": null}