{"name": "Il Cavaliere Oscuro - Il Ritorno", "ref": "https://multiplayer.it/recensioni/108269-il-cavaliere-oscuro-il-ritorno-loscuro-passeggero.html", "text": "Gameloft has often been criticized for its lack of imagination, in this case the tendency to make more or less successful clones of the best titles available on consoles. However, we must give credit to the French house for having brought productions of a certain depth to the App Store and Google Play, which from a technical and structural point of view go far beyond the ~thought-chatter~ to which many skeptical gamers usually associate the mobile gaming. At the end of June it was the turn of The Amazing Spider-Man (here is our review), a very ambitious sandbox-style action game with many advantages, but afflicted by a series of technical and design problems that undermined its enjoyment. Staying on the tie-in theme, now it's Batman's turn with The Dark Knight Returns, a title that has already been available on American stores for a while but arrived in Italy a little late to wait for the release of the film, postponed to the end August due to the traditional ~abandonment~ of local cinemas during the summer period. The first images and the trailer had made us think of a sort of clone of the aforementioned The Amazing Spider-Man (the clone of a clone, it would have been a record even for Gameloft!), however things are different and the quality of this new product is undoubtedly higher in the points where the transposition dedicated to Spider-Man showed the side to obvious critical issues. But let's go in order... A dark knight's fate Let's start with the combat system: if in Spider-Man the fights were spoiled by terribly jerky animations and drops in the frame rate, which literally ruined the most action moments of the game, in The Dark Knight Rises things proceed in a decidedly more fluid and the homage to Rocksteady's work with Batman: Arkham Asylum is well preserved. In fact, just press the attack button to perform spectacular combos against opponents, who are automatically hooked, and act on the counterattack button if an enemy is about to take us by surprise while we are dealing with a colleague of his. It's all very simple and the necessary variety is also missing on the ~bad~ front, but in general we can speak of a well-implemented sector, which can have its say in the mobile sector. A similar argument can be made for the dynamics that regulate the movement of our character, also decidedly inspired by Arkham, with the grappling hook as the master for rapid movement and the Dark Knight's ability to glide from any height after jumping. Gameloft even wanted to exaggerate, trying to increase the variety of gameplay by introducing stealth sessions in which we can approach opponents from behind and knock them out silently. This type of maneuver works well, it must be said, but operating the movements necessary to take an enemy by surprise, perhaps while we are on the roof of a building, implies a precision and reliability of the touch controls which unfortunately do not correspond to the reality. In short, the commands work well but the interface is quite full and it is therefore reasonable to expect some uncertainty, such as happens when we drive the various bat-vehicles (yes, there are those too) or we are forced into questionable platform sessions . Without prejudice to these defects, certainly less evident if played on devices equipped with a larger screen, the experience proves to be not only fun but also decidedly full-bodied and demanding, with forays into the world of in-apps present that are not obsessive (and we would like to see , since it is not a freemium) and a really excellent technical realization.", "date": "2012-09-11", "grade": "8.2"}