{"name": "Infinity rage", "ref": "https://multiplayer.it/recensioni/108229-avengers-initiative-infinity-rage.html", "text": "Hulk smashes! But it doesn't just do that, mind you: as anyone who has seen the film ~Avengers~ will well know, but above all those who know the original comic, Bruce Banner's green alter ego had his ~smart~ periods, managing to combine strength and cunning in a deadly mix. It is precisely this version of the jade giant that we find in Avengers Initiative, an ~episodic~ action game developed by Wideload Studios and clearly inspired by the mechanics of Infinity Blade. A mysterious ~pulse~ has hit planet Earth, causing a blackout in SHIELD's security facilities and causing scores of dangerous super-villains to escape. Nick Fury declares a state of emergency and calls his Avengers, starting with the Incredible Hulk, who is sent to Colorado to investigate a series of anomalous detections. However, what the green giant finds on its path are not great mysteries, but a large group of hostile characters who try to make him angry... evidently they do not know that they would not like to see the Hulk angry! Among chosen Skrull soldiers, humanoid creatures of various kinds, Mandroids and some of the historical adversaries of the Marvel superhero such as Wendigo, Zzzax, Abomination and even Iron Man with the Hulkbuster armor, we will really have bread for our teeth and we will have to quickly learn to face any type of situation, focusing on reflexes and memory to score some well-aimed shots. As in the famous title by CHAIR, the gameplay of Avengers Initiative does not provide for the possibility of moving freely within the scenarios, but simply to ~look around~ (collecting any purple crystals scattered in the locations, which actually represent the game's currency ) and select one of the destinations that are indicated on the screen. This action triggers a predetermined animation (but, we assume, calculated in real time) that leads the Hulk to move and, often, to meet an opponent to take down. Anger management Once an enemy has appeared in our path, we can select it to start a fight or first do a quick check of our conditions by pressing the ~pause~ button at the top of the touch screen. In this way we can access the shop to buy new upgrades (crystals that improve the character's ability to inflict damage, its resistance, the loading speed of rage, and so on), kits of various types (to recharge health, rage or both), unlock new powers (there are six of them, all of which can be upgraded by leveling up and using the aforementioned crystals) and new costumes from the Hulk's story, each with particular bonuses and penalties. In the event that the opponent is any guy (although creatures capable of standing up to the green giant may correspond to this description), a possible defeat will not affect our progress and we will in any case be able to restart the fight from scratch. If, on the other hand, what we have before us is a boss, after having finished two chances to restart the battle we will have to resign ourselves to returning to the city and starting the whole adventure over again, which in any case will happen once the Abomination is defeated, albeit with a series of new events inserted for make the progression somehow meaningful. So let's get to the heart of the Avengers Initiative, or the combat system. As mentioned at the beginning, the game is clearly inspired by Infinity Blade and provides us with four different basic strokes that are performed through as many gestures (tapping the screen from top to bottom, from bottom to top, from left to right and from right to left) and which, repeated three times, result in a particularly powerful punch. It is possible to dodge the opponent's attacks to the right or left, but it must be said that this mechanic does not always appear very clear, as sometimes we will find enemies who move differently and require ad hoc evasive maneuvers in order not to suffer damage. Parading can also be used, although this option is limited in number. Once the enemy has been defeated, we will be able to punch him to fill the ~finisher~ bar, then end the fight with a spectacular move and collect experience points to level up and improve the Hulk's abilities. This well-tested structure is accompanied by a technical sector of excellence, among the best that has been seen on iOS devices as regards the quality of the polygonal models and the animations, extremely enjoyable especially for Marvel fans. A chat with Wideload Studios We got to ask the Avengers Initiative developers a few questions, and here's what it iscame out.Does the Avengers Initiative plot follow that of the movie ~Avengers~ or is it a spin-off? Avengers Initiative is set in the Marvel Gaming Universe, a separate universe from the filmic one, so the game does not follow the events of the film. The MGU, as we call it, was born with the Avengers Alliance on Facebook and lives on on mobile devices thanks to the Avengers Initiative. In shaping this universe we took inspiration from both the corresponding film and comic universes, in order to create the best possible version of each character. We carried out this work together with Marvel authors Fred van Lente and Alex Irvine, with the supervision of the editorial staff and the gaming division. Avengers Initiative follows the events of the mysterious ~Impulse~, the same one we introduced in Avengers Alliance on Facebook. Can you tell us something about the gameplay? Can we expect something similar to Infinity Blade or a mix of different genres? It is an action game with gesture controls that starts with the Hulk but will expand with new characters belonging to the Avengers group. The gameplay takes place in real-time and is based on timing, skill and different play styles. Infinity Blade is a title that has greatly influenced mobile gaming, opening the door to a whole new genre, and has also been a great inspiration for us. We've seen other productions based on this gameplay, and we thought we'd use this solution according to the nature of our characters. The core elements of Marvel products are fun gameplay, engaging stories, and impactful characters, and we worked on the Avengers Initiative with those things in mind. Releasing episodic content, featuring new members of the Avengers, connecting this experience with the Avengers Alliance experience on Facebook via Marvel XP, and working closely with Marvel writers and voice actors results in one of the best stories ever. been told on mobile devices. What will be the calendar of new content? Will it be simple add-ons or real DLC? Future episodes have been designed as simple updates to download. We hope to release them every two to three months, and the team is working on getting the next one out before the end of the year. Marvel only releases products that deliver a high-quality experience, so our studio must maintain very high standards in the development process of a new episode. We won't release an update that isn't perfectly curated and in line with the expectations of a character's fans. We are already working on a new episode, so we are very keen to guarantee certain timings but at the same time a high level of quality. Will we see all the characters from the movie ~Avengers~ or new heroes in the game? We haven't yet decided which characters to include in the next episodes, but they will certainly all be members of the Avengers.", "date": "2012-09-10", "grade": "8.6"}