{"name": "Galaxy on Fire II", "ref": "https://multiplayer.it/recensioni/107981-galaxy-on-fire-2-full-hd-galassie-in-hd.html", "text": "The success of the two chapters of Galaxy on Fire on iOS and Android platforms is due to several factors, including the remarkable graphic quality, the massive play offer and, above all, the beautiful idea of going to tease the nostalgia of all fans of space flight simulators from the good old days (and which are no longer, given the almost total absence of such titles in the last ten years). Between a Wing Commander-flavored tear and a Freelancer-flavored one, fans of the flight between the galaxies were faced, especially with the sequel, a very respectable game, exceptional to look at (especially on the iPad) and fun to play. A few days ago, Fishlab made a PC edition of the game available to users, available on Steam at a price of around 15 euros. Considering the remarkable graphic quality, we expected a respectable port, unfortunately the reality is slightly different. The Buck Rogers For the Anglo-Saxons (especially the nerdy ones), ~making a Buck Rogers~ means making a leap forward in time of several tens or hundreds of years, clearly in the sci-fi field (if you want to know why, jump here) . This is exactly what happens to the good Keith T. Maxwell, already the protagonist of the first Galaxy on Fire. Due to a malfunction in his ship's engine, the pilot jumps forward 35 years, and finds his galaxy much changed. As interesting as the plot device is, the subsequent development tends to leave it completely aside. Everything will be resolved in a few jokes from people who had met Keith years before, but the parenthesis will give way to a much more traditional storyline, with the protagonist and his allies forced to fight off an alien invasion in a big way. Although the story itself is certainly not much, the very light and sarcastic tones manage to make it funny, at least at times. Too bad for the dubbing (available only in English), which, due to its evidently amateurish nature, clearly spoils the atmosphere. Although the missions develop in a completely linear way, in Galaxy on Fire II there are several alternative activities, all useful for earning money to buy better ships and equipment. In this regard, it should be emphasized that going straight to the story mode will probably lead you to collide with an almost insurmountable difficulty in the final missions, which will require at least medium-performance ships, which can only be obtained by accumulating a fair amount of credits. To do this, you can give yourself to secondary missions, available at all space stations, to collect minerals from asteroids, possible thanks to a simple dedicated minigame, and to buy and sell basic consumer goods (food, minerals, and various others), which they may be bought at one price and resold at a higher one elsewhere. Of all these activities, the most profitable are still the secondary missions. Porting pains The missions may seem varied enough during the first hour of play, but you will soon discover that, behind different formulas, almost always the same procedure is hidden. ~Hunt a fugitive~ becomes simply ~kill all enemies~, ~escort someone~ mostly means ~get from point A to point B~, and so on. In other words, two or three hours of gameplay will be more than enough for you to explore everything that the game has to offer, and that will be brought back to you later, just by changing the name of the task. Furthermore, with the exception of some dialogue and very short cutscenes with the game engine, there is nothing to help distinguish between main and side missions, all of which fall within the usual two or three predefined formats. If in the case of a fragmented use, in full mobile style, this kind of offer could also be acceptable, played in long sessions Galaxy on Fire II is decidedly too repetitive. If this is a venial defect, given that a total rewriting of the missions could not be expected, there are unfortunately other problems born in the platform transition. The first unexpected is the greater sensitivity and ease of handling of the controls on PC, whether you play with a gamepad or via mouse and keyboard. While on the iPad and iPhone the control of the ship was cumbersome and the scrolling rather slow, on the big screen the work of Fishlab can be controlled with great fluidity. It could appear as a positive note, but unfortunately this only highlights a practically non-existent enemy artificial intelligence. The problem had already been noticed at the time of the mobile release, but on PC it takes on far more bordersverses, precisely because of the clearly superior handling. You will soon realize that, apart from coming towards you by shooting, reversing and repeating endlessly, the enemies basically don't know how to do anything else. Even raising the difficulty level to the maximum, once a decent shield is equipped, getting knocked down will really be a rare event, especially for fans of the genre. Apart from the ease, it is precisely the substance and credibility of the clashes that lose, while on mobile platforms the problem was able to effectively disguise itself thanks to the much less practical controls. Galaxies in HD From a purely graphic point of view, the work done by Fishlab is remarkable. Already excellent on iOS devices, Galaxy on Fire II's graphics also look great on PC, where anti-aliasing manages to effectively clean up edges, and frame-rate slowdowns are just a distant memory. Too bad the interface hasn't been redesigned to support the new resolution, resulting in buttons that are very small and often awkward to use. The audio sector also has the same problem. On iOS platforms, a limited number of songs and medium-low quality sound effects were completely acceptable given the limited storage space of the devices. But when you go to confront the PC public, you can't think of satisfying them without an upgrade, albeit minimal, which is completely missing in this HD version. The combat music will literally pour out of your ears after a few hours of playing, not to mention the sound effects related to weapons.", "date": "2012-09-06", "grade": "6.0"}