{"name": "Economia di villaggio", "ref": "https://multiplayer.it/recensioni/107932-puzzle-craft-economia-di-villaggio.html", "text": "Finding the road to success on the App Store is already difficult in itself, and even more so if the game is part of a particularly inflated genre such as puzzle games. If the label behind it is Chillingo though, things could be smoother; first of all thanks to the visibility guaranteed by one of the most prolific and important labels in the mobile games scene, even more after the acquisition by Electronic Arts, and secondly because the titles of the American house are often distinguished by a level at least medium-high quality. And Puzzle Craft, a title developed by the Ars Thanea Games team, easily falls into the group of games that at 0.79 euros deserve to be purchased without too many thoughts. How many chickens for a pig? Although it is a truly excellent product, Puzzle Craft certainly does not include originality among its qualities; it is in fact a game that basically rests on two macro elements of town building and puzzle respectively, managing however to achieve a particularly convincing balance and a truly stimulating formula. What appears appreciable is in fact how these two sides of the coin mix together and contribute to giving life to a cohesive and robust gameplay. A fundamental phase is that of the collection of resources, which can take place in the fields or in the mines; in both cases we are faced with a 6x6 grid populated by various raw materials to be collected such as wheat, carrots, chickens, wood, iron, coal, silver, etc. The recovery mechanism uses a system practically identical to that of the beautiful Dungeon Raid: by tracing a line with your finger you have to connect at least 3 identical elements, to see them then immediately transfer to your reserves. But the ~second layer~ of the mechanics foresees that by collecting a certain number of elements in a single action, a new product of greater value can be generated on the grid, which in turn can only be recovered when connected with three others. For example, with 8 hens a pig is obtained, or with as many stones coal is generated. We assure you that it is much more difficult to explain than to do; the challenge lies in the fact that all this must be done within a certain number of predetermined shifts, which in the case of the field correspond to the alternation of the four seasons, while for the mine they are linked to the provisions that one has brought with him. Fortunately, there is the possibility of performing a whole series of upgrades, in which, however, we prefer not to go into it so as not to make reading even more complex. But once all these resources have been collected, what can we use them for? In a sea of possibilities, really. The most obvious is the construction of structures of all kinds, to be placed in the clearing where trees and wasteland are destined to make room for the constant development of one's village. Each building brings with it benefits, basically linked to facilitations in the collection of resources; in the same way, the recruitment of workers, which necessarily passes through the construction of housing, must be seen in precisely the same perspective. But even with all this amount of aspects to take into account, it is quite evident how the vast majority of the time spent with Puzzle Craft is destined to flow between the field and the mine, inevitably leading to a certain sense of repetitiveness; for this reason it is preferable to play the Chillingo title in short sessions, in the way it was designed. Finally, we regret the lack, at least in the current version we tested, of the cloud sync between devices, which effectively prevents an iPhone and iPad user from continuing the game interrupted on the other on one device. A final word on in-app purchases, which are cleverly placed and don't create annoying limits.", "date": "2012-08-31", "grade": "8.4"}