{"name": "L'allenamento definitivo?", "ref": "https://multiplayer.it/recensioni/106713-adidas-micoach-lallenamento-definitivo.html", "text": "MiCoach is the sports platform created by Adidas that allows anyone to create a training program for their favorite sport on the official website and follow its instructions via the appropriate smartphone application. From today, this already absolutely valid system can also count on the contribution of a title for Xbox 360 and PlayStation 3, appropriately called Adidas miCoach and which promises to interface effectively with the aforementioned tools and constitute the perfect complement to the physical activity in the open air. So let's see if the Lightning Fish developers have managed to hit the target ... Sweating with the stars Strengthened by the important brand to which it is linked, Adidas miCoach immediately flexes its muscles thanks to the enviable parterre of coaches it can count on: Kak, Manuel Neuer, Jessica Enis, Ana Ivanovic, Will Genia and Ma'a Nonu are just some of the 18 internationally renowned athletes who physically accompany the user in his training, showing him the exercises to perform and encouraging him to improve through voice comments and short videos. Obviously you don't live on VIPs alone and the brute strength of the product is also manifested in the excellent amount of exercises (over 400) and programs made available. Let's start with the latter, divided between fitness for men or women and sections dedicated to individual sports such as basketball, soccer, running, rugby, tennis and American football. The depth of the Adidas miCoach approach is manifested not only in the variety of the offer, but above all in the almost absolute freedom granted to the user to shape a program based on his fitness status, his objectives and the time he intends to dedicate to training. 'physical activity. Having chosen a type of training, you are asked to choose what you want to achieve from your work (weight loss, increase in strength or muscle mass, etc.) and you can then comfortably follow and modify the routines by connecting your account to the site by miCoach or with the smartphone application. An option, the latter, which demonstrates all its importance especially if the chosen program includes sessions outside and therefore unrelated to the activity in front of the TV, in such a way as to be able to record progress even at that juncture. As a side dish to this already decidedly rich dish, the main menu also includes various preparation routines and so-called exercises, nothing more than a set of three mini-games dedicated to football, tennis and basketball which are actually rather bland and basically only useful to provide a timid diversion. Unfortunately, this is not the only aspect of the Adidas miCoach presentation that leaves us perplexed: the design of the windows that describe the workouts and the various sections leaves much to be desired, and the already cumbersome consultation of the various screens is made even more problematic by a movement detection that is far from excellent, so much so that we often find ourselves having to frantically move the arm up and down to reach the desired item of the very uncomfortable drop-down menus. An aspect that, combined with the very long initial loads, does not play in favor of a product that should make immediacy of use one of its strengths. Will is everything While exercising with Adidas miCoach, it's hard not to notice the stark contrast between the already vaunted amount of content and the hyper-professional approach with the actual value of the software as an effective personal trainer. In other words, the 505 Games product preaches very well and raids badly, presenting a series of inconsistencies and defects that make it in fact inferior to other similar titles as regards the execution of the individual exercises. Let's start from a purely graphic aspect with the digitizations of the athletes of rather low quality and pasted on really poor backgrounds, but what is more annoying are the frenzied framing changes which should theoretically help to better understand the movements but which in reality do not they only confuse ideas. Then there are some problems related to detection via Kinect, the potential of which has evidently not been exploited to the fullest by the developers, given that one has the constant feeling that one's movements are poorly received when not completely ignored, an aspect that is especially noticeable in the act of starting an exercise. The system adopted by Adidas miCoach in fact provides that you can observe your trainer as much as you want, and the software should (the conditional is a must) start counting the repetitions as soon as the user repeats the movement in front of the camera correct: it actually happened to us more times than plays forslices of the athletes' moves on the screen were beautifully ignored, as well as to be taken for good movements completely different from those shown, such as simply bending down to pick up the weights. In this regard, it should be emphasized that Adidas miCoach requires the user to use specific equipment for the vast majority of exercises and, therefore, anyone interested in the title would do better to immediately get at least one set of barbells and an exercise ball. Without considering the fact that, like many Kinect titles, even in this case a really generously sized living room is needed to train without constantly risking bumping into the table. All in all, Adidas miCoach is undoubtedly the most complete and professional fitness trainer available on the market in terms of the variety and depth of training programs it is able to offer. Too bad that at the level of mere execution the title falls foul too many times, seriously testing the patience of those who want to use it as a partner for their workouts.", "date": "2012-08-30", "grade": null}