{"name": "Ti ricordi quel gol?", "ref": "https://multiplayer.it/recensioni/107882-ti-ricordi-quel-gol.html", "text": "There are now a flood of football games on the App Store, both with versions of the most famous Fifa from EA and PES from Konami, and with titles made by labels with far fewer resources (but often with many excellent ideas). First Touch Publishing is one of the latter labels: a team that was among the very first to attempt to bring the ball to touch screens first with X2 Soccer and then with First Touch Soccer. Lots of experience then, but also the desire to experiment; this is exactly where Score was born! Classic Goals, a product that while based on the world of football, looks more like a puzzle game or a skill title. The meeting held The basic concept is as simple as it is interesting: recreating the actions of some of the most famous goals of national teams (unfortunately no clubs) from the 80s to the present day. How this is possible is soon explained. Each goal is first described schematically with a bird's-eye view of the field, in which the lines drawn describe the movements of the ball and players up to the goal. This representation must be followed in the most faithful way possible in the practical act, i.e. when one is called to play ~for real~. The distances with a traditional football title, however, if they are almost non-existent from a graphic point of view, appear enormous in terms of gameplay. In fact, the task is not at all that of controlling the players, who instead follow pre-established movements that precisely follow those of the real reference action; on the contrary, the only commitment is to draw the trajectories that the ball must take with your finger on the touch screen, whether it is a pass, a cross or a shot intended to inflate the net. It doesn't take a particular mnemonic effort, mind you: at any moment it is possible to recall the ~map~ above to refresh your ideas, and furthermore the dotted lines on the field indicate unequivocally where the ball will be sent with your swipe . A very simple mechanic on paper, and which really takes an instant to learn; perhaps even too simple, so much so that to continue being satisfied with a sufficient score requires an absolutely minimal effort. Things start to get more interesting with the advanced levels, intended to offer more complex combinations and actions that require painstaking precision, especially if you want to get 3 stars; each passage during the game is in fact evaluated with three degrees of judgment (ok, bravo, excellent) which then contribute to generating the final score precisely in stars. To earn them all you need a good concentration and skill, accepting the fact of repeating the same level even numerous times; a trial and error formula that balances between contentment and frustration, however leaning more than sometimes towards the latter. Things get more complicated then with the professional levels, in which it is also necessary to establish the correct strength of the kick by drawing a more or less long line for this purpose. However, it is rather absurd that the collection of stars does not bring any concrete reward to the player, apart from a personal satisfaction which, however, does not counterbalance the required commitment. Furthermore, despite the variety of situations, and the pleasure of reliving very famous goals firsthand (just to name one, that of Roberto Carlos on a free-kick against France in 1997), it is undeniable how the formula studied by First Touch Publishing is destined to appear repetitive after some time; to Score! Classic Goals probably lacks the spark capable of transforming it from simply good to excellent. Finally, the graphics are only functional, with athletes often not even remotely resembling their real counterparts and rather valid but poorly connected animations.", "date": "2012-08-30", "grade": "7.8"}