{"name": "La grande guerra", "ref": "https://multiplayer.it/recensioni/107394-great-big-war-game-la-grande-guerra.html", "text": "Last year, in June to be precise, the developers of Rubicon Entertainment released a title with a somewhat particular humor, with units of soldiers who spoke in ~Popeye~ style and who, in a campaign consisting of twenty levels man hand more complex, they had to defeat their opponents by following the classic mechanics of turn-based strategy. The attention to detail was impeccable: each scenario boasted raised terrains that multiplied the effectiveness of the weapons and their range of action, or ditches in which the exact opposite occurred, or waterways that slowed down movement. Likewise, during one's turn it was possible not only to move and attack with the troops available, but also to use the bases and the money earned to create new soldiers and new vehicles, send engineers to conquer enemy positions and so on. In short, Great Little War Game represented everything fans of the genre could want from a mobile product, and it is no coincidence that we are talking about a conversion of the game for PlayStation Vita, thanks to Sony's interest in the franchise. One year later, here's the encore: Great Big War Game arrives on the App Store with indisputable numbers, in this case a single player campaign made up of fifty missions, which translate into over forty hours of gameplay, a skirmish mode to face single missions and both ~pass & play~ multiplayer on the same device and asynchronous online. More of the same In structural terms, Great Big War Game appears practically identical to the first episode, even if it was decided to focus a little more on the ~comic~ skits between one mission and another. Once the mission has begun, you proceed as usual, moving your units and possibly attacking the enemy units during the turn, and then passing the ball to the AI who will do the same. In truth, the objective that must be pursued is not always very clear: in some cases all the opponents must be wiped out, in others instead to conquer certain positions or eliminate a single target, and so on. Let's say a recap on the pause screen wouldn't have been bad. Strategy enthusiasts know perfectly well that, as the levels become more complex, the duration of the stage also lengthens; and the Rubicon Entertainment title is no exception: after just a few levels you will find yourself facing games of thirty minutes or more, which fortunately can be completed in several sessions thanks to the instant save function. This factor didn't excite us in Great Little War Game, if you remember correctly, because we find that a gradual increase in playing time represents a more ~digestible~ solution for what is in any case a mobile game, with all that it entails, and it should be used as such. There are no substantial innovations regarding the units in the field, but an interesting system has been added that allows us to upgrade each soldier thanks to the use of the stars earned during the missions, a factor that will assume greater importance as we get into the long countryside. As for the technical sector, unfortunately even here the novelties are lacking: beyond the high resolution, the graphic style has remained the same (nice but not exciting) and the general result is sometimes a little ~dirty~ and confusing.", "date": "2012-08-24", "grade": "8.2"}