{"name": "Chi ha paura della Morte?", "ref": "https://multiplayer.it/recensioni/106978-darksiders-ii-chi-ha-paura-della-morte.html", "text": "When it hit shelves in early 2010, the first Darksiders was regarded with suspicion and immediately branded as a kind of ~new age~ clone of The Legend of Zelda. In short... Angels, demons and horsemen of the Apocalypse in a fantasy world conceived by the eccentric comic book artist Joe Madureira? We are serious! But what at first seemed just a mess of biblical proportions turned out to be a surprisingly well-finished adventure, even if not without flaws, which conquered a large group of fans, becoming one of the cult franchises of this gaming generation. The predictable sequel quickly became one of the most anticipated titles of 2012, mainly because developer Vigil Games has spent the last few months telling us how much the original formula has been improved: bigger areas, a revised and corrected combat system, even more puzzles , enemies, bosses, items, challenges and secrets. So, here we are: we've finally played the final version of Darksiders II and now we can tell you if it was worth waiting these two and a half years... Death, do not be proud Let's get this tooth out right away - the plot of Darksiders II let us down. It wasn't easy to uphold the legacy of Darksiders' thrilling finale. Do you remember it? [Warning: Spoilers for those who haven't played Darksiders yet!] War had just defeated the traitorous angel Abaddon but, in light of his recent subversive actions, Uriel wondered if the knight was willing to face a new war alone with Heaven, Hell and the Burnt Council. ~No, not alone~ replied Guerra, while three figures pierced the sky, heading towards the Earth. In short, the four horsemen of the Apocalypse were about to reunite, but not in Darksiders II: Vigil Games has never made a secret, in truth, of the questionable choice to set the new game in the same period of time in which the war adventure. [End of spoilers!] It is a parallel story in all respects, in short. Death is looking for a way to clear War of the accusation of having brought about the end of the world earlier than expected, but he doesn't know that in the meantime his little brother is working to solve his own problems. To animate Death there is a great brotherly love, which however is never fully explained, and a not very clear sense of guilt for having massacred his own lineage of the Nephilim. Death's mission will lead him to the land of the mystical Creators but also to the Underworld, to our Earth and to other ancestral places that we don't think is right to reveal to you. The problem is that Death's erratic journey doesn't seem to make real logical sense, but seems more like a treasure hunt, a constant search for the next artifact that will allow him to find favor with someone or reach a new destination. Even the plot of the first Darksiders was certainly not the Odyssey but rather a somewhat ignorant cartoon, but it is equally true that it captured the player's attention thanks to some memorable characters and a decidedly intriguing mythology. In Darksiders II the knowledge of some facts and characters appearing in the novel ~The Crypt of Abominations~ by Ari Marmell is almost taken for granted, yet another meta-videogame experiment which also in this case does more harm than good to the franchise: the result is a confused mix that passively drags us from one cutscene to another, anxiously waiting for revelations that never come. We liked some characters, this is the case of the Creators, and others a little less, like the ghostly inhabitants of the Kingdom of the Dead, but if all in all we can overlook the superficiality of the plot, one can only remain with a bad taste in the mouth for a short, anti-climactic ending that basically adds nothing to the story at all. There are the basis for interesting future developments, but Vigil Games will have to really work hard to end the story with a bang, unless they first want to offer us other episodes based on the two still absent knights, Fury and Conflict, of which among other things in Darksiders II there is not the slightest trace. The end of the world Well, excluding from our analysis the biggest flaw of the game, we can finally dedicate ourselves to the various advantages. In fact, we can confirm that much of what Vigil Games had said in recent months was true: Darksiders II is in all respects a much more demanding, long-lived and complex game than its predecessor. The new chapter is still a cross between The Legend of Zelda and God of War, but expands in a whole new direction, integrating substantial RPG elements. The new formula works and makes the THQ title something more than just the sequel to a clone. The first thing that catches the eye is the size of the new areas: in each world there are numerous dungeons, some mandatory and others absolutely optional, but also more or less hidden points of interest that hide chests, collectibles, old acquaintances eager to sell their wares, but also a hub to visit to empty your bags, learn new fighting techniques and interact with the various characters to learn more about their history or receive special assignments to complete at any time. These side-quests require the finding of numerous objects or the killing of particular enemies in their lairs, and reward Death with experience points, money and sometimes even new themed objects. But the real heart of the game are undoubtedly the dungeons: in Darksiders the guys from Vigil Games had already got used to it well with an excellent level design, but in Darksiders II it often touches excellence. The new dungeons are not only huge, but also full of perfectly balanced enemies and puzzles; the puzzles are never too easy or frustrating, they require the right intellectual effort to be solved by interacting with the environment or using the various gadgets that we will obtain during the adventure. A criticism, if anything, we really have to address to Death's upgrades, which certainly don't shine for originality: there's the usual grappling hook, the usual bombs, the usual gun and so on. Teleporting portals are back and a couple of new powers enter the picture like the ability to control two clones of Death at the same time to solve some tricky puzzles. In general, the care taken in the design of the dungeons has more than satisfied us, although some are drawn a little too long, but not as much as the exhausting final dungeon of the prequel; moreover, at the end of each dungeon, the usual huge boss awaits us to fight with brute force and a little cunning, even if we must admit that the quality of these battles is quite fluctuating. In case you want to take a break from dungeon exploration, Darksiders II offers two alternatives to main and side quests. The first is the Arbiter's Labyrinth, an area in which we will have to face various enemies before going through one of four portals: in the new room we could come across other enemies, the exit or a chest. Scattered around the game world we will find pages that show us the right order of portals for each level of the Labyrinth, so as not to go crazy. The Trial by Fire, on the other hand, is the most interesting mode, a sort of arena in which it is possible to face multiple waves of enemies and receive a prize after having overcome them all, a prize that we can decide to keep and go home, or try our luck and face a new set of waves in hopes of getting an even better prize. The various missions of the Trial by Fire are unlocked as you progress through the main quest; this mode represents the de facto main extension of the adventure beyond the canonical New Game + and, in addition to offering weapons and armor that would otherwise be impossible to find, it allows you to challenge your friends via a leaderboard in which the goals achieved by the various players will be published . Mr. Killer Another major change made to the structure of the franchise lies in how you can actually move and move around. In addition to his trusty steed Desperation, Death can of course run and jump but also climb walls and walls. Vigil Games has decided to adopt a control system and physics inspired by those of Assassin's Creed or the recent Prince of Persia, with Death automatically moving from one handhold to another as the player presses the jump button at the right moment. The result is not only spectacular but also fluid and intuitive; the platforming phases are now much more enjoyable and precise, moreover it is a bit like a game within a game since it is advisable to always look around in search of scalable surfaces, especially the hidden ones that often lead to secret treasures and chests. Chests are a catchphrase that will stick with you throughout the game, as the world of Darksiders II is overflowing with chests, each containing money and items. Death can in fact wear different types of weapons, bodices, shoulder pads, gloves and greaves and, a bit like in Diablo or Torchlight, the objects are randomly generated in each game, changing the protagonist's appearance and giving him different attributes that increase various aspects of Death's fighting skills. While it may seem a little annoying having to open the inventory screen every three by two, micromanaging your equipment quickly becomes nnecessary to balance or support Death's ~specialization~. In fact, with each new level of experience, one gets a point to spend on one of the two branches of additional skills that improve the protagonist's abilities. It is therefore possible to specialize in magic, perhaps learning to summon crows and zombies, or in hand-to-hand combat, unlocking area attacks or temporary increases in damage. As if that weren't enough, Death also has a huge arsenal of combos and special strikes that drastically change the way he uses each weapon, from the slow and powerful hammer that incapacitates enemies to the lightning-fast knobs that can counterattack. Death constantly equips his double scythes, to which he can associate one secondary weapon at a time, combining everything with his gadgets, the ability to dodge in any direction, the occasional possibility of carrying out choreographed lethal attacks and temporarily transforming into his Reaper form. The combat system in Darksiders II is spectacular and satisfying, suitable for all types of users, although we recommend PC users to replace the uncomfortable combination of mouse and keyboard with a joypad: it is only possible to scratch the surface and complete the game anyway, but to overcome the bosses and the more difficult optional challenges it is necessary to prepare the right equipment and learn to use each combo and ability in the right way. The only obstacle is posed by a somewhat hysterical camera that tends to go crazy when we face too big creatures in confined spaces, perhaps with the lock-on active. There are not many technical problems of this type to undermine the Vigil Games code, also because Darksiders II is undoubtedly a feast for the eyes mainly thanks to the extraordinary artistic direction and certainly not for the brute force of the decent graphics engine. The team headed by cartoonist Joe Mad proves once again that they know how to play beautifully with proportions, lighting and colors, giving us breathtaking settings and fascinating creatures, despite the low resolution of many textures, some rare episodes of bad clipping and a low polygon number striking. The result is in any case decidedly positive - which can be further improved thanks to the software that allows you to circumvent the incomplete graphic options of the PC version, among other things - and is framed above all by the excellent soundtrack by Jesper Kyd, which enhances the more intense sequences, and from a good dubbing in Italian.", "date": "2012-08-14", "grade": "9.2"}