{"name": "Il conflitto persistente", "ref": "https://multiplayer.it/recensioni/106875-hybrid-il-conflitto-persistente.html", "text": "Programmed by 5th Cell exclusively for Microsoft, Hybrid is a fully online third-person shooter, set in a persistent map where two different factions, the Variants and the Paladins, face each other. The former are a mysterious alien race equipped with futuristic suits, who have come to earth to conquer Dark Matter. Paladins represent the human resistance that stands against the invaders. The game is set in a post-apocalyptic future and allows the player to choose which faction to embrace, once this operation has been completed, the complete tutorial begins, which can lead to an offline simulation of the clashes to refine the controls, otherwise it proceeds directly online with other flesh-and-blood players. The servers had some problems at launch, but now the situation seems to have recovered. The world to come The size of the map can feel overwhelming at first, but it doesn't take long to realize that it's a mere hub for a rotation of different six-player modes, from deathmatch to team objectives. The interesting side is that each victory not only enriches the player's experience points, but takes into account the Dark Matter conquered by the two factions, represented by the colors red and blue. This motivates you to continue to see the effects of your contribution to the supremacy of the global map. Hybrid offers a control system full of personality and based on positioning. Players are free to move around the area thanks to shoulder mounted jet packs, this allows for upside down combat as some sections are in zero gravity. A system like this could have been extremely complicated, but 5Th Cell has brilliantly resolved the issue by simplifying flights as much as possible, it is sufficient to direct the viewfinder towards the covers and press a key to automatically move, but since the operation exposes to enemy fire , you can use the analog stick to operate a limited boost. Covers themselves represent the keystone of the game, given that dangers can come from any direction and many games are characterized by a high strategic rate, where any false movement can be fatal. Another key element is represented by the support drones, once a certain number of enemies have been killed we have the possibility of recalling various types of allies controlled by the CPU, we start with the simple reconnaissance droid with lethal ninjas able to ruthlessly pounce on the enemy. Although the clashes always take place between two teams of three players, the presence of these characters considerably spice up the fights, giving them a certain unpredictability. Before going into action we can freely choose both the weapons and the strategic role in the field. It goes without saying that teamwork is always rewarded. Xbox 360 goals Hybrid offers 25 objectives for a total of 400 player points, which is the new standard set by Microsoft. The most coveted and difficult are the 50 points guaranteed by conquering the maximum level, but the hedonists have not been overlooked either, since a good helmet change in the armory will guarantee us 10 points. Good luck! Choose your destiny Joining Hybrid's factions is not a choice to be taken lightly. Although the menu suggests otherwise it is not easy to change it, this is because the 5Th Cell project requires a commitment from the player, that of contributing concretely to the persistent conflict. It's an uncompromising idea and little tested on consoles, but which does justice to a service like Live, through a client (this is what the game is all about) with an accessible price. The armory allows you to upgrade our character and the purchase of increasingly dangerous weapons, but at the same time it is possible to use Microsoft Points for microtransactions to facilitate tasks. However, nothing is precluded to those who decide to conquer the upgrades with the sweat of their brow. What left us rather perplexed is the fact that the game categorically refuses to start without connecting to the server, including the menus and the training area, the product is simply unusable offline, the uploads are also quite long. There were already a lot of people in our sessions with sniper rifles, and they knew what to do with them. The advice is therefore to play as much as possible to get the right equipment. Technically Hybrid is a work that looks at functionality before visual impact. The programmers have opted for a simple, almost cartoonish aesthetic, with the absence of particularly defined textures or a polygonal loadand powerful, but balancing with a certain style (the Variant suits are very nice) and guaranteeing a constant 60 FPS. This is undoubtedly the feature that makes you feel the most weight; the clashes are frenetic and fun, so much so that after a few hours you no longer notice the shortcomings of the engine, which for the record is the Source of Valve. The music moves on the same level, certainly not memorable but endowed with a certain atmosphere, while in the field complete space is left for the fire of the weapons and the screams of the victims. The game is localized in Italian texts.", "date": "2012-08-13", "grade": "8.0"}