{"name": "Ridge Racers su PSP", "ref": "https://multiplayer.it/recensioni/ridge-racers-su-psp.html", "text": "The race is about to begin To welcome us in the PSP version there is always a CG film, which sees the beautiful Reiko as the protagonist and which plays with the combination of women, engines and speed, the latter two distinctive characteristics of the whole series. Even the classic arcade to play before starting could not be missing, and in this case it was Rally-X, a very old title dated 1980 in which you have to reach some checkpoints without being ~reached~ by another machine, controlled by the CPU. For those unfamiliar with RRs, suffice it to say that it is a hard and raw arcade racing game, very fast and which makes ~drift~ its trademark. In fact, the tracks and the curves must be tackled without too much hesitation and performing in continuous controlled drifts, being careful not to overdo it too much (on pain of losing speed) or to swerve a little, with the consequence of crashing on the side of the road. The ultimate goal is obviously to finish the race (usually consisting of 3 laps) in first place, and for this we will find ourselves competing against 11 other fierce machines. The ~summary~ meaning of the game is denoted by the tracks, cars and music present. In the first case we are faced with the highest number of tracks in the series. In fact, there are 12 plus their corresponding mirror versions (which can be traveled in reverse), divided between tracks from the previous chapters (the first unforgettable Ridge Racer and Type 4 above all) and four completely new ones. There are instead sixty cars available, divided into six classes that differ in maximum speed and in the different tendency to drift. Even the musical tracks, 30 in all, draw liberally from more or less all the chapters, such as Rave Racer, Rage Racer, or Type 4, completed by some absolutely unpublished ones and by some remixes, such as that of the unforgettable Rotterdam Nation. In this regard, the tracks are divided into 5 virtual and thematic discs, which can also be performed in a special menu like a sort of juke box, with the possibility of listening to the music by scrolling replays taken from some tracks on the screen. The race is about to begin As a game mode we have the inevitable Time Attack, the usual race against time to beat the track record, Single Race, thanks to which it is possible to compete against other cars on a circuit chosen by the player among those available, Wireless Battle, which take advantage of the PSP's Wi-Fi capabilities for multiplayer gaming between multiple consoles, and finally World Tours, the main hub of the game. This mode is made up of a total of 39 tours, divided into three large sections (Basic, Pro and Ex) of increasing difficulty. Each tour consists of a predefined number of races, which varies from 2 to 6, as well as the choice of tracks and cars that can compete (remember that they are divided into classes). To complete a tour we will have to complete the tracks by classifying ourselves within certain positions that become more and more restrictive, until victory is left as the only possibility. The total of races well exceeds a hundred therefore, not to mention that their completion is vital to unlock all the cars and tracks (initially only four will be available). A further possibility is given by being able to create new personalized tours, based on the player's choices during the creation phase. Once on the track we have the possibility to choose on the fly the music track that will accompany us during the race, there is also the well-known, by veterans of the series, speaker, who will comment on the most salient moments, also highlighting spectacular jumps or drifts particularly successful. The slopes range from the more technical and long to other very fast and full of jumps, the settings instead between day, sunset and night, which together with the landscapes are very suggestive. The gameplay is typical of the series, with a typically arcade control which, thanks to the drift system, allows you to always tackle curves at high speed, as long as you control the steering and don't hit other cars or guardrails, under penalty of a significant loss of speed. The races gradually become more frenetic as you progress through the game and unlock the higher classes, within which there are cars that reach peak speeds close to 350 km/h and with average distances of one lap even close to the threshold of 300 km/h. To make matters worse there is an absolute novelty for the series, namely the presence of nitro, a sort of propellant that will allow your car to achieve a very evident performance boost both in recovery and in maximum speed, sometimes even 40 kilometers timetables. To useand with this possibility we will have to fill a sort of indicator, which will be filled by tackling the curves in a drift. RRs lets itself be played, therefore, which is a pleasure, with a driving style that leaves room for spectacularity and high speeds, while proposing a driving model practically identical to that seen in the other episodes of the series. Another lack, noticeable especially by those familiar with the series, is the level of challenge, which cannot be defined properly high. Also due to the extreme length of the World Tours, many of the first races can be completed without too much difficulty, with the situation fortunately improving instead in the last section of races, those in Ex mode. You are the man The control of the machine can take place both with the digital cross and with the analog stick and, above all with the latter, it is possible to have excellent precision, as well as ease of use. The left and right back buttons are responsible respectively for the possibility of changing the view (between the internal and external one) and activating the nitro, while with X we will be able to accelerate, square, brake and triangle to change gears, if we have chosen the manual gearbox. Precisely the combination of brake and accelerator allows you to tackle curves in a drift, even if these are at 90 or 180 degrees: the concept lies in keeping the accelerator active at all times and energetically pressing the brake and the analog stick in the direction of the curve. The result will be assured, the skill will lie in adequately controlling the drift. For lovers of comparisons, we can say that technically the game is halfway between Ridge Racer Type 4 for Psx and Ridge Racer V for Playstation 2 You are the man We have deliberately left the multiplayer mode for last, which is available by connecting to other PSPs via Wi-Fi. In fact, it is possible to play up to 8 players or in a 1-on-1 challenge, also choosing any handicaps of one car compared to the others (useful for uniforming the level of skill among the various contenders). In the tests we did there was always no lag, which allowed us to play as if the machines were on the same screen. This mode therefore, provided you have people to play with, effectively extends the longevity of this title. Absolutely awesome! To be the first title available for PSP, Ridge Racers immediately shows what Sony's portable console is made of: in fact, the Namco title always travels at 60 frames per second, fixed and immovable, which make a significant contribution to the sense of speed returns the game. Other technical points in favor reside in the draw distance of the tracks, really high (the pop-up is practically absent) and in the quality of the rendering and the graphic palette, with vivid and never dull colors. The settings of the various tracks are well done and detailed, with peaks of excellence in tracks such as Downtown Rave City, full of details and effects. The machines are also equipped with a sort of environmental mapping, which makes it possible to reflect most of the lights and signs. However, there are some compromises, such as the textures that cover the cars, often blurry, and the polygonal detail, especially from a distance, of the opposing cars. For lovers of comparisons, we can say that technically the game is halfway between Ridge Racer Type 4 for Psx and Ridge Racer V for Playstation 2, with a polygonal complexity lower than the latter and a superior rendering and fluidity superior to the first. The sound sector has always been one of the flagships of the saga, and not even in RRs disfigures, proposing indeed a very high selection of songs, which will satisfy the majority of gamers and which, together with the audio commentary of the speaker, represents an excellent background to the frenzy of the races. Old glories and new entries, seasoned with some remixes, represent a soundtrack of absolute respect. Ridge Racer returns to consoles after the half misstep of Racing Evolution, and could not have been a better title for the launch of PSP. While offering few novelties from the point of view of the actual game (veterans will have no difficulty completing a good part of the races), Ridge Racers provides everything that lovers of the series and arcade racing could wish for: an adrenaline-pumping and fun title, a wide selection of tracks and music tracks, many races and a multiplayer mode that will extend the replayability component, especially in the future when the console is more widespread. Surely the spearhead of the initial PSP line-up, as well as the sum of the whole series. Pro Many tracks and races available TTechnically excellent It's Ridge Racer Cons Game structure very similar to the other chapters Not very high level of challenge A well-known saying goes ~All good things come in threes~ and therefore, after PSX and PS2, a title from the Ridge Racer series accompanies the release of a new Sony console, namely PSP. This new chapter adds a final s in a title that summarizes, in two words, the spirit of this edition: Ridge Racers is not in fact a totally new episode, but a concentrate of all the titles released to date, a synthesis of what represents this saga in the world of video games, pumped on steroids.", "date": "2005-09-22", "grade": null}