{"name": "Ombre latitanti", "ref": "https://multiplayer.it/recensioni/106689-nihilumbra-ombre-latitanti.html", "text": "One of the many merits of works like Limbo is undoubtedly the ability to use the rules of the game in order to tell a story more effectively than the classic cutscenes. The plot in this case does not represent an addition that accompanies the player up to the credits screen, but highlights (and is highlighted by) the strengths and weaknesses of the mechanics in a strong symbiotic relationship. With Nihilumbra, the Catalan developer BeautiFun Games seems to want to achieve the same result by proposing a puzzle platform on the App Store with an intriguing atmosphere, interesting ideas and some very intelligent puzzles. A world in colour Born from a mass of dark matter known as The Void (from the English ~Void~), the protagonist of Nihilumbra is a black creature who suddenly decides to flee from the terrifying place to which he belongs, curious to discover the wonders that the outside world has in store for her. Predictably, the mission is far from simple, since the Void, annoyed by the initiative of the small progeny, decides to persecute her and send his minions in pursuit. Thus the protagonist begins a journey through different worlds, each of which is usually characterized by a particular element, ranging from frozen environments to a mysterious forest, from a volcanic area to a swamp. Exploring these scenarios, the player and his avatar discover new colors in addition to the black and white of the Void, and above all that each color gives a completely new ability. The green of the forest, for example, allows you to create bouncy surfaces, while the characteristic blue of the snowy levels gives you the possibility of freezing the floor, thus increasing the speed of the character or making enemies slide inside a chasm or a trap . Recallable from a special menu and activated by ~painting~ with your fingers on the screen, the powers must be combined with each other as you continue in the adventure, and in the levels in which you are chased by the Void it becomes essential to put what you are into practice learned in the shortest time possible. The difficulty level remains extremely low throughout the first half of the game, but those who have the patience to go on will discover that the initial worlds are nothing more than a full-bodied introduction, a long tutorial that prepares the user for the much more complex challenge that will appear in front of him in the most advanced scenarios. Once the story is completed, you then have access to a whole series of new mechanics and unpublished enemies capable of drastically increasing the complexity of the game. With enormous game design ingenuity, BeautiFun Games has created a platformer with a difficulty curve that rises suddenly after having accustomed the player to almost trivial puzzles and challenges, ending up in the concluding bars proposing even frustrating moments, thanks to a system control via touchscreen which proves to be very cumbersome when you have to manage multiple powers and move at the same time. In this regard, Nihilumbra gives the possibility to choose between a traditional configuration of screen keys and a more atypical system based on motion sensors, thanks to which you move and jump depending on the inclination of the device. While not standing out for variety and originality, the enemies help to spice up the gaming experience, ranging from carnivorous plants to pursuing monsters, up to huge dark creatures capable of bombarding the protagonist with a series of deadly projectiles. More than their behavior, after all quite traditional, the excellent animations that characterize the silhouettes are positively striking, recalling at various times the appreciated Twisted Shadow Planet. On the other hand, the scenarios are less surprising, very well designed but too repetitive and similar to each other, to the point that it is often quite difficult to perceive a real detachment between one world and another. Unfortunately, the plot itself is told in a fluctuating way, with moments in which the narration intersects perfectly with the growth of the character and the use of colors in the game world, and others in which everything is delegated to texts that appear on the screen, albeit blending very well with the scenery.", "date": "2012-08-08", "grade": "7.0"}