{"name": "Sound Shapes", "ref": "https://multiplayer.it/recensioni/106760-sound-shapes-diamo-vita-alla-musica.html", "text": "Five years ago Sound Shapes was a completely different project from the one that will arrive on PSN in a few days, an abstract and confused idea that took shape in the mind of Canadian developer Jonathan Mak. The author of Everyday Shooter, to tell the truth, initially didn't even intend to make a video game, but rather a sort of interactive sound visualizer that was staged at electronic music concerts. The meeting with the composer Shaw-Han Liem (better known in the electronic indie scene as I Am Robot and Proud) definitely changed the cards on the table, and after a long series of prototypes and thrown away ideas today Sound Shapes is a multipurpose product characterized from a dual nature. On the one hand it is a fascinating 2D platformer for Vita and PlayStation 3, in the style of Knytt Stories and NightSky but with a dizzying audiovisual style; on the other hand it is a musical instrument for creating songs in an alternative and interactive way, a sort of strange MIDI controller and effects processor disguised as a level editor. Synesthetic games It doesn't take much to describe the basic game mechanics that underpin Sound Shapes. In fact, as a small circular creature, the aim is simply to roll towards the exit of the level, crossing different fixed screens full of obstacles, enemies and platforms on which to jump. Other than jumping, the only ability available to the protagonist is the ability to stick to certain surfaces or slide away at full speed, while the game does a great job of visually suggesting dangerous objects, coloring everything red that can kill with just one touch. Dying therefore becomes extremely easy and frequent, but fortunately the abundance of checkpoints prevents the experience from becoming too frustrating, to the point that you are often teleported just two or three jumps away from your mistake. However, as mentioned, the most interesting aspect of the Mak and Liem title is the way in which music plays an active role in the interaction with the game world. For each coin collected, a new note or a new loop is added to the music of the level, while any object or enemy enriches the screen with new sounds in time with the music. We soon realize that the developers have not included even a redundant object, and that any game element performs both a playful and a musical function at the same time, leading to clear repercussions on both sides, with the player for example, he can take advantage of the rhythm of the music to jump with the right timing and avoid traps on the screen more easily. Completed in less than a couple of hours, the Campaign offers twenty levels divided into five music albums, but what should have been a filler mode capable of showcasing the possibilities of the editor instead gets a unique personality thanks to the collaboration with artists internationally renowned. Both in terms of graphics and sound effects, each album is in fact modeled on the style of a particular musician. Deadmau5's levels are a hymn to the iconography of the Canadian DJ, with psychedelic scenarios and infernal environments dominated by the mau5head (his famous logo), where everything is clearly accompanied by chiptune beats and electronic music. In the same way, the album made in collaboration with Jim Guthrie seems like a level ripped forcefully from Sword & Sworcery, in which a mix of experimental and ambient is the backdrop for sequences that are more ~playful~ than the others, in which to move crates and activate switches to be able to continue from screen to screen. With Liem at the helm of the project, pieces in full I Am Robot and Proud style could not be missing, but the highest peak is reached in our opinion in the levels created with the collaboration of Beck, in which sung songs, choirs and an enchanting graphic style pack a mind-blowing audiovisual experience. Taking up the above discussion, the scenarios by the Los Angeles author introduce what are probably the most successful game elements, with balloons that appear according to the chorus or platforms that change their behavior following the words of the background song (~Lose , move, turn, hurt...~). And one cannot fail to get excited when, picking up note after note, one passes from the quietness of the beginning level to the sonic magnificence of Purgatory (Guthrie) or to the energy of distortions, voices and percussions of Cities (Beck). Playstation 3 trophies In Sound Shapes there isn't much variety in terms of Trophies. In addition to obtaining one by completing all the levels of the campaign, the others must be unlocked by completing each challenge in modality Death or in the School of Rhythm. Succeeding it will not be an easy task, but if you want Platinum you will have to roll up your sleeves and open your ears. Music master! Each album is therefore a synesthetic journey that reflects the personality of an artist, but it is precisely in this concept that the greatest compromise of Sound Shapes is contained: since the vast majority of graphic and sound assets have been created on the basis of the artists mentioned above, it seems almost impossible to be able to create equally characteristic and original scenarios in the integrated editor. This is especially true if we consider that almost all the elements that can be used in the creation of levels are objects belonging to the Campaign and unlocked by completing the various albums. Of course, musically you have much more freedom, and perhaps the most creative players will be able to subvert the editor in order to create particular stages full of personality, but for the moment the list of levels created by users is full of scenarios that mix without the rough pixel art graphics of deadmau5's obstacles to Beck's elegant backdrops are too coherent. But apart from this natural flaw, the combination of the level editor and the community-generated scenario section undoubtedly represents the beating heart of this product halfway between game and musical instrument. Through an on-screen grid, and making perfect use of both the touchscreen and rear touchpad, this mode blends a traditional level editor with typical music software. Grid position affects note pitch or loop type, while a constantly shifting vertical line punctuates each beat; the same clearly applies to the coins inserted and to some objects which, depending on where they are placed on the screen, create different sounds, while in some cases it is possible to set the behavior of an element in order to make it ~play~ as you prefer . Obviously it is possible to modify the BPM, choose the scale or even cut and paste entire pieces of the level, while the user can familiarize himself with the editor both through the short tutorial and thanks to the Rhythm School, an unlockable mode that challenges us to listen to preset loops and replicate them using the tools at your disposal. In addition to this option, by completing all levels of the Campaign it is possible to access Death Mode, a series of additional scenarios characterized by an incredibly high level of difficulty.", "date": "2012-08-07", "grade": "9.0"}