{"name": "Il ritorno dei fantasmi", "ref": "https://multiplayer.it/recensioni/106578-tom-clancys-ghost-recon-future-soldier-arctic-strike-il-ritorno-dei-fantasmi.html", "text": "Turning point for Ubisoft Paris' third-person tactical shooter. In fact, the time has come for the first DLC, proposed for an amount equivalent to ten Euros and totally (or almost) dedicated to online multiplayer. The test to be passed in such contexts is not indifferent, and is equivalent to demonstrating how the additional contents really manage to enrich the product, instead of giving the feeling of intentionally removed material. Fortunately Ghost Recon: Future Soldier is a series product already very complete in this sense, a feature that certainly guarantees its honesty. The Arctic Mission Pack however adds three maps for competitive multiplayer, a new map specific to the Guerrilla co-op challenge, six weapons and a new mode called Corrals. A package therefore very interesting, let's see specifically if it is worth buying. All out The three maps offer new scenarios and situations, Skyscraper immediately stands on the shields, set as it can be easily guessed on the roofs of a building, it turns out to be much wider and more varied than one might legitimate to suppose. A very eclectic map, perhaps the best of the whole lot, effective for all modes and which will be particularly appreciated by snipers. And then you can breathe a bit of a Crysis 2 air, a detail that doesn't bother us at all. Watch out for the section with solar panels. Rivolta is set in an urban scenario completely devastated by the war, in the distance it is possible to hear the screams of civilians and the hiss of bullets, funeral signals of the surrounding conflict. There are many places to hide, including the area that encloses a destroyed train. Particularly appreciable in this case is the frenzy that can be reached in the clashes, a detail that will certainly make this map the first choice for those who prefer adrenaline-based clashes. Eviction is the most curious of the three, as it throws us into a gigantic apartment complex and gives the game a less warlike, but more strategy-oriented aspect. Perhaps this is the scenario with the most impact on an aesthetic level, and the daytime setting also in this case stimulates the sniper's action thanks to the wide visibility. Xbox 360 goals Achievement fanatics can rejoice: the Arctic Mission Pack adds two new ones to the base game, bringing a fresh 35 player points. 10 of these can be earned in the Enclosure mode, while for the remaining 25 we have to win three games in the new multiplayer maps. Good luck! I need a duvet Some of you may be wondering about the connection between the title of this DLC and its contents, where there seems to be no trace of snow. The answer comes with the map dedicated to the Guerrilla cooperative mode, set in the Siberian scenario already seen in the main campaign of the game. In this case, however, the structure already appreciated in this mode is re-proposed: facing a first stealth phase we have to reach a strategic grid, and then face growing hordes of enemies in difficulty. The level cap has been raised to 20, while the possibility of tackling everything alone remains unchanged, even if not being able to count on a partner you risk being quickly overwhelmed by the enemy. Let's spend a few words also for the new competitive mode, called Recinto. This is an addition that considerably raises the strategic factor of the clashes, as the eliminated component of the team enters a sort of limbo from which he can only exit after his companions manage to make a killing. This causes unnerving waits which, however, can be interrupted at any time thanks to the system of objectives, which allows you to instantly free all ~frozen~ players, thus upsetting the dynamics of the match. There are also six new weapons, two for each class, which will make all the gunsmiths inside you happy. Ghost Recon Future Soldier: Arctic Mission Package is a full-bodied DLC that enriches an already very gifted online sector. This is not a fundamental addition, but an investment to be definitely taken into consideration for those who love to spend hours online with friends.", "date": "2012-07-31", "grade": null}