{"name": "Non  il 3 ma quasi", "ref": "https://multiplayer.it/recensioni/106546-kingdom-hearts-3d-dream-drop-distance-non-e-il-3-ma-quasi.html", "text": "Tetsuya Nomura is a curious figure in the world of video games: he has practically as many admirers as detractors and the titles of his games are getting more and more absurd. On the other hand, he is also the director of the impossible combination, that crossover that more than ten years ago everyone believed would be a total disaster and which today has sold almost twenty million units worldwide. A lot of water has passed under the bridge since Sora met Donald and Goofy for the first time in the first, unforgettable Kingdom Hearts: our protagonist has now grown up, and with him also the stakes. The enemies are becoming more and more terrible and one cannot blame those who argue that the franchise has lost the delicate fantasy vein that characterized it to make way for philosophical and sci-fi themes bordering on the absurd. But above all, after so many years of spin-offs, the third (and final, it would seem) chapter is really driving all the fans crazy. ~But when is Kingdom Hearts III coming out?~ could win the most popular question prize of the year, but this time there's good news: perhaps the wait could be less unbearable than expected... The D of Delirium The introductory kinematics of Kingdom Hearts 3D is really misleading, it wants to be more of a metaphorical summary of the entire saga in splendid computer graphics with a stereoscopic effect. Even the title is a real pun: it is not Kingdom Hearts 3 but 3D, with clear reference to the subtitle ~Dream Drop Distance~, which in the context of gameplay and story, for once, surprisingly makes sense. But first things first: Sora's new adventure takes place immediately after the events of Kingdom Hearts Re:coded, with our protagonist and his friend/rival Riku ready to take the exam to become Masters of the Keyblade. It is imperative that the two heroes learn to use their full potential, Xehanort is back and the multiverse is in danger; so the wise old Yen Sid sends the two boys to visit some dormant worlds with the aim of restoring them completely. The worlds are practically all new, ranging from La Cit des Cloches for The Hunchback of Notre Dame to Country of the Musketeers for The Three Musketeers with a visit to the new Grid of Tron: Legacy and a Symphony of Sorcery for Fantasia, in between we also have another world of Pinocchio, just to please. You may have noticed the titles in English, you might as well take the pebble off your shoe, you probably already know it: Kingdom Hearts 3D is completely in English, no Italian, zero, zilch, nada. This move by the publisher is inexplicable, which pissed off most of our compatriots badly. Beyond the usual speeches on the usefulness of knowing English in 2012 and so on, it must be admitted that the choice not to localize a title with such a fanbase in Italian leaves us perplexed to say the least, above all because this too Kingdom Hearts is, like usual, very rich in texts, whether they are dialogues or detailed explanations of the extravagant game mechanics. The plot, on the other hand, is a bit more delicate matter: in short, practically nothing happens for ninety percent of the game and the most important events, however not particularly shocking, all take place in the last two worlds. In the various Disney worlds, the usual cutscenes await us that summarize the story of the reference film in an absolutely superficial way, abandoning all logic and sense of rhythm to make way for the intrusion of Square Enix characters. More pleasant, however, are the extras of Neku, Joshua and the other protagonists of The World Ends With You, an unforgettable RPG for Nintendo DS from 2007, who replace the cast of Final Fantasy to wink at the loyalists of the great N. In general , the last two hours condense what we can define as a real prologue to the infamous Kingdom Hearts III: it's a pity that the rest of the story wearily drags itself from world to world, relying on an intriguing concept of parallel dimensions that is not completely successful . Nomura and his pokmon The Drop system also mentioned in the subtitle is one of the new features of dubious utility and to which it is not easy to adapt. The concept is relatively simple, although it makes little sense: when the appropriate indicator runs out, the character we are controlling falls into a deep sleep and we suddenly find ourselves in the shoes of the other protagonist; after a few minutes the story repeats itself, perhaps in the middle of a fight: the action is interrupted and we return to the controls of the previous character for a few more minutes. This system has two purposes: firstly, it allows two parallel stories to be toldusing the same worlds and characters; moreover, it imposes a sense of urgency which should make the adventure more engaging and dynamic. What it actually really manages to do is annoy the player, especially when you're hunting for some hidden treasure chest or creature to suddenly find yourself thrown into the shoes of the other character, perhaps in a completely different place. To be honest, it's not a very invasive system and it is possible to ~control~ it through some special objects, however it takes a few hours to get used to these sudden changes of scenery (especially when Sora and Riku are in different worlds) and we sincerely struggle to see its usefulness. On the other hand, the notorious ~Pokmon question~ that Nomura enjoyed conceiving probably a bit as a tribute to the Nintendo franchise and a bit for marketing reasons is different: in practice, in Kingdom Hearts 3D the ~deck~ abilities already seen return, for example, in Kingdom Hearts: Birth by Sleep (PlayStation Portable) but this time they are learned by training funny little colored creatures called Spirits. Counterparts of the Nightmare-type Dram Eaters that haunt sleeping worlds, Spirits can be created by combining objects found on the field and then selected to accompany Sora or Riku on their raids. In short, these real pokmon take the place of Goofy, Donald Duck and the other Disney supporting characters from the previous chapters, offering bonuses and support in combat, including some super special combined attacks. The Spirits integrate into practically every hardware feature: it is possible to cuddle and play with them with the touch-screen and in the menus they are displayed in Augmented Reality and at any time it is even possible to take and memorize a photo of the Spirits jumping on it desk. In addition to an avalanche of statistics, the Spirits also have a very personal skill board that can be unlocked by spending the points earned in battle and then assigned to Sora and Riku's deck. The new system has pros and cons: on the one hand it rewards the experimentation and creation of new Spirits with the aim of unlocking as many skills as possible; on the other it encourages you to keep the same group of Spirits practically always for all the hours of play necessary to fully develop them. However pleasant and original, we admit that we would have preferred to use the powers and abilities of classic Disney characters rather than anonymous anthropomorphic animals, but so be it... The 3D effect In short, one of the best proposed by the Nintendo portable. It is not invasive and right from the introduction it is possible to appreciate the depth game which we can then exploit to better calibrate jumps and attacks. Even the menus, some interface elements and the specific titles of each world take advantage of stereoscopy to make the experience even more immersive. Go with the flow One of Nomura's main objectives was to exploit the stereoscopic effect of Nintendo 3DS in gameplay that was spectacularized both visually and practically. The result is called Flow Motion and is definitely one of the best features of this Kingdom Hearts. Just press a button to use any surface as a launch point and then sprint at full speed in another direction. With a little timing it is possible to dart from one point to another on the map like real ninjas in search of hidden treasures in apparently unreachable points, using a series of peculiar attacks that can only be used in Flow Motion mode to knock down enemies. Learning to use Flow Motion isn't easy, especially because of a decidedly dancer camera, but a couple of hours are enough to start integrating it naturally in movements and battles, with the three-dimensional effect enhancing our movements in depth. By the end of the game, Flow Motion movements will have become second nature and given the extreme spectacularity and usefulness of this power we hope to see something similar in the third Kingdom Hearts too. The price to pay, however, is not only the confusion generated by the camera during the most sudden movements, but also an unstable frame rate, especially when facing many large enemies at the same time. It is nothing serious and in some ways it is also quite understandable: the Kingdom Hearts 3D cosmetics are already impeccable in themselves, but are further enriched by explosions, special effects, light filters and other amenities that make the fights real fireworks displays. We were definitely impressed by the work done on the technical sector, probably one of the best everor in the Nintendo 3DS toy library: complex and well-animated models, minimal aliasing, well-finished and detailed settings. We must reluctantly complain about the total absence of characters and ~life~ in the various scenarios, whose appreciable vastness of dimensions is often nullified by the total emptiness inside them, except for the enemies who appear out of nowhere at pre-established points. Finally, the technical picture is framed by the soundtrack of a Yoko Shimomura in great shape who, in addition to the usual unreleased songs and the traditional ones of the franchise, also gives us her very personal remixes of some famous Disney songs and a couple of tracks from The World Ends With You.", "date": "2012-07-30", "grade": "8.5"}