{"name": "Un nuovo erede per Master of Orion", "ref": "https://multiplayer.it/recensioni/106207-endless-space-un-nuovo-erede-per-master-of-orion.html", "text": "A period of redemption seems to have arrived for space-setting strategy games, a genre that is anything but inflated but graced by some respectable exponents. We can mention the latest Sins of a Solar Empire, or the recently announced Legends of Pegaus. And then Endless Space has recently arrived in digital delivery format, a title belonging to the category known as 4X, heir to the genealogy that began with Master of Orion. A product that already in the beta phase had definitely impressed us, confirming practically every value in the final version. Conquering the galaxy In Endless Space we will start a new game by choosing one of the various empires present, human and otherwise. Each offers unique characteristics, suitable for as many styles of play. So if we want to focus mainly on conquest and destruction, the Carvers are the best choice; if, on the other hand, peaceful coexistence and research are what we aspire to, we can put ourselves in charge of the Sophos. The Amplitude title goes further by allowing you to freely put together peculiarities, strengths and weaknesses to give life to a brand new race, at our total discretion. The generation of personalized content is one of the strong points of Endless Space, and it returns to be appreciated in various other elements of the title. For example, always during the creation of a new campaign we have different presets and as many settings available to modify the galaxy to our liking (shape, size, age) that we will have to conquer, rather than the difficulty level and other parameters. Once you get going, a custom cinematic for each empire gives some context, underscoring a good job characterizing the different races. Unfortunately, a good start does not materialize in an equally valid storyline, completely absent, wasting the opportunity to involve the player with a captivating background. Where it lacks in storytelling and emotional engagement, the game more than compensates with content and sophistication in the gameplay. Without neglecting the captivating aesthetic aspect, with an interface that is as pleasant to look at as it is efficient to use, a factor that is anything but secondary, given that practically the entire gaming experience is developed in the various menus. These manage to collect everything necessary in an organic and orderly way, divided into a few sections; starting from the view that collects the entire galaxy, which can be zoomed at will to highlight the different settlements on the various systems and the lines of connection between them, we will then be able to observe the planets, colonized and not, to explore the progress of our empire in different zones, choose how to exploit their resources and so on. Icons at the top allow you to access the complete statistics of our empire, the development tree, the ship customization menu, hire heroes and enter the section dedicated to diplomacy. Endless Space doesn't need much else to offer an articulated and intriguing experience, which we can learn to master without too much difficulty thanks to convenient pop ups that will guide us through the first steps, covering every aspect of the gameplay. Yet another round Going into specifics, at each turn we have to perform a whole series of actions, without particular limits, for example sending one of our fleets to explore a new system of planets, colonize one or more of them and determine how to exploit it in order to recover precious resources ( there are four different types). Our empire will grow and so we will have to keep the population at bay, constantly increasing but subject to easy bad feelings, capable of affecting productivity. At the same time it is essential to work in research, taking advantage of the tree divided into four specializations, thanks to which we can select different upgrades following our tendency, which is belligerent rather than interested in technological progress. If the management phases demonstrate an excellent calibration of the ingredients, the title shows weaknesses when it comes into contact with other empires. By choosing the path of diplomacy, we found a rather flat artificial intelligence, a factor that is even more evident in case we have to go to arms. When the galaxy becomes too small to be able to host other empires besides ours, we can decide to enter battle mode, characterized by a system that is as spectacular and captivating as unfortunately not sufficiently detailed in the mechanics. The duel develops in five phases, played independently by the CPU and during which we can select species of cards that influence the statistics of the nightfleet rather than that of the adversary. They also interact with each other, so that one selected by us can eliminate the enemy and vice versa. In the meantime, we see the two fronts battle it out on the screen, with a cinematographic direction to make everything spectacular. An intriguing gimmick that we hope will see the introduction of some more decisive element in the future, given that the feeling is that in the end the larger army always wins. And speaking of army, it should be noted that it is possible, in addition to unlocking new ships, to create original models in the appropriate menu. Here, starting from an existing preset, the characteristics are modified by mounting upgrades with a maximum slot limit established by weight. Remaining within the maximum value supported by the spaceship we can also make substantial changes, completely transforming the role covered by the combat units, and then saving them in personal presets. Even a menu can be beautiful In any case, the game manages to break through and involve, creating the classic ~yet another turn~ syndrome, as Civilization fans like to call it. It helps the aesthetic aspect, clean, clear and appreciable in rendering the menus as well as the three-dimensional elements and the galaxy. We are not dealing with a title that impresses with particular features, but it performs its duty very well, resulting at the same time scalable and very light to manage even for poorly performing systems; an ideal friend to carry around installed on your laptop. The sound sector does nothing in particular to get noticed, proposing a decidedly silent space, accompanying the phases played with catchy but not particularly incisive music. A final note deserves the longevity factor, tending practically to infinity thanks to the mass of options and possible customizations that guarantee a very high replayability. All offered at a very competitive price.", "date": "2012-07-23", "grade": "8.0"}