{"name": "Risse in miniatura", "ref": "https://multiplayer.it/recensioni/106230-mini-ninjas-adventures-risse-in-miniatura.html", "text": "Remember the original Mini Ninjas? Otherwise, we'll take care of clearing your mind: it was an action adventure starring the mythical oriental warriors. Comic atmosphere and great humor, shocking that all this came from the minds of IO Interactive, the creators of the sagas of Kane & Lynch and Hitman. Three years have passed since then and Square-Enix has well thought of resurrecting the brand for an exclusive spin-off on Xbox 360, a relatively cheap project conceived as a digital distribution and based on the Kinect motion sensor. The work ended up in the hands of SideKick Ltd, the result is this Mini Ninjas Adventures, essentially a mix between a real tower defense game and a shooter that sees the return of the ninja Hiro as the protagonist. Everything else, starting from the story itself, becomes exquisitely accessory in the name of pure entertainment, however the title maintains ingredients capable of capturing the player's attention, let's see them in detail. I'll break your katana Our fearless Hiro must fend off growing hordes of enemies, who come from the top of the screen and must be killed both with the help of close and distance shots, respectively with sword and bow, but above all our muscles, since every action it will have to be imposed by the movement of our limbs. There is no shortage of legendary Shurikens, such as magical attacks and devastating combos, it is even possible to repel opponents' blows by adding a pinch of strategy to the whole. The enemies themselves come in different types, from infantry to samurai, and as the game progresses they turn out to be more and more tough; periodically we also find ourselves facing bosses. Perhaps the most interesting side is the development capacity granted to our protagonist, which grows in the clashes and can be enhanced in the various skills. It is an effective ploy to encourage the player to invest more time in the product, also because the conceptual emptiness and the absence of any story undermine long-distance usability. The problems are quite different and reside in the repetitiveness and the effort necessary to endure lasting sessions, thanks to the not exactly idyllic temperature we soon found ourselves at the mercy of exhaustion and totally drenched in sweat. After all, Mini Ninjas Adventures doesn't have very clear ideas on which type of market to focus on, the simple and cartoony visual style goes well for a young audience, while the play structure is anything but extraneous to the stylistic features of the genre. What matters is that everything works quite well, with a satisfactory responsiveness from the Kinect. Competitive online modes are totally absent, while the main campaign, if we want to call it that, should arrive at five hours  if you get there. The game is fully localized in Italian. Xbox 360 goals Mini Ninjas Adventures features 12 objectives for a total of 400 player points. Being an exclusively single-player title, it will be sufficient to complete the campaign to get them all. Just remember to shoot down at least 300 enemies to get 40 juicy points!", "date": "2012-07-20", "grade": "6.5"}