{"name": "L'importanza dell'etichetta", "ref": "https://multiplayer.it/recensioni/105752-bug-princess-2-black-label-limportanza-delletichetta.html", "text": "he world of special edition video games, especially in the Japanese aspects of the phenomenon, often appears obscure to us. A certain franchise conquers its own fanbase and at that point the publisher monetizes this feedback through the creation of extra versions that perhaps include a little more content, but which are still purchased out of passion. We can take a classic example with the Street Fighter II series, which saw the release of an avalanche of Turbo, Super, Ultra, Alpha editions and so on, basically selling and reselling the same product for the simple reason that people still liked it. to the public. A similar situation occurred for the Cave shooters with the production of the Black Labels, i.e. ~extreme~ versions of DoDonPachi, Bug Princess and Bug Princess 2 which added a series of new modes and contents to the original games. The point is that such an operation, i.e. the distribution of a ~special~ edition of a videogame, is fine when it comes to a coin-op or maybe when some time has passed since the publication of the ~standard~ version ~. However, Bug Princess 2 Black Label arrives less than three months after the release of Bug Princess 2, and this could be a first reason why even Cave's historical fans can turn up their noses. The second reason is obvious: if the price of the smooth edition of the game (5.49 euros) already seemed slightly high to us during the review phase, what can we say about the 10.99 euros asked for the Black Label? And that's not all, because one of the most important contents of this release, the Boss Rush mode, must be purchased separately via in-app purchase, at the price of an additional 5.49 euros, to which another 5.49 euros can finally be added if we want to unlock all modes and customizations right away. Considering the total expenditure, if it is not a record for the Apple store we are close, and the only attention that is granted to those who have already purchased Bug Princess 2 lies in the possibility of trying the aforementioned Boss Rush Mode once a day without having to buy it, but this if and only if we have both games installed on our iOS device (recognition is not made via user id). There is also some good news The picture traced so far paints Bug Princess 2 Black Label as a very expensive title, probably made for the sole purpose of monetizing the most ardent fans of the series, with the ~touch of class~ of the Boss Rush mode to be purchased separately, which alone would be worth a avalanche of epithets. However, at the same time we must recognize that it is undoubtedly an improved version of the shooter Cave, which offers us a new simplified fire system for the ~pods~ (a mix of the two available in the original game) and the artificial introduction of slowdowns that allow us to more easily avoid the myriads of bullets fired in our direction, a bit like what happened in the classic Thunder Force IV for Mega Drive. Furthermore, the presence of a greater number of power-ups implies a lowering of the degree of challenge: the very inspired bosses will attack us from every angle, of course, but their defenses will give way much sooner than in the normal edition of Bug Princess 2, all things being equal. difficulty level. By completing the story mode in normal mode, you will be able to access the Maniac Mode and by also completing this to the unprecedented God Mode, with variations in all cases that will push us to play and replay the sections, perhaps in search of the high score. Technically nothing has changed: the graphics have a substantially lower resolution than the Retina display, but remain pleasant, spectacular and characterized by a design of undoubted quality. The sound is also very nice, with music that remains in the head, and the touch screen controls are absolutely perfect. The experience is also good on the iPad and, indeed, the larger screen size makes the excited moments more bearable, offering us glimmers that perhaps we hadn't noticed on the iPhone.", "date": "2012-07-17", "grade": "8.0"}