{"name": "Autunno in guerra", "ref": "https://multiplayer.it/recensioni/106013-autunno-in-guerra.html", "text": "The world of gaming on iOS doesn't necessarily have to be made up exclusively of Angry Birds, Temple Run and the whole 5-minute game company. Although these actually represent the majority of the App Store's play offer, there are also complex experiences capable of gratifying those looking for something ~more~. In the specific case of Autumn Dynasty, we find ourselves talking about an RTS that concedes little or nothing to the more light-hearted and frivolous declination of mobile gaming, instead tickling the appetites of those who grew up loving the genre on PC. A blasphemy? It can probably only be so for the most obtuse opponents of the ~touch generation~... The leaves fall Autumn Dynasty debuted on the App Store as an exclusive for iPad, and it only takes a few moments to understand why; a generously sized screen proves to be essential in order to guarantee acceptable control over the action without having to go crazy between pinch and zoom. It is no coincidence that in this sense the recent announcement by the Touch Dimension Interactive development team regarding the next release on the iPhone actually left us a bit perplexed, but it is right to keep the benefit of the doubt while waiting for the release. But let's go back to the game: before talking about gameplay, it is appropriate to start from the setting of the title published by Bulkypix, which is placed in the era of feudal China, in the midst of a revolt born within the Autumn Empire governed by officers corrupt and likely to lead to civil war. The plot, narrated through pleasant static screens, plays the role of glue between the missions just enough; as regards the latter, the gameplay that supports them is rather classic, following the dictates of the genre to which they belong. It is therefore basically a question of being able to manage one's troops and possibly one's structures, in such a way as to defeat the enemy forces and obtain victory. As for the units, these are divided into classes such as archers, knights, foot soldiers, spearmen, catapults, each with strengths and weaknesses; these are managed during the clashes largely thanks to the rock / paper / scissors formula, even if it is not actually the only strategic element to consider. In fact there are extra skills, two for each type of unit, capable of being able to determine the fate of a battle; for example, you can set fire to a forest when the enemies are crossing it, or bring down a landslide near a mountain, or position the archers in a static way so as to increase the firepower while lending the side to attacks from behind, or still organize an ambush and so on. A decidedly important aspect in the economy of the game, which combined with the management of resources and the element of land with different qualities for crossing and camouflage give the idea of the great depth of Autumn Dynasty. In general, what raises the most doubts in the face of a product of this complexity on a touch device is the ability of the interface to support all the characteristics of the gameplay in a satisfactory manner; luckily the Bulkypix title manages to convince even from this point of view, and after just a few minutes of play it becomes very simple to obtain the necessary familiarity in order not to run into frustrations of any kind. The selection of troops, their movement, the management of zoom and structures is almost always quick and precise, and the only uncertainties we have encountered have never compromised the game. In addition, Autumn Dynasty is also well calibrated as regards the level of difficulty, fortunately set rather high in such a way as to give great rewards once success is achieved. It is evident that we are not faced with a casual game or one aimed at beginners of the genre, and also the consistent duration of the individual missions clearly gives an idea of the target chosen by the programmers. The addition, thanks to version 1.3, of the manual save function with 4 available slots also solves one of the most serious problems encountered previously. Where, on the other hand, the title is able to be appreciated by anyone is in the graphic sector, which rests on a ~hand painted~ style that refers to the paintings of the Asian feudal era; the result is excellent and evocative, a further sign of the care placed by the programmers in every aspect. Last mention for the multiplayer, both locally via bluetooth and online complete with voice chat. Unfortunately, the community does not seem to be particularly robust at the moment, and the risk of finding unserious users is always present. In the event that everything goes well, however, sorceressre challenging a friend, the multiplayer represents an absolutely welcome and useful addition to extend the already excellent longevity.", "date": "2012-07-16", "grade": "9.0"}