{"name": "Morti viventi in salsa freemium", "ref": "https://multiplayer.it/recensioni/105980-zombie-hq-morti-viventi-in-salsa-freemium.html", "text": "The Free Game of the Week is Multiplayer.it's appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to shell out even a cent. What would you do if, all of a sudden, the lights of big cities suddenly went out and sinister wails rose from the darkness? The protagonist of Zombie HQ has few doubts and knows how to survive a zombie invasion, so first he finds an armory and stocks up on pistols, shotguns and magazines; secondly grab one of the fire escapes of a building and climb up to the roof. The undead generally don't open doors, especially if they are locked, and they can't climb, so this is a perfect place to establish a headquarters and plan your next moves from there. This incipit, in the title developed by Fuse Powered and produced by Rebellion, takes place in a dynamic way and with the connotations of a simple tutorial, designed to make us quickly become familiar with the control system and the mechanics that regulate the fights, whether they are distance or close. Once we have established our base on the roof of a building, we will be able to access a map with various missions and a virtual shop for buying new weapons, for upgrading those already in our possession and for improving the physical abilities of the character, who can become faster, more resistant and cunning depending on our choices. This whole system is based on three traditional elements for freemium productions: zombie dollars, gold coins and energy points. The former are easily earned by completing the missions, exploring the scenarios well, even pulling the lever of a slot machine or watching small commercials; the latter represent a more important and valuable currency, it is no coincidence that they are released with a dropper but we can obviously buy ~packages~ of them by putting our hand in our wallet; finally, the energy points regulate the duration of our experience, they are necessary to be able to access the missions and are recharged over time (or through the disbursement of real, clear money). From the point of view of the free experience, let's therefore say that like many freemiums, Zombie HQ can also be played without spending a euro, provided you try your hand at relatively short sessions every day. The Walking Dead The game structure immediately gives the impression of being very solid and full-bodied, given that the missions are unlocked according to the level of experience and are immediately quite difficult, especially when bosses are involved. In some cases we are simply asked to wipe out the zombies from a scenario, in others to collect certain objects trying not to get eaten in the meantime, or even to escort some survivors and protect them from the attack of the undead. Given the twin analog shooter-style setting, it is clear that Zombie HQ gives its best when our character wields a firearm, preferably a very powerful one, but ammunition is limited and we therefore have the possibility to switch to any moment, via the press of a button, to a melee weapon which in the early stages is a mace covered in barbed wire. Unlike many shooters, however, we are not asked to direct the fire with the right thumb, nor could this solution have been combined with the concept of limited bullets. In its place we find an automatic aiming system, which locks onto the target closest to us but which we can manage by directly touching the target on the touch screen, as in the case of explosive barrels. To complete the picture of a quality product we find an excellent technical sector, with fluid and detailed polygonal graphics, an essential but atmospheric sound accompaniment and, above all, a noteworthy direction.", "date": "2012-07-14", "grade": "8.4"}