{"name": "Puzzle game o platform?", "ref": "https://multiplayer.it/recensioni/105254-tiny-big-grandpas-leftovers-puzzle-game-o-platform.html", "text": "The protagonist of Tiny & Big: Granpas Leftovers is a semi-anthropomorphic curd named Tiny. A penny apparently helpless but with a sharp wit that allows him to use tools of all kinds. All the equipment is granted to us as soon as the tutorial is completed, and this significantly shortens the longevity, but on the other hand, as we will see, lengthening the stock would have made little sense. The grappling hook allows you to drag blocks and objects not anchored to the ground while the propulsion rocket allows us to push them and above all to move them even when they are out of reach for the grappling hook. But the absolute core of the gameplay is a very powerful laser with which to cut stone blocks, bridges, structures and huge monoliths with the aim of making our way or neutralizing Big. This is our antagonist, a decidedly unpleasant blackish bean who escapes us from level to level, becoming stronger and stronger. Big has stolen a pair of very powerful underpants imbued with immense power and has absolutely no intention of using them for beneficial purposes. Our task, of course, is to recover the precious item of underwear, which among other things paves the way for an already planned sequel, thus putting an end to the crazy intentions of the crazy villain. In short, the puzzles of Tiny & Big: Granpas Leftovers are the levels themselves. Places to cut and shape to build a path towards the evil antagonist. The solutions for each movement are multiple and the fights with Big, who uses telekinesis to throw stones and buildings at us, allow for various approach possibilities ranging from the unbridled race to the senseless destruction of almost the entire level. However, it is necessary to be careful: often there is emptiness and certain death below us, abusing the laser, in these cases, could prove to be counterproductive. A peculiar title The initial impact with Tiny & Big: Granpas Leftovers is nothing short of unsettling. The tutorial, which wants to emulate an old computer simulation, explains how the weapons work, but between the greenish graphics and the cubes suspended in the void the panorama is bleak. Fortunately, when the introduction gives way to the actual game, we are faced with more refined levels that mix ancient Egypt, the old west and post-apocalyptic science fiction. The graphics finally take shape and however modest, with not exciting textures and Spartan models to say the least, they are still acceptable and have a peculiar style. The canyons alternate with huge ancient buildings while everywhere funny stylized moles emerge from the ground to return to hide a moment later. Throughout this huge monoliths fall from the sky and the noises are accompanied by large onomatopoeic writings, in American comic style. The plot is specious, even if in some situations nice, while the music is somehow central with a series of hidden cassettes for the game levels that allow us to unlock new tracks. Unfortunately the songs, despite being catchy, are repetitive but the number of pieces and the ability to switch from one to another remedy the thing. The few texts, however, translated into Italian, are not accompanied by speech but must be satisfied with some funny lines in The Sims style. Physics, platform-style jumps and the laser cutter, together with grappling hook and rocket, make the gameplay quite varied but it is impossible to work miracles and the limits of level design quickly become apparent. The open maps certainly do not allow a cure comparable to that of a puzzle game bound to closed environments and if we add to this the possibility of cutting almost everything, the degree of challenge ends up being affected. Furthermore, the peculiar situations are limited to encounters with Big while the rest of the game sees us running between canyons and locations that are all similar to each other. In short, the strength of the title is the freedom which, despite everything, ends up creating peculiar situations, with immense blocks of stone flying at us as we run along slender ledges or make our way along the stairs of a tower.", "date": "2012-07-12", "grade": "7.5"}