{"name": "Intrappolati e felici", "ref": "https://multiplayer.it/recensioni/105681-la-mulana-intrappolati-e-felici.html", "text": "La-Mulana is a video game developed by Nigoro and released in 2005 on PC. A fantastic remake was released in 2011 for the Wii, but remained confined to the Japanese market. Europeans and Americans never had a version of their own and therefore locked themselves in their bedrooms to play Super Meat Boy, harboring envy for the Japanese players. But a year later, great news refreshes all of us: Nigoro has signed an agreement with Playism, a Japanese digital delivery platform through which he will release a PC version of the remake of La-Mulana, this time also in English. So let's rejoice, we masochistic players of the old guard, because we will be able to stay awake at night exploring labyrinths that wicked civilizations have littered with traps. In the role of an adventurer identical to Indiana Jones - he even has a whip - we will then set off in search of our father, an archaeologist who disappeared in the ruins of La-Mulana. But we won't be alone. In addition to the various characters that we will meet during the exploration, we will be able to count on the wise man of the village. In fact, this elderly man obsessed with video games gives us a laptop to always carry with us. Among its many functions is that of receiving the old man's emails, which contain useful advice accompanied by senile ravings. Of course you can ignore grandpa's bland suggestions and do it all yourself. On the other hand, the holidays are near: with all that free time, who knows, you might actually finish La-Mulana. The return of the thinking player La-Mulana is a 2D side-scrolling platformer that offers an open world to explore. You can freely go around the ruins and reach even very advanced sections, indeed it is essential to do so, because everything is connected. In fact, sometimes it happens to buy objects such as winged sandals that prove useful only later or to read a clue that suggests the skill necessary to continue; hidden ability who knows where. And then on with the search. Be prepared to retrace your steps often, solving puzzles along the way that open up new areas to explore. Luckily, there are some must-have items that keep you from smashing your keyboard prematurely. Among weapons, gadgets and ROMs for the laptop there are dozens of items, but some of them must be found as soon as possible. The rescue cartridge, the Holy Grail, the detector of hidden doors, the map reader and finally the decipherer of ancient scriptures must be found immediately in the first few hours of the game, those necessary to learn the fundamentals by yourself. Once this is done, we are ready to go everywhere with our heads. The rooms are in fact full of treacherous enemies but soon we will have enough energy to defeat them without too many acrobatics and none of them have very complex attack patterns. The real challenge is to solve the puzzles hidden in each room. Luckily, when we do something sensible, a sound alerts us, but the result of our efforts may not be immediately evident. Perhaps a chest has opened a few rooms up, or a platform has appeared from the mouth of a statue we left behind. However, each macro area has a hidden map to discover, and all the rooms are named with a name that often hides a hint. There are also engraved stems and skeletons of other adventurers around with a message to interpret. You will have understood that there is a lot to go around and lots of rooms to explore, full of traps and tricky puzzles. This brings us to a crucial point: sooner or later you will have to resign yourself to taking notes and drawing your own maps, because the ones in the game are not enough. If you love traditional video games, this look will make you sparkle with joy. Otherwise you'll think you've landed in a nightmare of pixels and that the devil is after you to make you pay for some terrible sin. LaMulana and Windows 7 On the Playism website we read that La-Mulana is not compatible with Windows 7. However, we managed to launch the game by starting it in Windows XP service pack 3 compatible mode. To do this, right-click on the installation file and choose ~properties ~, then ~compatibility~. Now choose the option to run the program in Windows XP service pack 3 compatible mode and click OK. You may need to run the file as an administrator. If you don't lose, you don't win La-Mulana teaches the player his own rules, leaving him free to make mistakes and die. With the exception of the bosses however, the enemies aren't the worst pitfall. In fact, the problem is the playing area, which is truly boundless. Exploring all the rooms and finishing La-Mulana takes weeks of hard work and many sheetsi of squared paper. But it can very well happen that you never finish the adventure. However, this is not a problem, the spirit of La-Mulana is that of the good old days, when you called your friends for advice on how to overcome a dead end. Or we got stuck. Looking for the solution on the Internet would ruin the pleasure of playing; much better to forget everything for a while and resume the game after some time - perhaps without setting fire to the maps in the meantime. However, rest assured that every effort will always be rewarded. There are for example hidden ROMs to collect and load on Lameza's laptop, each with its own memory footprint, so that sooner or later you will have to decide which ones to install depending on the situation. Furthermore, our hero can rely on various special weapons, not to mention the slew of gadgets and magical items to buy or unlock. In short, there is always something to discover and every progress opens up new paths. So much so that often, encouraged by the loot collected, it happens to go too far without going back to save. And you all know what happens to the avid gamer. On top of all that La-Mulana looks gorgeous in this remake. The enemies are original, drawn with vivid colors and love for details, an excellent example of pixel art. Also this version includes the DLC that was intended for Wii, with an additional area and a timed mode. Only the controls suffer from the woody effect typical of older games, although they are now smoother than the original version. Controlling Lameza while jumping is still awkward and you can't run and hit at the same time. Small things, however: a vintage player has seen this and more. And he surpassed it.", "date": "2012-07-09", "grade": "8.8"}