{"name": "Chi ha paura dei fantasmi?", "ref": "https://multiplayer.it/recensioni/105701-chi-ha-paura-dei-fantasmi.html", "text": "Let's put it this way: it could have been much worse. Because if it is true that we are now well beyond the fruit of the Wii life cycle, when we are roughly scraping the bottom of the barrel looking for maximum yield with minimum cost, it is equally true that a remake like Project Zero 2: Wii Edition represents an at least appreciable return, a pearl of the survival horror genre even more welcome for those who missed it 8 years ago on Playstation 2 and Xbox. Of course, one could argue that, locked up within the Japanese borders, the now cold corpse of the fourth chapter still lies, made exclusively for Wii by Suda 51's Grasshopper 4 years ago and never considered worthy of arriving in the West. But there is a whole literature of Nintendo's questionable choices regarding localizations, and the gossip refers to a discussion between the Kyoto house and Tecmo regarding changes to the controls on which an agreement could not be found. Fortunately, there are users, thanks to whom translation patches have been created that are easily retrievable on the net. But enough about what wasn't, let's go back to what is: Project Zero 2: Wii Edition, ready to give thrills never so welcome as during a hot summer like this one in progress. Photogenic ghosts Tecmo's approach to survival horror certainly does not hide its roots linked to the Japanese scene which was so fashionable in our area about a decade ago: Silent Hill 2 in some respects, but above all films like Ring and Ju- On just to name a few. A very elegant, disturbing, disturbing and persistent type of terror, miles away from Resident Evil's shotgun-blasted brains, so to speak. The protagonists are twin sisters, Mayu and Mio, who mysteriously find themselves in a Japanese village haunted by spirits and with a terrible story behind them. In reality, one of the greatest strengths of Project Zero 2: Wii Edition lies precisely in the narration, and in the ability to slowly and piece by piece reveal the reality and the bond between the heroines and the inhabitants. It goes without saying that the relationship between them is certainly not friendly, and a few minutes are enough to understand how ghosts pose a threat that should not be underestimated. But how can two scared and fragile girls be able to stand up to an entire village full of ghosts? Soon said, thanks to the Camera Obscura; a sort of decidedly vintage camera but capable of exorcising spirits simply by literally taking pictures of them. The presence of films of different effectiveness, power-ups to be collected and qualities to be improved by spending the appropriate points makes the Camera Obscura a fascinating tool to use, which in any case manages to only partially alleviate the sense of fear, insecurity and oppression that the game transmits to the perfection. Also because the combat system offers sufficient complexity, linked to framing times and proximity to the subject to be hit to maximize the damage done, such as to marry perfectly with the balance of a product of this kind. The structure of Project Zero 2: Wii Edition is clearly hand in glove with the dictates of the era of its original debut; linear progression, the need to solve simple puzzles mostly related to the search for key objects and the great woodiness of the controls are the foundations of most of the exponents of the survival horror genre which lived its golden age right around that period. In reality though, despite the years that have passed, the game has aged unusually well; either for the retro charm, or because technically Wii has seen much worse, or simply for the quality of the narrative plot, Project Zero 2: Wii Edition can be tackled in 2012 without too much effort. Of course there are ~buts~... Two and a half ounces came, shall I leave? For this version, Nintendo has well thought of not limiting itself to doing the homework by directly converting the original title; on the contrary, more or less important changes and additions have been made, starting with the aesthetic aspect of Mayu and Mio. The polygonal models of the twins have in fact been heavily revised, giving them a slightly more adult and ~modern~ look as much to the simple physical structure than to the clothing worn. If the slight graphic cleaning, wide screen support, new interlude sequences and the repositioning of the camera in third person are welcome details but not intended to affect the gameplay, more interesting is instead the choice to add a sort of ~minigame~ in the occasions in which the protagonist finds herself having to collectere any objects, a situation destined to repeat itself many times during the adventure. In reality it is not exactly a new idea, as it is already present in that fourth chapter never published in the West, but so be it; in practice, instead of simply having to press a key, the programmers' choice was to require the player to hold down the A button during the entire action. This is because, in a totally random way, it could happen to see a quick and deft hand of a ghost go and steal the same object, causing a loss of energy that can only be avoided by immediately withdrawing the arm by removing the finger from the key. An addition that instills tension even during an action as common and apparently ~safe~ as the collection of objects, with a result that can therefore be defined as successful. Sorry we can't say the same instead of the control system, obviously linked to Nunchuk and Wiimote; if the mapping of the keys is practically free from particular criticisms, on the contrary the choice not to use the infrared pointing but simply the gyroscope of the Wiimote is difficult to understand, as well as a source of particular frustration especially during the most agitated sequences. We fully understand that woodiness and the limits of control are an integral part of the same gameplay of old-fashioned survival horror, essential for creating a link between the weakness and vulnerability of the protagonist and that therefore ~imposed~ on the player. But we remain convinced that we could still have done better without distorting this basic need. One last mention for the unedited additional mode created specifically for this version, called ~House of Horrors~ and completely unrelated to the main adventure. In essence, these are sections on tracks within different settings, in which progression is simply linked to pressing the A key. The goal is basically not to get scared (and the system detects any fear of the user based on Wiimote and Nunchuck shakes), performing actions such as collecting hidden dolls or photographing ghosts. To tell the truth, this is not a particularly effective solution, and the novelty effect soon fades away, leaving room for a discreet boredom.", "date": "2012-07-09", "grade": "8.4"}