{"name": "Un'avventura zeppa di sorprese", "ref": "https://multiplayer.it/recensioni/105601-spelunky-unavventura-zeppa-di-sorprese.html", "text": "You can't talk about the authenticity and value of the indie scene without mentioning the splendid Spelunky by Derek Yu, a game released for free in 2008 and considered by popular acclaim as one of the best examples of good game design. Seen on the surface, Spelunky presented itself as a simple platformer that borrowed elements typical of roguelikes, such as permanent death or ever-changing levels with each game, yet the more you played it, the more you realized you were in front of a truly unique, capable of lassoing the player and making him fall in love with his very strict rules one death after another. For its long-awaited debut on Xbox Live Arcade, the little pearl of the Californian developer has put itself in the game, leaving aside the old pixel art and now showing off magnificent vector graphics that are much more appealing to the mass audience. But in the heart, fortunately, an extremely hardcore experience remains in which death is not only a way to punish those who play badly, and rather becomes a tool to teach them new rules and mechanics through experimentation and direct experience. In short, death as a life lesson. The thousand and one deaths Spelunky opens in the most concise and direct way, with an introductory sequence in which a sort of funny Indiana Jones enters the entrance of a mysterious underground temple. He doesn't know what dangers await him, and like him neither does the player, but the aim is to reach the depths of the dungeon in search of the City of Gold. At the cost of losing your skin thousands of times, of course. Equipped only with four hearts, four bombs to open passages and four ropes to climb high platforms, the little adventurer must try to reach the hidden exit in the deepest part of each level from time to time, avoiding traps and using his own whip to get rid of spiders, bats and other dangerous creatures. The protagonist's life is perpetually hanging by a very thin thread, and dying is as easy as collapsing a house of cards: a snake hidden in a vase, a badly placed bomb or a pool full of piranhas are just some of the innumerable ways in which possible to leave the feathers, but the death of the player triggers what is undoubtedly one of the most interesting mechanisms of Spelunky. As in a typical roguelike, each Game Over is followed by a new game in which the structure of the level changes completely in order to offer an ever-changing experience, in which the road ahead, the enemies encountered or the hidden treasures are never the same. those of the previous game. And between damsels to be saved in exchange for a heart, welcoming bazaars in which to buy objects, sacrificial altars of the goddess Kali and cursed totems, the variety of each dungeon is nothing short of impressive. Usually the problem of many roguelikes is related to the unpredictability of randomly generated levels and the inability to offer interesting situations such as those of ad-hoc scenarios, but behind the apparent randomness of Spelunky's environments there is a brilliant algorithm: traps , treasures and monsters combine in such a way as to create sensible and captivating circumstances, but at the same time the player's equipment and the items in the level are taken into account to ensure that there is always a solution for every obstacle. Everything is procedural, but at the same time everything follows the stakes established by the developer. This trick ensures that the game, while kicking the user in the back with its high difficulty, never gives the impression of being unfair, and with each defeat you are always aware of your mistakes and your responsibilities. Also thanks to a control system so improved compared to the 2008 version that it fits like a glove on the Xbox 360 pad, both when pinpoint precision is required, and when you decide to run and jump from one platform to another a sawn-off shotgun. Like Super Meat Boy, Spelunky's design respects the player and doesn't underestimate his ability to learn and improve, but the more you play it and the more you learn its mechanics, the more you explore its caves and the more you discover tricks and strategies, the more you die, the better you become at avoiding being taken by surprise again. The structure of Derek Yu's work is based on foundations made of cause and effect, risk and reward: is it a good idea to use the last bomb at your disposal to open a shortcut to the exit? Is it worth risking your skin to reach a treasure surrounded by traps? Or again, how the old merchant would take it if we decided to steal the magic cloakor for sale in its bazaar? Every action must be weighed and every situation analyzed in search of a catch or a hidden trap, although stalling too much means dealing with the appearance of a terrifying specter ready to chase the protagonist until he kills him. Xbox 360 goals For those who love to earn their goals tooth and nail, Spelunky offers some really nasty ones: tricking the player with a very quick ~Complete the tutorial~, the game offers a series of challenges that are not really within everyone's reach, such as completing the game without using shortcuts, without collecting treasure, or in an 8-minute time limit. Others can be conquered by accessing the different environments, but to complete your diary 100% you will need to play thousands of times (ah, there's a goal for that too!). Alone or in company Solitary exploration and the need to rely only on one's own strength have been at the heart of the Spelunky experience since the original version created with Game Maker, but the debut on Xbox Live Arcade marked the introduction of an unprecedented component local multiplayer. The entire adventure can now be played cooperatively, which slightly reduces the difficulty but at the same time adds a new strategic dimension, pushing the two, three or four friends to have an approach based on sharing objects. It is also curious to note how naturally the game's mechanics adapt to the Deathmatch option, in which you have to take advantage of the objects scattered around the scenario to take out your opponents and try to survive until the end. In a manner vaguely reminiscent of Bomberman, great space is given to the use of explosives, which can be launched directly at other players or allow you to interact with the scenario by creating dangerous chain effects. Although four challengers may be too many for the small size of the arenas, here too the attention to design is evident: the game penalizes those who remain in the same position for too long, while those who have been killed can continue playing in the form of a ghost and annoy the survived. Yet the beauty of Spelunky doesn't lie in the collection of points, unlockable achievements or online leaderboards, and even getting to the final screen becomes secondary. Living an exploratory adventure that is always new, personal and unpredictable, never knowing what to expect and the feeling that there is always something to learn or to be amazed, to die in hilarious ways or to discover incredible secrets. And then go and tell your friends about it when you meet at the bar. All these things together make Derek Yu's platformer a work that in the long term, we are ready to bet, will be remembered as one of the pillars of the platform genre and among the simulacra of the modern indie scene. Even more than he did with Aquaria, the US developer focused on the video game's ability to tell and express itself through its mechanics and design, bringing the medium back to its roots without resorting to extraneous narrative devices. Spelunky's journey is in fact also and above all the backward journey of a game designer who grew up loving Zelda and Super Mario Bros., the charm of exploration and the excellence of gameplay. The influence of the old glories is more than evident in this game originally born without any commercial ambition, but Derek Yu is not limited to being a developer who has been playing for twenty years, and instead proves that he knows how to distinguish and extract some of the fundamental aspects that they can enrich a modern game. And this is what distinguishes a tribute to the old classics from a work destined to become a new classic. Don't call it sexist Lately there has been a lot of talk about how machismo reigns supreme in video games, and there is no doubt that someone would have objected to Spelunky: after all, in the game it is possible to transport the defenseless damsel around the level, use her to trigger some trap, throw it at enemies or sacrifice it to the goddess Kali in exchange for a pair of boots. Personally we don't feel like pointing the finger at the comedy of the game, but to avoid any accusation from the more sensitive users, the author has added the possibility of replacing the woman in red with a male counterpart or a puppy dog. We recommend activating the random selection, so that each level has a little surprise.", "date": "2012-07-07", "grade": "9.5"}