{"name": "The Walking Dead - Episode 2", "ref": "https://multiplayer.it/recensioni/105453-the-walking-dead-episode-2-istinto-e-ragione.html", "text": "We begin by swinging an ax on a dead man's head. Which makes a disgusting noise. But as long as he's dead we can still bear him. Unfortunately, in the woods, attracted by the cries, we also discover a group of kids. One of them has one leg caught in a leghold trap. There is no time to think: zombies are everywhere, the young man's friends are screaming and our companions are urging us to make a decision. Quickly. To you the thrill of experiencing this dramatic moment firsthand, we stop here with the story. However, we anticipate that what happened in the woods is nothing compared to the terrifying situations that await beyond. Conflict, anger, fear, animal instinct and painful humanity are present in even greater doses than in the first episode. And now everything is more difficult because we know our companions better and feel them close. Especially Clementine, who proves to be the exceptional child that no one could ever abandon. We also have to face the choices made earlier, which have borne fruit, some good, some rotten to the core. But there's no time for regrets: the dead are dead, even if they're walking now. And Doug is now a memory. In his place is Carley, who at least knows how to use a gun. But Doug was a good boy, an ingenious one at that. We're sorry he died. Who knows how things would have gone if he had still been with us. Here is the meaning of this series: to face the irrevocable consequences of our decisions. And carry the weight of it. In the world of The Walking Dead, as in real life, there is no save button. Better a dead man at home than a living man at the door At the end of the first episode we left our group of survivors barricaded in the motel complex. Now they are protected from the zombies but the fence they erected can't keep out hunger. The faces of our companions are hollowed out and the tension rises as the days of fasting accumulate. Lee is not the leader of the group, a role that Lilly and Kenny dispute by dint of mutual accusations, but The Walking Dead: Starved for Help pushes us to get involved. In fact, we will soon have to choose which side to take and make decisions that affect everyone. Decisions that always have bitter consequences for someone. Rationing the food is the easy part - after all, there are children in the group. It's when two strangers show up at the motel looking for gas that things get really complicated. They say they come from a nearby farm and that they can offer us accommodation and food if we fill up their tanks. The offer is tempting but the climate of tension fuels the paranoia. From here on, the theme of hunger develops with all its atrocious consequences. There is no more respite for Lee: Lilly's father torments him by reminding him of his past, Clementine needs him, the group is about to split and everyone can pose a threat. Who knows if there is at least one woman in the group with whom Lee could be in a romantic relationship. Lilly would be an ideal candidate, but we have to watch out for Larry. Could he ever love us if we decide to abandon his father in his time of need? This baggage of conflict weighs on Lee and on the player. That's why Starved for Help is so engaging. For three hours we were held in suspense, in disbelief at the unfolding of events. Expect some scenes so real and chilling to test any moral value. On the other hand, the second episode does everything to convince us that, in a savage world, man is a wolf to man. But we can prove the opposite. If we have the strength. We are all good at talking We have not yet said a word about the controls and the game system. In fact, there isn't much to say. Be prepared for some hectic moments of pressing a key within the time limit, but don't expect to solve puzzles. The objects to interact with are very few and the puzzles are short moments in which Lee does what is obvious to do. On the other hand, there are numerous narrative crossroads that depend on our choices. And compared to the first chapter, action scenes abound in which to channel the repressed aggression of the protagonist, simply by framing the enemy with the pointer and pressing a button. Easy to do, but the violence of Starved for Help is a punch in the stomach. On the other hand, if we stuck to the puzzles or repeated attempts to open the head of a zombie, the energy of the story would collapse. Very few video games are capable of keeping a player on their toes for so long, and to do that The Walking Dead needs to keep on telling stories. Also because the writers have inserted subplots that make it more difficult to do whatany choice, stimulating us to continue after each break. The emotional burden is such that we too, as players, come out of the situations we have experienced changed. And when the final moment arrives, the one that confronts us with the seemingly most banal decision, we discover a new awareness within ourselves. Even if the part of the immaculate hero was written out of the script. In fact, too many times we feel that we have done the right thing and despite all the restlessness eats away at us. This conflict is clearly highlighted by the new setting, with the contrast between the delicacy of the colors and the brutality of the tones. The Italian is not dead yet Thanks to the efforts of the amateur translation group CrybioLab, PC owners can download the patch to play the first episode of The Walking Dead with Italian subtitles. The patch for Starved for Help should also be available soon.", "date": "2012-07-06", "grade": "8.5"}