{"name": "Advance Wars: Dual Strike", "ref": "https://multiplayer.it/recensioni/advance-wars-dual-strike.html", "text": "history repeating The last episode of a series famous in Japan and only appearing in the West with episodes for the GBA, Advance Wars: Dual Strike is certainly not a title that breaks with the past. In contrast, the game mechanics have remained virtually unchanged from the episodes for the previous Nintendo handheld, as well as much of the cosmetics. As if to say: those few who have not loved the GBA editions can safely stay away from this Dual Strike, since it would hardly be able to change their mind. On the contrary, for fans of the series, the latest effort by Intelligent Systems is yet another confirmation of the talent of Japanese programmers, as well as the goodness of the franchise in question. In reality, the very first impact with Dual Strike could disappoint those who expected an adaptation of the graphic system to the greater potential of the DS; evidently the intention was to adopt the path of continuity, or it was preferred to recycle as much as possible in order to shorten the development times of the product. Whatever the truth, Advance Wars: Dual Strike is still a game that is anything but unpleasant to look at. The style is in fact a very colorful and really spot on super deformed, the settings are detailed and characterized by an excellent variety and the character design is well made. However, the fact remains that compared to the GBA, the differences are very few. The sound, on the other hand, confirms the excellent qualities of the Nintendo laptop in this sense: the stereo speakers do an excellent job of reproducing the pleasant music tracks and effects that fit perfectly into the spirit of the game. A lot of old and a little new As already mentioned above, Dual Strike also offers an extremely faithful transposition of what has already been seen on the GBA in terms of mechanics, with some welcome additions which however do not revolutionize an extremely well-established formula in any way. In a nutshell, it is a question of commanding a small army of men and means against an opponent within locations of limited size. The rhythm of the game is marked by rounds, during which it is necessary to organize one's movements and activities in a strategic way in an attempt to prevail move after move until the final victory. The maps are divided into grids of squares, which represent the unit of measurement on the basis of which each unit carries out its movements and attack area. Among the innovations compared to the past, the possibility of using two commanders at the same time should undoubtedly be noted; these are nothing more than the alter-egos with which to face battles, each with particular characteristics and special abilities. Using two of them offers the possibility of choosing which of the two to control directly, as well as being able to release the special attacks of both by combining them for an even more devastating effect. Another novelty lies in the presence of a number of battles that take place on two different fronts (for example land and air), each of which is entrusted to a screen. And so while in the lower one you fight on land, in the upper one - otherwise dedicated to displaying statistics and various useful elements - you collide in the clouds. In reality, direct control is maintained only on the battlefield of the lower screen, while with the upper one it is possible to interact in a less direct way by sending support units or imposing the tactic to be used. An interesting and all in all successful choice. Finally, as regards artificial intelligence, also in this case we are on the good levels encountered on GBA, even if there are some decisions by the CPU which denounce the limits of ~adaptation~ in more complex situations. I feel strategic The stylus control system is immediate and perfectly suitable for controlling every aspect of the title; nevertheless, the need to interact with elements that are sometimes very close to each other denounces the non-impeccable precision of the touch screen on some occasions. For example, it is not uncommon to find yourself controlling a unit instead of the one next to it as you intended to do, just as it can happen to launch an attack against an enemy too close to the real objective. While most of these ~mistakes~ can be corrected by undoing the action and redoing it correctly, some players may prefer the ~standard~ D-pad and button control system, appreciating Intelligent's full support for that. Systems for this option. The longevity of the title is guaranteed not only by the excellent number of maps in the story modand, but also by the presence of a full-bodied multiplayer mode that allows you to challenge human opponents via wireless connection both in multicart and with a single game cartridge. As if that weren't enough, the possibility of creating your own maps, possibly to be exchanged with friends, is back in this DS edition as well. On the other hand, the mini-game that abandons the turn-based mechanics to become a kind of arcade shooter should be forgotten; really bad, but fortunately nobody forces you to play it. Finally, a last note should be raised for the story that surrounds the events of the main single player mode, often long-winded, trivial, boring and cloying. Comment Advance Wars: Dual Strike is yet another high-quality title available for the Nintendo DS. While not deviating almost at all from the GBA versions, introducing only novelties of limited specific weight, the Intelligent Systems production also confirms on the new laptop of the Kyoto house the goodness of a game mechanic almost devoid of defects. The latter, in any case minor, are rather to be found in a verbose and not very intriguing narrative, in an improved artificial intelligence and in the excellent but not impeccable precision of the nib in carrying out some particular action. But it is a question of looking for the nitpicking of a title that is advisable for every DS owner who loves the genre and not. Pros: Almost perfect game mechanics Impressive longevity Graphics perfectly suited to the purpose Cons: Long-winded and uninteresting narration Touch screen not always accurate Artificial intelligence can be improved Despite the legitimate (?) doubts aired by many since the presentation of the console, the Nintendo DS touch screen control system has proved to be a definitely valid choice for a great variety of game genres. If among these it is difficult to include that of 3D platformers (Mario 64 DS is the most shining example), a very different story must be made for strategic titles, better yet turn-based, whose calm pace marries perfectly with the interface nib base. It goes without saying then that the DS + Advance Wars combination turned out to be really excellent.", "date": "2005-09-09", "grade": null}