{"name": "La settima onda", "ref": "https://multiplayer.it/recensioni/105310-asphalt-7-heat-la-settima-onda.html", "text": "Let's face it: Gameloft has never had a great reputation. Last year some international newspapers reported the testimonies of former developers who accused the French house of subjecting its employees to exhausting shifts, especially in proximity of a deadline. Then there was the clear turn towards freemium productions, which as we know do not represent the clearest the gaming market has ever given birth. And now what happens? It happens that Asphalt 7: Heat has arrived on the App Store (not yet on Google Play, however: some problem must have arisen) at the price of only 79 cents, whereas the sixth episode, for comparison, cost 5.49 at launch EUR. A gift to fans of the series? An aggressive policy to expand the audience? Whatever the reason behind this initiative (which, however, is not indicated as a promotion anywhere), the result is that we were able to buy the game for very little money and install it on iPhone 4S and on the new iPad, thus experiencing all the facets and technical optimizations. Let's start immediately by saying that innovation is not part of Asphalt's DNA and this concept has been clarified several times over the last few years: the Gameloft franchise remains tied to its tradition and to a solid but distinctly arcade gameplay, in which boosts and drifts in urban scenarios never so varied and detailed. And then, well, there are the numbers: seven different classes of cars for a total of sixty cars (there is even the DeLorean from ~Back to the Future~...), all upgradeable; fifteen tracks set on the streets of New York, Paris, Reykjavik, Rio, Shanghai, Tokyo, Hawaii, Havana, the Alps, London, Los Angeles, Miami, Moscow, Nassau and New Orleans; a career mode made up of fifteen championships that are unlocked as we win races; and finally six distinct modes: from the normal race to the expulsion (the last one in each lap is eliminated), from one against all (in which the opponents are physically eliminated) to the perfect driving sessions, from the ~the best~ mode to the drift competitions. All this is seasoned with two further possibilities: the quick race, to be played with the parameters we prefer, and multiplayer both locally and online, for up to five players, which however gave us some problems during the tests and we are sure will be fixed quickly via an update. Road test It is certainly on the new Apple tablet that Asphalt 7: Heat gives its best, and not only because of the visual impact, ever closer to that of the current consoles and now limited by a few defects: a fluid frame rate but subject to some uncertainty, textures that move between highs and lows and an actually bad rendering of accidents, which instead of showing us the car that tips over in the air according to probable dynamics, rather presents itself as the fair of sudden and lacking stops of consequences, even if maybe you've just crashed into a wall at three hundred per hour. We were saying, beyond the excellent graphics, the good construction of the cars and an excellent variety of scenarios, on the new iPad the control system via accelerometer has more room for maneuver (to stay on topic) and allows us subtleties than on iPhones, while possible, require careful calibration of the controls. And speaking of commands, there is something for all tastes: by default you have to tilt the device to steer, while acceleration is automatic and the touch screen allows you to activate the brake (by touching the left side) or the boost (by touching the right), but if desired, it is possible to accelerate manually and steer using the touch, although the preset values in the end prove to be the best in terms of precision, responsiveness and comfort.", "date": "2012-06-29", "grade": "8.6"}