{"name": "Premio o beffa?", "ref": "https://multiplayer.it/recensioni/104706-risen-2-lisola-del-tesoro-premio-o-beffa.html", "text": "Risen 2 has been on the shelves for a very short time, and already boasts the first DLC available for download. However, the Piranha Bytes guys are not so workaholic as to have managed to develop a small expansion in the space of a few nights: Treasure Island is an incentive for all those who have pre-ordered their copy, and for this reason it is made immediately available in a free. And who hasn't booked it? You can remedy the slight by purchasing the small package (about 50 Mb) for 9.99. The additional content sees us as protagonists in search of Silverbeard's treasure, a mission proposed by his daughter Patty on board our galleon. The treasure is mentioned in the found diary of the father, which, however, is missing many pages. Having only one available, we set off in an attempt to find it on a new island. How not to make a DLC We wander around Treasure Island together with Patty, the co-protagonist of the story, who is always ready to give advice and indications on the way forward if we have any doubts. The gameplay of this DLC follows that of Risen 2: for each missing page of Barba D'Argento's diary, four in all, we are faced with small linear quests. For example: make your way through enemies, follow the path and find the item, recover a hidden chest. There are no particularly difficult or intelligent quests, environmental questions to solve, complex traps to defuse, but the game runs smoothly towards the epilogue in about an hour of adventure (against the advertised five). The real problem is the size of the island, too small for any exploratory ambitions. Too small, too, to get lost pleasantly as is done in every ~open~ rpg of this type. On the technical-visual front, however, we are talking about the usual Piranha Bytes graphics engine which does its job very well (apart from some sporadic drop in frame rate in specific busy situations), but we must also point out the excessive use of old assets. If this practice can be tolerated and considered normal with regard to the modeling of animals such as alligators, gorillas and rodents, it is less so with the main enemies. But the fact that this DLC was probably cut from the game and not developed afterwards could be the cause of these limitations. Two clues prove it Contrary to what one might expect, the island is neither vast nor adventurous, and is indeed quite linear and straight to travel. The mysterious side is therefore missing, which is fundamental in a pirate title of this caliber. But above all, the pathos that characterizes a large part of the main adventure is missing. We are, in short, faced with a sort of sub-quest of the story. And if only for this there would be nothing wrong. The problem is that our impressions later proved to be well founded: Treasure Island has been an integral part of Risen 2 since its creation, and was later cut and repackaged as a ~gift~ to push the game's pre-sales. Before being put back on sale for the not modest sum of almost ten euros. Two clues make a test, it is said. The first is that the main object obtainable from this DLC is The Pirates' Almanac, already cataloged as ~secret~ in the Risen 2 code, a sign that it was foreseen and developed a priori. The second is that in the campaign the character of Harlok (one of the protagonists of this expansion) is present but not yet selectable before downloading the DLC. The impression therefore is that the producer has decided on a small cut in favor of those who have booked the game and a ~punishment~ for those who have not. But if two more clues weren't enough, let's just think of the fact that this DLC was made available immediately at launch. The question that arises is therefore: who benefits from this policy, given that the community is very attentive to this type of operation? Deep Silver has only one way to make up for it: to produce good additional content for Risen 2 to satisfy the fans who are waiting for them. For all the others or for those who have not pre-sold the game: in our opinion, you can do without this Treasure Island. In any case, don't put your weapons away, because a new island can already be glimpsed on the horizon and the console version is upon us.", "date": "2012-06-18", "grade": null}