{"name": "TERA", "ref": "https://multiplayer.it/recensioni/103942-tera-lmmorpg-piu-sexy-del-mondo.html", "text": "We have already told you several times about TERA, making you participate a little in our climb towards the most advanced areas and the most powerful enemies. A little over a month has passed since the European launch of the BlueHole Studio game, and at this point we think we have got a pretty good idea of the contents and its intentions. As usual, we remind you that we are talking about an MMORPG (Massive Multiplayer Online Role Playing Game, for those unfamiliar with the meaning of the acronym) and therefore of a type of game that is constantly evolving, which can be updated through patches that can solve any problems or add new content. It is therefore not possible to give an absolutely definitive judgment to a package that could be improved or not, our review therefore evaluates what you buy at the time of publication, the contents currently available, in short, what you pay and can play at this precise moment. In a sense, this is where the ass falls with TERA. Many Males Online Role Playing Girls TERA has been involved in numerous controversies, but on one thing we can all agree: technically it is one of the most beautiful products on the market. From this point of view, the comparison with more recent productions, such as BioWare's Star Wars: The Old Republic, proves to be absolutely merciless: the Korean MMORPG moves many more polygons with great tranquility; the client turns out to be unexpectedly light but still decidedly solid and you shouldn't be fooled by the test configuration at the end of the article, because the test was also carried out on a less powerful assembly (a simple QuadCore 3 GHz with 3 GB of RAM) which , thanks to a series of modest compromises, such as the deactivation of the shadows, still allowed us to enjoy the game's exceptional cosmetics peacefully. On the other hand, the management of numerous players and enemies on the screen is a little less stable, especially in more agitated situations such as those proposed in the dungeons: in this case it is necessary to manipulate the options a bit to prevent substantial drops in the frame rate. In general, however, we are very satisfied: we were particularly struck by the splendid variety of scenarios that make up the world of Arborea and the slightly exaggerated but very colorful style that characterizes every single component of this universe. The attention to detail is obsessive, whether it's the bizarre magical glyphs in the sky or the light effects that enrich the shots in each location. Of course there are tricks that have allowed this result, such as the presence of invisible walls which sometimes hinder a three hundred and sixty-degree exploration of the environment and which make the maps more linear than they appear, but it is nothing particularly annoying. On the other hand, some stylistic choices leave us quite perplexed, especially with regard to character design. The selectable races are all quite diversified, aesthetically, and some appear at least bizarre, such as the Popori or the Elin, but perfectly in line with the cartoonish and imaginative style of the game. On the other hand, the appearance of the equipment is questionable, in all likelihood designed by a teenager in a hormonal storm. The choice of displaying each object differently according to the race that uses it is commendable, but let's admit that we were a little disturbed by the iron desire to undress the female figures in an sometimes exaggerated way, especially in the case of the little Elins: it is no coincidence that the producer gaming's European Frogster has decided to do some kind of last-minute censorship of some polygonal models. The extravagant style of the garments also extends to the male bodies, often made a little too effeminate, but while the boys won't mind being surrounded by sexy elves wearing heavy armor in the shape of bikinis and thongs, it must be recognized that TERA from this point of sight he often goes too far, placing the unbridled inspiration of designers at the service of the most vulgar fanservice. In any case, the detail and complexity of weapons and armor make the search for new equipment even more attractive, and this can only be a good thing. True Action Combat The fact that BlueHole can handle the complex Unreal Engine 3 with ease is one of the reasons that make TERA's combat system so enjoyable and innovative. Probably the only MMORPG that comes close to what the Korean developer proposes is Age of Conan, after all, as you already know, in TERA we don't rely on dice rolls behind the scenes but very simply on the player's reflexes and skill. The initial impact is definitely difficult, especially if you're used to traditional MMORPGs like World of Warcraftt or Rift, and after several hours the same problem of managing the excellent interface still remains, however the combat system turns out to be unexpectedly easy to assimilate. It is even possible to set up a joypad and play TERA as if it were a real console action game, and in fact the idea is just that, between combos, dodges and positional attacks. Even professions capable of healing require more dynamism, focusing the player's attention on the central crosshair rather than on the frames of companions. The variety of skills available for each class, among other things particularly diversified despite the overabundance of damage-dealer archetypes, certainly makes every fight a lot of fun, but all this frenzy in the long run also turns out to be a significant Achilles heel: the combat In short, TERA's system is really exhausting, especially in PvE and in particular when facing the BAMs, decidedly more powerful creatures than normal that BlueHole has designed with a nod to Capcom's Monster Hunter. The BAMs have very particular skills and attack patterns and the player is forced to learn the animations and react accordingly: it is theoretically possible to face a BAM of the same level alone, but the clash soon proves exhausting even for an organized group . In general, the BAM idea was only half successful: on the one hand it offers a completely new challenge in the MMORPG environment, on the other we believe that it would have been more appropriate to link them solely to the role of bosses or sporadic group quest objectives ; the game instead tends to place a little too much emphasis on these enemies, especially in the endgame, when killing them repeatedly becomes essentially the main daily activity. The Player Vs Player, in fact, plays an absolutely marginal role in TERA right now, being bound to a simple optional activity without particular purposes or rewards. It is possible to challenge groups of players or entire guilds, it is possible to ~flag~ and wander around in search of more or less easy prey, and PvP is even enhanced by a combat system which, ultimately, rewards skill much more than skill. 'equipment; however, in special servers the difference between PvP and ~griefing~ is really very subtle and it soon becomes more annoying than fun to face other players with an e-peen frenzy. All that remains is to wait for the battlegrounds instantiated in the coming months to enjoy the clashes between players to the fullest, as long as a solid reason is offered to fight each other... Nothing under the dress Unfortunately the exceptional cosmetics of the game, the sound accompaniment of which we haven't talked much but which turns out to be more than ever spot on and cared for thanks also to good dubbing and pleasant music, and such an original combat system, fail to move TERA from the difficult legacy of its home country. Korean MMORPGs have always been synonymous with repetitiveness and extreme farming, and unfortunately TERA is no exception. The combat system is in fact at the service of a linear and antiquated progression, based solely on the resolution of quests that are all the same, interspersed with sporadic narrative missions in which slightly different challenges must be faced. Our character develops as in any MMORPG of the ~theme park~ type: we proceed from one hub to another by completing the missions entrusted to us in the immediate vicinity, after which we are directed to the next hub or region, then the cycle starts again . Although it is not a different structure from that of the most famous MMORPGs, TERA tends to accentuate the ~grinding~ in a worrying way, proposing the killing of enemies as the main objective of the quests, often even the same ones in rapid succession; sometimes we will be asked to collect some objects nearby, but we are far from the structural complexity achieved by other titles: World of Warcraft and The Old Republic, for example, mask the banality of many quests thanks to the narrative context or ingenious subterfuges; TERA, on the other hand, that banality blurts it out unceremoniously and to disguise the usual request to kill a certain number of warthogs ~why yes~, it doesn't even try. It's a pity because soon we tend to accept and complete quests in a completely mechanical way, without caring in the least about what the NPCs have to say: an operation that proves tiring in the long run, despite the speed of experience acquisition is satisfying enough for most of the game. And then, and then The main problem of TERA is undoubtedly the lack of content that afflicts the advanced stages of the game. Without significant PvP sstructured or typical ~raids~ designed to emphasize collaboration and communication between players, in TERA you just have to devote yourself to crafting, dungeons and politics. However, haggling in TERA is not easy: the numerous professions available allow, as expected, to produce weapons, armor, potions (on which the game honestly places a little too much emphasis) and much more: the proposed interface is simple and intuitive, but in general we are not faced with anything revolutionary or surprising. It is therefore a crafting system like many others, even if the requests in terms of materials gradually become more and more exorbitant, to the point of making the growth of the profession more frustrating than profitable. Gold, a monetary unit in the TERA universe, soon becomes indispensable: they are used to travel, to acquire new skills and glyphs that enhance them, to obtain potions, temporary enhancements and so on. They are never enough and to indulge in any vice you need a large amount. Alternatively, you can devote yourself to completing the dungeons, graphically impressive instanced areas but no less linear and repetitive than the rest of the game: the clashes between our group and the megabosses on duty are exciting but also decidedly confusing and the overabundance of graphic effects, sudden movements and enemies involved make these fights less fun than it seems at first glance. Many dungeons can also be tackled at a higher level of difficulty, and are the main if not the only current endgame activity: raid-dungeons will also be added in the future, but we remain equally perplexed about the clarity of the encounters and the client's performance. Finally, the Vanarch political system recently introduced in the European version of the game is quite questionable: the mechanics are quite complex but, in essence, it is possible to elect a guild leader so that he can reign over certain areas for a certain period of time of the game, decreeing taxes, presence or absence of NPCs and other parameters. These elections currently take place by popular vote and in practice it is up to the aspirant Vanarch and his guild to carry out real political propaganda: an interesting idea, certainly, but not without problems, first of all because it is more suitable for an MMORPG than sandbox type than a theme park and then because it relies heavily on the guild, an aspect on which TERA basically places a lot of emphasis, as also demonstrated by the special dedicated quests, but which alienates smaller guilds or solitary players, who will not succeed never to see even from afar this portion of an already quite limited endgame content of its own.", "date": "2012-06-12", "grade": "7.3"}