{"name": "Un gioco equilibrato", "ref": "https://multiplayer.it/recensioni/103866-art-of-balance-touch-un-gioco-equilibrato.html", "text": "Let's face it: after a rather promising start, WiiWare, Nintendo's first experiment in the field of downloadable software, has not had such sparks since. Unlike the Virtual Console on which (but it is the ~amarcord~ nature of the service itself that makes all this possible) it is possible to find dozens of masterpieces that are still well worth the ticket price, the section dedicated to independent and/or casual games is slowly distanced from the clamor of the limelight, either due to a company policy that pays little attention to the needs of the smaller software houses, or due to a user unwilling to keep an eye on such a reality. Be that as it may, among the millions of Wii owners around the world, few today continue to download new releases on a regular basis. But those few know that, in reality, the flow of deserving titles has never actually stopped; a couple of years ago, a full four after the console's release, among these there was certainly Art of Balance by Shin'en, a small German studio that in the past made itself known on DS with a shooter, Nanostray , impressive from a technical point of view and very frenetic and ~caciarone~ from that of the gameplay. Zen and the art of balance With Art of Balance, Shin'en took a radically different path from the one that had made it famous: no more spaceships and special effects, but a calm, almost Zen, puzzle game that made physics and inventiveness its best weapons. Imagine a container, of the shape that best suits you, full of water, from which a small platform emerges; and now imagine having small, simple wooden shapes at your disposal, a cube, a parallelepiped, a hemisphere. What you have to do is arrange these objects on the platform, it doesn't matter in which order, in such a way that, after placing the last one, for at least three seconds none of them come into contact with the water below. Easy, right? Well, but now imagine that the platform is really very small, and there is no space on it for more than one of the wooden shapes: you will have to stack them on top of each other like a tower, arranging them in such a way that they remain in balance; with the simple solids that we have mentioned, things continue to remain almost trivial, but how can we put it if then, little by little, we will have to deal with spheres and crosses, and then with irregular shapes, with strange structures spherical from which, however, emerge four protuberances arranged at right angles, and then again with parallelepipeds which, however, end in two, or better yet only one, on one side only, heavy swellings? And how would you be if, instead of a normal smooth platform, this one began to take on strange shapes, or broke into two or more parts? Not to mention when you would have in front of you more than three shapes to stack, some maybe not usable immediately, and objects of special material and function, such as those made of glass that cannot bear too much weight on top of them, or those time~ which, a few seconds after positioning, disappear. Do you think you would start having problems? It is true; and in fact Art of Balance was one of the most perfect representatives of that category of ~easy to learn, difficult to master~ games so dear to mother Nintendo; an almost trivial concept (raise your hand if you haven't tried to do something like this with the first things you found at hand at least once in your life) which, however, thanks to an out of the ordinary inventiveness and the singular ability to introduce slowly new elements that, without the player realizing it, gradually bring the difficulty to diabolical levels, became a pure playful pleasure and a kind of drug. The 3D effect Unlike other great eShop pearls, in Art of Balance Touch! the stereoscopic effect is not fundamental at all: it does add a further level, this time visual, to the sensation of different solidities that the various blocks are able to give above all thanks to the physics engine, but it is a completely useless level for the purposes of gameplay. However welcome, given that it costs nothing in terms of graphic rendering and is always one more thing: the only warning could be to not shoot the 3D to the maximum, which seemed to us to tend towards a slight doubling, but as usual these are perceptions that vary from user to user and can be placed under control with a very simple touch on the appropriate lever. Balanced above madness All very nice, but why have we told you so far about a game from two years ago? Because Art of Balance Touch!, rather than a real sequel, is the same WiiWare title updated to touch screen controls fromel 3DS and doubled in the number of worlds, from four to eight for a total of two hundred levels. The nice thing is that even the new stages gradually introduce different elements (there is also a type of block towards the end that radically changes the perspective from which you will look at the entire product, but we won't anticipate you more) all strictly spot on and intriguing, which bring the difficulty towards absolutely off-scale parameters, without however taking anything away, indeed adding, for the more ~old school~ among you, playability, immediacy and the very classic ~one more attempt and then I'll stop~ syndrome: personally we it has happened to obsessively repeat one of the more advanced levels in an attempt to complete it, until the handheld batteries run out, and we believe this is enough evidence of how much the game manages to involve you completely in its mechanics. Even those who have already finished the original at the time are therefore justified in buying the new incarnation, which we could define as ~enhanced~ also because of the touch controls, which are even more precise and immediate than those that used the Wiimote. Not only that: in addition to the Arcade mode, there is a new Endurance mode which, in the most classic spirit of Puzzle Games from Tetris onwards, will see you face the levels one after the other without interruption with the objective of the highest possible score; all enriched by an increasingly common list of objectives, thirteen in all. There is also something less, unfortunately, compared to the WiiWare edition, and it is multiplayer, which if already available only locally in the original, is completely absent here: however, we do not feel like making this lack weigh too much , given the tons of hours of singles gameplay that the product makes available to you. Of the technical component, in the classical sense, there isn't much to say. First of all, both the graphic and sound assets are largely recovered from the prequel: therefore we will have floral or abstract themed backgrounds, blocks that manage to give a good idea of solidity, music that does not even get noticed for how ~ambient~ it is and underline the calm and meditative atmosphere of the whole ; in general it can be said that the graphics are perfectly functional to the context, but precisely because of the context, you don't expect who knows what virtuosity. Two different views are available: a closer one which favors precision in placing blocks, and a further one which instead gives you a better overview. On the other hand, the discussion should be deepened for a moment regarding the physics engine, which is essential to correctly convey to the player the sensation of actually stacking objects of different shapes and volumes one on top of the other, and therefore for the success of the experiment: well, even here we are in fully positive territory, and indeed it is precisely the management of physics that constitutes the greatest strength of Art of Balance Touch!. We do not believe that particularly complex calculations are required for the 3DS hardware to manage all in all basic routines in any videogame physics engine, the fact is that the results are spectacular, very realistic and almost ~concrete~: it will be, for example, in spite of how much it may seem at first glance, fun within fun to be able to create a precarious balance but not enough to invalidate a level, and to see the tower collapse with realistic naturalness only after the three seconds required have elapsed; for those of you who are familiar with 3DS games that exploit the various accelerometers and gyroscopes, it will also be almost natural to move the console in a desperate attempt to balance a pile that is inevitably destined to collapse into the water. And this, Shin'en can safely take it as a suggestion for a very welcome sequel.", "date": "2012-06-01", "grade": "8.6"}