{"name": "Alla ricerca di Mister X", "ref": "https://multiplayer.it/recensioni/103753-scotland-yard-alla-ricerca-di-mister-x.html", "text": "After the successes of Carcassonne, Monopoly, Caylus and many other famous board games converted to the iPhone and especially the iPad, the trend could only continue, keeping faith with the ever-green motto which instigates ~strike while the iron is hot~ (or, in this case, as long as it sells). And on closer reflection, this pleasant habit hides advantages both for publishers, of an economic nature above all else, and for users who can thus avoid bulky transport of boxes full of pawns, boards and dice during short trips, without however renouncing the own passion. On the occasion of the thirtieth anniversary of the first publication, Scotland Yard then arrives on Apple terminals, to the delight of the many fans conquered in recent years, victims of the ever-present charm of ~hunting for the criminal~. London smoke Scotland Yard was therefore born as a classic board game, intended for the entertainment of up to 6 players at the same time. In reality, the official rules provide for an apparently unequal fight to be carried out on the game board, made up of 5 detectives and the infamous Mister X, always on the run and hunted down by the gendarmes. The 5 five players who will take on the role of detective must therefore work together to try to block the fugitive, all within the twenty-second turn of the game, under penalty of defeating the law and winning Mister X. The game plan, inspired by a smoky and fascinating London by night, is full of bus stands, taxi stations and underground stops, connected to each other by some colored lines; these stopping points are the only places where it is possible to move on the map, respecting the exact color of the connecting lines. In fact, to move around, only one public transport can be used at each shift, strictly depending on the color between one station and another: yellow for taxis, red for buses and blue for the subway, which allows for longer journeys. Each journey therefore requires a special ticket to be dealt with but, since the coupons are not infinite, they must be managed very carefully. The aim of the game is obviously to capture Mister X, which can only happen in two ways, namely by blocking his escape routes, by placing a player on all the stops around the one where he is currently, or by simply positioning himself above the its current staging post. Also the duration of the round is not generally infinite but must be set at the beginning of the game from a minimum of 30 seconds up to a minute and a half; if no move is made in this time, one will be made at random. So far everything is easy and predictable; the problem is, however, that Mister X's pawn is obviously invisible, unlike the colored ones of the detectives. The only ways to try to figure out their position are sightings, which take place in rounds 3, 8, 13, 18 and 24, and the analysis of the tickets used to move, possible by looking at the game log. Starting from the last sighting and considering the type of vehicle used, it is thus possible to guess its position and try to block it by surrounding it. However, the unknown criminal has a couple of very effective tricks on his side to throw off the investigation, such as the double ticket (which allows you to take two contiguous vehicles and get further away from a difficult situation than usual) and above all the black tickets, totally anonymous and therefore untraceable. Mister X always has two double tickets and at least one black ticket for each detective. At Scotland Yard it is also possible to play alone, with the CPU acting as an aid for investigations or trying to escape, or in multiplayer on the same device, exchanging it to take turns with players present in the same place; the option completes the picture locally via bluetooh or WiFi and above all online via Game Center, with friends or through automatic matchmaking. Unfortunately, at the time of writing, it has not been possible to find any opponent to test this interesting and appreciated feature. Nothing to complain from the point of view of the control system, impeccable, and the technical one, absolutely up to par and above all fully compatible with the Retina screens of the iPhone and iPad. Clearly the same comfort found on the Apple tablet does not exist on the iPhone, but apparently a patch is planned to improve that type of approach as well.", "date": "2012-05-31", "grade": "7.7"}