{"name": "L'incantesimo della spada", "ref": "https://multiplayer.it/recensioni/103334-spellsword-lincantesimo-della-spada.html", "text": "You know Super Crate Box? It is a small indie phenomenon, born on PC (where it is still available for free) and then landed on iOS devices. Within fixed stages that are so reminiscent of those of the original Mario Bros. or Donkey Kong, our goal in the game was to eliminate as many enemies as possible, using the most disparate weapons and trying, from game to game, to survive for an increasingly longer period of time. If you want to know more, check out our review. Well, the new title developed by Fire Fruit Forge offers us the same platform elements and arena-style structure, but inserting them in a progressive and not ~survival~ context, with three scenarios and a total of sixty missions which include, for example, the elimination of a certain number of opponents, the ability to resist a certain number of enemy ~waves~, the conquest of a certain amount of magic cards and so on. Each stage hides pitfalls that make it more difficult to avoid the little monsters that appear from the ends of the screen: in the first scenario there are three sharp spheres that we can use to hit enemies, but which in most cases constitute a danger and should not be touched; in the second we instead have platforms that move according to our solicitations, under which there is a channel in which we must try not to fall; similarly, in the third scenario the whole lower part is made up of lava, which forces us to stay on the platforms, regardless of their stability. Jump and punch The gameplay of Spellsword is typical of action platforms, and this is confirmed by the control system adopted by the developers: on the left side of the touch screen we find two arrows that allow us to move the character left or right, while on the other side there are the two buttons for jumping and sword attack. The latter has a very limited range, which implies a very short distance between us and the possible target in order to score a blow, which contributes to further raising the level of difficulty. Luckily we will have no way of incurring the dreaded ~sudden death~, or at least not at the hands of monsters: an energy bar, initially composed of three hearts, allows us to absorb a minimum of hits before game over. Furthermore, from time to time we will see a red container appear on the screen which can restore part of our health and, therefore, help us survive longer. The RPG element is represented by the ~growth~ of our character in terms of experience and by all that it entails, in this case the unlocking of new objects and new scenarios (the third stage is initially blocked, for example). The collection of rupees during the action also allows the purchase of upgrades for the various spells, with the related ~cards~ that appear at regular intervals during the games and allow us virtually not to strike even a blow, given that some of them they involve the emission of flames, ice crystals, poison and shock waves. Through the power-ups we can precisely increase the number of flames or crystals, or lengthen the duration of the poisoning, and so on. The main game mode, based on missions, is also supported by a survival based on three scenarios and as many difficulty levels, for a total of nine variables. As for the technical sector, as mentioned at the beginning, Spellsword pays homage to the era of 16-bit consoles and therefore offers us beautiful ~pixel art~ style graphics with excellent color choices, discreet animations and rather catchy tunes.", "date": "2012-05-23", "grade": "8.4"}