{"name": "Disco Labirinto", "ref": "https://multiplayer.it/recensioni/103279-disc-drivin-free-disco-labirinto.html", "text": "The Free Game of the Week is the Multiplayer.it appointment which, every Saturday, puts the spotlight on an iPhone app that can be downloaded at no cost. Not necessarily new titles or leading labels but rather, simply, products that deserve to be taken into consideration. Even more so if you don't have to pay even a penny. Anyone who has played marbles on the sand at least once will surely find immediate familiarity with Disc Drivin': just as on the beach one took turns throwing one's ball within a course in an attempt to reach the finish line before the others, at the same way one behaves in Pixelocity Software's debut title, with the substantial differences of using disks instead of marbles, having a whole series of power ups available and being able to challenge players scattered all over the world and not just the own umbrella neighbors... Until the last flick As in many other similar cases, the free version of Disc Drivin' is linked to the presence of some advertisements that appear at the end of each round, to tell the truth not so annoying as to make it essential to purchase the paid version (available still only  1.59). Assuming therefore that the title is highly enjoyable even without paying a penny, there are very few reasons why an iPhone owner shouldn't give the Pixelocity Software product at least a chance. The game is to all intents and purposes a sort of turn-based racing game completely devoted to multiplayer, both local and online: as briefly described at the beginning, the aim is to be the first to complete the three laps of a course, sliding your disc along tracks full of bonuses, malus and obstacles of various kinds. The mechanics are really simple to assimilate, and the clarity and precision of both the interface and the control system effectively contribute to making the title potentially appreciable by anyone. By dragging your finger on the screen you have the possibility to rotate the camera to observe the surroundings, while a swipe from bottom to top is enough to give the desired strength and direction to the puck, which can count on unexpectedly plausible physical routines that make its gait similar to its real-life counterpart on the air hockey tables. The user can therefore have good game in exploiting the inertia of the puck as well as its rebounds on the walls, not to mention the special elements placed along the paths: ramps, boost pads, buffers but also dangerous oil slicks and deceptive platforms capable of flying the puck off the track or sending it back. There is also an indicator that loads with each launch and which, once filled, allows you to use one of the six available powers, ranging from turbo to the ability to pass through obstacles. The design of the 23 tracks currently available is generally more than good, and guarantees exciting challenges for up to four players online and eight locally, manageable with ease thanks to the simple multiplayer options. It is possible to start a challenge with a random opponent, create a game with the last challenged players or invite your friends by searching for them by username. Following the successful example of Angry Words and other titles like it, Disc Drivin' flawlessly exploits the asynchrony of its game mechanics, allowing users to make their move, close the application and return to it when the notification arrives. the opponents have been launched, also contemplating the presence of a convenient in-game text chat. Taken as a simple pastime, the Pixelocity App turns out to be capable of giving genuine entertainment, and the fact that it is available free of charge allows you to easily turn a blind eye to the limits of production: therefore, the look is anything but what an exciting menu, barely functional graphics, ultra minimal sound, an absent single player mode and an imperfect balance of the various powers literally take a back seat to make room for a winning play structure with excellent room for improvement through future updates .", "date": "2012-05-19", "grade": "8.0"}