{"name": "Potere alle donne", "ref": "https://multiplayer.it/recensioni/102781-skullgirls-potere-alle-donne.html", "text": "The powerful comeback of two-dimensional fighting games, truly re-proposed in all guises, can only please the many fans around the world; the genre, which seemed to be suffering from a crisis of creativity, has seen an unexpected relaunch starting from the new Street Fighter IV but, judging by the quality of the title in question (and its numerous revisions) certainly deserved. However, a fighting game with two-dimensional mechanics can show a very technical, almost maniacal nature (this is the case with Street Fighter or The King of Fighters saga for example), in which the level of combat achieved depends only on the hundreds of hours spent in the study of the characters, or ~lighter~, less linked to frames and execution times but on the other hand much more spectacular, as in the case of the various Marvel vs Capcom and to a lesser extent also the very recent Street Fighter X Tekken. Naturally, for the avoidance of doubt, it is good to clarify that in all fighting games there is a dose of basic technique to learn that goes beyond the furious pressing of random keys; however the difference in gameplay between the games mentioned is evident even to a neophyte. However, Skullgirls escapes the clear classification reported up to now; in reality, the Konami title winks at a particular saga, that of BlazBlue and therefore, indirectly, to the equally glorious one of Guilty Gear. Looking for the skull As always, the plot that moves the ranks of the fights present in Skullgirls certainly does not aspire to the award for best screenplay, but it helps to understand the particular context in which these special girls find themselves: the Skull Heart is an ancient artifact, a skull which allows the girl who comes into possession of it to fulfill any of her wishes. However, the power hides a dangerous spell: if the new owner of the coveted magical object does not have a pure heart, she will transform into a dangerous and evil creature, the SkullGirl, who will have to be defeated in combat by the new suitor. To compete for the Skull Heart and thus get to meet the current evil holder, eight special women will face each other, each with particular characteristics. Without going into the details, which will be listed in the appropriate box, it can be said here that the character design of the protagonists is at least curious if not, in some cases, even questionable. ~Trichotic~ parasites that replace the hair, hats with huge arms, humanoid umbrellas are just three of the enhancements that adorn the combative girls, giving them superhuman and almost metaphysical qualities. Femme fatale The 8 terrible girls fighting for the Skull Heart are very different from each other but all certainly fearsome. So here is the 16-year-old student Filia, who hosts a parasite instead of hair, capable of transforming into sharp blades when necessary; the circus performer Cerebella, a busty eighteen-year-old who is very agile but also has a special hat that gives her two huge and very strong additional arms; Peacock, an android girl who, as a fan of cartoons, does not hesitate to throw very dangerous toys at her enemy; the charming Parasoul, with the unusual living umbrella Krieg that releases timed explosive charges; Ms. Fortune, a cat-woman who, after having swallowed the mysterious Gemma della Vita, which belonged to Lorenzo Medici, has the ability to freely disassemble her body while always remaining alive; Painwheel, a sort of failed experiment to try to create a weapon against the Skullgirl but which resulted in a psychopath with rotating blades; the sexy nurse Valentine, slave of the SkullGirl who fights with needles, syringes and drip sticks, and finally the disturbing Double, who behind the meek appearance of a nun hides a hideous shape-shifting monster always at the service of the evil Skullgirl. Playstation 3 trophies The trophies for Skullgirls are only 16, of which 11 are bronze and 5 are silver. Therefore, no gold nor platinum, but the peculiarity of these awards lies in the singular explanation chosen to explain the methods of conquest: not the simple procedure (for example ~Complete the tutorial~) but a phrase full of metaphors, sometimes difficult to interpret . Continuing the example, the silver tutorial trophy is defined as ~Graduation day has finally arrived! Ms Victoria is so proud of you~. The other trophies are no different, so it will be up to the player to analyze the explanations and try to get them all. Technique vs spectacularity Before using any of the available girls in combat, it is advisable to spend quite a while' of time in the useful but tiring tutorial; being released exclusively in digital format, Skullgirls does not in fact have the paper guide that could have somehow introduced the combat system. On the contrary, and this is perhaps one of the most annoying critical notes, there is not even a command list for selectable characters in the game. In fact, the tutorial therefore represents the only way to learn some special shots and above all the basic combos to try to inflict adequate damage. The shot lists are available on the game's official website but the choice not to make them immediately usable seems really incomprehensible; it is true that the most savvy players accustomed to the genre will perhaps have fun discovering the most incisive moves by themselves, however it certainly cannot be expected that all buyers have the time and desire to try their hand at this long and painstaking activity of discovery and cataloguing. When choosing the characters, the system offers three possibilities of fighting single, in pairs or even in triple tag. However, the balance changes accordingly, given that, by choosing only one character, greater damage will be inflicted and life will go away more slowly while as one's team increases, these characteristics will be weakened. The approach to combat combines very technical elements with others purely devoted to the show. The timing of the combos, i.e. the time ~windows~ within which it is possible to chain two or more moves, is quite demanding but not at the level of other reference titles of the genre. The attacks can be low, medium and high, on the ground or in the air, but pay attention, however, to the classic frontal block: since in the crouched ~crunch~ position even medium blows are easily blocked, it is advisable to often assume this position to thus reduce third the probability of being hit. The combos can start from the ground as low or medium, to then become aerial or vice versa and, something not possible in other titles, continue for quite a while even in the air almost as if they were Tekken-style ~juggles~. In fact, in the game the fighters have some skills not present in more ~serious~ titles, such as the double jump or the possibility of making a lightning sprint in flight, characteristics which are however very useful for show purposes. When playing against an opponent who has fielded a team of two or three female wrestlers in the tag system, you can also ~throw out~ the current wrestler, to force the other player to call another one, perhaps in possession of less life or just less skilled in his hands. A function that can also become annoying, if known how to exploit it appropriately. Despite these exceptional capabilities, you will rarely see the execution of combos greater than 10 or 15 hits, except obviously in the presence of particular special shots; finally, it is possible to ~bufferize~ the moves, i.e. anticipate their execution to facilitate the combination, but there is no equivalent of a ~focus cancel~ capable of stopping the animation of a move already performed while maintaining its effects. The reason is obvious: in this case you don't need to interrupt an animation, the shots are chained equally even if you execute it completely, you just need to buffer at the right time. Beautiful and dangerous On a technical level, Skullgirls really offers a high-level show with its 1080p, 60 frames per second, excellent animations and always guaranteed fluidity, thanks also to the very well designed but certainly not full of movement stages. The doubts previously expressed about the character design always remain, sometimes excellent but other times disarming; the number of characters, 8 of which only 6 available at the beginning, is really low even considering the purchase budget price. The classic-style Arcade mode, the Story Mode (enriched by very beautiful drawn scenes) and the Training will guarantee many hours of single player gameplay while the offline and, above all, online VS can as usual make longevity virtually infinite . The online only includes classified and free modes but, at the time of writing, it was not possible to meet anyone, perhaps due to the small population of the servers.", "date": "2012-05-17", "grade": "7.9"}