{"name": "La guerra dopo la guerra", "ref": "https://multiplayer.it/recensioni/103142-warlock-master-of-the-arcane-la-guerra-dopo-la-guerra.html", "text": "Warlock: Master of the Arcane begins where Majesty 2: Monster Kingdom left off. The Great King, after having recovered the Crown of Ardania, decides that hexagonal boxes are never enough and, given the availability of an immense army which he does not know what to do (by now even the sewers of the kingdom are sparkling, there are so many the times he had them cleaned by orcs), he starts marching towards the northern lands with the cry of ~We have it hard, the sword scabbard!~ and ~Ardania free!~. Obviously ambition and a slightly idiotic son who spends all the money on fake magical certificates and undead prostitutes (they are tastes) lead him to a sad end. His kingdom, just reconciled, sees a resurgence of all internal conflicts between the various powers. The Mouse King XIX (not to be confused with the Mouse King which is a completely different genre) looking in the face of the Lich King says ~'mmazza how ugly it is!~ the Lich King, not very fleshy, not inclined to joke, but decidedly expressive when necessary, replies: ~He spoke 'a pantegana~. And it's immediately war! The conflict lasted seventy-four years, which is quite a long time if you think about it. Chaos reigns supreme, as in all self-respecting video games. There is no longer a trace of central government. The king has not returned. Only one possibility remains: a caretaker government, that is, of magicians. What did the old scholars do for all the years of the conflict? They tried to maintain order and failed. Of course, they hadn't wasted all those decades deciding if it would be better to yell ~Fireball~ in battle than ~Spherical object about the average size of a bowling ball with protuberances of magically fueled flames that create a discreet trail in the path that they perform from the mage to the target by exploding on impact and causing area damage equal to the mage's skill plus four plus any miscellaneous~, they could have done more, but they are details. Tired of the noise that hardly reconciles their eternal sleep (not to mention the annoyance during the most excited copulations), the gods decide to intervene to resolve the situation and make a lustful offer to the great magicians: stop the war and face each other to decide who deserves the title of Warlock, Master of the Arcane. The victor will represent the new power around which all the others will gather. Postilla: ~Either you solve it like this, or you've screwed us up to such an extent that we'll get on it like our colleague did with Sodom and Gomorrah.~ The parties involved, sure of making it and avoiding the idea of being salty, accept the proposal willingly and begin to sharpen their spears. Only a little goblin has something to object: ~All this mess just to change the name of the war?~ Hunger Warlock: Master of the Arcane will remind many of that Master of Magic that still lives in the hearts of gamers. Compared to the competition, such as the latest Heroes of Might And Magic, Ino-Co Plus, the developer, has performed a highly intelligent operation, based on the subtraction of elements. The modern trend is that of accumulation, which often creates potentially excellent but completely unbalanced games, such as the last Disciples, in fact more disguised RPGs than real strategic ones. Once you have started a game of Warlock you have to choose the faction that you will lead in battle and the conformation of the game world. You immediately notice the absence of similar heroes or super troops, which if it can surprise you at the beginning, soon proves to be a winning choice for several reasons. The hero has a cathartic and catalyzing function that in many turn-based strategy games (and even in real time to be honest) has ended up engulfing every strategic ambition and has transformed the gameplay into a race to accumulate the power of a single super troop. The system can please, especially when well done as in King's Bounty, but it can often also represent a weight that clips the wings to the whole contour. In Warlock there are only troops, more or less powerful, which represent the real fulcrum of the games. Basically each game starts with one city and two troops. First you have to explore the surroundings, find villages and buildings to raid for money and resources, then discover neutral cities to conquer to increase your territory. The management of cities is very simple: based on the number of inhabitants, expressed by a figure of progressive value, you have more or less hexagonal boxes available to use to build buildings useful for increasing the production of one of the three fundamental resources, i.e. food, gold and mana. The buildings do not have a specific cost, except in terms of maintenance, but must be built according to the needs of the kingdom. For example if you produce a lot of food and littlemana it will be a case of building some mana mirrors, while if you want more money it will be better to bet on markets and trade districts and so on. War The city also has another vital function, which is to build troops. To do this, you must first build specific guilds for the unit you want to build. At first you will only have basic troops (warriors, archers, rats, undead archers and so on), but as you expand, you will find special boxes on which to build unique buildings that will give you access to much more powerful troops. For example, temples will allow the construction of units related to the gods, while academies will allow the specialization of basic troops. Each unit can be upgraded with different perks, which cost money and are obtained by constructing specific buildings, or by leveling up. Experience is gained by fighting. Fortunately, there are no all-powerful units, and even the strongest and most expensive of armies has its weaknesses. So, for example, sending a troop of followers of a deity in between a couple of fire elementals supported by other troops such as lesser elementals, vampires, werewolves, and so on, will still result in a massive defeat. Another limit is represented by the kind of unit available. The most powerful melee troop is powerless against a basic troop of flying creatures with ranged attacks, as it should be. In such cases it is better to have simple archers than minotaurs. By reading you will have realized by yourself that Warlock requires the formation of small armies, composed of diversified units, to try to conquer the most difficult objectives, or to explore the outer planes (the game world is divided into different dimensions, accessible through portals ). Especially during the battles against the CPU, which deploys dozens of units at the same time, it is not possible to count on a single troop but you have to act in concert, also counting on having several losses to be able to reach the final objective, i.e. conquering all the capitals of the warring factions. Also because the cities, in addition to being defended by troops, can count on the construction of magical towers and strongholds that offer extra power to repel aggression. Furthermore, the magic factor must be considered. As the rounds go by, you will be able to research spells. There are a lot of them, truly of all kinds (offensive, support, defensive, healing and so on) and, during sieges or defenses, if used well they can make a difference, just as they can make a difference against stronger monsters, generally resistant to some spells, but weak against others. The famine Unfortunately, even for Warlock there are some sore points to underline. The most obvious is the computer's artificial intelligence, which is quite deficient from various points of view. Actually facing the PC-led troops is quite demanding, especially at the two higher difficulty levels, but it is easy to see that the developers have tried to compensate quality with quantity, i.e. the CPU enjoys many more resources than us since immediately, in order to try to balance some flaws. For example, it is quite absurd that the computer often positions dozens of troops on the border with a city, but only has the attack carried out by the fixed positions for several shifts, giving time to the adversary to organize an effective defense. Even from a diplomatic point of view, the game is rather deficient, both in terms of options and the behavior of the opponent. For example, it is not clear what advantages signing an alliance entails, given that very little aid is received, and why a clearly inferior enemy, who would have every interest in keeping us quiet, continues to harass us with absurd requests that inevitably lead to war (and its defeat). Wouldn't it make more sense to expand before bullying? Of course, they are details, but having practice with the genre, one notices them. From a technical point of view Warlock does its job well. On a graphic level we are in the average of the genre, with the map zoomable, but not rotatable, and the troops quite detailed (but often confused with the boxes). We would not have disdained a few more animations, but given the genre and the final price for the user, we can stay. In terms of the soundtrack, there are the classic well-played, but certainly not memorable, accompanying songs, and some fairly well-made effects that don't change the overall vision of the game one iota. Well, of course it goes without saying that gamers of similar titles aren't necessarily looking for a benchmark for their graphics cards.", "date": "2012-05-17", "grade": "8.3"}