{"name": "Mi ritrovai in una selva oscura", "ref": "https://multiplayer.it/recensioni/102912-datura-mi-ritrovai-in-una-selva-oscura.html", "text": "Is it a near-death experience that Datura offers us? Probably yes, or at least that's what the incipit of the game suggests. Our alter ego is on board an ambulance, we don't know why, and goes into cardiac arrest after an inconsiderate gesture. At that point the nurse applies a defibrillator to his chest, the discharge of which projects us into a completely different scenario from the one we were in until a moment before: a forest in autumn, judging by the amount of leaves on the ground, inside a location bordered by a few gates and a thick fog. We can explore the area using the Move controller or the Dual Shock, and each of these two solutions has its own disadvantages (it's difficult to agree the term ~advantage~ with the game control system, after all): in the first case we walk, back up and we turn around by acting on the device's buttons, exploiting its movement detection capabilities during interaction with the environment; in the second case the setting is almost in FPS style, even if unfortunately the majority of the actions are delegated to the left stick and the right one acts only on the view, but with many limits. The feeling of 'fatigue' conveyed by the controls immediately makes one point: the developers wanted us to enjoy the experience on their terms. So forget about being able to roam freely through the forest, which actually arises as a series of very clearly delimited paths, with an overabundance of invisible barriers to prevent us from doing what is not foreseen by the adventure. Ultimately, the scenario is a sort of ~hub~ for accessing an incredibly limited number of puzzles, almost all of which are really simple, so much so that we managed to complete the game in just a couple of hours, with some difficulty only in understanding what the hell was to be done with the gramophone (but a look at the trophy list revealed the mystery). Don't open that gate So what exactly is Datura's gameplay all about? As mentioned, you are in this forest and inside there are objects with which you can interact. In the presence of one of them, the triangle button icon appears on the screen: if we press it, the object in question is framed from the view to allow us to identify it, while pressing it in its immediate vicinity activates a sort of interactive mode, characterized by the presence of a flying hand that we control via the Move or the right stick of the Dual Shock, and which transmits ~tactile~ sensations through more or less intense vibrations. This type of ~sensorial~ solution is used to make us understand when we have to ~press~ on the object and above all in which area of the same, but it will be really difficult to have doubts in this sense, given the presence of numerous suggestions on the screen, inserted to avoid the slightest chance of running into a dead end. The forest is far from huge and it takes just a couple of laps to have its outlines clear, but touching birch trees allows us to draw new portions of the map on a sheet each time, also noting any objects we have found . A completely useless practice, the latter, considering that the resolution of puzzles in most cases does not require tools other than our right hand, and in any case the objects perform a single function and then disappear. A quick example: in the early stages of the game we will come across a small vase to be filled at a nearby fountain: once we have emptied its contents into a larger vase (we don't tell you which one), we will get a key and the item will vanish, having done its job. Playstation 3 trophies There are ten Trophies that can be unlocked in Datura, all quite simple to obtain as they are linked to actions that we must necessarily perform to move forward in the adventure. The nicest Trophy is undoubtedly the one hidden in the ice, but be careful because breaking the slab to recover it and ignoring the person in danger means making a certain choice... Flashback The resolution of the puzzles often implies the arrival of dark visions, which evidently go to investigate episodes experienced by the protagonist in the past, especially during his childhood, but also project him into improbable scenarios, such as when he takes up a machine gun in a sort of war conflict or is moving on a frozen lake with the aim of freeing a person trapped in the water. During some of these sequences it is possible to make choices that influence the ~conclusion~ of the game and that openor the road at least in a second round, obviously much less demanding than the first, considering that we already know where the puzzles are and what we have to do to solve them. Hard to say whether or not we will want to immerse ourselves again in the atmosphere of Datura after completing it, however, due to the already mentioned cumbersome controls and experience in general, which cannot even count on an amazing technical support: the forest it's rendered very well but certainly doesn't push the PlayStation 3's capabilities to the limit, despite suffering from quite evident drops in frame rate when we move the view in open field. The polygonal models are not beautiful and the animations appear very limited, the textures in various cases lack sharpness and the ~psychedelic~ phases, with the colored tunnels that we find ourselves going through, leave the time they find in terms of a glance . Indeed, they are even counterproductive from the point of view of the general evaluation. On the other hand, the music is good, which effectively contributes to creating a certain atmosphere.", "date": "2012-05-10", "grade": "6.0"}