{"name": "Final Fantasy X-2", "ref": "https://multiplayer.it/recensioni/final-fantasy-x-8.html", "text": "Come on Gullwings! Partly justifying the different development of the plot after the events that took place in the tenth chapter, Square has made this FFX-2 a more frivolous and less ~committed~ game than the components of the main series: Yuna has now abandoned her role as summoner and is now part together with the mysterious Paine and the old acquaintance Rikku of the Gullwings, a group of hunters of spheres, objects capable of guarding and revealing fragments of Spira's past. On board the celestial airship (another old acquaintance) Yuna will travel far and wide in search of these spheres, while trying to discover new clues about her missing lover... The play structure of Final Fantasy X-2 differs profoundly from that of the its illustrious predecessor: the three main protagonists will immediately have the possibility of using the Celsius to be able to visit most of the locations that we have been able to admire in the prequel. Furthermore, it will not rarely happen to meet characters you have already seen, perhaps following their events after Sin's disappearance. Advancement in the game will take place through the successful achievement of certain missions, available in each place that it will be possible to visit. Any examples? Reaching a certain location within a limited time, clearing a particular area infested with enemies, finding new spheres that hold memories of the past. Not all missions will be necessary to complete the game, but the six different endings available testify that only by 100% solving the title will it be possible to obtain the most complete ending and discover all the implications of the plot. Do you want to find out what Wakka or Kimairi did after Sin's departure? You just have to roll up your sleeves and go far and wide Spira in each chapter of the game. Not bad if you didn't succeed right away: once the game is completed, you will be given the opportunity to save the game on a new Memory Card slot, and thus be able to start the adventure over again, keeping all the skills and objects acquired at the end of the game. end of the first game. Give me a dress and I'll tell you who you are The same speech made for the game structure can be applied to the control system, which abandons turn-based combat in favor of the revived Active Battle System, which if initially makes the clashes more confusing, in the long run manages to be more frenetic and fun. Taking for granted the presence of the inevitable level up to increase the basic characteristics of the main protagonists, the skill learning system is based on the use of the Dressphere (Looksphere in the Italian version ...), or spheres that will allow you to change the appearance and abilities of the three heroines, changing the set of moves available and their strengths. The first three available will be Gunner (gunslinger) for Yuna, Warrior (fighter) for Paine and Thief (thief) for Rikku, but during the course of the adventure it will be possible to acquire several new spheres (two examples: White Mage and Black Mage) which they can be used according to your preferences or the monsters to face. In order to function, these spheres must be set in particular grids, called Garnment Grids, each of which has particular peculiarities related to its shape and the number of placeable Dressspheres; moreover, in some grids, on the line leading from one Dresssphere to another, particular icons are available which, if crossed during a passage from one sphere to another (which can be carried out during combat), will give specific boosts to the Garment Grid in question, such as bonuses in attack or particular spells not yet learned through the acquisition of the canonical skill points. As already mentioned, the technical system takes up most of the locations already seen in Final Fantasy X, so the work was above all finishing, such as an adjustment of the frame rate in some passages and some corrections in terms of texture and graphic cleaning. Greater improvements have been made instead during the fights, in which the blur has almost completely disappeared, and in the facial expressions, made even more beautiful and realistic as regards the main protagonists. As always, the films are of excellent quality, unfortunately present in fewer numbers but always of great depth and intensity. The sound reflects the spirit of the game, proposing mostly J-pop and commercial songs. The results turn out to be fluctuating, not skimping on well-made songs, but also others decidedly anonime. Concluding notes go to the Italian adaptation, which suffers once again from showy black bands and the lack of the 60hz option, a lack that seems rather heavy and unjustifiable to us. As if that weren't enough, the Italian translation is quite questionable in several points, both for the choice of translating terms that would have been better left in the Anglo-Saxon language, and for the translation itself, in several points bordering on sufficient. Comment It must be admitted, the first impact with Final Fantasy X-2 is disarming, due to the different approach that Square Enix wanted to adopt in this sequel: frivolous, sometimes trashy (on this aspect we must also thank the Italian translation, which contributes a lot. ..) and with a narrative system which, although fairly interesting, does not reach the complexity and epicity of the ~regular~ Final Fantasy, even if it offers pleasant subplots involving the protagonists of the world of Spira. In the end, the game surprises for the considerable variety, the fun inherent in most of the missions present and in the excellent combat system, certainly among the best seen in recent times. An all-female title that will appeal to JRPG lovers and will not disappoint the fans of the tenth chapter, albeit without pretensions to rival the great exponents of the genre. Pros: Varied and fun Excellent combat system Technically good Cons: Narrative system not comparable to other Final Fantasy Music with ups and downs Dubbing and adaptation below the sufficiency When one thinks of the name of Final Fantasy, a fantastic and fascinating world immediately echoes in the mind, which has accompanied gamers throughout the videogame generations with engaging stories and ever-changing settings. But an ancient saying states that there is always a first time, and Square Enix offers, on Playstation 2, the first official sequel to one of the cornerstones of its entire production, or the tenth final fantasy. The world of Spira still has something to tell and Yuna is adamant that Tidus is still alive, and wants to find him. At the cost of wandering until the end of his days", "date": "2005-08-20", "grade": null}