{"name": "Rotazioni spaziali", "ref": "https://multiplayer.it/recensioni/102824-spin-up-rotazioni-spaziali.html", "text": "Developed by Nenad Katic, an eclectic designer who divides his time between video games, art installations and experimental architecture, Spin Up undoubtedly reflects the spirit of its creator, combining with apparent nonchalance a decidedly retro look with an original gameplay that seems to mix elements of different genres: let's see whether the result is a tasty cocktail or whether it is the delirium of a visionary... Stairway to space Although it presents itself as a hard and pure arcade title, Spin Up does not give up the luxury of having a not too obvious and banal plot: an alien race has collected obsolete machinery abandoned by humans and assembled them to build an evil artificial intelligence, which will be the task of the protagonist to reach and deactivate forever. From this incipit the game action starts, which develops like an endless runner with numerous peculiarities, starting with the graphic aspect. Paying homage to the great 8-bit classics, Spin Up presents a convincing visual solution in pixel art, with deliberately ~blocky~ scenarios and characters endowed with bright colors: all framed by a bizarre bird's eye view that takes from the the concentric circles of which the alien construction is made up, a choice hand-in-hand with the original gameplay of the product. As mentioned at the beginning, the aim of the game is to get as far as possible, while taking advantage of absolutely fresh and captivating mechanics. The user does not have direct control of the character on the screen, but of the circular walls of the structure that can be rotated at will as if they were discs: the main objective is therefore to align the circles in such a way as to build a path of stairs to allow the protagonist to advance, paying attention to the various obstacles that are in his path and to the progressive disintegration of the lower components of the tunnel. It is therefore necessary to act quickly to prevent the ground from literally collapsing under one's feet, but at the same time other factors must be taken into account. In fact, there are computers to deactivate and aliens to eliminate, actions that can be performed simply by bringing the character closer to the objective of the case (in the case of enemies, however, one must take precautions to have first collected one of the weapons that are randomly scattered within the scenario ): the game grants experience points for each success in these two tasks, but also subtracts them based on the percentage of terminals and opponents left behind, putting the user in search of the best scores in the condition of having to think really very quickly to the rotations to be made. By leveling up, it is also possible to use new characters with better characteristics and particular bonuses which include the ability to start the climb with a more or less substantial number of meters ahead. However, the most dangerous pitfall of Spin Up is constituted by the broken stairs -distinguished by the orange color- capable of supporting the weight of the protagonist for a few seconds before breaking and making him fall into the void: an ingenious expedient to add further pathos to a gameplay that manages to be frenetic and reasoned at the same time, and which alone supports an extremely pleasant title to play and replay in search of the best score or the amount of experience points necessary to unlock a new character. Furthermore, the fact that the control system is absolutely precise and reliable does not hurt, making sure that each death is attributable to one's own negligence rather than to a rotation poorly understood by the iPad touchscreen.", "date": "2012-05-08", "grade": "8.5"}