{"name": "Triangle Strategy", "ref": "https://multiplayer.it/recensioni/triangle-strategy-recensione.html", "text": "Turn-based strategy is a genre that is now very rarely seen. If we exclude the occasional Fire Emblem and some indies, it could be said that it has practically disappeared completely. This is why Triangle Strategy has attracted so much attention since its announcement and especially after that Debut Demo that made us try it and then wait for over a year. The ArtDink-branded production recalls some of the most famous games in the history of the genre, masterpieces of the 90s such as the legendary Final Fantasy Tactics, Tactics Ogre and Vandal Hearts, promising an adult narrative behind the fascinating HD-2D patina that inaugurated Octopath Traveler a few years ago. We wondered if this hymn to nostalgia could be enough to conquer us completely, and after spending almost fifty hours in the kingdom of Nortelia we can tell you, in our review of Triangle Strategy, if the producers Tomoya Asano and Masashi Takahashi hit the spot. War is a triangle Triangle Strategy, a detail of the Nortelia map We admit that playing Triangle Strategy in the last few days has not been easy, also because the title ArtDink lucidly reflects not only on the strategies in a war conflict, but also on the consequences it has on civilians and on the world. Whenever Serenoa - the protagonist controlled by us - is having a discussion with someone, the possible answers that we will have to choose are deeply multifaceted. There is no ~right~ or ~wrong~ approach when it comes to war, especially when it comes to the innocent and the future that will be handed to them. The story of Triangle Strategy insistently focuses on this aspect, telling us the dramatic vicissitudes of the Wolfhort family, a vassal of the kingdom of Glenbrook, when the latter is treacherously conquered by the Grand Duchy of Aesglast. The truce that followed the past War of Salt and Iron is suddenly broken, unleashing the intrigues, grievances and ambitions of the forces in the field. Serenoa Wolfhort thus finds herself leading her own house in place of her father, just after having taken the half-sister of the ruthless Gustadolv as a girlfriend to restore relations between the great families of Nortelia. Surrounded by a bevy of faithful allies - including Roland, the Prince of Glenbrook - Serenoa will have to defend its borders, win against the opponents who surround it and, above all, discover the secrets that bind one of the most precious resources in the world, salt , to the reasons for the new conflict. Ever since Nintendo began advertising Triangle Strategy, and the Debut and Prologue Demos were released, there have been rumors that the ArtDink title was somewhat comparable to Game of Thrones in terms of narrative. This is not an exaggeration. The dramatic atmospheres and some sensational twists are really reminiscent of the first seasons of the TV series inspired by the novels by George R. R. Martin. The skilful staging compensates for the effect that the highly detailed and colorful - but perhaps a little too dirty - HD-2D style has on the most shocking scenes, with the contribution of an excellent Akira Senju on the soundtrack. Triangle Strategy, Cordelia is the princess of Glenbrook Thanks to the excellent Italian localization and its high and solemn register, Triangle Strategy often seems more like a novel than a video game, and this is also because there is so much to read between one battle and another. ArtDink's work certainly does not enjoy the gift of synthesis, but the prolixity of the interlude scenes is not gratuitous and the frequent dialogues serve to deepen the motivations and contexts behind the conflict, often shifting the point of view from one faction to another . The excellent writing, however, sacrifices the characterization of some characters. If the supporting actors and Serenoa's allies can count on significant roles or optional interlude scenes that tell their backstory, the same does not happen with the antagonists, who seemed neither stratified nor particularly original, starting right from Gustadolv . The most intimate conflicts burn out in a few scenes and some passages, conditioned by the bending of the narrative on the basis of the choices made, can seem quite hasty. Fortunately, these are aspects that do not affect the goodness of a story that is significantly detached from the Japanese canons, but which perhaps would have needed more breathing space. The weight of choices Triangle Strategy, the game in Exploration mode One of the reasons why the main protagonists of the story, namely Serenoa and her allies, appear decidedly more characterized and interesting than their rivals, is to be found in the gameplay. With this statement we also refer to the siscombat theme, but above all to the choice system that gives the game its weird title. The House of Wolfhort makes its most important choices through an artifact that represents its democratic orientation: the Libra Solver. In the most important moments of history, and therefore roughly once a chapter, we will have to call on our main allies to vote in favor of a particular strategy. Each of them will have a position in this regard and we will be able to discuss it and perhaps try to change it with the strength of our reasoning. Amazon offer Triangle Strategy - Nintendo Switch 59.99 See Offer Serenoa's alignment hinges on three beliefs: morality, pragmatism, and freedom. Most of the choices we will make during the game - from a trivial response to a specific action in battle - increase the three convictions, without however initially telling us which one and by how many points. Triangle Strategy, the Resolver Libra decides how the story will continue In this way, ArtDink induces the player to face his first game according to his instincts and morals, but the alignment of Serenoa affects the unfolding of the narrative, and if at first it does so in a marginal way, in the final stages the choices made earlier they can shape the ultimate missions and lead to multiple endings. The moment of voting, which is the most important in this sense, always comes together with the so-called Exploration mode reminiscent of classic JRPGs. In these situations we will be able to talk to the NPCs, collect loot and discover information that could help us plead our cause while we discuss what to do with the allies. Once voted, however, there is no turning back, and Serenoa will act according to the will of the majority. Triangle Strategy, Roland fights on horseback and covers greater distances We appreciated these phases of the game precisely because they highlight different and credible personalities, while offering us an interesting starting point for reflection on the story and the issues it addresses. The belief system, in fact, also determines which secondary and optional characters will join our team, and sometimes this mechanism causes a sort of narrative dissonance. New Game+ remedies this problem by granting us greater control over the narrative: Triangle Strategy is not even a particularly long game by the standards of the genre, but this makes it highly replayable, especially if you want to discover all the characters and backstories. Tactical but not too much Triangle Strategy, the Roselians are forced into forced labor by the racial laws As we have said, Triangle Strategy is a turn-based strategic JRPG: the battles take place in isometric scenarios divided into boxes, and anyone who has played any Fire Emblem will immediately feel at home. Also because the two series are much more similar than it seems. There are no ~classes~ in Triangle Strategy: each character represents an archetype and is characterized by very precise statistics and abilities that make them more or less suitable for certain missions rather than others. We are therefore far from the customization possibilities of Final Fantasy Tactics or Tactics Ogre, and at the same time there is less meat in the fire than Fire Emblem: Three Houses with its numerous interlocking systems.Even in management terms, Triangle Strategy is a game to say the least essential. In the Camp, accessible before each battle, it is possible to shop, train characters in ~imaginary~ fights, upgrade weapons and upgrade the different units to more powerful versions. Triangle Strategy, before voting you can try to discuss with your allies In this respect, Triangle Strategy is once again similar to Fire Emblem. The equipment is reduced to the bone - just two accessories per unit - and the weapons do not change, but are upgraded: by spending the materials and the money obtained, bonuses and additional skills can be unlocked. Finally, class advancement improves the character's parameters and allows him to learn new skills at the appropriate level. Apart from this, however, the combat system is as lean as it is immediate. We're not dealing with a Disgaea with its plethora of mechanics and systems, you don't mix units in the same tiles, and there are no unpronounceable stats to micromanage. Basically you need to know that an attack from behind will always be critical, an attack from above will inflict more damage than normal and pincer maneuvers - that is, squeezing a target in the square between two allied units - result in an additional attack by the involved ally. End. It is true that as you continue in the game, things get complicated withthe interaction between the environment and elemental magic, or with the introduction of skills that move units and targets, but it's all extremely intuitive. Triangle Strategy, in this mission you will have to board Avlora's ship Elemental spells, for example, allow us to burn the ground to inflict damage on units that walk on it, or to freeze it to decrease movement and accuracy. A fire spell cast on frozen ground melts the ice, applying a new negative effect to the area that can affect combat. These are interesting interactions around which, however, it is difficult to build a real strategy. Triangle Strategy is a straighter game, in this respect, and the passable artificial intelligence of the enemies, or of the allies who are sometimes not under our direct control, does not develop particularly refined tactics, almost always aiming at isolated units and at positional disadvantage to catch them in the middle. The conformation of some battlefields, however, makes certain missions much more fun and challenging, as well as the occasional bosses who take the field and can inflict enormous damage, requiring preparation and a more careful reading of the scenario and enemy movements. For this reason, it is a bit sad that the developer has not managed to perfectly balance the combat system in terms of skills and characters. Some are clearly better than others, and we are convinced that the players will end up growing above all the core of the Wolfhort protagonists. Triangle Strategy, Roland fights on horseback and covers greater distances It's a shame because there is a huge variety of interesting characters that we can recruit and that approach battles in a very different and, if you will, even more tactical way than the usual warriors and wizards. Ezana, for example, can change the weather, strengthening or weakening certain spells, while the circus performer Little Girl can distract enemies with her clones: both are an example of less conventional units, but certainly fun to deploy. In short, replaying Triangle Strategy makes sense even just to experiment with new strategies, especially if you haven't managed to upgrade each weapon or promote each unit, and this is a significant added value for a campaign that is completed in about forty hours on difficulty Normal.", "date": "2022-03-03", "grade": "8.0"}