{"name": "Yesterday", "ref": "https://multiplayer.it/recensioni/102386-new-york-crimes-yesterday.html", "text": "Although no opportunity is missed to give it up now, the genre of graphic adventures does not want to retire (the recent success on Kickstarter of Tim Shafer's new project is yet another confirmation) and indeed continues undaunted to give small videogame pearls strong with deep and intriguing narratives, flanked by the classic gameplay more or less perfected over many years of evolution. The Spanish Pendulo Studios, on the scene for many years, after the Runaway series and the entertaining The Next Big Thing, are back with a bizarre, almost grotesque thriller, entitled New York Crimes in Italy, a product far from the humor of their previous ones jobs. A small narrative experiment that does not disdain successful tricks in the gameplay, aimed at streamlining the classic point and click formula. No one cares about a dead beggar ~No one cares if a homeless person dies~, a dramatic assumption around which the entire philosophy of young Henry White revolves, a boy involved in social work, who uses the fortune inherited from his family to help the needy, too often ignored by everyone the others. The same axiom also assumes another identity if enunciated by a psychopathic madman, who lives with the need to torture and kill other human beings: what better solution to satisfy one's needs than to vent on these people that no one will ever miss? If you know the previous works of the Spanish development team, you will have noticed the shift in narrative tones, which in New York Crimes take on the hues of a psychological thriller, with a dash of the paranormal. Initially we will control the young Henry White, but a time jump forward of a few years will change the perspective on the events, putting us in the shoes of John Yesterday, an expert investigator in satanic cults. After an attempted suicide, ours has lost his memory and his friend, the now adult and millionaire Henry, hires him to investigate a serial killer, obsessed with the homeless and for some reason linked to Satanism. Remaining faithful to the tradition of the genre, the adventure transports the player through different locations around the world, starting from New York to move almost immediately to Paris, also taking advantage of several flashbacks to reveal the intricate narrative plot. As much as we appreciated the script drawn up for the title, full of twists and turns, it must be admitted that certain logical leaps may not be easy for some to digest, while well-written dialogues and an always pressing rhythm are qualities that are difficult to question. The excellent direction and interlude scenes created by mixing comic-style boxes with virtual acting complete an overall positive picture. Too bad for some junctures that present events that are a little too unrelated and certain events that are not very justified, above all the love story involving John Yesterday, too hasty and poorly developed. Even the characters appear well characterized, in particular Henry White and other intriguing extras, while Yesterday appears to be the most anonymous, perhaps also because an amnesiac protagonist is not exactly the most original narrative device in the story. Point and click The mechanics appear anchored to the cornerstones of the genre, with various tricks already seen in the previous works of the Spanish developers. Controlling our alter ego with only the aid of the mouse, it will be sufficient to identify and activate the sensitive areas of the screen with the click of the mouse to carry out any type of action, examining or interacting with objects and characters. The classic inventory is present, which will host various elements that can also be combined and is always clearly visible in a bar at the bottom. Pendulo Studios has also integrated into the title a function that allows you to highlight every sensitive point on the screen for a few seconds, thus avoiding the tedious pixel hunting, while an integrated help system should allow anyone to get to the end credits without too many worries. However, the answer to the current enigma is not always available, as the hint icon will have to be filled in trying to independently arrive at the solution to each situation; when a sufficient number of attempts have been made, it will finally be possible to ask for help, usually offered in the form of a suggestion rather than an explicit indication of what to do. The puzzles range from intriguing and moderately challenging, to unfortunately arrive towards the end to gameplay phases that practically play themselves. The good variety of situations proposed is therefore ruined by a low level of difficulty, which prefers story tellingto the challenge, partly ruining the good ideas present. Finally comes the real weak point of this very pleasant graphic adventure, namely the duration, unfortunately narrow. Also thanks to the level of difficulty just mentioned, we reached the end credits before even reaching the five hours of play, in our opinion too few even considering the sale price (fixed just under thirty euros) yes captivating, but not that low. Estilo espaol On the other hand, it is difficult to negatively criticize the style with which the Madrid developers outline their characters, proposed with a caricature style that is strongly in contrast (perhaps too much) with the almost dark colors of the plot. There is no shortage of humorous moments, but Pendulo Studios has taken a certain liberty by choosing to keep its characteristic design seen in the Runaway trilogy for example to transplant it into this satanic thriller. From a technical point of view, the quality of the character models and the highly detailed backdrops is always excellent, not at all embarrassing even on Full HD panels. Continuing the plot, New York Crimes will allow access to the various chapters from a special screen, so as to allow the user to enjoy the different moments of the story a second time, a particularly useful function in the case of the epilogue, equipped with three different nuances for as many different endings. Unfortunately, the game doesn't offer anything else to encourage a minimum of replay value, thus limiting the experience to the few hours offered by the story being told.", "date": "2012-04-26", "grade": "7.5"}