{"name": "Un puzzle col pollice verde", "ref": "https://multiplayer.it/recensioni/101767-light-the-flower-un-puzzle-col-pollice-verde.html", "text": "Between petals flying over immense plains and plants ready to do anything to stop a horde of zombies, we have repeatedly enjoyed excellent games built entirely around plants and flowers. Those of Light the Flower, however, have neither the poetic inclinations nor the prowess of its cousins seen in Flower and Plants vs. Zombies, and indeed they are sad to wither in a dark corner of a house. The goal, as suggested by the most indicative of the titles, is thus to help the poor seedlings reach the sun's rays that enter through the window: but how to do it if the flower is motionless, stuck inside a heavy vase? Well, if Mohammed doesn't go to the mountain... And there was light! The idea behind Light the Flower is one of the simplest that can happen: each level opens with a view from above of a room, sometimes a living room, a kitchen or a bedroom; a ray of sunshine enters through one of the windows, while on the opposite side stands a sleepy and powerless flower. By moving and rotating mirrors, the player's aim is to divert the light towards the map, a mechanic that those who have played Auditorium will no doubt find familiar, but also less abstract and suggestive. The first puzzles border on banality, but serve to introduce the game to even the most obtuse of users, although the control system, however simple, unexpectedly proves to be less intuitive than expected: with one finger it is possible to drag a mirror anywhere in the level, while touching the arrows on the sides it is possible to rotate it on itself. It's a pity that, since both actions require the use of only one finger, it sometimes happens that you do one instead of the other, perhaps by rotating a mirror when instead you wanted to move a nearby one. Fortunately, this is not a problem so recurring as to make the experience frustrating, but from time to time the player is forced to spend a few seconds arguing with the controls. If the first few minutes show a superficial and too simple puzzle game, things soon start to get much more interesting, with many obstacles inside the room and flowers placed in unlikely places. The colored plants then require special treatment, since the light must pass through chromatic filters before it reaches its destination, while in the more advanced scenarios it is possible to interact with switches to operate doors or activate additional light sources. At one point, bombs are even introduced which, if lit for too long, blow up the house and force you to start the level all over again. In short, the player then begins to practice some small tricks, reflecting light sources on both sides of the mirror, putting it in parallel to create three different beams, or making sure that the light passes only half through a colored filter and creating so two different bundles. More than the puzzles themselves, to require these tricks and to test the user's ingenuity is instead the collection of the usual three stars scattered within each scenario and which can only be collected if they too are hit by bright light. end of the level. As per tradition for most casual games on mobile devices, the stars collected not only demonstrate that you have finished the puzzle in the best possible way, but are indispensable for unlocking the more advanced levels. Also inevitable is the possibility of unlocking all the levels right from the start simply through an in-app purchase of 79 cents, but collecting a sufficient number of stars not to get stuck is a challenge for everyone. In this regard, the version currently available on the App Store already offers the beauty of 60 levels to play and replay, while the developers have already confirmed that new ones will arrive through an imminent update. The scenarios offer different rooms of a house from time to time, and the lively and colorful graphic style, although not too original or sophisticated, does its job well.", "date": "2012-04-23", "grade": "7.0"}