{"name": "Age of Z Origins", "ref": "https://multiplayer.it/recensioni/age-of-z-origins-recensione.html", "text": "The review of Age of Z Origins comes significantly late compared to the release of the game, which has already been available for quite some time, but it seemed interesting to us to talk about one of the first phenomena of the zombie-based strategy / simulation genre, also and especially in the light of the updates that have added important extra elements to the experience over time. In fact, if the narrative assumptions and the structure of the Camel Games title may seem really derivative and already seen to you, it is also because many have taken over the same formula on iOS and Android, perhaps trying to streamline it in some points and to regulate the freemium mechanisms in a different way, without affecting the substance. structure and setting Age of Z Origins, a view of the city. Born as a simple Farmville-style casual simulation, of which there are literally hundreds on the App Store and Google Play Store, Age of Z Origins throws us into the traditional post-apocalyptic scenario of a world suddenly overrun by zombies. However, the survivors have reacted in a timely manner, preserving entire cities rather than small settlements and transforming them over the years into real futuristic megacities. Our character, a brave officer, arrives in one of these places and is entrusted with the the task of defending its borders, fortifying its defenses, conquering new territories by freeing them from the threat of the undead and also finding the time to develop the urban planning and economy of the fortress-city. A task obviously made very simple by the usual list of tasks that we can limit ourselves to following very quickly, using the materials and coins obtained up to that moment. Gameplay and graphics Age of Z Origins, a frenetic sequence from a tower defense mission. The incipit should have made you understand that, in terms of gameplay, Age of Z Origins moves within a very well-defined groove, the same as various other similar productions, in which the interaction is reduced to a minimum and you just touch the buildings to build or upgrade them, train new troops, endure variable waiting times depending on the situation and our finances, and finally collect the rewards that belong to each completed mission. To add a pinch of pepper to an otherwise rather inflated and bite-free formula we think of the tower defense-style sections, in which we will have to place and gradually improve various types of automatic turrets as hordes of zombies set off following precise paths, at the same time purpose of destroying our positions, with the possibility of speeding up the action up to four times. These innovations undoubtedly represent a breath of fresh air for the game, which for a long time was instead stuck on its graying simulation positions and on the traditional battle mechanics based exclusively on the number of troops involved. As often happens, however, these are also grafts with great unexpressed potential, which the developers could have exploited in a better way. A pity, because from a purely technical point of view Age of Z Origins does its job in a more than discrete, giving us a detailed representation of the city and its buildings, quite a bit stereotyped but pleasant to see characters and a good rendering of the RTS phases, although in that case the variety of scenarios is somewhat lacking, projecting us for large stretches to the interior of locations all the same.", "date": "2021-05-22", "grade": "6.0"}