{"name": "Verso il nuovo mondo", "ref": "https://multiplayer.it/recensioni/102267-risen-2-dark-waters-verso-il-nuovo-mondo.html", "text": "The Risen series probably owes its existence to the clash between publisher JoWood and Piranha Bytes. A bad blow for Gothic fans since the rights to the famous saga ended up in the hands of Spellboud with unfortunate results. But with Risen, the new starting point of the German developers, part of the soul of Gothic has nevertheless come back to life. He did it on the sunny beach of Faranga, with the usual unnamed hero and with the events that are connected, albeit rather remotely, with one of the endings of Gothic 3. The end of the old world The inspiration that gives life to the series is the expulsion of the gods, with the fearsome titans, mythical elemental creatures, who suddenly find themselves free to roam the earth. In the first chapter our hero, armed with a blade and contemptuous of danger, finds himself having to face a titan who is hidden from view in the volcano of the island of Faranga. But the ending is just the beginning of a much larger story. In fact, the other titans are devastating the world and also the groups encountered on the first island, or Inquisition, Tribals and Villains, are a representation of great forces that play an important role in the plot of the title. Risen 2: Dark Waters starts right from a coastal fort of the Inquisition, with the main character playing the role of a lieutenant with a decidedly demotivated attitude. In fact, almost nothing is left of the old world except the city of Caldera which is already largely engulfed in flames. The sea is full of dangers and the kraken continues to sink all the imprudent vessels. The only hope is to migrate to the new world which is effectively a fantasy vision of thirteenth century South America complete with a Caribbean archipelago. However, the enchanting islands are the hunting ground of pirates and they have never got along with the law and uniforms. Fortunately, there is an ongoing split among the buccaneers and this allows us to once again support the beautiful Patty, daughter of Barba D'Argento, and to set sail towards new adventures using both the soldiers and the Inquisition as support. Unfortunately, being in the middle of two factions has its cons and obviously many other dangers lurk around the corner with omnipotent creatures, huge rock giants and a curse that is unpleasant to say the least. Simple but not linear In essence, the first Risen was the introduction to this sequel, with the world that in the second chapter opens up into a series of islands to explore. The aim is to recover four artifacts that as many greedy captains have pocketed by unleashing the aforementioned curse. Two have repented and two have succumbed to greed. We will find ourselves having to correct the mistakes of all four by exploring tropical beaches, military forts and pirate hideouts, all while beating up the less cooperative pirates and creatures of all sorts wildly. The general feeling, we say it immediately, is the classic one of the Piranha Bytes titles, with ordinary men faced with immense powers in a mix between credible Middle Ages and fantasy at full speed. However, the pirate component that in the first chapter was linked to a couple of characters and here instead is at the center of everything grows dramatically, with our hero who finds himself having to mediate between pirates and soldiers by playing the role of the Caribbean buccaneer. A middle character therefore, who does not allied himself with any faction and who has accepted his role as a hero, despite the ironic vein that distinguishes him. In short, the plot of Risen 2: Dark Waters provides for a united front, albeit permeated by traitors and scoundrels, which stands against the titans and against those who are trying to control them. There are some crossroads, but they are ends in themselves and do not produce upheavals in the game world. In essence, betraying an indigenous population or the Inquisition does not cause exile from a place and even after having made a terrible pirate flee we can easily go back to buying our grog from the fort's shop as if nothing had happened. An obviously functional choice that does not force the player to truncate subquests and links, but which does not have much role-playing. If nothing else, the contextual choices, the investigative quests and the various outcomes of numerous social missions still manage to give that role-playing feeling to the whole, thanks to the possibility of tackling almost all the tasks, including the missions of the main plot, in an absolutely not linear. There is no doubt, however, that in many respects the work of Piranha Bytes seems almost closer to an action adventure with extremely deep and varied gameplay rather than a classic RPG to which the same software houseand German had gotten used to it over the years. Stuffed fights The fulcrum of the action is represented by the duels between swordsmen, almost action style with aim lock on the opponent and dynamic exchanges of moves, parries and counter moves. But in Risen 2: Dark Waters this is expanded upon by guns, dirty tricks and even first person shotguns and spears. Unfortunately, the result is not perfectly balanced, probably due to too much difference between the various types of combat. Furthermore, the main character is much stiffer than seen in the first chapter of the series and the rifles allow you to exploit all the classic artificial intelligence displacement problems, typical of open world titles. Yet the whole is credible and initially, when money and experience points are scarce, it forces a careful evaluation of the skills to be learned since these radically influence the character's combat possibilities. Possibilities that are crucial as you come across evil pirates, unsociable natives, indestructible crabs, giant spiders and so on. Unfortunately, the types of monsters are few and some are decidedly uninspired. The artificial intelligence is also quite poor and even creatures that have defensive abilities can be fooled easily. To balance the developers have decided that the player can not parry the blows of the monsters granting us only a kick to remove the fangs or claws that try to bite into the flesh. This obviously gives great relevance to the approach phase and makes rifles much more useful than swords. In fact, sword fighting, which we discussed at the beginning of the paragraph, is evidently designed for clashes between human beings, with real combos of thrust and pistol. In a way it's a stretch, with the hero not being able to deflect a claw with the blade, but that differentiates hunting from dueling and creates two completely different types of gameplay. Paradoxically, the best made creatures are the animals that attack only when threatened and circle, charge and run in a much more believable way than the linear approach of monsters and humanoids. The rise of a hero Risen 2: Dark Waters mon lacks the classic burglary, theft and crafting skills. Stealth is handled automatically by the game, although walking slowly is welcome and the knack for crouching and silently helps tremendously. The role-playing system is broken down into various character growth components. It starts from the five basic characteristics that can be upgraded to a maximum of eight levels by spending the glory or experience points that are earned by carrying out a very large number of actions in the game. They range from proficiency with blades and firearms, to stamina, cunning and voodoo. Each of these stats has three directly linked talents that grow automatically as the levels of the ~mother~ characteristic increase and based on equipment, possession of collectibles hidden throughout the game world and temporarily by drinking potions. Thus, for example, as cunning increases, we will also see our abilities grow in the use of dirty tricks in combat, in persuasion during dialogues and in thief actions. To close the circle there are the skills, the highlight of the entire role-playing experience of Risen 2: Dark Waters. These can only be learned through the NPCs scattered around the game world who, with sound coins, will be able to teach us their knowledge as long as they have certain requirements: a certain level of the main characteristic and sometimes other interconnected skills. It is extremely important to carefully evaluate what to learn since without acquiring skills the character does not have the possibility to counterattack, dodge or perform critical hits. Sure, the ability to shoot an enemy during a dialogue is tempting, but finding yourself paralyzed in front of a horde of rampaging pirates isn't an experience to include in a self-respecting tour guide. A choice that initially puts a block of marble on two trembling legs in the player's hand, but which at the same time gives an excellent feeling of character growth. Furthermore, as per Piranha Bytes tradition, investing a lot in villain skills is a choice that pays off especially in the short term since breaking into chests and forcing door locks allows you to get your hands on a huge quantity of stolen goods and very often it is the only possibility which one has to find pieces of legendary weapons and maps of hidden treasures of immense value. The title includes piratesch clothesi of all sorts, each with a bonus to a specific skill. There are also schemes of particular rifles or special objects such as silver pistols that belonged to famous pirates. The crafting is differentiated for rifles, swords and takes a completely different path in voodoo which allows you to create potions and dramatically enhance their effects as well as particular scepters to be used as weapons to significantly weaken the enemy or ~stimulate~ him to fight alongside us . Just voodoo represents the only real choice that the protagonist is forced to make early in the game since the plot will force him to side with the indigenous inhabitants of the islands, and thus have access to all the secrets of dark magic, or to remain faithful to the inquisition. As already mentioned at the beginning, unfortunately there are no major consequences in terms of quests that can be tackled or influence on the game world but embracing voodoo also allows you to build dolls in certain moments of the game and in doing so take possession of the body of some key characters so as to make them perform actions that often allow you to complete missions in alternative ways and without resorting to fighting or long phases of searching for objects. Alongside the standard equipment there are also a series of specific objects related to the only two professions in the game: the seeker and the hunter. In essence, treasures must be dug up with a shovel and the mines, unlike those found by poor Christopher Columbus, are full of gold to be extracted with a pickaxe. Furthermore, the beasts, whose skin is worth almost as much as a precious gem, can be skinned, cut up and deprived of their tusks, which are also obviously precious. Well, each of these possibilities depends on a special tool to find, buy and always keep in your pocket. A peculiar and bittersweet world To enrich the gameplay we find a series of contextual activities such as duels, treasure maps, target shooting competitions, drinking and even lethal traps of various kinds to be avoided with a quick time event. All elements made in full pirate style and supported by what is the greatest value of the title, or rather the dialogues. In fact, Risen 2: Dark Waters does not miss emotional twists, lightning-fast exchanges and jokes of all sorts. Elements that, in combination with the vaguely cartoon-like cut of the faces, almost make you think of a Monkey Island in an RPG key. Everything is much less absurd and seminal of course, but the pirate atmosphere, between hangovers and well-chosen jokes, permeates every moment of the title. Part of the credit obviously goes to the aesthetic sector which offers spectacular views and includes a decidedly spot-on use of the depth of field, both for near and far objects. However, there are several negative elements starting from the interiors which are decidedly sparse and often badly lit. Fortunately, the title is set outdoors for the majority of the time and in this case it is dominated by splendid and dense vegetation with complex shadows, animals in abundance, gigantic waterfalls and large bodies of water. The excellent daylight then illuminates believable fortresses, splendid galleons and piers made up of hundreds of planks visibly placed with care, one by one. Unfortunately not all the locations are qualitatively at the same level, with Caldera which is decidedly anonymous despite the wall of fire that surrounds it, but Porto Isabella or the pirate lair of Antigua are small masterpieces in which design, stones and graphic effects mix creating a magical effect. Particularly spectacular is the water that bathes the rocks and piers, with the fish darting in shoals and with the three-dimensional waves that swell when the storm approaches. Unfortunately these do not break on the shore, and this affects the visual rendering of the sea on the beaches. But they crash on rocks and docks producing a not well-kept white puff but sufficient to make the magic. In essence, Risen 2: Dark Waters appears to be a fairly well-finished title, with high ups and more than bearable downs. But, alas, the technical sector reserves us a less marginal defect. This is the extreme pop up that involves many elements of the game world. They range from the characters, who fortunately appear at a bearable distance and therefore often not noticed, to arrive at crates and plants that suddenly appear 10 meters from the protagonist with a decidedly unpleasant visual effect. Pleasant but always rather anonymous and in any case devoid of bite the soundtrack that accompanies our travels while the dubbing, exclusively in English, does its job without ever standing out for intensity or acting with the exception of", "date": "2012-04-23", "grade": "8.4"}