{"name": "In cima alla torre", "ref": "https://multiplayer.it/recensioni/102189-pandoras-tower-in-cima-alla-torre.html", "text": "When you say the feeling. A bond that goes beyond physical boundaries and reaches to pluck the deepest strings of the soul, leaving enchanted, enchanted but sometimes doubtful. Because it is legitimate to ask yourself: how far are you willing to go for love? This is exactly the question to ask yourself in front of Pandora's Tower, and you have to do it before even asking yourself about the way in which Ganbarion's elegant videogame creature will be able to amaze those who accept his challenge. The appeal is aimed at everyone, even those who just don't digest JRPGs. A modest budget, much-criticized hardware to work on but which, precisely because of its peculiarities, is less required than its competitors to demonstrate that the end of a console's life cycle implies graphic muscles pulled to the max and few ideas in command. Pandora's Tower is, in fact, exactly the opposite. An integral part of that recent trio of dreams packaged by Nintendo (with Xenoblade and The Last Story) but not in direct competition for this, the team's choice was clear: to avoid similarities with others and take their own path, focusing on a singular and unconventional gaming system rather than on the mere technical sector. A decision of this type, so courageous and against the trend, can only be welcomed with pleasure. Monster There has been talk of love for a simple reason: it is precisely the extreme affection that binds the two young protagonists that is the cornerstone of the narrative on which all the events revolve. She, the sweet Elena, was struck by a curse during a thanksgiving party addressed to the divinities of her kingdom and this curse, represented by a tattoo on her back, could not be more cruel. The damsel is in fact condemned to gradually transform into a repulsive creature and ostracized by the rest of the people, a sad existence with no way out if it weren't for Aeron who, in love with her, decides to follow the advice of an interested merchant to the matter and informed on the matter. There is only one way to save the girl from the unjust fate that awaits her: to make her eat the flesh of the guardians (called Magisters) of the thirteen towers, distant buildings built on the borders known above an abysmal ravine known as ~The Fault~, and which they seem, with their chains, to hold the lands of the world together. A risky task that only Aeron, a blond soldier in shining armor, can complete. Thus begins the hero's adventure, a crusade against the unknown in a hostile land, all just to ease the pain of his beloved. A dark fantasy setting frames a cadenced but never pressing narrative, designed to explain little by little, also thanks to splendid computer graphics sequences, the events that forced the two protagonists to begin the path of redemption. To enrich the whole, multiple interlude scenes could not be missing which guarantee, with introspective and never predictable dialogues, real moments of reflection in which to question oneself on the strength of the relationship that binds the couple and which, with its own topicality of the message, makes the gamer participates completely in the girl's future and witnesses her mutations. The passion that drove the development team in creating cinematic clippings in which to explain and support the depth of feeling is palpable and adds warmth and softness to the many lines of text that create, in terms of quality and quantity, a sort of emotional bridge between player and hero. After all, who hasn't dreamed of embarking on a perilous mission to save their princess from the forces of evil? Time passes, back and forth... It would make little sense to try to catalog Pandora's Tower on the basis of its dynamic gameplay, leveraging the exploratory structure to the detriment of the purely characteristic advancement structure. It would also be a bit unfair, actually, because Ganbarion has chosen to rise from the standard category concept to give gameplay that refers to past classics but which innovates them with style, without being anachronistic or getting lost in quotations but rather guaranteeing unique despite clear nods to sacred monsters of the genre. The result is also pleasing thanks to a coherent use of the concept of intrinsic time in the narration on which the story is based and which therefore affects the backbone of the product. Elena's curse advances while the hero is in an exploratory phase in the towers and for this reason it will always be necessary to keep an eye on the indicator responsible for updating the player on the situation, often forcing him to return to the Observatory, a sort of HQ where she waits, to reload this signaller by feeding it pPieces of meat of varying quality found by defeating beasts of all kinds around the towers. So a lot of backtracking, but which by virtue of a spot-on and never heavy level design manages, thanks to whispered shortcuts and easily memorized paths, to be fast and even useful in pointing out points to which you will then have to return in the future. To make moving between areas faster, an interface that allows you to immediately select the destination comes in handy, so as to save downtime and favoring a more fluid and certainly more enjoyable exploration. Combat clearly plays a fundamental role, and although it is legitimate not to expect the index finger pointed at infinite key combinations, it is curious to note how naturally the developers managed to create such a spartan yet so fun fighting system. Many commands but few effective actions, with combat phases in which you will have to decide whether to rely on your main weapon, which allows you to perform combos based on the time you press the attack button, or on the mysterious chain supplied, which adds a level of not indifferent strategy thanks to the possibility of blocking enemies, tying them in columns, fixing them together by also sharing the damage suffered or using it to bring to you distant enemies otherwise unreachable. It must be added that the completion structure of each tower differs each time, proposing a design that makes its own strong point of its thematic characterization. The fire tower will use the flames to create different types of games from the water tower, which in turn will have to be overcome differently from the mining tower, and so on. Many ideas that, although not transcendental, give uniqueness to the exploration and satisfaction in completing each tower by defeating the Magister on duty. The role-playing component is structured in a non-complex way, with an advancement of experience related to the number of defeated enemies and which combines a growth of weapons with an inventory system that will force you to have to imaginatively exploit every single block of equipment available for protections, amulets and armaments, which can be purchased from Mavda, the merchant who has decided to make her knowledge available and animated by who knows what real goal. It will be this strange character who will enhance the weapons in his possession (subject to possession of the right components), repair damaged objects, create new ones and combine them to create further articles to be included in the bag. There will be many, and warm, demonstrations of affection that Elena will give to Aeron, and it is thanks to the care placed in the social side of the product that it will be easy to feel goodwill towards the two young people. The synergy factor, indicated by a specific bar on the screen, shows the level of understanding between the two and can be improved thanks to the possibility for the boy to give gifts and gifts that can boost her morale, or by letting her pass the time by giving her notes to translate and diaries, hidden in the towers, which add interesting cross-sections of the setting. Growing art It is undeniable that the game engine has its limits. Not being able to expect miracles of any kind, it would be useless to expect next-gen textures or shaders or a polygonal mass that astounds, and it is precisely where the power of an engine fails that other elements appear in prominence with ease. First of all is the art picture that is painted in every environment, with a warm color softened by a skilful use of lighting filters, which convey a sacred sense of magnificence in climbing the towers, getting lost among the elements of settings that frame the vision. Trees hanging upside down, walls of minerals, rivers of lava, bramble bushes, waterfalls moving giant mills, exotic architectures and many other environments ensure that the lack of polygons is compensated for by painstaking work in reproducing sections visually very pleasant and ready to make you forget a few too many frame drops. The generic animations of enemies are well made, especially those of the protagonist and his dynamism are the result of a careful study by the team who worked to make Aeron's movements, pad in hand, real and coherent, thus giving very good the idea of controlling a human being, with all its limitations. The same goes for the character design, very inspired in the case of Elena, which encloses in a particularly accentuated expressiveness grimaces and movements which, also thanks to a more than good modeling of the faces, render the sensations of joy, suffering, fear and anxiety well that will cover his face along the adventure. Although there is noto specific personality behind the soundtrack, the musical work carried out does not disappoint and discreetly tests the various melodies that accompany the exploration, alternating a lyricism of perfectly themed choirs with more agitated phases of fight with opponents and bosses of each tower, which they help to gently throw you into pleasant dreamlike atmospheres halfway between reality and dream, making the surrounding danger almost overshadow.", "date": "2012-04-20", "grade": "8.2"}