{"name": "Gibbon: Beyond the Trees", "ref": "https://multiplayer.it/recensioni/gibbon-beyond-the-trees-recensione.html", "text": "Among the new introductions of Apple Arcade stands out the new title of Broken Rules, which we discover with pleasure in this review of Gibbon: Beyond the Trees. There is a noble intention behind the construction of this game, which combines a peculiar mechanics with the desire to raise public awareness of ecological topics, succeeding in the double intention of proposing a sort of platform with original endless runner elements and a story capable of striking with considerable impact, staging the dramatic condition of an animal species at risk of extinction. It is something that Apple Arcade has already experienced in the past in some titles with a concept strongly linked to educational intentions, such as Alba: A Wildlife Adventure or Beyond Blue, just to mention a couple, but which in this case is achieved in a different way, with the active involvement of the player who comes into contact with environmental issues through the physiological empathy that is established with the protagonists of the game. There are no explicit explanations through dialogues, films, documentaries or written texts to read, because Gibbon: Beyond the Trees stages the drama of an endangered species in a more direct way, making us experience it firsthand in the actions of the protagonists and in the mechanics of the gameplay itself, with a solution of considerable impact. The protagonists of the story are a family of gibbons whose life is turned upside down by the irruption of man into their natural habitat and the resulting destruction: all this happens simply by following the continuous race of the creatures among the branches of the trees, which gradually leads them to face increasingly dangerous situations, from the tranquility of the heart of the jungle to the approach to men and modern ~civilization~, with the consequent destruction of the natural elements. All of this is experienced without words, simply following the flow of movements and the flow of settings within the 10 levels to go through. The race of the gibbons, between acrobatics and drama Gibbon: Beyond the Trees, a wonderful glimpse into the jungle The mechanism underlying the gameplay recalls that typical of endless runners, but in this case there are more elements of skill close to the classic platform, with the need to make jumps with the right timing and the choice of correct movements to reach the necessary points and don't lose speed. Everything is linked to the fluidity of the movements, to maintain a constant speed in order to have the momentum to reach the branches of the trees and continue the race avoiding dangers and obstacles. The dynamics are somewhat reminiscent of Tiny Wings: it is a question of touching the screen with one finger to grab onto the branches, holding it down to switch from one branch to another and releasing the touch screen to launch into flight, trying to keep the right timing between holds and jumps in order to maintain speed and possibly use a double tap to take advantage of the slide on the surfaces, capable of guaranteeing restarts with great accelerations. The result is a constant flow of movements that recalls ~brachyation~, i.e. the movement system typical of gibbons based on oscillation and, if performed correctly, is particularly enjoyable and liberating, making us experience up close the emotion given by the extreme agility of these animals. As a result, it's a very simple gameplay: you just need to tap the screen with the best timing and keep the flow, with the dangers that emerge only in the more advanced moments and generally don't offer great challenges. Gibbon: Beyond the Trees: A screenshot from the game with an early human settlement In fact, the trajectories to follow are varied and easily practicable, which reduces the gaming experience to a rather continuous run, sporadically interrupted by the need to make other attempts in cases where one does not understand at first how to overcome a certain obstacle , but this hardly represents a high challenge rate. On the other hand, this is not the point of Gibbon: Beyond the Trees, which turns out to be above all an enjoyable pastime based on the rhythm and flow of movements, all accompanied by a 'evocative and very fascinating aesthetic that recalls, in some ways, the naive style representation of the jungle of Southeast Asia. The Campaign can be completed in an hour of play, but it is then possible to unlock the Liberation mode which allows you to move continuously within a procedurally generated jungle, to free various animals.", "date": "2022-03-02", "grade": "7.0"}