{"name": "Nei panni di un padawan", "ref": "https://multiplayer.it/recensioni/101929-kinect-star-wars-nei-panni-di-un-padawan.html", "text": "The strong suggestion of the space Taoism of Star Wars, the representation of a dirty and credible however alien universe and a series of characters who almost never give in to banality have made the George Lucas series a staple in the world of cinematic mythology. Even today the Jedi and Sith are at the center of cartoons, memes, speculations, computer graphics series and not long ago the second MMO dedicated to the immortal science fiction universe saw the light. Therefore, the enthusiasm that accompanied the announcement of Kinect Star Wars is not surprising, boosted by high-sounding promises, even if it gradually fell asleep between delays and not exactly exciting demonstrations. Xbox 360 goals To get the 1000 points up for grabs you need to play all the game's modes. Most of the objectives are of the progressive type but there is no shortage of achievements that require a skill or endurance test. The latter include a perfect ballet as Han Solo, entire chapters to complete in a single session and of course tests of skill with pods. In the pay of Yoda While the pretext of the whole story is centered on a commander of the New Republic who investigates the archives of Luke Skywalker (functional to the mix of old and new characters present in some modes), Jedi Destiny, the main campaign that puts us in the shoes of a Jedi trained by Yoda, takes place between the first two chapters of the new trilogy. During the various phases in which the story is divided we are faced with the tests of the old master and then we are catapulted into the action which includes the classic long-limbed droids also kicked by the insipid Jar Jar Binks, tons of missiles to deflect, the inevitable Sith and also droids and enemies immune to the force that must be faced exclusively with one's swordsmanship. Everything works through the motion detection of the Kinect, from force to lightsaber parries, and on paper the Microsoft sensor and force are undoubtedly two related entities. In fact, sensing technology has the effective possibility of putting us in the shoes of a Jedi by allowing us to push, remove and throw objects and people. Unfortunately in reality the result does not come close to the images that undoubtedly crossed the minds of swarms of fans on the occasion of the announcement of Kinect Star Wars. The controls are almost always imprecise, the missions are mini-games in sequence and the freedom of movement is a memory of distant announcements, with the movements, made of leaps and shots to be repetitively mimed, which merely make us progress along pre-established corridors. Furthermore, even if the player's reactions are important, especially in sword duels, the moves are few and the force works almost automatically, simply by extending the left arm towards the screen. So it all boils down to finding the right timing, in a pattern that follows the dictates of casual gaming for Kinect. To the above must be added simplified and low-bite dialogues that are not able to reproduce the dark vein that the saga contrasts with the vivid colors and adventurous atmospheres of the series. And those who grew up dreaming of fighting Dooku or lifting an X-Wing from the swamps of Dagobah certainly don't want compromises or fairy tales, they don't want mini-games but a full-bodied and dramatic adventure. Even the technical sector of the title is certainly not up to the high-sounding expectations, also given the results obtained with the recent Kinect Rush, which have shown that it is not necessarily necessary to make too many compromises when using the motion sensor. But in any case inaccurate collisions, truncated animations and static characters are not excusable in any way. More pleasant, even to look at, are the driving sessions on speeders and pods, which also enjoy better sensory detection. Not particularly complex or innovative, the races are still a welcome addition and are quite fun in cooperative, with the formula that allows you to recover something in terms of playability thanks to the implicit rate of competition. Outline and cooperative To complete the offer we find three extra modes that are accessible directly from the main menu. These are a full-bodied dance minigame, in the style of Dance Central, a destructive ride as a rancor and duels between jedi. Unfortunately, excluding the sector dedicated to dance, even the alternative modes suffer from the detection problems and the limited possibilities for interaction that already affect the campaign. To enrich the ~ballerina~ session we also find the characters of the old trilogy with Han Solo in the role of an unlikely Tony Manero galattic. Among the extra modes, this is undoubtedly the best done but it is inevitable, for longtime fans, to feel a pang in the stomach despite the ironic intentions of the developers. Indeed, the lack of a new epic adventure alongside the Jedi is beginning to be felt in a market that sees only The Old Republic holding high the banner of titles linked to the Lucas universe. An unimaginable panorama after 30 years of successes that have included arcade, FPS, action, adventure and acclaimed RPGs. In fact, the title puts us in the shoes of a Jedi, but the force that permeates Kinect Star Wars is not sufficient to give us the might of a true knight and leaves us at the mercy of guided events of little interest. Furthermore, the difficulties of detection, particularly marked when the movements of the arms come into play, worsen further when playing in cooperative mode for two. In fact, the space for movement increases considerably compared to other Kinect titles and it happens that the movements of the partner's arms interfere with ours. In truth, at least in relation to titles dedicated to the sensor, the two-player mode is not badly designed, with the jedi first defeating his opponent who can advance asynchronously with respect to his companion. But the gameplay still fails to take off, between static enemies and bad collisions that do not allow you to accurately repel enemies' attacks and blaster shots.", "date": "2012-04-16", "grade": "5.8"}