{"name": "Sine Mora", "ref": "https://multiplayer.it/recensioni/101832-sine-mora-resistenza-nippo-ungherese.html", "text": "An undoubtedly ambitious mission that Sine Mora has set for itself, or rather the desire to bring back a genre, that of shoot'em ups, which has been suffering from a crisis that has been rooted for years now, in the shade in the video game schedules where indeed once reigned supreme as the backbone of that exquisitely hardcore and ferociously selective game conception of the players' skills. It must be said that digital delivery platforms have still reserved spaces today where you can show off your ability to dance among storms of colored bullets, dusting off gems from the past and thickening the catalog with completely new shooters, but it was certainly missing to the list a project born under premises as peculiar as those that gave birth to Sine Mora. If you veterans of endless two-dimensional sliding dogfights have any doubts about the goodness of this brand new exponent of the genre, it is time for you to abandon any hesitation to launch yourself into the crowded skies of Seoul. Time for revenge This unusual collaboration between the Suda 51 team and the Hungarian developer Digital Reality has given birth to a product that combines the experience and mechanics of the Rising Sun school with a style and a raw but fascinating storytelling close to a tradition of Europe Oriental. Sine Mora narrates the exploits of a resistance group against an imperial and totalitarian power that oppressed the peoples during the Eternal War, represented by anthropomorphic animals beautifully characterized in the artwork visible during the dialogues. But forget the classic story of fearless heroes against absolute evil, here the gray scales make any difference between black and white, between good and evil, much more indefinite. The actions of the rebels are guided by feelings such as revenge for the loss of a family member, blackmail, social revenge, all seasoned with strong and raw narrative colors that fill the few hours of the story mode with an intensity rare for this genre of games . A large part of the context is described by textual screens present at the beginning and at the end of each level, also rich in emotional introspections of the protagonists and accompanied by a narrative voice in Hungarian which gives a sense of particular extraneousness compared to the languages more commonly known by the general public . We immediately advise you not to skip these texts too sufficiently but to dedicate the few minutes necessary to reading to be able to fully enjoy the narrative background staged by the developers. A peculiar feature of the rebels, and the pivot around which the gameplay of this shoot'em up revolves, is their ability to travel through time, thus managing to influence the fate of a war much bigger than them with interesting and unexpected narrative implications. Translating everything in terms of playability, this ability takes the form of the power to speed up the action of the pilot, who paradoxically is represented on the screen by slowing down enemies and their respective attacks, allowing us to manage particularly chaotic situations with greater peace of mind. This ability, the only one available in the story mode, is accompanied by two other selectable powers in the arcade modes: the rewind of time useful for being able to go back and avoid the mistakes made and a shield that offers defense from enemy bullets for a limited period. More ordinary are the offensive capabilities of the aircraft that we are called to control, with a primary shot that can be improved in nine levels by collecting the power-ups left by the enemies and secondary attacks that can vary from bombs, laser beams or support aircraft, the use of these supports proves to be essential right from the start to get the better of the most dramatic situations. Xbox 360 goals All of Sine Mora's goals boast a denomination of various Latin sayings (non-Latinists don't worry, there is the Italian translation) and they are all related to the achievement of a certain degree of skill. There are only two unlockable objectives already from the tutorial, one of which in particular requires very little skill to be obtained, after all... stercus accidit. No waste of time Beyond the particular (but certainly not unprecedented) characteristics of time manipulation, the mechanics of Sine Mora reflect those canons of immediacy and frenzy typical of the genre, while not reaching those peaks of insane difficulty typical of the bullet hell vein, perhaps thanks to its soul half western. The progression of the difficulty curve, at least at a normal level, is initially quite gentle and then escalates more boldly as the levels progress, reaching high-voltage peaks in the last boss fights. Ownthe creation of the enormous war machines that guard the end of each scheme is a further flagship of the game, thanks to the work done by the illustrious Mahiro Maeda (author among others of the design of the angels of the Evangelion series). The means and structures that we are called to face on several occasions shine for their complexity, easily admirable with the frequent overviews of the direction that revolves around entire portions of the entirely three-dimensional levels also offering an enjoyable variety of the scene, almost unknown in other illustrious shoots' em up. The management of the player's vital energy is also unusual, represented here by nothing less than time that flows inexorably backwards. Obviously this means that each hit suffered costs a reduction of precious seconds while to gain time it is essential to concentrate on killing enemies. This structure proves to be more forgiving at the lowest difficulty level should the player suffer some damage but, especially in the time attack and arcade modes, situations are not uncommon where the difference between a high score and an unseemly game over travels on the edge of few seconds, forcing us to hasten the killings as much as possible, otherwise we will run out of time. It is precisely the arcade modes that represent the paradise of the expert of the genre, where it is possible to attack the world rankings by playing all the levels of Sine Mora in their most difficult but at the same time satisfying dimension, relieved of all the narrative components and outline footage. In this mode you are free to choose the level to face and with which plane and character, each of which can boast a peculiar type of secondary attack; obviously all these customization possibilities must be previously unlocked during the decidedly less long-lived story mode (just three hours on normal difficulty, the lowest available) and more accessible even to less experienced players willing to accept the compromise of resorting to a few continues too many. Playing in the points attack section, on the other hand, it becomes essential to maintain a score ranking as high as possible, starting with C up to the maximum of grade A, minimizing the use of secondary attacks that involve a ranking downgrade. For the more perfectionists there is also a mode where you can re-face each of the bosses killed in the campaign, proving to be an excellent form of training. Admire without delay An enviable solidity of the gameplay is also accompanied by an equally painstaking work from a technical point of view. With Sine Mora the standards of the other Live Arcade productions are surpassed, thanks also to a high-calibre artistic work testified by the characterization of the pilots and their vehicles. The game environments that surround the levels are entirely modeled in three dimensions and range in their heterogeneity from bucolic landscapes to narrow submarine tunnels or dark caves illuminated by the headlights of our vehicle, to move on to exploration from inside immense mechanized structures up to skylines of immense metropolises in full turmoil due to the destruction of the Eternal War, all depicted following a style halfway between heavy architecture and technology typical of an imaginary linked to post-Soviet Europe, together with eccentric iconography and irony more distinctly Japanese. The polygonal modeling is never poor and shows its muscles in the immense self-propelled structures that oppose our armed advance to the teeth, with beautifully defined textures and light effects ready to enhance the numerous explosions on the screen, without ever experiencing any slowdown in the game action. A special mention certainly goes to the audio sector born from the genius of Akira Yamaoka who edited the soundtracks of the historic chapters of the Silent Hill saga. Here the eclectic Japanese composer spices up the game with often melancholic melodies that offer a pleasant contrast with the frenetic action represented on the screen and then move on to more sustained accompaniments when it is necessary to underline the epic nature of the battles with immense bosses, without ever being cloying or too invasive. Of note is the presence, once the campaign is complete, of an exhaustive encyclopedia full of entries concerning the fascinating universe of Sine Mora. A great tool to delve into the history of events and to better appreciate the excellent work done by the designers and screenwriters.", "date": "2012-04-14", "grade": "8.9"}