{"name": "Una saga di pixel e chiptune", "ref": "https://multiplayer.it/recensioni/101723-bittrip-saga-una-saga-di-pixel-e-chiptune.html", "text": "The Bit.Trip series, as a whole, has probably represented one of the major projects related to the digital delivery of the Wii from its birth to this part, therefore its revival in the form of a collection should be considered a decidedly positive move. On Wii, the operation was a success, as demonstrated in the review published on these pages: in addition to the intrinsic and undeniable value of the six titles originally released on WiiWare and collected on a single disc, the package in question boasts a series of additions and bonuses that constitute great added value, making Bit.Trip Complete a true cornucopia of pixels, colors, chiptune music and colorful retro-flavored instant fun. The question is a little different with regard to Bit.Trip Saga, the collection specifically put together for Nintendo 3DS which differs from the aforementioned for various content reasons, through choices that frankly are difficult to justify. Leaving aside the extra-playful bonuses of the Wii version, such as the soundtrack on disc, the videos, images and letters from the developers, which certainly represent a substantial enrichment in the overall offer but can be more easily expendable, the lack of all the properly playful additions included in the Complete version, such as the different difficulty levels and the twenty additional schemes for each of the six titles. What Bit.Trip Saga offers, therefore, is just the essentials, or rather the six original titles re-proposed side by side within a cartridge, without any variation compared to the original experience on WiiWare. Except for a single characteristic addition, of course: the adaptation of the graphics to the stereoscopic 3D of the Nintendo 3DS screen, a novelty that pervades the entire collection and gives a largely new look to the six Gaijin games. Bit.Trip.InComplete We leave the specific analysis on Bit.Trip Beat, Core, Void, Runner, Fate and Flux to the individual reviews, published at the time, and we focus here on the value of the collection as a whole, in particular of Bit.Trip Saga, which as we said it differs somewhat from its equivalent on the Wii. These are six titles each built on simple ideas and developed in a brilliant way, centered on a particular vision of some classic elements of arcade-style video games and linked to each other by the graphic style, by the psychedelic universe of reference, by the presence of an enigmatic main character and the particular interpenetration between gameplay and soundtrack that adds a rhythm game undertone to the different structures that characterize each episode. They range from the reinterpretation of the shooter to the puzzle game, from the platform to the ~Arkanoid style~ in these reinterpretations of classic concepts in new and original forms. These are games that adapt perfectly to the portable context of Nintendo 3DS, relying on immediate structures that immediately launch you into the middle of the action, limiting the narrative substrate to short sequences with a decidedly hermetic articulation and providing a demanding but calm challenge that can be enjoyed in small doses, indeed necessary not to get dragged into the frustration to which the average high level of difficulty can induce, especially in the more advanced stages of each title. In short, the series finds a privileged place in the Nintendo 3DS cartridge, which makes the choice made by Gaijin to cut away from Bit.Trip Saga all those additional and side elements that make Complete a rich box set from great value for money, the definitive form of the entire game series. Especially since the price of the product for Nintendo 3DS is significantly higher than that of the game on the Wii. The 3D effect The application of the three-dimensional effect therefore represents one of the major strengths of this collection, considering the absence of further substantial innovations compared to the versions released on WiiWare. The simplicity of the lines and shapes and the mix of 2D and polygonal elements with stereoscopic 3D allows for abstract, fascinating and almost psychedelic effects that blend well with the general style of the game and with the chiptune-style soundtrack. In some situations there is a certain loss of fluidity, in particular as regards Runner, but in general the use of 3D proves to be a real graphic evolution. Bit.Trip.3D Crippled in content, therefore, the real added value of Bit.Trip Saga, its characterizing element, becomes above all the graphic aspect, obviously together with its tendentially portable essence. 3D fits perfectly into the psychic worldhedelico from the Gaijin series, creating an effect of depth that rarely strikes as intensely as in this case. The extremely abstract, geometric, almost alien characterization of the various games allows individual shapes to be exalted in a particular way, increasing the alienating and fascinating effect of the universe of pixels, colors and chip music created by the development team. The third dimension is an accessory element, since the games are built on a rigorous 2D structure, yet the mix between sprites made of pixels that move on a two-dimensional plane and the three-dimensional grafts given by the overlapping of planes and elements at different heights, as well as from the depth of the polygonal solid figures, it manages to provide a constant ~wonder~ effect to the simple stylized and retro-chic representation chosen by the developers. Another peculiar feature of this version is the control system, which while in the original versions is based on a differentiated and always rather precise use of the Wii Remote, here it alternates the use of the digital cross, analog or touch screen. The results are different for each title but in general they do not reach the precision and ease of use of the control system built on the Wii controller. The analog of Nintendo 3DS does not prove to be up to the situation, pushing towards the more precise and easier choice of the touch screen (in Beat and Flux), while in Fate, for example, the combined use of touch screen and analog, with the need to make extremely precise movements on a different screen than the one where the action takes place, it is a bit confusing.", "date": "2012-04-11", "grade": "7.5"}