{"name": "Alieni rotolanti", "ref": "https://multiplayer.it/recensioni/101659-fibble-flick-n-roll-alieni-rotolanti.html", "text": "The big names in the gaming industry have long since begun to colonize the world of mobile gaming, driven by the growing movement of money that revolves around distribution services, especially the App Store. A heavyweight like Crytek was still missing from the appeal, which finally breaks the delay with a title that objectively was not expected from a company specialized in FPS: let's talk about the present Fibble - Flick 'n' Roll, an action-puzzle from cartoonish look suitable for a particularly casual user, who however does not skimp on some pleasant twists. Little big adventure As illustrated by a nice animated introduction, the plot of Fibble - Flick 'n' Roll sees the homonymous alien lose control of his microscopic spaceship, which ends up crashing on planet Earth inside a house: the little protagonist will have to therefore explore 30 levels divided into four different rooms in order to recover the pieces of your aircraft and soar again in flight. A simple premise that starts a gameplay equally focused on ease of use, and which takes its cue from the mechanics of minigolf games: the stages are in fact made up of real courses that end with a hole towards which you have to push Fibble with up to three throws. However, there are several elements that distinguish the Crytek product from more conventional titles, first of all the presence of stars and coins to collect in order to aspire to the highest scores, strategically positioned in such a way as to induce the user to plan his own process well. Fibble's travel companions are also of great importance, whom he will find on his path, and who, depending on the levels, can be placed in predefined points to provide their personal contribution: thanks to them, the player will be able to jump, swing, change direction or enjoy a short boost, all by simply tapping them the moment Fibble hovers over them. An element that adds a good dose of action to the basic play mechanics, and that goes hand in hand with the structural richness of the stages, literally overflowing with buffers, platforms, tunnels and so on. The game thus continues in an absolutely pleasant way, even if the ingenuity of Crytek with a genre that does not belong to it comes out in some non-negligible aspects. Fibble - Flick 'n' Roll is first of all very easy, and completing all 30 levels with honors in a short time is an all too accessible undertaking that ends up undermining the global longevity of the product. Furthermore, for a title that requires good precision on the part of the user to measure the power of shots and activate actions on the screen, the detection of the touchscreen seemed anything but exciting, and it often happened that punctual touches were recognized with delay or even completely ignored. Some future updates will probably put things back on track by adding more challenging stages and improving the sensitivity of the controls, but for the moment Fibble - Flick 'n' Roll is still an enjoyable, if far from unforgettable, puzzle game. The trademark of Crytek -completely absent in the gameplay- can however be seen at a great level as regards the technical realization, truly sumptuous above all by the standards of the genre: the game can in fact boast completely polygonal backdrops equipped with an impressive level of detail, a great care for the elements that make up the courses, high quality physical routines and real gems such as the tasty motion blur that accompanies the movements of the camera. The sound is decidedly less exciting, with decorous effects but rather scarce music for variety and inspiration.", "date": "2012-04-10", "grade": "7.5"}