{"name": "Per la gloria!", "ref": "https://multiplayer.it/recensioni/101473-battleloot-adventure-per-la-gloria.html", "text": "If with the excellent Ducati Challenge HD the Digital Tales team has shown that they know how to deal with asphalt and two wheels, Battleloot Adventure has proposed a very different challenge to the young Milanese developer. Set in a typical fantasy universe, the game in question is in fact a lively and quite accessible turn-based RPG, which deviates from the Japanese conventions of Chaos Rings and the highly articulated structures of Rimelands to go alongside that small sub-genre made up of simple experiences , battles in succession and exasperated grinding of which Battleheart has so far been the standard bearer on the App Store. The aim of the developers this time is to get closer to that slice of players ~who still appreciate the pleasure of managing their party without worrying about success rates and armor coefficients~. But will they succeed? RPG without math From the start of the game and for the entire duration of the first act, a long tutorial accompanies the user in the combat system and in party management, the real heart of the title if we consider that the vast majority of the time will be spent in battle. All this happens through intuitive touches on the touchscreen: you select one of the three party members and decide which enemy to attack, while in the defense phase you just need to touch one or more warriors to raise your guard and protect yourself from enemy blows. Interesting is a combo system that allows you to launch chained attacks between multiple characters by sacrificing a minimum of energy, an action that most of the time allows you to get stars to spend to activate any special abilities. Healing spells and power-ups happen automatically every turn, while it's all based on the most classic of rock-paper-scissors systems between fighting classes: warrior beats healer, who beats sorcerer, who beats assassin, who beats the warrior. Unlike what it may seem from the first few minutes in which the game takes the more casual user by the hand, the combat system works extremely well and also requires a pinch of strategy in the more complex battles. It is also possible to manage the formation of your party, keeping in mind that the characters further back are more difficult to hit, while the more advanced will be more subject to enemy attacks. Too bad for the more or less obvious bugs, the most annoying of which in some cases sees your attacking character remaining motionless in place and letting the turn pass to the opponent; needless to say how much in some critical moments such a situation can compromise the entire battle. However, the flaws in Digital Tales' game don't stop at the smudges in the code. The story told by Battleloot Adventure features a small group of mercenaries who, driven by an irrepressible thirst for fame and wealth, decide to join forces to exterminate all the monsters that infest the kingdom and plunder its treasures, occasionally hiring new warriors and participating in the sporadic tournaments organized in some areas of the kingdom. Surely among the most neglected elements of Digital Tales, the plot of the game is so superficial that it takes a few minutes to forget about it, while the entire narrative fabric rests on nice lines of dialogue that the player will have no problem ignoring. It must be said that, if on the one hand the game is structured in such a way that we can do without a narrative plot, on the other we still feel the lack of a common thread capable of accompanying the user towards a final battle that , on the other hand, is blurted out in his face without any preamble. Also due to an enormous lack of variety and battles that are all the same, the absence of a solid plot contributes after a while to highlighting the monotony and repetitiveness of the mechanics. Luckily, the huge amount of objects, equipment and skills to unlock using the money collected in battle takes care of keeping the player glued to the screen: soon you find yourself fighting a battle not so much (or not only) to continue in the game , but above all to accumulate enough gold to buy potions, swords, armor, special powers or new warriors for your party. For almost the entire adventure there is never the need to repeat battles already completed, but the latest battles lead to a furious grinding, predictably avoidable by resorting to the inevitable in-app purchases. Finally, the flagship of Battleloot Adventure is undoubtedly the excellent graphics, a successful alchemy between the charismatic characters designed by Andrea De Siena and the splendid illustrations by Mike Bacchin.", "date": "2012-04-05", "grade": "7.0"}