{"name": "Soli e pazzi. Peggio si pu? Oh", "ref": "https://multiplayer.it/recensioni/101501-lone-survivor-soli-e-pazzi-peggio-si-puo-oh-si.html", "text": "There is light at the end of the tunnel. In a market where video games mate with themselves to give birth to ever weaker children, something strong still emerges to save the gaming tribe. Lone Survivor is not an absolutely original game but it carefully chooses which elements to borrow from other sources, reworks them with its own style and presents them to us with such clarity and awareness of how a game is structured that we are delighted and happily frightened. Yes because Lone Survivor is a horror game. As the protagonist, identified only with the pronoun ~You~, we must understand what has happened around us, discover why the world has plunged into a kind of zombie apocalypse and why we seem to be experiencing the effects of a powerful hallucination. Luckily, no time is wasted: the commands are learned by playing - wonderful! - and after a couple of minutes we are already intent on reaching our first goal. The game is not pressing, rather it lets us know what the next goal is without confusing us and staying within the fiction. In fact, it may happen that the protagonist speaks aloud reminding himself what he has to do, for example ~go down to the dungeons~, justifying his (our) hesitation by saying that the mere idea makes him shiver. They are details, of course, but there are many of this type and they contribute without even realizing it to let us enter the game, to experience it firsthand. To better understand how meticulous this sowing of intertwined elements was, let's take the final screen, the one with the statistics, as an example. There are several endings in Lone Survivor and this last screen, more than one to tell the truth, collects all the choices we made that produced that ending. There are dozens: some of clear interpretation, others inscrutable. We played, we lived the fiction, made many important choices and in the end we discover that everything made sense, that the game has followed us every moment. The nightmare was always there with us. But now let's get out of bed and try to find out what those obscene verses coming from the corridor are. Superflat Games Behind Superflat Games there is only one person, Jasper Byrne, a very talented and very versatile English developer. Just think that for Lone Survivor he did everything by himself: graphics, (crazy) music and game design. And he did it all tremendously well. From his bio on the Superflat Games blog it turns out that he was a music producer and DJ, so it all adds up. However, among his best-known games before Lone Survivor, we recommend trying Soul Brother and Soundless Mountain II, a demake of Silent Hill 2 - evidently the love for a certain type of horror has its roots in the first episodes of the extraordinary Konami saga , considering how much influence it had on Lone Survivor as well. Hunger bites more than a zombie The interaction with the scenarios is identical to that of a point and click graphic adventure. We must therefore press a key when we are on an object to collect it and perhaps combine it with others already present in our inventory. Or when we find ourselves in front of a door, to find out if it opens, and the same to examine a detail. Only one button for each type of interaction. Only that it is dark around us and without light it is not possible to know what a sensitive point hides. Indeed, by activating the ~expert~ mode, we will not even know where the sensitive points are. Luckily we get a flashlight soon, but it burns the batteries worse than a Nintendo 3DS. Therefore, accept a suggestion and save because Lone Survivor best expresses the philosophy of the original survival horror: ~do with what you have because then we won't give you any more~. In reality there would be some colored pills that we can stock up on in the bathroom at home. Use them with caution, they have unpredictable long-term effects. As if that weren't enough, the protagonist needs to eat, and he lets us know with phrases like ~I'm hungry~ or ~I'm starving~ in more serious cases. Not only will we therefore have to find food often, but it will soon become necessary to take advantage of the kitchen to feed us some substantial dishes. Unfortunately, spoiled foods happen from time to time, perhaps even in the same package of crackers, hidden among healthy packages. When we are injured it is better then to drink a can of soda, sealed and with a long shelf life. But there's not only this, because tiredness also haunts us. We have to sleep sometimes. All of these elements, as well as the save that occurs after a night of rest, are seamlessly integrated and do not distract the player with indicators or symbolsstrangers to the world of history. Context is well concealed and suspension of disbelief encouraged. Every instant in the world of Lone Survivor is a fight against tiredness, hunger, destabilizing visions. Moments of grace are few and they vanish leaving us with new questions. Finding the answers among the splinters of memories and the bowels of monsters is the task that will guide us to the end of this disturbing adventure. The ways of horror are endless The floor plan of the house we're in is large and even with the map in hand it's easy to get lost - note that while we're consulting it, the game doesn't stop, and the same happens when we rummage through the inventory. Fortunately, reflecting ourselves in some special mirrors we experience hallucinations that take us back to the silent room of our apartment, the only safe place in the game where we can stock up on meat to attract the dead and recover the precious colored pills. To avoid the tedium of repeating the same route twice, the game adopts a trick borrowed from Silent Hill in the first part, that is, the world around us changes: doors that were previously blocked now open and originally desolate rooms are filled with creatures. Later we will find shortcuts to travel even long distances in a few moments. Enemies on the other hand are always a problem. They can be killed by aiming at the knees, torso or head, but the shots are few. Better then to leave a meat bait on the ground and hide in the background to get around them safely. Or turn on the classic beacon that somehow always succeeds and put even the most convinced zombie in crisis. As for the bosses instead, you have the thrill of finding out how to save your skin. But don't dream too much, the only weapon is the pistol, no rocket launcher this time. Yet they are only cubes Now that we have told you almost everything we want to remind you that we are talking about a two-dimensional game that oozes pixels; yet it works. And you feel a real sense of loneliness. Every now and then there is some other living soul, like people locked in a room engaged in a private party as if nothing had happened, while in the background a rhythmic music warms the atmosphere. Many will recognize in this alienating situation and out of place music a tribute to Twin Peaks. Apparently we're not alone, but wait till you see what dudes we can talk to. They will make you feel even more desperate. Lone Survivor plays on ellipses; we don't know what happened before we woke up and fragmentary news comes from the radio, some of which is useful for our survival, if we tune in to the right frequency. The darkness hides secrets and sighs, and the few visible details suggest disturbing questions about what is not represented. Jasper Byrne turns the technical limits of the game in his favor, which in his hands become proven tools to keep the tension high. Lone Survivor is sinister, anxious and accompanied by memorable music. Don't ask for more and make it yours, it costs $10 on the official website and there's a Flash demo for anyone who wants to try it.", "date": "2012-04-05", "grade": "9.0"}