{"name": "Legend of Grimrock", "ref": "https://multiplayer.it/recensioni/101528-legend-of-grimrock-nelle-profondita-delle-segrete.html", "text": "We have been following Legend of Grimrock with interest since the announcement. Looking at the first images, we didn't hesitate to ask ourselves what was the point of resurrecting an ultra-hardcore subgenre like that of first-person role-playing games a la Dungeon Master, practically dead except for a few exceptions (only id Software's mobile games come to mind, Doom RPG, Wolfenstein RPG and Orcs & Elves, even if they were quite simple) but at the same time we were intrigued by so much courage and willingness to take risks from the development team, regardless of current market trends. What will be behind such a beautiful door? The first feature of the game that intrigues is the ability to download and print a squared sheet. By starting a game, you immediately discover what it is for: if you want, you can deactivate the automapping and completely rely on your cartographer skills. The times come to mind when either maps were drawn by hand, or one was forced to memorize every single corridor so as not to get lost inexorably. Another option allows you to choose whether to select a preset party or create one from scratch. Having chosen the second option, you are faced with a rather rich character sheet, in which you have to assign the various points available and choose your name, race, class and traits. But is this how heroes are treated? There are four selectable races: the classic humans, good for all specializations, the minotaurs, excellent warriors, the lizard men, skilled thieves, and the insectoids, skilled magicians. The skills are linked to the selected class and the more points you assign, the more advanced abilities are unlocked. For example, a wizard with a high rank in fire magic can cast more powerful spells related to that element and has greater resistance to heat, while a warrior with a high rank in armor will resist damage better. However, having made our choices, we just have to enter the dungeon. Inside Grimrock The initial narrative sequence, made up of fixed drawings and writings, shows us the four characters of the party who are thrown into Grimrock prison. The reason why we were incarcerated is unknown, while the purpose is very simple: to explore the underground maze and get out alive to obtain grace and freedom. The first floor of the self-mapped dungeon The first dungeon serves as an introduction: no slavish explanations, fortunately, but some writing on the walls that reveal the actions to be taken to move forward. In reality there is a real tutorial that can be useful for newbies, but if you know the genre it won't take long to understand how Grimrock's interface works. However, it will be useful to provide some more in-depth explanations for the use and consumption of those who have never tried anything like this. Basically you move through levels made up of boxes, as was also the case in the first paper role-playing games. Each move moves you forward or backward by one, but you can rotate the camera in ninety-degree snaps to look around. The developers have also included the ability to unlock the view to better examine the different places. At the bottom right there are the portraits of the elements of the team, whose position respects the real one in the game. So we have two advanced characters, usually warriors capable of absorbing more blows and attacking with melee weapons, and two backwards, usually wizards or someone skilled with ranged weapons (rocks, throwing knives, and so on). The mouse pointer is used to interact with the environment (pull levers and chains, collect objects, press secret buttons, and so on) and to navigate the menus. Each adventurer can carry a limited number of items that do not exceed a certain weight. Ergo you can't accumulate too many junk. Combat and advanced features To attack, click on the weapon under the portrait. You cannot carry out burst attacks but, depending on the characteristics of the character, there will be a more or less long waiting time between one blow and another. This applies both to those who use weapons of any kind, and to those who cast spells. The latter, which consume mana, are performed by composing combinations on a small board full of runes. To perform a spell you must know its formula and have assigned enough points in the appropriate skill. By opening a hero's card, you will notice a green bar among the various values that characterize it. The fights are often challenging It is a feature that was once very present in RPGs, namely the satiety indicator. If this is almost full it means that it is not hungry and can give its all on the battlefield. If the bar runs outtoo much ours will start to have some difficulties. Obviously to fill it again you have to feed it. Rations are found by exploring dungeons, or by killing enemies. Speaking of the latter, Legend of Grimrock presents a truly rich bestiary. They range from weak ones like giant green slugs, to beasts as big as rooms that do absurd damage. Without revealing too much, know that we are not dealing with an easy game and that it is not uncommon to have the party exterminated because a fight was faced badly and perhaps we found ourselves surrounded and defenseless. If at the beginning the Game Over is rarer, already from the third dungeon the risks become really high. Exploration One of the most entertaining features of Legend of Grimrock is the large number of secrets contained in each labyrinth. Finding buttons allows you to discover hidden locations where, usually, the best equipment is recovered. It is worth exploring the dungeons inch by inch in search of small niches and not very visible details which, perhaps, conceal an invisible access. Also from the point of view of the puzzles we are faced with a vintage RPG in every sense: some are not easy to solve and force you to explore far and wide to understand what to do. The need to shop around and the complexity of the puzzles make it difficult to quantify the longevity of the game, especially if you don't use automapping. Know that it lasts many hours, often more than one per dungeon. Let's say that the oscillation indicated by the developers, or between 15 and 30, is quite realistic: a little less for those who play with all the aids activated, much more for those who will play with fewer aids and at more difficult levels. Moreover, it seems that the team wants to release an editor soon that will allow everyone to draw their own maps, extending the life of the game even more. Not bad for a product that retails for the budget price of $11.99 on preorder. And then $14.99 once it's released on April 11th. From a technical point of view Grimrock does its job, with well-designed walls and well-modeled monsters. Sure, there aren't many assets, also because basically it's a single big dungeon divided into floors, but what is there is well done. Furthermore, the title is perfectly playable even on configurations that are not exactly cutting-edge, which is always a good thing.", "date": "2012-04-05", "grade": "9.0"}