{"name": "Sole spento", "ref": "https://multiplayer.it/recensioni/101351-incoboto-sole-spento.html", "text": "Inco is the only inhabitant of a microscopic planet lost in space. Completely alone, he spends his time observing the dying universe through his telescope, engulfed in a darkness whose origin he does not know. Suddenly, a small sun named Helios appears and invites him to accompany him in an attempt to restore light to the galaxy. Will this strange couple succeed in such an arduous undertaking? Perhaps: what is certain is that the two protagonists of Incoboto are part of one of the most interesting and original games in the recent history of gaming on iOS. Cosmic dark Described on the App Store as a puzzle-adventure inspired by Ico and Portal, Incoboto actually shares the underlying melancholy with the former and the concept of a protagonist who has to look after a supporting actor, while with the latter it has in common the fact that it is based entirely about successions of environmental puzzles that require a marriage of gray matter and ready-to-solve reflexes. The user is placed at the controls of Inco, initially only capable of moving in the two directions of the two-dimensional plane and jumping, but who will learn a whole series of new moves and skills during the adventure. The small home planet of the protagonist also serves as a tutorial for the basic mechanics of the game: the goal is to collect the fragments of stars scattered throughout the various stages to unlock access to the next ones, using a control system very simple that engages the user only to keep a finger pressed on a point of the touch screen to move Inco in that direction or to make it jump with a quick swipe upwards. Only an above average design can be able to support such a slender play structure in its basic concepts, and the developers of Fluttermind have shown great skill by filling the title with puzzles which, with the exception of the first interlocutory jokes, are always inspiring and cleverly crafted. Starting from classic puzzles based on keystrokes, we soon come to face complex puzzles that require the user to exploit with knowledge of the facts electric charges, gravity inversions and even portals that recall the aforementioned Valve masterpiece: the force of Incoboto lies in skilfully juxtaposing these and other elements during the more advanced levels, giving the user entire planets made up of structures with which to interact in the right sequence to reach the most difficult star fragments. Although the difficulty becomes challenging already after a few acclimatization stages, the Fluttermind product is never frustrating thanks to the impeccable work in the design phase: the solution to the puzzles always appears rational and its achievement is never excessively tangled, making the enjoyable and challenging gameplay. It also doesn't hurt that the game is quite long-lived, thanks also to a well-implemented backtracking that leads the user to retrace his steps with new skills to collect previously inaccessible fragments. In addition to the important merits on the gameplay front, Incoboto denotes great care for what concerns the visual aspect and the atmosphere, both balancing on the border between a melancholy mood and a genuine underlying irony. In the course of his wanderings, Inco will come across both the dramatic messages left by the inhabitants of the planets in their last moments of life, and the notes of a notorious Corporation (apparently responsible for all the structures found in the galaxy) that can snatch more than a few smiles thanks to a sense of humor that also in this case recalls that of Portal. The technical sector performs an excellent task in following this trend also in the audiovisual offer, putting on the plate a very successful two-dimensional cosmetics that alternates generally dark and desolate scenarios with pops of color such as the joyful and childish aspect of Helios, resulting functional and very pleasant at the same time. The sound accompaniment is also absolutely spot on, in the context of which a series of dreamlike and enveloping music stands out which contributes a lot to giving a unique personality to the product.", "date": "2012-04-02", "grade": "9.2"}