{"name": "Pikachu alla riscossa", "ref": "https://multiplayer.it/recensioni/101190-pokepark-2-il-mondo-dei-desideri-pikachu-alla-riscossa.html", "text": "The sunset of the controversial Nintendo console is not the happiest for pokfans from all over the world: the brand was certainly not among the strongest in the Wii toy library, appearing only in very simplistic forms, far from the portable proposals for Nintendo DS and, above all, from the always excellent mother series. PokPark 2: The world of desires is the direct sequel to PokPark: The adventure of Pikachu, of which we spoke in not exactly enthusiastic terms almost two years ago; even then it was a light adventure aimed above all at the little ones, despite some easily solvable problems. We therefore accompanied Pikachu on a new raid, hoping that the past months have allowed the guys from Creatures Inc. to make the right changes to a formula that is not entirely without merit... Dreams are desires Despite the certainly more childish target, PokPark 2: The world of desires offers a story that is a little more mature than usual, at least in terms of exposure. It all begins when Pikachu and his best friend Piplup go to a magical park where it seems that every wish comes true: of course, all is not as it seems and you will soon discover that a mysterious evil force is trying to capture the pokmon. In short, recruited by none other than the mythical legendary monster Reshiram, Pikachu will have to roll up his sleeves and find a way to avert the threat and save the pokmon before the crossover with Nobunaga's Ambition comes out. For this titanic undertaking, the electric mouse will be able to count on the help of the three initial little monsters of Pokmon Black & White version, which can be controlled at any time, exploiting their peculiar abilities to overcome otherwise insurmountable obstacles. Oshawott, for example, can swim, and Tepig can destroy some barriers while Snivy can jump higher than others, reaching otherwise inaccessible places. Choosing the right pokmon therefore allows you to explore the enormous amusement park far and wide, but to access some areas it will be necessary to first make friends with some monsters, exactly like in the prequel: in this case you will be able to interact with over a hundred of creatures from a PokDex that has now reached the crazy number of six hundred and more little monsters and even if not all of them are present in the park, there is certainly no lack of variety. The setting itself is structured quite intelligently, made up of numerous and very colorful themed areas that make just the idea of a large playground. While not fully exploiting the capabilities of the console, Creatures Inc. has managed to develop a product that is technically more than decent, colorful and full of details. The pokmon models, in particular, stand out for their resemblance to their animated counterparts, especially enhanced by the television verses, decidedly preferable to the antiquated screeches of the various portable episodes. The harsh reality We'd like to say that the gameplay is as varied as the setting, but unfortunately it remains anchored to the structure of the previous chapter, without particular peaks of inventiveness and originality. All you have to do is wander around the park and find a new pokmon to make friends with, perhaps by hitting him (it seems logical to us) or by correctly answering simple quizzes. The tag mini-game is disarmingly easy given that even the youngest player would be able to win in just under ten seconds, while it is certainly more fun to fight against the pokmon on duty: in these cases you have to select one of the four protagonists keeping an eye on the relationship between the elements that characterize them, then you play by directly controlling the little creature and attacking at the right moment after dodging the opponent's special moves. The battles are extremely simple but fans of the series will appreciate being able to control their heroes firsthand, instead of giving orders as the usual trainer. In short, the mini-games are anything but demanding and the little ones will find that they can play them over and over again without the risk of unhappy Game Over; the problem, more than anything else, lies in the excessive repetitiveness of the situations: one immediately realizes that the adventure will continue entirely to the sound of easy challenges that are too similar to each other. After completing some mini-games it will also be possible to try them in multiplayer mode with up to three friends, a lack of the previous PokPark which Creatures Inc. rightly remedied. We're clearly far from the glories of Mario Party, but we can't complain. Unfortunately, we didn't do so well with the controls, still boundto the simple Wiimote in horizontal position. This choice, harshly criticized previously, makes the exploration of the three-dimensional world really annoying and it would certainly have been more convenient to be able to control Pikachu and associates with the Nunchuk, rather than with the directional cross.", "date": "2012-03-29", "grade": null}