{"name": "La strada dei Ninja", "ref": "https://multiplayer.it/recensioni/101097-ninja-gaiden-3-la-strada-dei-ninja.html", "text": "The world of scrolling fighting games has split in two in recent years: on the one hand Kratos and his gods, on the other Ryu Hayabusa and the ninjas who survived medieval Japan, capable of solving any impossible situation thanks to martial arts handed down from millennia. Two opposing schools of thought, with ninjas, born from Itakagi's slightly morbid imagination, almost representing a dynamic transposition of complexity of the mechanics of the hard-hitting matches in a context that until then had known few key combinations. The extreme technicality of Ninja Gaiden against the softness and spectacularity of God of War. Itakagi, however, is gone, leaving millions of fans, recently also on Sony platforms, waiting to know which path Team Ninja would take with this Ninja Gaiden 3. A long, winding road (definitely), full of characters unlikely, leaps into the void and disappointment, unfortunately. Let's make the revolution In Ninja Gaiden 3, as mentioned, there is a bit of everything. The pretext for putting it there is the story of a strange secret association that seems intent on putting the whole world into turmoil with a series of attacks, starting from London, passing through the Arabian desert and tropical islets. A bit like the templars of Assassin's Creed, the Alchemists of Team Ninja (whose highest hierarchies recall Ezio Auditore even in their clothes) have been hiding for centuries from the eyes of the world, waiting to launch a tremendous attack, which also passes for our Ryu, the dragon blood of the Hayabusa dynasty and his sword, who is at the center of a very complex machination and which is solved after about ten hours of play (at a normal level), without however can never understand how such a convoluted story could be invented. The plot in Ninja Gaiden had certainly never been brilliant, but at least it served to give a coherent context to an unparalleled type of action that has radically changed here. The clashes in the levels, which always oscillated between medieval and modern Japan, with demonic drifts waiting around every corner, here are interspersed continuous jumps from helicopters and skyscrapers, final moves with quick time events to close them and some gigantic boss who tries to mimic the choreography of God of War and the clashes with the titans, without succeeding, however. Because the engine, always the same, was born to do other things and because years of study and a lot of inspiration are needed to get to Kratos' levels, something that seems to be missing here from start to finish. There doesn't seem to be a guideline and it seems to be, at times, faced with a gigantic fan service (with recycled characters and settings from the Ninja Gaiden universe) which however forgets that fans of the series have been waiting for this chapter for the game mechanics , rather than for the side dish, for the ~spectacular~ monsters that we don't believe can understand the intrusion into the saga of virtual reality, genetic alterations, quotes from Metal Gear Solid and even from the stars and stripes comics with continuous contradictions and points blind in history. In the end, those who have never played a Ninja Gaiden before and are looking for an action made with some care in animations are more likely to be able to enjoy it. Celestial mechanics What will never change about Ninja Gaiden, or at least hasn't changed in this chapter either, is the beauty of the animations, which remain fluid, continuous, bloody and which at times manage to unload an atavistic anger that is uprooted from the soul after a day of study or tremendous work of those who play. A demonic catharsis which, however, relied on an old-school difficulty and which asked the player to learn moves, counters and parries like in a Virtua Fighter, almost. Dozens of pads have been shattered due to the fault of Team Ninja who, perhaps feeling guilty and more likely chasing more conspicuous sales, decides to take a completely different path. Through the eight days in which the plot unfolds, you almost always pass unscathed (except in a couple of clashes) and this is also because it was decided to radically break down the hostility of the code, even at the most difficult level. In Ninja Gaiden 2 it was necessary to sip the items bought at the Muramasa shop (disappeared except for a brief cameo) to regain energy or be reborn, the explosive arrows for the bow and it was necessary to carefully decide the weapon to use against each enemy and in each setting. In Ninja Gaiden 3 the arrows of the bow are infinite, at a certain point in the plot they become even explosive without anyone knowing why; of weapons there is only one, the Katana, and there is no evolution of the character; the dismemberments of thelimbs and our hero's health is automatically recharged after each successfully passed wave. It also recharges with every save, a falcon that appears at regular intervals during the stages and, above all, fills up after unleashing a Ninpo. In Ninja Gaiden 3 there are two types of blows (strong and fast), a parry that also serves to slip behind the enemies, the shurikens and the already mentioned bow which in the second episode had serious aiming problems, while here it becomes an infallible instrument of death that you just need to draw to see it fixed on the closest enemy with an auto target and lock system that doesn't let go of the target even under torture. A kind of smart bomb with infinite ammo. The aforementioned Ninpo charges up after a number of kills and allows Ryu to launch an energy dragon that overwhelms all on-screen enemies and, needless to say, restores him to full health. Among other things, every few enemies, the right arm begins to throb with blood and, holding down the strong blow, Ryu is able to perform a series of sequential blows that slice the enemies at any distance, both with kills and they serve to make his arm pulsate again. Do you want to give it a try? Place the pad behind your back and try pressing the two pad buttons alternately without touching the analog sticks. We are sure that you will be able to go through more than a few fights without dying. Even if the difficulty increases, even if the problems grow and you finally need to pay attention to how you behave, the rules of the game do not change and, if this in itself is not a problem, it makes you understand how we have definitely changed course, without but find a free port in which to dock. Ninja Gaiden 3 is still a fun experience but, as mentioned, we would recommend it to a novice rather than an expert. Mind you, even the second chapter, in the opinion of the writer, had found itself a bit stuck between the desire to remain faithful to a choice of extreme difficulty and the need to meet those players who had a social life, far from the console, but a balance remained that was able to satisfy multiple types of player, while here we risk not satisfying anyone. Playstation 3 trophies The road to platinum is long, one might say. Once the campaign in single player mode was completed, we found ourselves with about 30% of unlocked trophies, all bronze and two silver. You have to play a lot, at a higher level of difficulty also and, above all, online. In short, it takes quite a bit of dedication for the full loot. Sword dance Having overcome the impact with playability and getting carried away with the decisive changes, a very fluid engine remains, nailed to 60 frames per second and which, it is always worth repeating, stages choreographies that few other games can afford. There are also spectacular moments with huge bosses who also have various attack patterns that must be studied to be overcome, broken as they are by quick time event sequences which, however, do not leave a huge mark. Fast and adrenaline-pumping, Ninja Gaiden 3 is however affected by the weight of the years and by that technology, which makes the first wave of games of this generation of consoles a bit, for which a single shader serves to make the reflection of light on any material, so that the skin of the ninja suit and the rocks of a tropical forest look a little too similar. At a certain point in the game, without wanting to reveal too much about what is happening, we return to one of the settings of the second chapter and realize how little has changed over the years. The changes all have to do with gameplay which remains unique in its own way, but which you need to carefully evaluate before buying, because it's a lot to get burned unless you're looking for a series of choreographed fights in which to find quick and sadistic satisfactions. There's also a multiplayer mode that pits two teams of four ninjas against each other, who you have to slice and even betray, and there are challenges you can do online to earn points and change the look of your Ninja, even in co-op. To evaluate the success on the net, given that, among other things, it is necessary to purchase an online pass to play ...", "date": "2012-03-27", "grade": "6.0"}