{"name": "Wylde Flowers", "ref": "https://multiplayer.it/recensioni/wylde-flowers-recensione.html", "text": "Wylde Flowers' review takes us to the island of Armnia, a remote but lively and colorful place where the young Tara goes to help her grandmother manage the family farm together. For the protagonist it is a new beginning after the disappointments of the big city, but something more is hidden behind the appearance of a quiet and monotonous place. To discover the secrets of Armnia and its inhabitants we will have to explore the scenarios far and wide wide and at different times of the day, try our hand at daily activities, interact with various characters, collect objects and create tasty recipes, but also find within ourselves that pinch of magic capable of changing things. Gameplay Wylde Flowers, Tara and her grandmother The Wylde Flowers experience starts very gradually: we witness the arrival of Tara on the island of Armnia and we immediately become familiar with the scenario map, which we will often recall given the great abundance of backtracking that characterizes the game: fortunately distances are never so large as to make this aspect an insurmountable problem. Once we get to our grandmother's house, we will immediately learn some rudiments of how to run a farm, cultivating the first thing that comes our way (potatoes, in this case) and kicking off a series of actions to be performed on a daily basis, such as watering the plants. The rest will be taught to us gradually, also thanks to an ever-present system of objectives to guide us through the various tasks. The control system is very simple and precise, traditional in style: an adjustable virtual stick on the left side of the screen allows you to move Tara, while on the right side buttons appear from time to time contextual to the action we can perform. Interact with another character? Collect an item? Make a purchase? Kicking off a special activity, such as a fishing trip? This and more. In short, the mechanics of Wylde Flowers are very simple and far from distant from many other products of the genre, although on the Apple Arcade platform this trend is not in fact well represented. To give the game a touch of freshness is its plot, which as suggested at the beginning includes supernatural elements, specifically magic and the ability to create potions and spells, or even to take the form of an animal. Wylde Flowers, Tara waters the plants The gameplay is immediately simple and immediate, although not trivial in some situations. In fact, the clock that we will always be able to see on the screen regulates not only the alternation of day and night, but also the activities that we will be able to carry out at one time or another, the shops open at certain times and a small survival component, if that's what we want to call her. In fact, Tara needs to eat and rest, as is normal: an element that is represented in the game through a single energy indicator, which we can restore by eating and/or sleeping. This and other aspects, for example the coins, suggest a structure originally designed for the free-to-play format and then adapted to the premium canons of Apple Arcade, but without jolts. Graphics and sound Wylde Flowers, Tara talks to the fisherman at his banquet Despite its absolute generality, given the similar design to many other productions of the genre, the graphics of Wylde Flowers are appreciated thanks to the vivacity of the colors and the solidity of some scenographic solutions, although in terms of animations the game appears decidedly ~old school ~. The interface, in any case, is always clearly legible and not confusing, which represents an undoubted advantage. As for the sound, however, many dialogues are dubbed in English and interpreted discreetly, with Italian subtitles for maximum clarity. possible understanding. However, the sound design appears very poor and essential, again the result of a decidedly dated conception.", "date": "2022-02-27", "grade": "7.0"}