{"name": "Testa di zucchina", "ref": "https://multiplayer.it/recensioni/100791-rayman-3-hd-testa-di-zucchina.html", "text": "Following the prevailing trend in the current video game market, even the Rayman series is ready for the appointment with a remake, specifically with a special high definition version of the original third chapter released in the now distant 2003 on last year's consoles generation, embellished this time with 720p graphics and sixty frames per second, as well as a fair number of unpublished minigames accompanying the single player campaign. For those who don't know it, Rayman 3 HD is an action with explorative and platform elements in a 3D world, characterized by a story full of hilarity and gameplay spiced up with sometimes crazy situations. The story features Rayman, a cute little being without upper and lower limbs (he only has a head, feet and hands) and with a face similar to that of a zucchini, committed to saving the Crossroads of Dreams from the menace of the hooded black Lums, and the his friend Globox from terrible indigestion. In fact, he mistakenly swallowed Andr, the head of the villains during the turmoil following a raid on the Fairy Council carried out by the same boss and his henchmen with the intention of capturing the Heart of the World. Rayman therefore has nothing left but to find a specialized doctor who can give relief to his friend, and to do so he will have to go through numerous levels full of colored gems and bonuses to collect to accumulate more points or to obtain special power-ups, but also bristling with obstacles to overcome with acrobatic jumps, flutters through the rotation of his tuft like helicopter blades, swims and acrobatics aboard vehicles. Adventure and platforms Certainly a fundamental fact of the game system is the interactivity between the environment and our hero with gloves. In fact, most of the operations and evolutions combine with his surroundings, to allow him to use platforms, objects and other scenic elements on his way towards the end of the level. However, it is true that the degree of complexity of the interaction is low. A glance of a trained mind will quickly understand what needs to be moved or hit, or which path to take. Still on the subject of interactivity and exploration, Rayman can then count on the help of Globox, interacting with which the protagonist not only gives life to some gags, but can obtain benefits for reaching certain areas that would otherwise be inaccessible. For example, both the protagonist's placid friend and Andr appreciate prune juice, so the former has to drink large doses of it to calm the Lums' boss in his stomach. The result is that Globox burps quite often generating purple colored bubbles which can then be used by Rayman to reach points that are difficult to approach by normal means, to the point where it sometimes inflates and floats in the air. Which can also prove useful when perhaps the friend with the zucchini head is busy on the screen throwing punches against the hordes of the aforementioned black Lums, capable of transforming themselves into anthropomorphic creatures called Hoodlums. Speaking of enemies, there is obviously no shortage of the ubiquitous bosses to create a few more headaches for the user, given that to defeat them it is necessary to prepare an ever-changing strategy and consequently use always different techniques. The peculiarity of these creatures is that contrary to other similar titles in Rayman 3 HD they are not located only at the end of the area but are distributed in various points of the scenarios, therefore more than one can cross both in the middle and in the middle of a level. Playstation 3 trophies Rayman 3 HD offers twelve objectives to unlock: they are distributed in the single player mode and are obtained simply with the progression of the game by completing the various chapters, eliminating particular enemies, or by collecting all the superpowers, obtaining the true ending or by unlocking all the games arcade. Happy restyling As you progress in the game, a series of new challenges are unlocked by reaching a certain threshold of points at the end of each area, obtainable for each object collected and each enemy killed. These new contents implemented by the developers specifically for this remake are not very original and range from two-dimensional platform game to first person shooter, but without a doubt offer a variety of challenges that are a nice addition to the main adventure. Finally, there is also an option for online which in reality is limited to granting access to rankings through which to compare your score with that of friends or other users. And before concluding let's take a look at the technical part of the product. As always happens when dealing with productsi adapted for the new consoles that support high definition graphics are the element that is most subjected to the interventions of the developers. Rayman 3 HD is therefore no different, and as mentioned at the beginning of our review, the visual aspect of the game has undergone some tweaks to make it compatible with televisions that support high definition. Following all this, the cartoonish graphics with lively and imaginative colors that distinguish the numerous levels, excellently designed and sufficiently varied among other things, appear overall more beautiful to look at than ever, even if on the other hand, as often happens in remakes, a more careful analysis does not escape the little complex and flat textures. The audio sector is globally satisfactory, thanks to a soundtrack that boasts a certain variety in the tracks, which almost always appear appropriate to the different types of setting, to the rather spot-on effects in play and to the adaptation of the texts and dubbing, worthy of having best transposed the comic spirit of the game without spoiling the numerous jokes, puns and double meanings scattered in the dialogues. All embellished by a restyling that has significantly improved its quality.", "date": "2012-03-22", "grade": "7.5"}