{"name": "Vendetta dal passato", "ref": "https://multiplayer.it/recensioni/100683-mass-effect-3-from-ashes-vendetta-dal-passato.html", "text": "Additional content, downloadable content or more simply DLC are always viewed with a certain suspicion by the community of players. The intent to enrich the original product or lengthen its longevity too often becomes an opportunity for mere profit. In the case of the last chapter of the BioWare trilogy we are in a very borderline situation: published even on the same day of its release, this From Ashes/From the Ashes DLC adds a new mission, an unpublished character, additional clothes for all the others and the infamous Prothean assault rifle. The problem is represented by the suspicious timing of the release, which sparked the inevitable controversy. The programmers made numerous statements to justify this expansion, assuring that the material was made after the game was closed. Regardless of the veracity of these statements, the doubts orbit around the possible goodness of the material in question, and whether it justifies the expense of 800 Microsoft Points (about 10 Euros) necessary for the purchase. Return to Eden Prime As mentioned, Dalle Ceneri is a pack of about 700 MB, which instantly adds a priority mission on Eden Prime to the diary. That's right, it's the planet looted by the geth in the first chapter of the trilogy. Commander Shepard and his companions are sent with the Normandy to investigate the usual despicable operations of Cerberus, but the discovery this tour is really big, it is a cryogenic capsule containing a soldier of the ancient Prothean race: the brave Javik. Following a series of functional flashbacks to the story and the inevitable clashes with the Cerberus soldiers, our captain manages to get the alien into his crew, not before a long clarifying discussion. That's it, Dalle Ceneri ends in just over half an hour, a truly miserable duration that aligns this DLC with any of the additional missions present in the main game, and unfortunately not even among the best. Despite the beauty of Eden Prime, the proposed situation is the most canonical imaginable, with a slight research phase culminating in growing waves of enemy soldiers. BioWare tries the nostalgia card by recovering some music from the original game and trying to bring back the flavors experienced in 2007, but the level design is completely uninspired and the events follow one another listlessly. So one wonders why a player has to face an additional outlay to grab this expansion. The answer lies precisely in the addition of Javik, an angular but charismatic character, usable in the campaign and endowed with considerable combat skills. But that's not all. Xbox 360 goals Dalle Ceneri introduces two new objectives for a total of 50 player points, which obviously add up to those conquered in the base game. To get them, simply acquire all the Prothean information present on Eden Prime and complete the mission. As already written, an operation that will take you just over thirty minutes. Old chicken makes good soup The dialogue with the Prothean, rich and interactive, provides a series of details much more revealing than it was legitimate to think. In this regard, we must make a warning to those who intend to purchase, as the information provided by Javik is rather bold, representing real spoilers for the main plot. Mind you, it's nothing particularly shocking, but the decision to add such delicate narrative parts leads to a curious contradiction: Dalle Ceneri is a content that would be better used in the first game to take advantage of the character, while the narrative content is more enjoyable for those who he already knows the story and wants to delve into some of its details. In addition to this, the game database adds exquisitely accessory material, such as a new set of armor for all Shepard's companions, selectable in the briefing screen before each mission, and the effective Prothean assault rifle, superior to other weapons available (upgrades excluded). Ultimately Dalle Ceneri is a DLC that hardly manages to cover the lucrative intentions. The paucity of the proposed contents and the extreme brevity reinforce the sensation of material deliberately cut from the base game. The anger is double thinking about the quality of the additional character (the real flagship) as well as the many delicate narrative information provided, which certainly does not complete but enriches the plot of Mass Effect 3, even going back to the final debate. While it is true that the Collector's Editions already contain the codece to download this expansion for free, for all the others it is a scarcely justifiable expense, unless you are passionate beyond measure of the BioWare saga.", "date": "2012-03-19", "grade": null}