{"name": "Katana contro gatling gun", "ref": "https://multiplayer.it/recensioni/100532-shogun-2-total-war-il-tramonto-del-samurai-katana-contro-gatling-gun.html", "text": "Exactly one year after the release of Shogun 2: Total War, Creative Assembly calls us back to arms with a stand-alone expansion (that is, playable even without owning the original title) which offers a completely new single-player campaign, telling us about a crucial period of the Japanese history. Although it starts from an already very complete product and is ~only~ an additional package, Shogun 2: Sunset of the Samurai also manages to offer some interesting innovations to the tested structure of the original, taking its cue from the epochal encounter / clash between the West and which marked the beginning of the modern era for Japan at the time. The end of traditional values We are in the second half of the 19th century, Japan is upset by the so-called Bonshin war, a civil conflict that divides the rulers (and the population) between those who support the power of the Shogunate, interested in exchanging with newcomers from the West, and the faithful to the Emperor, the only character still able to maintain the peace and restore the ancient values. The player will thus assume a crucial role within this conflict, choosing between the two factions to lead one of the six new clans (Aizu, Nagaoka and Jozai for the Shogunate and Choshu, Satsuma and Tosa for the imperialists). The game system reflects what has already been seen in the original title, so from the initial menu it will be possible to decide to start a campaign, consult the tutorial section, try the historical battles or jump into the online mode. We point out how the original Shogun 2 has been fully integrated and the related contents will also be directly accessible from this expansion. Deciding which of the clans to command will be the first important step to take, given that it will influence the progress of the campaign starting from the level of difficulty, the resources available and above all the faction with which you will find yourself deployed. In fact, the player is free to decide whether to remain faithful to traditional values or to completely embrace the new that advances and concentrate on research. This regardless (or almost) whether we are imperialists rather than in favor of the shogunate, and in both cases we will find ourselves with advantages and disadvantages. In fact, if owning new modern devilries will provide an advantage on the battlefield, on the other hand the population will be more inclined to hinder us in managing the territory, fueling outbreaks of revolt. The title therefore remains rather open to choices, even if for obvious reasons, embracing the cause of modernity remains the easiest way. On the campaign map, thanks to the new evolution menu, you will be able to find the right balance, spending precious resources to provide your army with a new cannon and at the same time to develop port facilities and aim for the domination of trade. Few changes have been made in the turn-based section: apart from some aesthetic refinements (such as the map that now appears as printed rather than hand-drawn) the most evident is represented by the duration of the seasons, which will now be equivalent to six turns. A necessary time dilation given the short duration of the historical period chosen. A katana versus a gatling gun The map of the countryside is the first mirror of the new era, dashed with the steam that will slowly obscure the horizon, the music that will abandon the typical sounds of the Rising Sun in favor of more western harmonies and the trains that will slowly populate the territory, shortening the distances . Not just an aesthetic frill, steam locomotives allow you to speed up the overland movement of troops and agents. Once again, however, attention must be paid to popular uprisings, which certainly will not appreciate the spread of this technological devil. However, it was by going onto the battlefield that we definitively perceived the transition to the new era. If initially the units still fight using katanas, spears and bows, we soon joined our warriors with squads of riflemen, horse soldiers equipped with firearms to finally arrive at the construction of heavy weapons, such as cannons and gatling guns. Get ready for epic war scenes, with dozens of samurai who will launch themselves armed with courage and sword against cold and lethal machines, capable of spitting more than four hundred bullets per minute against the enemy. Creative Assembly has gone even further, allowing you to directly take control of the fixed workstations; pressing H the view will narrow to position itself behind the soldier assigned to the machine, allowing you to move the crosshair directly with the mouse. If at the time of the announcement some strategic stock purists had turned up their nosesfor this feature, when tested, it turned out to be nothing more than a small diversion, which has little effect on the delicate tactical balance (since in these situations, for example, we will not be able to control the rest of the troops) but simply gives a cruder view of the war, for an even more effective identification. These instruments of death therefore reintroduce the field of fire of Empire and Napoleon, even if revised in Shogun 2: The Sunset of the Samurai with heavy differences between the various units. These can count as many as 39 new entries, some also coming from Western forces chosen from the lines of the French, British or US marines. The new weapons have also brought with them changes in the siege phases, given that, for example, with cannons it will be possible to knock down defensive structures. Defenders will be able to take advantage of the new special towers for archers, arquebuses and machine guns, guaranteeing a boost in capabilities. Naval battles However, the naval forces have benefited most from the change of setting, which see the wooden vessels of Shogun 2 replaced with battleships moved by powerful steam engines. First of all, these are faster in movement, guaranteeing more dynamic maneuvers and favoring the rhythm of the action. Also in this case it is possible to take advantage of a close-up view to take direct control of firearms. Secondly, ships have now also earned a fundamental role in land battles, if they take place near the coast, and directly on the campaign map. In Shogun 2: The Sunset of the Samurai, in fact, it is finally possible to use your ships even in a traditional battle, to provide support by launching some cannon shots, with two options between targeted and wide-range shooting. The large shells fired do not enjoy great accuracy, but allow you to rout enemy forces by lowering their morale to the point of terrorizing them. In the campaign map, then, we greatly appreciated the possibilities introduced, which now allow you to weaken the defenses of a city, make some victims among the units of a deployed army or assault a port by exploiting your naval strength. In these cases a new type of battle takes over, which will require the invaders to overcome the defenses to enter the port with their fleet. The list of the most important innovations ends with the introduction of three new agents: the Ishen-Shishi are imperial activists, opposed to the power of the Shogun. They can use their powers of persuasion to bring enemy armies to the side of the empire, they can uncover hidden opposing forces, or even spark a revolt in a province. Foreign Veterans can instead be enlisted to supervise the recruitment of new recruits, in order to bring their knowledge into the war field. In fact, placing them in one of your settlements lowers the outlay necessary to replenish the army, but they are also able to distract opposing units and challenge other generals to a duel. Finally we have the Shinsengumi, members of the secret police loyal to the shogunate. Each of these has its own skill tree as usual, with two distinct parallel specializations. Furthermore, both the Geisha and the Ninja have undergone some adjustments to their skills. Historical Battles and Multiplayer 2.0 Apart from the new campaign, faithful to the original gameplay but widely enriched in content, The Sunset of the Samurai offers six new historical battles that offer glimpses of this troubled end of the century as interesting to discover as they are intriguing to play. The additions to the multiplayer component are juicier, which apart from the return of the drop-in function, which allows a player to take over the single-player game at any time to take the place of the CPU, is enriched with new content. We will find a new Conquest map, obviously set in the 19th century, while the new avatar of Samurai Sunset offers more than 40 minions, 30 pieces of armor and a renewed skill menu, always linked to the historical period of this expansion. Always more beautiful From a technical point of view, being Shogun 2: The Sunset of the Samurai a simple expansion, the improvements are only marginal, but still sensitive. The graphics engine is the same, including support for DirectX 11, therefore exceptional, certainly among the best ever. The aesthetic impact is as amazing as and more than before, with myriads of units on screen (increased in number for the occasion), not at all intimidated by the close-up visuals which instead highlight the great attention to detail to which Creative has become accustomed. assembly.The unpublished units have enjoyed the same treatment, while there is a general refinement, the introduction of some additional animation and other details inserted to further embellish the already excellent technical sector. Good optimization, graced by a remarkable scalability of the engine that allowed us to enjoy the experience at medium details even on a laptop equipped with a 2.3 GHz Intel i5 processor, 4 GB of RAM and Intel HD 3000 video card. configuration instead used for the review mounts an AMD Phenom X3, 4 GB of RAM and ATI HD5770 video card and allowed you to play quietly at Ultra details, sacrificing only slightly the definition of the shadows, with MLAA and SSAO activated, remaining quietly between 25 and 30 frames per second at a resolution of 1680x1050. The loadings remain quite long, especially the initial one, even if there seemed to be slightly improved in the passages between the campaign map and the battles. The sound accompaniment is excellent as always, embellished with new melodies that underline the transition to the modern era.", "date": "2012-03-16", "grade": "8.8"}