{"name": "I Cavalieri dello Zodiaco - Il Santuario", "ref": "https://multiplayer.it/recensioni/i-cavalieri-dello-zodiaco-il-santuario.html", "text": "Saint Seiya is one of those series that fits perfectly into the fighting game spirit, just like Dragon Ball. So the inaction of the relative videogame transposition, so far, is at least unusual: manga and anime have enjoyed great success both in Japan and abroad. Maybe Bandai was waiting for the technology to be mature enough to put gold armor glitters in the package? We will only find out by living. In the meantime, let's see what this all-new tie-in has in store for us The game modes As the subtitle suggests, Knights of the Zodiac  The Sanctuary brings the clashes of the Knights of Athena on Greek territory to PlayStation 2, when the group made up of Pegasus, Sirius, Crystal and Andromeda (which will obviously be joined by the solitary Phoenix) decides to attack the Great Priest directly and finds himself, out of urgent necessity, having to cross the twelve houses of the Gold Knights in a desperate search for something that can extract from Lady Isabel's chest the cursed arrow shot by one of the minions of Arles. The story mode, entitled precisely ~The Twelve Houses~, will therefore see you engaged in an accurate reconstruction of what happens in the anime: the Bronze Knights face the houses and their guardians one at a time, sacrificing themselves in turn to overcome enemies with much higher than theirs. We will not have the possibility to choose a particular character among the five of the squad, but we will take turns in command of Pegasus, Crystal, etc. depending on how the story evolves, up to the clash with the very powerful Arles. As the stages are passed, it is possible to notice the presence of ~crossroads~ that show us unpublished events, designed specifically for the game (the clash between Mur and Cancer, or the madness of Phoenix, etc.). It is now a fact that the quality level of Bandai products has risen considerably in recent years, and the contribution of Namco developers can only produce further benefits in the near future. The game modes Finishing ~The Twelve Houses~ in the normal way and taking the alternative paths will allow us to access the ~High Priest~ mode, which on balance represents much more than an extra in the game economy. In this mode, in fact, we will find ourselves on the other side of the barricade, in the guise of Arles, and we will have to block the advance of the Bronze Knights by placing a Knight of our choice (among the Gold, Silver and even the of Bronze) in each house. The difficulty, in this case, is much higher than in the story mode and the RPG elements are more than one: our Great Priest gains experience points with each fight (won or lost), to level up and get stronger. In fact, each new level also corresponds to the arrival of a new ~divine power~, which can be used before battles to influence the outcome: restore our Knight's energy, send a certain number of simple soldiers to wound the opponent before the clash, modify the force of gravity inside the house to our advantage, and so on. [C] Each trick produces a different animated sequence. Facing the Knight of Virgo is not a challenge. an easy feat not even for Phoenix... Also in the video game, the Knight of Gemini is the same. the most dark and mysterious. [/C] Burn, cosmos, burn! The game is very similar to Dragon Ball Z Bodokai on a philosophical level, therefore the clashes are decided above all on the basis of quick reflexes and a pinch of strategy. The Knights have various offensive and defensive maneuvers, but the highlight is naturally represented by the special moves, which can be performed once the appropriate bar located at the bottom of the screen is filled. There are three levels of power, and each one has its own special move. In the case of Pegasus, at the first level we will throw the ~Pegasus Thunderbolt~, at the second level the ~Pegasus Spiral~ and at the third level the ~Pegasus Meteor~. As in Budokai, it is possible to reverse the effect of these moves by acting with timing and then pressing all the joypad keys like madmen. It is also possible to expend all spirit energy to produce a kind of shock wave that knocks a nearby enemy away. Although the clashes are direct, it is possible to divide them into ~rounds~ given the possibility of coming back to life the first few times that one's energy bar runs out: the character is called loudly by his ~spirit guide~ (who Knights of Bronze is Lady Isabel, while for the Knights of Gold and the Great Priest) and you have to press the buttons of the Dual Shock 2 very quickly to get back on your feet and regain some energy.The strategic elements and precision reach exaggerated levels in the Great Priest mode: the Bronze Saints you will face are endowed with exceptional strength, therefore you will have to defeat them using reflexes and cunning, completely banning special moves (they would come back in 90% of cases ). [C] Depending on the outcome of the clashes, it's time to go. It is possible to face ~scrolling~ bonus stages between one house and another. Acting with due timing, it is possible to You can block a special move and turn it back on your opponent. In the European version of the game, the introduction is missing, which perfectly recreated the original theme song of the anime. Who knows? why. [/C] Mom, I want to become a priest! The High Priest mode, which can be unlocked once the story mode is finished by taking the normal and alternative paths, incorporates various elements borrowed from the world of role-playing games. Our priest, in fact, levels up thanks to the experience points earned in the fights and therefore becomes stronger, which is absolutely necessary given the difficulty of the fights: you will have to go through the whole process again at least three times before being able to defeat the five Knights of Bronze, given their strength. Placing the Knights inside the houses also requires a pinch of strategy and knowledge of the animated series, as the mix between character and house allows you to obtain or not various upgrades (for resistance, for attack, for energy, etc. etc.). Technical realization It is now a fact that the quality level of Bandai products has risen considerably in recent years, and the contribution of Namco developers can only produce further benefits in the near future. The Knights of the Zodiac - The Sanctuary, in this case, has a very valid graphic design: the cartoon characters are reproduced in great detail, the Golden Knights have never been so splendid and the houses themselves show an excellent level of detail, together with a series of light effects and great interactivity (the columns collapse under the fury of the clashes). The particular nature of the game, which tends to take on the features of a real cartoon where the plot requires it, only enhances its aesthetic quality. If we then think that ALL the special moves of ALL the Knights present are present (and there are many), and that they have been reproduced graphically in an absolutely faithful way, there is reason to reflect on the commitment made by Bandai. If we really want to find a limit to all this, we have to look critically at the animation capabilities of the PS2 textures (in this case in relation to the faces of the Knights), of which, however, the developers are not to blame. In short, on a technical level the goal has been fully achieved: it would have been difficult to do better for a game of the Knights of the Zodiac. And the speech can be extended to the sound sector: despite some ~cuts~ mysteriously made by Bandai for the European version of the product, the level is quite high, certainly above average: the Japanese voices create a certain atmosphere (those in French disintegrate it , so be careful to enter the audio options immediately) and the effects perfectly reproduce what was seen in the animated series, while the excellent music manages to perfectly underline the various stages of the story. ~Pegasus Fantasy~ will also be missing, but there really is nothing else to complain about. [C] It's It is possible to use a ~light~ version of the special moves without resorting to a sequence. The shots are represented in a truly spectacular way. The Golden Knights have never been so exciting. beautiful to see. Even Aldebaran... [/C] Comment The Knights of the Zodiac  The Sanctuary represents an excellent compromise between aesthetic needs (the numerous interlude sequences, the graphics in general) and games, with a game system very similar to that of Dragon Ball Z Budokai. It is not possible to compare this title to a ~pure fighting game~ like Tekken or Soul Calibur, of course, but in the ~alternative reality~ of the tie-ins taken from the animated series Knights of the Zodiac - The Sanctuary manages to carve out an important space. Fans of the cartoon will literally adore it, also for the ~for collectors~ section where it is possible to view photos of the toys and cards, or the technical data sheets of all the characters. The final grade, therefore, should be interpreted accordingly. Pros: Good graphics Excellent sound commentary Excellent Italian translation Cons: too bad there is no dubbing in our language Some inaccuracies in the collisions Notvery long lived The warrior spirit within me roars It is a must to make a clarification, given that many enthusiasts were disappointed by the Italian edition of the game. When, several years ago, the Saint Seiya anime was brought to Italy, it underwent a ~heavy~ adaptation: the names were almost all changed (generating at least ridiculous ~coincidences~: a knight who is named after his own constellation must at least aspire to armor by birthright), probably to make them more easily assimilated, and even the dialogues underwent changes that made them, er, more poetic and less violent. Ivo De Palma knows something about it. Who dealt with the Italian adaptation of Knights of the Zodiac - The Sanctuary (in all likelihood the excellent Emanuele ~Shin~ Scichilone), had to remain faithful to the most popular version of the anime (which in Italy also enjoyed a ~revised and corrected~ version, identical to the original), therefore it has left intact the names of Pegasus, Andromeda, Phoenix and so on. Bandai, unfortunately, has inexplicably ~filed~ some music from the series (above all the acronym ~Pegasus Fantasy~) and dubbed the game in French but not in Italian. It is true that a dubbing in Italian, perhaps with the original voices (very complicated to make, I think) and all the music in its place would have represented the apotheosis for the most ardent fans of the cartoon. It is equally true, however, that the game essentially loses nothing due to these shortcomings, at least in the eye of the ~average~ enthusiast, and that the quality level of the music remains high in any case. Finally, the presence of the voices in Japanese together with the subtitles in Italian makes the product perfectly enjoyable for everyone.", "date": "2005-07-27", "grade": null}