{"name": "La guerra in tasca", "ref": "https://multiplayer.it/recensioni/100142-unit-13-la-guerra-in-tasca.html", "text": "For fans of military-themed shooters and action games, Zipper Interactive is certainly not a new name: the Redmond software house in fact gave birth to the famous SOCOM brand back in 2002, four years before being acquired by Sony itself. Among his most recent successes stands out the shooter MAG, which went down in history for its titanic battles between hundreds of players. It was therefore practically obvious that such a famous internal Sony label was working on the new laptop in the genre that most belongs to it. The real structure of this Unit 13 is a little less predictable: setting aside the competitive multiplayer and a real story to link the campaign missions, the new Zipper Interactive game is configured as a small experience that can hold some surprises. You're military for me... Special Unit 13 is made up of six highly qualified soldiers in various sectors: Animal is the handyman soldier, Chuckles is the computer scientist, Python is the gunner, Ringo is the expert in tactical infiltration, Alabama is the inevitable sniper while Veteran Zeus is the perfect fighter for close quarters. Each character, characterized by a specific role and a precise background, offers the player a different way of tackling the approximately forty missions that make up the backbone of Unit 13. Clearly, each choice will involve both advantages and disadvantages and some missions require a particular approach that makes them easier in the role of the right agent and necessarily more complex in those of an agent less suitable for that specific assignment. Some stages, in fact, will require an extremely tactical and stealthy approach while others will impose a time limit and therefore also a more sustained pace of action; in some cases we will be assigned multiple tasks within the same mission and some we will have to complete them in conditions of clear disadvantage, for example without automatic health regeneration. Which is easier said than done, actually, as the artificial intelligence often seems to behave irrationally, totally neutralizing strategies and diversions that we have used successfully since the previous game. Enemies sometimes act in a bizarre way, ignoring obvious slips by the player and then noticing his presence in the most improbable moments or moving from one point to another on the map without any logic. Beyond these flaws, Unit 13 actually offers a considerable variety of situations, multiplied by the strategies related to the different characters available. There is no story to unite the various stages, which basically lend themselves to ~hit and run~ games, providing the player with all the information necessary to choose the most suitable mission at the moment. The purely arcade nature of the title is underlined by the scores that are assigned for each action, fight or strategy, complete with multipliers and final evaluation: the characters will thus increase in level, acquiring new weapons and skills, and the player will be able to compare his score with those of friends and players from all over the world. PSVita trophies It is possible to obtain 24 Bronze, 17 Silver, 2 Gold and 1 Platinum Trophies in a fairly intuitive way, for example by completing the missions offered by each mode, reaching the maximum level with the various characters or eliminating certain enemies. Missions upon missions For each mission of the basic mode completed satisfactorily enough, it is possible to unlock the ~dynamic~ variant: this option substantially alters the default parameters of the stage, guaranteeing a slightly different experience in each game. All missions can be tackled with the help of a second player: as mentioned at the beginning, Unit 13 does not offer any type of competitive multiplayer mode but a simple co-op capable of doubling the fun but also the frustration, in the light of the problems related to level-design and artificial intelligence already exposed. For those who prefer to play alone, there are two other very demanding modes that will require precision and training. The daily challenge looks a bit like the daily tournament in Everybody's Golf: the player has one attempt a day to tackle a given mission and get the best possible score, which is immediately forwarded to a global leaderboard. In Primary Objectives, however, you will have to face a series of stages that are more difficult than usual with the aim of eliminating a specific target each time: these missions, which are unlocked based on our performance in the ~campaign~, recycle situations andenvironments already played in previous stages and however interesting they end up further highlighting the main defect of the game and that is a remarkable repetitiveness. The problem does not lie only in a gameplay that seems to particularly favor a fragmentary ~attempt~ progression, many of which are only necessary to develop the most suitable strategy for the current stage, but in the initial variety of situations that is consumed in the round of a few hours, repeatedly proposing very similar challenges and contexts. Fortunately, Unit 13 plays wonderfully: the right analog stick of the handheld proves to be more appropriate than ever and the touch-screen is used intelligently and not at all invasive. Technically we are not dealing with another Uncharted: The Golden Abyss, but Unit 13 still defends itself quite well, sinning precisely on the aforementioned repetitiveness of settings and polygonal models. If anything, they leave the mediocre animations and the usual frame rate drops that occur in the most agitated situations baffled. Without infamy or praise, however, the sound accompaniment and the dubbing, even if we were pleasantly surprised by the quality and realism of the sound effects.", "date": "2012-03-13", "grade": "7.4"}