{"name": "GRID Legends", "ref": "https://multiplayer.it/recensioni/grid-legends-recensione.html", "text": "Tradition is a founding element of the majority of racing games on the market. Each iteration of a brand brings improvements, additions and corrections, which go to create the foundation of the next chapter. It is rare that a consolidated formula is revolutionized in the genre and the racing title development houses are either tied to the fate of a single bestselling series, or else they exploit assets and technical know-how to represent as many sub-genres in several games. Codemasters offers F1 every year, but from its quiver it has shot arrows like DiRT, GRID and experiments like OnRush. Of GRID, after the reboot of three years ago, we return to write today, for the release of the review of GRID Legends. GRID Legends is a direct evolution of its predecessor. The sensations given by the arcade driving system have the EGO Engine brand clearly visible on the bodywork and from the first km a very clear contact bridge is created with the series. However, GRID Legends is renewed on the content front with an unprecedented story mode, a totally reorganized career and a whole series of multiplayer renovations. These take place in the void that the IP left in the past for the choice of an all too free career mode, accompanied by little else in support. The audience wants the stories, the background, the emotions Taken from the story mode, in which we take the part of an emerging driver of the Seneca stable There is an indissoluble link between video games and fiction, but this does not necessarily apply to all genres, such as sports and racing games. The sense of progression in the growth from pilots must be there and it must be rewarding to emphasize the player's improvements, but it doesn't necessarily have to submit to the rules of a precise plot of a potential story mode. Electronic Arts wants to prove the opposite to us, and as in other brands, also in GRID it has ensured that there was one waiting for us. As modern sports journalism tells the ambitions of the drivers, their weaknesses and builds a film behind the mere numbers of a race, Codemasters with GRID Legends wants to immerse the player in a racing story made up of people, emotions, crimes and great companies. At the turn of 35 events we are called to bring the Seneca team back to the top, led by a dreamy team principal, against the difficulties that more or less honest rivals bring into play. The premises, already simple in themselves, are never made captivating by developments and characters: the former too linear and the latter particularly stereotyped. The storytelling technique according to the style of making a documentary shouldn't be thrown away and the realization is undoubtedly pleasing to the eye, but we still need fuel to light the fuse of interest. Having reached the end credits of this adventure, one has at least the awareness of having experienced an overture of the GRID Legends Career offer, the true content hub of the single player experience. The carreer In the GRID Legends career we will also face challenges aboard the Lotus EVija Unlike the story mode, the Career follows in the footsteps left by the brand's past to confirm itself as a large pool of competitions, ever more demanding and ever faster. The events are unlocked by owning cars of the required segment, grinding kilometers with them and completing the proposed events starting from the minor circuits up to ~The Gauntlet~. GRID Legends guarantees a considerable number of hours of gameplay in single player and the possibility of creating customized races down to the smallest detail, between a Career event and a step in the story mode, only increases it. There are many game modes available, ranging from elimination races to drift challenges, touching on every possible aspect of road and track racing, strictly in an arcade key. The continuous change of modes keeps the player's palate fresh without a GRID Legends binge becoming cloying after a handful of hours of play. Multiplayer Trucks are one of the vehicle categories in GRID Legends Against expectations, multiplayer proved to be the most pleasant surprise among the innovations introduced with this new chapter in the series. Matchmaking is streamlined by allowing players to enter a match by taking the parts of an AI-controlled vehicle, even while a race is in progress; game servers are cross-platform and all platforms share the same games. The AI takes its place on the starting grid so as to standardize the gaming experience regardless of the number of real players present in the game. These are noted not only for the nick, but also for an icon that indicates the platform they are using ifPC or consoles. The gaming experience lacks the typical long waiting times between search and departure and takes the form of a typical GRID race, seasoned as much as possible by real players, which undoubtedly make the challenge on the track more captivating. We don't go too far on the stability of fully loaded servers, but in this pre-release phase, despite the few players, we have found a solid and rapid system. Each mode enriches the player with credits and experience that can be invested in different aspects of the game, such as buying vehicles among the more than 120 present within the game, divided into 9 categories. The fleet offers models with the most diverse characteristics, ranging from the Volvo 850 Estate Touring Car to the Ferrari FXX-K Evo, passing through Lancia Stratos and Lancia HF integral. With the credits you can improve the statistics of the vehicles, as well as the characteristics of your team which represents a sort of embryonic management ecosystem, parallel to the races. A large investment of resources on the technical staff allows you to obtain better economic conditions for the prizes of the races, sponsors and discounts on the costs of the upgrades. Focusing on the co-driver, on the other hand, gives him the opportunity to train and improve his performance, as well as becoming increasingly skilled in avoiding accidents and mistakes. These are marginal details that do not revolutionize GRID Legends compared to its predecessor, but give more space in the series to some ideas that had only been sketched up until now. Artificial intelligence, between design choices and difficulty Every vehicle has its own driving dynamics, even super light open wheel vehicles The effort invested in the game engine in 2019 was to make artificial intelligence more and more human. One way was to develop the concept of nemesis in the form of a pilot's status who, after having suffered too many contacts, decides to send them straight back to the sender, embracing a more aggressive and unscrupulous driving style. Another is certainly the massive intervention of the random variable of the racing accident or the breakdown of the vehicle. Both elements return with arrogance in GRID Legends, to the point that the rate of appearance of these phenomena is really high, not only compared to other competing series, but also compared to what we would have expected to see. And this happens in the high positions of the classification as well as, in the story mode, also among the ~protagonist~ pilots. If on the one hand we consider the choice commendable because it gives character to the production, on the other the excessive frequency ruins some crucial moments of the race, as if there were a deus ex machina controlling the fate of the 22 cars in the race based on our victory. Too often we find ourselves in pursuit of a car and see the driver in front of us lose control of the vehicle and ~accidentally~ leave the road free. Co-pilot customization screen The work done in rendering the driving style of the drivers, however, struggles to emerge also due to a deficient calibration of the difficulty. Up to the extreme setting the game does not offer a really demanding level of challenge and in many competitions the AI generates a clear gap between the leader of the race and the car in second position, with the first lapping with good times and the second very slower. The difficulty for the player then fluctuates a lot depending on the type of circuit faced; where there are many corners, the AI times go up and on tracks with few braking points they go down, with the exception of the ovals. The already scarce challenge is thus totally lost when the goal is to finish in the first three, four or five positions. Unlocking events in GRID Legends is just a formal matter of time. The technique The interior of the passenger compartment does not abound in details but has enough to guarantee a good glance The driving sensations that the EGO Engine gives are immediately pleasant and characteristic. There is no interest in proposing a realistic experience like in a simulator; in GRID Legends we appreciate the arcade paste of the driving model that underlies all categories of vehicles, but which for each one knows how to give small variations to the theme. Rigid and light vehicles often suffer from oversteer, rigid and heavy ones from understeer, all off-road vehicles such as mini trucks instead make the distribution of weight from the rear of the vehicle to the front when braking decisive. The technical rendering is also captivating, light on the hardware but not little detailed for this. The 22 and more locations that are visited in GRID Legends are well painted by the game engine, which pushes on the chromatic contrasts created bycity lights or the lighting of a circuit at night. The car models are clean, not excessively detailed, especially in terms of interiors, but they are sufficient to develop a captivating and homogeneous glance.", "date": "2022-02-25", "grade": "7.0"}