{"name": "Il crossover definitivo", "ref": "https://multiplayer.it/recensioni/100188-street-fighter-x-tekken-il-crossover-definitivo.html", "text": "If fighting games are experiencing a new moment of glory, we undoubtedly owe it to Capcom, which thanks to Street Fighter IV has managed to bring this genre back into the limelight, and perhaps a little surprisingly, for too long. The Osaka house is undoubtedly the master of fighting games dedicated to the hardcore community but not only, and in particular with the sub-genre of the so-called versus, or crossover, it has given many hours of fun by uniting legions of fans belonging to different worlds, putting own Street Fighters against the Kings of the SNK house, throwing the characters designed by the Tatsunoko studio and even the Marvel heroes into the fray. However, the announcement of the meeting/clash with Harada marks a new record, giving way to an epochal challenge dreamed of by many fans. The time has come and in these days Street Fighter X Tekken will finally arrive on the shelves, a title that immediately became the subject of discussions due to some choices made by the eccentric Yoshinori Ono. The result is a fighting game created respecting the Capcom tradition, starting from the solid foundations of the last Street Fighter, and then heavily modifying it in various aspects, aiming for accessibility, without forgetting a big adaptation work that involved half of the roster coming from world of Tekken. Street Fighter TAG Tournament Leaving aside the description of the narrative pretext chosen by Capcom to provide an excuse for thirty-eight wrestlers to fill themselves with blows, let's immediately move on to talking about the various aspects that make up the gaming experience. Street Fighter X Tekken bases its gameplay on the so-called TAG, fielding two-on-two fights, with the player who can choose to alternate the members of his team. But be careful because unlike for example Marvel vs Capcom, the defeat of any of your wrestlers will mean the end of the match. It may seem like a detail, but this choice heavily affects the dynamics, forcing the player to switch from one character to another frequently, possibly taking advantage of the different combinations of moves that make up the large menu designed by Capcom. Thanks to a handy tutorial, led by Dan Hibiki, it will be possible to familiarize yourself with the basic elements of the title, a highly recommended step due to some peculiarities that make Street Fighter X Tekken unique in some ways. In the introductory hat we described Capcom's new work as more accessible, and in fact it introduces various gimmicks that allow newbies or fast gamers of the genre to pick up the pad and have fun practically immediately. The Cross Rush is the first combo to learn, which allows you to chain a weak, medium and strong blow and then press the latter once again, so as to throw the opponent into the air, while our fighter leaves the field to his teammate , who can take the opportunity to perform a Juggle. This combo is simple to remember, can be completed with both punches and kicks and does not require particular timing, giving immediate satisfaction, placing a first piece of the complex gameplay. The title also offers other facilities, such as combos that can be performed by pressing two keys simultaneously, even if this will cost a notch of the Cross bar, the energy indicator divided into three segments to be used to perform other special moves as well. This fills up quite quickly, almost always guaranteeing a fair amount of Cross energy to be used to unleash the most powerful and spectacular attacks. In this sense, it is clear how Street Fighter X Tekken moves much more towards the concept of dynamic and caciarone fighting game at Marvel vs Capcom, with the necessary differences, of course. Easy to handle, but Exploring the title, we discover not only a very defined personality, but also a depth that we would not have expected. The simplifications, in fact, must not mislead because Capcom has been quite skilled in balancing them by putting much more effective but also complex tools in the hands of more experienced players. Super Art, devastating moves to be performed in combination with the pressure of all three punches or kicks, depending on the wrestler, and Cross Art, the same move but performed in tandem with the teammate at the cost of the entire Cross bar, are still simple techniques in execution, even if timing will begin to be fundamental since it is not too difficult to recognize the starting animation and thus avoid contact in advance, gaining precious moments of advantage over the opponent. Still taking advantage of all three segments of the Cross bar, it is possible to recall the profirst partner on the field and fight side by side for a few seconds, with this controlled by the CPU and thus inflicting the largest amount of damage possible with combos. Of course, you can recall the other wrestler at any time simply by pressing medium punch and kick, but be careful that the entering partner will be at the opponent's mercy for a few seconds. Pandora Mode then makes its debut in Street Fighter X Tekken, a resource to be exploited in extreme and desperate cases. Only activates when one's fighter is below 25% life energy, pressing down twice, along with medium punch and medium kick, squashed at the same time. Our character will sacrifice himself, calling his teammate to end the match, significantly enhanced. However, he will only have ten seconds to close the game, or we will have lost. This particular technique had been much criticized at the time of the announcement, but once seen in action and tested on our skin, we must admit that we found it very interesting and rather balanced, above all thanks to the time available to finish the meeting, really narrow. The Pandora Mode therefore effectively allows you to overturn the fate of a match now running out, but only the smartest players will be able to exploit it profitably, who among other things will very soon learn to use it in combination with other moves, for spectacular endgames. We learn to fight The same goes even more so for the entire repertoire of more advanced moves and combinations, which require the little permissive timing typical of Street Fighter IV. In this sense, the complete Challenge menu comes in handy, which contains in addition to the basic tutorial, a substantial series of tests dedicated to each individual character, which allow you to become familiar with many of the techniques. Another very useful tool to be able to study and improve one's skills is instead included in the online section where you can lose whole hours observing the best champions by downloading their replays. Capcom has gone even further, introducing the possibility of tackling the training mode in company, so as to allow a team to acquire greater harmony by trying the different techniques together, or simply to give space to a player with more experience to show the other the own tricks. In short, once again Street Fighter X Tekken demonstrates great depth hidden under the guise of an immediate title or, as Ono-san likes to call it, ~fighting game festival~. It is also worth spending a few words on the excellent work done in introducing the fighters taken from the world of Tekken, who offer a fighting style that mixes the original techniques with those typical of Street Fighter. If in fact to perform most of the moves you will still have to resort to the typical half-moons and variations, the inclusion of combos that can be performed using only punches and kicks stands out. In this sense, Capcom has also made an effort to remain faithful to the original Tekken setting, conceived on the four front buttons of the Playstation pad, allowing the player to be effective even without having to resort to strong punch and kick, respectively back and right trigger . The abundance of Juggle will then delight fans of the Namco saga, who will easily recognize the original movements and fidelity to individual fighting styles. Although Street Fighter X Tekken was born as a console fighting game, the baggage inherited from the parent Street Fighter IV, designed for cabinets and to be tamed with a classic arcade stick, is still and unfortunately noticed. In short, forget about being able to overcome a certain level simply by using the pad, especially if you play on Xbox 360, whose controller was once again unable to adequately interface with this type of game. So unlike the latest Mortal Kombat, but also Soul Calibur V, from this point of view Capcom stopped a bit halfway in trying to give its fans an accessible title suitable for home consoles, preferring however to dedicate the most advanced techniques to the most hardcore players (and equipped with sticks). It is not a real defect, but the risk is that despite the wide range of possibilities included, the title ends up not completely satisfying neither the more casual nor the more professional users. Xbox 360 goals Street Fighter X Tekken offers the classic 50 objectives for a total of 1000 points. These are partly unlocked simply by playing, as they require you to activate a type of gem 100 times, perform 500 launches and so on. Others are related to differentmodality, with particular attention to the online component, the viewing of replays and there is even one that will reward you if your video is downloaded 20 times. If some are easy to unlock, like entering training mode 10 times, to reach the perfect score it will take a lot of dedication, for example to win 100 online matches, and the willingness to delve into all the various aspects of the game. content? Just the users less interested in wasting their days trying to master the most challenging combinations or being filled with blows online will undoubtedly be disappointed by the contents included in the Capcom title. Don't get us wrong, Street Fighter X Tekken offers a wide range of possibilities, dividing the experience between Arcade modes, where some nice videos will tie the different encounters into a simple plot up to the final battle, Training, Challenges, containing the aforementioned tests as well to difficult missions to finish, to get to the rich multiplayer component. This being precisely the core of the experience, where once a player has destroyed his fingertips by training alone he will put into practice what he has learned, less frequent users will risk getting bored quickly. And for them the title doesn't have much else to offer. In this sense, the competition has convinced more, especially we think of the endless amount of mini-games, unlockables and more of Mortal Kombat. Also in this case we are not talking about a real defect, only it should be noted that the development team did not want to go all the way in its policy of opening up to a wider audience. To accentuate the contrasts of which the title is capable, we then find the multiplayer modes, which allow you to connect up to four pads to the console to have fun in company, perhaps deciding to collide all at the same time in a riot of exhilarating fisticuffs, perfect for spending evenings carefree with your friends. RPG fighting game Street Fighter X Tekken also introduces an interesting novelty for the genre, implementing the infamous Gem System, thanks to which it will be possible to customize your fighters with three gems with particular powers. Just like the skills of an RPG, these will provide the characters with enhancements, for example by intensifying their defense or attack power, up to simplifying the execution of some moves, activating the automatic parry, regenerating energy and more. They will not always be in operation, but they will be activated in the most disparate ways, suffering a certain number of hits, achieving combos of at least five hits and so on. Despite the initial doubts, the success of this expedient, not at all invasive and surprisingly balanced, must be recognized, even if it will then be the community that decrees the success or otherwise of the Gem System. In our opinion Ono-san has managed to give an additional tool to less experienced players, who will be able to balance their shortcomings by properly equipping their favorite fighters. This will give him a few more chances, but it certainly won't make him invincible! Unfortunately alongside this powerful tool, we find a character customization menu reduced to a minimum, which allows you to change only the colors, among other things, choosing from a bare-bones range. However, it is likely that new costumes and gadgets will be released in the form of DLC. We hope they're free, but knowing Capcom we don't have much hope. A wasted opportunity, given that new content to be unlocked by winning the various challenges and finishing with the different characters, the Arcade mode would undoubtedly have provided an extra incentive to players less interested in the complex gameplay dynamics of the title. From an aesthetic point of view, Street Fighter X Tekken chooses to reproduce the same style introduced with Street Fighter IV, redesigning the Tekken characters to integrate them with the Capcom ones. The work is truly excellent, as are the animations, underlined in the spectacular Super Art by the twirls of the camera. Unfortunately we cannot say the same of the backdrops, not particularly numerous and really not very interesting if not for the various easter eggs inserted, which will delight the most attentive players. We then noticed some defects, such as annoying interpenetrations and little attention to detail in some situations, elements that in a title of this caliber clash and not a little, but do not ruin a very good, clean and always very fluid general picture. The soundtrack was rejected in no uncertain terms, made up of dance-like tracks, pounding and at times truly unbearable. Finally, we point out a serious problem that afflicts online matches, at the moment brambles", "date": "2012-03-08", "grade": "8.4"}