{"name": "Atelier Sophie 2: The Alchemist of the Mysterious Dream", "ref": "https://multiplayer.it/recensioni/atelier-sophie-2-the-alchemist-of-the-mysterious-dream-recensione.html", "text": "For anyone who has never played an ~Atelier~ it is right to make some assumptions as well as a small excursus in past events, just to understand what type of game we are talking about and to make the style of the series known at least. Each chapter, or group of them, of Atelier focuses on an alchemist, i.e. a person capable of creating any object through a magical cauldron and the use of raw materials obtained in the most disparate ways. The alchemist in this case turns out to be the nice Sophie, now in her third appearance as the protagonist. At his side we find Plachta, an automaton previously magically locked up in a book, freed from captivity and precisely, came into possession of a humanoid body. With a grumpy basic character, Plachta is however a very valid help for the young Sophie, daughter and granddaughter of great alchemists. In fact, the automaton is a concentrate of alchemical knowledge and manages over and over again to get ours out of trouble, managing to give it some advice for the more complex formulas. One fine day Plachta wakes up from a dream in which she has a vision of a magical tree, without being able to make much sense of it. The adventure of this new chapter starts right here, starting from the end of Atelier Sophie: The Alchemist of the Mysterious Book, a game in which the two protagonists start from Kirchen Bell in search of new and more powerful alchemical recipes. It doesn't take long before they find the fateful dream tree in their path which, once approached, evokes a vortex that sends them to an alternative world. It all starts from here, from the fact that, once she wakes up, Sophie no longer has Plachta by her side and does everything, together with new acquaintances, to find her. To do this, as always, it will be necessary to draw on the fateful cauldron to create the strangest and most absurd recipes, but from a narrative point of view this has significant implications, which will have repercussions for the duration of the campaign. From now on the story will go on between old and new characters, dreams, exploration and weather changes that will put a strain on the patience of us players, up to a phoned ending but in any case, for the general style of the saga, well accepted and pleasant.Let's find out all the details of the game in the review of Atelier Sophie 2: The Alchemist of the Mysterious Dream. Gameplay and combat Atelier Sophie 2: The Alchemist of the Mysterious Dream - the fights We say it right away, Atelier Sophie 2: The Alchemist of the Mysterious Dream is unfortunately a step backwards or even maybe two, as regards combat, exploration and collection of alchemical elements. Although it is generally fun and quite intuitive and fast, the game fails to take that shot which, now in the sixteenth incarnation of the series, was expected. With Atelier Ryza we had managed to see some very good ideas for real-time combat, abandoned here in favor of a turn-based style. Let's understand each other, not that it is necessarily a point against, on the contrary, this leads above all to more reasoned and profound clashes compared to Ryza. In fact, the fights take place with three main characters deployed on the battlefield and as many used as secondary characters who will be able to defend the corresponding ally or help him with devastating combos and skills. It is not that it is a revolution for JRPGs, but in any case the clashes have managed for the most part to be a welcome filler and above all those against bosses and minibosses, challenging enough to have to use a little gray matter, which does not it never hurts. Atelier Sophie 2: The Alchemist of the Mysterious Dream - Platcha and Sophie Out of the fighting, however, is where the beating heart of Koei Tecmo production is found: the elusive collection of alchemical objects and materials to create the most absurd and different recipes. The materials can be obtained in many different ways: we will be able to collect them around the map, we will be able to obtain them from the aforementioned fights or even buy them in shops or create them in turn to use them in other recipes. We will have different tools available to obtain materials such as the sickle, the insect net and the pickaxe, all unlockable or obtainable only after having found the associated recipes. Yes, there is an alchemical level to be respected in order to have the possibility of creating a certain recipe and this is precisely the aforementioned step backwards. Unfortunately you will find yourself more than sometimes having to create mostly useless objects simply to have the possibility of creating this or that other recipe necessary to continue with the main plot. We have stI garden my nose several times during these events since the plot itself is not all this ease and speed, moreover the developers force several useless stops which drastically lower the attention and the desire to carry on sessions longer games. Atelier Sophie 2: The Alchemist of the Mysterious Dream - Our Sophie Net of the obligatory deviations from the recipes, however, the general pleasure of exploring and obtaining some rare or unique materials around the maps cannot be denied. These have undergone a substantial change in both design and gameplay compared to previous titles by inserting the mechanics of the weather change through dedicated altars. In fact, we will be able to change the weather in three different ways: clear, stormy or rainy. This will involve changes to the maps, running dry or filling water courses for example, as well as making different monsters appear. As interesting as it may be (even if the older ones will remember that the same happened in Final Fantasy XII, even if by chance or almost) unfortunately most of the time it creates pure chaos. We are not talking about all the maps, but in some of them we found ourselves going back and forth more than a few times, getting lost in the labyrinths created by these ~weather~ changes. faced with a sort of alchemical Tetris. Each object, in fact, must be positioned within a grid with some boxes dedicated to elemental upgrades; once the various elements have been inserted, interlocking them, depending on how many total lines of 5 spaces created, we will have the possibility of receiving a higher level object and also being able to choose 3 perks to insert. The cauldron is obviously placed in the atelier that can always be reached via teleportation, a mechanic that can be used at any time, and can be exploited as mentioned by both Sophie and Plachta. Each of them will also have unique recipes and we will take care to change the alchemist as needed. Technique Design is one of the best sides of Atelier Sophie 2: The Alchemist of the Mysterious Dream Unfortunately, even from a technical point of view, there are no steps forward in almost any production area. The models, albeit with a slightly increased polygonal count and high definition textures, remain old even if in any case the character design is inspired as always (and with a lot of fan service). Even the maps themselves, however articulated and deliberately cryptic, prove to be filled with assets that are not too detailed and repeated. Certainly this is not a title from which enthusiasts expect a dislocated jaw from a graphic / technical point of view, but in any case we can assert that the general impact is not at all unpleasant, net of the defects listed above. The palette used is absolutely spot on and the characters are mostly caricatures who manage to be pleasant and funny. On the audio side, however, we can say that his work manages to do it and the OST is pleasant and manages to accompany the raids around Erde Wiege without disturbing.", "date": "2022-02-25", "grade": "7.0"}