{"name": "Novit sul fronte sparatutto", "ref": "https://multiplayer.it/recensioni/99712-dariusburst-sp-novita-sul-fronte-sparatutto.html", "text": "Version tested: iPhoneOwners of iPhone and iPad have been lucky enough, in recent years, to be able to enjoy some of the best two-dimensional shooters of Japanese origin. DoDonPachi Resurrection and the recent DoDonPachi Blissful Death immediately come to mind, unmissable for any fan despite being productions that originally date back to ten or twelve years ago. The period between the end of the 90s and the beginning of the 2000s was certainly a golden age for the genre, which saw the birth of gems such as Einhander (PlayStation 2) or Ikaruga (arcade, Dreamcast, GameCube and finally XBLA), capable of introducing innovative elements where it seemed impossible to be able to do something original. However, there are also relatively recent titles that have stood out for their quality, and this is precisely the case of Dariusburst: born on PSP in 2009 and brought to Japanese arcades the following year, the shooter produced by Taito and developed by Pyramid offers an interesting management of the classic ~beam~ and weapon upgrades, as well as the possibility of choosing each time the path to take to get to the final confrontation, on an OutRun-style pyramid board made up of a total of eleven levels, which they double thanks to the presence of the Original Mode. The debut of Dariusburst SP (where ~SP~ stands for ~Second Prologue~) on the App Store therefore allows us to appreciate an alternative vision of the ~bullet hell~, in which precisely the quantity of bullets on the screen (and, consequently, the degree of challenge) is below average as the focus is on other elements to enhance the replayability of the product and its duration over time. However, those who want to take advantage of the opportunity should know that the game is offered at one of the highest prices ever seen on the Apple digital platform: 8.99 euros. Shoot everything? But also not As mentioned above, the philosophy behind Dariusburst SP differs from the tradition of ~bullet hell~, which moreover almost always comes in the form of vertically scrolling shooters rather than horizontally. During our desperate mission to save the universe, aboard a single Silver Hawk against an entire alien fleet, we will find ourselves dodging a relatively small amount of bullets, moving mostly in order to better hit the gatherings of vehicles hostiles that proceed following a precise pattern, in order to then be able to collect the released power-up. The latter, depending on the color, improves the performance of our main weapon, homing missiles and shields. The main weapon at the beginning is represented by a pair of missiles, but by collecting power-ups it can transform into a very thin laser or, in the last stage, a sort of highly effective ~shock wave~. Also interesting is the possibility of being able to counter enemy fire with something like this: missiles destroy missiles, lasers nullify lasers, and so on. At the end of each level, the confrontation with the boss on duty starts, and in this juncture the developers have done an excellent job, equipping these big enemies with an apt design and interactable elements that ~jump~ when we focus fire on them, revealing the underlying structure until its complete destruction. The bosses are quite resistant to normal projectiles, so the ~burst~ comes in handy, i.e. a powerful beam of light which, depending on the Silver Hawk selected at the start of the game (there are four, two available immediately and two to unlock) remains anchored to the spacecraft or is ~released~ in a certain area of the screen and can possibly be ~oriented~ to follow its target. The ~burst~ simply recharges when we destroy enemy units, so it's easy to always have some available, also because its emission can be interrupted when we wish so as not to completely consume the relative bar. The gameplay of Dariusburst SP therefore proves to be solid and fun, with three possible levels of difficulty (easy, normal and hard) and the possibility of taking alternative paths each time to obtain a different ending, as well as trying the new Original Mode (created specially for the iOS version) and with the Mission Mode, able to multiply the duration of the experience. Excellent polygonal graphics, very original musical accompaniment. Everything perfect, then? Unfortunately not: the touch controls are precise but reproduce the movement of the fingers with a 1:1 ratio, i.e. they do not allow us to cover the entire length of the screen with the spacecraft without having to drag multiple times, unlike the episodes of DoDonPachi, which from thispoint of view are unattainable. The tested version is 1.0.0 Price: 8.99 App Store links", "date": "2012-02-29", "grade": "8.5"}