{"name": "Beata morte", "ref": "https://multiplayer.it/recensioni/99397-dodonpachi-blissful-death-beata-morte.html", "text": "Tested version: iPhoneIn recent years we have seen the return, in the mobile sector, of videogame trends that have practically disappeared, such as that of vertical scrolling shooters. In the case of the DoDonPachi series, we are talking about coin-ops released in theaters about ten years ago but which are still extremely current from a gameplay point of view and offer the opportunity to try a different vision of gaming compared to today's standards. in some ways ~extreme~ yet always fascinating. It is also true that when a product brings the level of competition to new standards, it becomes difficult to match its success and replace it in the hearts of enthusiasts; and that's exactly what happened with DoDonPachi Blissful Death, available on the App Store for a few days. Reduction of DoDonPachi Dai Ou Jou, Japanese arcade from 2002, the game re-proposes the mechanics of the splendid DoDonPachi Resurrection, released almost two years ago, but without ~daring~ from the point of view of the contents. Let's explain ourselves better: once the game has started, the only mode available (apart from the Practice Mode, which in its own way is useful for gaining some prior experience in the levels) is the classic single player mode, in which our ship must face a huge (huge!) amount of enemies and dodge the many (many!) bullets fired at him, all with the aim of reaching the final stage and maybe completing it. For shooter fetishists this will suffice, after all the action itself is frenetic and spectacular as one would expect from an episode of DoDonPachi, but the experience is an end in itself and offers no novelties capable of keeping the interest high ; which, however, the aforementioned Resurrection was able to do thanks to the presence of the original iPhone mode. Spaceships and death rays The graphic aspect ratio of the original Dai Ou Jou is faithfully reproduced by DoDonPachi Blissful Death through the device of the small screen size, but this factor can be changed from the options. The space that is created in the lower part of the touch screen is essential to control the spacecraft with a finger without invading the area in which the action takes place: very light inputs are enough to determine the movement of the vehicle, and the precision appears immediately high, so as to allow us to dodge the myriads of bullets fired in our direction without problems (as long as we are not hit by the terrible ~rough finger~ syndrome). As mentioned above, it is possible to face the five full-bodied game levels by choosing between different degrees of difficulty and therefore adapt to the challenge as you become familiar with its dynamics. When we start a game we are asked if we want to drive the Type-A or Type-B spacecraft: the first is faster and concentrates its fire frontally, the second is slower but has wide-range weapons. Contextually we can choose to bring with us one of the three Element Dolls, ~dolls~ that influence the functioning of our arsenal, enhancing the standard shot rather than the beam and giving us a different amount of bombs. Once in the heart of the battle, we will notice on the left side of the touch screen three icons which serve, respectively, to interrupt the auto-fire, to activate the bomb or the hyper (a devastating attack that is loaded by ringing combos, among others things) and finally to alternate the standard cannon, with high dispersion, and the aforementioned beam, or rather a concentrated laser beam. Both weapons can be upgraded by collecting the bonuses released by some enemies, as per tradition, and this solution seemed well implemented to us. The developers have also included a sort of ~safety system~ that releases a bomb (if available) when we are hit by enemy fire to prevent game over, but at the same time they have made collision detection very ~permissive~ , which means that we will literally have to be shot through by a bullet for the spaceship to explode. In this sense, the management of ~continues~ seems very sensible, which must be earned and are not available by default, which would have ended up eliminating the longevity of the product (which unfortunately happened to many arcades arrived on the App Store). The tested version is 1.0.0 Price: 3.99 App Store links", "date": "2012-02-24", "grade": "8.2"}