{"name": "Londra capitale del minigioco", "ref": "https://multiplayer.it/recensioni/99586-mario-sonic-ai-giochi-olimpici-di-londra-2012-londra-capitale-del-minigioco.html", "text": "When years ago SEGA acquired the license from the International Olympic Committee to adapt the Olympic Games, the summer ones as well as the winter ones, to the videogame format, it decided to adopt a ~double track~ which could have aroused some perplexity, but which in the practical act of the rankings of sales and related receipts, has proved to be a success. While on the machines of the competition the Japanese company published the classic multi-event sports simulation, on the Nintendo consoles it dedicated itself to a more peculiar party game, in the wake of the success of Mario Party and the like. Not only that: this party game became nothing more (or nothing less) than a minigame collection on the small DS and, dulcis in fundo and probably the most outstanding feature of the whole, the official game of the Beijing Olympics in Nintendo sauce became ( officially) the first ever game in which the worlds of Mario and Sonic, once arch-rivals in the sales charts and symbols of two real and proper opposing philosophies of understanding the video game, came together, with the two heroes and their sequels intent on compete amicably throughout a series of events vaguely inspired by real Olympic sports. The important thing is not to win... Let's start immediately with what is a peculiarity of the 3DS version compared to the Wii counterpart released at the end of last year: there is a plot in the portable edition. In fact, there is a whole Story Mode which, winding through various episodes, some of which are dedicated to the blue hedgehog and others to the moustached plumber, tells of how the two supervillains Bowser and Eggman, on the occasion of the London Olympics, joined forces to do what supervillains do best, that you never know very well what it is but it has to be a bad thing. Showing off a non-indifferent and very English sense of irony, the two allies thus decided to wrap the capital in a fog of strange colours, very different from the usual fog of the city, and so heavy as to prevent the smooth running of the Opening Ceremony. Obviously the situation cannot sit well with Mario, Sonic and their respective adventure companions, who have arrived in London for the event, who begin to investigate: to hinder them, the two evil geniuses create their ~foggy~ alter egos, which they will challenge in the various sports the real heroes. You will have understood that the plot is not exactly a Shakespearean Masterpiece, just as the long cut scenes that introduce the various challenges will hardly compete with the Pixar films: in fact, the true value of the Story Mode, as well as the reason why we talk about it first , is to function as a sort of highly guided and very accessible tutorial to at least some of the 57 events on the card, just to get a first taste of the playful substance. And in fact, once you get the hang of it, you'll probably let go of the wobbly story to focus on the individual minigames. These, as we said, are 57 in all, each of which is inspired by an Olympic discipline and like these divided by category: athletics, heavy athletics, swimming, gymnastic/artistic disciplines and so on. We use the term ~inspired~ because the interpretation of each sport is so free, having to reduce everything to a minigame lasting a maximum of a handful of minutes, that there is almost never the slightest trace of a realistic reproduction of this or that dynamic . And so if disciplines with very simple functioning such as the 100m dash or the 50m freestyle retain an affinity with the real sport, with the first requiring a furious pressing of the A button at the moment of the final sprint and the second requiring you to tap with rhythm and speed on the touch screen to simulate strokes, a more complex specialty such as, just to give an example, beach volleyball, becomes a sort of rhythm game where all that counts is pressing A at the right moment. All, of course, in the service of the choice made to churn out a collection of minigames, but also, it seems, from another point of view, and that is to make use of practically all the features that the 3DS offers. A veritable display of all possible control systems winds along the synthetic descriptions that precede each test: not only buttons + sliding pad and touch screen, but also motion sensors and various accelerometers, and even the microphone into which to shout or blow. And within these large ~categories~ of control systems, different philosophies: judo too is played with buttons like the 100m dash, but it's a kind of quick time event in which you press the right combination of buttons before the opponent, as well as the barre uses the touch screen, but in a different way from the aforementioned 50m freestyle. And alsora, if the shooting competition uses the movement of the console in a very intuitive way, to aim, it may surprise you that the movement of the 3DS is also foreseen in fencing, which corresponds to the movement back and forth of the fencer along the platform. The 3D effect A bit like all the technical components of the game, stereoscopy does its duty without exalting: the 3D effect certainly does not change the experience in any sense, proving to be a pleasant addition which, moreover, which is always welcome, does not affect the framerate . However, be careful of those disciplines that involve the use of tilt sensors and various gyroscopes: in these cases it is clear that the 3D effect must be deactivated, as the console will not always remain perfectly in front of your eyes. ...but jump on the Goombas. If the choice to make use of all the features of the 3DS is certainly successful on the one hand, on the other it is the primary cause of a significant disparity in value between some games and other less successful ones, almost as if to cover all the possibilities available programmers have sometimes had to resort to ineffective solutions. Of course, personal tastes come into play when choosing one discipline over another, but yelling in time to lift a barbell (that's how weightlifting works) can be fun no more than a few times. It is however, that of a certain inconstancy between the various events, a defect common to all games of the genre, the greater however the more mini-games are available; the development team also shows a certain propensity for the challenge, represented by three difficulty levels, the last of which is generally quite difficult. You will almost certainly find even just a handful of sports that you will be so passionate about that you will necessarily want to complete them even on the highest difficulty, to the benefit of longevity. Furthermore, once you lose interest in the single minigame, you can dedicate yourself to the medley of the same, a sort of championship made up of different disciplines (there are many pre-established combinations but you are free to create your own) which again increases the difficulty and is more exciting of the unique event. Obviously the multiplayer cannot be missing, which is indeed the true soul of a collection of minigames, up to four players, both competitive and cooperative and also in Download Play; but here we are faced with the other weak point of the product, namely the lack of multiplayer via the internet. A great pity, given that online play is now an (almost) common feature on Nintendo consoles and, even if it is true that a party game is best used with friends near rather than far away, it would have been a very welcome extra opportunity : there is online, but only to take into account the world rankings of 23 of the 57 disciplines. Although lacking a feature that other games have, Mario & Sonic at the London 2012 Olympic Games is still sufficiently long-lived, especially if you find a good part of the mini-games to your liking. A quick look at the technical department before moving on to the commentary: quick because there isn't much to say. The graphics are colorful, rich, detailed, fluid, nothing particularly impressive, but you really can't ask for more from a game like this; the sound instead remains anonymous where it does not use some famous piece of classical music, but it is impossible not to mention the hateful, hateful ~voices~ of the characters who, repeating themselves every two seconds with the same two or three expressions, will become your nightmare during the long narrated interludes of the Story Mode.", "date": "2012-02-23", "grade": "7.0"}