{"name": "Hail to the Michael", "ref": "https://multiplayer.it/recensioni/97105-michael-jackson-the-experience-hail-to-the-michael.html", "text": "The series of music games with the suffix 'The Experience' has not found particular success with gamers, this due to a little varied and deep gameplay that has relegated the titles of the series to be purchased only by the most hardcore fans eager to listen again the favorite songs of one artist rather than another. Among them is Michael Jackson, whose discography beyond his personal life has left its mark not only in musical pop culture, but also in general. Hence after his death the more or less successful exploitation of his image, and obviously a musical title dedicated to him is the one on paper that is most suitable for transporting him in the form of a video game. Michael Jackson: The Experience is already available on many systems, including iOS, and Ubisoft has decided to develop a version also for the launch of PlayStation Vita, at a price that is around 29 euros. There are fifteen tracks (there are the famous and hyper-used Bad, Thriller, Beat it, Billie Jean and company) and references to the singer are obviously everywhere in the menus and in the backing track; the game sections are instead three: History, Battle and Backstage. The first is the fulcrum of the production, for each song there are three difficulty levels (to be unlocked) and five challenges to be completed, such as a certain number of combos, perfect executions and so on. In support there is a sort of player level, which increases according to the degree received at the end of each song, and the inevitable offline and online rankings, linked to the battle mode. Playstation 3 trophies Michael Jackson: The Experience HD offers 26 trophies, of which 6 are gold and 9 are silver. Their achievement is mainly linked to the score obtained in the various music tracks, the level reached and the completion of all the challenges. Nothing too transcendental, but you have to play several hours to reach the coveted platinum. The king of pop Once a song has been selected to welcome the player there are clips of music videos reworked in computer graphics and quite faithful to the original ones, only clips because then you move to the view with Michael performing dance moves and moves, which must be imitated using gestures on the touchscreen, such as the slide in the four directions, the circle, the tap and various curved lines to be drawn in time with the music. As the difficulty level increases, the complexity increases and there are actions to be done simultaneously; playing the notes in sequence also allows you to increase the combo system and therefore the score, as mentioned then there are challenges to be completed to unlock the next level of difficulty. Vita's touchscreen responds perfectly and never misses a beat, when you make a mistake it's because maybe you're not very reactive or you haven't drawn the requested move well. In itself the gameplay would also be interesting but we are far from the best music games on the market, which offer a decidedly more solid level of challenge, variety and execution. The Battle mode adds a little something because it increases the level of challenge and adds competition with friends, the Backstage section is dedicated as the name suggests to the most interested admirers because inside there are several excerpts related to the making of the songs present, even if to access them you have to unlock them through the challenges we talked about a few lines above.", "date": "2012-02-20", "grade": "6.0"}