{"name": "Piattaforme di cartone", "ref": "https://multiplayer.it/recensioni/99068-paper-monsters-piattaforme-di-cartone.html", "text": "Version tested: iPhoneCan a paper monster be intimidating? Well, it depends on how big he is, which the little guy from Paper Monsters learns pretty soon. Debut title for Robots Vs. Wizards on the App Store, the game is a classic platformer in ~two and a half dimensions~, that is, it lends itself on more than one occasion to visual solutions that see us cross the scenario even in depth and materialize in the distance in the background, intent on collecting objects that are hidden at first glance, perhaps due to the effect of perspective. The dynamics that regulate the ~combat~ are the same dictated almost thirty years ago by Mario Bros., i.e. you have to jump on the enemies head to eliminate them. Sometimes they are not conventional opponents and their explosion can cause a lot of damage, so you have to be careful, but in general the challenge element is lacking and the fun is completely entrusted to the exploration of the locations, in particular to the collection of buttons (the currency of the game, in practice, through which it is possible to buy clothes and accessories for the character) and in search of the three ~staples~ hidden in each of the twelve standard stages available, distributed within four areas that always culminate with a boss fight. The levels are well differentiated and designed, enticing us to check any corner in search of bonuses, and there are even variations on the theme, such as the shooter phases in which you start driving a submarine and those in which we board of a toboggan and we have to jump to avoid traps along the way. Little Big Planet Anyone who has played LittleBigPlanet on PlayStation 3 knows well that Media Molecule's product is as extraordinary and rich in terms of creation and potential as it is ~slippery~ in its platform aspects. Despite this, its aesthetic has evidently influenced a lot of developers, since not only Paper Monsters, but also a series of other video games for iPhone and iPad (recently it was Cordy's turn, for example) are clearly inspired by it . In this specific case we have the aforementioned excursions into the distance, the mobile platforms and a whole series of elements that closely resemble the atmosphere in which Sackboy's adventures are impregnated, including the collection of objects. The control system chosen by the Robots Vs. Wizards guys is completely based on the touch screen and is available in two variants: the first, activated by default, allows us to move the character by acting with the left thumb on an invisible virtual stick, but the fact that this stick repositions itself every time we touch the screen unfortunately produces above average reaction times, capable of creating problems when we have to move quickly; the second variant, decidedly more practical, consists of a visible and fixed d-pad, very precise even if a bit too small in size (no making it bigger, eh?). The story mode, as mentioned, made up of a total of sixteen levels (boss fights included), is supported by two nice extra modes. The first is called ~Drag 'n Dash~ and consists of a simple running game, in which you have to jump to avoid obstacles and at the same time collect as many objects as possible. The second is called ~Heartbreak Shakedown~ and consists of a set of six additional levels inspired by Valentine's Day, which can be accessed once the main mode has been completed. Technically Paper Monsters looks like a nice title, with an excellent choice of colors, well-differentiated scenarios and interesting characters, even if with not particularly varied animations (the protagonist, with his so static walk, is a prime example) . The tested version is 1.1 Price: 0.79 App Store links", "date": "2012-02-20", "grade": "8.2"}