{"name": "L'arte del teletrasporto", "ref": "https://multiplayer.it/recensioni/99356-warp-larte-del-teletrasporto.html", "text": "The title is available for download on Marketplace Live, Sony Playstation Network and Origin. Version tested: Xbox 360Produced by Electronic Arts, Warp is the second project of the very young software house Trapdoor Inc, a small but promising company which includes former employees of Gameloft and Behavior Games. It is a hybrid between adventure and puzzle game starring a friendly alien named Zero. Our funny little man has been kidnapped by a mysterious organization and transferred to a high-tech underwater laboratory. Here mysterious experiments are carried out on other aliens like him, but Zero is special. The medal he wears on his chest is able to teleport him wherever he wants within a meter radius, and he is perpetually in telepathic contact with a mysterious creature willing to help him and, of course, us! Unfortunately, various dangers await us, from defense systems to a group of heavily armed soldiers. Escape will not be easy at all. You enter me The heart of the game revolves precisely on Zero's characteristic of teleporting, but not only that. The alien can enter objects and people and then make them explode from the inside, while in the advanced stages it is able to generate a holographic clone to confuse enemies, and even transfer other objects inside their body. The most fascinating feature of the product is represented by the freedom offered to the player in managing the protagonist's powers. For example, if we enter the body of an enemy soldier we can decide to stun or tear him to pieces by quickly shaking the pad lever. Ditto the scientists who control the machinery of the complex, unable to do harm, but able to sound the alarm. In other words, Warp can be played either bloodthirsty or as a stealth game. The level design explores the implications of this peculiar system, not without great irony. Just to give another very amusing example, Zero can eradicate multiple enemies in the same room, taking possession of a soldier and then exiting his body shortly before being riddled by the frightened companion. A quote that even refers to the world of literature and cinema, with films such as The Thing or Invasion of the Body Snatchers. The same goes for the impassable walls and doors, a non-existent problem for our alien, provided they are not particularly thick, or protected by energy systems to be deactivated by locating their cores. This facilitates the interpretation of the map from a different point of view, which transcends space, in a way not very dissimilar from what we have seen in titles such as Portal. Scattered around we also find gelatinous substances, the grubs, which represent the game currency to buy bonus abilities in the appropriate shops. Pads on fire Warp is heavily filled with puzzle elements, despite Zero's powers, the pitfalls we have to face are innumerable, given that we move in an extremely hostile and dangerous environment, with a slow protagonist who can be killed easily. This is a bit the cross and delight of all Trapdoor production, the player must carefully analyze the resources offered by the scenario to make the most of the teleportation, but a certain creativity is also needed in interpreting situations and capitalizing on them to the fullest. The difficulty curve thus becomes rather subjective, but regardless of this it is a real shame that an original formula, often enhanced by a brilliant level design, is subject to trial & error for questionable choices made in certain passages. In Warp you die a lot, too much, honestly, an aspect decidedly tempered by the massive presence of check points, but still present. In this way the rhythm undergoes continuous stops that are not conducive to the usability of the title, such as the need to use reflexes long before the brain. The aspect is aggravated by the chronic lack of information in the tutorial, where the importance of the power ups that can be purchased with grubs is not sufficiently explored, an element capable of radically changing the experience. The same replayability of the map, which opens gradually in proportion to the skills acquired by the little alien (in Metroid style), fails to stimulate as it should, always giving the unpleasant feeling of just having to get to the next room. They are small defects that betray the indie nature of the development team and that relegate the game to a particularly persevering slice of user. Xbox 360 goals Warp is absolutely compliant with the standards of a Live Arcade title, i.e. with 12 objectives for a total of 200 player points. This is the opportunity to collectre the fruits of violent or pacifist behavior in play, each of which yields 20 points. Another 15 points are just waiting for those who start the adventure, but to get the perfect score you will need to get busy, collecting all the grubs on the map or maximizing the purchasable skills. Good luck! A lovable rogue Technically Warp demonstrates, as well as gameplay, the ups and downs of Trapdoor Inc. programming. The game features a very unique style, which combines extreme violence with the candor of a Pixar cartoon. In the same way, the tender protagonist, only apparently harmless, ends up spreading liters of hemoglobin on the walls of the aseptic laboratory. It is a deliberate contrast, which perhaps not everyone will like, but it gives character to the product, while the artistic direction immediately demonstrates its validity, with captivating characters. On the other hand, however, we did not like the poor optimization, we have rarely seen the Unreal Engine in such difficulty starting from the very low image quality, blurry and subject to aliasing phenomena (the jagged effect of the edges), up to the frequent drops in framerate. Warp is also completely in English, another aspect that is anything but exciting for those unfamiliar with the language. The opening cut scene even lacks subtitles, making it difficult to understand. Online support is limited to rankings, the title constantly compares the statistics in the game, even with friends in the list, taking into account numerous factors, such as how many people we have killed or stunned, and so on. The price is appreciable, contained in comparison to the recent proposals in digital delivery. Warp can be purchased on the Xbox Live Marketplace for 800 Microsoft Points, and the Sony PSN and Origin platforms for 9.99. Live Marketplace purchase link.", "date": "2012-02-20", "grade": "7.0"}