{"name": "Al crepuscolo", "ref": "https://multiplayer.it/recensioni/99390-alan-wake-al-crepuscolo.html", "text": "Version Tested: Successful writer PCAlan Wake travels to the quiet town of Bright Falls with his wife Alice for a relaxing getaway. The real purpose of the trip, however, is to resolve the serious ~block~ that has been tormenting him for two years, preventing him from creating new stories. From this point of view, the location is perfect between forests, mountains and lakes; an excellent mix to recharge the batteries, were it not for one small detail: it is a cursed place, which hides terrible secrets and dark forces that some inhabitants seem to know well. Alan and his wife reach the cottage they have rented, located on a small island in the middle of Cauldron Lake, but the situation quickly deteriorates: Alice disappears, apparently swallowed by the waters, and Alan dives in to save her, waking up however in his car at a few miles away, in a situation that is completely foreign to him. Nothing compared to when she discovers that the lake house where she was supposed to spend the holidays hasn't existed since a volcanic eruption swept it away in the 1970s. And just at that point comes a revealing phone call... Presented for the first time at E3 in 2005, Alan Wake required six long years of development by Remedy, the Finnish team already responsible for the first two episodes of Max Payne and decided to focus on a ~psychological thriller~ style production instead of a new pure action game. Interestingly, the game was shown several times in action on PC prior to release, but over the last year the decision was made to make the project exclusive to the Microsoft console. The complete edition available on Steam from February 16 therefore seeks to right the wrong that PC users have had to suffer: two years of waiting in exchange for the possibility of buying the title at a third of its original price, in a technically optimized version that includes in the price of 20.99 euros the two DLCs (~The Signal~ and ~The Writer~) and, until February 23rd, the soundtrack in digital format, an illustrated e-book (only in English, unfortunately) and the video commentary by the developers who, scene by scene, will describe the world of Alan Wake, the decisions made in terms of level design, the peculiarities of the gameplay and so on. Secret Window Alan Wake is undoubtedly a particular product, which bases its appeal on narrative content and offers us an experience that gives its best when enjoyed at night, with a pair of headphones. The direction of the game is full of original and effective ideas; such as the initial nightmare, which turns into a tutorial and allows us to immediately become familiar with the dynamics that regulate the management of vital energy and fights, or the flashbacks that show us Alan and Alice before their arrival in Bright Falls, when their married life went smoothly. Also interesting is the subdivision of the adventure into episodes in the style of a television series, with each chapter ending on the notes of a piece of music and being introduced by the classic ~in previous episodes...~. The bulk of Remedy's work, however, lies in the surrounding narrative elements, those that really make the difference and that give charm and depth to the story: while we explore the scenarios, for example, we can stop and listen to the radio broadcast by Pat Maine (whose surname is just one of the many references to Stephen King), read the information boards and above all watch the episodes of ~Night Springs~, a true fiction within a fiction that refers to the famous ~The Twilight Zone~ and contributes to the construction of a surreal atmosphere. And speaking of a surreal atmosphere, it is impossible not to mention the pages of the manuscript that Alan finds around Bright Falls and which practically describe the events in which he is the protagonist even before they take place. What we move in therefore presents itself as a complete, plausible world, full of details, which at night is the victim of the so-called ~taken~, people corrupted by darkness who roam in the woods guided by a mad murderous will, and with which we will deal with on more than one occasion. Covered in a blanket of ~darkness~ that makes them invulnerable to any weapon, these mysterious adversaries must be faced using the only element they truly fear: light. For this reason Alan always carries a flashlight with him, which in the course of history proves to be the only substantially upgradeable ~weapon~ (we will pass from light and portable models to decidedly more effective and cumbersome ones) and which allows him to destroy the ~barrier ~ which protects enemies to be able to hit them with the pistol or rifle. Extra content To thean Wake is available on Steam at the introductory price of 20.99 euros (instead of 23.99) and natively includes, in addition to the base game, the two DLCs ~The Signal~ and ~The Writer~, which add a few extra hours of gameplay and provide a sequel to the original ending. Also available through February 23 is the Collector's Edition pack, which includes the digital soundtrack signed by Petri Alanko, the illustrated e-book ~Alan Wake Files~ and the developer's video commentary, included in the price. Fighting in chiaroscuro The action component of Alan Wake is implemented with great competence, and it could not be otherwise given the curriculum of Remedy. The Finnish team based the credibility of the tools available to the protagonist on the contrast between light and dark, and this is how a pistol that fires signal flares becomes our most effective weapon by far, while revolvers and rifles should only be used after making the enemies tangible to our attacks by turning the light of the torch on them for a few seconds. The elimination of an opponent is made more spectacular by the same bullet time which underlines a dodge brought to the last second, and in this sense the control system proves to be perfect. Obviously it is possible to play on PC both using the mouse and keyboard and the Xbox 360 controller, using the same layout of the controls of the original version: the left trigger to point the flashlight, the right one to open fire with the weapon equipped, the left and right lats respectively for running or dodging and for using flares or flash grenades, with the d-pad for selecting weapons and the main buttons used for reloading bullets (X), replacing the flashlight battery (Y), jumping (A ) and interact with the scenario (B). The need to manage your resources during the clashes (battery power, bullets in the magazine and even the ~breath~ to make a quick sprint) increases their thickness, making them challenging but almost never frustrating, even if the ~taken~ they have a nasty habit of coming up behind us while we're busy targeting their comrades. The possibility, in some situations, to board vehicles and use them to eliminate opponents (first hitting them with the headlights, then literally running them over) is certainly welcome and adds another dimension to the experience. The PC version In the weeks leading up to the release of Alan Wake on Steam, the developers released a series of images to show the graphical improvements compared to the Xbox 360 version released in 2010, which also ran at a resolution of 960x540 pixels. After playing the game, we can confirm that a great job has been done in terms of enhancements and optimizations, with particular attention to the shaders and surfaces. The Bright Falls that is offered to the eyes of PC users is splendid, full of details and with an excellent drawing distance. The look of the grass, trees and water is substantially better than on our previous visit to the town nearly two years ago, and the engine boasts amazing scalability that will allow even mid-range system owners to enjoy the adventure in a more than decent way, changing the parameters relating to the resolution, the aforementioned depth of field and the quality of the models. However, on the test configuration we were able to run Alan Wake at a resolution of 1920x1080 pixels, with all the effects at maximum and vertical synchrony activated (advisable, given the presence of a rather marked tearing effect) at values ranging from 40 to 60 frames per second, without ever running into particularly problematic situations. However, the technical sector of the Remedy title suffers from some small problems: in the first place, the contrast between the general graphic definition and some polygonal models (see the cars, especially in the initial sequences) or the cutscenes themselves, in fact less beautiful than the visuals in -game; secondly a bug that gives a ~shake~ to the virtual camera after each movement of the same, during the dialogues; finally, the impossibility of adjusting the audio of the films dubbed in Italian (the problem does not arise with those in English, we have verified), which is much higher than normal and can be really annoying. A problem already present at the time on Xbox 360, but that no one has bothered to fix, although it does not require who knows what commitment. It's a shame, because the sound of the game is really well done, with some excellent quality music and even a very good Italian dubbing (apart from Alice's voice..None", "date": "2012-02-20", "grade": "9.0"}