{"name": "Nathan nell'abisso di PlayStation Vita", "ref": "https://multiplayer.it/recensioni/99290-uncharted-labisso-doro-nathan-nellabisso-di-playstation-vita.html", "text": "Without a doubt Uncharted: L'Abisso d'Oro is the most eagerly awaited title among those accompanying the launch of PlayStation Vita, first of all because it represents the first spin off of a series that hasn't missed a beat on PlayStation 3, then because over the of the months our tests have strengthened the idea of having before us a very ambitious title for a laptop, both from a technical point of view and from a single player experience. After finishing the game in about 9 hours and 30 minutes through the 34 chapters available, we can state that the project developed by Sony Bend (those of Siphon Filter for PSP among others) enjoys several contradictions, ups and downs that do not allow it to reach the qualitative levels of its illustrious brothers, but considering the fact that it is a console launch title, it is absolutely worth considering. The control system of L'Abisso d'Oro is virtually identical to that of Uncharted ~from home~, with the back buttons to aim and shoot and the second vital analog to control a camera as always the flagship of the series. The change of weapon is delegated to the digital cross while the game makes extensive use of touchscreen controls both optionally and in place of the classic controls, and in addition to them. Among the substitutes there are some objectively not very useful, such as jumping or climbing, others that in our view may be more comfortable such as the slide on a series of ledges that allows Drake to automatically reach the final point by focusing on the landscape . The same thing goes for navigating the menus and for the possibility of using the PlayStation Vita motion sensor to further adjust the aim with the sniper rifle or the zoom of some weapons and the camera. Other touchscreen controls, on the other hand, are harmful and unfortunately break up the action, as in hand-to-hand combat when, after having given a couple of slaps to the bad guy on duty, you have to make some slides on the screen within a certain rather generous amount of time; actions that slow down the action and become boring after the first few occasions. Nathan new photographer Those who start a new game with Uncharted: The Golden Abyss will immediately find themselves at home for the aforementioned controls, for the type of action that offers a mixture of exploration, shooting, platforming and also thanks to the presence, among others, of Drake and Sullivan. That said, the developer has introduced a few ideas to differentiate the title from its predecessors a little: while exploring we experienced many more collectibles to collect and artifacts to locate to reveal the story that revolves around the game, which are often found in places away from the main road. The five sections that make up the main adventure are also accompanied by a certain amount of puzzles to solve and photographs of places of interest to take. In the latter case, you need to adjust the zoom and framing in exactly the same way as the requested photo. Fortunately, near a place of interest and unless you run wildly without ever stopping, a camera icon appears on the screen, which confirms that you are in the right place to capture a nice photo. As for the puzzles, all those we have encountered are linked to the touchscreen features of the console: some are mandatory to move forward, others to complete each section 100%. We have those related to the simple rubbing of palettes, their collection and composition, and others where there are gears to activate. Nothing too complicated but at least their resolution allows you to vary the gameplay for a moment. Unfortunately, however, the topical moments that made the series famous are few (such as Drake and Sullivan's river crossing) and the story never comes to life: it is limited to doing the homework and the new supporting actors (the Abyss of 'Oro is set before all other Uncharted) such as Dante or Chase have less charisma. Furthermore, their bond with the main protagonist is equally less developed also due to the narrative limits just described. Playstation 3 trophies Uncharted: The Golden Abyss offers 56 trophies, of which 2 are gold and 5 are silver. Their typology is extremely similar to the other Uncharted, in fact we have some related to killings with each type of weapon, to completing the game on normal, difficult and destructive, to some junctures of the story and so on. The slightly more peculiar ones are obtained instead by solving the various mysteries / puzzles, or by collecting all the numerous objects present for the game mapco. Exploration vs action Precisely for this reason the developers have preferred the adventure and exploration phase, with many plaform and object collection sections that work well as controls, are wide-ranging and more than the shootings. The latter are also very fun as per the tradition of the saga and show how PlayStation Vita can boast an excellent control system for any videogame genre, and which has an extra touch when using the touchscreen for grenades or for more precise aiming. Here too there is a ~but~: in fact, we did not like Sony Bend's choice to implement slower and less reactive opponents than usual, perhaps for fear of making the shootings too complicated for less savvy users with PlayStation Vita controls; the artificial intelligence itself has several inconsistencies and enemies often show their flank too easily and are not very reactive in the defensive phase. It is also a pity that the gameplay seems to be borrowed from the first two chapters and lacks the novelties of the third, such as Drake's animations contextual to the environment or the possibility of throwing the grenades back to the sender. Dulcis in fundo the longevity, the duration of the main adventure as written at the beginning is quite good for a portable game, and the industrial quantity of collectibles can stimulate you to face the adventure a second time, perhaps on a higher difficulty. Among the many there are bounties linked to some enemies, which materialize in the form of trading cards. Since some are very rare and difficult to obtain, there is an integrated mode with the game called ~Black Market~ through which it is possible to obtain them from other players thanks to exchanges at the point where the request is made. However, this feature is the only ~sense~ social element present in the game, since the multiplayer is completely missing. Nice but not amazing We have not forgotten the technical part. The bright colors, the polygons present in abundance and the artistic choices borrowed from the other chapters make the impact with Uncharted: The Golden Abyss absolutely exceptional. Too bad for the presence of a bit of aliasing and for a frame rate that is not always stable, and for the variety of settings that only include Central America and its forests at different times of the day and weather conditions, without encroaching on places completely different and unexpected as happened for home Uncharted. For lovers of comparisons, let's say right away that the distance, especially with the third chapter, is not small - we are talking in terms of definition, graphic effects, explosions and detail on the screen - but some artfully created artifices and the smaller and much more defined screen of PlayStation Life makes it seem less than it actually is. If we then restrict the field to portable devices, Uncharted: Golden Abyss is a new starting point in terms of graphic beauty. A final note for the dubbing which appears to be of excellent workmanship as per the tradition of the series but which suffers from the paucity of the story.", "date": "2012-02-17", "grade": "8.0"}