{"name": "Final Fantasy XIII-2", "ref": "https://multiplayer.it/recensioni/98515-final-fantasy-xiii-2-a-spasso-nel-tempo.html", "text": "Tested version: PlayStation 3Every time you are about to review a title of a certain importance, perhaps belonging to a saga loved by the public such as that of Final Fantasy, writing about it becomes a very delicate matter. Perhaps because it is universally recognized as the main brand of Japanese role-playing games, almost as a synonym, inevitably the boulder of high expectations weighs on each of the games in this series, with the gaming community from all over the world going into fibrillation waiting for news , day after day, minute after minute, as if an emotional shock were spreading from one continent to another. Therefore, examining every aspect of it, talking about it, also becomes a double-edged sword when the approach to a title in the series takes place when one is too full and one expects who knows what, and it is not even enough to work on it, as happened in this case, in two, nor be passionate about the series treated and the genre: every judgment or thought must be weighed and analyzed with a cold mind, before proceeding to the final draft. Accused of excessive linearity and of having distorted the very concept of a Japanese role-playing game, awaited by the most demanding fans hoping for a return of the saga to the right path, Square Enix's goal with this sort of spin-off is precisely that of smoothing out all the defects of the illustrious original, listening to the criticisms rained down on her from many quarters and avoiding a substantial collapse of the saga. Telling the story of Final Fantasy XIII-2 without running the risk of spoiling is almost a difficult undertaking; therefore, leaving the reader the pleasure of discovering it for himself by enjoying, even if unfortunately it is not entirely memorable, the events moment after moment, let's just say briefly that it is directly related to the events that took place in Final Fantasy XIII, since it restarts three years after those events and focuses on time travel and the figures of two 'new' protagonists, Noel Kreiss and Serah Farron, engaged in the search for the latter's missing sister, Lightning, and the way to change the atrocious and catastrophic fate awaiting their planet. Historia Crux and welcome returns Just the movements in the different historical periods, a theme that is not new in the Final Fantasy universe and repeatedly treated in previous works such as in the eighth chapter, constitute one of the first important innovations present in the Square Enix title in terms of gameplay. That linearity we were talking about at the beginning and which formed the basis from which most of the criticisms around Final Fantasy XIII then developed, becomes less marked in XIII-2. This is because the player is granted a freer approach to the adventure, consequently more complete and enjoyable to experience thanks also to the welcome returns to the city, mini-games such as slot machines, chocobo races or puzzles linked to paradoxes and temporal anomalies, non-player characters to interact with and to the ~shop~ where to shop, actually in the comely guise of a single itinerant merchant. Which, let's face it, makes the experience much more pleasant. The entire time travel system revolves around the Historia Crux, the system that allows you to visit every corner and period of the world with the help of specific portals. The key to being able to use these ~time gates~, also useful for saving or accessing the main menu, are particular artifacts to be recovered around the explored areas thanks to the powers of the Moogle Kupo!!!! ahem) accompanying Serah and Noel. Changing eras also change the climatic conditions or the constitution of the previously visited areas, with repercussions on the local flora and fauna, thus offering the user one more reason to return several times to the same area. Previously inaccessible locations can actually become so in another time period, revealing the hiding place of a particular rare object or the presence of some secret boss. And again, characters absent on a first visit can ~appear~ at a later time and give life to new dialogues or some secondary mission with the protagonists. Just during the sessions in which you have conversations with other people, a new feature implemented by the developers comes into play that allows the user to choose which answer to give to his interlocutor by selecting it from a block of four at a time. There are two types of conversations: those that can be defined as second level which do not affect the plot in the slightest, and have repercussions only and exclusively on the ongoing discussion with the character in front of you at that moment, and the main ones on the basis of which, depending on the answers given by the gamer, yesinstead, it directly affects the main story and the multiple endings (and not only that, but we won't go further to avoid spoilers) of the game, given that there are some key points that, based on how and when they are played, can have repercussions on they. It must be said, however, that on certain occasions these multiple choices interrupt the dialogues too often and become almost annoying, especially when you are not faced with those that do not affect the story / gameplay. Playstation 3 trophies Final Fantasy XIII-2 offers 32 different trophies of which 19 are Bronze, 6 Silver, 6 Gold and 1 Platinum. Many of them are obtained ~simply~ by completing the game while others are linked both to the classic collectible elements during the campaign, such as for example collecting a series of coins in the casino, collecting all the fragments or developing all the characters' skills, and al type and way of defeating some enemies, as in the case of the Trophy which requires you to inflict 99,999 damage with a single attack. Always dynamic battles Another element that has undergone changes, albeit minor, is the combat system, as always one of the hubs around which any self-respecting role-playing game revolves. The basic structure has remained almost unchanged compared to Final Fantasy XIII, but the developers have carried out an effective streamlining treatment on it to make the battles more dynamic and better manageable than it was possible to do in the past. As well as more interesting, as we will see shortly, thanks in this case to the implementation of a couple of new options. Mind you, this is not a revolution in terms of controls or playability, but anyhow, some improvements are noticeable. The clashes are random and quite frequent, with monsters suddenly appearing in the locations you are exploring. Precisely in these situations one of the new elements of the gameplay mentioned above is set. It is linked to an ability of the Moogle that accompanies Serah and Noel: it is a sort of clock-shaped indicator, which is activated when any enemy appears on the ground, together with a circle that delimits the attackers' range of action . The player thus has a few moments to decide what to do: he can escape by leaving that area or hit the opponent with a preventive action by pressing X before the above indicator reaches its limit. In this way, depending on the speed and effectiveness of execution, the user can, for example, send the opponent into Crisis status faster, weakening him to the point of subsequently inflicting a much higher amount of damage than would otherwise occur. Once projected on the appropriate screen, the fights take place in real time and are conditioned by the Active Time Battle and the Optimum. The first, always present on the screen, loads continuously, providing the player with a series of slots to fill with the actions to be performed by his alter ego, coordinating in real time with the other companions controlled by artificial intelligence. Optimum and instant actions The second, however, is none other than the old Paradigm Shift and allows you to choose formations and roles for the team, the strategies to use as well as set the artificial intelligence of your teammates, making it more or less aggressive. In fact, changing the type of Optimum also changes the functions in battle of the various characters and the actions they must perform. Thus, depending on the need, one can have an Attacking character and the other Occultist, or two Sentinels to protect themselves from a counterattack, and so on, by selecting one of the six special blocks in the menu. The union of what has been said is in our opinion a good compromise between immediacy and strategy that engages the user by asking him to logically manage the slots of the Active Time Battle and to modify the specialization of the party members according to need, exploiting as said a multitude of possible choices. To give greater variety to the most important battles in Final Fantasy XIII-2 we then think about the Instant Actions, which are nothing more than normal quick time events with the added freedom in certain cases to press one button rather than another, so to decide which attack to use. Their use is intended to make the whole thing more spectacular, even if they don't add anything new and are rather easy to complete. And given that many have complained of the excessive difficulty in some passages in the original, here is that Square Enix has decided to meet newbies who approach Final Fantasy by offering them a welcome option, that ofselect in advance at the beginning of the adventure the most welcome level between Standard and Easy, with a general difficulty in the latter case slightly calibrated downwards. Still on the subject of simplifications, if the leader of the group dies during the fight it will no longer be game-over like in FFX III. This time when the ~leader~ is killed the status of leader passes to another character and until he is killed too, you can continue playing. Monster and Co If the battle system therefore remains almost unchanged, the discourse for the management of the party is different, which instead presents various innovations. First of all Serah and Noel acquire experience to spend on a more simplified variant of the Cristallium of Final Fantasy XIII: the progression takes place in a completely linear way and each node that composes it asks which role to develop by increasing the relative physical and magical statistics, giving from time to time new skills or upgrades, until you get to level up. In the latter case, the user is asked to choose a ~reward~ that can affect the stats or, for example, improve the character's ATB bar. Speaking instead of equipment, in addition to the various replaceable weapons and always different power depending on the type, Serah and Noel have at their disposal four slots for the use of bracelets and accessories of all kinds, from those that protect from particular status to those which instead improve certain types of attacks; their use is determined in quantity and type by the availability or otherwise of a certain capacity expressed in points. Through the main screen you can also access the individual Cristallium of all captured monsters. Yes, because the other significant novelty of Final Fantasy XIII-2 is linked precisely to the possibility of deploying many of the game's creatures among one's ranks. The latter can be ~captured~ by the user provided he recovers a special crystal that is released by the creatures themselves once they are defeated. Thanks to the new Coalition function, these are inserted into slots to form teams of three elements at a time, to be subsequently included in the Optimum and therefore exploit their skills in battle where they act in support of the protagonists. In the same way, the leveling and growth system similar to that adopted for the main characters is applied, but only through the use of particular objects suitable for the purpose. If that weren't enough, you can also fuse them with other beasts to gain extra passive abilities. We particularly liked this new aspect of the title because we believe it can partially compensate for the lack of presence in the party of other characters in addition to the usual Serah and Noel, which still made us turn up our noses to tell the truth, but also increase towards the Both the level of challenge during the fights and the longevity are high, given that it takes a lot of time and a lot of experimentation to find the right combination of beings and create new ones. The art of Square Enix When used on the battlefield, the monsters behave as mentioned above as a normal ally and even have a special ability called instinctive technique, to exploit which you must first fill the bar of Bestial Instinct. The filling speed of this indicator can be increased by performing chain attacks or using particular objects and, once filled, a special move can be activated (with the square button) which varies from creature to creature and which is in turn related to gods quick time events. We have not forgotten the technical sector, where the graphics of Final Fantasy XIII-2 are based on the same engine as the original, slightly enhanced for the occasion, and the yield is therefore extremely similar. Therefore the speech made at the time for the thirteenth chapter is valid, and that is that the money, time and passion flowed into the project by Square Enix can all be seen, so as to make the game one of the most suggestive and satisfying as an impact in this generation of consoles. The realization of the environments is most of the time excellent, especially the urban-futuristic ones, while the lighting seemed improved to us. The models and the creation of the characters are equally of high quality and obviously pro-Japanese as tastes, the animations instead have ups and downs, especially the jump now always present but rather ugly to see. Obviously the title, beyond the non-interactive sequences, remains rather static in terms of effects and interaction with the environment, but this is a willy-nilly feature always present in JRPGs, which prefer aesthetic beauty instead of interaction. Even if discounted, spend two words", "date": "2012-02-02", "grade": "8.3"}