{"name": "Danza di spade", "ref": "https://multiplayer.it/recensioni/98150-soul-calibur-v-danza-di-spade.html", "text": "Tested version: PlayStation 3The last few seasons have seen a veritable invasion of match fighting games, declined in all sorts of ways. In addition to the return of historical franchises, such as Street Fighter, Tekken and King of Fighters, we have seen many ~minor~ titles, manga spin-offs and new IPs competing for our pads or rather our arcade sticks. A real golden age for lovers of moves and countermoves; in short, only Project Soul's white weapons were missing. After about three and a half years of reflection, Namco Bandai returns to impose its swashbuckling duels with a peculiar and immediately recognizable playability, capable of pleasing both the more technical and savvy users as well as those who ask for a spectacular and immediately fun and immediate. Legendary swords The game offer proposed by the developers is clearly divided between the offline and the online one. Leaving aside the training, the arcade (consisting of six clashes up to the boss, European or Western) and one-on-one, the solitaire modes engage us in the Story and in versus clashes, the latter against opponents of varying difficulty created with the complete and deep creation editor is in Legendary Souls which is unlocked under particular conditions and which represents a sort of arcade at a ~prohibitive~ level of difficulty, definitely challenging and not for beginners. The Story, called Story ~1607 A.D.~, narrates the events that took place seventeen years after those of Soul Calibur IV. Soul Edge has been destroyed, Sigfried together with the group of mercenaries Schwartzwind fight against the malfestati, or those contaminated by the sword devoted to the recovery of the individual fragments of the Soul Edge. Against the background of Europe in flames moves Patroklos Alexandra, son of Sophitia in search of his sister Pyrrha, kidnapped at a young age by her old acquaintance Tira. The story, twenty episodes long, unfolds through numerous twists and reversals of perspective, given that we will not only play the role of Patroklos, but also those of the mercenaries Schwartzwind, Z.W.E.I in primis and others, which we cannot reveal given the above spoiler rate. The casual user not particularly interested in the total narrative arc of the saga will most likely remain rather cold towards the story of the events, but the way in which the developers have tried to make the narrative as varied as possible is undoubtedly appreciable. Without forgetting the numerous and beautiful videos made with the game engine and the good implementation of the challenge rate that slowly rises up to the final battles, really difficult and which require much more than a simple button mashing. It will not be the main dish of the game offer, but it is still appreciable. We can only attribute to him a not excellent duration and rather sparsely drawn interlude scenes that clash not a little with the movies. Old and new friends The roster of characters is very large. The selection panel, including old acquaintances, new entries, pre-order wrestlers, unlockable characters once the story is over and those created from scratch, consists of thirty selection slots. As abundantly written in the preview, the most interesting ~new recruits~ are certainly Z.W.E.I with his wolf, the special guest Ezio Auditore perfectly in part in the title, unlike the Star Wars characters of the fourth chapter, Viola, with his sphere positionable at will useful for close shots even over the distance and the very fast ninja Natsu, complete with teleportation, if we can call it that. More generally all the characters are equally fun and immediate to use, thanks to the much reviled or appreciated button mashing of the saga, and also well balanced in their characteristics, so that pros and cons create a good general balance so as not to put in the hands of the player too powerful characters, cross and delight of many fighting games. From this point of view, a pentagon diagram of the statistics of each individual wrestler tells us at a glance who we are about to choose. Attack range (Reach), speed of movement, frequency of blows and power of the same and above all ease of use guide us in choosing the fighter. Everyone will find his favorite, in addition to the really satisfying new ones, the usual imperishable Mitsurugi seemed to be suitable for everyone, especially for novices, the reptilian Aeos, double ax and wings for devastating Critical attacks or Devil Jin, thanks to the creation through the powerful editor. Brave blades In terms of mechanics, there are many differences with Soul Calibur IV. Gone the Critical Finish, Project Soul introduced the Critical Edge and the Brave Edge. They are performed on loadingof the bar (Critical Gauge) placed next to that of energy, which is filled simply by carrying hits or parrying them, and can be a devastating special attack (Critical) or an enhanced version of ~simple~ special shots (Brave). The interesting thing is the ease with which they are performed given that the Critical are the same for all characters, or a double Hadouken together with the three attack keys (replicated on R2), while the Brave Edge, which vary from fighter to fighter, are usually made after a special attack followed by R2. It goes without saying that both are not instantaneous, the choice of timing is necessary, especially for the powerful Criticals, since they absorb all or a large part of the loading bar. On the defensive side, great emphasis has been placed on lateral movement, the so-called quick steps, to avoid ~flat~ or vertical attacks, while ~active~ parries are very important. Here again they are of two types, Guard Impact and Just Guard. The former (which are carried out by moving away from the opponent and pressing the three attack buttons) reward the player with the advantage of the open counter-move, with no loss of energy but above all with the lowering of the opponent's Critical Gauge. The second ones are limited only to the time advantage to execute a quick jab, which in any case should not be underestimated. All these new introductions, not particularly difficult to perform, while remaining a good initial practice, give the idea of being a viaticum to widen the catchment area of the game. Soul Calibur V as per tradition is not a particularly technical title, but which is capable of giving great satisfaction even to the most hardened geeks, and which above all as written in the opening immediately amuses and excites given its ability to be immediately rewarding. The new introductions work, as do the characters who are part of the franchise for the first time. Great moments of exaltation and pure pleasure are the order of the day. More than combos, special attacks, Critical or Brave, the thing we liked the most is the ease with which the defensive phase between active dodges and parries makes Soul Calibur V a real deadly dance with the characters moving fluidly graced by animations out of parameters without frame breaks or various hesitations. In short, speed and brute force make this fifth chapter really fun to play. Playstation 3 trophies Soul Calibur V rewards the player with 51 Trophies: 38 Bronze, 10 Silver, 2 Gold, 1 Platinum. The trophies touch all sectors of the game, and they engage us both online and offline. Most bronze trophies are obtained by performing particular moves, leveling up or creating a fighter. The silver ones represent, as it should be, a significantly more difficult step (reaching the level cap, winning all opponents in Quick Battle and so on) while the gold commits us to win 50 online games and complete the story. Platinum, as usual, is taken home after obtaining all the trophies. Intertwined souls On the multiplayer side, the main objective was to resolve the lag issue that had afflicted the fourth chapter, obviously without forgetting to add meat to the fire. In addition to simple online matches, dry or through customized tournaments, the introduction of the Global Colosseum is new, thanks to which it is possible to carry out random or classified matches with other players who contribute to raising our Rank. Rank not to be confused with the level, with the latter rising with playing the title in all its modes, both offline and online. The ranked matches are available for a few days a month, and only by challenging stronger players (or our equal) is it possible to climb the ranks, with a scale of values that goes from the lowest step E5 up to the maximum A1 (score that we also find in offline Versus matches). Very interesting is also the Soul Link, or a sort of Autolog in which it is possible to follow up to a maximum of three users to check their progress in each section, in short, to have an eye on all the information and statistics on some chosen opponents. We close the examination of the contents by talking about the deep editor thanks to which you can create your own character freely with the basis given by the fighting styles of the official roster. We can really mess with everything, the parameters are many and they also affect gameplay, given that height and build have a bearing on strength and speed. Once the physical model has been chosen, it is time to spend tens of minutes dressing it, starting from a basic equipment (ninja, samurai, pirate and so on) to poi change every single piece of clothing and accessory. Everything unlocks with progression; once the choice of the outfit has been completed, it is also possible to decide the setting of the voice, the type of visual effect linked to the shots and also the pose, backdrop and frame for the photograph. In short, there is a lot to enjoy. From a technical point of view Soul Calibur V is a real splendor. Character design, modeling, textures and backdrops are breathtaking. As per tradition, then every shot, every attack is underlined by a pyrotechnic explosion of flashes and bolts, especially Critical and Brave Edge, but above all what we liked most is the dynamic lighting system of the various stages that casts long shadows on fighters or colors them with the dim light of candles or the moon. A real feast for the eyes.", "date": "2012-01-31", "grade": "9.0"}