{"name": "Vanguard: Saga of Heroes - Recensione", "ref": "https://multiplayer.it/recensioni/vanguard-saga-of-heroes-recensione.html", "text": "Space for depth To deny that the release of WoW established a new standard within MMORPGs would be a lie. Aware of the current situation, the Vanguard developers have decided to take a cue from the Blizzard title on some aspects, especially related to the control and the interface, then obviously introducing the innovations that the game can boast of, also referring to previous experience of the developers, as we have already said mainly concerning EverQuest. If the criticisms addressed to WoW by its detractors predominantly concern the lack of depth and excessive immediacy, a sour note for RPG purists, Vanguard makes the exact opposite its workhorse, mainly addressing the hardcore gamers of the online role-playing game. This aspect of the rest is almost immediately noticeable when starting the game, where in the character creation phase it is possible to choose between 19 races and 15 different classes (divided to meet the gamer in 4 ~superclasses~: protective, healers, offensive and casters), to then customize the appearance of your virtual alter-ego in one of the most complete editors ever seen in an MMORPG, given that any aspect of the body, even the tiniest and most seemingly insignificant, can in fact be modified. Vanguard therefore inherits the control system from WoW in a fairly direct way, which implies the possibility for the vast majority of players to know how to move within Talon from the very first moments, a speech that is also valid for familiarity with the interface of game, completely similar to that of the Blizzard-branded MMORPG, both as regards the graphic elements and their arrangement, and for the possibility of modifying the quantity and position of the slots dedicated to skills on the screen, a welcome feature implemented by Sigil. Set yourself free The phrase that is the title of this paragraph is the same one that has been heralded on the 4 winds over the past few months, spent waiting for the release of Vanguard. Indeed, the impression one gets, right from the first moments following entering the world, is precisely that of vast and boundless spaces, an impression that is then comforted when one has the opportunity to venture across the territories, and not only : unlike WoW, it is in fact possible to explore practically all the waters present within Talon (it is even rumored that there are islands not marked on the official maps) provided of course that you own a ship, in the ways we will talk about later . Another difference with the Blizzard game consists in the absence of ~fast transports~, such as various teleports and predefined flights: a choice that could be unpopular but which shows in an explanatory way what are Sigil's intentions for this game, linked to the desire to make even a simple trip a memorable adventure. Speaking of means of transport, in addition to ships and the classic terrestrial mounts, we also find flying ones, to which the caravan system is added: guided by a single player, with a maximum of 5 other passengers, they allow you to move through the territories with a series of checkpoints, upon reaching which all the characters belonging to the caravan have the possibility to log out and subsequently resume from the point where the last save was made. To move between the 3 continents (Thestra, Kojan and Qalia) there is therefore certainly no shortage of means, which will be accompanied by the desire to discover a vast and surprising world, similar to what was seen in the The Elder Scrolls series. the impression one gets, right from the first moments following entering the world, is precisely that of vast and boundless spaces Set yourself free Vanguard tries to intensify the relationships between the players in more than one way: first of all, the possibility of constructing buildings on certain terrains has been introduced, thus giving players the possibility to create real guildhouses, fully furnished as they already were possible in the days of Ultima Online. Another decision that has caused discussion, provides for the complete lack of instanced world parts, to be clear like all WoW dungeons that are replicated for each group that enters them: the development team has repeatedly stated that this decision will not problems of any kind, given the vastness of the dungeons and their number. It is clear that in this game the main component of the gameplay concerns PvE, although it can count on PvP servers, as well as others of the RP type, for those who want to try an even more engaging gaming experience. Ramifications Players find themselves very prei'm faced with the division between adventuring, crafting and diplomacy. As for the first, there isn't much to say as it is the classic process of leveling up (by the way, the maximum is 50) through quests of various types, ranging from finding particular objects to killing of a certain amount of enemies of a certain species: in this regard, although the fights in Vanguard are quite close to the usual standards, it is worth noting that it is possible to invoke non-immediate spells when on the move, as well as perform a whole series of moves linked to the opponent and the possibility of reflecting his damage. From this point of view, the tank's ability to explicitly select a member of its party to protect, physically placing itself between him and the attacking creature, is particularly interesting from a tactical point of view. In addition to the classic questing, we find the crafting system, which is also broadly similar to the MMORPG standards, but defined through a series of quests, however called in this case Work Orders, and which when completed allow you to increase skills, obtain money and tools necessary to continue in the process of specialization in the chosen job. It must be said that crafting (as well as diplomacy, which we will see shortly) is completely untied from the rest of the game, which translates into the possibility for a player to become a skilled crafter without continuing excessively in adventuring, a bit ' like Ultima Online where you could ultimately choose to create a character whose sole purpose was to work hard; not to mention that in order to obtain a ship it will be necessary to rely on the skills of the crafter figure. Ramifications So here we are at one of the strengths of Vanguard: diplomacy. Inspired by the developers' own admission to the figure of Gandalf, appreciated in The Lord of the Rings, it translates into an in-game card game called Parley, in Magic: The Gathering and similar style, where each card represents a kind of argument with lots of costs and effects acting on the opponent's score. Although it may seem like a secondary aspect, diplomacy allows you to obtain benefits for yourself and for your entire party, as well as quests that are not accessible through the normal routes. [...] diplomacy. Inspired by the developers' own admission to the figure of Gandalf, appreciated in The Lord of the Rings, it translates into an in-game card game called Parley, in Magic: The Gathering style Technically speaking Crossing the territories of the 3 continents is certainly an excellent videogame experience even from a visual point of view alone, as one is often left speechless even passing through places already visited: the unmistakably realistic style, far from the cartoony one of WoW, contributes to give the game that atmosphere of depth and realism. But all this has a price: on the system where it was tested, Vanguard did not make a huge impression in terms of performance, showing all the heaviness of the Unreal Engine 2, which it uses. Although great strides have been made with significant optimizations compared to the beta and at the time you read the development team is at work trying to further improve the client, the game proves to be decidedly demanding in terms of hardware requests, with servers which primarily give the impression of not being able to manage the quantity of connected players: the cause of this is certainly in part the choice not to instantiate any part of the world, combined with the enormous vastness of the same, on which we find a number of elements bordering on infinity considering also the active management of ships and flying mounts. In the light of what has just been said, the graphic one seems to be the worst aspect of Vanguard, given that as regards the sound we have a respectable soundtrack that accompanies the player in a contextual way. System requirements Minimum Requirements: Processor: 2.4 Ghz Intel or 2400+ AMD RAM: 512 MB Video Card: 3D 128 MB RAM, Vertex Shader and Pixel Shader 2.0 compatible Disk Space: 20 GB Internet Connection: 56k Recommended Requirements: Processor: 3.0 Ghz Intel or 3500+ AMD RAM: 2 GB Video Card: 3D 256 MB RAM, Vertex Shader and Pixel Shader 2.0 compatible Disk Space: 20 GB Internet Connection: ADSL Test Configuration: Processor: AMD 64 X2 3800 + RAM: 2 GB Video card: NVIDIA 7900 GT Internet connection: ADSL Conclusions Vanguard is a very high-level MMORPG, which very well meets all the expectations placed in it during the past few months. In comparison to WoW it definitely pays off in termsof charisma, while from a technical point of view we have seen how, while drawing from the baggage of the standards of its genre, it is able to introduce (and re-introduce) novelties closely linked to the gameplay, which are more than suitable for making the experience deeper gameplay than other online RPGs. Despite the problems relating to performance even on fairly updated systems (which we hope will be resolved by Sigil Games over the next few weeks), we therefore have a possible antagonist to the game of the moment, on the one hand, while on the other product whose depth itself could be its greatest defect, within a market now standardized on WoW also in terms of immediacy and ease of insertion in the persistent world. As usual, the community of gamers will decide which of the two will win: as far as we are concerned, we can tell you that Vanguard is an excellent product, the result of many years of experience gained in the field by its developers and equipped with a fairly engaging gameplay. with the only real flaw concerning the lack of an Oscar-worthy narrative of fantasy.Pro Great choice of races, classes and appearance for the character Ships and houses all for us! Very deep Cons The same depth could be a deterrent for casual gamers Performance to optimize From EverQuest to Vanguard To many people the name Sigil Games will mean practically nothing, especially when compared to more famous developers within the MMORPG genre. Yet, as those most attentive to the evolution of the gaming industry will know, the development team in question can count on an excellent staff, with excellent experience in the field of online role-playing games, starting with the two founders, Brad McQuaid and Jeff Butler, key figures in the creation of one of the most acclaimed MMORPGs ever: EverQuest; the rest of the team is no less, given that within it we find members who have participated in the development of titles such as The Matrix Online, Star Wars Galaxies and City of Heroes. From here you will understand why Sigil Games immediately started to do things seriously, without wasting time on preambles and presenting to the public a title capable of competing with the Goliath of its kind, now permanently identified in World of WarCraft. This is how we therefore find ourselves evaluating Vanguard: Saga of Heroes, co-produced by Sony Online Entertainment and released just 14 days after the release of the first expansion of Blizzard's MMORPG, a further element confirming the belligerent intentions of SG and SOE in the his comparisons.", "date": "2007-02-16", "grade": null}