{"name": "Monark", "ref": "https://multiplayer.it/recensioni/monark-recensione.html", "text": "Since the first videos, Monark has wanted to wink at a very specific and, almost paradoxically, increasingly growing group of users. If we had to find one of the many merits of Persona 5, we would certainly choose to have sensitized many new players to the genre, captured by the most recent Atlus masterpiece and therefore looking for a new JRPG with a school setting. It is therefore no coincidence that behind the title there is a series of figures already known for their work on Shin Megami Tensei, of which Persona is a spin-off: the intention of the studio, which made use of the ubiquitous NIS America for publishing, was probably precisely that of capitalizing mainly on these ~new generations~ of enthusiasts, convinced that they want to give a second chance to a genre that Persona has helped to refresh. Follow us in the Monark review to understand if the operation was successful or not. Shin Megami inside Setting, playful flow and atmosphere are successful features in Monark Although the trailers winked at Persona, it is difficult not to find very big similarities between Monark and Shin Megami Tensei: Monark takes place within a single, claustrophobic location - coincidentally, a school - and does not present particular sequences or social interactions . The atmosphere of the title, on the contrary, is rather gloomy and gloomy and the plot has many mystical and esoteric elements at its core. It must be said that what convinced us, in terms of writing, rather than the plot itself, was the characterization of the characters: supporting actors and non-player characters are all written in a profound, multifaceted and interesting way, a fundamental characteristic for a JRPG in which exploration, we can say, is certainly not one of the strongest elements. Just like in some Shin Megami Tensei the protagonist is without his own personality, a pure tool to immerse the player, who will find himself together with other members of his school in a nightmarish situation: his institute will be trapped in a supernatural fog and he will have to explore an alternate dimension to find a way out. Premises not exactly innovative but with an interesting development thanks to the characters: the cast is at the center of the list of positive elements of the software. In addition to the elements of the party, literally dozens and dozens of other personalities will meet - more or less important and marked - but each with its role, its ambiguities and its moral and character dilemmas, helping to create a credible and stimulating social ecosystem. Hybrid combat Monark's combat system works, is challenging and will entertain even those who come from a long history of JRPGs It seems a coincidence having played it on Switch, but the combat system is also a hybrid, in this case of elements already seen but which all in all work, presented in an original way. We are not in a classic turn-based system, but in a sort of fusion between real-time and turn-based strategic combat: basically, each of our fighters on the field can be moved at each turn, freely and for a limited time. It will therefore be essential not only to select the right targets, but also to arrange the group in the most efficient way possible both for the attack and defensive phases, not dispersing but at the same time not becoming cannon fodder all together. Speaking of teams in the field, in addition to the human counterparts of our protagonist we will be able to control demons who, as per tradition, will evolve, strengthen and give us an ever greater possibility of manipulating the fights in our favor. Avoiding going to list all the elements, the clash management system convinced us: not always perfectly balanced, difficult in some initial stages and not always very fast due to its very form, it offers a certain freshness on the genre that we have not seen for a long time, not even in some more substantial genre cousins in terms of production. Without shyness, in some facets it reminded us of some classics like Vagrant Story. Surely for fans of the genre now accustomed to the classic shifts and exploitation of weaknesses and resistances, being able to exploit the battlefield in its entirety becomes a welcome strategic element and very fun to manipulate, but the progressiveness of its nature, over time, will tend to displace the less accustomed a little. Enough art The cast of characters is a point in Monark's favor, too bad the same thing cannot be said of the technical sector Monark has mid-level art direction. It's nothing ever seen, mind you, but the design of the alternate dimension, the demons and the general atmospherethey manage to have a cohesive tone, with blue and purplish hues, which can actually leave you pleasantly surprised. Unfortunately, everything is slowed down and held back by an inadequate technical sector, especially in the definition of the models, which damages the character design itself and constantly leaves with a bitter sensation in the mouth, that of playing a title that perhaps dared too much to then not being able to have the resources for his ambition. It is a medium-low level production and it shows, exactly like many Japanese titles before it: it now seems almost a Japanese philosophy that belongs to this type of product, too small to have resources to invest in the technical part, too large to limit the ambition of its vision and the past of its creators. The fact is that we are used to this reading of the Japanese JRPG which chooses to field ideas and setting, overwhelmingly leaving the technical sector behind. We've lived with it for years and we're aware of its market, but thinking about what this genre represented in the 90s, a little bitterness remains.", "date": "2022-02-16", "grade": "7.4"}