{"name": "Cold Winter", "ref": "https://multiplayer.it/recensioni/cold-winter-2.html", "text": "From China with fury The protagonist of the events narrated is the agent of the MI6 agency Andrew Sterling, who during a mission was captured and deported to a Chinese prison. After enduring the most brutal torture ever conceived, Sterling is incarcerated awaiting execution on New Year's Day. However, on December 31, Kim, another member of MI6, infiltrates the prison and manages to make his colleague escape safely. Once free, Andrew is offered a new job, which the agent accepts despite his murky past experience. It goes without saying that the fate of the world will be entirely in the hands of our hero: in fact a terrorist organization threatens all humanity with very powerful nuclear weapons, and it will be up to Sterling to foil the evil plan. Surely the plot of Cold Winter is not the maximum originality, presenting itself as one of the most classic ~spy stories~; however the purely cinematic setting, characterized by various cut scenes composed of realistic and compelling dialogues, not to mention the inevitable twists and turns, make the narrative plot worthy of interest. Furthermore, the facts will lead us to visit many places in the world, such as the aforementioned Chinese prison, the Grand Canyon, the exotic lands of Asia, military bases and icy plains. A cold winter and...armed to the teeth! The first thing to report concerns the extensive interaction with the surrounding environment, which can be compared to that of Half Life 2. Sterling can take advantage of anything that comes within range: for example, a table can come in handy for creating a shelter against bullets from enemies, while bottles, chairs and crates can be thrown at opponents. Everything happens in a simple and immediate way, since when we approach an object a menu appears that allows us to select the action to be taken with the chosen material. Another interesting thing is the possibility of creating tools and weapons by combining various elements found in the corpses (the enemies can be ~searched~ once they are deceased) or in the places we visit: so if we need a lock pick to open a locked lock, just access to the inventory, combine the appropriate objects, and here we have what we want! As far as Sterling's armory is concerned, it is really extensive, being made up of more than twenty weapons. Among the means of destruction Cold Winter includes pistols, machine guns, rocket launchers, grenades, Molotov cocktails, smoke bombs, sniper rifles, and even a flamethrower! Unfortunately you can only carry two weapons at a time, so you need to make the right choice at the right time. Although the gameplay has some interesting features, it must be said that unfortunately these elements affect the economy of the game in a superficial way. This happens above all due to an extremely deficient AI of the enemies: the terrorists often and willingly behave like authentic target practice, remaining completely immobile in the same point so as to constitute all too easy prey. Therefore most of the time instead of building shelters or using who knows what tactic we can always attack the opponents in the same way and survive peacefully, except for rare occasions. Furthermore, the medikits available are infinite, and there are plenty of armors, so things get extremely simple. We add to all this the repetitiveness of the action, mitigated very little by the optional objectives proposed in the missions. As for the control system, it is overall immediate and intuitive, even if the annoying problem of not too precise aiming, which afflicts almost all the fps of the Ps2, can create some problems. The multiplayer Fortunately, the programmers have thought of including multiplayer, which can be used both offline and online. There are 6 game modes, including the classic deathmatch and team battle, while there are 12 maps available. Of note is the massive number of selectable character models. If you don't have a modem available, you can still play with friends using split screen for up to four players. Technical Analysis The visual sector of Cold Winter has two faces, where the many goodies are contrasted with a superficial care of some graphic elements. On the one hand we find an excellent physics of the objects, endowed with good realism: the bodies of the enemies fall in a different way depending on the point where they are hit, and also the elements of the surrounding environment react to the events in a plausible way (try to see how the walls crumbleafter an explosion!). The various graphic effects are also good, especially the water and smoke effects. Unfortunately, the same cannot be said for the settings, made up of a medium-low number of polygons, not very detailed and often angular, while the textures appear dull and conspicuously dated. The frame rate always remains on a good level of fluidity, except for some slight slowdown in the most chaotic phases. Regarding the sound, we find quite pleasant music tracks to hear, even if not very present in the game, and standard sound effects. On the other hand, the dubbing is excellent, characterized by voices well suited to the part and dialogues seasoned with the usual expressions of the spoken language. Comment Cold Winter could have been a much better title than it actually is. The plot, albeit not very original, still keeps the player's interest alive, and some ideas proposed are potentially excellent, but having been poorly implemented they fail to improve a gameplay affected by the poor AI of the enemies and the monotony that occurs after some time. In any case, if you desperately want a shooter you could also give it a little thought, without expecting anything sensational. Too bad anyway, because with a little more attention the Swordfish product would certainly have obtained a much higher evaluation. Pros Good plot Lots of weapons available Extensive interaction with the surrounding environment Cons Graphically poor Enemy AI In the long run repetitive In December 2004 Killzone landed on the market, an FPS labeled by many voices as ~Halo killer~. Although the Guerilla product proved to be a good title, it still failed to surpass the Bungie title, but above all it reaffirmed the poor feeling of the black monolith with the shooter genre. Now from Vivendi Universal comes Cold Winter, developed by Swordfish studios, which, unlike Killzone, has caused little fanfare.", "date": "2005-07-12", "grade": null}