{"name": "Dustforce", "ref": "https://multiplayer.it/recensioni/97894-dustforce-pulire-non-e-mai-stato-cosi-bello.html", "text": "The scene of independent developers is no longer a surprise: in fact, more and more games from the indie scene are able to find a special place in people's hearts, even at the expense of much more expensive and publicized productions. One of the striking examples was in the past Super Meat Boy, a platform released in 2010 and loudly acclaimed by both critics and the public: Dustforce is clearly inspired by the effort of Team Meat, a project by Hitbox Team on which the spotlights have shifted during the last few months, since it was singled out as one of the most interesting projects of this 2012 also thanks to the acknowledgments obtained since the development phase. The similarity to Super Meat Boy though, has often been seen for the effort of Hitbox Team as a double-edged sword: if on the one hand the fiercest fans of the first could find in Dustforce a valid alternative to their favorite piece of meat, the other side of the coin is constituted by the risk to field a carbon copy and little more. To find out how things stand, all you have to do is continue reading, holding a broom and dustpan... or at most a vacuum cleaner! Cleaning first Dustforce presents itself as a two-dimensional platform completely based on action and frenzy of movement, which as we are about to see constitute a cross (little) and delight (a lot). The goal is to clean up the whole area that makes up the level, passing with the character on the dirt that is present there: easy to say and a little less to do, given that with movements worthy of the best parkour it is necessary to walk both on vertical walls than upside down. As if that weren't enough, in addition to pitfalls of all kinds intrinsic in the crazy design of the levels, there are also enemies ~possessed~ by dirt, and therefore intending to put a spanner in the works of our cleaner alter-ego, forced in turn to hold the broom also to free these characters from their filthy captivity. The beginning of the game sees us catapulted into a somewhat particular hub, halfway between the level and the menu, within which it is already possible to start breathing the excellent air of which Dustforce is made: of course, it is possible access a more than exhaustive tutorial, in which all the mechanics of the game are explained in a clear and immediate way. As with the tutorial, to access the various levels you need to go around the hub by entering the doors that are around. Some of them are accessible immediately, while others can be unlocked by obtaining deserving scores in the levels previously addressed. It's a dirty job, but someone has to do it For the more savvy, what is described in the previous paragraph will probably have already suggested where we are going: the competitive aspect is one of the main components of Dustforce, both towards oneself and towards the other players. In fact, each level contains a series of parameters to which scores correspond, which can be compared using the appropriate leaderboards: the possibility of seeing videos relating to the high scores achieved in the various levels is also particularly interesting, especially useful for understanding how to improve yourself by looking at the performance of others. Hitbox Team's attention has therefore not been directed only to the progression of the game understood in terms of novelty in the settings (the levels available are in any case in good number and very different from each other), but above all to the need to constantly improve oneself, getting high scores to show off online. To do this, a parameter called Finesse has also been introduced, increased by the combo score obtained during the course of the game: the greater our skill by carrying out different actions in a chained way, the higher the score. It is therefore immediate to understand how it is frequent to repeat a certain level even due to a single error, but fortunately the developers come to meet us with some design decisions. For example, the protagonist can be hit or ~die~ an unlimited number of times, obtaining the penalty of losing the combo points accumulated up to that moment but still being able to continue the action without having to restart the scheme. Note how you never find yourself dealing with technical problems, thus leaving everything firmly in the hands of the player's skill alone. A learning curve to acquire a certain fluidity in the movements is obviously necessary, but once you become familiar with Dustforce the level of satisfaction in successfully completing a level will be high. The combat system offers two types of attacks, a lighter one and a heavier onente, which also contribute to increasing the score. There is also the possibility of using a special attack when the relative bar is at its maximum, and thanks to which you can beat all the enemies on the screen in one fell swoop. Smear in company The Dustforce multiplayer mode concerns, at least for the moment, only the local game. The flagship is the King of the Hill typology, within which up to four players at the same time give each other a thrashing by leveraging the extreme design of the environments: the goal is to conquer the level divided into two teams, of which the first has to clean the various surfaces, while the second smears them. However, Hitbox Team's projects for Dustforce's multiplayer are only at the beginning, given that there has already been talk of online mode: given the additional commitment required by this component, the developers set out to complete the single mode first and the local multiplayer, postponing the one via the network to a second half which hopefully will materialize shortly. Even dirty is beautiful Dustforce moves on 2D scenarios in parallax, also recalling Super Meat Boy with its own graphic style. Defining Hitbox Team's work as a copy would certainly be ungenerous for those who worked on this game, placing an almost obsessive attention to detail: from the design of characters and enemies to the animations, everything is appreciable above all thanks to the excellent pastel style fresh and pleasant, capable of being one of the hallmarks of Dustforce. Also welcome is the possibility of choosing which one to play among the different protagonists made available to us, although it is more of an aesthetic choice rather than an effective change in the style of play. Absolutely no less is the sound, within which once again the developers have not overlooked anything: each level has its own particular effects and noises related to its type, beyond the obvious ~sweep~ made by the main character. There is also a thick soundtrack, able to validly assist the action, that is, instilling that mix of adrenaline and concentration necessary to overcome the most agitated phases of the game.", "date": "2012-01-18", "grade": "8.8"}