{"name": "Una luce tra le tenebre", "ref": "https://multiplayer.it/recensioni/97569-lumi-una-luce-tra-le-tenebre.html", "text": "Version tested: iPadThe crazy world of platformers, which has always been synonymous with absolute fun on any platform, is rightly reliving a particularly intense phase of splendor in the latter period, thanks to the arrival on the market of important titles such as Rayman Origins and, above all, the highly anticipated Super Mario 3D Land. Even on Apple portable devices, the genre enjoys moderate health and a good catchment area, despite the difficulties in touch controls that typically afflict similar productions. However, the watchword is, as always, optimization: only an original product designed to work natively on iPhone, iPod and iPad screens can give its best. In this sense Lumi HD is in fact yet another full confirmation of this theory, thanks to a particularly accurate control system but not only. Fighting against the darkness When the world of Lumi HD is in danger of being completely shrouded in shadow, the only hope is placed in a small but tenacious yellow creature, known as Lumi, capable of emitting a small amount of its own light. To bring the situation back to normal, Lumi has the thankless task of searching through all ten levels of the game for small luminous butterflies, indicated by a counter located at the top left of the screen; fifteen of these fluorescent bugs allow you to reactivate one of the trees of light scattered around, which will illuminate a large portion of the level. Once again, therefore, the eternal dichotomy between good and evil is presented, represented precisely by light and darkness, rendered on this occasion with a decidedly fairy-tale but not infantile tone. Indeed, analyzing the level design choices, the forests, deserts, caves and all the environments present in the game manage to convey even a mild feeling of unease, promptly calmed down when the various trees of light are activated. To finish a level and move on to the next, it is necessary to light up at least three trees (i.e. you have to accumulate forty-five butterflies) but on more than one occasion this threshold proves to be insufficient: in fact, it will happen that you will necessarily have to find all the luminous insects, even those that are freed by killing an enemy, in order to activate the end-of-level portal. But there is also a particular boss battle, which in its development recalled the hilarious ~fast-scrolling~ levels that occasionally appeared in the famous two-dimensional platform Oddworld, starring the mudokon Abe: essentially instead of the usual exploratory phase, you will have to escape as fast as possible from a relentless bird, using magnetic centers and electric trails. In fact, magnetism and electricity are the two tricks used in the development phase to allow the little Lumi to move otherwise unthinkable: the funny creature can basically perform only a few simple actions to perform thanks to the excellent control system, i.e. moving on a flat surface ( using a virtual analog stick at the bottom left) and jumping, with a tap on the right action key. The magnetic vortices, located in strategic points to be able to reach the highest platforms, give the possibility of anchoring and exploiting them as a sort of launch ramp or slingshot, thus launching oneself in succession towards the next vortex or until the interested area is reached; the electric trails allow instead to be crossed in a hurry, while at the same time buying speed. Despite the apparent cumbersomeness of the controls and powers listed up to now, everything takes place, once you have grabbed your device, in such an intuitive way as to seem natural: you almost don't need to read the different explanations for the new movements to learn, the context and instinct will guide you to perfect learning of Lumi's movements. A small clarification deserves the ability to return fire from an enemy: in the second part of the stages, in fact, some small monsters can shoot lethal bullets; however, again thanks to magnetism, it will be enough to press your finger directly above the protagonist to hook the shot fired and thus send it back to the sender. Despite the certainly not high number of levels, the replayability rate of Lumi HD is guaranteed in the short term by the possibility of turning on all the trees of light, even those not necessary to finish a level, and by the achievement of all Game Center objectives. In the long run, however, constant support from the developers was guaranteed, with new levels and modes. The last pleasant note of merit goes to the technical sector, with highly detailed backgrounds in high definition and pleasant background musicand apt, which contributes to making the game environment magical. The tested version is 1.2 Price: 0.79 (on offer, then 2.49) App Store links", "date": "2012-01-12", "grade": "8.2"}