{"name": "Un amabile copione", "ref": "https://multiplayer.it/recensioni/97370-stretched-un-amabile-copione.html", "text": "Tested version: iPhoneIf we were to rummage in the App Store looking for a game similar to Stretched, the search would probably stop with the fascinating Contre Jour, and not just for its mechanics. In fact, the two puzzle games published by Chillingo share the ability to recycle and mix elements and concepts seen in some already known hits, starting from Angry Birds and arriving at Cut the Rope, not to mention some obvious stylistic references. In the case of Contre Jour, however, an extremely elegant audiovisual component gave the game a fairly unique and recognizable personality, avoiding presenting itself to iOS users as a huge and clumsy smoothie. So we spent a lot of time playing Stretched, curious to find out what the strengths and weaknesses of the new Chillingo hybrid are this time. A sweet and sour smoothie Created by a trio of Russian developers, Stretched is a puzzle game that makes extensive use of the iPhone and iPad touchscreen through a series of more or less successful puzzles, in which the aim, in a very unoriginal way, is to lead a small orb towards the exit of the level. The game takes a while to get going, also because the first scenarios do nothing but borrow the possibility of throwing the protagonist from one side to the other in a very similar way to the aforementioned Angry Birds. In some cases the player is asked for such precision as to make several trial & error moments necessary, but fortunately new and fun mechanics are introduced just before the experience becomes excessively frustrating. Level after level, puzzle after puzzle, you find yourself activating fans or moving platforms, balancing trampolines and rotating mechanisms, exploding blocks or using sticky creatures to attach the sphere to some surfaces: all the puzzles revolve around the excellent Box2D physics engine, the same, so to speak, used by the vast majority of iOS games (including Angry Birds). It is precisely in the ability to always propose new and original ideas, capable of never tiring along the beauty of 80 game levels, that Stretched flexes its muscles. Each scenario contains bubbles that must be collected and which determine the final score with the classic three-star system, while the ability to freely skip a puzzle ensures that you never get stuck. However, this does not mean that the player is free to reach the end without any effort, since a certain amount of stars is required to access the more advanced game worlds; a paid DLC allows you to unlock them all immediately, but it is so difficult to get stuck or fail to get the required stars that it is an absolutely senseless expense. By now those who have played Contre Jour will no doubt have noticed a large number of similarities, but where the puzzle game developed by Mokus sported a graphic style and a soundtrack of Serie A, Stretched fails to ape World of Goo, replicating some elements characteristic but proposing a much poorer version. The stylistic differences between one world and another are limited to a change of backdrop and little else, while the same goes for the audio effects and the soundtrack, whose songs seem to emulate the splendid magnum music in a not too subtle way opus by 2D Boy. And it's a real shame, because what seems like a disengagement rather than a tribute inevitably ends up highlighting the fact that Stretched draws on every aesthetic and gameplay idea right and left; it's a real shame, above all, since some puzzles are so successful and interesting that very little would have been enough to give the game greater dignity. However, the obvious ~Coming soon~ that dominates the levels screen leaves little doubt that the developers will continue to support the game in the coming months, and at this point the hope is that the new worlds will enjoy greater stylistic care and originality in the mechanics. The tested version is 1.0.1 Price: 0.79 App Store links", "date": "2012-01-11", "grade": "7.5"}