{"name": "LostWinds", "ref": "https://multiplayer.it/recensioni/97491-lostwinds-il-vento-tra-le-dita.html", "text": "Version tested: iPhone Released in 2008, at the dawn of the WiiWare digital delivery service, LostWinds has in fact remained one of the best titles on that platform to date, and this already puts its release on the App Store in a very positive perspective. It is a rather rare example of balance between aesthetic form and playful substance, which combines a graceful graphic-sound lyricism worthy of the most inspired independent productions with a structure based on convincing and not obvious gameplay ideas. It tells the legend of little Toku and Enril, the spirit of the wind, both engaged in an attempt to block the threat presented by the return of the perfidious Balasar, a mythological demon imprisoned for centuries in a magical stone. The graceful graphic style, equipped with oriental hints and references to pre-Columbian and Asian architecture and art, together with the light and typically fairy-tale narration make LostWinds a real interactive fairy tale that unfolds by distributing itself proportionately between dialogues, cutscenes and above all exploration of the game world. A balanced hybrid of platforming and puzzles, a structure that some define as ~MetroidVania style~, obviously referring to Metroid and Castlevania. The elements in common with these illustrious precedents are in fact clearly visible: starting from the 2D platform mechanics to arrive at the particular structuring of the world consisting of a single environment that can be explored by traveling in different directions, characterized by different scenarios but all connected to each other with the possibility of progressively accessing further sections of the scenario by unlocking new skills. Toku's feat is certainly epic, yet the beauty of LostWinds lies in its ability to always remain on a relaxed and relaxed tone, entrusting the load of the challenge to the level design and maintaining the constant impression of experiencing a first-person fairy tale. The wind as a friend The game is based on the coordinated action of Toku and Enril, the former acting as the classic protagonist of a platformer moving on the 2D platforms to one side or the other of the screen, the latter instead represented by a sort of cursor able to cause gusts of wind of variable intensity and length. The latter, originally controllable via the Wii Remote, has been transposed entirely on the touch screen in this version, with the possibility of brushing the winds directly on the screen using finger movements. In this way, while little Toku runs around the screen, we can raise him and push him into the air making him reach platforms otherwise unreachable with his small jumps thanks to Enril, or move stones, feed flames to burn elements of the scenery or move the course of water , activate ancient wind contraptions, or overwhelm enemies attacking the adventurer. The coordinated dynamics, which has garnered wide acclaim in its original version, fails to give its best on the touch screen of iOS devices: the choice to have Toku move through a sort of point and click system instead of directly managing its movements is a necessary compromise in order not to have to run into obnoxious ~virtual~ controls on the screen but it tends to be confusing, while the extreme precision required in the execution of the touches to obtain the desired effects from Enril makes the game even frustrating in some particularly demanding phases. However, these are not decisive defects if you are capable of being captivated by the magical and ~airy~ atmosphere of this Frontier title, which within the offer for iOS still proves to be a video game developed for dreamers, but above all for gamers , and that's not much. The tested version is 1.0 Price: 2.99 App Store links", "date": "2012-01-09", "grade": "8.0"}