{"name": "Questioni di punti di vista", "ref": "https://multiplayer.it/recensioni/97325-blueprint-3d-questioni-di-punti-di-vista.html", "text": "Tested version: iPhone Geological eras seem to have passed since when for puzzle lovers there was only the ~Enigmistic Week~ (or its clones), made up of classic crosswords, rebuses and various riddles. However, the less young reader will remember that the funniest moment when the historic magazine arrived at home consisted in discovering the figure hidden under the ~Connect the numbered dots~ game: a few seconds of waiting and the particular figure chosen for that week appeared definitive (and edgy) before your eyes. Beyond the undoubted fascination associated with paper and pen, the joy of discovering hidden images in a more or less articulated way exists and thrives even today even though the approach moods inevitably change. In fact, Blueprint 3D flawlessly exploits the perfect iPhone and iPod touch screen to reproduce those same magical sensations, adding a more modern and stylistically spot-on touch. The right perspective The simple and recommended tutorial of Blueprint 3D is able to immediately understand the nature of an atypical and spectacular puzzle game: the goal to be achieved, just like in the more ~Vintage~ Connect the dots, is to show the hidden figure , giving meaning to a whole series of symbols otherwise devoid of any meaning. The method chosen to ~exhume~ the carefully hidden object is that of the various perspective views, which can be viewed using a simple design scheme. Basically, each puzzle to be tackled starts from a ~broken down~ project on several imaginary three-dimensional planes; the player has the task of bringing the different planes back into line, aligning the right perspective and thus finally making the solution appear. As already mentioned, the instrument through which it is possible to carry out the various tests is the touchscreen; concretely, with a horizontal or vertical slide the drawing is made to go around the respective axes while to make the object rotate freely, therefore also in depth, it is necessary to use the two thumbs, to slide in always different directions opposite. More difficult to explain than to create, the movement described can easily be assimilated to the one performed using a ~trackball~, an intuitive input method present on laptop computers of a few generations ago. One of the strong points of this production is certainly the very high number of levels offered right from the start: in fact, we are talking about over 270 encrypted images, divided by topic and, what is more, in continuous evolution and support from the developers. The puzzles are therefore divided into the categories Technology, Architecture, Middle Ages, Electronics, Space, Army, Transport and Christmas, very varied from each other and each with a personalized soundtrack. Obviously, not all drawings have the same difficulty of solution: the factors to take into consideration are in fact linked both to the knowledge of the subject in question and to the practice acquired while playing. In fact, it is clear that a technology or architecture enthusiast will generally be able to discover any project hidden in the appropriate section first, but it is equally true that after a significant number of puzzles solved, one acquires a technique that is certainly perfected in finding more or minus all kinds of pictures. To make the situation certainly more interesting, however, we think about the time factor, excellently implemented to give players an advantage in terms of scoring with a better glance. In fact, solving the puzzle within 9 seconds allows you to obtain the best possible evaluation, i.e. the three gold stars; if the solution arrives within the twenty-fifth second, the stars become two while if this limit is exceeded, the assigned star will always remain one. Of course, you have the option to restart the level whenever you want or simply come back later to improve your times and scores, important if you are a fan of leaderboards or avid collectors of Game Center achievements. Once finished in normal mode, Blueprint 3D then offers the option to choose both the advanced mode, which differs only in the lack of help related to the orientation of the figures, and the more interesting and complex Pro mode. With this setting the situation becomes rather tangled: the planes of movement in the various puzzles are in fact split and it will therefore be necessary to manually select which of the two to move or rotate; only after having found the right alignment can the figure be moved entirely, to finally obtain the correct orientation as well. The icing on the already more than delicious cake is represented by the pleasant clean graphics and thesupport for the Retina Display, very welcome given the importance of definition in solving puzzles. The tested version is 1.1 Price: 0.79 App Store links", "date": "2012-01-04", "grade": "8.7"}