{"name": "Kinectimals senza Kinect", "ref": "https://multiplayer.it/recensioni/97211-kinectimals-kinectimals-senza-kinect.html", "text": "Tested version: iPad Along with Kinect Sports, Kinectimals was probably Microsoft's most effective statement of intent for its motion-sensing device: for a device that aimed to expand the Xbox 360 audience by involving so-called non-gamers, a product with delicious puppies to look after was definitely an excellent business card. Having completed its task on the original console, Kinectimals now also arrives on the platforms of the ~enemy~ Apple, with more than satisfactory results. Pet therapy The idea behind this portable version of Kinectimals is to reproduce in all respects the experience offered by the Xbox 360 title, even if obviously without the gestural commands that are replaced here by a control system that rests exclusively on effective interaction with the touchscreen: a tap to bring the pet close to the screen, a rub of your finger to cuddle or brush it and a swipe to throw things at it or make it jump they represent pretty much everything you need to juggle your Microsoft product. You choose one of the feline puppies available, give it a name and you are immediately ready to play with it, without tutorials or instructions of any kind: not exactly a value for a product aimed at an audience unrelated to videogames, but a lack which in any case is compensated by the general intuitiveness of the whole. It is possible to interact with the animal in spare time, stroking it, cleaning it or accepting to use the objects it occasionally carries with it, or participate in a series of activities with specific objectives and related rewards. These are very simple mini-games such as rope skipping and ball throwing, divided by difficulty levels but basically very indulgent, whose presence serves not so much to entertain the user but rather to allow him to win virtual coins to spend in the game. special shop. Here you can find everything you need for your puppy's well-being, from food to toys to cleaning tools, actually displayed by an interface that doesn't shine in terms of comfort and intuitiveness: in any case, the purchase of new objects is in fact the crux of the experience, together with the completion of the various activities that leads to unlocking a whole series of new elements such as scenarios, shop products and even types of animals. As in its original incarnation for Xbox 360, therefore, Kinectimals is not a video game in the most classic sense of the term, but rather a ~puppy simulator~ to which you can dedicate yourself every day for a few minutes to keep your pet healthy and well-groomed. Taken for what it is, the Microsoft title performs its function more than admirably, and it is certainly a good choice as a pastime for children, thanks also to an attractive price. Furthermore, the visual fidelity to the original is undoubtedly an added value: the puppies appear well made and defined, animated in a realistic way and equipped with credible behavioral routines, while the scenarios offer pleasant bucolic panoramas well enhanced by the iPhone screens and iPads. There is also a small sop for those who own the product for Xbox 360, thanks to this mobile version will be able to unlock five new pets on the console. The tested version is 1.0 Price: 2.39 App Store links", "date": "2011-12-27", "grade": "7.5"}