{"name": "Provaci ancora", "ref": "https://multiplayer.it/recensioni/96928-il-dottor-lautrec-e-i-cavalieri-perduti-provaci-ancora-doc.html", "text": "A few weeks ago we told you about a new ~puzzle~ detective-story developed for Nintendo 3DS, James Noir's Hollywood Crimes 3D, designed precisely to fill the gap of the genre in the new portable console's playroom. For some years these graphic adventures seasoned with puzzles and puzzles have become increasingly popular, undoubtedly thanks to the success of Level 5's Professor Layton, who has also recently been involved in a new adventure for Nintendo DS. This is the catch, however, because at the moment there is no Professor Layton in 3D, at least in Europe, and numerous software houses are trying to take advantage of his absence to launch their new franchises, in an attempt to demonstrate that the good professor is not the only detective on the square. Bonjour, Monsieur Lautrec Konami, for example, invented this doctor Lautrec: the similarities between the two characters and their games (heck, even the titles) are certainly not accidental, but mistaking this new adventure for a mere Level 5 clone could be a serious mistake. Yet, even Dr. Jean-Pierre Lautrec has an assistant, in this case the beautiful Sophie, and Dr. Lautrec also has a penchant for mysteries, although in fact his profession as an archaeologist requires it. Doctor Lautrec and the characters that populate his story have a cartoonish appearance, although much more stylized than Professor Layton's character design (and we dare say even a little less pleasant) and many narrative interludes are fully animated and dubbed, just like in the adventures of the Level 5 Professor. In short, numerous similarities, all aimed at convincing the potential user that they are faced with a valid alternative, perhaps a real worthy heir of the professor. And actually, Doctor Lautrec and the Lost Knights almost succeeds. There is a solid narrative system that revolves around the hidden treasure of Louis XIV of France and the doctor's research, hampered by the attacks of a mysterious cult and by police investigations, and there are not only puzzles to solve but also moments in which the style of play changes drastically, in a structure that is essentially divided into three separate phases. The cycle generally begins with the search for the place where a new clue or treasure should be hidden: this is definitely the most boring phase of the gameplay, it is practically a matter of following the conversations and reasonings of Dr. Lautrec and Sophie and then looking for a detail in a discrete polygonal reconstruction of a Parisian location. This will allow us to move on to the second phase of the research, where things get decidedly more interesting, at least on paper. The 3D effect Apart from some puzzles that pleasantly exploit the 3D effect, the latter is certainly not the main feature of Doctor Lautrec and the Lost Knights. The stereoscopic effect is mostly used to give depth to some shots, especially during cutscenes and location exploration. Metal Gear Lautrec Konami must be acknowledged for having at least tried not to entirely clone the structure of Professor Layton's adventures, proposing his own vision of the same genre and the same assumptions. The game was written, directed and produced by Noriaki Okamura, one of the main authors of Metal Gear Solid Portable Ops and, above all, of the Zone of the Enders bilogy; in fact, we come across a few elements that are quite foreign to the genre of graphic adventures, as already demonstrated by the second mechanic of the game, in which we will have to explore the labyrinths in an isometric view, directly controlling the bizarre doctor to avoid the enemies that hinder our journey to the goal. Part action and part puzzle, these sessions require reflexes and intuition to outflank our opponents and move blocks or collect objects without being seen. The real puzzles, the ones that are basically the heart of the game, are the most difficult challenge to overcome to reach the treasure of the moment: they are the usual puzzles that Professor Layton has accustomed us to (here he is again!); the difficulty is not particularly high, even if some of them can be quite sneaky, but the problem is that they certainly don't stand out in originality or variety and many of them tend to look too much alike. Once this test has also been passed, the player finds himself grappling with a sort of boss at the end of the mission, often impersonated by a supernatural being, a spirit that we will have to defeat in turn-based combat with a typically JRPGesque flavor using the objects collected during the previous exploration phase . There is some logic to be followed to defeat qThese enemies which makes the battles a kind of peculiar puzzle in turn, however it is not explained in a particularly clear way and the player experience is founded on a somewhat naive trial and error process from the beginning. The problem, if anything, is that the process just described tends to repeat itself ~in blocks~ for the entire adventure: the three phases follow one after the other, once one cycle is over, another begins and, due to of the little variety of situations and puzzles, the game itself tends to become overly redundant.", "date": "2011-12-23", "grade": "7.5"}