{"name": "Gli eroi della neve", "ref": "https://multiplayer.it/recensioni/97099-winter-stars-gli-eroi-della-neve.html", "text": "Tested version: Xbox 360 The game requires KinectThe arrival of the winter season is a prelude to the release of titles dedicated to cold weather sports, a genre that performs very well with the use of motion sensors such as Kinect or the Move. Therefore, the German software house 49Games, a veteran in the genre, has well thought of creating a multi-event title based precisely on winter competitions. Indeed, the house based in Hamburg has a long past behind it dedicated to the programming of sports-based PC and console games: from the most famous Summer Athletics to Alpine Ski, from RTL Sky Jumping to Turin 2006, the list is boundless and very specialized in this kind of software. The idea is therefore to exploit the by now experienced next-gen and its new ways of approaching the general public to create the definitive winter sports video game: Winter Stars is the summation of the experience gained over the years and thus represents the their most mature title, albeit with a few flaws too many. Everyone on track! Winter Stars is a classic ~multi event~ game in which we have to face a series of different sports, each divided into many competitions to complete. There are 11 sports, the most famous and practiced in the winter world: snowboarding, skating, curling, bobsleigh, biathlon, paraskiing, snowmobile, downhill skiing, free skiing, ski flying and short-track. The good news is that it is not the usual game-container that does nothing but offer ~mini games~ to be played in sequence, but a real structured and developed title, complete with career mode, multiplayer, online and many options . And in this the PC experience of the development team makes itself felt. Where it is still missing is probably in the use of the Kinect sensor. The navigation system, interesting in itself, mixes the ~pointing~ one of all the Kinect games with the ~slide~ one of Dance Central, with an unsatisfactory result, however, because it is not possible to hook the various menu items perfectly, and above all because using both systems the movement is slower and more cumbersome. But regardless of the general layout, what interests us is to find out how the various sports included in Winter Stars ~work~, i.e. the raw gameplay. Only four disciplines are initially available, with the others being unlocked by advancing in the single player career. The other modes are offline multiplayer for two players, online for up to four and the quick challenge, with the possibility of trying our hand at a specialty to try to beat its records. Career... broken The story, in itself nothing exceptional or elaborate, however, is perfect for a game of this genre, as well as being an element that is not exactly obvious given the relative average production of this type of game. Starting to play Winter Stars we find ourselves catapulted directly onto the track with skis on our feet, thrown headlong into a downhill race without even having the idea of how to ~command~ our digital alter-ego. However, the controls are intuitive, and therefore it is enough to move slightly to the right or left to put on the first flags ... until unfortunately we are not victims of a ruinous fall that knocks us out and concludes both our race and our career. What better way to stay in the world of winter sports than to build an Olympic team? From the ~base~ of the game, a mountain cabin, you can access all the races, about 60 divided into 44 challenges and 16 events. Each event is in turn divided into three or more competitions against other challengers, where the gold medalist gets three points, the silver two, the bronze one and the fourth nothing. As we progress through the challenges, new sports are unlocked and experience points accumulate which we also need to buy equipment, items, equipment and customizations for our champions. Going to analyze sport by sport we discover that not everyone works well in the same way. More ~simple~ events such as skiing, in which the control via Kinect consists only in moving the center of gravity from right to left, paradoxically, are the ones that enjoy the most because they are less complex to perform, while others, such as skating, are forced and uninspired. The difficulty curve is not perfectly calibrated, because we often find ourselves faced with very difficult events, which can only be overcome after a long series of attempts; other times, however, the race goes smoothly with victories that are anything but hard-earned. Too bad, therefore, that there are only two levels of difficulty where the normal one is so poorly calibrated, while the alternative is to choose an even lower one, suitable for families and children. GoalsXbox 360 Winter Stars puts the canonical 1000 points on the plate, unlockable in 50 objectives that are quite difficult to obtain. Many are linked to specific performances in single sports, while a less consistent part is obtained gradually by advancing in the single player career, which is very long and tiring. Completing all the challenges and reaching the maximum level, however, will earn you about a third of the total loot. Tutorials, Upgrades, Training Winter Stars is packed with options, mini-games, events, and things to do. It is not, as previously mentioned, a trivial container game but a real title with its own and full dignity. In fact, even before competing in a race, there are some steps to take that give it a touch (but just a touch) of an RPG. For convenience they can be divided into upgrades / tutorials / training. In the first phase we are called to spend the experience points accumulated with the races to obtain elements that make us ~grow~ and specialize. Each sport has specific ones, for example in bobsleigh we can buy the rear wing to increase maneuverability on the track. As you gain experience, your level increases. The second phase is that of the tutorial, in which we learn the basics of the sport, test it, try and learn to master the Kinect controls without paranoia or stress. In the last phase, on the other hand, you train for the race with the same points or time system. Sports are extremely varied and represent an important part of winter events, moreover the amount of challenges and events certainly helps to extend the longevity of the title to truly commendable levels for a video game suitable for the whole family. Added to this is also the presence of a good multiplayer, both offline and online. There are many different modes to try in pairs: in addition to the classic ~competition~ we therefore find ~capture the flag~, in which we must cross the finish line of the checkpoint before our opponent; ~Coin Tornado~, which differs from the traditional event in that the tracks are crammed with coins to collect (and of course whoever gets the most wins); the ~Fun Race~ which is nothing less than a clone of Mario Kart, with special items scattered on the track to be used to our advantage or against our opponents; the ~Rocket Race~ instead resembles the good old Excitebike because it puts a nice ~boost~ under the skis which, however, if poorly dosed, leads to an explosion. Going instead to analyze the technical sector of the game, we are faced with a double-sided medal, with both sides that leave us rather perplexed: on the one hand, the models are too sparse, even if realistic, on the other, discreet backdrops which however do not they reach what was seen in titles such as Kinect Sports Season 2. The background music was pleasant: leaving the game paused we realized the absolute goodness of the OST, with orchestrated songs that would perhaps better adapt to a Hollywood blockbuster rather than a video game sport. Once the competitions have started, however, more banal and uninspired jingles take the field, just like the voices of the voice actors, which make one's mouth twist. Another sore point is that the game strangely requires much more space than any other Kinect title tested so far. The classic two meters seem not to be enough for him, and in fact a warning constantly appears on the screen: ~position yourself further away~, even from an acceptable distance. Get ready to clear out the living room, then, or head to the mountains for real.", "date": "2011-12-23", "grade": "6.4"}