{"name": "Recensione : Psychonauts", "ref": "https://multiplayer.it/recensioni/recensione-psychonauts.html", "text": "Psychoanalysis? Prehistory... Classified as a trivial platform, Psychonauts does not take long to show the user that it is actually much more, first of all presenting a background and a narrative setting of excellent depth for such a product. The imprint of Shafer (historical author of Lucasarts graphic adventures such as Day of The Tentacle, Full Throttle and Grim Fandango) is immediately recognizable to all those who have a minimum of familiarity with his illustrious previous works; the action therefore takes place in a summer camp for kids, which has the particularity of serving as psychic training for subjects with mental powers. In this context the protagonist of the game Razputin (called by all Raz) sneaks in illegally, having fled from home because he wanted to become a psychonaut, or a sort of 007 of the psyche. Surprised by the teachers of the course, Raz will find himself available with only one day to realize his dream before his parents come to pick him up: but during his short stay, the brains of his classmates begin to mysteriously disappear... So original and as entertaining as it is incredibly helpful for the gameplay, the Psychonauts plot amazes not only for the playful possibilities it is capable of opening up (entering other people's minds to unravel the mystery of camping), but also for the extraordinary cast of characters whose avails: in addition to Raz himself, characterized to perfection, the game scenario is populated by all kinds of weird figures, from the young participants in the course to the very particular teaching staff. In addition to boasting an absolutely exceptional design, the different NPCs show off their colorful personalities using delightful cut-scenes and above all the dialogues they can have with Raz. Referring to the genre of graphic adventures, Psychonauts offers the player the opportunity to talk at will with the characters, whose sentences will change based on the progress in the adventure, exorcising repetitiveness. And that's not all: it is often enough to get close to a group of NPCs to listen to their mutual exchanges, which can go on for minutes. All of this is made extremely pleasant by the superfine humor in which the Double Fine title is imbued, thanks again to the volcanic Shafer: most of the dialogues, sequences and puzzles of Psychonauts are in fact literally hilarious, with peaks of absolute humorous genius. Which is really not bad for a ~simple~ platformer... The power of the mind Even focusing on the more action part of the game, it is impossible not to notice how Psychonauts offers elements of great originality and freshness even in this area. First of all, the variety of situations and scenarios that can be encountered throughout the game's abundant dozen ~psychic~ levels, each relating to the mind of a particular character, literally leaves you speechless. Just to give a couple of examples, in the head of the military Coach Oleander it is explosions and tanks that dominate, while that of the sunny Milla is populated by colored lights, music, giant screens and people dancing, with finally that of the precise agent Sasha Nein modeled on the appearance of a huge Rubik's cube. As if such a multiplicity of styles weren't already enough, each single level offers a different type of challenge depending on the setting: in a particular stage, Raz thus finds himself playing the role of a gigantic monster committed to destroying a city inhabited by anthropomorphic fish; in another he has to sneak into a typical 1950s American neighborhood populated by bizarre secret agents; in yet another he is tasked with defeating none other than Napoleon Bonaparte in a strategy challenge. In short, Psychonauts oozes ideas from every pore, which blend harmoniously with more classic game mechanics anchored to the stylistic features of the genre: within the strong platforming part, an important role in this sense is played by the classic collection of bonuses scattered in the scenario game, which in the Double Fine title serve to level up Raz and thus allow him to learn new psychic powers. These include both offense skills and other abilities - such as telekinesis, mind reading or invisibility - indispensable for solving the simple but never trivial game puzzles or even useful only for experimenting them against the various NPCs and observing their hilarious reactions. All these elements that make up the very particular gameplay of Psychonauts, which amazes not only for the actual freshness of the package offered but above all for the extraordinary quality shown by every single nuance of the game.A beautiful mind Evidently I am not satisfied with the excellent results obtained on the field of the playing structure, Psychonauts manages to achieve top class results also as regards the technical realization. Visually, the Double Fine title is truly something unique, with a graphic style that is as bizarre as it is incredibly attractive. In addition to the highly sought-after and absolutely winning look of the characters, Psychonauts offers cartoony and well-finished scenarios in the context of reality, which turn into distorted and wonderfully crazy settings when you venture into the psyche of others. In any case, the real strength of Psychonauts is not the pure and simple display of polygons and special effects (which, moreover, do their duty in a more than optimal way), but rather the union of mere technique with exceptional stylistic choices, which often leave you stunned by their genius and variety. Furthermore, all this proceeds harmoniously hand in hand with a sound sector that is undoubtedly among the best heard in recent times. The lion's share in this case is certainly reserved for the extraordinary English dubbing, characterized by a choice of perfect voices and excellent acting, deliberately over the top to accommodate the bizarre game setting. But that's not all: the quality of the music that forms the background to the adventure is also impressive, capable of extricating itself from a very remarkable series of different styles that always marry infallibly with what is seen scrolling on the screen. Comment Psychonauts is undoubtedly the best platformer available on Xbox, although such a definition is decidedly close to the Double Fine title. Characterized by a harmonious amalgam of platform, adventure and puzzle phases and enriched by a whole series of hilarious dialogues and very different game phases, Psychonauts appears more like a radical dynamic evolution of Shafer's adventures, with all that is good can achieve. Stylistically exceptional and graced by an excellent quality technical sector, Psychonauts suffers only from a non-exciting longevity and a rather low level of difficulty, elements which however do not prevent it from establishing itself as one of the most surprising products of recent times. Pros: Incredibly fresh, varied and addictive gameplay Technically and stylistically unique Shafer-style humor in massive quantities Cons: Longevity and not very high level of difficulty It is known that video games with a rather long and tormented gestation are not always able to keep the promises made between previews and various press releases, victims of sometimes excessive hype or simply too slow production. This apparently could have seemed the case with Psychonauts here: a title announced the beauty of four years ago by the newborn Double Fine team, tossed from one producer to another and finally released on the market thanks to Majesco, a name which among other things historically great has never been synonymous with quality. Contrary to what it was legitimate to think, however, the work of the brilliant Tim Shafer turned out to be the most classic of the exceptions that invalidate the rule...", "date": "2005-07-08", "grade": null}