{"name": "Io zombo", "ref": "https://multiplayer.it/recensioni/97046-call-of-duty-black-ops-zombies-io-zombo-tu-zombi-lei-zomba.html", "text": "Tested version: iPhoneThere are many reasons why FPS enthusiasts should thank Treyarch: firstly, the team has taken on the heavy legacy left by Infinity Ward and has been able to make excellent Call of Duty episodes, with Black Ops representing so far the high point of their production; secondly, it was Treyarch who introduced the ~zombie mode~ for the first time and even improved it over time, offering players a cooperative mode out of the ordinary, based on survival to the bitter end within a closed scenario . In fact, our character finds himself barricaded in an isolated building while outside, visible from the windows, increasingly numerous hordes of the living dead are approaching, capable of destroying the barricades and reaching us with their icy touch. Each zombie killed translates into the gain of points which can then be spent not only to restore the destroyed barriers (and therefore slow down the advance of the enemy), but also to buy weapons and ammunition, essential to be able to go on for as long as possible . In the absence of a real conversion of Call of Duty, it was the zombie mode that landed on the App Store two years ago, thanks to the work of Ideaworks Game Studio, which was able not only to technically translate this sort of spin-off on iOS devices, but also to develop a gameplay capable of not suffering too much from the lack of physical controls, thus using the touch screen or possibly the accelerometer to manage the moment and aim of our alter ego. A successful experiment, which finds a natural sequel in Call of Duty: Black Ops Zombies, albeit a little late compared to the releases of the ~major~ series. The eternal becoming The game is presented in a very similar way to its predecessor, giving us the possibility to face the zombies alone or in multiplayer for up to four players, both locally and online, even with support for voice chat. Let's face the issue immediately: at the moment the chat works very badly, the voices are decidedly slurred and full of crackles, so there is still work to be done in this sense. For the rest, however, the structure is simple but solid and the only map currently available, Kino, appears identical to the one seen on PC and console. It is basically a large villa whose doors and windows overlook the living dead, while we must try to cover all possible entrances and possibly unlock new rooms. It is undoubtedly a spacious map, with a lot of potential and a good, sometimes even generous design, and its complete exploration requires quite a few games, given that the doors are only opened by spending a certain amount of experience points. There are also many weapons available, from the starting pistol to the powerful shotgun, passing through different models of machine gun, grenades and the ordinance dagger, which fortunately we can always pull out when ammunition is scarce and the enemies have now reached us. We can select the control style among three variants, partially using the accelerometer or the touch screen only, with or without virtual sticks, as well as adjust the sensitivity of the touches; which turns out to be a fundamental practice, given that the default settings are really too restrictive and prevent us from moving and aiming in a sufficiently agile way. The aim is managed semi-automatically, i.e. the reticle ~locks~ to the closest target but the maneuver must necessarily start from our input. As a system it works well and also allows us a certain freedom, thanks to the activation of the close-up view (we mean the iron sight), but the ways to open fire on the other hand leave something to be desired: to shoot you have to make a quick tap with your thumb right on the screen, but the operation on the one hand is not always implemented correctly, on the other it goes very badly with weapons that emit bursts of shots. In short, there is a lack of a dedicated fire button, although in terms of practicality and potential, the choice made by the developers has its own reason. Let's hope that the next updates will prove them right, after all the first update has already improved the precision of the controls considerably. The arcade mode deserves a separate discussion, a real twin analog shooter with a top view that has little to do with Call of Duty and that didn't really thrill us, but which with its fifty levels and the large number of available weapons can at least put a ~temporary~ patch on the evident imbalance between the price of Black Ops Zombies and the offer in terms of maps (as mentioned, there is only oneto). The tested version is 1.0.5 Price: 5.49 App Store links", "date": "2011-12-22", "grade": "6.9"}