{"name": "Angry fish", "ref": "https://multiplayer.it/recensioni/96724-saving-yello-angry-fish.html", "text": "Version tested: iPhoneHow long can a small fish survive out of the water? Yello, the protagonist of the new action game developed by Tactile Entertainment, has learned to do it for as long as possible. A necessary exercise, given that his wicked mistress, Mathilda, enjoys pulling him out of his bowl to see if he can get back every time before ~choking~. The little girl does not limit herself to this, but builds real obstacle courses to make an already difficult operation more complicated; and this is where we come into play: within a total of forty levels, gradually more complex, we will have to take advantage of the ~launches~ at our disposal to ensure that Yello is able to get back into the water. The gameplay works exactly like Angry Birds, that is, we have to ~pull~ the fish's tail as if it were a rubber band, then release it to make it jump in the air, hopefully in the right direction. The attempts are limited, but we will always have a trajectory indicator to make life easier for us, together with a zoom function that can be activated with two fingers and is really essential for understanding the physiognomy of a scenario before making random shots. The Saving Yello structure provides for the unlocking of the stage following each completion, even if it is difficult, but at the same time it requires us to conquer a certain number of stars in order to access new areas. So forget about being able to ~make do~ to reach the more advanced stages, perhaps counting on a pinch of luck, because it will be necessary to replay at least some of the missions already completed in order, as mentioned, to collect the minimum amount of stars required to continue. Blue water, clear water The star system that guarantees access to the new scenarios is quite tested and also on this occasion it works very well, making the experience more meaningful and forcing us to make some new attempts to get the maximum score in a particular stage. But on what basis is our performance evaluated? It is precisely at this juncture that Saving Yello differs from the aforementioned Angry Birds, because it introduces objects to collect, score multipliers and upgrades capable of modifying the abilities of our little fish. Therefore, it is not a question of reaching the bowl with the least number of throws possible, but of coming into contact with everything that is relevant within the scenario and possibly destroying walls and barriers. We will be able to do this in different ways: by touching a flame that will transform us into flaming projectiles, a crystal that will allow us to freeze the things we touch, a stick of dynamite that can detonate whatever is around, some quills that will make Yello a sort of hedgehog capable of adhering to surfaces, and so on. In short, there will be variations on the theme, to the full advantage of fun and longevity. The lazy ones will also be able to acquire a couple of extra launches or unlock all the stages with the payment of a small amount through the in-game purchase system, but it would be a shame not to enjoy the good degree of challenge offered by the dreamfab production. Excellent in terms of gameplay, therefore, Saving Yello also proves to be well done technically, thanks to colorful graphics, a nice (but not always convincing) style and a pleasant musical accompaniment. The tested version is 1.1.3 Price: 0.79 App Store links", "date": "2011-12-21", "grade": "8.0"}