{"name": "Chi vuole picchiare Pikachu?", "ref": "https://multiplayer.it/recensioni/96726-super-pokemon-rumble-chi-vuole-picchiare-pikachu.html", "text": "For Pokmon fans, each new spin-off represents a leap in the dark. In most cases, we find ourselves with the certainty of having in our hands a product developed in a short time to exploit the evergreen franchise, leveraging the most ardent fans or the youngest audience. This does not mean, therefore, that all the spin-offs of the mother series, the one proposed in pairs of colors, so to speak, are poor soulless products. Just to give an example, one of the best products of this type is a virtual pinball machine, and the Pokmon Ranger series, despite its simplicity, offers a particular and well thought-out structure. Okay, this is not the case with Super Pokmon Rumble which, on the other hand, is a game developed with two specific purposes: firstly, to place the franchise on Nintendo 3DS (probably to boost sales?) while waiting for the next chapter in the series principal; then, to definitely collect something, taking advantage of a colorful box and the children's interest in Nintendo pocket monsters, regardless of the real quality of the game. Pikachu deserves a little more... Ready to rumble? Super Pokmon Rumble should be a sort of sequel to the almost homonymous Pokmon Rumble proposed via WiiWare a couple of years ago. In reality, the two games are practically identical even technically, which means that even in this case you will be dealing with a kind of scrolling fighting game that can only dream of the exceptional depth of the parent series (or even Pokmon Ranger or Pokmon Mystery Dungeon, to be honest). The game is not set in the usual pokmon world but in an alternative reality in which the Nintendo little monsters are talking toys: there is a plot bordering on the insane that justifies the hybrid gameplay that will put you in the shoes of a pokmon grappling with a series of levels to go through beating everything that gets in your way, in this case pokmon on pokmon. While it's true that the franchise's core is countless battles to grow and improve your little creatures, Super Pokmon Rumble simplifies that concept to the point where all you have to do is press a button over and over to attack your creatures. more consistent waves of enemies that will block your way. At a basic level, the game maintains some characteristics of the franchise, such as the relationship between the properties of the pokmon, according to which, for example, a fire pokmon inflicts more damage to a grass pokmon but receives more from a fire pokmon. water and so on. In reality, this scheme goes down the drain when you get a more powerful pokmon than those in your team, regardless of its element: this time the pokmon are not captured, in fact, it is enough to defeat the enemies to randomly acquire new members of the team, replacing the old ones from time to time, which therefore become mere combat ~tools~, thus also nullifying the value of the relationship between player and creature on which the entire series is based. The 3D effect Although the standard shot of the game, in third person and raised, favors the use of stereoscopy to produce a depth effect, it must be said that the 3D of Super Pokmon Rumble is rather bland and not very incisive, as well as totally irrelevant in terms of gameplay . Gotta burn'em all! The lack of depth in the management of our pokmon team, mostly limited to the purchase of new attacks and little else, has repercussions on the repetitive and linear structure of the gameplay: the player, replacing the pokmon if necessary, is limited to going through the stages playing them to waves of opponents to reach an arena where you will have to fight the boss of the moment, a gigantic pokmon and much tougher than his henchmen. Again, Super Pokmon Rumble does not offer who knows what challenge, given that the attack patterns of the bosses are all a bit similar and make these enemies much easier to defeat than their size would suggest. Despite the presence of all six hundred existing pokmon, it cannot be said that Ambrella's proposal offers a great variety, also due to the unfortunate choice of dividing the various stages into thematic areas, filling the screen with enemies that are practically all the same, both in form and skill. As if that weren't enough, the various areas are bare and monotonous, mostly made up of large rooms lacking in detail, a feature that certainly doesn't make you want to visit them more than once each. In short, even from a technical point of view, it leaves a lot to be desired, especially if the same console offers the free PokDex downloadable from the Nint virtual shopendo, in which the three-dimensional representation of the various pokmon is decidedly more faithful and detailed; for its part, Super Pokmon Rumble sports, so to speak, practically the same engine proposed in the 2009 ~prequel~: the world and the various little creatures are made in cel-shading but their models appear awkward and deformed, a stylistic choice quite unfortunate, although justified by the context of the game; if to compensate for these unsatisfactory models there had been good quality animations, a fair variety of distinctive effects for the various special moves and an impactful 3D, then we could also have turned a blind eye but, as it is proposed, Super Pokmon Rumble looks like nothing more than a digital-delivery game offered at full price.", "date": "2011-12-21", "grade": "4.5"}