{"name": "Cave Story+", "ref": "https://multiplayer.it/recensioni/96946-cave-story-la-versione-definitiva.html", "text": "There are those who play a video game in their spare time, read a book or some comics, watch a film, play a musical instrument or engage in physical activity. Daisuke Amaya instead used his free time to develop a video game; not just any videogame, but Cave Story: one of the most famous independent productions ever, released as freeware (still freely downloadable today) on PC at the end of 2004 and subsequently brought to glory on all platforms. The circle closes with Cave Story +, available for some time on Steam at the price of 9.99 euros and presented, in practice, as the ~definitive version~ of the famous action platform. On what basis? In the first place ~remastered~ graphics and sound, while fully respecting the original work; secondly, the addition of six new modes that are unlocked once the adventure is over, which include options such as the Boss Rush or the Wind Fortress extra level. You probably already know the story of the game: in the role of a mysterious protagonist, who remembers nothing of his past, we will find ourselves exploring an underground world full of funny characters (the Mimiga, creatures similar to anthropomorphic rabbits), who however live a period of danger and oppression through the fault of an evil scientist. As in the best of traditions, our goal will be to help the Mimiga while trying to find out more about our origins and the events that brought us to that place. Let's avoid saying more because the narrative element with its twists and turns, although certainly not very original, represents one of the strengths of Cave Story. In particular for the way things are told, with a style that is very reminiscent of that of the Nintendo classics and which is therefore aimed at an extremely varied audience. Skip... After the initial stages and having collected the first weapon (the glorious Polar Star pistol), the gameplay of Cave Story + immediately proves capable of effectively mixing platform, shooter and adventure elements. It is possible to tackle the adventure by selecting the difficulty level among the three available (another novelty of the Plus version), but the original conception is still very well balanced today and allows us to enjoy the experience in the best possible way. Having established our ~base~ in the Mimiga village, we will gradually discover new destinations where we can go to contribute to the cause of liberation, we will reveal the mysteries referred to in the introduction of the game and gradually we will also begin to get to know our character better and its origins. In the meantime, however, there will be a lot of jumping and shooting, through relatively original dynamics and rarely comparable to something already seen. The jump in Cave Story is regulated by pressing a button, so the longer we hold it down, the higher we will be able to get. Elevation is not affected by momentum (keep this in mind when you have to overcome a chasm), but the maneuver hides many pitfalls due to a very pronounced inertia, sometimes causing the most frustrating ~sudden deaths~ you have ever experienced. A factor, that of frustration, closely linked with the management of the saves, which can only be carried out in certain points of the maps. It is a solution that on the one hand increases the challenge and avoids premature completion of the game, which would end up trivializing the experience; on the other it turns out to be frustrating because it can happen (even quite often) that you have to repeat entire particularly demanding sections, completed even with a little luck, due to a single wrong jump. ...and shoot The action element, in particular the shooter one, is based on the weapons that we can find and upgrade during the game, through the most classic of level ups but also counting on temporary improvements based on the collection of ~triangles~ that are released by eliminated enemies . The weapons at our disposal are quite varied and in Cave Story+ there are more than in the original version, but to be able to use them all we will have to perform certain actions. Which is linked to the adventure facets of the game, made up of dialogues and interactions that can lead to different consequences and finally translate into four distinct endings: a decidedly positive factor from the point of view of replayability and therefore of the longevity of the product. But let's go back to the shooter dynamics, because their implementation determines one of the most interesting peculiarities of the title developed by Studio Pixel, or the contrast between the ~paciocco~ design, extremely gJapanese, of the characters (opponents included) and the mix of solidity and challenge offered by the combat system, which can be decidedly tough in certain situations while always maintaining an impeccable balance. Naturally, both standard enemies and bosses are included in the picture, equipped with traditional movement and attack patterns that must be memorized in order to defeat them. The fact that moving to a new area or accessing a ~room~ in the middle of a location automatically restores all previously eliminated opponents is not exactly pleasant, especially in the more advanced stages, when the difficulty is high, but thinking about it well the alternative would have been an unusual and far worse (in playful terms) desolation. The technical sector It is possible to play Cave Story+ using the keyboard or any type of controller, such as the one for Xbox 360. In the latter case, the commands can be customized to better adapt to our habits, and in the road test the system reveals itself precise and reliable, even if the combination between the analog sticks and the inertia we mentioned above does not always prove to be a happy one, on the contrary it can increase the number of ~sudden deaths~ and therefore episodes of frustration. Keep that in mind. We bought the game on Steam, but an inexplicable error during startup forced us to waste a lot of time between tests and counter-tests, then falling back on a PC with a 32-bit Windows 7 operating system to be able to play without problems: not the best of life, considering that the freeware edition does not suffer from such problems, which we would expect instead from more complex productions of a 2D action platformer with graphics at 640 x 480 pixels. And speaking of graphics, the ~remastering~ work of the same is clearly welcome and the possibility of switching between the new and the original one is equally welcome, as is the sound, but it really turns up one's nose the fact that this passage cannot be carried out freely during the action, but it is necessary to return to the starting menu (concluding the game, therefore). Also disappointing is the fact that there is very little different between the graphics of Cave Story + and that of the WiiWare version of the game, indeed it is practically unchanged. Full respect for the original style and therefore more defined and enhanced sprites, of course, but compared to the sale price (9.99 euros are obviously not a large figure, but the game is still also available in freeware form and this + version is currently included in the Humble Bundle 4) we would have expected something more: not a 1080p pixel art nor the polygonal reinterpretation seen on Nintendo 3DS, but at least something in between.", "date": "2011-12-21", "grade": "8.0"}