{"name": "Lunione fa la forza", "ref": "https://multiplayer.it/recensioni/96947-cartoon-network-pugni-a-volonta-lunione-fa-la-forza.html", "text": "Bringing together several characters from the same universe even if they usually live independent adventures: this simple but ingenious idea was the basis of one of the most famous and well-made fighting games on Nintendo Wii, that Super Smash Bros Brawl which had the merit of making the among them the likes of Mario, Pikachu, Kirby and even the (apparently) innocent Princess Zelda herself. While even Sony has been buzzing about such an initiative for some time, without however having anything concrete yet, the colorful and at times decidedly particular world of Cartoon Network lands on the new Kyoto laptop, in full 3D: Cartoon Network: Fists a Will therefore allows you to follow the adventures of all the heroes of the famous channel dedicated to children, including the most popular stars. An unexpected merger Like any title whose protagonists have little or nothing in common, Cartoon Network: Fists at Will tries to build from scratch a plot outline useful to justify the unusual confusion of characters. In this regard, it draws heavily on the most classic of stereotypes: an unexpected fusion of worlds brings together both heroes and villains and, of course, the good guys (led by Dexter) have the burden of solving the anomalous time situation, facing various challenges in an attempt to restore normality. Having ascertained the absolute uselessness of the script, the player is put in a position to immediately jump into the action, using the famous star Ben 10 in the story mode. Continuing the adventure, essentially made up of frequent fights and platform phases, they will face each other as a sort of small boss battle the other protagonists of Cartoon Network who, once defeated, will become part of both the main game party and the roaster for the secondary modes. In fact, the story should be tackled using all the characters present in rotation, at least in theory; in practice, given that in any case it is possible to always choose your favorites, you will inevitably end up selecting those with greater incisiveness (such as Ben 10 itself). With each death, the next player will take over the game, until the end of the choices and the inevitable Game Over. In reality, however, despite the good premises, the fights are not rendered in a pleasant way, mainly due to the lack of physicality and any bite. The commands, which can be freely set, include a normal attack, a special one, the action key, the jump key and the parry; after collecting enough energy, a super attack is also available to activate by pressing the appropriate blue circle located on the lower touch screen. In the various levels there are sometimes also different power ups to collect, such as blunt objects (to be thrown or simply to be brandished) or various foods, useful for restoring health; the particular black and white chess bonus then allows a support character to enter the middle of the action for a few seconds, helping us in combat. Even the platform phases leave a lot to be desired: the jumps are often imprecise and one frequently falls into the void even during the most peaceful fights, probably due to poor management of the margins in the different platforms. On the other hand, the phases on board the vehicles are fun, where in a pre-set path the interaction is limited exclusively to the evasive jump of obstacles and ravines (to be performed in a short period of time). The 3D effect While not adding anything in strictly playful terms, the three-dimensional effect in Cartoon Network: Fists at Will is certainly well done, especially for the rendering of the backdrops. There are no particular slowdowns when active and indeed its use, in non-sensitive subjects, is certainly recommended to make the title at least more attractive to the eye. Four is better On the other hand, the secondary game modes are more interesting, which allow Cartoon Network to express the true nature of a fighting game: Pugni a Will. Multiplayer in WiFi up to 4 players in fact certainly represents the maximum in terms of fun, without prejudice to the gameplay limitations already mentioned. In the arenas it is also possible to play alone against the CPU while if a friend in possession of 3DS does not have the game cartridge with him, the software allows the sending of a sort of advanced demo using the Download mode, thus giving the possibility to play some games. The work done in terms of graphics is certainly acceptable, with a varied level design full of references that fans of the famous network will surely be able to grasp, as well as a framerate that is alwaysstable. The charisma and charm of the chosen game world, apart from the most passionate little fans, still remains very low, just as some gameplay choices are limited; the purchase is therefore to be examined only upon express request by the offspring.", "date": "2011-12-21", "grade": null}