{"name": "Total War: Warhammer 3", "ref": "https://multiplayer.it/recensioni/total-war-warhammer-3-recensione.html", "text": "Creative Assembly is now synonymous with a certain type of strategy, in which the management part and the battles, although apparently distant, dance on the screen creating a unitary and indivisible experience, which determines an increasingly refined gameplay, from iteration to iteration. In a sense, the entire Total War series is a continuous experimentation starting from the same formula, which leads many to consider the various chapters as part of a single evolutionary line, regardless of whether they are of historical or fantastical inspiration. The English development studio has become synonymous with large-scale combat between thousands of troops simultaneously displayed on the screen. No one has ever managed to touch the level of perfection of the dynamics of Total War, which at the moment appear unattainable in their field, so much so that the competitors are now on the run. Total War: Warhammer 3 review can only confirm this dominance. The new factions Which of the eight factions will win? The scenario that kicks off the new war set in the universe created by Games Workshop is introduced by a prologue campaign, in which we experience certain events that will prove to be decisive for those that follow. Here we cannot choose our faction and we will have to lead the men of Kislev (one of the new playable factions), in search of the truth about the fate of Ursun, the bear god symbol of strength. Without going into too much detail, it is during what is essentially a long tutorial that we will become active agents of a power that wants to bring chaos to the world of mortals. At the end of the prologue, which is not actually mandatory (but highly recommended), we will be able to tackle the actual campaign, selecting one of eight factions, each of which with different leaders, which open different narrative lines, underlined by unique videos and other details, like personalized advice from a key figure, whose goals will soon overlap with the impending catastrophe. Here we will also be able to get to know the new factions, namely the aforementioned Tsaritsa of Kislev, prey to a furious internal war due to the disappearance of Ursun, the Demons of Chaos, commanded by the Prince of Chaos and eager to bring death and destruction and the other six: Great Cathay, Ogre Realms (only available if you pre-ordered the game), Khorne, Nurgle, Slaanesh, and Tzeentch. The new factions are really interesting to use. The reason lies not only in their introduction of new elements into the series, but also because they are fundamental pivots for the story told, each with its own different perspective on the events we are going to experience. After all, as was also the case in the two previous Total War: Warhammer, each chosen faction introduces a series of unique elements in terms of gameplay that radically changes the progress of the campaign, whether it is linked to the units or to the game mechanics. For example, some factions recruit heroes in different ways, perhaps by raising them rather than spontaneously obtaining them, or there may be objectives to be achieved that have a characterizing function, between the need for reconciliation, a desire for repression or a desire for total destruction. The growth of the leaders also changes according to the chosen faction, with their abilities being doubly linked to the realm they rule, up to the excess of the Daemons of Chaos whose leader grows by modifying his body victory after victory, finally becoming the champion of one of the four deities vying for power behind the scenes. Already here it is possible to notice how incomparable Creative Assembly has become in creating almost perfect balances, while not renouncing variety and uniqueness. The management side Units vary from faction to faction As you will have understood only from the speech on the factions, Total War: Warhammer III is a fairly complex game, even if, it is fair to say, those who have played the previous chapters will immediately find themselves at home, given that the fundamentals are practically identical. For those unfamiliar with the series, let's say that the gameplay is divided into two parts, which we briefly mentioned in the introduction. The first is the managerial one, in which we lead the troops on the general map and in which we can access the cities we control. The latter are the hub of our economy, because they guarantee the income necessary to finance armies and because they act as a base for heroes. Our task is to make them grow as much as possible, directing them according to needs and position. For example, in some cities we can build infrastructures more aimed at defense, perhaps because they are located on the border with generally hostile kingdoms, while inothers we can make the economy develop more, because they are less exposed to potential enemy attacks. It is in the cities that we can hire the lords and troops (among those available), and it is always in the cities that we can withdraw an army that has suffered great damage, in order to reintegrate it faster. There is no room for diplomacy in such a world Let's say that basically the gameplay itself revolves around the conquest of new cities and the defense of those in our possession, also because without cities you will never have enough resources to act on several fronts and expand towards the final goal, or more simply reach all the objectives of the faction. A sore point remains diplomacy, which as in the previous episodes is quite superficial and is simply based on a competition to see who offers the most, based on the occurrences of the case. In some ways it works, because in its mechanical nature it allows good planning, making alliances, signing treaties, obtaining or doing economic favors and more, but it never goes too deep and is also subject to some strange decisions by the CPU, which sometimes he comes to make absurd requests. Total continuity The progression of some heroes is very interesting In the description of the management part, many will have recognized characteristics very similar to those of the previous Total War: Warhammer. There's not much to be surprised about: the continuity is total. In this sense Total War: Warhammer III offers itself exactly as the conclusion of the experience that began with the first two episodes, from which it has no great interest in detaching itself much, precisely in order not to displease the many fans who follow it from the beginning. Of course, the game map is about twice the size of that of Eye of the Vortex, the base campaign of Total War: Warhammer II, and the Realm of Chaos, one of the key areas of the new campaign, which also gives its name , also adds something more in terms of real battles, which we will talk about shortly. Also consider that in the future it is expected that owners of the three games will be able to play a combined campaign of gigantic proportions. But we will talk about the latter in due course. Citing it only serves to make it clear that the thread that binds the three episodes is deeper than it might seem and that therefore it would not have made sense to expect revolutions or drastic changes. Some places are suggestive Then the system of lords and heroes is confirmed, the former to be placed at the head of the armies, the latter to be used as units in battle or to be exploited to damage rival factions in various ways (murder of rival heroes, wounding troops, destroying of fortifications and so on). Lords and heroes all have their own skill trees, which can be awarded points as you level up, and an inventory in which to manage the equipment found and assign prominent personalities to your character to give him further bonuses. In principle, the progression has so many possible branches and evolutions that the player is left with ample room for manoeuvre. Thus it is possible, for example, to raise lords specialized in troop support, or more focused on combat, or still equipped with active skills to be used when needed in battle. The battles Battles are the core of Total War, this too Of course the battles between armies made up of thousands of soldiers and various units remain the focus of the series. In reality, in many cases it is possible to avoid them, making them fight automatically by the CPU (useful when the imbalance of forces in the field is so marked as to make the fight almost a waste of time), but this does not change the validity of the previous statement. The combat system is the one that by now should be familiar to all fans of the Total War series: once a battle has started, you have to deploy your troops, choosing how to position them based on the morphology of the map and the type of battle, then you take the direct control of the army, which can be moved in unison, or by groups or by single battalions. The tactics to keep on the field are more or less always the same, obviously always taking into consideration the forces you have and those of your opponent. So we advance more or less slowly depending on the visibility of the rival troops and depending on the elements that make up the scenario. Warhammer scenery is always exciting Every opportunity is used to gain advantages, such as placing some units on high ground or launching surprise attacks from a forest (where troops can hide). In short, the movement phase is managed in modo so as to make the clash between the armies as advantageous as possible and to create tactical opportunities, such as the encirclement of the adversaries, the isolation of some particularly dangerous units and so on. Naturally there is always the factor to be taken into consideration lord, whose powers can change the course of battles, and the design one, which applies above all to fixed clashes, linked to the progression of the game. In what sense? Normally these battles are designed differently from the others, more dramatically so to speak, with gimmicks that don't exist in normal battles. For example, the sudden arrival of reinforcements or the presence of troops that have a narrative function. Precisely because of their different structure, these battles cannot be skipped, but must always be fought in first person. Often they are also the most difficult, because they present situations designed to challenge the player and catch him off guard. The monsters add an extra touch of spectacularity to the clashes Speaking of types of battles, in addition to the classic direct clashes, which are fought in open areas, to sieges, which involve the use of war machines, artillery and monsters to try to capture an opposing city, to ambushes, which arise from attacks surprisingly brought to the game map and to all the others, survival battles have been added, in which the player must resist several waves of enemies, perhaps keeping a certain area and calling for reinforcements when needed, and those against minor settlements, which they predict the deployment of troops around the objective. These are two interesting additions, but certainly not revolutionary. In any case, they add up to an already rich selection and they do no harm. What about artificial intelligence? Creative Assembly seems to have refined it even more than in previous chapters, with enemies who hardly make rash moves or are easily fooled. Of course, also in this sense, don't expect revolutions, because there aren't any and if you are a veteran of the series you will always know more or less how to behave. The lords are well characterized In terms of units, each faction has its own. The heroes and lords themselves are unique, some more versed in melee combat, some in magic and so on. Listing them all would be impossible, but we can say that they more or less belong to the standard categories. So each faction has its infantry, be it humans with spears or small demon thugs, its cavalry, chariots and monsters, with the latter being the most creative units in terms of characteristics and abilities, as well as the more interesting to follow on the battlefield due to their size, often very generous, which makes them dominant over normal units. In general, the variety is very high (after all, we are always talking about Warhammer) and learning how to best manage armies that are often so different from each other is rewarding in its own way, regardless of everything else. Other content Chaos advances As for the contents, Total War: Warhammer III is a very rich title, which can take away tens, if not hundreds of hours from the player. In addition to the tutorial campaign and the main one, there are also two minor campaigns, aimed at different objectives: Darkness & Disharmony is a free-for-all campaign in which you have to defend yourself against the demonic invasion as one of the other factions. Something Rotten in Kislev, on the other hand, is a three-player cooperative campaign designed for quick games and set in the territory of Kislev, as you can easily guess from the title. We imagine that many more content will be added in the future via DLC and expansions. In any case, the offer is already very high and definitely valid. In technical terms, Total War: Warhammer III confirms the good things seen in the most recent Total War, but without going too far. It is certainly more refined and some effects are better, but in general graphically it hasn't made a huge leap forward compared to Troy or Three Kingdoms. Of course, seeing thousands of well-modeled 3D units moving on the screen at the same time still has a certain effect, but the habit now protects us from amazement. A praise to the redesign of the user interface, more practical and functional than those of the previous chapters, despite being more pleasant to look at. That's no small thing, considering that we will have it under our eyes for practically the entire game time. The soundtrack is also excellent, which gives the battles the right epic tone, also binding perfectly to the type of scenario.", "date": "2022-02-14", "grade": "9.0"}