{"name": "L sui monti con l'iPhone", "ref": "https://multiplayer.it/recensioni/96481-the-oregon-trail-pionieri-damerica-la-sui-monti-con-liphone.html", "text": "Version tested: iPhoneDuring the nineteenth century, the state of Oregon was the backdrop to the exploits of the great pioneers of America, who settled in its lands and built their first cities in the heart of a previously unknown territory . A theme that would seem not to be able to marry with videogames, but from which educational productions have been drawn since the early '70s; and the tradition continues today thanks to the management system The Oregon Trail: Pioneers of America, developed by Gameloft for iPhone and iPad. The game is presented in the increasingly popular freemium format, i.e. it can be downloaded for free and it is possible to carry on the ~story~ without spending anything, but you can also use the in-game purchase system to get virtual money with which to buy better items (a heavy ax for cutting trees, a more powerful rifle for hunting animals, etc.) and above all energy units, the consumption of which marks the number of actions that our character can perform before ~getting tired~. For convenience, we bought a few credits and this made us proceed rather quickly towards the core of the gameplay, but the energy still recharges over time and we have also noticed that Gameloft has included the possibility of acquiring virtual currency even by simply watching short commercials. In short, we can tell you with confidence that it is possible to play and have fun for hours with The Oregon Trail: Pioneers of America even without spending a penny. Do you feel calmer? Well, because unfortunately not all that glitters in the retina of the boy who is dredging the river is gold. But let's proceed in order... Quicksand that blocks the way The incipit of the game sees the protagonist and his family settling in an uninhabited but apparently luxuriant territory, and there they build their own home. The building material is found all around the plot of land, trees that our character can cut using the ax: just touch one on the touch screen and the action will start automatically. A single session will not be enough, it will take more, but in the end we will have collected a sufficient number of logs and we will be able to finish the creation of our small but welcoming refuge. Many other things will gradually arise around it: plantations, small farms with animals, other houses, laboratories, pharmacies and so on, until the space available to us multiplies and we find ourselves managing a small city, with different tasks to carry at the end of each tot and an almost infinite number of new missions that will be delivered to you in the form of a letter. At the same time, we will have to worry about the happiness of our fellow citizens, implementing the necessary measures so that they can live their lives in peace, without feeling the need to move somewhere else. The control system is completely entrusted to the touch screen and the isometric view, scalable at will, allows us to always have the territory under control. As already mentioned, the actions are carried out automatically, simply by touching an object, especially when an icon appears next to it: that of food near the hen, which means that it has laid its eggs and we can collect them; that of money near the houses, which indicates the time to collect the rents; in the case of laboratories or pharmacies, a menu appears with the things that we can put into production. From time to time a more or less ferocious animal will peep out of the woods and we will be able to hunt it down with a rifle to turn it into food, or we will be presented with ~disasters~ (Sim City style) which we will be able to deal with by choosing the most safe but expensive or take a chance and choose the ~cheap~ alternative. Everything we do will produce experience points and an increase in the level of the character, which will unlock some new features, while remaining within a circle which at that point will be well defined, with its pros and cons. Setting up a city and completing the missions that are proposed to us from time to time turns out to be fun at first, but loses its edge as the routine operations become more numerous. Furthermore, the detection of the touch screen leaves much to be desired and does not lend itself at all to quicker tasks, for example hunting animals, given that we will find ourselves pressing on everything except our prey, with the obligation to cancel on the fly the actions triggered by mistake and to see, despite everything, the energy meter fall inexorably, and with it any money invested to replenish it. The tested version is theto 1.0.0 Price: Free App Store links", "date": "2011-12-15", "grade": "6.5"}