{"name": "Piccoli Vettel (non) crescono", "ref": "https://multiplayer.it/recensioni/96679-f1-2011-piccoli-vettel-non-crescono.html", "text": "Sumo Digital is the studio behind the decent F1 2009 for Wii and PSP and the excellent Sonic & SEGA All-Stars Racing; this is why it must have seemed natural to the top management of the English company to also entrust him with the launch of F1 2011 on a portable console, the only game with an official license from the Formula One Administration which, after the controversial performances of 2010 corrected in the race (it is precisely the case to say it!) with a megapatch, this year on PC and HD consoles it has perhaps aroused less clamor but probably also more satisfaction in the players. Will it be the same on 3DS? A portable console will be able to replicate a game that has set out from the outset to simulate maybe not so much the actual driving of an F1, but the racing world, the career of a driver, everything that, not surprisingly, is defines the ~Circus~? A guide for all seasons F1 2011, like a good official game, presents all the 19 tracks of the just concluded World Championship (therefore with the new Indian Buddh Circuit and without Bahrain, this year canceled due to the difficult situation from a political point of view), the 12 teams and the 24 pilots. There are also numerous game modes: you can immediately get on the track without preamble by selecting the Quick Race, or carry out an entire race weekend with a Grand Prix; familiarize yourself with driving the car and/or with the secrets of a certain circuit, while trying to set the best time in the Time Trial, take on a full Championship or try your hand at Career, the highlight of F1 according to Codemasters, in which you create a driver who from being a perfect stranger and racing for one of the two less important teams (Lotus and HRT this year) must over the course of several seasons with placements and victories attract the attention of the most important teams and become thus the new Schumacher; the portable version also features interesting Challenges of increasing difficulty, which with pre-established cars and circuits each offer a different objective, from simply beating a time to crossing as many checkpoints as possible, up to going around the track avoiding enormous obstacles in the shape of road signs that roam the route. Finally, there is also multiplayer for up to 4 players even online: we would have liked to try it properly, but unfortunately in numerous attempts made there were very few times in which we actually found other players. In those very few cases, however, everything went smoothly. Strengthened by the experience with the two home episodes, what we most wanted to investigate from the beginning was the driving model adopted by Sumo for this portable iteration; well, surprisingly the programmers have decided to make few waivers with respect to the PC/HD editions, which if they are not simulations in the way of the old Grand Prix certainly require their hard work for decent performance: these waivers basically concern slippage and loss of the rear , now decidedly less frequent, but otherwise there are no huge differences. But the slide pad is not a steering wheel, and the 3DS keys are not analogical, and this leads to a whole series of enormous difficulties at the beginning, above all in managing curves and throttle partialisations. Numerous advantages come our way: among other things, one can opt for the automatic gearbox instead of the manual one, adjust the sensitivity of the steering wheel and above all, very useful for first approaches, activate an assistance on the same steering wheel which makes driving much more fluid. Hacking through the options, everyone will find their own compromise between ~simulation~ and arcade; the hardest and purest will also be able, after a while, to deactivate all the aids gradually: driving is thus, to the maximum simulative degree, difficult and satisfying. Even uncomfortable to tell the truth, especially for bigger hands, but the fault of this certainly cannot be attributed to the programmers, as to the intrinsic characteristics of the console. A fault of the programmers, on the other hand, is not having foreseen, in this plethora of options, the possibility of totally customizing the control system: in fact, none of the two schemes present is easy, considering that this year, in addition to the brake, accelerator and possibly gears , KERS and DRS must also be managed. Above all, the mobile wing is difficult to reach whatever the chosen scheme, unless you are real masters in the art of finger contortionism. As we will see shortly, however, it is not that you will then have all this need to operate it... The 3D effect We can definitely recommend playing without the 3D effect activated: the depth it gives to the tracks is commendable, especially since we're talking about a driving game, butboth framerate and speed are particularly affected. Since these are the best elements of the engine and probably of the whole game, it doesn't make any sense to give them up. Circus Barnum Although the compromise you have chosen goes in the direction of pure arcade speed or a complicated and nervous relatively realistic simulation, driving, in those modes where there is only you on the track, is pleasant, fun and satisfying, supported by a graphic engine which, evidently having to deal with both hardware and limited time resources, is very deficient as regards the textures, (the one of the asphalt is passable, but the others are really ugly, starting from those that cover the cars and that don't even allow you to read the sponsors' writings!) decent for the number of polygons (especially for the very moderate pop-up that concerns only the surrounding elements) and almost completely impeccable when it comes to speed and fluidity. It seems clear that the team had to compromise, ~cut~ certain things to emphasize others, but as far as we're concerned they made the right choices: frankly, we didn't expect a 3DS to handle a decently detailed and with many cars on screen. Maybe with a little more time something could have been done for the textures too, but for the moment that's okay. All the more reason in the light of these last considerations, then, it is even more a pity that then, taking part in a GP whether or not it is included in the Championship or in the Career (which would be the most important mode of the game), one finds oneself having to deal with an opposing AI that defining non-existent would be euphemistic: the competing pilots are guided by a completely abstruse logic, we are not talking about particular errors, but precisely a basic setting that seems totally absent. The opponents are slow, the values in the field are not respected at all and this would allow you from the first season to outclass a Red Bull even aboard a Lotus or an HRT, provided however that you come out unscathed from a direct confrontation; in addition to being slow and making a series of very trivial mistakes, in fact, the various Alonsos and Hamiltons are also real killers who really don't notice your presence when braking and overtaking, who mathematically come upon you even when, and this often happens, you have a clear advantage and you have every right to set the ideal line. The climax of all this lies in the starts: even though we are on a straight line, there will never be a shortage of someone who will happily pass you on the wheels or who will suddenly brake in front of you for no reason, starting a nice NASCAR-style rear-end collision. And yet, if for some reason you should be particularly slow, if you follow the ideal trajectory a nice little train will form behind you, and no one will dare to overtake you, remaining obediently in single file. All this makes the activation of damages completely unthinkable (the race would already end at the start) and also penalties, since in any battle you would still be defeated by the virtual stewards. Understand then, without having to continue, how the race, that is the heart of the game, is reduced to nothing more than a bumper car if you are in the group, and an emotionless escape when you are in front, at least until you find a lapped who will act as a killer no more or less than those in direct competition with you; it's not just a matter of unrespected realism, if it were only for that we could always simplify driving and enjoy a frenetic and spectacular arcade set in the F1 Circus, it's just that in this way the fun is totally lacking because even an arcade has its rules: with an AI that manages to be both sluggish and unjustifiably aggressive, neither the rigorous rules of realism nor the fun ones of arcades are respected. Other elements, such as car set-up, tire degradation, changeable weather and pit stops, that we no longer have the space to delve into are done well, but all this only adds to regret and disappointment .", "date": "2011-12-13", "grade": "5.5"}