{"name": "Tenchu: Fatal Shadow", "ref": "https://multiplayer.it/recensioni/tenchu-fatal-shadow.html", "text": "Les Femmes fatale The product does not appear as a sequel to the third chapter, but is placed between the first and third episodes. The protagonists are two ninja girls: Ayame (already seen in the past), a lethal cold and determined assassin, and the new entry Rin, a young girl thirsty for revenge after her village was burned. Initially the two killers will be opposites and will also face each other in a duel, but once the truth is discovered and the real enemy has been found, they will join forces and fight together for the cause. During the game we will command both ninjas (taking turns at each level), so that we will be able to witness all the plot twists from the front row. Each stage will always be preceded by a very suggestive introductory film, where you will see drawings representing ancient Japan accompanied by the voice of the narrator who tells the story. Obviously there will be cutscenes, created with in-game graphics. Broadly speaking, the plot of Fatal Shadow is quite good, even if it is certainly not the maximum of originality: although there are twists, in the end the typical clichs of stories already seen will come out. Watch your back! Although most will certainly know what kind of game From Software's product is about, it is still good to provide a brief explanation for novices: Tenchu is basically a stealth game, where the player must move silently without being seen by sentries to reach the own goal. In any case, there is a good dose of action combined with blood and violence, since cut throats and broken limbs are the order of the day. To tackle the missions, our heroines have a good number of moves at their disposal: they can perform somersaults, somersaults, climb on roofs, hold their breath under water, reach otherwise inaccessible places with the grappling hook and stealthily crawl along the walls. The damsels, in addition to being able to count on their own weapons (daggers for Ayame and katana for Rin), are martial arts experts and able to perform lethal blows. Thanks to the numerous characteristics possessed by the protagonists, it is possible to surprise enemies in ways more disparate: for example once we reach a roof and wait for the passage of the unfortunate person on duty, we can pounce on the victim's head and put an end to his life with a fatal blow; on other occasions walls and bushes are useful for hiding and ambushing the sentinels at the right moment. If we manage to get behind the enemy without being noticed, a small circle adjacent to the vital bar will light up, and pressing the attack button will start the movie showing the killing of the guard (the sequence changes according to the position from which we attack the enemy). To keep us informed of the state of alert there is the usual indicator of the level of suspicion. In order not to be discovered, some factors must be taken into consideration, such as the noise, since a movement that is too loud can make the sentinels suspicious, and in some situations civilians, who, if they see us, will begin to scream, attracting unwelcome presences. Often it is also good to hide the bodies of the killed, so as not to arouse further suspicion. To further assist us in the mission there are various objects (to be selected before each level) that can be very useful: smoke bombs, poisoned food, soporific arrows, and some magical expedient that allows us to temporarily take on the appearance of someone else. During the journey you will meet many bosses to face, and the duels with them are quite challenging given their ability. Once an internship is finished we are assigned a score, which reflects the stealth level assumed during the mission: a good judgment rewards us with special items and extra missions, while a low evaluation, which can be caused by too many open-face clashes with the guards, leaves us completely dry. However, regardless of the outcome of the vote, each end of the level we are awarded points which, once a certain quota is reached, will unlock a new technique for the two ninjas! Never change a winning team? Surely Tenchu: Fatal Shadow looks like an overall fun game, thanks to an immediate control system and a balanced difficulty. Unfortunately, however, it must also be kept in mind that the gameplay has not undergone any changes whatsoever, bringing with it the defects found in the past: first of all the management of the cameras, which is nothing short of disastrous, which often prevents us from having a good view to look at each other around and decide how to act, thus forcing us to change position continuously until you don't get a decent view. Another problem is represented by a poorly maintained AI of the enemies, which manifests itself in decidedly unrealistic and banal behaviors (why stay stuck in one point if you hear strange noises?); despite this, it's always better not to overdo it with open-face fights, as the guards always appear in groups, and you often leave the battle defeated (and that's a good thing, otherwise the game would be too easy!). A greater number of missions (only 12) would also have been appreciated, also because due to the linearity of the levels, the incentives to replay everything are very few Technical Analysis Graphically, something more could have been done: even if overall the visual sector is not too bad, beyond some commendable light effects and some discreet textures, the engine appears rather obsolete by today's standards. On the other hand, the design of the settings is good, which reproduce the atmosphere of feudal Japan very well. To this we must add an excellent sound arrangement perfectly suited to the context, combined with a more than sufficient dubbing (English). Comment On balance Tenchu: Fatal Shadow certainly remains an almost discreet title. The strengths of the series, such as the tactical approach combined with a fair amount of action, the immediacy of the controls and the phenomenal atmosphere, have remained intact and guarantee the player hours of entertainment. Unfortunately, all this is contrasted by the choice of the programmers not to make any substantial changes to the gameplay, but above all not to cure the defects seen in the past. For this reason, the From Software branded product does not get a more good-natured evaluation, and more as a follow-up it can be cataloged as a simple add-on (sold at full price). Definitely recommended for lovers of the saga, while those who expected some sudden improvements will be disappointed. PROS Fun and immediate Balanced difficulty Excellent atmosphere CONS Poor management of the cameras AI of the enemies not taken care of Lack of innovations in the gameplay About 7 years ago the game Tenchu: Stealth Assassin arrived on Psone, a title set in feudal Japan that amazed with its atmosphere and the proposed tactical gameplay. Given the consensus found, From Software decided to continue the series with Tenchu 2, released for Ps2, and Tenchu: Wrath of Heaven, landed both on the black monolith and on Xbox (for the latter the title Return of Darkness was put ). The episodes did not deny the validity of the saga, even if already from the third episode the lack of substantial improvements began to have a certain weight. Now the fourth installment, called Fatal Shadow, comes to the market. What will he offer us? Let's find out together!", "date": "2005-07-06", "grade": null}