{"name": "Il wrestling che vorrei", "ref": "https://multiplayer.it/recensioni/96611-wwe-12-il-wrestling-che-vorrei.html", "text": "Version tested: WiiSince the announcement, WWE '12 has been presented as a kind of reboot for the WWE series Smackdown Vs. Raw. In this case, the Yuke's developers have tried to make the experience more dynamic and realistic: on the one hand by significantly reducing downtime, with the wrestlers remaining on the ground only for a few moments after having undergone a move; on the other by introducing the Predator Engine, a technology that substantially improves the quality of the animations and the realism in the interaction between the characters. Technologies that are not exclusive to the HD versions, for once, and which we therefore also find in the Wii version of the game, to the great satisfaction of those who were tired of hammering the buttons on the controllers to get their alter ego back on their feet after immediately a pat. Let's be clear: the foundations of the gameplay are always the same and therefore it will not be these appreciable changes that will make you fall in love with the wrestling games produced by THQ, especially if you have avoided them like the plague so far. After all, these are licenses made expressly for the ardent fans of this sport-entertainment; fans who will be thrilled to see how carefully and precisely the sequences, entrances, moves and promos seen on WWE shows have been reproduced. This assumption is particularly true for the renewed Road to WrestleMania mode, which instead of offering us to choose between different storylines at the beginning will try to surprise us with three ~stories~ dressed on the skin of as many wrestlers (respectively a ~villain~, a hero and a street between the two alignments) but which in narrative terms merge into a single, full-bodied sequence in which twists and turns will not be missing. Universe 2.0 is also of great substance, an evolution of the old General Manager mode that allows us to experience multiple seasons by controlling every single aspect: from alliances to rivalries, from tag teams to titles, from alignments (face or heel) to interference. If you're a fan of wrestling and WWE '12 is one of your first experiences with the genre, Universe 2.0 will have you hooked for literally weeks. Then there is a whole series of ~fast~ modes, to organize matches and events in the contexts we prefer, together with an editor for creating characters, while unfortunately online multiplayer is missing. Substance first The framework designed by Yuke's is therefore once again dedicated to content, and although the Wii version of the game has something less than its counterparts for PlayStation 3 and Xbox 360, we are still dealing with an extremely durable, well-finished and multifaceted. However, the enjoyment of the experience can be jeopardized by some factors that should now be fixed, given that we have found them in every edition for years now. First of all, there is a gameplay problem that the recent changes have not been sufficient to solve: as conceived, WWE '12 can give us satisfaction at a too low challenge level and be frustrating at a too low challenge level. too high, in the sense that the only variable lies in the feasibility of the moves and in the opponent's docility, whereas instead it would have been the case to focus on other aspects. It goes without saying that such an approach is only fun for a limited time, whatever your degree of passion for wrestling and WWE superstars. The introduction of ~achievements~ to be achieved in the Road to WrestleMania mode has the undoubted merit of making things more fun, precisely because you cannot limit yourself to knocking down your opponent by performing the usual four moves and pinning him, but you have to carry out operations precise. A step forward, of course, but it's still too little if the goal is to make the franchise as fun as the classic Technos Japan coin-ops (WWF SuperStars and WWF WrestleFest), a goal that the recent WWE All Stars seen from reach. Then there are some situations that continue to clash and that concern the management of the strength and size of the wrestlers: in reality very few are able to perform a suplex or a bodyslam on people like The Big Show or Mark Henry, but in the game the problem it does not arise and we witness impossible maneuvers, which are then ~disproved~ by predetermined sequences in which, for example, the giant undergoes a suplex carried out by three wrestlers simultaneously. Implementing this type of limitation and representing the capabilities of the individual wrestlers more likely would make the roster finally more varied and not a sequence of names that differ in aesthetic terms but not in practical terms. Finally, a few words on the technical sector: the shonor is excellent as usual and this year also the commentary by Michael Cole and Jerry Lawler appears more varied and interesting, while the graphics pay duty due to the limited capabilities of the Wii, with polygonal models that are recycled over the years, textures poorly defined, a barely acceptable audience and even limitations regarding the number of wrestlers present on the screen, which creates tragicomic effects in five-on-five matches. The ring is inexplicably small, while fortunately the videos displayed on the titantron at each entrance are of higher quality than in the past.", "date": "2011-12-12", "grade": "6.5"}