{"name": "Trine 2", "ref": "https://multiplayer.it/recensioni/96602-trine-2-il-seguito-che-aspettavamo.html", "text": "Tested version: PC Not too long ago we got a nice beta code from the nice Frozenbyte. The beta in question was that of Trine 2, a sequel to the Swedish house's acclaimed platform-puzzle game released in 2009. The first Trine had won many admirers with its fairy-tale look and its original gameplay and, being us part of the large group of people who liked the game, we dived into the experience without hesitation. The test was short but intense, and allowed us to develop excellent expectations and start with the inevitable speculations. So many questions whirling in our heads: would this Trine really be able to correct the defects of its predecessor? Would it have decent multiplayer? Were there any unpredictable surprises waiting for us during the main campaign? And how dazed would we have been in front of its beauty? All answers that a single hour of adventure certainly could not give. But now the game is available on Steam and in stores, and we can tell you once and for all if this second excursion into the fairy world created by Frozenbyte is worth the (reduced) cost of the ticket. The triangle yes, I had considered it In Trine 2 you will still play the role of the friendly wizard Amadeus, the graceful thief Zoya, and the well-fed knight Pontius. The atypical trio had been trapped by the magic of the Trine, a mysterious artifact capable of binding human souls, which had dragged them into a series of extremely dangerous situations and led them to save the world from the undead. Finally freed from the curse, the heroes are back to their usual daily chores. However you know, peace never lasts, and suddenly the kingdom is invaded by huge creepers. As the three wonder what to do, Trine appears before them and carries them into the heart of a verdant area where some goblins not inclined to talk attack them, and a talking flower asks them to find her sister. Thus begins another epic mission, which will see them involved in dark rituals, court intrigues, and shady events involving two powerful sisters named Isabel and Rosabel. Those who played the first chapter will quickly feel comfortable with this sequel. The single-player campaign also starts this time with a handy tutorial that will teach you how to use the basic tricks of each protagonist. After the introductory phase, you will have to face a series of maps full of puzzles, secrets and threats. The main purpose of each chapter is to overcome the obstacles that block the way and reach the next area, using the abilities of the various characters (thanks to the power of the Trine it is possible to choose between the three at any time). Reaching the final finish line is not particularly difficult, the difficulty lies in collecting bubbles and ampoules of experience scattered around the map, often hidden in areas that are very difficult to reach or even just to discover. For this reason, each mission is replayable, and a handy counter indicates how much experience is missing to complete it 100%. In short, the fundamentals have not changed, yet overall the experience has improved, mainly thanks to some excellent choices by the developers. Let's see which ones. Not just wizard In the first Trine, one of the most obvious shortcomings was the exaggerated usefulness of the wizard. The brave Amadeus could in fact easily solve all the puzzles present in the adventure by himself with his evoked constructs, and this flexibility obscured the two companions. The programmers realized this imbalance, and thankfully corrected the problem by structuring the puzzles in a much more specific way. Pontius and Zoya are no longer fun to use ~side~ characters, and their tricks are indispensable for overcoming certain hitches. The strong knight will have to use his hammer to destroy many rock walls and his shield is a boon during phases in which it is necessary to defend against bullets or harmful liquids. For her part, the thief is the only one able to overcome certain slippery terrains thanks to her grappling hook, which if mastered properly allows her to reach ampoules of experience that are unthinkable for the other two. Of course, all this does not mean that the sorcerer has become useless. Amadeus is still incredibly effective in almost any situation, and upgrading his abilities helps tremendously in most levels. Yes, you read that right, ~empower~. Also in Trine 2 the hard earned experience in the campaign does not go to waste, but can be used to purchase additional powers. The extra goodies are many and often extremely useful. Zoya will be able to become invisible and shoot elemental arrows, Amadeus will be able to create tables and keep more than one construct in existencenza at a time. Pontius instead will get the ability to throw the hammer and various combat moves, including a mighty charge. Even the battles are back in a new guise. Always easy-going, even at maximum difficulty, however, they show a marked improvement in the variety of enemies. The addition of boss fights at the end of certain maps then guarantees a further pinch of panache to the complex. Finally, it must be said that the general difficulty of the game has increased and the puzzles are much less repetitive. You will have to deal with viscous liquids, levers, puzzles with pipes, moments of swinging at Worms (who controls the rope controls the battlefield, remember that!) explosive floats, carnivorous plants and many other beautiful surprises, ready to put you to the test test your reflexes. Three is not always the perfect number All these optimizations are commendable, but Frozenbyte has not managed to completely eliminate the defects from its creature. The control system has a few hiccups, especially when it comes to handling the aforementioned plumbing. In many cases the pipes do not stay connected and force a long series of attempts to form the necessary conduit. The problem can be bypassed by changing character at the time of connection, but it is still a rather annoying bug. There are also small uncertainties related to the physics of the game. It happened to us to get stuck due to momentary ~blocks~ of the puzzles due to the incorrect positioning of certain objects, or to find ourselves with ampoules of experience stuck in unreachable places. Fortunately, each level is teeming with checkpoints, and you just need to exit and re-enter to reset the last visited and continue in peace. The puzzles have been refined, but some rare stages seem to be structured specifically for multiplayer, and require rather convoluted reasoning to be overcome alone. In conclusion, the longevity of the campaign is still quite poor. There is talk of 5 or 6 hours to complete it, even if perfectionists will need much more time to collect all the experience of the levels. Unfortunately, the ~second team of heroes~, which seemed almost heralded by the six-portrait home screen, does not exist. Zoya, Amadeus and Pontius will be your only protagonists, unless the already announced DLCs do not reshuffle the cards on the table. These imperfections don't detract from the experience, but they are noticeable. Speaking of multiplayer, in Trine 2 the multiplayer mode has received a facelift. Now you can collaborate online with two human companions through a convenient interface. Finding or creating games is quick and easy, and the use of the microphone or in-game chat facilitate team coordination. In case you want to make the game even more of a walk there is also the Unlimited Mode, which allows participants to use any hero at any time. With three wizards the obstacles are a walk of health, but it's a fun extra nonetheless. Surround yourself with beauty Trine 2 is not a pretty game, it's a great game. This title is clear proof that high-quality art direction can outperform an ultra-realistic graphics engine. The creators of the levels have demonstrated an astonishing aesthetic sense. We're not kidding, some screenshots of the game could be exhibited by how beautiful they are, the variety of environments is incredible and during each game you are literally showered with splendor. Stopping to stare at the screen in Trine 2 isn't a crime, it's an obligation. The physics of the engine is well done in its simplicity, and further ennobles the impact of the presentation. The music composed by Ari Pulkkinen is also noteworthy. They keep up with the graphics sector, which is saying something. The price is also excellent, really low. You can choose: buy three cocktails or play one of the best indie titles released to date. The bartender may be a champion, but we opt for Trine 2. He deserves it big time, and so does our liver.", "date": "2011-12-09", "grade": "8.5"}