{"name": "A volte ritornano", "ref": "https://multiplayer.it/recensioni/96476-tales-of-the-abyss-a-volte-ritornano.html", "text": "And we are two. After Xenoblade Chronicles, Europe beats North America on time also in the case of Tales of the Abyss, which will reach the shelves of our Yankee friends only in a few months. Not bad, they'll say, because this chapter in Namco Bandai's long and popular Japanese RPG series was already released in America in 2006 and this edition for Nintendo 3DS is nothing more than a direct conversion of the original PlayStation 2 game which, in fact , at the time it was not released in our country. In short, another port. But for those who weren't lucky enough to play it six years ago, it's a completely new experience that hasn't lost a shred of its charm in the transition to the handheld, filling a gap in the European toy library of the new console that would remain that way. for several more months: this means that if you don't like jRPGs, or the Tales series specifically, this cartridge won't change your mind. If, on the other hand, you are intrigued and are looking for a portable jRPG, you just have to continue reading to find out if it is worth taking a stroll around Auldrant. The sound of magic Tales of the Abyss offers a fantasy Japanese cartoon storyline complete with an extravagant cast, moments of pure irony, drama and sugary talk about friendship and courage. Yet, from a narrative point of view it is one of the most original Japanese jRPGs ever, if only in the characterization of the protagonist, Luke fon Fabre, who from the very first minutes reveals himself to be unpleasant, cowardly and spoiled. But the quality of the screenplay is such as to encourage us to follow the vicissitudes of this shabby hero and a gang of increasingly varied and interesting supporting actors who will bear witness to his growth and maturation, to the point of making him one of the most captivating protagonists ever. Luke was kidnapped when he was ten years old by the assassins of Malkuth's empire, remaining traumatized by the short experience to the point of losing his memory; raised in cotton wool for seven years, Luke must necessarily have to travel with a busty but combative girl, Tear, in a world whose fate has been prophesied by the understanding of the particles known as Fonon: the kingdoms of Malkuth and Kimlasca-Lanvaldear have data battle for decades to gain knowledge of the future and this war is on the verge of breaking out again. It goes without saying that Luke will play a decisive role in the whole affair, but the story does not spare sensational twists, which literally keep you glued to the console for at least fifty hours, and despite becoming a bit convulsive it is one of the most compelling in the wide panorama of jRPGs offered in recent years, assisted by a clear, spot-on and pleasant sound accompaniment, even if perhaps not among the best performances by the artist Motoi Sakuraba. The Artes of War Tales of the Abyss is a very traditional jRPG: don't expect innovations or peculiarities like those seen in the more recent Persona or Xenoblade, after all we're talking about a 2006 game and a series based above all on a certain type of structure and gameplay. This means that you will spend most of your time wandering around the world map or the many countries scattered throughout Auldrant, interacting with their inhabitants and following the line drawn by the unfolding story with dedication. In short, the setting is typical of older generation jRPGs, but there is certainly no lack of variety. So here are the inevitable fights with monsters and creatures of all kinds: if you come into contact with an enemy, we will be thrown into a sort of arena in which we will fight by controlling the leader of the party, while our companions act on their own, guided by a discreet artificial intelligence and a series of parameters set by us. By acting on the various keys it is possible to chain combos of normal blows and special attacks called ~Artes~ which can also be connected to unprecedented shortcuts placed on the touch-screen. The Artes are unlocked by leveling up or by repeatedly using those already acquired and are at the center of a peculiar feature of Tales of the Abyss, called Field of Fonon: in practice, almost every Artes will result in the appearance of a colored circle in a random point of the battlefield and by using a certain Artes while inside the circle it is possible to perform a different, more powerful and spectacular attack. The FoF therefore offers an extra layer of complexity to an already fun, if somewhat chaotic, combat system and it is necessary to master this feature with precision if you want to win the most difficult encounters. The mMicro-management of skills and statistics is one of the cornerstones of Tales of the Abyss gameplay, as demonstrated by the Capacity Cores, objects that can be equipped to increase certain statistics at each level-up and acquire special skills, called AD Skills, capable to offer distinct advantages and bonuses during combat and to keep players glued to the console to determine the best combinations of skills, equipment and party characters. The 3D effect The 3D effect in the porting of Tales of the Abyss has ups and downs, making it particularly effective especially in the case of certain shots or locations. In terms of gameplay, it does not offer any kind of advantage, beyond that of slightly spectacularizing the battles, and can cause slight drops in the frame-rate in the most chaotic moments. Porting issues Let's immediately clarify a concept: Tales of the Abyss is a direct port of the PlayStation 2 version and Namco Bandai has not bothered to alter practically anything, proposing the same contents as five years ago. There are no additional quests, unpublished bosses designed specifically for this edition or other amenities: the changes made to the code concern only the technical sector and, even there, in a decidedly partial way. This means that Tales of the Abyss appears, at first glance, a somewhat antiquated product, in which the discreet polygonal models and the somewhat washed out textures are counterbalanced by an excellent art direction that also helps to turn a blind eye to the infamous ~ladders~ that weigh down some shots, especially if they are close up, but this last problem can also be somewhat mitigated by deactivating the 3D effect which makes the image slightly cleaner. Overall, however, the visual rendering is more than satisfactory and enjoyable even on the small screen of the Nintendo console, thanks also to a better saturation of the colors, and compared to the PlayStation 2 version this cartridge offers a significant advantage in the lightning-fast loading speed of locations and battles and, of course, in adding the stereoscopic effect. The latter was obviously integrated afterwards, exactly as happened in Ocarina of Time, but the result is not at the same level as that proposed with the remake of The Legend of Zelda. It is in fact a 3D effect that adds nothing in terms of mere gameplay, not even in battles in which it is possible to move freely within the area and in which a tactical advantage is therefore offered which however is lost in the chaos of combat and battles. colorful special effects of hits and magic. The change made by the slider is therefore a simple visual tinsel that plays above all with the shots and the positioning of the elements in the background and in the foreground with fluctuating results, proving to be very effective especially in the case of large tracking shots or shots showing particularly vast and complex environments . From this point of view, the all in all skimpy conversion by Namco Bandai earns some points in terms of visual spectacularity, while remaining anchored to a technical realization that was already quite modest in 2006.", "date": "2011-12-09", "grade": "8.0"}