{"name": "L'Ombra di RAAM sull'Umanit", "ref": "https://multiplayer.it/recensioni/96515-gears-of-war-3-lombra-di-raam-sullumanita.html", "text": "The Game is available for download on the Xbox Live serviceThe time has come to add some extra content regarding the single player of Gears of War 3: RAAM's shadow is the third DLC available on the Xbox Live marketplace regarding the latest Epic masterpiece on 360. After the first two dedicated to multiplayer, here are finally some healthy hours of history and twists. The expansion, consisting of five campaign chapters, will be available to all Xbox 360 users starting December 13th at the cost of 1200 Microsoft Points, or free to all those who have already purchased the ~Season Pass~. A jump in the past RAAM's shadow tells the vicissitudes of the Zeta Squad (Michael Barrick, Minh Young Kim, Tai Kaliso, and Alicia Valera) even before the events narrated in the first chapter of the saga. But that's not all, in addition to the three/four hours of gameplay, the DLC also adds to Gears of War 3 six new skins for the multiplayer characters (in addition to the four protagonists of the story, also that of RAAM and the Theron guards), a skin per weapon (chocolate flavored) and 250 new points to unlock through 10 objectives. The story sees us catapulted back in time, a few days after the infamous Emergency Day, in the city of Ilima City with the aim of safeguarding human lives and rescuing survivors of the first alien attack. And here is the first novelty: the game setting, the city, is still standing, beautiful and untouched by the war. During the five chapters of RAAM's shadow the situation rapidly turns towards catastrophe. Buildings are collapsing, buildings on fire, the population fleeing and hiding and our impotence in the face of such a large-scale attack. But let's fight in the street, door after door, enemy after enemy and we continue with our mission. In the very first chapter, something new arrives immediately: the mythological ~Hammer of Dawn~ is no longer controlled by aiming at the chosen target, but through a sort of laptop that allows us to observe the view directly from the satellite and to aim at the target from 'high. Exactly as it happens during some phases of Call of Duty or the last Battlefield with air strikes. In this DLC we impersonate Michael Barrick, a rocky marine with few words and a cigar always in his mouth, rather than the head of the Zeta Squad who is Minh Young Kim (from Gears of War 1). The other two members of the team are Tai Kaliso (from Gears of War 2) and the new charming and feisty Alicia Valera. It is obviously possible to play in multiplayer and face all the missions in co-op, or select the Arcade mode which allows you to ~score points~ competitively during the actual story. Xbox 360 goals This DLC adds to the classic 1000 Gears of War 3 points another 250 to unlock, through 10 new achievements. Most of them are unlocked by going through the five chapters of the story, without too much difficulty, while a couple are related exclusively to the multiplayer mode. 250 pretty easy points, all told. Retro-Twists Without wanting to anticipate anything, we can only say that in the relatively short history of RAAM's Shadow there will be at least a couple of twists and interesting ~stories~ of some famous characters from the universe of the saga. The plot, despite being linked to a costal shoot'em up, is very important in Gears of War because it is full of facets, stories, people, and it is no coincidence that books and comics have been used to tell everything (or almost). The uniqueness of the characters is then one of its most important characteristics: each one has its own character, its own distinct physiognomy. Therefore, we cannot fail to appreciate the new heroine Alicia, who can also be selected in multiplayer once the DLC package has been downloaded. The idea is also nice (now no longer a secret as it can also be deduced from the objectives already declared) of directly commanding General RAAM, during some phases of the game interspersed with the control of the Zeta team. This alternation of good / bad phases is very reminiscent of those already seen in Halo 3. The leitmotif of RAAM's Shadow is certainly the progressive decadence of human civilization. The destruction of the city of Ilima City is relentless, lightning fast and progressive. Even the graphics engine, the notorious Unreal Engine in its most powerful form, helps to recreate this feeling of decay, thanks to the new in-game physics that allows you to move, break and destroy many elements on the screen. Some passages of the game involve the destruction of some objects in order to continue or kill enemies, as well as some easy and intuitive puzzles to solve. During the second act, for example, we are called upon to eliminate three gigsanti Seeders stationed under a huge construction. After trying to throw everything at him, here's the suggestion: take out the columns that support the building with boomshots and make it collapse on the creatures. The idea, in itself very nice, however remains practically the only one of all 3/4 hours of play. We wish we could have seen more massive and gameplay-critical physics interaction, just like this, but throughout the game and not just at one scripted point. But maybe, for that, we have to wait for the next Unreal Engine and the new Xbox. In any case, the graphic cosmetics are top-notch as always, with an incredible impact at every shot, all enhanced by a masterful artistic direction that once again manages to perfectly mix graphics, style, colors, lights, effects, and an architecture of the city that is once again incredible. There is everything on the screen: dozens of enemies, an environment designed with a thousand details, dirty, rotten, in short, alive and pulsating. It goes without saying that the audio sector is once again up to par with the rest, with orchestral music that underlines the drama of some moments (made even more beautiful by the magnificent slow motion cut scenes) and the tension of waiting in others. RAAM's Shadow is a beautiful experience linked to Gears of War and not necessarily only to the last chapter, and ultimately a must-buy for all those who want to delve into the universe of the Epic masterpiece.", "date": "2011-12-08", "grade": "9.0"}