{"name": "Tutti al Bioparco stereoscopico!", "ref": "https://multiplayer.it/recensioni/96254-zoo-resort-3d-tutti-al-bioparco-stereoscopico.html", "text": "In the certainly not substantial line up that has characterized Nintendo 3DS up to this period (however greatly improved by the return of Mario) perhaps the most unpredictable gap has been the almost total absence of titles dedicated exclusively to children. In fact, apart from a few tie-ins of dubious qualitative value, the responsibility of making children and young people become children has been entrusted almost entirely to Nintendogs + Cats alone. But as already anticipated, the Nintendo laptop is now starting to ~fuel~ and, consequently, titles that have always characterized its more casual nature are also beginning to appear. Remaining on the animal theme, Zoo Resort 3D in fact represents one of the most classic ~light~ managerial games, fruit of the Kyoto tradition and intended for the many little fans who, for one reason or another, may have difficulty seeing the fascinating creatures live of nature. A challenging legacy The incipit of Zoo Resort 3D is certainly not the most cheerful: in fact, an affectionate grandfather unfortunately passes away but, after having spent his whole life lovingly caring for the animals in a zoo, he decides to leave the entire structure as a legacy to his grandson . To be picky, this unexpected gift isn't exactly a bargain: abandoned and in very bad shape, the zoo is now inhabited only by an old, run-down elephant and hasn't hosted visitors for a very long time. However, the challenge is precisely this: with the help of a sort of director, a friend of the grandfather, the player's task is to restore the naturalistic park to its former glory, filling it with animal species but above all with paying visitors. There are essentially two tools available to grasp the difficult objective: an online blog, on which to publish photos, updates and videos taken from the life of the inhabitants of the structure, and the animal distributor, i.e. the creative solution with which it was decided to justify the arrival of all the different beasts. The blog obviously serves as a sounding board and publicity, indispensable for making potential visitors aware of the arrival of a new species; the images are loaded automatically, after having taken the best possible photographs (even using the accelerometer) in the various areas of the zoo. Instead, the vending machine works by paying with Animal Points (PA), which are accumulated both by increasing visitors and by taking good care of the guests already present and exposed. The distributor allows you to choose between 5 macrospecies of creatures, namely herbivores (costing 100 AP), carnivores (300), terrestrial (500), special (800) and air/marine (800): each new arrival must then be placed in one free slot along the exhibition route, until they run out. In this case it is possible to expand the area destined for the animals (if in possession of adequate PA) or to wait and accumulate the relative sum. The 3D effect Enabling the 3D effect makes the sight of the animal in its habitat even more fascinating, almost giving the sensation of being able to caress it. However, using the virtual camera with the accelerometer, the function must necessarily be disabled, because the continuous movements can also cause discomfort as well as not allowing you to fully enjoy the effect. Considering Zoo Resort 3D as an encyclopedia of animals, stereoscopy is therefore a welcome added value. How to play In terms of gameplay, the interaction with elephants, pumas, chimpanzees and all the other 100 species is really bare-bones: contrary to Nintendogs in fact, here there is no physical interaction via the stylus and the only way to ~ pampering~ the animal is to give it the right food and take a myriad of photographs. The parameters of satisfaction, to always keep an eye on, are friendship, mood and popularity (even if the latter is more of interest for economic purposes as it is linked to the number of visitors). However, the shots, like the food, are measured and must be managed with care, otherwise you will have to skip a meal or not see an important photo published on the blog. However, by spending the usual points, even this limit can easily be overcome, thanks to the possibilities offered by the Special Commands (which are then simple paid tricks). When friendship and humor are at their peak, each animal offers a little skit to shoot and publish on the blog as a video; a video generally brings many more visitors than a photograph. The only criticalities that can occur during the management of the zoo are therefore diseases and food shortages, both of which, as we have seen, can be easily overcome thanks to the Special Commands. The entire management of Zoo Resort 3D is resolved in the end in a few simple steps: purchase of the animal from the distributor,its exhibition, photography and food, all to be repeated an indefinite number of times with the only variant being the periodic expansion of the zoo. A bit 'little to be of interest in videogame terms, but enough for children who are passionate about exotic animals, faithfully reproduced among other things even if a little passive in their movements. The only exception seems to be primates, whose polygonal structure leaves much to be desired.", "date": "2011-12-05", "grade": null}