{"name": "Recensione Imperial Glory", "ref": "https://multiplayer.it/recensioni/recensione-imperial-glory.html", "text": "19th century, was from Imperi The parallelism with the Total War series becomes even more evident by analyzing the choice of the game's plot, or rather, the temporal location of the events. With its three chapters, Activision had brought the Japan of the Shoguns, the turbulent Europe of the Middle Ages and Ancient Imperial Rome to videogame glory. The choice made by Pyro Studios for Imperial Glory was to cover the historical period that by right should have been assigned to the next chapter of Total War. In fact, the choice fell on the 19th century which saw the formation of the last great European empires. Leaving ourselves to a more careful analysis, this is also the last convertible historical period in the classic TW-style model; it is the last epoch that saw the vast pitched battles as protagonists, where the clash with white weapons could still make the difference. The great battles of the past The game offers the possibility to experience the battle through different modes, making it attractive even to the eyes of more hasty players looking for the ephemeral thrill of the pre-packaged battle to be played in peace without the frills of strategic preparation. But it's the full mode that offers just the right amount of challenge and fun. Through it the player accesses a political map of the Europe of the time, divided into kingdoms and regions. Before taking part in the game, the player is asked to choose one of the available factions. Among the most attractive we find France, Prussia, Russia, United Kingdom and Austria, plus a series of minor states that are more difficult to manage; however, there is no lack of a series of states of more modest dimensions which nevertheless influence with their presence in the balance of European powers (among these we even find the very Italian Papal States, Savoyard Piedmont and the Kingdom of the Two Sicilies). Obviously, although the main objective remains for everyone the conquest of the whole of Europe, each nation will have its own peculiarities related to resources, geographical position and historical characteristics. France, for example, plays the part of the war superpower, since those were the years of the great Napoleonic conquests that shocked the entire continent, while Prussia, despite having had an important decisive role at the end of Bonaparte's conquests, is at the beginning of the game in a position of economic and social advantage, but with limited territorial availability. Russia, the great granary of Europe, observes from the eastern front strengthened by its immense territorial extension, but at the same time cornered by an unfortunate geographical position and by the difficulty of controlling such vast territories. Among the game modes presented, in addition to the now ubiquitous multiplayer (on Gamespy servers), we note the possibility of playing five historical battles (Waterloo, battle of the Pyramids, Friedland, the retreat from Austerlitz and the battle of Salamanca). The tactical map The tactical setting of the game re-proposes the solid sector of the turn-based strategy, in which the player is free to carefully evaluate his own moves according to the conquest plans. The political aspect reigns supreme at this juncture, and it immediately catches the eye how the annexation of adjacent territories can take place through many ways and not just through brutal military conquest. In fact, the nation enjoys a degree of popularity over the opposing regions, just as the regions controlled by the player are influenced by neighboring domains. This aspect recreates the realistic situation of the period, in which the regions were influenced by the political and ideological movements of neighboring powers, creating many problems for the governing forces, all too often engaged in trying to quell the onset of new revolutionary movements. Investing in the influence aspect is just as important as swelling the ranks of your army. In fact, when a region, having undergone an attack, falls under the yoke of the conqueror, the latter will have to deal with a period of transition of powers which, depending on the degree of influence of the dominating country over that region, may lead to resistance or be interpreted by the population as an act of liberation. The relationship between nations is also fueled by trade relations; the creation of special channels of communication between governments allow for an exchange of goods useful for the sustenance of one's own forces and for the recycling of resources. Through a series of accurate graphs designed to represent productive power, dislocation of resources and trade routes between the regions, it is possible to follow in detail the economic developments of one's possessions and increase the influence on opposing nationsAnd. At the diplomatic level, agreements between countries are concluded through the payment of large sums of gold and raw materials. The influence exercised by and towards the neighboring countries conditions the progress of the negotiations, which will be increasingly advantageous as the popularity of the nation will increase. Too risky moves or repeated attempts to propose unfortunate agreements can heavily condition relations between nations; you must therefore always pay close attention to what you do and above all to the context in which you move. Wisdom is the foundation of success The management of one's own regions is articulated and presents many aspects already known by lovers of the genre. The player must first of all deal with the construction of infrastructures capable of producing resources and subsequently to allow the training of units for the formation of the army. Each building has its own peculiarity and allows you to obtain particular bonuses. To this aspect of the game is added the technological research that allows, by investing turns and resources, to gradually achieve advanced upgrades of the buildings, new and increasingly efficient troops for the army and to access different types of diplomatic relations with neighboring countries. Research, while being able to focus on only one aspect at a time, can be conducted in various fields, ranging from commerce, politics, science and finally military development. Trade research unlocks various channels of communication with other nations and allows for the formation of solid trade routes; political research allows you to add new ways of communication between nations to the list of diplomatic options, allowing for example to make use of the power of espionage or to forge new types of alliances and agreements between rival countries; scientific development makes it possible to improve the production and management of resources and to increase the common good of the population; finally, military development allows you to take advantage of new units capable of making your army deadly and unstoppable. Finally, there is a further possibility to enjoy unique benefits consisting of the so-called Missions. By achieving particular political or research objectives, which constitute the requirements, it is possible to unlock access to the proposed missions. Once you have taken part in a mission and completed it, the player will be able to count on huge rewards capable of giving an extra boost to national efficiency, such as for example automatically providing each territory with particular buildings or receiving significant bonuses for managing resources and population . The achievement of a mission also has the function of exponentially increasing the influence on other countries. Are we men or corporals? The production of armies is linked to the research of new units and the training of troops and commanders. Commander experience and rank contribute to the maximum number of controllable units; these characteristics can increase with time and use in battle. Through the tactical map, the player can control his own units located on the field, represented, according to the tradition of the genre, by simple pawns. However, particular indicators underline the state of health of the army and highlight its composition. To launch an attack on the enemy, it is sufficient to move the pawn onto a territory occupied by an opposing nation. However, even war is regulated by its laws and it is good, especially in the early stages of the game when one's nation has not yet established itself as a super power, to declare war on the enemy using diplomatic channels. The use of this ~courtesy~ allows the nation to keep the level of esteem of the other countries high, as long as the act of war does not break a previous pact of alliance or worse still a coalition of nations; such a choice could have disastrous effects on the nation's image and unleash negative chain reactions from neighbors, perhaps causing the loss of influence on the newly conquered regions or even worse, rebellions on the border territories. Experience the battle on the front line The combat phases introduce the second and important aspect of the hybrid gameplay of this title. In fact, whenever the player has to deal with a conflict in the open field, he will have the possibility to choose whether to resolve the battle automatically or to take part in the command of the battle himself. This last choice allows the player to better manage the fate of the battle, especially in cases of more dubious outcome when powers of equal strength have to face each other and the automatic resolution is difficult.body could give credit to the better strategic tactical capacity of one of the two contenders. The preliminary analysis of the battle can be conducted in many respects; first of all it is possible to evaluate the effective power of the enemy army by checking which ones it perhaps deploys on the field from the tactical map and thus be able to better manage one's attacking army, secondly it is possible to evaluate the terrain of the battle by viewing the description of the area to understand the actual strategic needs and build an effective assault plan. Once entering battle mode the player has the ability to pre-set battle deployments by evaluating enemy position and strategic locations on the map. In each battle, the strategic objectives to be conquered are highlighted in order to ensure safe footholds for the troops, almost always these are more or less imposing buildings or farmhouses, all very useful as they are excellent cornerstones on which to build deadly outposts. The management of the troops in battle takes place through the classic unit management interface which can be selected in groups or individually, and also managed from the point of view of deployment, essential in more complex battles where formations such as the ~square~ or ~the double line can make all the difference in combat. The accurate placement of heavy artillery pieces or cavalry squads on the field almost always plays a decisive role as each unit has its own reaction times to player commands and peculiar characteristics regarding the reload times of firearms; these times heavily influence the success of an offensive action, for this reason it is necessary to carefully calculate the maneuvers on the field. That's right... Naval battles! But the battle doesn't take place exclusively on dry land. Let's not forget that the fate of the Old Continent in the 19th century was often decided on the waves of the Atlantic Ocean or off the mouth of the Nile, in battles that went down in history for their ferocity and the use of the most impressive fleets of sailing ships. In order not to overlook this very important aspect, Imperial Glory presents the possibility of playing this kind of battles with the same philosophy with which it faced land battles. Once you have chosen to play the naval battle in first person, the player finds himself commanding the fleet made up of the ships present in the quadrant concerned at the time of the declaration of the conflict. Once the command to unfurl the sails has been given, the ships, subject to the force of the wind, move silently among the waves. The naval battle requires greater concentration than the field battle, wind speed and ships of the are to be kept constantly in sight in order to better calibrate the attack. The ships also have different types of projectiles capable of causing more or less damage and of acting with more or less high precision. The rows of port and starboard cannons of each vessel have a reload time that must be carefully monitored, in fact the ship before complete reloading is totally disarmed and cannot react to enemy attack, moreover it is absolutely harmful to decide to change type of bullet while reloading the new battery of rounds as there is a risk of remaining without attack weapons for too long a time. The effectiveness of the shot is decided by various factors, first of all the position of the ship with respect to the target, the angle of the firing flank and the proximity of the enemy ship. Even the width of the stroke can be adjusted; increasing the amplitude the shot becomes less precise, while diluting it the chances of hitting the enemy ship when it is in the firing area increase considerably. Naval battles put a strain on the player's reflexes, and require a certain amount of preparation and patience to bear fruit. In a certain sense this aspect represents the cross and delight of the title. In fact, the possibility of playing live battles in the open sea gives the game a remarkable and rare depth, but at the same time presents problems related to the difficult management of complex battles, with more than three ships on each side. It's a real shame because the starting idea was really excellent, but the combat interface and generic setting of the clash make accurate control difficult and therefore make the experience frustrating at times. Inevitable confrontation The technical level has significant positive aspects, both from the point of view of graphic accuracy in the reproduction of troops and objects on the battlefield, and in the creation of interfaces", "date": "2005-07-05", "grade": null}