{"name": "Il wrestling dei grandi", "ref": "https://multiplayer.it/recensioni/96149-wwe-12-il-wrestling-dei-grandi.html", "text": "Version tested: Xbox 360In recent years, the WWE SmackDown vs Raw brand has been the reference point for every fan of wrestling and video games. Indeed, within the boundless world of merchandising linked to American sports and entertainment, the series of games developed by the Yuke's team and published by THQ has been able to conquer a leading role. Unfortunately, however, as often happens in these cases, as it gradually took on the features of any sports release of those that show up year after year bringing with them a wealth of small improvements and some additions, on the other hand it was starting to lose some appeal The plethora of wrestlers towards an audience now tired of the lack of significant innovations in what has always been the fulcrum of any self-respecting title: the gameplay. Precisely to meet the requests of the fans, not to lose them and to revive their interest, THQ has thought of a general renewal of certain mechanics, now considered obsolete, for its new project which precisely for this reason wants to be a sort of reboot of the brand. already starting with the title switching from Smackdown vs Raw to WWE '12. As always rich in content, the title offers various game options with dozens of wrestlers available immediately in the pre-match selection, other unlockables such as Lesnar, ~Stone Cold~ Steve Austin, Edge, etc, or, such as Shawn Michaels and The Rock , which can be activated with special DLCs, but concentrates most of its best things on the three main modes: Universe, Road to Wrestlemania and Creation. Let's see how. The new WWE Universe In WWE Universe, now in version 2.0, the user is called upon to play an almost infinite season within the world of American professional wrestling. It can last for the entire competitive existence of the champion that the player has chosen to impersonate, with a calendar of events generated by the game itself, full of appointments related to Raw, SmackDown and the various pay per view shows. All planned also in relation to the ranking of the aforementioned athlete and his rivalries: in short, the more important the wrestler is, the more the commitments of the card. Each event, each situation is reported in detail on the screen, from the matches scheduled during the week, in which the user can, among other things, take part by siding with an athlete of his choice or simulating the challenge, to the complete program of shows for the coming months . Then there are the classifications of the federations concerning the various fighters and even the news from the backstage with the relative cases that follow one another as the game progresses, such as quarrels, aggressions, alliances, betrayals. In this 2012 edition, among other things, we thought we noticed a greater prominence given in this sense to the various faces, heels or tweeners and their way of behaving inside and outside the ring. The section is full of events and statistics The mode also presents several new features starting from a system of new options capable of modifying practically every single content (perhaps in combination with the powerful Creation editors): you can create a show, decide how many matches to defend a conquered title, the days in which the shows must be aired, which athletes can or cannot participate in the events or be part of the federations (for example, it is possible to ~eliminate~ any wrestlers who in reality will be fired by WWE in the future or reinstate stars of the past), create a new belt and a new title, and so on. The ability to customize WWE Universe 2.0 is great. Another welcome novelty is the Draft Show, within which, as in reality, the athletes can be moved from one federation to another, and from a Royal Rumble to 40 fighters. The long road to WrestleMania Road to Wrestlemania is instead, as always, the basic ~campaign~ for the single player of the saga, even if this time it is more linear than in the past given the absence of those pseudo ~free-roaming~ elements that had characterized WWE SmackDown vs. Raw 2011, and the obligation to follow a single largely predefined storyline divided into three acts. In fact, in this mode, the user moves through a plot that initially involves using the ~bad~ Sheamus, then the good Triple H and finally, in the last chapter, an invented wrestler, Jacob Cass, committing himself to fight, but even to divide between intrigues and alliances of convenience in the locker room, or even in front of the cameras for some promo. By completing certain objectives set by the story from time to time, the player continues up to the climax event, Wrestlemania. The cerebral Assassin, as always, doesn't tell anyone Passing instead of analyzing the raw gameplay, it is obviously once you get into the ring that all the technical improvements made to it immediately catch the eye. Starting from the control of the athletes. All the technicalities related to the combination of keys and sticks seen in past productions have been eliminated in favor of a more immediate to use command arrangement. Now every move starts from the main buttons of the pad and at most from the left analog for certain movements, all contextually linked to the position assumed by the wrestlers in the ring. Thanks to these changes and a new system called Predator Technology, which reproduces the actions of the athletes in a much more natural way, the stiff animations of SmackDown vs Raw and the sometimes unresponsive characters to commands are only a distant memory. Grapples, pins, punches, chokeslams, counters, kicks and even the much-loved finishers to round off a match are consequently more fluid, quick and natural to execute, and with less downtime. Speaking of actions that can be performed in the ring, in WWE '12, in addition to the above, the WWE athletes of THQ from this year can finally also perform the much-loved comebacks by the public. For those unfamiliar with the terminology associated with this sport, let's say briefly that we are dealing with those phases of a match in which a wrestler, almost always the ~good guy~, suffers a series of blows from his opponent without apparently being able to react adequately. Except then recover and come to his senses, filling the opponent with blows with a series of chain moves that often even lead him to victory. Furthermore, it is finally possible to interfere with the other wrestlers engaged in beating each other, hitting or blocking them, even if the engine that manages the collisions occasionally still struggles in detecting some contacts. Xbox 360 goals The game features 49 achievements, 13 of which are secret, for a grand total of 1000 points. Many of them are related to the single player component, and therefore to the Exhibition, Universe and Road to Wrestlemania modes and the related events (match or belt victories, creation of a tag team, etc). Then there are several achievements related to particular activities within the game, such as for example the creation of personalized elements via editor and sharing them on the web, and overcoming particular challenges such as for example the one that requires the user to break 20 tables, ladders or chairs during his attacks in a game session. The little artist's workshop To try to give the product further realism, the developers have eliminated from the screen any type of hud that can signal the vital parameters of the athletes. Therefore, in order to understand their physical state, it is necessary to pay attention both to a particular blur effect that becomes visible when particularly devastating blows are received, and to the way in which the controlled athlete moves: if he holds a limb, he struggles to walk or appears dazed, obviously in critical health. The only exceptions concern letters or symbols that appear near the wrestlers in particular circumstances, such as when it is possible for them to perform a finisher (the letter F appears) or a submission is being performed and the writing Breaking Point starts, which has almost the function of a bar to be filled with the classic button mashing system. Should improved playability from several points of view and the two modes described in the previous paragraphs not suffice, there is also another very interesting one, in its own way, called Creation, to give further strength to the product. This is an area dedicated to users' creativity, where through a series of internal editors very rich in terms of options, you can customize everything: design one of the wrestlers, their income, their stories, moves, their ring name by putting together up to four audio clips, etc. A custom arena that looks like something out of a 70s porno But what stands out the most this year is the all-new option to create your own custom arena. You can intervene on the apron ring (the external area between the edge of the square and the ropes), on the type and color of the ropes, on the decorations, on the announcers and on any other aspect of the surrounding area, even using a special tool to color or even draw original logos. Everything becomes even more interesting if we consider the fact that by connecting to the internet it is possible to share one's creations with other users for an amusing file sharing, or that the invented ~scenarios~ can also be exploited in WWE Universe. About the online component, which has taken over the last few years un increasingly important role in the field of videogame productions, in WWE '12 it returns with a series of modalities largely similar to those of last year, but better refined, including the possibility of being able to participate in any type of match on the web and even at the Royal Rumble with 40 wrestlers that we have already talked about. Even if the most substantial novelty concerns in our opinion the use of proprietary servers, which should guarantee better performance than last year's third-party ones. Barrel online Unfortunately, during our test attempts we encountered the same problems, in no particular order, of connection, line stability but also lag or matchmaking: all elements, these, which seem to be known to the THQ technicians, who are all 'work to solve them, to the point that probably by the time you read this review everything will be fine. In any case, to use the online again this year it is necessary to have a pass that can be activated using the code found inside the game package (or that can be purchased separately, in the case of a used product). The usual, spectacular Rey Mysterio We conclude by talking about the aesthetic and sound aspects of the product. As for the graphics sector, here too we are witnessing a general improvement compared to the previous title, which in itself was not bad at all. The athletes are reproduced in an almost perfect way in every detail, from the face to the type of physique (which only in a couple of fighters sees some errors of proportion), from the tattoos to the reddened or slightly lacerated skin in the points where it was hit by the fists of an opponent, the attention to detail at times appears obsessive. What has just been described is also embellished by a new and updated set of animations, which while not completely eliminating some of the imperfections in certain movements or in certain moves seen in SmackDown! vs Raw 2011, in principle they manage to make them more natural, to the point that now they are certainly less wooden to perform - and to see performed by the controlled wrestler - compared to the previous chapter. The pyrotechnic choreographies, the animated audience redone almost from scratch and better defined, the shot changes and the sound accompaniment then contribute to creating the right atmosphere. Positive judgment, in fact, also for the latter technical sector, which is confirmed to be in line with the excellent general quality of the game: music, including the new intro by CM Punk, Cult of Personality, audio effects and English dubbing, by the actual wrestlers themselves, they are sure to make an impact. All seasoned with the excellent commentary performed by the official WWE commentators, ready in particular to underline, often even with a few jokes, the most salient phases of the match.", "date": "2011-12-02", "grade": "8.5"}