{"name": "American graffiti", "ref": "https://multiplayer.it/recensioni/96046-sideway-new-york-american-graffiti.html", "text": "Of indie games made with few means, which therefore focus more on the strength of the basic idea than on tinsel for its own sake to try to gain a hold on the public, and which often turn out to be conceptually better than more famous products or which had been able to count on large quantities of money during the development phase, the world panorama of videogame productions is increasingly full. Some, see Minecraft, have even managed to conquer millions of gamers, consequently making their respective developers millionaires, hand in hand with the success achieved. This may not be the fate of Sideway: New York, a platform video game developed by Playbrains, which could certainly, however, be part of that group of products capable of earning its own space among genre enthusiasts. Also because it is an original title in some ways, as we will be able to elaborate on in a few lines. But let's proceed in order. The protagonist of the game is called Nox, he lives in New York and is a graffiti artist, that is, a young man who expresses his art - such is rightly considered when it does not aim to deface buildings of historical and artistic interest - through drawings and paintings almost always made on surfaces such as walls, gates, panels and other elements that can usually make up the urban fabric of a city. Without spoiling the story too much, let's say again that due to the powers of a certain guy named Spray, the boy ends up being sucked into the world of those graffiti that he loves so much to produce, transformed into a two-dimensional figure forced to move along the walls of the his own city in an attempt, among other things, to get back to normal, save his fiance and even the whole world. Jump and explore To succeed in the enterprise, the boy must, obviously with the help of the player, fight enemies, jump or climb from one point of the scenario to another and avoid all those dangers and obstacles that appear before him as he proceeds in his path. And so far, you say, nothing new, it would seem the classic 2D platformer. So where is the originality described at the beginning? Simple, it is to be found in the concept of the product itself and consequently in the way in which the gameplay has been structured: the latter in fact provides that the typical two-dimensional game elements described above are applied on a three-dimensional scenario. The walls of the buildings within which you find yourself moving are not in fact flat and tidy, but have corners, edges, interruptions and other imperfections or physical characteristics around which to move your character. It follows, therefore, that in addition to the typical platform game obstacles, our hero must also deal with the more ~natural~ ones, given that several of the platforms and walls that make up the levels are made up of real architectural elements such as cornices, edges of terraces or window frames. And with the changes of perspective resulting from its movements. For example, a leap downwards or upwards is enough and what used to be the floor adjacent to the wall on which Nox ran until a second before becomes in turn the new horizontal plane within which to make the boy move. These sudden changes of view, deriving from the repositioning of the camera shot, can initially displace the user or cause him some discomfort, but once you understand the mechanisms that regulate everything and get used to the gaze, it becomes almost natural to follow and not arouse excessive annoyances. Beautiful and impossible To better understand what has just been described, we invite you to take a look at the video present in this review. However, these continuous changes of perspective are not ends in themselves, as you will certainly have guessed, but often serve, like some powers that are unlocked for Nox by continuing in the adventure, to overcome certain points, gain access to otherwise secret areas unreachable and solve some puzzles, the presence of which becomes important to further increase the challenge rate, which generally remains at good levels. Sideway: New York in fact presents a level of difficulty that is not excessive, it is true, but in some moments it reaches discrete peaks of difficulty, even if the continuous presence of checkpoints largely mitigates any moments of frustration in not initially being able to overcome a certain obstacle. All this, however, if on the one hand it makes the game usable even for all those who want to have fun without banging too much in overcoming certain obstacles, on the other it constitutes a serious problem in the long run.evity of a product that can in this way be completed in a matter of hours. Unless you want to play it again to explore each area and recover every object on the screen, hardly anyone will want to play it again. We conclude by taking a look at the technical sector of the game. As for the visual part, the title shows ups and downs: the graphics are nice and colorful, the scenarios are interesting in the concept, as already mentioned, the characters are beautiful, the animations a little less, especially those of the protagonist, whose movements sometimes they seem to escape the gamer's control, creating quite a few problems especially in the vicinity of some obstacles to overcome or platforms to be reached with a leap. And the strange, given the graphics certainly not heavy to manage, frame rate drops that are recorded occasionally. As far as the audio part is concerned, nothing particular to report for the sound effects, if not the classic sounds typical for this type of product which qualitatively fall within the average of genre productions, while for the soundtrack we must instead emphasize the hip music hop that accompanies the action, even if in a not directly related way since the songs follow each other without interacting perhaps with what happens on the screen. The songs, however catchy, seem to have been made by the singer Mr. Lif, born Jeffrey Haynes.", "date": "2011-11-29", "grade": "7.0"}