{"name": "Sifu: la recensione del brutale e bellissimo action di Sloclap", "ref": "https://multiplayer.it/recensioni/sifu-recensione.html", "text": "The more complex a game is, the more difficult it is to clearly convey its characteristics to the general public, and sadly it is the market itself that frequently represents the clearest proof of this theorem. True, in the past there have been many cases of extraordinarily deep titles capable of selling millions of copies or conquering passionate fanbases, yet the norm sees the more mechanically elaborate games always move towards the so-called ~niche~ or, in case of success, almost never navigate the seas of those who sell millions and millions of copies. It is also for this reason that most modern blockbusters aim for the mass of content or the predominantly narrative experience: they are easy-to-understand titles that are also attractive to those who are not long-time gamers, and a simplified system can still be qualitatively excellent if developed properly. Yet even though this path to success is still the most followed today, several teams with very different visions of gaming exist and persist, sometimes just wanting to create games based on simple personal preferences or directly opposite to what dictated by the market, in the hope of conquering those users who feel underrepresented by today's panorama. Sloclap, a rather young French team with only one active game to date, seem to belong to this curious club of developmental ~black sheep~. Their first work, Absolver, was still an atypical fighting game with numerous qualities, but partly not understood by the public and perhaps a little too ambitious for the actual resources available to the software house. The foundations of that game however remain more than solid and Sloclap has decided not to abandon them; indeed, he reused them to create a single-player action clearly inspired by kung fu films called Sifu, which recently caught the attention of several fans of the genre. We have played it, and after hours of passed levels spitting blood we don't want to get lost in frills: Sifu is one of the most mechanically granite and brilliant games we have had the opportunity to try in recent years, an impressive demonstration of talent by Sloclap, and a work whose brutal handling of difficulty will not fail to completely capture those who love truly challenging experiences. And this excellent result was achieved with a mixture of excellent ideas and design in a state of grace, for heaven's sake, but also partly inspired by an old cult of the action genre unjustly criticized by many. We explain everything to you, of course, in our Sifu review. Structure and narrative: kung fu has no age Sifu: The protagonist is very mobile, and can overcome obstacles with grace Sifu is a story of revenge, built around the typical mice of kung fu films from the 80s and 90s, but aesthetically inspired by the most modern works of ~barrel cinema~. We'll talk about aesthetics in due time (and it's absolutely appropriate to discuss it), but the narrative is already more complex than it might initially appear. In fact, the game begins with a brilliant tutorial, which literally puts you in the shoes of what will then be the final boss during an attack on a martial arts school. Everything is set in motion with the elimination of the mysterious master of that school and his young son, who is however saved by the mystical powers of a curious amulet. Protected by this artifact - which can continually save him from certain death by taking a few years of life in exchange - the boy swears revenge against the five individuals who organized the assassination of his father, in a desperate mission that could cost him everything. rather basic premise, we realize it, however it moves well to the management of the campaign divided into five levels, one for each ~goal~ of your alter ego. The protagonist's hunt is not, however, a simple delusion of omnipotence: over the years ours has compiled an investigation bulletin board, where by advancing through the maps he obtains new clues and objects essential for advancement; these searches are very important to understand more deeply the motivations of your targets, and at the same time they represent one of the cornerstones of the curious progression of the title, since they allow you to avoid entire parts of the levels, speeding up their completion enormously. Sifu: watch out for weapons, enemies can use them in turn Yes, because in Sifu the maps are not simple arenas full of opponents to beat up: the level design is fairly elaborate, offers numerous interactive elements, and at the first crossing of each location you will find numerous blocked doors waiting for you. Thekeys and the objects necessary to unlock these passages are found respectively in the levels themselves or even in subsequent frameworks, which leads to retracing the already completed paths several times to obtain new information or simply having to deal with fewer enemies. In fact, the basic version of a level is often full of clashes and enemies, and makes it extremely difficult to reach a boss without ever dying. Considering that your years of life are limited, therefore, it is often a good and right thing to go back to past levels to finish them with fewer deaths on your shoulders, so as to have a better chance of completing the next one. Ah, the loss of years, however, is a mechanics apart managed in our opinion in a brilliant way. The better you play and the more enemies you eliminate, the less years you'll lose to deaths. Get killed many times in a row and the years counter will start to increase gradually, until you take even more than six or seven years of life with each death. After seventy you will therefore have only one last chance; make mistakes and you'll have to try the last level over again, trying to get to the conclusion in one piece. Gameplay: The god of the hand is back Sifu: Getting surrounded is never a good idea Said in this way it may seem an absolutely brutal structure, and in some ways it is, so much so that it almost approaches a sort of mutation of what is seen in certain roguelite titles ... yet Sifu is absolutely not an unfair video game in its wickedness. In fact, once a level has been unlocked, the age at which it is reached is saved, and this can be decreased by retracing the previous picture with greater skill. As mentioned above, the objects scattered around the maps allow you to unlock clever shortcuts that greatly facilitate the completion of everything with fewer deaths, and there is even a character growth system, with passive upgrades and extra kung fu moves that represent a very useful tool against certain types of adversary. This is exactly where the beauty comes in, because from a mechanical point of view, Sifu is a truly rare quality title, which perfectly integrates its level of challenge with the progression of the player's skills and the virtual growth of his alter ego. In fact, eliminating enemies , allows you to obtain experience points, which can be spent upon death, at the conclusion of the level in the main hub, or by interacting with specific statues scattered around the maps (they are rare, so it is not the case to rely excessively on them). Their use offers two possibilities: to passively enhance the protagonist, or to add new techniques to his arsenal. Passive upgrades are extremely useful, because they allow you to improve life regeneration every time you KO an opponent, focus bar recovery (which we will explain shortly), or stun resistance (which progressively increases if you block too many blows however it is when martial arts are aimed at that the game of Sloclap seriously starts to shine. Sifu's combat system still closely resembles that of Absolver, with a similar response from the commands, a remarkable variety of blows, and a view mainly from behind with rather free three-dimensional movement (but still conditioned by the position of the antagonists). Here, however, the enemies are frighteningly warlike, they are not afraid to attack you at the same time, and boast an enviable variety of attack patterns, which forces the player to use the right technique at the right time most of the time. And in this element, i.e. the application of defensive mechanics and the management of clashes, Sifu seems markedly inspired by none other than God Hand, the very bad classic by Shinji Mikami, to date considered among the most satisfying and difficult titles in the entire action genre . Let us explain ourselves better: in Mikami's work the extreme variety of enemies and their non-underestimated number forced us to use cleverly not only the customizable moves, but also the movement - getting surrounded was suicide - and the various dodges, with these last fundamentals to get out of one-on-ones without a scratch. Sifu is much more intuitive in moving and managing moves, yet he follows an extremely similar philosophy: the battlefield must be ~controlled~ by cleverly repositioning himself and avoiding groups of enemies, dodging on the spot is usually the best way to avoid blows , and some ~elite~ enemies have an almost impenetrable defense until you can get them exposed by dodging their series of attacks with the right mechanics. Of course, Sifu also simplifies things a bit with more environmental interactivity - weapons and maps are availablethrowable items, fabulous for gaining an edge - but then you get to the bosses, and in those situations it's all about reflexes and chosen techniques. However, the beautifully calculated system of the game still manages to artificially facilitate things for those with a little cunning, as certain skills used with the right timing represent an exceptional asset for survival (a tip: the counter on the ground is a godsend if you struggle to avoid low blows). Ah, don't think you can abuse the mechanics: there aren't always effective moves and the enemies don't suffer them ~cold~ more than a couple of times; in addition, restarting checkpoints upon death does not return you to the previous age, and also leads to a complete reset of the techniques learned, regardless of the age of your character. The only way to maintain your martial arts is to unlock them multiple times to make them permanent, so focus on the more efficient ones. It doesn't end here: the game even takes up the ~demons~ system from God Hand; it is in fact possible to quickly eliminate certain stunned opponents with executions, only that sometimes doing so causes them to enter a sort of berserk state which transforms them into elite enemies with more complicated patterns and greater resistance. We are not faced with the level of annoyance of the fearsome demonic enemies of Mikami's work, for heaven's sake, but in an excited battle the appearance of one of these funny guys can really get you into trouble. There is one upside, though: killing an elite lowers your death counter, ensuring you age less with each defeat. Paradoxically, therefore, you may actively seek out some of these opponents in the later levels, once you understand how to defeat them without too many problems. The mix of refined mechanics, alternative routes in the levels and the need to constantly improve to avoid permadeath also eliminates any repetitiveness. Redoing the maps is not tedious, but a constant challenge with oneself, the goal of which is the achievement of the perfect performance. Technical sector: the wonderful aesthetics of slaps Sifu: A corridor normally equates to a spectacular series of clashes In this hardcore concentrate of virtual punches and kicks, the other aids depend only on the resources available to your alter ego, which we mentioned while we were talking about passive boosts. The aforementioned focus bar in fact allows you to use special moves useful against almost all enemies, which ensure that you go beyond their powerful defenses at least once (it fills up slowly, but that's it), stunning puts you in danger if you overdo it with the parries - always efficient defensive maneuver, which cares little about the direction of the attacks received - therefore properly enhancing stability offers a slightly more solid defense, and the increased regeneration or greater resistance of weapons (clearly destructible) should not be underestimated. Having said that, don't think that a little experience obtained makes the game a walk in the park: the difficulty curve rises suddenly from the second level onwards, and if it weren't for the optimally calculated shortcuts you would practically never have a break. This awesome martial arts banquet isn't 100% flawless though. During the campaign, in fact, we happened to find rare enemies with erratic patterns, which seemed to respond in a strange way (almost out of time) to our defensive techniques. In addition, there were some bugs, such as opponents ~leaping~ from the screen that forced us to restart the checkpoint, or strange manifestations of the title's physics engine, mostly hilarious if nothing else. However, we've only seen the above case with a couple of elite enemies, and we've never had similar issues with others, so we don't see it as a particularly significant issue. Not so good the bugs, but it's all stuff that can be largely solved with future fixes. Sifu: a club where there is no dancing On the other hand, the aesthetics of the game are applauded, which left us speechless more times than we thought possible in a work of this type. Seriously, what the graphics fail to achieve - which in any case rest on very remarkable animations and a very respectable level of general detail - the art direction effortlessly gains. Sloclap, after all, seem to be lovers of kung fu and action films, and their work pays homage to a large number of films of the genre, from Gareth Evans' The Raid to Tsui Hark's feature films, even passing by Tarantino's Kill Bill . There are maps (the museum in primis) where the use of colors and lighting is masterful to the point of significantly levitating the qu", "date": "2022-02-06", "grade": "9.0"}