{"name": "Combattimento dentro la Matrice!", "ref": "https://multiplayer.it/recensioni/95747-kung-fu-high-impact-combattimento-dentro-la-matrice.html", "text": "The Finns of Virtual Air Guitar, already experts in the genre with Kung-Fu Live released on PS3, are back with their favorite leitmotiv: to transport the player directly ~into the TV~! Where their first experiment used the Playstation Eye camera, with the arrival of Kinect for Xbox 360, the possibility of developing a game that not only transported our image in bitmaps - inside - the game, but also managed to perceive depth and three-dimensionality, characteristic of the Microsoft sensor. Wax, wax off! Kung-Fu High Impact is a scrolling fighting game in which we play the protagonist of a comic strip based on martial arts, through 16 levels characterized by a fairly heterogeneous amount of enemies, the classic boss fights and power ups galore. Our image, once the game is started, turns out to be quite ~clean~ and with defined outlines, unlike some old games that used similar technology but were unable to obtain equally optimal results. And therefore, to hit the enemies we really have to throw endless kicks and punches, obviously in the right direction and with the appropriate intensity, under penalty of the fateful gameover. The funny thing is that our image is ~teleported~ within the game not only during the action phases, but also while the comic strips that tell the story of the game are scrolling. During the adventure, new powers and combos are unlocked, for example the possibility of unleashing an ~electric~ attack simply by implementing Dragon Ball-style poses in front of the Kinect sensor. Moments of intense hilarity ensured with friends. Unfortunately these moments are not even that long-lasting because the game levels, all nice, very well characterized and designed, are decidedly short and simple. Kung-Fu High Impact is therefore completed in a handful of hours, even if its replayability is mainly linked to the desire to ~show~ it to friends rather than reliving it as a single player experience. Despite this, it is equally true that Kung-Fu High Impact also has other alternative modes. For example the survival one, in which you face endless hordes of enemies and try to stay alive as long as possible. Or the multiplayer mode that sees the participation of up to a maximum of four of our friends, who simultaneously control the enemies through the traditional joypad and try to take us out. There is also a particular mode in which to create real personalized matches: you choose the round, the enemies and their quantity, then start the challenge and fight. As for the use of Xbox Live, the game has its own online ranking with the various scores obtained that can be compared with the objectives achieved by friends on the list, but it has no online multiplayer mode nor a ~live~ two-player mode. players. You don't learn Karate! The gameplay of Kung-Fu High Impact is almost linear and quite simple. It's all about hitting, parrying, and pulling off a few combos throughout the game. There are no particular difficulties, puzzle solving or a complicated story behind it. The Kinect perfectly detects movements and translates them into action instantly: in addition to punches and kicks, it is therefore possible to jump, raising your arms and suddenly pulling them down, or blocking opponents' blows by positioning your arms or legs in the direction from which the moves come. Simplicity is the key to the game, a factor that tends to entertain the whole family but which could make some more experienced players turn up their noses. Kung-Fu High Impact does not have a gradual difficulty curve: it starts easy and ends with the same degree of simplicity, apart from a couple of bosses in which there is more to sweat on average, but nothing transcendental. A very comprehensive tutorial, and in Italian, introduces us to the first basic moves to be used during the adventure. Subsequent ones are unlocked and learned during the succession of the various levels. The game is characterized by a very pleasant, colorful and well-designed cartoon style, as well as by a good characterization of both the various levels and the characters. Even the accompanying music, although it does not represent a memorable soundtrack, is suitable for the cheerful and carefree context, with rhythmic songs that go well with the frenetic action that Kung-Fu High Impact asks of the player. This game makes you sweat a lot, thanks to the amount of enemies that appear on the screen and the speed with which they attack us, players who love sofas and comfort are warned! Get ready to do fitness, this is a valid alternative to the various Your Shaeg, MelB and Sport Active. Its real weakness, however, is the excessive brevity, a factor that would have made it perfect as a title to download on the Xbox Live Marketplace, rather than packaged.", "date": "2011-11-24", "grade": null}