{"name": "L'ultima guerra del DS", "ref": "https://multiplayer.it/recensioni/96014-call-of-duty-modern-warfare-3-lultima-guerra-del-ds.html", "text": "Version Tested: Nintendo DS One thing is for sure: Nintendo didn't sell nearly 150 million DS because people thought it was the ultimate handheld for playing FPS games. Even the experiments of the Kyoto house in this sense (Metroid Prime: Hunters) have not convinced, given that the stylus / touch screen combination on the one hand undoubtedly boasts great precision, on the other it is inevitably inconvenient for games that exceed the five minutes. Those who have tried their hand at a shooter for Nintendo DS know it well: the left hand must shoulder the entire weight of the console, act on the backbone L to shoot and on the d-pad to move the character, while the right hand is solely responsible for the task of ~drawing~ the position of the crosshair on the screen. In short, cramps are guaranteed. Despite this systematic problem, which is accompanied by the far from negligible hardware limitations of the platform in terms of polygonal calculation and resolution, there are developers who have not only not given up on making FPS for DS, but who have also succeeded in enterprise in a more than decent way. This is demonstrated by the episodes of the Call of Duty series, translated on the handheld by the double screen by N-Space over the last few years: the first two Modern Warfare, World at War, Black Ops and now Call of Duty: Modern Warfare 3, extremely similar from a structural and technical point of view, but equipped with more and more refined features, such as a decidedly surprising online multiplayer mode. Let's start with the latter, for once: once the settings for the Nintendo Wi-Fi Connection have been adjusted, it is possible to host a game by inviting your friends (up to a maximum of six players) or search for the first available match. There are six modes available: traditional deathmatch, or ~all against all~; team deathmatch; ~sabotage~, in which one team defends an emplacement while the other is tasked with destroying it; ~gun game~, in which you start with a simple pistol by upgrading and enriching the arsenal based on the kills; ~sharpshooter~, which gives players a random weapon that changes after a while; ~a shot in the barrel~, in which everyone has only one bullet to eliminate their opponents, which resets with each hit scored. The matchmaking is very fast, which means that there are quite a few people online, and we didn't notice any particular problems related to lag. Certainly the experience cannot be compared to that obtainable on PC, Xbox 360 or PS3, but bearing in mind the characteristics of the Nintendo DS there is something to be surprised. From Russia with love Beyond the fun multiplayer mode, it is the single-player campaign that forms the core of the game, with its fourteen levels in which we will find ourselves playing the role of American and British soldiers, in a fight without quarter to eliminate a dangerous Russian terrorist . The action doesn't feel much different from previous installments of the Nintendo DS series, and the ability to switch between traditional controls (using the A, B, X and Y buttons as if they were a second d-pad) definitely makes the more comfortable experience than the previously mentioned system which involves the use of the stylus and the touch screen. Touch screen which is still called upon to reload the equipped weapon and to switch to the secondary weapon or grenades, as well as to complete some simple minigames that simulate the hacking of a computer system, for example. The standard gameplay often alternates with extra sections that have the merit of adding a pinch of variety to the game, such as when you take up your sniper rifle with the aim of clearing an area of enemies, following the indications of our companions about their position; or when switching from first to third person within some night missions, finding ourselves coordinating team movements in an RTS-style context and then returning ~live~ and eliminating immediate threats. There are also the phases in which you get to drive vehicles, in this case a powerful tank. In short, structurally Call of Duty: Modern Warfare 3 - Defiance turns out to be smooth and proceeds without particular hitches, even if it takes a few minutes to notice its shortcomings: on the one hand the AI of the enemies, particularly poor; on the other, the problems deriving from the low resolution of the screen, and which in firefights from the medium distance literally lead us to aim for the single pixel. The work carried out with regard to the graphic sector, beyond this problem linked to the characteristics of the console, is distinguished by the richness of the scenarios and by the attempt to insertre also the bullet times (with fluctuating results, actually) to bring the portable reduction of COD as close as possible to the original version.", "date": "2011-11-24", "grade": "7.8"}