{"name": "Minecraft", "ref": "https://multiplayer.it/recensioni/95964-minecraft-sopravvivere-a-minecraft.html", "text": "And finally the 1.0 version of Minecraft has arrived, that is the one considered definitive which... is absolutely not definitive. As soon as it was published, during MineCon 2011, it was immediately clear that it is only a formality and that the Mojang game/project will continue to evolve, also because many of the features shown or promised in recent months are missing. The novelties compared to previous versions are few and fall within the logic of continuous updates to which the game has been the subject since the Alpha phase. There are new items, there is a clearer end game, there are new objectives, new monsters and there is also a boss, but fundamentally almost nothing has changed: you continue to dig, you continue to combine raw materials and above all, we continue to create. Yes, there are also the bloody creepers. However, it is still version 1.0 and the time has come to sum up with a proper review. All of the article's boxes were edited by Simone Franco, alias simiz, to whom we thank him for his collaboration. How do you review Minecraft? Minecraft review is a particular article that pertains to a particular game. In reality, to be precise, the Minecraft review exists as a becoming, not as a tombstone that puts an end to a discussion that began more than two years ago. Wanting to specify the nature of what you will read, this article is only one of the many appendices of the specials and insights dedicated over the months to the work of Notch first, then Mojang, which alone are enough to answer all the questions that arose around this telluric phenomenon, born from the network in a completely involuntary way. Poor chicken It makes no sense to wonder if it will sell, because Minecraft has already sold: it is the first video game in history to be a global success well before the final release. As an indie it was a hit with one hundred thousand copies, it was a huge hit with one million copies, today it sells over four million copies and, probably, those who wanted to buy it have already done so, while those who despised it certainly won't change their minds with the release 1.0 which establishes a stake, of course, but is proposed as a simple reinforcement of what has been produced over the months. Meanwhile, the Internet has been flooded with mods and videos showing gamers grappling with this Shangri-La of creativity, in which research and inventiveness are the center of the action and not side elements that can be skipped if desired. If one day someone had told us: ~what do you think about spending dozens of hours digging to find rare minerals to use to produce objects~ we would have replied ~you're crazy~, or ~you're Marchionne~. Instead, the writer has been following the scene of the game for two years (purchased at the time of the Alpha version) and who returns to it more and more willingly, to dig, explore and build. Modding How does the game end? There is no answer to this question as the title, thanks to the support of mods, can contain an infinite amount of new elements, blocks and items created by the community. Currently there is no official editor, but thanks to a decompilation tool approved by Notch, it is possible to legitimately obtain the source code (provided that you have purchased the full game) and modify it to your liking. Furthermore, to apply the mods it is necessary to replace the original game files with the modified ones, and very often more than one mod installed at the same time can create conflicts and crash the game (this problem can be solved with the use of modLoader, a tool which resolves all conflicts automatically). Luckily for us though, Notch has announced the development of a solution to these problems and the addition of official mod support. Finally, to name a few, Finite Liquids v5, the Aether, and MineColony deserve particular attention. Is there a before and after Minecraft? Minecraft is also important for another reason: it's the first game that became a hit before it was released. Those who bought it two years ago followed its development and, if desired, were able to interact directly with Mojang to guide their decisions. It is the first time that a videogame product receives such credit and manages to wedge itself in the ganglia of the industry by questioning many of the precepts taken for granted. One of the new enemies Notch and Minecraft have achieved unlimited trust thanks to their transparency, that is, they have not hidden behind proven marketing formulas and have not followed forced stages in the release of new content. The evolution of Minecraft has been a natural process which, albeit with some ingenuity, has always put the user first. Also Notch, now almost onemythological figure of the indie scene (and beyond), he has always maintained his image of ~nerd gamer~, despite his success, re-proposing the all-encompassing figure of the developer suffocated by the triple A scene due to production needs. The way to deal with the Bethesda affair and the Minecraft release trailer on Xbox Live Arcade are proof of this, which, in its sublime ugliness, perfectly renders the atmosphere that reigns around the game and which has become part of it. What is Minecraft? Yet for some it may be difficult to understand the spirit of Minecraft and its deep appeal. Imagine being alone in a forest without having the slightest idea of what the hell to do. Around you there are only trees, some harmless animals and flowers. In the distance you see a river. Beyond the river the profile of a small hill stands out. Start spinning. Collect some material, kill the local fauna for food and spend a few moments admiring the scenery. Without realizing it, the night has come. The animals become restless, darkness has cloaked everything and the light of the stars palely draws the still unknown world in which you find yourself. The sun is going down. The Creepers are coming! With your ax in your hand, you continue to collect wood, also because you really don't know where to go. One, two knocks and here you hear a strange verse piercing the silence. You whirl around and in the distance you see a creepy figure approaching you. Where did this evil creature come from? Grab the wooden ax created with the wood collected and you are about to hit him, but the fight sees you succumb. There is something not right. Reappearing on the map, it is still night and you decide to find shelter, also because in the meantime you have lost everything you had collected and the creatures have multiplied, making it impossible to search for new material without risking your life. Chased by some skeletons and some zombies, you reach a cave where you manage to survive the night. With the rising of the sun, the monsters disappear and you can go back to collecting material, but with finally a goal in mind: to create a shelter equipped to let you survive the twilight and where you can work hard to build equipment suitable for the challenge. Master music Notch has chosen Daniel Rosenfeld, aka C418, to take care of the audio sector of the game. The composer, still in an ~artistic~ gestation phase, happened to be on Notch's IRC channel, while ours was showing the prototypes of his game. Intrigued, C418 played him his music. Notch liked his style and asked him to score Minecraft. He was very skilled in adapting his musical style to that required by the game, creating a calm and relaxing music, which almost seems to relieve the fatigue of digging. When did you start making music and why? In terms of timing, I started playing around the same time as Gorillaz's Demon Days came out. The reason was and remains the same: because it's a fun activity to undertake following the same path that every musician follows. The first song is always terrible and many are probably demoralized at this point. Instead, I chose to continue doing it, trying to see the positive aspects of this activity. And here I am, still making music. Did Mojang and Minecraft become an integral part of your life after working on the game? What is it like to live their reality day by day? I'm not an employee of Mojang, I've worked for them externally and know almost no one on the team other than Notch. So I can't really answer your question about what it's like to experience that reality from within. I don't know many teams that have a composer in house and after all, for a musician, this could be a negative limit for one's creativity. When and how did the collaboration with Notch come about? Still Mojang didn't exist as a company at the time, it was just a name Notch liked. When he asked me to compose the soundtrack, the game was at an embryonic level: there were only five different blocks and the ability to randomly spawn some enemies. We kept in touch via IRC, he showing me his progress on the title and me listening to what I had achieved. When we realized that we have the same taste in music, he asked me to create something for his prototype and here we are. Listening to the songs in the game and then in the album ~Minecraft - Volume Alpha~ you released, Thirteen is the most curious piece and on which more mystery has been created. Can you explain a little more about its genesis? Its story is incredibly simple: I created it becausewas played at specific points but, since at the time of its implementation Notch was rushing to release a new update, tied it to the opening of the chests that can be found in dungeons. Since it was talked about a bit anyway, I developed it further with new songs implemented and to be implemented later. How was the genesis of the other songs? Do they refer to something or are they simply pieces of music created to best accompany the gaming experience? Each song has a little story, of course. But what I wanted to do above all was to create a list of music that was as varied as possible. Although they are almost all ambient, my goal was to emphasize different moments in the best possible way so as to accompany the experience and make sure that everyone liked at least some pieces. The last song, Beginning, what does it mean? It marks the beginning of Minecraft's musical future. There is still a lot in the pipeline and I want it to be even better than what is already there. Thanks for your time and good luck with your future projects. From primitive man to technological man After all, Minecraft offers the player an atavistic challenge and harbors within itself the image of the evolution of society. Thrown into existence, in order to survive the dangers of nature, human beings learn to exploit its resources to feed themselves, build shelters and work tools. Resource gathering is still central. The best materials are found at the bottom of often very dangerous dungeons Once the primary needs have been satisfied, technology becomes the goal. Once the Minecraft player has learned the rudiments of the game, he enters a universe made up of social exchanges. We are not referring only to the multiplayer mode, but to all those ~outside the game~ actions that characterize the experience. How many have exploited the know-how of other players by consulting the various dedicated wikis or asking on thematic forums to solve a particular problem? The action itself, which some might equate to consulting a solution, is actually very different, because the goal of the Minecraft user, after a few hours of play, is no longer to finish the adventure, but to be able to produce something, often to be shown to others through videos on YouTube or in any other way. In other words, a collaborative/competitive social relationship is established between individuals, in which whoever proves to be particularly good gets everyone's admiration. In short, creativity becomes a driving force capable of marginalizing all other aspects of the playful experience. Minecraft Cultures Minecraft is a clone derived from Infiniminer, along the lines of Second Life. But what is really special about having collected four million sales only in the development phase? It has the gameplay of Second Life, but not that of today, that of several years ago, where anyone could get their clod of land for free and indulge themselves in creating anything and selling it. Then mixed with an adventure, survival and action component. But more importantly, it has its own graphics. Just think: it's a game created by a single man who found a way to create huge worlds without using too many resources of our computers. He locked up reality in a video game. But to do so he had to pay this price: he transformed our reality into virtual blocks. And these blocks are today the symbol and luck of the game, they have become fundamental to its enormous and surprising success. The result? Take a look at a natural paradise reproduced in Minecraft. It's a jaw-dropping block show. A world of cubes Minecraft also deserves to be examined from a graphic point of view. The game was born with its characteristic aesthetic cubes for purely technical reasons: the cubes allowed Notch to have a very simple and fast primary unit to work with. It was unthinkable to use more complex objects, providing them with such a level of interactivity, in a project carried out by a single person. The cubes were perfect for disassembling and reassembling the game world without too many worries. Out in the forest, danger lurks You take a cube, coat it with texture, assign properties and you're done. The Minecraft aesthetic is born when the user perceives the beauty of those primary forms ~heaped~ in the levels and, starting to conceive the game as a palette, manages to bring out his own, very angular, works. Other graphics engines are infinitely more powerful and beautiful to look at at first glance, but they don't allow you to take the game world and manipulate it to the point of making it completely different. The graphic beauty of Minecraft is to be found", "date": "2011-11-23", "grade": "9.6"}