{"name": "Cars 2: Il videogioco", "ref": "https://multiplayer.it/recensioni/95600-cars-2-il-videogioco-motori-ruggenti-in-3d.html", "text": "Tested version: Nintendo 3DS The world of tie-ins, i.e. the fearsome (qualitatively speaking) video game productions dedicated to the films of the moment, beyond rare but pleasant exceptions, represents a sort of ~Uncyclopedia~ of video games, a rather full-bodied sample of how a title should not be developed. However, in the field of animated cinema, in particular for Pixar/Disney productions, the games produced are usually dedicated to a smaller audience, whose only goal is not the hunt for the frame or the super texture but, more simply , have fun impersonating your favorite heroes. And Cars 2: The video game (henceforth simply Cars 2) was created for this very purpose, always remembering that for children under 6 it is advisable in any case to deactivate the 3D effect of the 3DS upper screen. Brum brum Lightning McQueen, Luigi, Mater, Francesco Bernoulli: the numerous fans of the Cars series, born in 2006 and which saw the sequel arrive last June, will know these names very well. In fact, as is well known, the protagonists of Disney production are cars of various kinds perfectly humanized with well-defined voices, thoughts and characters. Nonetheless, they certainly did not forget their nature as motor vehicles and indeed the fastest cars, such as Saetta, became the most famous as protagonists of numerous Grands Prix. In Cars 2, however, in addition to helping and taking care of Saetta for the victory of the World Grand Prix, the likeable Mater, born as a simple tow truck for broken down cars, becomes the involuntary protagonist of a captivating spy-story. In fact, an international intrigue tends to discredit the new Allinoil fuel, ecological and performing, in favor of petroleum and its derivatives; therefore, parallel to Saetta's races, Mater (and not only him) participates on behalf of CHROME, in various alternative stealth-style adventures, to foil the perfidious plans of Professor Z. Testing the facts, however, the result in terms of actual gameplay does not reach the desired objectives: analyzing the purely racing side for example, the approach chosen by the developers goes beyond the concept of fun arcade that even the smallest user is able to appreciate. In fact, the cars always run in the same way, without the need to slow down and without the bumps, except in the case of terrifying head-on collisions, being able to slow down the action in any way. Behaviors do not vary even when changing the type of track, car or even cutting off the ~escape routes~ of the circuits, effectively removing any type of bite. However, the stealth part is, if possible, even worse: repetitive and boring, the missions basically consist of achieving certain objectives while avoiding the (mild) control of the self-agents and then escaping from the place reached by paying attention to the pre-calculated obstacles. The machines also have some contextual special abilities at their disposal, such as the turbo, the ability to jump, become invisible or send a pulse capable of canceling electrical devices such as cameras or satellite dishes. The 3D effect Despite the general quality certainly not exciting, the 3D effect in Cars 2 is well done, not annoying and pleasing to the eye even at the highest levels. However, the activation does not return exciting sensations but, in the general flatness, it is certainly one of the most successful features. There's more? In addition to the main story, which lasts less than 2 hours, it is also possible to select from the main menu the quick elimination race and, using the tracks unlocked throughout the story, the C.H.R.O.M.E. mode. which simulates at will all the competitions previously faced. The multiplayer up to 4 players off line finally completes the picture of the situation. Technically, despite the warnings expressed in the introduction, it is unfortunately difficult not to notice in Cars 2 the maintenance of the non-exciting general quality, not so much for the color rendering and the framerate, however acceptable even in 3D, as for the embarrassing washing-out of the textures and the pop-up effect of the circuits, frankly inexplicable given the potential of the console. Clearly the rebirth of the 3DS, currently underway, cannot pass through titles of this magnitude which, however, something not to be underestimated, enrich the newborn Nintendo portable console with famous brands with numerous small fans attached. Comment Atmospheres reproduced excellently for the youngest fans Racing part at the beginning fun... ...but devoid of any bite Boring stealth part Technically subdued", "date": "2011-11-22", "grade": null}