{"name": "Eliche 2.0", "ref": "https://multiplayer.it/recensioni/95748-dcs-ka-50-black-shark-eliche-20.html", "text": "We continue the collaboration with the Fighter Combat Sims virtual flight group which, after the excellent results of the articles on the DCS A-10C Warthog and the Hotas Warthog, has allowed us to produce a review of the DCS Ka-50 Black Shark 2.0. The curator of the piece, Andrea Papaleo, has enormous experience in the virtual skies and resumes his commitment on Multiplayer.it after personally supervising the pieces mentioned above. Obviously our invitation remains to visit the Fighter Combat Sims official website, join the community and take advantage of the tools designed for the learning phase of the complex mechanics underlying the use of these products. Among other things, a subsection dedicated to the newcomer from the Eagle Dynamics house was recently opened, so as to make it easier to learn more about the complex helicopter simulator discussed here. Almost three years have passed since the first release of the Black Shark: it was December 8, 2008 and the digital version of the simulator was made available on the net. While in Russia the simmers were already flying with Kamov, NATO reporting name. A lot of progress has been made since then, compatibility with Flaming Cliffs has come to the fore and, after several patches and tests, the two simulators have become compatible. History repeats itself today: the A-10C Warthog, finally properly patched and with solid foundations for the future, forces the developers to release an update - which almost represents a completely new title - the DCS Ka-50 Black Shark 2, exactly. This move though has given some quite a stomach ache, to pay or not to pay for an upgrade? Ultimately it is a remake. And a lot of work has been done above, so it is right to reward the effort that this software house is making. Flight lessons Available in digital delivery at the price of 19.99 dollars for owners of the first version - for those who want to buy the full version, the price is 39.99 dollars - the game first lets us download files for 4.59 Gb from the download section of the Eagle Dynamics website and, after purchasing a CD-Key, we can launch the installation of the simulator. It should be remembered that ten activations and the same number of deactivations are available. The latter come in handy when we have to update our hardware, for example. The integrated Starforce protection system, in fact, does not allow the hardware change without first deactivating the serial number from the previous one. Nothing to say about the graphical interface: intuitive and navigable, it is practically identical to that of the A-10C with options that lead the player to face Instant Action by projecting in the middle of an attack against hostile troops. Or the Campaigns present, lasting about fifteen hours depending on the level of difficulty selected. And this is precisely one of the cornerstones of the simulation. We can choose whether to take flight on maximum difficulty or in a completely arcade way, making life aboard the Kamov easier. However, the product is intended more for an audience looking for real simulation: with the difficulty set to the maximum, without aids and with a myriad of keys to press, flying is practically impossible without adequate preparation. To help newbies there is a section completely dedicated to Training, which is divided into as many sections, such as ignition of the vehicle, vertical take-off and landing. To then move on to more demanding missions, such as launching missiles or using the Shkval, a monitor that helps the pilot locate and hit targets more precisely. Firing the on-board machine gun is something exceptional and, if you have a joystick, it's like being on board. Each shot fired will make the helicopter vibrate engaging the pilot to maintain the attitude, all surrounded by a force feedback inserted in an excellent way. Flying this helicopter is not easy, but with a little training and a lot of patience, the results can be seen. Moreover, the physics have been refined and you really have the sensation of flying in a real helicopter: if we land abruptly, the wheels explode or, when there is wind, our aircraft is hit by turbulence and gusts. The Caucasus, the scenario that has been the basis of all Eagle Dynamics simulators for years, has been revised, the seasons have been implemented in an optimal way and all optimized for the user with a less performing PC. Graphics and AI At the base of everything is the Eagle Dynamics engine which, unlike past years, has dynamic lighting, soft shadows even inside the cockpit, scalable HDR effects, sea reflections, clouds that move and change shape. . short, the guys at ED made an orexcellent work starting from the A-10C to give all this show of effects also to ~helicopter~ users. The textures of the vehicle are several, in high resolution and selectable from the Mission Editor, also updated with more functions. It is even possible to arm our helicopter for the next mission, which in the meantime we have patiently structured with ground troops, Fighters and AWACS. Every single vehicle, from tanks to planes, reacts to fire, looks for tactics to attack us and behaves very realistically. We see planes taking off from the runway following a particular procedure and once in flight they tell us their position or point of attack. The developers, from this point of view, have worked hard, and the result is more than good. Team flight Thanks to full compatibility with the DCS A-10C Warthog module reviewed on Multiplater.it, the longevity of the simulator is practically infinite. Once the single missions and campaigns have been played, we have the option of flying cooperatively with the A-10s or participating in a Ka-50 mission against the A-10s. Cooperation is the basis of everything, the end user will be able to create missions of any type and thus manage the flights. Finally, thanks to this DCS Ka-50 Black Shark 2 we will see pilots on the battlefield who help each other to complete a goal and, with the times running, it is fresh air for lovers of flight simulators. to know more Fighter Combat Sims has also managed to exchange some jokes with Matt ~Wags~ Wagner of Eagle Dynamics, here are the answers to the questions asked to the producer of the Russian developer. What problems, especially in terms of flight model, did you encounter when switching from Black Shark to Black Shark 2? Even talking to my team internally, we can't pinpoint any real issues encountered when switching between them. In terms of the flight model, little has changed. Just some improvements to the vertical rotor. Do you take user feedback into consideration to improve your simulations? Like everyone else on the team, we read our forums with great interest. In many cases that feedback has led to improvements on the DCS series games. In other cases, however, some requests are simply not realistic, technically not feasible or that we cannot yet openly discuss. That's why we have a Wish List in the form of a sub forum... it's a tool that we really take into consideration internally at Eagle Dynamics. What news to expect in the coming months for the series? I have to refer you to our official communication of these days, unfortunately I can't go beyond that. How do you see yourself five years from today, leaving out the modules currently under development?<br> Over the next five years we intend to release other mediums, of course. But in addition we will also develop new maps and other content. What's more, we are also working with some third parties who are working on other projects. What stage are you in introducing dedicated servers? Dedicated servers are among our priorities!", "date": "2011-11-17", "grade": "8.5"}