{"name": "L'ultimo dei Kirby", "ref": "https://multiplayer.it/recensioni/95594-kirby-mass-attack-lultimo-dei-kirby.html", "text": "This has been a busy autumn for the funny little pink creature from Nintendo, who has had to juggle two practically simultaneous releases, one on Wii and the other on DS. Furthermore, the latter has involuntarily taken on a great responsibility: to close the era of the previous Nintendo portable console in a big way, ferrying the first-party titles to the new handheld with many promises and competitive ideas. Kirby: Mass Attack succeeds, but perhaps in an unexpected way, demonstrating how Nintendo is able to reinvent itself and offer high quality game design without forgetting the fans of a certain franchise and those who may be looking for something new and at the same time. familiar at the same time. Spiritual heir of Canvas Course, the Kirby who in 2005 effectively launched the touch-screen fashion in the Nintendo DS toy library, Kirby: Mass Attack is perhaps the most complete and intriguing incarnation of the franchise, despite the clear detachment from the traditional setting of the series. Diesc Kirby is better than uan Just as Kirby: Canvas Course had inaugurated the Kirbyan season of the Nintendo DS with something different from the simple platformer we've been used to for years, Kirby: Mass Attack also closes this long parenthesis with an almost completely new concept. We say ~almost~ because we've actually already glimpsed it in Pikmin and in the Canvas Course itself, albeit in a slightly different way. The bad guy of the moment has managed to divide our chubby hero into a multitude of weakened small copies, however one of these manages to escape and begins a long adventure in search of himself and his physical and spiritual integrity. No, ok, the story isn't really that deep, but the pretext is really bizarre and triggers a game system that reaches peaks of true genius. Only and solely through the stylus does the player initially control, needless to say, a Kirby, but by eating the fruits scattered throughout the levels it is possible to multiply the number of controlled Kirbys up to a maximum of ten. The situation becomes almost insane, try to imagine a small platoon of pink Kirby trotting through the colorful levels of the game and if the idea doesn't already seem irresistible to you, it's the highly inspired game-design that confirms the goodness of the package. The structure of Kirby: Mass Attack recalls that of the latest Super Mario platformers, each stage can in fact be repeated several times to increase the number of Kirbys since when one of them is hit three times it will begin to float around the screen like an angel and if it is not touched within a few seconds it will be lost forever. Backtracking is therefore encouraged by the need to reach the necessary number of Kirbys to pass subsequent levels, break the completion records of a particular stage or unlock access to new areas that require the collaboration of two or more Kirbys simultaneously . In the absence of the various powers and upgrades of the previous episodes, Kirby: Mass Attack is in fact characterized by an exorbitant amount of extremely diversified puzzles that require creativity and intelligence to be solved by exploiting the Kirbys in our possession to break down obstacles, defeat the bosses of the moment and collect the medals that will allow us to unlock the next stages. More Kirby for everyone The control system is precise and intuitive and it takes just a few minutes to learn how to manage our Kirbys with a few strokes of the stylus, although sometimes it happens that some of our units do not perfectly understand our inputs, going around a bit for the facts own, a defect that makes it a bit frustrating to solve the puzzles that require the division of the group. Kirby: Mass Attack is, on balance, one of the most difficult but also the longest-running episodes of the series. However, we are not talking about a frustrating difficulty but a well-balanced challenge that genuinely glues the player to the Nintendo DS, despite some slowdowns and some perhaps excessively long levels. The possibility of repeating each stage to unearth all the secrets and complete the game one hundred percent is not the only incentive to reinsert the cartridge into the console, since the secrets found and the medals collected are not an end in themselves since they unlock all a series of bonuses and extras among which some highly enjoyable mini-games stand out, made with such great care that they almost seem like games in their own right, in particular the pinball machine, the RPG and the scrolling shoot'em-up. The common denominator of each mini-game and of the real adventure is the canonical, colorful graphics that have always distinguished the brand: it is certainly not a latest generation product even by Nintendo standardsDS, but the care taken in the creation of scenarios and animations is certainly of a good standard. The sprites are funny and adorable and as usual there is a cheerful and pacioccosa atmosphere throughout the adventure, accompanied by a soundtrack composed of captivating and nice tunes, including some remixes of old classic songs from the series. Unfortunately the sound effects, crude and at times even annoying, are of very low quality and each sampling seems to come directly from an eight-bit console, a minor defect perhaps but which clashes within a technical picture that is certainly not spectacular but certainly convincing .", "date": "2011-11-16", "grade": "8.7"}