{"name": "DEEMO 2", "ref": "https://multiplayer.it/recensioni/deemo-2-recensione.html", "text": "The DEEMO 2 review takes us to a mysterious and fascinating realm, which uses music to feed its energy and where weird and funny creatures live that seem to come out of a Hayao Miyazaki cartoon. One day, however, the terrible threat of a monster covered in flowers, which causes an incessant and deadly rain to fall: anyone exposed to water for more than a few minutes is doomed to ~bloom~, turning into a pile of white petals. History DEEMO 2, the protagonist Echo grappling with one of the many characters in the game Told through sequences of astonishing beauty, masterfully directed, the story of DEEMO 2 follows the story of Echo, a girl who seemed destined to ~bloom~ in the pouring rain but who is saved by the mysterious figure of the Composer and taken to shelter in the station that serves as a hub for the kingdom. Here he will have to interact with numerous characters and ask for the help of Deemo, a silent guardian who seems to know a way to save the world. It goes without saying that everything passes through the notes of a piano, taking up the musical theme that strongly characterized the first chapter of the series and which is also reiterated in the sequel, albeit within a decidedly more sophisticated setting. Graphics and sound DEEMO 2, the protagonist explores one of the settings Yes, because the central aspect of DEEMO 2 is undoubtedly represented by the extraordinary presentation and it is difficult to describe its beauty without seeing it in action. With excellent cel shading graphics, Rayark's title practically mimics Ni no Kuni, alternating interlude sequences and exploratory phases characterized by an incredible atmosphere. The characters and scenarios are splendid, the animations do not betray uncertainties and also underline the care of a direction that does not seem to leave anything to chance, carrying on its narration in a delicate way, strengthened by dialogues brilliantly interpreted in Japanese and subtitled in English. Everything is then accompanied by a sound sector of great value, as expected for a product of this kind. Gameplay DEEMO 2, the rhythm phase with its notes to be played in time Unfortunately, however, on the gameplay side, the situation is decidedly less exciting, so much so that one wonders why certain decisions are made. With this technical and artistic quality, with this abundance of assets, DEEMO 2 could have been anything and instead decided to limit itself to making the rhythm game. And not just any rhythm game, but one based on instrumental pieces played on the piano. There are exploratory phases in which, as Echo, we are asked to go around the scenarios and interact with certain characters, but then we always come back in the station, to play and replay the stages that will finally allow us to continue the progression and finally discover how the mysterious story of this little girl and the world in which she found herself continues. We were talking about the rhythm mechanics, which through the inevitable selection of the level of difficulty offer denser or sparser beats. The concept is obviously simple: based on the song played in the background, we will have to touch the screen on a line when the notes arrive, trying to be as precise as possible to get a higher score. However, the fact that the music is only instrumental and far from rhythmic, legitimately consistent with the atmospheres of the game, it constitutes a significant limit and so boredom quickly takes over, amplified by the heavy grinding that is required to access the new chapters without putting a hand on your wallet .", "date": "2022-02-05", "grade": "7.0"}