{"name": "Ombre sulla citt degli angeli", "ref": "https://multiplayer.it/recensioni/95528-la-noire-edizione-completa-ombre-sulla-citta-degli-angeli.html", "text": "Version tested: PCS Seven years of development for a unique work of its kind, which arrives on PC practically posthumously since the offices of Team Bondi closed their doors last month. It's that, and so much more, L.A. Noire: Complete Edition, the definitive version of a game released on consoles in May, capable of selling almost four million copies between Xbox 360 and PlayStation 3, but perhaps worthy of an even greater response given the care with which it was made; care that transpires from each sequence, directed just as if it were a noir film from the 40s. And it is precisely the Los Angeles of that period that is the backdrop to the story of Cole Phelps, a former marine under the LAPD as a detective, who together with his shift mate finds himself facing the darker side of the city between chores of drugs, armed robberies, thefts and crimes of all kinds. Phelps made mistakes in his ~past life~, mistakes that are shown to us in the form of flashbacks between one case and another, to then flow back into the main storyline and lead us to a very exciting final stage of the story, which pays off of the patience during a central part that tends to repeat itself a bit, to fall asleep. Phelps made mistakes, we said, but he doesn't want to make them anymore: his sense of justice is authentic, as is his desire to change a world he doesn't like and which every day stands before him in its most horrible facets. What will be the contribution of the protagonist of L.A. Noire to the cause we will find out over the course of the almost thirty hours needed to complete the adventure, about ten more than the standard edition thanks to the integration of all the DLCs already available on the console: ~A sea of grass~, ~Nicholson Electroplating~, ~A little slip~, ~The naked city~ and ~The consul's car~, along with the extra clothes and challenges. The PC version of the game also includes the Rockstar Social Club, a ~social~ platform, in fact, to which we must register to be able to compare our results with those of our friends, and which fortunately is not invasive until the first start. The craft of living Although at first glance the similarities between the title of Team Bondi and the latest episode of the Grand Theft Auto series seem obvious, in reality the two products differ profoundly in terms of structure. The one proposed by L.A. Noire is not in fact a real free roaming, nor are we given the opportunity to manage the life of agent Phelps between houses, cars and money, perhaps pocketed under the table. The game takes place following a precise path, which cannot be ignored in any way, which case after case offers elements of progression and variations on the action-style theme; and that in certain moments it can even get boring, let's face it: fortunately the management saves goat and cabbage, always keeping the quality standard of the experience high and leading us by the hand, as already mentioned, towards an epilogue that will not fail to involve us. But let's see precisely the structure of the missions, cross and delight of the game. A standard case for detective Cole Phelps begins at the headquarters of the Los Angeles Police Department, where the agent receives a series of indications from his captain: they have found an abandoned car with lots of blood in it, or a man has been killed, or again there are illicit affairs to unmask. The place of the crime is marked on the map and the character, together with his companion, can go there on board the police car. Along the way, in pure Rockstar style, there is no shortage of dialogues, which help to provide further depth and credibility to the story and setting. Since localization in Italian is limited, as per tradition, to subtitles (but, honestly, we couldn't have done otherwise, as we will soon see), it becomes quite difficult to drive and read at the same time: there is no traffic Liberty City nor so many pedestrians to run over, but the risk of incurring an accident remains high, and could negatively influence the final evaluation once the case is closed. We can therefore cut the bull's head by asking our partner to drive for us: he will take us to our destination while we enjoy the landscape and/or its stories, without missing anything. Difficult, however, to give up the pleasure of driving: compared to GTA IV, where you had to steer with both analog sticks for the view to follow the car, things are much improved and the experience of whizzing with the car through the streets of Los Angeles from the 1940s, faithfully reproduced, is immediately very pleasant. Even during chases! The art of investigation Once you get to the crime scene, findWe have the officers who have already cordoned off the area and detained potential witnesses or suspects. We can interact with these characters right away, but the best thing is to take a look around first, examining any object we deem relevant to the investigation. The game activates some aids by default that make our life easier in this situation: when Phelps passes close to a possible test, the controller vibrates to signal its presence. Likewise, as long as there is evidence to examine, particular music will be played. When our detective interacts with an object, the view gets closer and we can directly control his hands, so as to discover any hidden clues at a first glance, all in a very simple and intuitive way. If the evidence reveals new information, it will automatically be entered in a notebook and we will be given the opportunity to consult it later. However, let's open a parenthesis about the controls, immediately putting our hands forward: playing with L.A. Noire: Complete Edition using mouse and keyboard doesn't pay. Beyond the management of the car, which must be driven with the classic WASD keys and therefore lacks the feedback provided by the analog triggers in terms of acceleration, braking and steering, this type of configuration prevents us from using the aids at the crime scene (the vibration is missing), it makes the interaction with objects more cumbersome and does not produce, during the action phases, such advantages as to recommend its use in spite of everything. In short, we strongly recommend that you get a controller for Xbox 360, which will have the same layout as the console version and can possibly be connected or disconnected even ~on the fly~, without recognition problems. Another small parenthesis: in GTA IV a little ~consistency~ was clamored for with regards to the controls, since in practice they changed according to the situation. Well, in L.A. Noire developers have instead found solutions that can be shared in most cases. Running and shooting at the same time remains difficult, ok, but wouldn't it be difficult in reality? Objection! So let's come to what is the most publicized feature of this Rockstar production, or the interrogations. You will already know all about the technology behind the extraordinary facial animations, the numerous actors who have been hired to capture the facial expressions and how our character can conduct this particular phase of the game. Starting from the notebook, we can ask the witness or the suspect on duty questions, listen to the answer and then decide, judging precisely on the basis of the facial expression, catching rapid eye movements or grimaces that betray nervousness, whether to go along with this version, ~ force~ our interlocutor to tell us more or accuse him of lying. In the latter case, the accusation will always be disputed, and we will therefore have to prove its validity by selecting one of the notes in the notebook. These situations don't change dynamically, they go in a certain way and that's it, that is, there are right questions and wrong questions, and we will know how it went at the end of the sequence. Even a bad result will not affect the conclusion of the investigations, nor will the story take alternative turns, but good management will allow us to earn more experience points, level up and win ~intuition points~, bonuses that once spent they allow you to identify evidence more easily or to exclude the ~wrong sentences~ from a dialogue. The nature of L.A Noire is therefore slow and reflective, but there is no shortage of action implications, which indeed on more than one occasion take over the conclusion of a case. Agent Phelps is equipped with a service pistol but can also access different weapons, and the combat system is the classic one of the Rockstar titles, complete with stalking and with the aiming reticle that can be displayed on the left or on the right of the character as needed. While traveling by car from one area of the city to another, it will also happen to run into radio calls and it will be possible to decide whether to accept them or not, thus going to the indicated point. There we will find robberies in progress, criminals on the run (on foot or by car), therefore situations that break the monotony of the investigative phase proper and allow us to unload our nerves a bit. The result of six months of work We don't know if, upon leaving L.A. Noire on consoles, the revival of the game after six months in a deluxe edition had already been established, also and above all dedicated to PC users, who had initially been deprived of such a particular and interesting title. The fact is that it's been a whileof time, and that the expectations for this Complete Edition were reasonably high, given the poor results obtained with the conversion of Grand Theft Auto IV for the Windows platform. Rockstar was therefore asked not only to publish a product free of various problems and glitches, but also to justify the wait with a technical sector that was up to the situation, that is, able to benefit from the undoubted superiority of a mid-range PC /high compared to PlayStation 3 and Xbox 360. Goal achieved? More no than yes, actually. First of all, the game gave us a lot of trouble before we were able to start it, we literally spent hours trying to figure out why the starting screen was not showing up, and discovered that, apparently, the same problem occurred also to other people. When we finally managed to get it going, we found that the difference in quality between the ~high~ and ~low~ graphics settings was barely perceptible, and that the quality of the surfaces appeared better than the console versions, but not as much as it would be. was reasonable to expect. We have to admit that, after reading the list of recommended hardware requirements, we thought that the engine would turn out to be quite heavy and that we would have to give up something to get a stable frame rate. But no, on the test configuration (not really a ninja PC) we played quietly at a resolution of 1680 x 1050 pixels, with all effects maxed out, getting 25-30 frames per second. Not that much, also because (we found out soon after) the PC version of L.A. Noire is ~frame rate locked~, i.e. it cannot run at more than thirty frames per second because the motion capture was created precisely by keeping this value as a reference. Compared to PS3 and Xbox 360, however, fluidity appears to be improved, there are no sequences in which there are evident drops, the visual detail is naturally higher and also the drawing distance appears to be considerably improved, allowing us to see houses and neighborhoods from far away, with only a minimum of pop-ups limited to some elements of the scenario. It is almost superfluous to talk about the sound sector: the quality of the dialogues and music is excellent.", "date": "2011-11-11", "grade": "9.0"}