{"name": "Rayman Origins", "ref": "https://multiplayer.it/recensioni/95497-rayman-origins-tutti-amano-rayman.html", "text": "Versions Tested: Nintendo Wii, PlayStation 3The original Rayman, released way back in 1995, was credited with not only being a great platform game, but also serving as a springboard for the careers of its eggplant-shaped protagonist as well as his creator, that Michel Ancel famous -among other things- also for Beyond Good and Evil, adventure remained in the hearts of many. Rayman's success earned him the creation of two sequels, however characterized by a third dimension which, for better or for worse, made the gameplay fundamentally different from the progenitor: although they were excellent titles, these two episodes therefore left the fans Rayman's desire for a product with a playfully closer relationship to the original. Let's see if this dream can finally be achieved with this Rayman Origins. A big chunk of aubergine Just to start immediately on the right foot, Rayman Origins offers a simple plot, perfectly in line with the canons of 1995: the world in which the game is set was created by an entity known as Bubble Master who, disturbed in his sleep, he began to give birth to nightmares that have turned a scenario upside down which obviously will be up to Rayman and his companions to bring back to its original splendor. With the clear intention of making the title accessible to anyone, Ancel and his companions have preferred not to give a precise location to Rayman Origins in the continuum of the history of the three ~official~ chapters. The idea is to give a more light-hearted image to the protagonist and his companions, here not real heroes engaged in the noble cause of saving the world but rather four friends who enjoy messing up and, between one thing and the other On the other hand, they accidentally manage to restore peace and serenity to the universe. An intention that is perfectly reproduced on video by a graphic design designed with absolute mastery and always cheerful, colorful and lively, which reaches its climax in the excellent sprites of the characters: Rayman and his associates are perfectly defined but above all they are animated to perfection art, with movements worthy of a cartoon and which are often enough by themselves to convey the humor of which the product is imbued. Certainly the 2D show staged by Ubisoft suffers a bit from the high definition idiosyncrasy of the Wii, with the result that the PlayStation 3 and Xbox 360 versions are undoubtedly cleaner and more pleasant to watch, especially when the shots are widened: in these situations, moreover, it is easy to become confused if you play multiplayer on the Nintendo console, given that the less sharp image quality can make it difficult to identify your character on the screen. Regardless of the reference platform, however, Rayman Origins is a title that leaves a smile on your face thanks to a very inspired level design both in terms of variety of settings and as regards the actual structure of the levels: there is no there is a risk of getting bored with the Ubisoft product when each single stage that makes up the adventure offers one or more different elements from the one that precedes it, whether it be visual solutions or real gameplay building blocks. Between deserts dotted with tribal drums to bounce on, icy wastelands seasoned with watermelons, limes and orange slices, fiery scenarios populated by devils cooking curry and even sections in pure scrolling shooter style, Rayman's unique style returns here in its maximum splendour. The sound sector also plays an important part, thanks to a series of irresistible music (only a few excessively repeated jingles can get boring) and effects that are always up to the task. Playstation 3 trophies Those hungry for trophies (or goals) will find almost forty challenges to complete, some original and others a little more trivial. Most of the trophies are unlocked simply by progressing through the game, finding a certain number of cages, eliminating enemies or rescuing captured fairies. Some, on the other hand, are a little more interesting and can only be obtained in particular levels, which will push the player to return to already completed stages several times. Menage a quatre From a more strictly playful point of view, it can be said that Rayman Origins does an excellent job of remixing: keeping the exact same structure of the original Rayman in its entirety would have been unthinkable nowadays, and therefore Ancel and his companions have well thought out to carry the main characteristics of the series with them, however, inserting them in a more dynamic context and above all oriented towards local multiplayer. Here then is that, in a manner not unlike what is proposed with sSuccessful from New Super Mario Bros, the Ubisoft product can be played easily alone, but gives its best when enjoyed with up to three friends, putting cooperative and competitive mechanics on the plate. Users are therefore encouraged to work together to complete the levels, joining forces to overcome obstacles or to reach the best hidden bonuses more easily: moreover, when one of the protagonists is hit or falls foul, he transforms into a bubble that can be blown up by his teammates to immediately put him back into play. On the other hand, every single player has a personal Lum counter (the collectibles of Rayman's world, i.e. the equivalent of Super Mario coins or Sonic's rings), and this implies a comparison with others that can arise in fun trips to grab the most substantial loot: even if the final evaluation is evaluated on the basis of the common collection and there are no real prizes for those who arrive first, Rayman Origins in multiplayer still gives a pleasant feeling of challenge, albeit an end in itself . However, there is no need to gather world platform experts around him to be able to fully enjoy the gameplay of the Ubisoft title, capable of gradually settling even the less accustomed to the genre. Therefore, not only do the first levels act well as a tutorial by inserting the key elements of the gameplay in small doses, but the same skills of the characters are distributed little by little, with the double advantage of ensuring a good feeling of progression to the adventure and not confusing the newbies. This aspect is immediately reflected in a control system that couldn't be simpler: movement, jump, run and attack are the only inputs that the user has to memorize, with the advanced moves that are inserted without altering this perfect balance . However, this does not mean that Ancel has forgotten the platform purists, who will have their work cut out to complete all the (many) levels of the adventure, discover the secrets scattered in each stage and thus obtain the maximum rating, unlock and lead to finish the diabolical bonus sections and still make available the numerous alternative costumes for the characters. In short, Rayman Origins is a title that exudes love for a genre that is now almost forgotten, and which proves capable of giving hours of entertainment both to those who have been waiting for the return of the eggplant man for years, and to those who did not even know of his existence. The other versions While Rayman Origins' stunning 2D art style remains highly enjoyable on the Nintendo Wii, Xbox 360 or PlayStation 3 owners will be able to enjoy Michel Ancel's latest opus at its best. The remarkable detail of the sprites and backdrops, as well as the animated cutscenes, are further enhanced by the 1080p resolution, and everything appears even more cartoon-like despite the game remaining chained to its 60 frames. Such visual magnificence is especially evident in certain moments of the adventure, such as in the battles with the gigantic bosses when the camera pans away showing the imposing landscape all around. Both with the PlayStation pad and with the Xbox one, the goodness of the response to the commands is impeccable, a quality that is especially noticeable in the arduous timed challenges, in which the player is required to have a certain dexterity to jump, run and climb quickly.", "date": "2011-11-10", "grade": "9.0"}