{"name": "Il Sangue di Drago", "ref": "https://multiplayer.it/recensioni/95473-the-elder-scrolls-v-skyrim-il-sangue-di-drago.html", "text": "Tested version: Xbox 360Role-playing games are ugly beasts to develop: difficult, complex, they require human resources and time well above the average of normally marketed video games. Moreover, fans of this genre are among the most complicated to please, given that to enjoy an RPG as it should be, you have to let yourself go, believe in a story and decide to dedicate dozens of hours to it, in exchange for which you expect total satisfaction and you are willing to tolerate few mistakes, at any level. For years, Bethesda has been pursuing a complicated, almost arrogant discourse of creating role-playing adventures set in freely explorable worlds and steeped in legends to tell. Mind you, it's not the only one, but every time our folks put a new game out the door, there's a lot of people who stop and wonder what they've come up with. So here, after Oblivion and the surprising Fallout 3, a surprising masterpiece in terms of narrative, it's already time for The Elders Scrolls V: Skyrim, the third title released in the same generation of hardware and we stopped for about 40 hours . Internal wars Skyrim is the northernmost region of Tamriel, the continent where all the stories related to the saga of The Elders Scrolls take place. It is the land of the Nords, the Vikings of Bethesda, and it is the scene of a revolt, led by Ulrif, leader of the secessionists who, in an attempt to free his people from the dominion of the Empire, decides to kill the King of Kings in shrouded in mystery. The Elders Scrolls V: Skyrim begins aboard a chariot in which Ulrif, a couple of followers and the protagonist are found, captured by mistake with the rioters and summarily sentenced to death. The cart stops in the courtyard of a fort, once you get off, you choose the name, race and gender of your alter ego with the usual physical editor with dozens of different possible customizations. Just before the start of the execution, however, a black dragon descends on the field, putting it on fire, and allowing the hero to escape and start a very long adventure to try to find out who and why is bringing the dragons, believed to be extinct for years, in an attempt to drive them back to the afterlife. The system is the classic one of the series with a world populated by hundreds of characters, divided into different factions and guided by their own interests, who live in different areas of the map, ready to overwhelm the player with tons of primary and secondary quests. The Elders Scrolls V: Skyrim is a huge, huge game. We finished the main saga, plus a handful of side missions, in about 36 and a half hours of play, with half of the urban agglomerations barely scratched and with dozens of quests still open and still to be opened in every corner of the map. Bethesda has accustomed us to this flood of things to do for years, but where in Oblivion we felt, in the long run, the monotony of the structure of the quests, too rigidly divided among the guilds, here the variety and depth of those is resumed fielded for Fallout 3. In addition, however, we can enjoy settings that are much more varied and full of surprises, both in terms of level design and characterization and the average quality is so high as to always leave us in doubt as to which mission to face at the moment, given that one would not want to abandon any of them. Skyrim is a place, a virgin land in which to venture through mountains and valleys, a place where one always has the feeling of being able to find something new, something to interact with, including, finally, timid puzzles and scripted scenes that tell small and great stories, all dubbed into Italian for several hours of dialogues. It happens to go into the bowels of the earth, to find abandoned cities and cursed temples, snow-capped peaks and gorges, populated by hostile tribes and legionaries in search of shelter, and bad news for friends within chatting distance, because you end up submerging them of adventures to tell, with no escape. With Bethesda doing its bit to frame the most curious since scattered around the shelves, in addition to the usual books to read that increase the different skills, those that kick off real quests that would otherwise be unattainable make their debut. Role play The choice of race becomes fundamental, because in The Elders Scrolls V: Skyrim there are no classes and that each species has particular bonuses, from resistance to poison, to the ability to breathe underwater, bonuses that result in typical powers that can be used once once a day: the imperials, for example, have the power to calm creatures during a fight. Each character has 18 skills, which increase with use, and whose growth, added to the esperience, accumulated by solving quests and killing enemies, leads to level up. Speaking with characters, for example, Oratory grows, every few levels of this, perhaps added to lock picking or the use of single-handed weapons, you accumulate enough experience to level up. At each step of growth, you can choose to increase by ten points one of magicka energy, vital energy or stamina, which is used to run and to shoot white weapon shots, ~charged~ by holding down the corresponding analog trigger to the hand it holds. A point is also assigned to spend to activate special abilities specific to each skill, which constitute the real diversification between one character and another and which then allow you to face the game with your own style, preferring one specialization rather than another . Using destruction spells (electricity, frost and flames), for example, once the skill in these reaches the right level, one can unlock the ability to combine two fire spells, one in each hand, with the casting character a single flame, joining hands. If you want to increase the weight of the objects to be carried, you have to increase the Heavy Armor skill, again to give another example. And this goes for every skill. There are no longer the statistics to influence directly, therefore, but in this way one is forced to evaluate the expenditure of each skill point with full knowledge of the facts, without being able to take refuge in the classic automatic distribution of experience points along the guidelines set for each class, seen that these, in fact, have been eliminated. The protagonist, then, is a Dragonborn, the deadliest hunter of these flying beasts, which attack the player at any moment. The gimmick is that dragons, when they launch a blaze, actually speak their own language. The protagonist is able to speak it with the Screams, twenty and each made up of three words, which are learned both during the steps of the main plot and by exploring the most banal of dungeons, finding them written on a wall. To unlock a Shout, you must use the soul of a dragon, absorbed after killing it. Twenty Screams, for sixty words, scattered among quests and caves, for hours and hours of exploration. To war! Obviously in The Elders Scrolls V: Skyrim a lot of time is spent fighting, casting spells, slashing and alternating them with the use of Shouts (the last two that are learned thanks to the main plot are exciting). The animations, as well as the whole graphic system, have improved, even without crying out for a miracle (Bethesda is still gearing up for these), and allow you to play without too many regrets in the third person, except in the dungeons, where you end up more often to be subjective also in order not to miss the smallest objects scattered here and there. The blows are heavier and even the spells need a more harmonious activation time which makes you feel the weight of the effort in casting them. Dual wielding allows you to use weapons and spells together, without the need to interrupt the latter to deliver blows, giving everything much more rhythm and fluidity. In short, we have much more fun than in Oblivion, also because the monsters don't all level up with the player, having the team adopted the same Fallout 3 system with an alternation of areas with enemies proportionate to the stage of development of the hero and others in which you are forced to return after accumulating skills and experience. After finishing the game, the world remains open to complete all the other quests, to continue developing the character and, in any case, even playing on the normal difficulty level (there are five), there is no shortage of challenging fights, always to be tackled with caution and strategy. To overcome the canonical inventory problems, a ~favorites~ system has been set up with a menu that can be checked by pressing UP on the digital cross and in which all the objects, potions, spells and screams that the player has defined are found as favourites, indeed. The items are divided by type and sorted according to their usefulness for the player, so that the items higher up in the list are the best ones, with a green number underlining the gain in stat compared to the equipped item (without the possibility to compare more menu items, much less in shops, than owned, but unequipped things). Among all the elements included in the favourites, two can be entrusted to short cuts that are activated by pressing left and right, again on the digital cross, which helps a lot the alternation, for example, between the magic of cure and one of destruction, how much rather than a weapon, but one wouldand I was able to try a solution like the Mass Effect wheel of powers or another one with additional short cuts assigned to the diagonals of the digital cross. Especially at the beginning you have to get used to the need to resort to your favorite menus to use the essential healing potions, then over time you get organized, but the system is still a bit cumbersome (we look forward to verifying the possibility of creating a greater number of solutions with the keyboard in the PC version). Also because, as mentioned, the fights are far from trivial, given that you find yourself, perhaps, in a valley with a couple of dragons attacking from above, a group of giants taking some Mammoths for a walk, while some brigands attack anything that moves and while trying to juggle by casting spells and healing. Add a sunset, snow or a little rain to the explosions and you get the idea of exhilarating pitched battles where skill with the pad counts. No bugs? Incredible to say, and fingers crossed for all of you, in the 40 hours totaled at the time of writing this article we've come across only two bugs: a dialogue that increases the oratory and that can be repeated indefinitely (we don't tell you Where); an occasion in which we found ourselves for a few seconds under the floor of a city, rising above the surface with a couple of jumps. That's all? It seems so. In churning out one of its biggest games, Bethesda seems to have left behind crashes, bugs and what sometimes seem like the inevitable price to pay for this type of game. Famous last words? Let us know! Bethesda does things right Compensating for the premature disappearance of exploded stats, Bethesda has pushed the accelerator with the crafting system and everything that revolves around it. In The Elders Scrolls V: Skyrim you can wood, cook and mine ore from caves, if you bring along the necessary pickaxe. The raw metals can also be transformed into ingots with a special power, which can be upgraded, and with these you can go to a forge to create much better objects, depending on the level reached with the relative spell and with the skills unlocked with the accumulated points . The metals must be combined with the strips, obtained from the skins of the various animals, which must be treated with the appropriate tool present near the forge. Once the desired weapon or armor has been crafted, it can be refined by sitting down at the grindstone and spending more precious metal and increasing its stats. Up to two bonuses, learned with the Enchanting skill, can be applied to objects created or found. How you do it? If you have an item that gives a 50% magicka cooldown bonus, for example, you go to the workbench, destroy it, and learn the related enchantment. Then you select the object you want to enhance, the enchantment to apply (the bonus, however, is proportionate to your skill level with the relative skill and, usually, lower than what was on the object we destroyed ) and the soul stone to activate everything and which gives all the more power the bigger and rarer it is. If you want to apply a destructive bonus, such as the flame, we are also asked for the number of reloads to be applied to the weapon itself and this also depends on the soul stone at our disposal. Alchemy returns with the ability to create potions, combining plants, animals and elements found throughout Skyrim. The ingredients are mixed at random and with each attempt, depending on the potion obtained, you learn the properties of the elements used, which are automatically catalogued, making subsequent attempts much simpler and more direct. Or, you can eat ingredients and animals, learning about their different properties in advance. Finally, the cooking system is a little simpler, given that the recipes are all already known to the hero who just has to find the necessary vegetables and meats (there are pots or skewers, depending on what you want to prepare). As in New Vegas, you can choose to be accompanied by a comrade in arms, which you command to stop, follow us or activate levers in case you have to solve small puzzles to continue. Good artificial intelligence helps, but in the game just mentioned the possibilities offered were greater than what is possible in Skyrim. It could have ended here, but in The Elders Scrolls V: Skyrim, as in Fallout 3, you can buy a house and furnish it, you can get married (even with a character of the same gender) and settle down with your partner or in your own home, finding foods and money your better half collected in our absence, each time you return to the fold. Of course, only by finding the right NPC, e", "date": "2011-11-10", "grade": "9.7"}