{"name": "BurgerTime World Tour", "ref": "https://multiplayer.it/recensioni/95356-burgertime-world-tour-hamburger-in-salsa-3d.html", "text": "The game is available for download on Xbox Live Version tested: Xbox 360 This end of 2011 seems like the ideal period for great comebacks, after Daytona USA it's the turn of another great classic, this time directly from the 80s. Data East's BurgerTime was a successful cabinet of considerable historical importance, suffice it think of the famous conversions for the various formats of the time, from the Commodore 64 to the Intellivision. Are you ready for this brand new World Tour edition? Let's get cookin'! The formula is as simple as it is abstract, in full 80s spirit: in the role of the unfortunate chef Peter Pepper we have to prepare hamburgers of exaggerated dimensions, simply by passing over the various layers, so as to make them fall onto the plates below, and thus compose the inhuman sandwich . Things get decidedly more complicated if giant frankfurters, killer eggs and psychopathic cucumbers are chasing us! Their contact is fatal, but our cook is not inexperienced, and always carries with him the trusty pepper capable of immobilizing enemies for a few moments. In addition to this it can exploit the same parts of the culinary composition, crushing the unhealthy proteins or making them precipitate with the whole block. All this is now known to connoisseurs of the original, Frozen Codebase has essentially reported the entire formula in this three-dimensional remake, however adding several new features, not all of which are welcome. Among these we include a deadly pitchfork capable of wiping out any enemy, the ability to jump, and special rockets that allow you to reach the upper parts of the level in a very short time. Consequently, the vertical development of the more advanced maps is discounted, even if the original camera setting allows you to glimpse many elements also on the horizontal plane. The platforms themselves take on a more modern role, if in the original they were strictly functional to the substantial construction of a labyrinth, now they have self-propelled traps, contraptions and varied devilry that require not indifferent reflexes and skills. Even the monsters have changed, cucumbers for example are able to jump just like the protagonist, sausages often have unpredictable trajectories, and eggs maintain the same furious charge of the original, making a safe distance peremptory. The levels themselves have increased in number and type, being spread across different locations, reaching forty, and also including final bosses. Xbox 360 goals BurgerTime World Tour features the canonical 12 achievements of Live Arcade titles, for a total of 200 player points. Probably the easiest to conquer is the one that requires the collection of the letters that make up the word BURGER, present around the map, all the others revolve around the World Tour mode, in fact, and require the completion of the four main stages. An operation made certainly not easy by the problems described in the review. What to say then? Good luck... Indigestible food According to what has been said, BurgerTime World Tour would seem like an authentic jewel, but unfortunately it is not. Many, too many defects caused by a chronic lack of polish, including poor collision accuracy and jumping, which makes several sessions rather frustrating. Enemies appear in a confusing manner, further increasing the list of free deaths. The action on the screen is difficult to understand, this also due to an artistic direction below the guard levels, which makes it difficult to identify the characters on the backdrop, as well as hamburgers, so much so that the game itself is forced to indicate their position through on-screen indications. If in the first levels the defects mentioned above do not weigh that much, we cannot say the same thing for the advanced ones, where the problems are exacerbated until they reach their peak in the frustrating clashes with the bosses at the end of the stage. Things are much better in the multiplayer mode, available both online and locally, where up to four players face off together in a race to see who can prepare the most sandwiches. The funniest side is the interaction between the competitors, similar to that with the standard enemies of the game, a feature that leads to rather hilarious situations. The possibility of customizing the match is also excellent, where it is possible to decide both the types of special weapons and the various types of monsters. Unfortunately at the time of writing the presence of players available online was far from generous, making it difficult for us to evaluate the goodness of the code. Offline matches turned out to be quite entertaining. Definitely nice also the possibility in the versionor Xbox 360 to be able to use our avatar as the protagonist. BurgerTime World Tour can be purchased for 800 Microsoft Points at this address", "date": "2011-11-10", "grade": "5.5"}