{"name": "Pro Evolution Soccer 4: IL calcio parla Italiano", "ref": "https://multiplayer.it/recensioni/pro-evolution-soccer-4-il-calcio-parla-italiano.html", "text": "We are a football tribe Starting from the FIFpro license, already the prerogative of the third chapter, Konami has acquired the rights for names, teams and championship jerseys such as the Italian, Spanish and Dutch ones, also making the number of competitions almost double, also by virtue of a greater number of teams present, who also see clubs like Livorno and Palermo as new introductions. The most famous nations also have their own personalized championship, complete with a different logo and graphic setting, thus adding a further piece to the ~scenic~ completeness of the game, the only aspect that was probably subject to animated criticism. There will also be the possibility of making purchases at the PES Shop, thanks to the points acquired by winning a competition or simply by playing a few games: new balls, players and secret teams, higher difficulty level and greater speed are just some of the features that we will be able to ~unlock ~ playing solo or with multiple people. In any case, the real fulcrum of the game is represented by the master league, which in this edition reaches peaks of absolute excellence. To begin with, at the beginning of the season you can choose the canonical team made up of various amateurs or start directly with the team made up of real players. Once this step has been completed we will find ourselves in front of a really high and complete series of menus, which will go from the management of transfers (now only possible at certain times of the year) up to training for your players, which will be necessary if they are in poor physical condition. In relation to this last aspect, it should be noted that each player will have a growth factor, which will lead him to improve his skills, up to the moment of his retirement from competitive activity. As a side dish there will also be some gems such as choosing the man of the match and the virtual presence of an international body, the Wefa, which at the end of the season will draw up various rankings and statistics on the players and teams that took part in the Master League. Visually tantalizing The policy of small but decisive steps adopted by Konami for PES4 can also be fully glimpsed in the technical realization. In particular, the players boast a very high definition, not only for their appearance, ever closer to their real counterparts, but also and above all for their truly convincing movements. This peculiarity is mainly due to the increase in the number of animations that make up all aspects of the match, from the movement of the ball up to the shots, and which add yet another point to the realism on the playing field. The presence of the 50/60 Hz selector allows you to enjoy the title on all televisions and with a fluency and response to commands identical to the Japanese version. However, the 60hz version suffers from some synchronization problems and some slowdowns in crowded situations, which however occur in close relation with the chosen view and playing field. For example, using the distant view on the Amsterdam Arena field, the slowdowns were more than rare even after several games. The same thing could not be said using instead the wide view on the Camp Nou in Barcelona. The commentary this time is entrusted to the famous Civoli-Sandreani duo, who, while not performing blunders similar to those of their predecessors, still fail to accompany the match in a convincing manner. It will be for his colorful tones or because you don't understand anything of what he says, but John Kabira remains once again unmatched. We close the technical review with the signaling of the presence of customized chants and banners for a large part of the teams present. The simulation However, the hot dish offered by Pro Evolution Soccer 4 has always been the gameplay, where there are many differences and improvements compared to its third innovation. The aforementioned increase in the number of animations positively affects the realism of the match, ever closer to the ideal football title. This is also due to a better AI of the players managed by the cpu, who will have a different behavior depending on the progress of the match and, in the case of their own team, will propose themselves with greater efficiency, subject to the use of an adequate tactic. The response to commands, like the Japanese counterpart, is practically perfect. Never like in PES4 will you have the feeling of having total control over the players, and there will be no excuses that hold in matches between human opponents. Therefore, the benefits are variety and fun, which sanction the further evolutionary step of the game. Speaking in terms dIn the introductions, we point out (finally) the addition of the referee on the pitch, who will not be a mere graphic frill but will have his own specific personality, which will determine his behavior, for example, in the face of a foul liable to penalty. How not to mention the two free-kicks, which add new solutions on set pieces, and the momentary injuries of the players, who are transported to the sideline on a stretcher and will promptly return after a few minutes (virtual) of the game. There are some small sore points, however: Konami persists in proposing a European version increasingly geared towards an arcade model. If in Winning Eleven 8 in fact a harmony and a simulation aspect never seen before have been achieved, in PES 4, for some inexplicable reason, the game action has been speeded up, as well as some animations, which do not benefit from this increase. All this affects the aforementioned game harmony, over which most people can turn a blind eye, but not the purists of the series, who have a more balanced alternative at home. Without a shadow of a doubt, Pro Evolution Soccer 4 represents the best football transposition ever created for the European market, which pays duty only compared to its Japanese counterpart (Winning Eleven 8), by virtue of a greater balance in the game dynamics for the latter . Realism, response to commands and variety are the highlights of this fourth chapter, supported by an increasingly full-bodied ~outline~ and able to satisfy even the most demanding gamers. Also this year therefore Konami looks down on everyone, while the others chase with great difficulty ... Pros: Response to commands close to perfection Many options and game modes Varied and realistic gameplay Cons: Game dynamics perhaps too fast Absence of online mode, which instead will be present on Xbox The video review If you are not satisfied with the words spoken in this review, know that soon we will also publish the video review of Pro Evolution 4. Stay tuned, you won't regret it! Italy, as we know, is a country of football fans, in fact, it is enough to name the magic word to arouse the attention of the most in any field. Leaving aside improbable reality shows on football, the autumn period has become a fixed and sacred appointment with the Pro Evolution soccer series, the European transposition of that Winning Eleven so adored by videogame audiences. With this fourth chapter, Konami, the game developer, continues along the path embarked on with the previous chapters, making changes and improvements aimed at evolving its simulation, especially in some of the components that are most dear to fans of the genre: realism and gameplay.", "date": "2005-06-29", "grade": null}