{"name": "TOH", "ref": "https://multiplayer.it/recensioni/95322-take-on-helicopters-toh-un-simulatore-di-elicotteri.html", "text": "The origins of the helicopter date back to the end of the 1400s, when Leonardo Da Vinci had the intuition of an ~air screw~ which could, through its continuous rotation, lift the structure connected to it from the ground. The initial project did not have great possibilities of being put into practice, but over the years (centuries, in fact) other great minds worked on the realization of vertical flight until, at the beginning of the 1900s, it was not actually possible to create a working prototype thanks to the passion of the Breguet brothers. Today that of helicopters is a consolidated reality, there are various models for both civil and military use and quite a few people who are passionate about their characteristics and peculiarities. The same people will probably have jumped for joy at the announcement of Take On Helicopters, a ~hard and pure~ helicopter simulator that the guys from Bohemia Interactive have decided to dedicate themselves to before the release of ARMA III, and which allows us to get behind the wheel of some of the most famous vertical take-off vehicles currently available: from the lightest and most agile models to the heaviest and most capacious ones, passing through an intermediate category that sees the presence of helicopters for maritime rescue, police vehicles and etc. The game has both single player and multiplayer modes: from the start screen it is possible to access free flight sessions within two large scenarios (the city of Seattle and South Asia), engage in career mode, face a series of single missions and time trials, or spend a few hours getting familiar with the basic maneuvers so as not to crash at the first gust of wind. We are dealing with a simulator, therefore the more time we spend trying our hand at training, the fewer problems we will have even during the most trivial flight phases, considering that the approach to the genre appears immediately rigid, scrupulous and anything but permissive . First steps in the air Take On Helicopters has different levels of difficulty, which affect not only the controls of the helicopter but also the physics that regulate its movement, although these aids almost take the form of a partial autopilot at certain times. The ~beginner~ level is an excellent example of this: very often the helicopter will move by itself, especially during the take-off and landing phases, while from a visual point of view we will find indications of all the points of interest relating to the mission on the map in progress. The ~trainee~ level was instead designed for those who are familiar with the basic principles of flying aboard a helicopter, with a series of activated aids but a consistent degree of challenge. Lastly, the ~expert~ level puts all the weight and responsibility for managing the vehicle on the shoulders of the pilot, with the obligation to make rapid adjustments to the trajectories in the event of sudden currents and a map that is completely devoid of references, which therefore must be studied well during the briefing to have no problems with the mission underway. As mentioned above, the approach to the genre is not very permissive and therefore even at the lowest difficulty level one cannot expect to control the helicopter as in an action game: it is something that simulation enthusiasts probably already know , but it must be clear to everyone before proceeding with the purchase of a product which then, perhaps, turns out to be different from how you imagined it. Regardless of the degree of challenge, it is possible to start procedures completely automatically, and the take-off phase clearly ranks at the top of this list. All you have to do is call up a special menu to speed up the maneuver and then dedicate yourself to the actual flight, but this does not mean that you can proceed and complete the missions without having first dedicated some time to assimilate the dynamics of take-off and landing, given that on several occasions we will be asked to do one and the other. The control system undoubtedly winks at the Xbox 360 controller, which is configured in an instant and allows us, thanks to the analog sticks and triggers, to precisely dose the inputs. Most of the work is done using the left stick, which basically adjusts the inclination of the helicopter and therefore its ability to proceed in various directions, while the right stick allows us to move the view (after pressing the B button) to observe the interior of the cab or the vehicle from the outside (switch from the first person view to the third person view by pressing the Back key). The triggers regulate the ~yaw~ to the left and right, while the pressure of the LB and RB backbones respectively decreases and increases the rotation speed of the blades.The family business Between free flights, single missions, time attacks and even multiplayer, Take On Helicopters offers quite a lot to do. Let's be clear: generally you only need to move from point A to point B, but nice variations are often added to this structure, especially during the career mode. In this case we find ourselves in the role of Thomas Larkin, a novice helicopter pilot who finds himself, after the disappearance of his father and an accident involving his brother, having to manage the family business alone. The situations in which Thomas finds himself are quite diversified, sometimes even original (see the flashback with the war helicopters), but it is clear that this kind of element is not in the Bohemia Interactive developer's ropes. In fact, a thousand better ways could be found to represent dialogues and narrative implications than using the same game engine, given the absolute mediocrity of the animations (if such they can be called). Seeing characters who speak only by moving their mouths, as if they were mannequins, doesn't help to immerse yourself in the part. Inserting static sequences, perhaps the ~animated comics~ that are so fashionable now, and then moving on to the action on the helicopter would have been much better and would have prevented the Real Virtuality graphics engine from showing off its weakest points. After all, how many driving simulations allow us to control the driver of the car and make him go for a walk in the paddock? It is therefore appropriate to consider the career as an ~extra~ compared to the large number of modalities already present and to the quality of the experience in terms of simulation. Which, however, brings us to the second problem of this production: the technical sector. Let's immediately liquidate the dialogues in English (mediocre), the sound effects (excellent and faithful to the real counterparts) and the musical accompaniment (a bit repetitive and sometimes out of place), because in the end it is the graphics that represent one of the cornerstones of a simulation that allows us, among other things, to fly over a Seattle reproduced in great detail. Well, the optimization problems of the aforementioned Real Virtuality, highlighted during the ARMA II review, seemed to us far from being solved in this incarnation. The numerous adjustments available, including the one that allows us to lower the resolution of the polygonal elements instead of the general resolution, seem in fact not to produce appreciable improvements in terms of frame rate, and in the end we have to work only on the visual distance because the experience become more or less fluid. On the test configuration we kept all the effects at maximum and practically set the visual distance to half, obtaining something like 25 frames per second, but apparently this is a problem that also concerns more performing PCs and that the guys from Bohemia Interactive should decide to resolve.", "date": "2011-11-08", "grade": "7.5"}