{"name": "Sonic Generations", "ref": "https://multiplayer.it/recensioni/95204-sonic-generations-generazioni-blu.html", "text": "Tested version: PlayStation 3 In the 80s and 90s the ~mascots~ were a clear and indelible symbol of a console, they identified it with gamers and accompanied it over the years. Over time and the enlargement of the market this association has gradually faded away, the mascots have grown (now we call them characters) and often have given way directly to the brands. The close fight Sega-Nintendo of a few years ago brought Sonic and Mario as gifts, two icons who have experienced different fortunes in the course of their evolution. If in the case of the Italian plumber we have in fact almost always had videogame transpositions of a high quality rate, the blue hedgehog on the other hand has experienced an identity crisis more than once after the excellent titles that have seen him as a protagonist on the Mega Drive. Sonic Adventures on Dreamcast has revived the series and revived hope even in three dimensions, disillusioned by a second chapter which, in an attempt to vary the gameplay, proposed extremely subdued and boring sections, entrusted to supporting actors who never made inroads into the hearts of passionate. The continuation is recent history, several highs but many, too many lows, which have relegated the Sega mascot to represent one of the many titles of a genre, the platform one, which at the same time is no longer on the shields. So how to revive the formula and give Sonic the dignity he deserves? Drawing from the past of course! But in a very intelligent form, the one adopted by Sonic Generations. Operation amarcord? It should be clarified immediately that the latest Sonic Team effort is above all a fan service to the nth degree (just point out the section dedicated to collectors with images, music and characters from the series, and the possibility of unlocking the original Sonic with 7777 skill points ), but done so well that it can be indicated for all platform lovers who prefer fun and speed instead of the extreme precision of the game mechanics. To celebrate the twentieth anniversary of the blue hedgehog, Sega has in fact shifted the focus once again to its mascot, leaving the role of the supporting characters to the supporting actors. In reality there are two protagonists, the original Sonic created in 1991 and the cooler one, able to speak, which was introduced with Sonic Adventures. The excuse is that of a ~new~ terrible enemy who seems to be able to manipulate time and who, by creating space-time gaps, has trapped all of Sonic's friends, canceled the settings in which he was the protagonist and compressed time to a single instant, thus allowing the two Sonics to meet. Trivial story but excellent result, with this stratagem Sega has in fact selected one level each from nine episodes of the series to offer it in two distinct versions: one with two-dimensional mechanics that see classic Sonic as the protagonist, the other that has that of the titles starting from the Dreamcast versions and with the modern Sonic acting as the star performer. We therefore start from Green Hill of the original title to move on to Sky Sanctuary by Sonic & Knuckles, City Escape from Sonic Adventures 2, up to Planet Wisp by Sonic Colors, all with a modern and pleasant rendering. As for the audio sector we have ~iconic~ songs from the series almost always rearranged in an excellent way, as in the case of Escape from the City enriched with violins, and in general the Japanese developer has managed to produce fresh and at the same time recognizable music again. There is no shortage of dialogues, with the possibility of choosing English and Japanese as well as Italian. We were saying that the levels, henceforth called acts, are divided into two phases. The first must always be addressed with classic Sonic and the mechanics are extremely similar to the first chapters for the Mega Drive, with the jump and the screwed sprint as well as the possibility of crouching. What changes is the graphic rendering, where beyond the 2D mechanics everything else enjoys realization in three dimensions and different levels of depth, with a colorful and clean detail (which does not make you cry for a miracle) enriched by some goodies such as the waterfalls or the shadows on the characters, and of an excellent impact especially in movement, where the speed that has always distinguished the series helps to make everything pleasant. The sense of speed is adequate but unfortunately we are not faced with the fateful sixty frames per second and in some situations, fortunately reduced, there is some uncertainty in the fluidity. The second phase of each act instead has different sections in three dimensions and behind the player; the modern Sonic has the turbo instead of the scscrewed act and also of the crushed slide (better known as Spin Dash) which allows you to ~hook~ enemies in sequence or springs and more, in order to perform a sort of continuous ballet and proceed at extremely high speed even in the presence of obstacles. Also in this case each act has been modernized and graphically enhanced, the sensation of speed is even greater thanks to the turbo and a slight blur and, more than apt choice, the lowest common denominator is always speed, with ~breaking~ sections more platform in the case of the more advanced acts, fortunately distant relatives from the horrors of the most recent Sonics. Playstation 3 trophies Sonic Generations offers 50 trophies, of which 2 gold, 8 silver and 28 secrets. The ~easiest~ ones are delegated to the completion of the various levels, the more demanding ones to obtaining the S rank in each act and those that require more time are linked to all the secret challenges. As for the secret trophies, they are obtained by discovering ~hidden~ rings through various levels rather than performing particular stunts or putting in a perfect performance. Older or newer? In fact, in Sonic Generations, it is the design of most of the levels that shines, thanks to the multiple roads, the skilful mix between aggressive sections and the more ~quiet~ ones and the pure fun provided. As in the case of the aforementioned City Escape, where the famous ~angry truck~ chase reaches new heights in both 2D and 3D versions. Obviously there are some critical points, the continuous transition from modern Sonic to the classic one brings some compensation because the latter does not have the Spin Dash; therefore there is a tendency to press the X key a second time with the risk of losing a life. In modern Sonic levels, on the other hand, too much precision is sometimes required perhaps following extremely fast sections, which ~out of place~ due to how the level itself is set up: just press one turbo too many to see your character take a big leap into the void and interrupt the pace of play. For each act completed, skill points are obtained, which can be spent to acquire power-ups such as an additional shield or the possibility for the main protagonist to immediately stop running (until Super Sonic is unlocked!): fundamental skills for improving one's performance and your own score. The total acts are eighteen, in addition to which there are four boss fights, two good and two rather short, and three acts for the search for the famous Chaos Emeralds, in which Sonic finds himself facing his nemeses such as Shadow or Silver the Hedgehog through pretty fun levels. To visit them all at least once and complete Sonic Generations a few hours of play are needed, but to raise an objectively improveable duration there is a very large amount of additional content. First there is the extreme replayability of each level, this due to the very nature of their design, as mentioned pleasant and full of multiple paths, and because there are collectibles in the form of red star rings that unlock further abilities for the main protagonists. There are also ninety challenges, forty-five for each Sonic, which are unlocked in groups of thirty and which once again highlight the excellent level design that characterizes Sonic Generations. In fact, each challenge sees one of Sonic's supporting actors as a sidekick, who must be beaten, for example, in a race against time or can be recalled to exploit his skills, as with Knukles who can dig in search of coins or the crocodile Vector who can throw Sonic higher. Their variety is quite surprising and in several cases the scenarios are enriched with new platforms, additional objects or are addressed in specific sections, a perfect way to take advantage of their extremely varied conformation. Last but not least, once the game is completed, the online mode is unlocked in the form of a time attack and a greater distance covered in thirty seconds, with a dedicated ranking system and where the shortest route and speed are the only elements that count for excel.", "date": "2011-11-03", "grade": "8.7"}