{"name": "Emulazione bellica", "ref": "https://multiplayer.it/recensioni/95066-modern-combat-3-emulazione-bellica.html", "text": "Tested version: iPad That Gameloft is not a software house devoted to originality is well known and even candidly confirmed by its executives, honest in admitting that the company's focus is to take the most impactful concepts of the console world and then transfer them to the mobile sector with the necessary precautions. In this sense, the Modern Combat series represents the non plus ultra of emulation: everything, starting from the title, blatantly recalls Call of Duty: Modern Warfare, and this third and final chapter makes no difference. But if you manage to turn a blind eye to a complete exploitation - at times even embarrassing - of the dynamics of the Activision franchise, you find yourself on your hands a real paradigm for the FPS genre on Apple devices. Call of Modern Homefront Gameloft is now so comfortable in taking possession of other people's ideas that with Modern Combat 3 it manages to combine a surrogate of the Homefront storyline with a playful structure modeled on that of Call of Duty. The user therefore plays the role of the most classic of the marines, committed to fighting the offensive perpetrated directly on the sacred American soil by a coalition army of villains par excellence, namely North Korea, Russia and Pakistan. The plot itself is rather obvious and peppered with the most botched military clichs, but at least allows the game levels to range between a variety of settings, from the streets of Los Angeles to the Alaskan woods, for a single player campaign that is certainly more full-bodied and satisfying than those of the previous chapters. Even if the feeling of deja-vu for anyone who had played the two Modern Warfare is really powerful, with Gameloft who really did everything to make its production resemble the Activision giant as much as possible: the inspirational work starts from the nature of the sequences scripted up to involve entire stages, such as the one aboard an AC-130 bomber, a carbon copy of what has already been staged by Call of Duty. Beyond the questionable origin of these solutions, it must be said that Modern Combat 3 performs its duty flawlessly, especially when compared with the other exponents of the genre available on the App Store: in fact, it is difficult to find such a well-finished FPS in this context , competent and spectacular like the Gameloft title, which boasts among its greatest strengths the richness of the play offer. In addition to the aforementioned campaign that can be tackled by choosing from four difficulty levels, in fact, Modern Combat 3 features a top-level multiplayer section, which we would not hesitate to place among the best ever tried on these shores. Available both in local Wi-Fi and online, the component works great, offering users ample customization possibilities both for their digital alter ego and for the game, also marking a clear detachment from the (already excellent) counterpart of the previous chapter : here there are more game modes, more options and above all more maps, the latter finally of generous dimensions and with an inspired design. Dressed to kill Technically, as is to be expected from a Gameloft product, Modern Combat 3 excels from several points of view, while leaving room for some ingenuity. From a graphic point of view we are faced with the best that has ever been seen on iOS, with strong points consisting of large and detailed scenarios and a great profusion of light effects and visual filters: the animations of the enemies are also good, a a little less their polygonal modeling, which is rather angular at close range. A not exactly textbook artificial intelligence and some bugs relating to their movements also weigh on the opponents, the most serious and frequent relating to the fact that on several occasions it is possible to see them literally appear out of nowhere. The sound does its duty admirably, focusing on trivial but effective militaristic music and convincing effects (especially regarding the noise of firearms), while the English dubbing is really second-class. We therefore come to talk about the control system, cross and delight of FPS on Apple devices: although the developers have stuffed the title with alternative command solutions and have made available an editor to move and enlarge the virtual keys on the screen at will, however, you have to make big compromises to play Modern Combat 3. Even with all the aiming aids activated, it is really difficult to keep up with a fast and frenetic gameplay like that of the Gameloft title without running into errors due to the imprecision of the commands on touchscreen, often finding himself in morire precisely because you cannot count on sufficient reactivity. Taking this into account, the title can still be played easily even in multiplayer, and objectively the developers cannot be blamed for the indisputable fact that, simply, iPhone and iPad are not the ideal platform for FPS. The tested version is 1.0.0 Price: 5.49 App Store links", "date": "2011-10-31", "grade": "9.0"}