{"name": "Dying Light 2: Stay Human", "ref": "https://multiplayer.it/recensioni/dying-light-2-stay-human-recensione.html", "text": "We talked at length about all the difficulties that surrounded the development of Dying Light 2: Stay Human in our previous article on the game: a substantial hands-on linked to a press tour in Warsaw that allowed us to finally get our hands on this troubled sequel. Already on that occasion we had expressed some concerns about the cleanliness of the game and the general balance of the parkour and combat experience. But, at the same time, we had lavished numerous compliments on the quality of the open world and, somehow, on its originality which, despite starting from a handful of post-apocalyptic clichs, managed to have its own precise identity. Now that there are less than 48 hours left before the game's release on the market, we are finally ready to go into detail on an overall judgment on this dense and complex work carried out by the Techland guys after a review session that kept us glued to the product for more than 40 hours discovering the lights and shadows of a project which, it is evident from the first minutes of the game, must have undergone numerous and drastic program changes with cuts and second thoughts that must have transversely crossed every development department. What you will find in your hands, if you decide to proceed with the purchase, is a sort of roller coaster ride: there is always a long, very long climb to do, before being able to scream of the enjoyment felt going down at breakneck speed, performing loops and twists. And we will try to explain this metaphor to you better during this review of Dying Light 2: Stay Human. A pleasant story but full of holes A good toast is never refused in Dying Light 2: Stay Human Dying Light 2: Stay Human takes place chronologically 20 years after the events of the first chapter. The protagonist changes, the city changes and in some way the physical and mental state of the survivors and the infected also changes, with obvious repercussions on the whole setting and on the tone of the events told. All this has an obvious consequence: this sequel can also be played and tackled by those who are completely unaware of the background and what happened in the debut title of the series, but obviously those who are aware of the background will be able to enjoy some small historical reference and appreciate the evolution of the world created by Techland. A brief introduction at the beginning of the game allows you to immediately become familiar with the post-apocalyptic world, with the military nature of the virus that turns humans into zombies and with the new structure social network of the survivors, while making us familiar with the gameplay and with Aiden Caldwell, the Pilgrim that we will find ourselves controlling, will take care of a good tutorial and a whole series of suggestions that will accompany us for most of the game, as we take possession of weapons, gadgets, parkour movements and we will face all the most varied activities. Initially it will not be easy to choose between Survivors and Peacekeepers Much of the events narrated takes place within the fortified borders of Villedor, for friends the City, one of the very last strongholds managed by the few survivors where a semblance of normal life is still possible to carry out. The urban settlement represents the backbone of the open world of Dying Light 2: Stay Human even if the developer has adopted a technical trick to not have to manage the entire game world all the time having broken the structure of the small town. A first portion of Villedor is in fact made up of 4 districts and will keep us company for a very long initial phase of the game, while the so-called Central Line that we will reach later on is divided into 8 districts. Both zones can be navigated freely, but to go from one to the other we will need a quick journey through the subway. The story told in the game is long, even engrossing at times and with some pleasant twists, but it is also the first reference of everything that didn't go well during the development of Dying Light 2. Now, it's clearly not our goal to do conspiracies and take back the old proclamations of the development team at the time of the partnership with Chris Avellone, but they are enough the first hours of the game to start feeling a sensation that will then tend to worsen as we go forward in the narrative arc until it hits us violently at the moment of the epilogue: there is always something that doesn't add up. A huge infected is ready to charge us The reactions of some characters, a series of changes of scenery and points of view, many dialogues, the chronological order of events, up to the very motivations behind a long series of choices and actions of the co-protagonists often resultor unclear, not to mention unjustified or inconsistent with the development of events. It constantly seems that parts are missing, that something has been brutally cut out or is never explained with knowledge of the facts by those participating in the scene. Even the motivations that guide our antagonist, which we will obviously leave out due to spoilers, appear superficial and not very credible in more than one context. This feeling of ~unfinished~ also affects the concept of causes and consequences, so long highlighted in communications of the development team, depending on the choices made by the player during his experience with Dying Light 2. Clearly there are effects related to our behavior, but often they run out immediately, perhaps leading us to carry out small portions of a mission instead of another, or to cause the departure of a specific character. There never seems to be a real change to the development of the plot which therefore appears ~nailed~ to a single track written and scripted by the developer. 3 factions fighting over a handful of rubble A handsomely armored Renegade Villedor is a territory in continuous war: not only against the infected who roam the streets and inhabit a large part of the urban structures, but also and above all between the three factions who fight each other with no holds barred in search of a very fragile balance to blow up. In Dying Light 2 in fact, most of the events that will see us as protagonists will lead us to talk and even take sides with the Survivors or the Peacekeepers: the former aim at the slow reconstruction of a social structure without too many rules but which allows each inhabitant to carry out simple jobs so as to ensure the subsistence of the human species; the latter are instead heavily militarized and push for the martial management of urban activities and settlements. These two alliances barely bear each other looking for a timid attempt at co-existence. Then there are the Forsworn: partially structured thugs who want total anarchy and who, for reasons we initially ignore, have begun indiscriminately attacking the structures of the other two factions after a long period of relative peace. While the Forsworns somehow represent a sort of common enemy that we will have to limit ourselves to fighting on every occasion, Survivors and Peacekeepers with their leaders and prominent figures, will be the groupings that will offer us the missions to carry out and with which we will relate for the entire game. But even in this case one perceives the emptiness of the system of causes and consequences that we were talking about just above. While trying in every way to take sides against the Peacekeepers, we will still have to do a whole series of steps in the main plot in their company, also receiving praise and appreciation as if nothing had happened, and the same goes for most of the characters we will interact with . If we eliminate very few sporadic cases, concretely favoring a faction or a co-protagonist will never lead to a substantial change in history, leading for example to the impossibility of having interactions with the vexed alliance. In Dying Light 2: Stay Human there will be many special infected But then in concrete terms, you may be wondering, what does it mean to side with a faction in Dying Light 2? It simply means assigning it the nerve structure present in each district: a water tower or an energy production plant. Once we have conquered them by completing some environmental puzzles, we will in fact be called to ~grant~ it to the Survivors or the Peacekeepers and this will determine a permanent bonus applied to all the other districts assigned to the same faction. In the case of the Survivors we will earn ropes, airbags and other trinkets that will make parkour easier and more effective. By favoring the Peacekeepers instead we will find traps, weapons and fortifications installed that will allow us to get the better of the infected during our wandering through the streets of Villedor. There will also be numerous windmills that we will have to climb and activate with very clear reminiscences of the first Assassin's Creed and these will serve to unlock a series of safe havens managed by the faction that controls that district, and to highlight the various points of interest that identify the numerous secondary activities that can be carried out. The gameplay While the focus is on melee weapons, Dying Light 2 has no shortage of bows and crossbows And thus we finally come to talk about the gameplay of Dying Light 2. The game, we remember it if it was still not clear, is an action with a first person view with a strong role-playing component and an anima lighter than adventure. It can also be played entirely in coop up to a maximum of 4 players. All grafted onto an open world structure that pushes very hard on the exploration and crossing of the city making the most of grips and ledges to perform in parkour. In addition to the main storyline there are tons of side missions and optional activities to do as well as tons of loot to track down and recover. Imagine it as a combination of an Assassin's Creed and a Mirror's Edge but with the zombies in the middle to annoy us. It took us 42 hours to finish it, but we don't struggle to imagine that it's really possible to invest more than 100 hours in the title to see all its contents. The infected represent one of the two enemies we will have to face for the entire game, with the another adversary represented by the Renegades and by some sporadic group of criminals who sometimes gather on the roofs and in the streets. The presence of these challengers is regulated by the day/night cycle on which the daily life of Villedor is based: during the day the surviving population will tend to carry out its main activities and, sometimes, to venture into the narrow streets of the City, taking advantage of the fact that most of the zombies are hidden inside the structures with those few wandering around the street strongly weakened by the sunlight. At night the situation is reversed with humans perched in their own safe havens and the infected swarming the streets, sometimes even reaching the roofs, ready to chase and attack anyone who comes within range, thanks to their numbers and the unheard-of violence that animates the their movements. This dynamic has deep roots in a whole series of aspects of the gameplay: aware of the fact that a large part of the interiors will be emptied of zombies during the night, many search and recovery missions, as well as a large part of the secondary activities that contemplate the collection of resources, will be carried out at night. In this way Dying Light 2 manages to naturally stimulate the player to abandon the safety of daylight in favor of darkness, in order to get his hands on the best equipment and earn a whole series of extra bonuses that we will activate by carrying out our raids at night and which will have a direct impact on unlocking talent. Collecting loot by scavenging everywhere is a fundamental action of Dying Light 2: Stay Human At the same time, however, going around at night activates a further danger due to Aiden's infection: if in fact we are not irradiated by the sun or an ultraviolet light, our immunity will begin to decrease and will always be well indicated by a superimposed timer . Once this countdown is over, we will start losing health until we die. In this way Dying Light 2 manages to adequately manage our nocturnal raids by preventing us from being too reflective and forcing us to constantly look around in search of a saving source of light or gadgets and objects capable of restoring part of our immunity. Just speaking of the progression of our avatar, we will have to deal with two different areas of enhancement. On the one hand there is a fairly classic management of the equipment which contemplates the usual collection of weapons, clothing, consumables and throwable items complete with level and rarity. And there is also traditional crafting with the projects to be purchased and the consequent products that can be created, provided you have the necessary reagents. Then there are 2 peculiarities that we personally appreciated but that will probably cause discussion: our general level will determine that of the objects that we will be able to find and buy. To be clear, it will never be possible to get our hands on an offensive tool that we will not be able to use because it is beyond our values. When you level up (and this thing happens very slowly by carrying out the missions) all the objects present in the vendors and in the boxes scattered around the city will automatically change. Secondly, weapons wear out and cannot be repaired in any way. There are bonuses that we can apply to increase their longevity, but they are all bound to break with use sooner or later. The paraglider will be an essential element to move quickly in Dying Light 2: Stay Human The second element of progression is related to talents. Compared to the first Dying Light, Techland has lost a branch of skills along the way since now we will only have two available: one focused on combat and the other on parkour with a good selection of perks that we will be able to unlock by investing the talent points obtained as we actually fight or go around", "date": "2022-02-02", "grade": "7.8"}