{"name": "Due arrampicamuri al prezzo di uno solo", "ref": "https://multiplayer.it/recensioni/94839-spider-man-edge-of-time-due-arrampicamuri-al-prezzo-di-uno-solo.html", "text": "Version tested: PlayStation 3 These days a superhero is making a lot of talk about himself thanks to the excellent game that has been built around him, we are obviously talking about Batman and Batman Arkham City, developed by the talented Rockstedy, authors capable of finally doing justice to one of the most beloved costumed heroes ever. The game that we went to review this time is instead dedicated to Spider-Man and follows exactly one year after the publication of Spiderman: Shuttered Time, a fairly successful episode that went through four different dimensions to explore, an interesting mix that had effectively given the brand a good deal of variety. Beenox was confirmed thanks to the good work done with the previous episode they returned to the fray proposing Spiderman: Edge of Time which, having eliminated a couple of extra parallel dimensions, focuses only on two wall climbers, the Amazing, the one of our times , and its futuristic version 2099 in a story that makes the two realities intersect in a continuous exchange between the two protagonists. Interweaving? That's the right word... The events begin in 2099 and see Spiderman / Miguel O'Hara hunting for a mad scientist, such Sloan, who wants to go back in time to change the birth and fate of his company, Alchemax. Obviously, this purpose must also be prevented because it provides for the simultaneous elimination of Spiderman / Peter Parker, a death that really takes place at the hands of a super Anti Venom (an opponent who we will actually meet several times during the adventure). Miguel O'Hara in 2099 uses the portal to go back in time and thus save Peter Parker, so a time paradox is created, with his Spiderman communicating with each other and helping each other, with actions set in the present that modify in real time what happens in 2099, the fight against the evil of the moment has never been so intricate. A plot that is certainly not easy to unravel but also rather weak and we must admit that it essentially serves only to be able to impersonate the two super heroes, often passing from the present to the future. Going forward with the action, well-known characters from the beloved Spidy universe also appear in the game, from Doc Octopus, to the aforementioned Anti Venom to the Black Cat, without too many preambles and a little ~thrown there~ to make appearances for their own sake themselves. Then the mental connection between the two wall climbers is a good stratagem that kicks off nice gags between the two protagonists, but certainly justifying it only on the basis of the common genetics is far too little. Beat Beat From the point of view of the game setting, the Beenox title is a third-person action, with the focus concentrated on the many fights that take place during the adventure, divided into 17 chapters. A sort of two-dimensional memory scrolling fighting game except that there are three dimensions and Spidy is able to move quickly throughout the playing area, partly thanks to the cobwebs and partly thanks to his undoubted speed. The control system that manages the movements of our friendly neighborhood Spider-Man works quite well, even if it takes a while to get used to spider-like abilities and occasionally it happens that Spidy unintentionally sticks himself to a wall, with the serious intention to climb it. With the simple pressure of the R2 key it is possible to move quickly from one point to another using the cobwebs, the perfect tactic to catch enemies off guard. During the fights we can show off various moves capable of hitting all opponents from a distance and up close with a good dose of spectacularity. After a few clashes with the unfortunates on duty, whether they are sentinels or mutant monsters, it becomes clear that the strategy in the fights is almost non-existent, and these become a continuous pressing of the keys with repeated combinations of the X key alternating with the triangle key to strike from a distance. If that weren't enough, you can use the time paradox by pressing the two analog sticks simultaneously to freeze enemies in a sort of bullet time sufficient for Spidy to destroy an entire horde of bad guys. Playstation 3 trophies Spider-Man: Edge of Time offers 48 trophies divided as follows: 1 platinum, 2 gold, 5 silver, 19 bronze and 21 secret trophies. By completing the adventure the first time it will be possible to reach a good number of them but in order to be able to complete it it will be necessary to replay the Activision action game several times, upgrade the two heroes to the maximum and complete all the Challenges. Super Powers! The two heroes have slightly different powers and dedicated special moves. By collecting the orbs of light scattered throughout the levels and the golden spiders it is posyou can upgrade their skills and combinations of shots. To make upgrading the characters more interesting, the developers have given the possibility not only to choose which of the two heroes to upgrade but also, if there are the requirements, to upgrade them simultaneously. The stylistic choice that convinced us the least is that of the game scenarios, throughout the progress of the adventure in fact the two Spiderman will explore and fight along closed levels and with which the interaction is really minimal, but above all it is the futuristic look which does not make a good impression and is particularly monotonous since it is so from start to finish, without variety. This flatness of the scenarios is the right completion of an all too linear gameplay that alternates the combat phases with short exploration phases. Both situations are unfortunately ruined by camera management that is not always able to follow the game action and more than sometimes loses our hero. A fight against the Anti Venom is perhaps the perfect exemplification of the problems plaguing the game. After dodging an attack from the beast, we chased it inside a room that is framed in a long shot by the game's camera. We begin to struggle with the added difficulty of being away and a stopwatch starts which indicates that we have just over a minute to save Peter Parker's life. At this point we thought we had to attack the beast with all our energy, and early deaths aside, caused by the strange view and a questionable depth effect, we redid this fight almost a dozen times before realizing that it was only necessary to run away and have the Anti Venom destroy the whole room in order to block the events in the parallel dimension. How could we have known without an indication or a hint that could have come from the brief exchange of ideas with Peter Parker or from the indicators on the screen? There is little left to add, you will surely get an idea. To slightly vary the playability, the developers have included the Challenge mode in which it is possible to face, separately from the Adventure, some passages in a fight against time by flying quickly in pre-established game arenas. During the Adventure we will unlock not only the new moves of the super heroes and new costumes but also the statues depicting the characters of the game and which can be observed in a separate gallery, little more than a trophy room without any purpose. We confirm that there is no multiplayer mode, of any kind. The speech of the game is completely in English but the dialogues have all been translated and have Italian subtitles.", "date": "2011-10-28", "grade": "6.0"}