{"name": "Nel passato di Ashan", "ref": "https://multiplayer.it/recensioni/94825-might-magic-heroes-vi-nel-passato-di-ashan.html", "text": "Although it comes to us with the term Heroes at the end rather than at the beginning, Might & Magic Heroes IV maintains the classic formula of a series of heroes engaged in exploration and purging the enemy from a long series of maps. Heroes can level up, recruit units, collect resources and capture strategic points. The whole game works in turns. In the main map these mark the days and determine the distance traveled by our troops and by those of the enemy. As well as determining different bonuses on a weekly basis. In battle, on the other hand, they determine the ~squares~ that the units can travel and the use of attacks, spells and special abilities. Ashan's heroes Slava, the character with whom the storyline begins, sports Guybrush Threepwood-esque ironic jokes and shows an enviable democratic vein for someone who finds himself crushed between bloodthirsty orcs, demonic orcs, vengeful orcs and all the nefarious creatures and events that can be found in a world populated by so many ogres. Equally profound, although less sympathetic, are the other leaders who we will find ourselves guiding through the long story narrated in the title which anticipates the events of the fifth chapter of the saga by 400 years. In fact, Might & Magic Heroes VI develops along six different campaigns with five maps each offering different enemies and challenges. The difficulty is not necessarily ascending and the turn-based battles, which develop in the classic rectangular maps divided into squares, are often very different from each other depending on the object defended by the enemy and the faction we find ourselves fighting. The units, although they are different from the human ones in the case of orcs and undead, can be divided into some macro-categories. Archers, spearmen and spellcasters strike from afar, the first can hit multiple targets in a row, the second and third can also hit in an area. Melee units are also divided into units capable of hitting multiple targets or a single target, but they are also divided by the possibility of launching attacks by approaching and running away and by their resistance to blows. Characters capable of casting spells also include healers who can heal units, even from a distance, and must be defended by joining them perhaps with armored units and placing them in divensive when they are in the midst of battle. Unfortunately the defense options are limited and it is impossible to fully protect clerics who are only useful when many and divided into various groups, but can hardly turn the tide of a battle fought outnumbered. And this regardless of the selected difficulty. As an addition, in the maps that include the presence of defensive structures there is the catapult, the only siege weapon of this chapter, which acts automatically by hurling a projectile at each turn. Finally we arrive at the leader comfortably placed in the last line. In fact, each army is commanded by a hero who fights from the baseline by casting spells and attacks from afar. The heroes available, in addition to the protagonist of the specific campaign, are varied and each one can command a different army which must obviously be recruited in the cities conquered by the player. However, this is not an automatic process. To recruit and build you need four resources that must be collected on the map or obtained through certain structures, such as mines, which are under the protection of cities and fortresses. These, when conquered, guarantee income in gold and if belonging to orcs and undead they can be converted into human structures. Or used to hire tribal warriors, trolls, ghosts and so on. The same thing goes for shelters which, once conquered, can send a certain number of creatures, on a weekly basis, to the city they depend on. A rich world In terms of global offering Might & Magic Heroes VI is probably the richest in the series. Hundreds of items, legendary sets, profusion of talents, diplomatic and moral choices make the six campaigns a true epic through the life of a family that shapes the future of Ashan. Objects play a very important role in each sector and so do the talents which are numerous and influence the combat, the management and the narrative component. In the single player it is good to have a hero for each use, specialized according to the role or the type of army that you want to entrust him with. Thanks to the numerous talents, ranging from magic to diplomacy, there will therefore be those who will be able to interact best with the neutral factions, those who will be able to help their soldiers with force, those who will enhance siege weapons and those who will be an excellent defender capable of slowing down arrows and renderand strong men. Obviously in multiplayer it is good to choose skills carefully in relation to your approach to the game, considering that, however long the matches, they never last as long as the campaigns where instead it is possible to experiment and, in case of errors, reset and choose the talents again. The developers have also worked a lot on resource management, which are now only four, giving greater importance to the control of mines and buildings. To conquer them it is now necessary to have the city they depend on in hand, although it is possible to stop the production of a single enemy structure by placing a hero on it. This choice obviously affects the structure of the single player but is best expressed in multiplayer where only one more structure can become decisive. Unfortunately, competitive online gameplay is certainly not the ideal environment for an open-map turn-based strategy that necessarily forces long waits. To remedy the problem, multiplayer matches also include the possibility of automatically resolving clashes, transforming the title into a management one. In addition to this, a ghost mode has been created which allows waiting players to control certain ghosts to annoy other participants in the game. Questionable choices In a long title like Might & Magic Heroes VI there is a need to make the single player compelling, making sure that there is never a lack of challenging challenges. Unfortunately, to do this, the developers have combined the excellent artificial intelligence with automatic multipliers which, when our army exceeds a certain size threshold, lead the opposing units to grow dramatically, sometimes ending up becoming insurmountable. Furthermore, there are armies that are recreated in no time at all, forcing us, in the most difficult situations, to fight the same battle dozens of times. On the other hand, the limited defense options and the size of the battlefields, which make escapes and outflanking impossible, make much of the battle depend on the composition and number of soldiers of the armies. Of course it is possible to resolve the clashes automatically, but this gives absolute importance to the number of soldiers employed and above all eliminates part of the gameplay and can still become repetitive. In any case, when the numbers on the field are balanced, tactical combat can give a lot of satisfaction as units, spells and skills are carefully calibrated. The same goes for items like units that have already received another dose of rebalancing with patch 1.1. Furthermore, the balance is undoubtedly there in multiplayer as players' creatures grow at the same rate. But with all the work put into the story and single player situations, it's a shame that this boils down to trying to work around map bugs perhaps not creating big armies early on to 'fool' the AI. And sadly, the flaws don't stop there. In fact, the specter of DRM hovers over Might & Magic Heroes VI which asks us to be connected to the network to access all single player missions, dynasty bonuses and many other elements. Unfortunately, in addition to being necessary, the connection is not even particularly stable with disconnections that damage the multiplayer and prevent the recovery of synchronized saves. The Conflux, or the network of the title, not only performs the functions of a DRM system but includes social elements, skype support and also bulletin boards scattered throughout the game, which appear in the form of small black holes, where we can leave our mark of our passage with a sentence. Valid but perfectible In short, from the point of richness, artistic and playful, this chapter of the series has nothing to envy to anyone with thirty maps divided into six campaigns, different single player scenarios complete with dubbing and cutscenes, skirmish against the AI, hotseat multiplayer , hero duels, ghost mode and tons of skills and items. Unfortunately, the management component of the cities has been too simplified and stiffened, and the menus are not organized in the best possible way with tooltips that often leave us with tons of skills whose real usefulness cannot be known without a field test. Furthermore, a global management of the enlisted units, which between refuges and several conquered cities soon become several, would undoubtedly have streamlined the situation especially in the larger maps. In any case, it is always possible to use tricks such as using the weakest heroes to bring us fresh troops while our front line attacks or intercepts enemy units. But the risk, in the longest and most difficult matches, is that of trobe forced to repeat the procedure innumerable times. If nothing else, the whole thing is very pleasant to see. And while the models aren't particularly inspired they are animated with care both in the main map, in cut-scenes and in turn-based battles, even if in this case the zooms show less detail. In essence, the graphics sector, which draws heavily on Warhammer and the fantasy universe, is of a good standard, capable of immersing us in a world populated by bright magical energies and tortured by demonic scars. The soundtrack is undoubtedly top-level and, in combination with the excellent cutscenes of the campaigns, manages to involve us in a unique way.", "date": "2011-10-27", "grade": "8.0"}