{"name": "Gli eroi di un capolavoro", "ref": "https://multiplayer.it/recensioni/94657-guardian-heroes-gli-eroi-di-un-capolavoro.html", "text": "The game is available for download via Xbox Live The original console that was lucky enough to host the old Guardian Heroes in its player, Sega Saturn, was famous for being able to grind pixels and sprites with decided ease. And already at the time Treasure was known and quite famous among Japanese software houses, either for the great Gunstar Heroes that appeared a few years earlier on Megadrive (which had shown fabulous things for the time), or for the great action games that arrived later , the fact is that their name soon entered into legend as one of the most eccentric, multifaceted and talented companies on the world scene. They tried their hand at platform, action, shooter, rpg, but always with one constant: each game was a rare gem of gameplay, as well as something really nice to see. Guardian Heroes was no exception: in 1996 he managed to amaze audiences and critics for the infinite amount of sprites he threw on the screen and a layered and deep gameplay that mixed the typically ~scrolling action~ elements a la Double Dragon, to be clear, those beat Street Fighter style 'em up and also some purely action features like character leveling and story development. Guardian Heroes, which arrived a few days ago on the Xbox 360 digital delivery service, is an almost perfect port of the original, and at the same time contains the ~remixed~ version in high definition, without slowdowns, without pop-ups and without uncertainties in the engine graphic. In short, the ultimate Guardian Heroes for all video game enthusiasts, all without exception. It is not, however, a simple high definition port: Treasure has extended the game from the original 4/3 TV classics to the modern 16/9, with the effect of viewing the game action in full screen and not the annoying ~ side bars~ already seen in similar repechage productions. Guardian Heroes is not back on all screens today due to a ~dirty~ fan service operation: its gameplay, eccentric and very particular at the time, is fun and original even today, in such a way that everyone can like it, including those who approach this type of games for the first time. A perfect title in single player, but which explodes in multiplayer: it is in fact possible to advance in the main campaign together with a friend (live or on Xbox Live), or challenge 11 others in versus mode, a real online fighting game that takes place in a huge Romanesque-style arena. The Japanese developer Treasure (already on the Marketplace with Ikaruga and Radiant Silvergun) has been able to conquer a certain slice of a devoted public, despite the relatively limited commercial successes of its products. An aura of mystery, magical and gloomy, has almost been created around them, fueled above all by the fact that the company is really small, almost ~artisanal~ and that according to the words of its managing director ~never produces sequels, because each game is a work in its own right~. In reality, this last statement was partially self-denied thanks to the release of a sequel to Guardian Heroes (on Gameboy Advance), demonstrating how much the company cares about this title and considers it as its milestone. And a milestone was also for the ~Saturn Fan~ population, given that Guardian Heroes represented the non plus ultra of graphics and entertainment at the time. And for almost 15 years to have passed, we must say today that it has aged really well. Xbox 360 goals Like every game that has appeared on Xbox Live Arcade, Guardian Heroes also puts the canonical 200 points on the plate, to be unlocked with the equally canonical 12 objectives. Simply by finishing the adventure you get 135 points with 9 objectives, very simple. To get full loot, however, you must unlock all five endings, all 50 usable characters, and complete the story in hard mode without ever continuing. Now that's hardcore! Orbi barrels in 90s sauce! Guardian Heroes is developed on three layers of ~playable~ parallax on which you can move at any time by pressing the back buttons, in pure Fatal Fury style (just to stay nostalgic). It is not, therefore, an exclusively horizontal game, but in which one moves in all directions, while always sliding forward. Treasure has accustomed us to bizarre and original gameplay, and this work is obviously no exception. The techno-fantasy atmosphere is wonderful in which the story unravels through dozens of different paths, to finally arrive at five completely different endings, all of which will obviously need to be explored in order to fully grasp the plot of this wonderful game. The gameplay is once again, as I mentionato prima, totally fresh. You fight for the entire duration of the adventure (it will take many and many hours to complete it), this is obvious, but you do it with a typically rpg vein: after each level, based on how many kills we have performed and therefore the 'experience obtained, we must assign points to all the various items that make up our character: speed, power, attack, magic, resistance, and so on. The levels are filled with bosses, a typically ~made in Treasure~ element and dozens and dozens of different enemies, all magically ~alive~ and beautiful, never anonymous, never banal, never a sense of deja-vu, a sensation that is now too much common in all video games. Our choices will affect the story, which will branch into multiple paths and different destinations each time, making this title replayable over and over again and always fun to try and try again. Connected to Xbox Live you can invite a friend to complete the story together, or launch ourselves into the wonderful versus mode: an orgy of sprites ranging from gigantic to tiny, dozens and dozens of fighters thrown into the fray, and us and 11 others in between fools chosen among our friends. This massive battle is frantic and bloody messy, but it's also (strangely) fun. From a purely aesthetic point of view, however, the game maintains all the strengths and weaknesses of the original: in classic mode the pixels are really big and angular, especially with the bigger characters. To maintain that graphic standard, the developers of the time could only resort to that trick: decreasing the resolution of the sprites. By clicking on the ~remix~ version in HD, however, the textures are much sharper, even if they suffer from a certain washed-out effect, as they have not been entirely redesigned but ~simply~ enjoy an excellent HD filter combined with a ~pencil~ effect about the characters. Still other effects, however, were created from scratch (see: fire, explosions, particles). Even the soundtrack remains what it used to be, but the latter doesn't need ~remixes~, remaining the usual, classic, beautiful 90s soundtrack. But what makes Guardian Heroes truly unique is not so much the amount of sprites it animates, but the unique and colorful style that the Treasure designers have been able to give to their creature, still today easily recognizable among thousands, original and always incredibly fascinating. PS: the game is all in Italian! Guardian Heroes is available for 800 Microsoft Points in the Arcade area of the Marketplace and can be downloaded at this address.", "date": "2011-10-20", "grade": "9.0"}