{"name": "Recensione Conker: Live&Reloaded", "ref": "https://multiplayer.it/recensioni/recensione-conker-livereloaded.html", "text": "One of the sides that is most appreciated during the passing of the levels is the ability of the developers to be able to mask the many crude and violent scenes, thanks to Conker's charisma, and the context in which the events take place, which never prove too exaggerated or heavy. The cut-scenes, unlike some titles in which they become more of a burden than a pleasant interlude, are among the funniest to appear on an Xbox title, full of almost grotesque and decidedly non-politically correct situations. It is useless to try to describe the game by trying to give some examples, with a simple written text it would not be possible to give an idea of the situation in the slightest. The very structure of the puzzles is not very open, the way to overcome certain passages is always unambiguous and therefore sometimes you feel the lack of a second chance, to better adapt to your style of play. In Conker, in addition to the main mode, there is another area dedicated to the single player, or the ~Chapter X~ in which you can prepare for multi-player clashes, training against bots in various difficulty levels. Two squirrels are better than one The other half of Conker: Live & Reloaded is represented by multiplayer support in all its modes, starting from support for System Link and Split Screen up to 2 players. The general support reaches up to a maximum of 16 players, the maps available for the multiplayer mode are 8, perhaps a somewhat limited number, although the extension of certain stages is truly remarkable. In any case, Conker has support for downloading additional content, so in the future we may have some add-ons directly from Rare. The multiplayer areas are divided into Future War and old War, but they won't change the game modes or rules, it's just a different level design. In multiplayer there are two factions, that of the Tediz (bears) and the SHC or the clones of Conker. Choosing one or the other race will not make any difference, present instead in the six different classes of soldiers. In fact, we go from the simple one up to snipers or demolishers. Each class has a particular armament and skills, in addition there are two other factors to consider, as regards the multiplayer game mechanics. The first is represented by the possibility of improving the potential of our fighter and in particular of the weapons used through add-ons and upgrades. The other interesting factor is the ability to change character class during games, even if this operation, which can only be carried out in certain areas exposed to enemies, will take a few seconds in which the character will remain defenseless. Although there are several variables and options to reproduce an optimal game system in the various matches, there are some balancing problems in the multiplayer mode. First of all the effectiveness of some weapons, for example the Bazooka in the hands of the demolishers, which is far too exaggerated, moreover it is recommended to enter matches where there are several active players, the extension and the design of the maps does not enhance the games with few soldiers. There is also the possibility of using vehicles during multiplayer clashes, even in this sector, however, it must be noted that each vehicle is linked to a class of belonging and therefore not accessible by all players. On the other hand, the rankings and statistics system is very well implemented, which tracks every detail of our matches and our performances. Technically Speaking.. The department in which no criticism can be made of Rare is certainly the technical one, undoubtedly among the best on Xbox in terms of rendering and graphic impact. The best comes out during the single player campaign, with environments and levels full of details and effects even more than the multiplayer maps. In the graphics engine there is no longer anything derived from the N64 version, and indeed the polygonal models, effects such as fur shading or bump mapping in symbiosis and excellently made textures are appreciated, even if the real strength is due to light effects and dynamic shadows. The cleaning on the screen and the frame rate should also be commended, which always remains stable with the exception of some matches in split screen or in borderline situations. Special mention also for the soundtrack, which manages to emphasize every single passage in Conker. As far as localization is concerned, the dialogues are in English while texts and subtitles have been translated into Italian. Ultimately Conker Live & Reloaded is an excellent title and, probably on Xbox, the best in the genre. Excellent title which however does not enter the Olympus dhe ~unpreventable~ for some balancing problems in multiplayer modes, and for some aspect of the single player perhaps a little dated today. In any case, L&V still remains one of a kind thanks to the touch of Rare, which perhaps created an atypical atmosphere, but certainly not yet equaled. Pros: Superb graphics Single Player Setting Cons: Balanced multiplayer Few differences from the first N64 version Few maps in multiplayer Conker Live & Reloaded was announced on Xbox a couple of years ago and initially it should have been a title focused on the multiplayer component, to recreate a sort of Counter Strike integrated into the Conker universe. However, during development Rare partially modified this concept, splitting the areas of attention into two, re-edition of the original title released on Nintendo 64 on the one hand, and a full-bodied multiplayer mode on the other. It all begins when a bizarre squirrel, named Conker, wakes up after a colossal hangover, lost in an environment that is not too well known. The world and Conker's behavior itself are a mixture of humor, quotes from films such as Dracula, Alien, Terminator , Martrix just to name a few, and pure irreverence. The main campaign lasts between 10 and 15 hours in all, and starts with old-fashioned platforming. During the advanced levels, the game mechanics change by acquiring a greater action component, due to an increasing number of third-person fights. The passage is gradual almost like a crescendo of the rhythm, until the end of the adventure. The control method is extremely intuitive, also thanks to the presence of a contextual key (the default B button), the effect of which will vary depending on the situation and the place where the anti-hero made of squirrel will be found. For the rest we have the use of the triggers to use the weapons and then the key to manage the inevitable jumps, in various styles, which cannot be missing in any platform game. The different game areas are interspersed with loading screens, which are never too long, it is also necessary to underline the excellent work done by the Rare studios in the care of the smallest details scattered throughout the various levels, combined with a graphic aspect at the top of the category.", "date": "2005-06-24", "grade": null}