{"name": "Spider-Man: Edge of Time", "ref": "https://multiplayer.it/recensioni/94420-spider-man-edge-of-time-hanno-ucciso-luomo-ragno.html", "text": "Version tested: WiiDeath is a relative concept in the Marvel Universe, and it is no coincidence that Spider-Man himself jokes about it, during one of the numerous dialogues with his counterpart from 2099. The two superheroes have come into contact in the past and this bond has united them beyond space and time barriers, so as to allow them to communicate ~telepathically~ despite being on different planes of reality: on the one hand Peter Parker, freelance photojournalist for the Daily Bugle who, bitten by a radioactive spider , acquires the proportional powers of a spider and decides to use them to fight crime; on the other Miguel O'Hara, a geneticist from New York in the year 2099, who obtains abilities similar to those of his predecessor due to a laboratory accident that modifies his DNA. The incipit of Spider-Man: Edge of Time is undoubtedly of great impact: the Spider-Man we all know is killed by an enhanced version of Anti-Venom while he is near a mysterious portal, but the version of the 2099 manages to intervene in extremis to foil the incident. Peter Parker, projected back in time but in a reality that doesn't belong to him, is therefore safe, but not for long: if he wants to change his own destiny and that of the entire city, transformed into a sort of branch for an evil corporation, he must interact with the Spider-Man of the future and trigger a series of events capable of restoring the state of things; and perhaps to avoid his death. The plot of the game at first glance seems to follow that of Beenox's previous work, Shattered Dimensions, where the Arrampicamuri was present in four variants instead of two. However, the story written by Peter David (one of the best authors under Marvel) meshes after a few minutes and takes us on different tracks, also capable of some interesting twists. Different twins The action of Spider-Man: Edge of Time takes place entirely within the boundless (but really!) headquarters of Alchemax, the company that in the ~alternative present~ created by the time paradox has acquired total control of New York and who knows how many other cities, thanks to a series of patents that have changed society as we know it. The transition from the classic Spider-Man to the 2099 counterpart does not happen by choice of the player, but occurs according to the events narrated, with even rather original solutions, especially towards the end of the adventure (which we completed in about eight hours), when interactions become tighter and the two heroes find themselves almost side by side to face a common threat. The vision of Spider-Man proposed to us by Beenox seemed to us halfway between the aesthetics of the popular narrative cycle designed by John Romita Jr. and that of the films directed by Sam Raimi, with which Edge of Time has in common the almost complete destruction of the red and blue costume, which is literally reduced to shreds under the blows of some powerful enemies, as well as the dynamism of the ~web swinging~ sequences, rendered very well in the game but exploited less than we would have expected due to the lack of purely urban scenarios. The character we control can hover in the air and jump from one web to another by holding down and releasing the B trigger of the Wii-mote, or press the same button once to reach the areas highlighted by yellow markers. The A button is used for the normal jump, while the Nunchuk module is responsible for the movement (analog stick) to manage the view (Z button) and to activate the special ability (C button), which in the case of the classic Spider-Man results in a sort of ~super reaction~, with the famous spider-sense that allows the hero to move much faster than his opponents, while for the 2099 Spider-Man it consists in the release of a very useful ~copy~ when we are under the aiming of missiles and turrets, and which with the necessary upgrades can also take on an offensive value. The use of the four directions of the d-pad for the execution of offensive maneuvers (normal combo, heavy combo, throwing web projectiles and various other combinations) makes a (nice) little turn up, also because the same d -pad, in combination with the Z button, is used to move the camera. This situation, unfortunately not modifiable in any way (it would have been nice to support the Classic Controller, for example), sometimes gives rise to moments of pure chaos, also and above all due to a management of the virtual camera that leaks everywhere and which in some moments literally goes crazy (see when it adheres to a wall), making life very difficult for us. Spider-Man, you are Spider-Man... If you succeedand to come to terms with the cumbersome control system, with the mediocre management of the visual and with a series of more or less evident defects of the graphics (polygonal interpenetrations, above all), Spider-Man: Edge of Time manages to express its potential and provides Marvel superhero fans with a more than decent experience, supported by a convincing storyline, very well written dialogues and even a considerable level of challenge, especially in the more advanced stages, when the enemies will get really tough and there will be sections that will require much more than one attempt to be successfully overcome. The upgrade system, which works through the spheres of light and the ~golden spiders~ that we can collect within the scenarios, never ~sells out~; indeed, even after completing the game, you will hardly be able to buy all the possible upgrades, which promotes a certain degree of replayability of the Beenox title, together with the possibility of facing certain sections again in a sort of time attack with fifteen different alternative costumes up for grabs for the 'Spiderman. The developers have worked very well in terms of progression: the powers and abilities of the two Spider-Man are gradually enriched and therefore are never trivialized, but rather play a central role in the economy of the gameplay. Moving on to the technical sector, beyond the defects already highlighted, one can certainly speak of uninspired settings, quite similar to each other and very flat, at least in the Wii version, contrasted however with an excellent care of the main character in terms of detail and animations . The sound is also good, with normal effects and music that in some cases manage to emerge and bring out a bit of cinematic epicness. Too bad for the long dialogues in English: a complete localization would have made the adventure more enjoyable.", "date": "2011-10-14", "grade": "6.0"}