{"name": "Fifa 12", "ref": "https://multiplayer.it/recensioni/94334-fifa-12-sul-filo-del-fuorigioco.html", "text": "Tested version: iPad It's a decidedly interesting year for Electronic Arts football; firstly, the home console and pc editions brought with them elements such as tactical defense and the impact engine that marked a decisive turning point for the entire genre. In its small way, even the iOS version was however awaited at the gate with some interest, to check its progress after last year's reboot had made a clean sweep of the hitherto terrible 3D versions for smartphones and mobile phones. It's in the game Even with its limitations, combined with the intrinsic ones of the touch screen very unsuitable for supporting football titles, Fifa 11 had in fact guaranteed fans of the genre a more than discreet portable reduction of the famous EA franchise, demonstrating the possibility of maintaining a respectable level of quality even on iOS. However, with Fifa 12, the Romanian team in charge of the project has chosen the path of small, if not very small, steps, a philosophy certainly similar to many series of sports video games but which cannot fail to leave some perplexities. Starting with the graphic component, of a good level on the small screen of the iPhone but which shows far too many flaws on the iPad; it is above all the low quality and definition textures that annoy, even more evident during close-up shots or when you pay attention to the elements of the backdrop, not to mention the reproduction of the hair. Considering what we have seen running on Apple platforms in recent times, frankly we would have hoped for a more incisive graphic improvement compared to last year. The range of game modes offered is also particularly poor, which only finds in the one called ~coach~ a robustness sufficient to support longevity in the long term; thanks to it, in fact, it is possible to manage not only the actual matches, but also surrounding elements such as the transfer market, training sessions, relations with the management and so on. But it is certainly the absence of any multiplayer option that appears unjustifiable, especially taking into account that the previous episode provided for a local one via wi-fi or bluetooth; probably EA will fix it with a future update, but in the current state of affairs it is impossible to turn a blind eye to this lack. In reality, there is a way for two to play on the iPad, using a pair of iPhones as controllers and the (free) EA Gamepad application, but this is a very marginal feature and not easy to implement in practice. Less dramatic but still unpleasant is the absence of the commentary in Italian; once again there is in fact only the one in English, among other things annoying to the point of necessarily having to be deactivated after a few minutes. More generally, the audio sector appears weak and forgettable. Turning instead to the actual game, the experience offered with last year's reboot was quite faithfully traced; the novelties are minimal and not always convincing, such as for example the need to touch a partner to suggest that he sprint forward, an action that is difficult to perform if you do not have a third hand. On the other hand, the management of free kicks, corners and penalties is valid, which uses the touch screen to determine angle and power. The control system obviously uses sticks and three virtual keys; the latter can be set both sensitive to the context, and in a more traditional way in advanced mode as simple buttons renamed A, B and C. The first solution, however, appears preferable, since the advanced one really requires too much precision and a series of combinations quite that go far beyond the possibilities of the touch screen. In general, however, the gameplay is fluid and pleasant, even if the responsiveness of its players is not at the level of those controlled by the CPU, making the games rather frustrating at higher difficulty levels. On the other hand, the behavior of the goalkeepers is always extremely open to criticism, due to a rather buggy artificial intelligence. The tested version is 1.0.2 Price: iPhone 4.99, iPad 6.99 App Store links", "date": "2011-10-12", "grade": "9.5"}