{"name": "Guns of War", "ref": "https://multiplayer.it/recensioni/94002-shadowgun-guns-of-war.html", "text": "Tested version: iPad The developers of MadFinger Games are certainly not the latest arrivals on iOS systems, thanks to the critical and public success of their previous works, or Samurai: Way of the Warrior and its sequel Samurai II: Vengeance. Already on these occasions, the team had distinguished itself for the excellent work done from a technical point of view, a little less as regards the gameplay, both times it appeared valid but basically derivative and tending towards repetitiveness. Consequently, it can be said that with this highly anticipated Shadowgun the software house has arrived at the classic videogame maturity exam, that is the watershed that divides ~normal~ developers from those above average. So let's see in which of the two categories MadFinger Games can be placed... Marcus Fenix Jr. Shadowgun is in all respects a clone of Gears of War, with so many and such references to Epic's masterpiece that it is objectively impossible not to give him this nasty definition. There is a hostile setting full of big, muscular and greenish enemies, a wiry protagonist dressed in heavy armor like an armored vehicle, various weapons with a ~suspicious~ look with which to tear enemies apart and above all a gameplay that rests almost exclusively on a shooter action peppered with a cover system modeled exactly in the style of Marcus Fenix: even the animations of the hero of the moment in the cover phase are practically indistinguishable from those of his illustrious mentor. In short, if we add to all this a storyline thrown in just for the record and anonymous characters (to be polite), Shadowgun practically embodies all those elements that are often criticized in Gameloft titles. However, there are also positive analogies with the productions of the French software house, more precisely when it comes to the quality of the technical realization. In fact, MadFinger Games has made excellent use of Apple hardware, effectively creating one of the most visually impressive games available on the App Store. The engine manages extensive and rather detailed environments without the slightest hiccup, seasoned with excellent light effects and well-defined textures; decidedly above average also the polygonal models of the characters, beautiful massive and expertly animated. In short, the glance is one of those that leave their mark, especially when Shadowgun decides to exaggerate and stage huge bosses who smash everything with machine gun shots and heat-seeking rockets. Wanting to nitpick, the developers can be criticized for a certain lack of style and a palpable repetitiveness in the scenarios, but in principle the result is still of the highest level. The same, alas, cannot be said for what concerns the playful aspect, only discreet. Shadowgun pays for being a carbon copy of Gears of War, without sharing its charisma and personality: of course, there are the shootings and the cover system, but the level design is limited to proposing the same elementary scheme (that is, cleaning up a room from enemies, open a door and repeat the process) for all the 5-6 hours necessary to complete the adventure, thus affecting the enjoyment of the product. Too bad, because the technical skills are not lacking in MadFinger Games also for what concerns the control system, precise and reliable despite the absence of physical support. Any point on the left half of the touchscreen can be used to control the character, and the same thing applies to the right side dedicated to managing the view; the cover is activated automatically whenever you lean against a wall or an obstacle, the inventory is conveniently positioned in the top corner of the screen and the only two virtual keys are used to reload the weapon and fire or perform a contextual action. Shadowgun is an action game therefore equipped with a superfine form, which however is not accompanied by an equally valid substance... The tested version is 1.0.2 Price: 5.99 App Store links", "date": "2011-10-04", "grade": "7.3"}