{"name": "Leggende Pokmon: Arceus", "ref": "https://multiplayer.it/recensioni/leggende-pokemon-arceus-recensione.html", "text": "If you have managed to keep your distance from the sensational leaks of recent days, then know that this review of Pokmon Legends: Arceus is a safe haven. Nothing about the story will be anticipated and you will also be able to discover some of the contents of this innovative ~Pokmon experience~ for yourself on January 28, 2022, when the game finally arrives exclusively on Nintendo Switch. Today we will therefore limit ourselves to telling you about the new mechanics, how they work and if they can represent the expected evolution of the series. Obviously without neglecting a hint of the overall quality of this new narrative structure. Because we are talking about the most ambitious chapter of the series ever developed, which could represent a real new beginning for Nintendo's pocket monsters. Will everything go as planned? Find out in the Pokmon Legends: Arceus review. Graphics: I want but I can't? Pokmon Legends: Arceus, Professor Laven will be our mentor Let's get this pebble off our shoe now, shall we? Pokmon Legends: Arceus isn't a bad game to look at, but it still falls short on the limited hardware it runs on. We should all know by now that the guys from Games Freak aren't exactly monsters from a technological point of view, but that from a series with the resources of Pokmon in 2022 we expect more is quite legitimate. Having said that, the glance, in some circumstances, is convincing. Playing in portability on Switch OLED, the screen returns bright and vivid colors that embellish each model or scenario, and it is certainly the best way to enjoy the experience. On the screen of a normal TV, in fact, the increased resolution highlights the poverty of the graphics engine all too much, compared to an artistic direction that we greatly appreciated. Unfortunately, the low resolution of the textures and the intrusive aliasing dirty the image spread on the TV up to make it more ugly than necessary. The downside lies in the fluidity, which the first trailers suggested to be lame to say the least and which instead, in the final code, proved to be more than appreciable. The graphics engine drops very few frames, and only in rare moments of crowding. It is clear that those of Game Freak had to make more compromises than necessary to maintain this stability, saving on textures and filters to stem the inevitable fogging and pop-up problems, which are present, but much less marked than in the Wild Lands of Pokmon Sword and Shield. Amazon offer Pokmon Legends: Arceus - Nintendo Switch 59.99 See Offer The result is therefore a satisfactory visual horizon that allows you to recognize the pokmon and resources in the distance, but also a smoothness of the gameplay that goes well with the freedom of movement granted to the player, especially once the rideable pokmon such as Wyrdeer or Basculegion have been unlocked , which allow you to traverse the huge maps seamlessly, without annoying slowdowns or cutscenes. The various areas are therefore separated in the manner of Monster Hunter, with the Jubilee Village referring to the other maps. Within each of them you can then travel quickly between camps, and loads are lightning fast. The geographic diversity is compelling; each map represents one or more biomes, guaranteeing the variety that one would expect from a title of this genre. The monsters that you meet in Hisui are many and sensibly distributed in the maps: we were surprised by the excellent quality of the animations and the effects that distinguish the moves, strongly spectacularizing the new close-range fights. Pokmon Legends: Arceus, the Seals on the shore of the Overseas Coast We also liked the implementation of a day/night cycle, which affects not only the lighting, but also the fauna and to a lesser extent the gameplay, and the random atmospheric system that adds some small but delightful visual details, such as the wet clothing shaders or realistic rain and wind sound effects. On this aspect, it's worth pointing out that the soundtrack is one of the best we've heard in many years of Pokmon, but it's also well-balanced, and often replaced only by ambient effects that contribute to a general sense of immersion. It's a pity, therefore, that Game Freak has not decided to go one step further and dub the dialogues of the picturesque cast of characters that we will meet during the adventure. Let the well-known 8-bit verses of the pokmon pass, but Pokmon Legends: Arceus in a certain sense betrays its technically retrograde nature just when the characters open their mouths but to give them a voice there are sotexts to read. Pokmon 2.0 Pokmon legends: Arceus, Starly and Bidoof roaming the Obsidian Land What is Pokmon? In short, what is it that defines it compared to many other RPGs of the Japanese school? This must be the question Game Freak asked themselves while imagining the future of the series, and to answer it they certainly watched an episode of the cartoon. In those scenes in which Ash Ketchum and his companions roam freely in the woods, meadows and clearings, looking for wild pokmon to register in the PokDex, the guys from Game Freak have found the answer they were looking for. Breaking free from the rails and constraints of old-fashioned JRPGs, Pokmon Legends: Arceus is the closest game to that idea of adventure. And the technical sector that we discussed above contributes significantly to its success: despite being old-fashioned, it conveys a completely new feeling to players who have grown up in the Paths of previous titles. We can assure you that the aforementioned flaws, such as aliasing or bad textures, take a back seat in front of the composition of a picture that finally respects the fantasy that has always been Pokmon outside the videogame borders. Exploring the Hisui of the past, hiding in the grass that sways in the wind to observe the pokmon grazing undisturbed a few meters away, is an unusual and engaging experience. Especially because the little monsters can react to our presence in the most disparate ways: someone could run away, someone else could approach curiously, most will attack us on sight and we will be forced to dodge the moves in real time. If our character takes too much damage, he ends up in the nearest camp, losing some items in his purse. Pokmon legends: Arceus, if a pokmon notices you it will be more difficult to capture it Game Over does not exist and even when the available pokmon run out in a fight against a wild monster, the game limits itself to closing the fight to give us back control of the character in the 3D environment. This already says a lot about the importance that Pokmon Legends gives to battles. They are practically secondary and, to be honest, you could even avoid almost every fight except those imposed by history, which are not always the traditional clashes with the coaches, also because in this era of real coaches there are still none. Humans have just begun to study pokmon, and the deliberate superficiality of the PokDex, which offers much less information than in the past, precisely reflects this aspect of the narrative. of the most appropriate level. In most cases, you don't even have to fight to catch a monster. Just pull the Pok Ball - perhaps from hidden and behind, so the chances of capture increase - and the game is done. Alternatively, weakening a pokmon to capture it in battle is still an option, but it's not the only one. Pokmon legends: Arceus, Cyndaquil vs. Munchlax And even your approach can be more or less tactical. It will be easier to capture certain pokmon if you first distract or confuse them with the appropriate tools, such as the treats that you can collect around the map or make through a simple but robust DIY system that allows, among other things, to craft the various types of Pok Balls or to synthesize Potions and Revitalizers. The exploration and capture of pokmon are the pillars of the new course and are intertwined with a very free progression right from the start, but at the same time subjected to a series of stakes. In Professor Laven's PokDex we will find a series of objectives for each registered pokmon that will make us earn analysis points with Team Galassia to which we belong: each threshold reached translates into a promotion and, therefore, permission to access the next map. Once we reach a new map, we will be able to freely explore it far and wide right away, but the story at a certain point will lead us to the next map, provided that we have reached the necessary degree for entry. Pokmon Legends: Arceus, at the Jubilee Village you will find a general store, a hairdresser and other services The height of this ~wall~ really depends on how you play. If you hastily dedicate yourself to the campaign alone, catching just the pokmon needed to beat the boss on duty, without even dedicating yourself to the NPC Requests, then it is clear that at some point you will have to stop and scrape together points for a promotion. If, on the other hand, you respect the philosophy of the game, catching the new pokmon you are inmbeats and by completing not all but even just a few tasks for each of them, the analysis points practically make themselves and you do not suffer from any restrictions. How you approach the adventure also reflects on your overall longevity, of course. The discrepancy between how Game Freak would like us to play Pokmon Legends: Arceus and how we actually play it is admittedly a sticky one. The combat system itself bends under this perspective. Wild pokmon can band together and attack us together: we may have hired one only to find ourselves fighting another pair of little monsters who were too close. In these cases, defeat is practically certain, but it is not an imbalance in the level of difficulty, but an indirect way to tell the player: find another way. Fighting Hisui Pokmon Legends: Arceus, Wyrdeer will be your first mount That Pokmon Legends is an experimental course can be understood as soon as the combat system is analyzed in more detail and, better yet, all the RPG apparatus that has supported it in the past: numbers, mechanics, skills, statistics, moves and so on. Pokmon Legends streamlines it impressively and this, we believe, will be the contentious that may or may not really disappoint a great many players. By now it should be known that behind the boyish veneer of the mother series was hidden a robust and extremely complex RPG that has found its maximum expression in the competitive scene. Pokmon legends gets rid of practically any sophistication, sacrificing customization in favor of some more or less brilliant intuitions. For example, now pokmon no longer have to forget the moves: each new move learned is set aside and we can reconfigure the battle setup at any time by simply swapping moves in the move menu. A simple and ingenious solution which, however, completely sacrifices the importance of the choice: pokmon belonging to the same species ideally all grow the same... unless they are Alpha, i.e. enhanced versions and more difficult to catch. Pokmon legends: Arceus, throw pokmon against trees to get PE, berries and maybe some Burmy Pokmon Legends, among other things, foregoes proven features such as abilities, introduced from the third generation onwards, or the ability of monsters to hold tools that grant certain bonuses. They are simply no longer there, just as it is no longer possible to pair pokmon or train them separately. It is a streamlining that will surely help new players get closer to the title, and that Nintendo has probably opted not to go and rebalance the entire combat system based on the new Quick and Powerful Technique. The latter, however, did not convince us 100%. With a nod to Octopath Traveler and Bravely Default, the new combat system allows us to enhance some moves - the ~mastered~ ones, i.e. that the pokmon has already used a certain number of times - making them Fast or Powerful. In both cases they consume a greater number of PP: the Quick ones inflict less damage, but speed up the pokmon's turns, sometimes allowing it to act twice in a row, while the Powerful ones have the completely opposite effect: they do more damage, but slow down the pocketmonster. Pokmon legends: Arceus, the three starting pokmon Considering that even the pokmon we are fighting against can take advantage of this mechanic, one would think that it is essential to assimilate it to get the better of the fights. Instead we found it quite negligible. Often all it takes is a move to be super effective to overwhelm an opponent, even in the face of huge gaps in experience levels. Unlike the aforementioned Square Enix RPGs, in which it was simply necessary to exploit the peculiar mechanics to win, in Pokmon Legends the need is rarely felt. Just think that the most iconic battles in the game are not subordinated to an actual fight. Instead, they are action-tinged fights in which we will have to dodge the attacks of the pokmon on duty in real time, learning his patterns to roll away and respond by pulling the Sferezen in order to calm him down. If desired, you can fight against the pokmon at the right time to weaken it and increase the effectiveness of the Sferezen, but it is not strictly necessary. For the avoidance of doubt, we want to clarify that these boss fights, however essential, we definitely liked, and some proved to be complex enough to keep us on our toes all the time. The right way Pokmon Legends: Arceus, the Ra Technique", "date": "2022-01-26", "grade": "8.5"}