{"name": "Pro Evolution Soccer 2012", "ref": "https://multiplayer.it/recensioni/93813-pro-evolution-soccer-2012-pes-2012-il-calcio-giocato-in-maniera-intelligente.html", "text": "Versions tested: PC and PlayStation 3 The fate that hit Pro Evolution Soccer 2012 this year is curious. The release date in most European countries has been brought forward to September 29 with a bang and, always curiously, Konami has decided to ~block~ the reviews from specialized Italian magazines up to this date on the altar of who knows what commercial move. The result on our site has been that of many complaints about the fact that the Japanese developer's football simulation has not yet had a review, but as you have understood by reading these few lines, it did not depend on us. It doesn't matter anyway! We're here to tell you about the 2012 version of a series that has had major difficulties with the current generation of consoles, but has finally got back on track in the latest editions. PES 2012 sees the major innovations especially in the gameplay area, and confirms a clear direction taken by Konami: to offer a different perspective on football games, more immediate and fun, with different automatisms grafted into other aspects that instead head towards realism, such as the physics of the ball and the representation of the match as such. Particular choice, given that until a few years ago Winning Eleven and PES were considered the paradigm of football simulations, but also wise, because imitating a production that is currently at very high levels almost never leads to satisfactory results. Returns and departures In PES 2012 we have a welcome return, training with challenges dedicated to the various fundamentals, for example those related to free kicks and dribbling with three different levels of difficulty and as many trophies for each one. This mode reminded us of the heyday of the series and certainly represents a good way to familiarize yourself with the fundamental aspects of the gameplay. The menu that awaits the player is substantially unchanged compared to the last edition, with the possibility of creating your own virtual avatar in all its features and complete with photos and personalized background. A subsequent menu allows you to keep track of all the numerous statistics related to your results and obviously participate in the Become a Legend mode, which is paired with the Master League in the Football Life section (we refuse to call it the name chosen for the Italian translation, World Footballer). This year Konami has tried to work in an identification key, giving space to some interlude sequences where, depending on the case, your assistant coach, president or attorney talks to you, gives advice and so on. There is no shortage of presentations of new purchases in order to make the experience more cohesive, the problem is that all these sequences become repetitive very quickly and tend to slow down the flow of the game, not to mention that they don't shine in terms of execution. As for the rest, we have several small changes especially in the management of the transfer market and in the progression of your player, but unfortunately the feeling is that the Master League and Myths need profound changes to be attractive and perhaps more ~likely~ with the real football: always starting with invented or semi-unknown players, managing the transfer market and contracts in a way so far from reality greatly reduces the attractiveness of what were once the cornerstones of the Pro Evolution Soccer series. Even the mode that allows you to manage the club as president (it can be bought in the extra menu with game credits) follows this sketchy and underdeveloped philosophy. Luckily there are Champions League, Copa Libertadores and Europa League, a strong point of Konami production and as always equipped with music, logos and licenses of the teams that take part. The Champions League is the pinnacle of enjoyment for all football fans, and taking part in it with your favorite team is always a pleasure, as is playing with South American talent in the Copa Libertadores. After three years, however, the enthusiasm cannot be at the highest level, it would have been nice to carry these modes online, and make real tournaments where to raise the cup you have to beat other human opponents. The online game is instead entrusted to the classic ranked matches, to the Master League, which in this case becomes more interesting, to the community, substantially unchanged but with a few more options and to some tournaments created ad hoc by Konami, with the nice feature of being able review the highlights of the last final. For now, the choice is rather thin and in general the system of online classics remains not very ~exciting~. It's naturaland that if looking at the competition we find a system that pushes a lot to play in multiplayer, we cannot instead be satisfied with the much simpler and less structured system of PES 2012. As for the lag we have not encountered any particular problems, considering that the title it is not yet at full capacity of connected users, while we point out the beta of Mypes, a social service integrated among other things with Facebook that allows you to share game progress with your friends and is available with a patch starting from day one. Playstation 3 trophies PES 2012 offers 37 trophies, of which 4 are gold and 13 are silver. The ~easier~ ones are obtained by winning the first match offline and online, the Champions League, the Copa Libertadores and so on. The more complex ones making a career in the Master League, Myths and President of the Club, with a whole series of trophies to be achieved linked to victory in the cups and the improvement of one's personalized player. To get the coveted platinum you must therefore invest a significant amount of hours in all game modes. The extra never fails Do not miss the extra content section, where you can first download the updated squads and access a sort of internal shop through which you can buy hairstyles, even irregularly shaped balls, boots, classic players and teams up to retro and special liveries for stadiums through the use of GP which is accumulated by winning matches and more. Also this year, in fact, the editor returns, which in PES 2012 is extremely complete, starting from the creation of new players or the customization of existing ones without restrictions, passing through the name of the championships and their logos. In the latter case it is possible to build it from scratch with a special interface or take a picture with the camera or even import images from disk. The stadium editor is equally complete: it is possible to create one from scratch but with a fixed form; the interesting thing is the choice of the type of grandstand among those available, the livery of the roof, ceiling and fences, the color of the seats, the benches, the type of lighting and the background. All liveries can be customized with images imported from the hard disk while, as mentioned, there are also funny and retro ones such as those of Gradius and Castlevania, which can be purchased in the extras menu. Imagine a game with your pumpkin-headed players in a brightly colored stadium with a spaceship in the background. Before taking the field for the gameplay, we approach by unfortunately once again pointing out the little effort made by Konami regarding the licenses of teams and consequently of the players. Seeing the English league decimated in 2011 by the lack of teams with official names and uniforms or the German league absent and only featuring Champions League teams is frankly unacceptable. Another age-old problem is the lack of the latest transfer transfers, which will only be added with a post-exit patch. The Copa Libertadores instead adds a nice window on the teams of the South American championship and is aimed at budding connoisseurs and observers. As far as the technical aspect is concerned, Konami as always has managed to do an excellent job in making the shirts and faces of the players, which are impressive in their resemblance to the most famous ones and also good in terms of the others; compared to the competition there is more uniformity in this sense, a symptom that the PES 2012 editor is quite advanced. The presentation of the match is always a strong point of the series, either for the Champions license with the logos and the rest, or for the directing cut and the replays. From a purely technical point of view, however, there are ups and downs: the stadiums are mostly only average and the blur effect that characterizes the replays is a bit annoying, a symptom that this year too is present to mask some frame rate imperfections. We close the technical analysis with the excellent commentary that characterizes the title, both from an expressive and technical point of view. This year Pardo is joined by Luca Marchegiani and the result is quite good: there is a lot of variety in the sentences of the two commentators, for example when they take two consecutive corner kicks, if there are rejections in the area, fouls of different kinds in the middle of the pitch or special matches like the clasico between Barcelona and Real Madrid. The transition between one sentence and another is often perfect and therefore we have a further element in terms of identification. Kick off Here we are at the pad test in hand! Already last year Konami had begun that work of eliminating the tracks that is so vintageand in PES 2012 we have the introduction and refinement of some mechanisms that make the gameplay even more refined. The manual passes have five different settings this year which allow you to manage game changes and quick passes in the strait very well; an absolute novelty is represented by the manual controls on one's teammates, both in the active and passive game phase. In the first case, in fact, it is possible to use the right analog to select and then move a companion nearby while controlling your own with the left one. During free kicks or lateral fouls, you can directly decide which player to pass the ball towards, always scrolling quickly via the analog. These two implementations allow a new level of control over the tactical aspect of the match and the type of actions that can be undertaken. It is indeed a bit cumbersome at the beginning because both actions have to be coordinated with the analogs, but after a bit of practice we managed to free our companions in a way impossible to achieve by artificial intelligence. Let it be clear, however, that the Japanese developer, as already mentioned in the introduction, has taken a path that plans to enhance the spectacular side of football, sometimes sacrificing realism and the complete freedom of the player. We are referring to the impossibility of marking the defender closest to the goalkeeper who has to take the goal clearance rather than the automatic and contextual animations to the type of player and the position with respect to the ball. Or still to the acrobatics outside the area such as semi-overturned by players only normal or clear trajectory corrections to meet the view or some rebounds. These are choices that tend to create a rift between those who appreciate or not this gameplay, however ~piloted~ in certain aspects. In any case, the fact that this year the players are much more reactive helps to increase the fun and give good sensations to the pad in the hand, for a feeling that was somewhat lost in recent years. This ~dualism~ can also be seen in the physical contrasts: on the one hand the players are in fact a little too light and unnatural when changing direction, on the other hand the contacts are more credible: for example if you intervene violently by pressing the X key for tackles and running, the unique result will be to literally knock down the opponent by causing a whistle from the referee, which among other things in PES 2012 has undergone visible improvements. Last but not least, the artificial intelligence of one's teammates is perhaps the most visible positive feature in this year's edition and a big step forward for the series. The way in which the other players react to their movements is really credible, you can see it when in an advanced position they attack the spaces in a convinced way and suggest the through ball (which works better or not depending on the skill of the controlled player), when cover spaces or double up on defense, when in general they preside over the field in a way that seems more ~alive~ than in the past. In the face of many improvements, however, there are a couple of rather strong deficiencies, which undermine the overall judgment. The above automatism intervenes a little too markedly during crosses, where the computer always doses the power and there is much less room for maneuver; the behavior of the goalkeepers also has big problems as the extreme defenders often cover the position badly or reject shots that are even easy to save, perhaps leaving the side to hit the net. For completeness of information, we point out that Konami is aware of the problem and is working to quickly produce a patch to solve it. The fact is that, unfortunately, the game arrives in stores with this ~bug~, to which must be added the lack of updated roses; competition and marketing reasons are fine, but there's nothing wrong with releasing a title a few weeks later but complete in all its parts. The PC version Unlike its first years of life, the PC version of Pro Evolution Soccer has for some time now become a faithful transposition of the console versions, therefore no longer superior to their computer counterpart. Of course, PES 2012 is no exception, for which Konami has done a good job of optimizing this platform without, however, making any particular additional efforts compared to previous editions, given that the possibility of choosing for graphic detail is always relegated to resolution only ( up to 1920x1080) plus three macro-options: low, medium and high. The system requirements", "date": "2011-09-29", "grade": "8.8"}