{"name": "Cera una volta Pong", "ref": "https://multiplayer.it/recensioni/93716-haraka-cera-una-volta-pong.html", "text": "Tested version: iPhoneCollection, remake, reboot: for a long time now videogame enthusiasts have learned to live with these words, associating them however with fluctuating sensations, a mix between resignation due to the lack of new ideas and satisfaction for the recovery of great masterpieces of the past generation. In fact, just think of the splendid collections of God of War or Ico and Shadow of The Colossus, the remake of the first great Halo CE and the upcoming reboot of Devil May Cry to understand the quality that distinguishes these productions; sometimes, however, it is enough just to be inspired by a great classic, perhaps distorting its essence and introducing welcome novelties, to find in your hands an original product full of interesting ideas. In fact, playing Haraka only ~old school~ gamers will notice the heavy hand of the old Pong: all the others will rightly enjoy the pure fun of a modern title with a slightly retro flavor. Sticks... or carrots? Pong was characterized by one of the simplest game concepts ever created: according to the (very) basic rules of tennis, the only objective was in fact to get the ball to the opposite side of the court, avoiding the opponent's attempt to recover and thus scoring the point. Haraka makes this simple point his own, with the welcome addition of some clever innovations. Abandoned the two anonymous self-propelled segments, on which the ball was supposed to bounce, make their appearance here as many ninja fighters equipped with a long stick, always used to push the ball to the other side of the field. Each one presiding over his own half of the game plan, the player's task is to direct them towards the sphere, only moving them horizontally; in addition to the ~humanoid~ nature of the protagonists, another difference with the classic Pong is given by the use of the side walls of the field, valid for assigning the point. As a consequence, in relaunching the ball towards the opposite side it will be necessary to consider the rebound angles, trying to repel it also from the side walls (which in fact are now reachable by the wrestlers). In addition to the repeatedly mentioned Pong however, Haraka also winks at another famous title featuring a bouncing sphere, namely Arkanoid; although the absence of blocks to destroy is a certainly not negligible difference, the care for the angles of the rebounds and the need for particular coordination to try to direct the ball clearly recall the well-known arcade video game. The control system fits perfectly with the simplicity and intuitiveness of the game, based only on the pressure of the two virtual arrows placed in the lower corners of the screen. Advancing in the levels (indicated by colors and present in number of 9) you will face increasingly stronger opponents, sometimes managing to witness very fast exchanges; to advance to the next stage you must defeat the previous ninja with scores more and more round each time, both as partial and as total rounds. To make everything even more uncertain we then think about the usual random bonuses/maluses, made up in this case by whirling luminous globes with peculiar properties; present on both sides of the playing field, if crossed by the ball they can from time to time make it assume the most varied behaviors, such as sudden accelerations, braking, deviations and anomalous rebounds. The title allows local multiplayer by having the small iPhone screen held by a second player, placed in front of the first; this solution is obviously inconvenient (there are 4 inches on the same screen!) but with a minimum of adaptation it is always possible to make some quick exchanges. As usual, the technical level remains totally secondary in this type of game: the graphics in fact fully perform their duty, giving an impeccable framerate, beautiful animations of the two ninjas and evocative backgrounds (albeit two-dimensional) but nothing more; anonymous and repetitive instead the background music, which, however, will not be paid attention to after a few games. Finally, the developers have promised continued title support, starting with the expected integration with Game Center. Tested version: 1.1 Price: 0.79 App Store links", "date": "2011-09-28", "grade": "8.0"}