{"name": "Space Warlord Organ Trading Simulator", "ref": "https://multiplayer.it/recensioni/space-warlord-organ-trading-simulator-recensione.html", "text": "The life of a space organ trafficker is not as simple and invigorating as everyone would think. It's true that we are untouchable, given that sooner or later everyone needs us, it's true that we make tons of money, but it's not all rosy. There is, for example, a fierce competition to fight, committed to buying the best pieces on the black market. There is the stressful equity landscape with its fluctuations and there are also those who dare to threaten us. And then there are the worst of all, those who ask for free organs! Free, would you ever believe it? Who did they take us for? Definitely not for someone busy reviewing Space Warlord Organ Trading Simulator! Organ trade In Space Warlord Organ Trading Simulator you will trade organs, even aliens As you may have understood in this somewhat phony introduction, Space Warlord Organ Trading Simulator is a managerial game that puts you in the role of a space organ dealer. It is a very lucrative job and which, as mentioned in the brief introduction by a mysterious off-screen narrator, will make you untouchable. This is because everyone in the universe needs brand new organs, especially if there is some kind of interstellar war going on. However, this privileged condition is not absolute. There are others like you and to make your way in the business you will have to work hard and not a little. The competition, in fact, will not sit idly by and on the contrary will do everything to put a spoke in your wheels, blowing the best pieces from under your nose, raising prices and threatening you in an increasingly less elegant and subtle way. You can decide to ignore their intimidation and beat them on their own terms or try to be accommodating by meeting their terms. The last possibility is to bribe them, in order to get them out of your way for a few market sessions. Surprisingly it seems that space organ traffickers have no conscience to answer to and have no problem taking bribes... However, your task will be to be contacted by desperate poor people looking for a new organ, with very specific characteristics. Your task will be to find a compatible organ possibly within the budget offered, so as to earn some credit in the transaction. Credit that can be used to expand your business, to bribe competitors or to invest in the organ stock market. The more deals you do, the more opportunities open up before you: ranging from a greater variety of organs to trade (some of which can puncture your cargo or eat other organs) to increasingly challenging assignments. The life of an organ dealer is never boring. Perfectly tough In Space Warlord Organ Trading Simulator there is also an organ stock market To manage your traffic, the developer Strange Scaffold has come up with a perfectly hostile and unattractive interface. At first glance Space Warlord Organ Trading Simulator seems to be a DOS program: the CGA colors, the organization of the tables and the simple images with which the various organs are represented seem to come from a never too distant past in which the ease of use was the least of the developers' worries. In this way a relatively simple task such as having to buy an organ compatible with the requests made by the buyers becomes a complex one, often in an artificial way. Each market session, in fact, lasts only 2 minutes during which the new organs are put up for sale in a random way and enrich a long list that will be continuously scanned in search of the best pieces. This is because not only will we have to find the right organ, often non-human, but there will also be precise requests based on its size, quality and rarity. To verify all these elements before an unfortunate purchase, you can memorize their code or you will need to consult the detailed card. All before Chad Shakespeare and colleagues blow the prized piece out from under your nose. In Space Warlord Organ Trading Simulator you will learn to hate Chad Shakespeare Added to this is the need to store the organs in particular places, to prevent them from quickly deteriorating or eating the rest of the load, cumbersome management of tasks and so on. The result is a deliberately complex game, but nevertheless interesting and with good replayability, also thanks to the presence of different endings. The limited time available to do business and the need to browse through the different sections of the interface makes each session breve and intense, as well as demanding. A more intuitive system would not have helped create this tension, making everything decidedly less intense and interesting. The adaptation to the gamepad is also good: in this framework of artificial complexity, there are no great differences between the mouse and keyboard and the controller. The game is translated into Italian.", "date": "2022-01-25", "grade": "7.0"}