{"name": "Questo traffico  una giungla!", "ref": "https://multiplayer.it/recensioni/93633-burnout-crash-questo-traffico-e-una-giungla.html", "text": "The game is available for download via Xbox Live and PlayStation Network Tested version: Xbox 360 Criterion throws itself headlong into digital delivery with one of its most famous brands ever, Burnout, and does so by taking its cue from a third chapter mode, that Takedown that critics and audiences like so much. One of the reasons that made Burnout 3: Takedown a great success was also the richness and completeness of the package offered. Among the various secondary options there was precisely a fun ~Crash~ mode, a name used precisely to baptize this spin-off car on the Live Arcade. This Burnout: Crash is nothing but a revised, corrected and resized version to the space granted by the digital delivery of the older brother who appeared a few years ago on the main series. The gameplay is as simple as it is potentially addictive. It's about entering a busy road at full speed and trying to do as much damage as possible by bumping into other cars, buses, trucks and destroying everything in front of you, including the surrounding environment. In Burnout: Crash there are 18 junctions to tackle, each playable in three different modes: Road Trip, Rush Hour and Pile Up. In the first case, once you get close to the intersection, by pressing a special button you blow yourself up to cause as much destruction as possible. Every car that manages to save itself from our infernal intersection causes us to lose a life, and after having lost 5 we arrive at the fateful game over. The question arises: what weapons do we have to prevent them from escaping and destroying them all? Soon said! Our vehicle can explode and blow itself up all it wants but above all, once exploded in the air, we have the possibility of deflecting its fall by making it land in the point we prefer, ready for another explosion. ~Aftertouch~: a sort of ~effect~ like the one that can be given to free-kicks in almost all football games. The gameplay basically consists of two distinct parts: a purely instinctive, action, in which we throw ourselves into the fray and blow ourselves up, and a more strategic one in which we have to come up with something very similar to a plan to do as much damage as possible. And all this while trying to hit and cross buses (longer, therefore more damage!), drive a more ~armored~ car, create traffic jams to then take advantage of the amount of cars on the screen. It's not just about blowing yourself up and doing damage, in Burnout: Crash you need to think about many other factors that ultimately make it a kind of puzzle game. The things to do (at the same time) are in order of importance: don't let the cars run away from the intersection, cause damage to other cars, blow up or damage the surrounding environment (and do it without forgetting the first point), create combos, activate special events such as police checkpoints. Xbox 360 goals This too Burnout: Crash puts the canonical 200 points on the plate to unlock, but with a more substantial number of objects: as many as twenty. Most of them will be obtained simply by making long chains of combos or by doing great damage, while the others are linked to particular game actions, much more complex and reasoned to obtain. It's all about reflexes There is a certain thrill to playing Burnout: Crash, even with such a bizarre and unusual ending. In Rush Hour mode we are given just 90 seconds to create as much destruction as possible, with every means and every technique at our disposal, but above all without penalty for any cars that flee our canvas. Finally, Pile Up is the most articulated and ingenious method: in essence, you have to ~stack~ as many cars as possible in the intersection, but without blowing them up. Once the area is filled, the ~Inferno~ moment is activated in which the explosions begin in sequence: it all depends only on how we arrange the machines around us. If done right, they all blow up one by one, while if something goes wrong, the game ends in a stalemate. The gameplay is helped by a bird's eye view which is very practical for the purposes of the proposed gameplay, but which demonstrates all the essentiality of the graphics sector, truly subdued for a modern production linked to next-gen consoles. And to think that in any case Criterion has always used us well, creating ~Burnout~ always absolutely spectacular, fluid and full of details. Burnout: Crash has an essential graphic style, without particular effects with even explosions, important given the theme of the game, not to meet the player's expectations. The game makes good use of the online autolog, or that particular function that allows usto see our progress in real time compared to that of a friend on our list who has already played. It is thus more rewarding and exciting to compete - even - against the online leaderboards. It is also possible to create customized games with friends and carry out versus challenges in which we are called to establish a record, hoping that the others are unable to break it. There is also a multiplayer party mode, but unfortunately for non-Kinect owners, this only works with the Xbox 360 camera: moving forward/backward or left/right controls (up to 4 players) cars at intersections and drives moving your hands like having a real steering wheel. There is some lag and the controls don't feel very precise in three or four people. In any case, it won't take long to see all that Burnout: Crash has to offer the player, perhaps a greater number of avenues and options would have benefited the overall longevity of the game. The graphic sector, on the other hand, is therefore decidedly subdued compared to all other modern productions, but the only technical aspect to be saved is precisely the audio one, with numerous effects, explosions, various and excellently digitized noises.", "date": "2011-09-27", "grade": "6.4"}