{"name": "Partita d'addio", "ref": "https://multiplayer.it/recensioni/93703-fifa-12-partita-daddio.html", "text": "Whether or not you appreciate the work of EA Sports on Wii, it is undeniable that its commitment to the FIFA series on the Nintendo flagship has always been oriented towards finding different solutions between one edition and another. Of course, one could argue that the reason behind such behavior is due to the inability to find a really convincing formula to expand in subsequent updates, but at the same time the Wii versions of FIFA have always made up for the inevitable technical gaps with interesting ideas , although you don't always succeed in examining the facts. It therefore has a certain effect to note how this FIFA 12 still contains such a quantity of new features extracted from the cylinder for the occasion. Let's go see what it is. The last one is good Probably aware of the fact that the single player mode of the previous episodes on Wii left enough to be desired, the EA developers have focused strongly on this aspect with FIFA 12, exponentially increasing the user's sense of progression thanks to gimmicks that are actually well thought out and which above all are linked to each other in a coherent way. The crux of the matter is represented by the so-called FIFA City, which forms the background to the main game menu and which is enriched in terms of population and architectural structures as certain trophies are obtained in the context of the various modes. Scoring a hat-trick in an exhibition match will see the rise of a television studio, winning the first championship as a manager will lead to the construction of a sports center, taking your virtual player's career to the highest level of fame will cause a statue to appear in the middle of the city and so on. Although the evolution of FIFA City runs along pre-established tracks and the player has no real ability to interact with it, seeing it grow is still a significant stimulus to dissect the entire playful offer of the product, which undoubtedly proves to be the richest and complete since the series landed on Wii. With the exception of the basic Quick Match and Tournament, all the other sections of FIFA 12 denote a truly unexpected depth and care. The Coach mode follows - with all the simplifications of the case - the one that has been proudly displayed for some time now in the PS3 and 360 versions, complete with technical and transfer market components which, although in rose water, are still pleasant. Then there is a real career, called From the Streets to the Stadiums, which commits the user to only control his digital alter ego in an attempt to become a football star, starting from suburban soccer fields up to the championships of the world. In this context, the evolution process of one's player is very interesting, the characteristics of which can be improved with the points obtained by winning the bets made before each single match: one can gamble, for example, on the goals or assists that will be made , on the final result and so on, with the risk, however, of seeing one's score decrease if these requirements are not met. Still on the front of new modes, the Intercity Cup should also be mentioned, in which you have to found your own city's team and improve it piece by piece by winning challenges against teams from other metropolises. The online component is completely absent, evidently judged superfluous by EA. Methodist Centromedian In the face of the numerous and very pleasant novelties in terms of the playful offer, unfortunately the same improvements on the playing field do not correspond, on the contrary: speaking of gameplay in the strict sense, FIFA 12 differs very little from the previous iteration of the franchise, retaining its merits but also some macroscopic defects that would have really needed a good clean up. Therefore, if in this Wii incarnation the game is appreciable for its more arcade approach, on the other hand it is difficult to overlook a poor artificial intelligence, a control system that is really valid only through the Classic Controller and a futsal section that still suffers from the major limitations of the prequel. Although it now plays an important role in the single player component, in fact, futsal hasn't been touched up in the slightest, even if it would have had a great need for it: the matches are therefore still resolved in convulsive actions to be carried out in too narrow spaces, where the technical gestures they are objectively unworkable and most of the time whoever finds themselves with the right power-up wins. If against a human opponent the problem arises in a relative way, in the challenges against the CPU bringing home the result becomes more a matter of luck than skill, with all that follows then terms of playful satisfaction. Things go a little better in the more classic 11 against 11, even if the experience cannot be compared to that offered by the PS3 and 360 versions in the slightest: impact engine and tactical defense are words that do not fit into the dictionary of FIFA 12 for Wii , which limits itself to re-proposing the palpable arcade contaminations already introduced in the last edition. It is not an annoying or unpleasant experience, of course, but completely devoid of the simulative rigor that has made the fortune of the series in recent years: precision dribbling and fine plays therefore leave room for powerful shots from distance, elementary passes and little else, for a gameplay that is certainly more immediate but also much less deep and satisfying. The final grumbles concern the technical component of the product: even if it has never been the flagship of the franchise on Wii, the graphics of FIFA 12 do not present any upgrade whatsoever, inevitably resulting even more dated and poorly defined, with the same caricature cut of the footballers and their almost zero resemblance to their real counterparts. The sound effects and commentary are also unchanged, with the Caressa-Bergomi duo producing a few repetitive phrases that certainly don't help the already feeble spectacularity of the matches.", "date": "2011-09-27", "grade": "7.0"}