{"name": "Xanadu Next", "ref": "https://multiplayer.it/recensioni/xanadu-next.html", "text": "The next... Xanadu Next opens without offering big narrative preludes: the user simply plays the role of an unnamed warrior, who somehow arrived in a town who knows why besieged by monsters of all kinds. The care of the storyline is therefore certainly not the strong point of the Falcom production, with the plot that will later unfold on the basis of the kidnapping of the mayor's daughter by an evil group of demons. In any case, the first choice that the player must make concerns the association with one of the two available guardians, on which the subsequent evolution of the character towards a more physical or magical approach to action depends. However, the number of protectors you can rely on is destined to rise in the course of the adventure, thanks to the cards that you can collect along your way. Xanadu Next therefore offers something relatively innovative from this point of view, allowing not only a discreet personalization of the protagonist, but also paving the way for the exchange of cards between different users via Bluetooth. However, this is the only real point in favor of the Falcom title, which in all other respects appears more or less incomplete. Let's start from the graphic sector of the product, divided between two different formulas: the first, applied within the city sections, results in a very poorly defined 2D backdrop on which there are characters with non-exciting polygonal detail. The second instead accompanies the more substantial section of the game, the action-exploration one, and offers rather bare scenarios to the view framed by a fixed isometric camera, which sometimes prevents the correct display of monsters or other elements. In short, considering the quality standards of N-Gage, the cosmetics of Xanadu Next can generally be considered sufficient, but nothing more. Not enough From the gameplay point of view, however, the Falcom title presents more than a few uncertainties, which prevents it from reaching a fully positive evaluation. First of all, the movement of the character is far too slow and cumbersome, infusing a soporific rhythm to the wanderings through the various rooms of the dungeons. The control system, reduced to the bone, is then limited to offering a key for the physical attack, one for the magical one and a third for opening the status and inventory screen. A little bit, considering that actions such as moving the camera, jumping or simple shortcuts for potions would have been welcome. The scarce moves available to the player are then found not to be implemented perfectly: the physical attack is not very fluid, while the magical one seriously lacks precision. It goes without saying that in the light of all this, the fights can only result in skirmishes that are anything but dynamic and exciting, moreover characterized by a damage assignment system that really leaves you perplexed. Again, the anonymity of the various settings does not help to make the exploratory phase engaging, while the possibilities for purchasing new items of equipment are not as vast as one would expect. Xanadu Next is also a rather short title, which however suffers from rather evident problems in terms of the save system which can force you to repeat entire sections of the game. The overview is closed by a sound sector of medium quality, which stands out above all for the dynamic soundtrack. Comment Xanadu Next is a hack'n'slash certainly superior to the incomplete Requiem of Hell, which however struggles to reach a satisfactory general quality level. Thanks to a non-exceptional technical sector and a rather elementary and decidedly not very engaging gameplay, the Falcom product falls perfectly into the category of titles which, with a modest dose of extra care, could have easily reached higher evaluations. As things stand now, however, Xanadu Next is simply a mediocre product. Pros: Interesting card system One of the few exponents of the genre on N-Gage Cons: Limited and cumbersome control system Uninvolving gameplay Some technical problems Developed by the Japanese software house Falcom, Xanadu Next arrives on N-Gage with the task of reviving the rpg-hack'n'slash genre from the poor results obtained by the disappointing Requiem of Hell. All in all, a not too difficult task, considering the absolute mediocrity of the aforementioned product and the substantial lack of similar titles. And instead...", "date": "2005-06-23", "grade": null}