{"name": "Professione Shinigami", "ref": "https://multiplayer.it/recensioni/93339-bleach-soul-resurrection-professione-shinigami.html", "text": "It's strange to talk about the European version of Bleach: Soul Resurreccin when the animated series hasn't even been broadcast on our television networks yet. This is certainly one of the many defects of the new tie-in developed by SCE: the story, already complicated on its own, is exposed in a confused and incomplete way and those who are not familiar with the cartoon or comic will have an incredible effort to understand anything of Bankai, Hogyoku, Espada and so on. Luckily we are a bit nerd: for the uninitiated, Bleach is a manga by Tite Kubo which tells the story of Ichigo Kurosaki, a Japanese teenager who despite himself will temporarily become a Shinigami, that is a god of death. The manga, despite the very original premises and a very rich cast of really interesting characters, over the years has increasingly become a Dragon Ball clone in which the characters, from saga to saga, acquire new powers necessary to defeat the bad guys on duty ever more powerful and diabolical. However, Bleach is probably one of the most interesting shonen-manga in the comic scene with a mass of fans to milk with a little cel-shading and a lot of fan service... The fashion of the Musou is rampant The gameplay of Bleach: Soul Resurreccin is deeply inspired by games such as Dynasty Warriors: the player basically has to fight against dozens of enemies simultaneously to reach the end of the level, usually represented by another battle with the boss of the moment. This is how every single mode of the game is structured, divided into missions or chapters in which we will take control of Ichigo or other characters. The control system is rather intuitive, with a button assigned to normal shots to execute a couple of simple combos, a button dedicated to jump, one to ranged shots and one to special shots. The lats mostly allow you to parry and dodge, increase movement speed, or activate some sort of temporary power-up. In a game of this type, a lock-on system cannot be missing which unfortunately in Bleach: Soul Resurreccin turns out to be rather fallacious and uncomfortable, so much so that when you face multiple enemies it is much easier to swing a few randomly , our opponents will succumb in just a few hits: there is practically no challenge, in fact, and even at the highest difficulty level your greatest concern will be to avoid some attacks, using special attacks at the first opportunity; these are real smart-bombs capable of making a clean sweep of the surrounding enemies: each character has two of them, one in the air and the other on the ground, and a short reload time is required to use them. Finally, by hitting the enemies it is possible to load an indicator that will allow us a temporary transformation: we will inflict more damage, we will receive less and we will be able to release a devastating and choreographic special attack capable of obliterating even a good half of the energy of the bosses. The truth is that the combat system in Bleach: Soul Resurreccin is even fun, but incredibly bland: it's not just a problem of general difficulty, really very low, but also of variety, as each character is played basically the same way. The differences in terms of attacks are reduced to a minimum and each character is a clone of the other: by defeating enemies you earn points to spend on a special grid in order to acquire bonuses and improve the performance of the various characters, but there is no skill or specialty that differentiates them and, in the end, the level-up system becomes nothing more than an infinite grinding based on square, square and sometimes circle... Where did the zanpakuto go... The Story mode of Bleach: Soul Resurreccin is probably the weakest of the game in every respect: divided into fourteen chapters, it begins in media res, with Ichigo and his companions already in Hueco Mundo to save Orihime from the clutches of the evil Aizen. Confused? Well, normal: if you don't know the series, the game doesn't care and offers you only a brief and cryptic explanation of the story at the beginning of each mission, without explaining anything of the complex Japanese (and Spanish) terminology. Fans of the series, on the other hand, will have immediately understood that the game covers the cycle of battles set first in Hueco Mundo and then in Karakura, but don't expect to find the many characters involved in the clashes of the manga: Bleach: Soul Resurreccin offers only one handful, forgetting for example the Vizard or various Espada, bound to the role of extras at the bottom of the screen during the numerous dialogues that should delve into the story or the relationship between the characters but which, ifand possible, they are even more obscure and annoying. The various chapters appear disconnected from each other and the very short cutscenes are limited to an exchange of jokes between the two fighters: a real disappointment, considering the amount of flashbacks and dialogues present in the original story. However, the Story mode allows you to unlock the challenges proposed in the Mission mode, certainly the most interesting but no less repetitive: in this case we will be able to choose any of the unlocked characters (just twenty) and face a series of stages, for example, timed limited or in which it is impossible to jump. That's all? The purpose of all this? Earn more points to upgrade your characters and compare your scores with players from around the world via a leaderboard. Bleach: Soul Resurreccin is all here: there is no cooperative mode but no competitive mode either, it is not possible to play against a friend locally or online and there are no particular extras to unlock apart from a questionable series of illustrations. The impression is that of a game castrated on all fronts. And it's a shame because in the past we have already seen excellent games dedicated to Ichigo and his companions, such as the two fighting games for Nintendo DS developed by Treasure. Bleach: Soul Resurreccin could have been an excellent fighting game along the lines of Naruto Ultimate Ninja Storm, for example, with which it shares an excellent use of cel-shading: from the point of view of character modeling and animation, in fact, the result is flawless . The fights look like real interactive cartoons, the definition is excellent and the choice of colors and textures really spot on, the cutscenes showing the execution of the special shots are particularly effective and satisfying. Despite this, a bitter taste remains even on the front of the settings: even in the comic this saga in fact does not provide who knows what variety from this point of view, but the game offers just three or four locations, two of which are practically bichromatic. And then, the sound accompaniment is not as faithful, based on a handful of appropriate but certainly not memorable pseudo-rock tracks, unfortunately completely different from the excellent ones of the animated series. Fortunately, we are given the possibility at least to choose between the English dub and the original Japanese one, which is undoubtedly more effective and exciting.", "date": "2011-09-21", "grade": "5.0"}