{"name": "Nel cuore della giungla", "ref": "https://multiplayer.it/recensioni/92823-men-of-war-vietnam-nel-cuore-della-giungla.html", "text": "In Vietnam comrades are life, socks are life and bullets are life. Life for someone and death for someone else of course. In Vietnam, war is hell for everyone. For some the fire comes from above, for the invaders from deep in the jungle. But the substance does not change, the bloodiest, longest and most vain war in history is, respectfully speaking, an excellent videogame setting. A setting full of pathos which over the years has been enriched by a greater understanding of the Vietnamese situation and by the poignant and paradoxically anti-militarist music that has been touring the world from the loudspeaker of the helicopters. Adventurous strategy The typical sound of the so-called ~Vietnam music~, in a rough but still engaging version, immediately welcomes us to the menu of Men of War: Vietnam, a stand-alone expansion of the title by Best Way and Digitalmindsoft developed by 1C. This incarnation of the series centers on the story of two 4-man teams and favors structured gameplay along a series of events that drive the story. Not only fronts to conquer therefore but more engaging missions that focus on the narrative aspect. Of course, managing your units is always important to achieve your goals but the action is often marked by scripts and events that repeat themselves almost like obstacles in a puzzle game. In any case, as we said, the greater linearity of the missions has a purpose and that is to guide us along a story with heroic objectives, profusion of cut-scenes and a more linear structure. And here we find ourselves assaulting an entire field with 4 characters, almost in Commandos style, and this is just one of the desperate situations we will be dragged into and which will see us running from the countryside of Saigon to the Mekong delta. The linear structure is well suited to autosaves which, thankfully, are recorded in different slots. In fact, it can happen that the computer saves the game in the middle of a desperate situation forcing us to face frustrating situations. The single player is divided into two campaigns, one from the point of view of the pro-Soviet Vietnamese and another that takes us to the other side of the fence, under the stars and stripes flag. The Soviet experience is emotional, if always heroic, but the personalities of the four team members are not celebrated. On the contrary, on the American side, the classic filmic rhetoric takes hold, giving life to the typical Yankee team made up of narratively full-bodied personalities. Classic gameplay, new experience As we said, despite the different setting, the basis of the gameplay remains the same as in the series. By selecting the units and moving the cursor, it is possible to view all the available coverage and then place our men in the point we deem best. Obviously depending on the objective and the situation it is good to use the soldiers according to their peculiarities which include precision shooting, heavy machine guns, engineering. Among other things, due to the scripted nature of the campaign, and since in many phases of the missions we will have only our 4 men to deal with the situation, careful planning becomes more important than lightning-fast tactics. In fact, already from the first mission, losing even one man can prove to be a problem capable of ending the game. To balance everything there is obviously the predictability of patrols and objectives that allow us to think step by step. Men of War: Vietnam is therefore slower than Assault Squad, but the jungle is full of realistic pitfalls and traps and moreover the relaxed timing allows you to better explore the numerous micromanagement options. And the options are so numerous that there are even shortcuts typical of hack & slash such as the V key which goes beyond, and by several leagues, the simulation sphere. In fact, by pressing it it is possible to highlight the bodies of friends and enemies in order to quickly ~clean~ them. The pitfalls of the jungle The ten long missions of the title, 5 from the point of view of the Americans and 5 from that of the Vietnamese, are decidedly long and include all kinds of situations. They range from the silent rescue of some units to large-scale battles full of vehicles including, for the first time, even helicopters, the real star of the US offensive in Vietnam. In missions in which our team cannot count on support and reinforcements, the possibility of directly maneuvering a character is undoubtedly useful, above all to control the lines of fire and the exact position of the enemy without alerting him. This feature, overshadowed by the large-scale attacks of Assault Squad, takes on greater importancein several missions of Men of War: Vietnam and is the main peculiarity of the series. Unfortunately, the control of the single unit, however direct, is limited while it could be articulated in a more complex way. Unfortunately jungle and patfinding problems are not friends of multiplayer, which in any case offers nothing more than that of Red Tide, while the cooperative can give different satisfactions especially with the direct control carried out simultaneously in four, which allows you to carry out coordinated actions . On the other hand, as we said, Men of War: Vietnam is mainly developed around the single player and a series of ~pre-established~ situations. So there is room for planning which in 4 becomes even more satisfying. Unfortunately, from a technical point of view, the title has several gaps with a swing of defined elements and others in low resolution. As far as the graphic appeal is concerned, the overall yield is decidedly lower than in Assault Squad and the cutscenes, which use the game engine, are not much to see. Furthermore, the artificial intelligence of our units often leads them to take the wrong road or get stuck, often lending their flank to the fire of an enemy patrol. To make matters worse, the jungle intervenes which almost always covers our view. In terms of ~realism~ it is undoubtedly a touch more, but it becomes irritating when it prevents us from noticing that our team is launching itself at the enemy by mistake. So the recommended view is the close-up one, however, keeping in mind that in this case the low-resolution elements become an eyesore. We must certainly consider that it is a product from around 30 euros but there are indie titles that can boast a decidedly superior care for the finishes.", "date": "2011-09-14", "grade": "7.9"}