{"name": "Fire Emblem: The Sacred Stones", "ref": "https://multiplayer.it/recensioni/fire-emblem-the-sacred-stones.html", "text": "The Sacred Stones Legend has it that in a now remote era five warriors challenged and defeated a fearsome and very powerful demon, sealing it forever thanks to the power of five sacred stones, which each of them kept in their own kingdom, guaranteeing peace and prosperity for their peoples for centuries . Now, something has changed: the empire of Grado, always peaceful and benevolent, has invaded the kingdom of Renais, occupying its throne. The twin heirs of the king of Renais are divided: the brave young Ephraim fights at the front, unaware that a traitor is plotting alongside him, while the beautiful and fierce Eirika manages to save herself from the assault on the royal castle thanks to her father's sacrifice and the help of Guard Captain Seth. Now the goal of Eirika and Ephraim is therefore to meet again and shed light on the absurd war that broke out between kingdoms that have always been at peace with each other, and above all on the increasingly disturbing and widespread appearance of horrible demonic creatures. And if it is true that the Emperor of Grado ordered the destruction of the Sacred Stones relying on mysterious and shady figures, and one of these Stones is hidden in the bracelet that the King of Renais gave to Eirika shortly before his escape, it is easy to guess like the troubles are just beginning. Between palace intrigues, traitors, rebels, endless deserts, ghost ships, dragonmen, monstrous demons and much more, Ephraim and Eirika will build a small and valiant army, but will they be able to save their world from chaos? Triangle Battles Also in The Sacred Stones the Weapon Triangle System returns, which is the simple basic rule on which the Fire Emblem combat system is based. During the turn of his troops, the player moves a unit and, if he wishes, attacks another, as long as this is within his range of action obviously: at that point the Triangle System comes into play, which in practice is a sort of ~scissors, rock and paper~. Swords win over axes, axes over spears, spears over swords. This is all you need to know in order to master the main strategies of Fire Emblem. Magic is also based on a similar system, whereby elemental spells are more powerful than divine ones, divine ones defeat black magic, and black magic is more effective against natural elements. Obviously there are other details that complicate things, otherwise we couldn't even talk about strategic: for example, the archers and their arrows, absolutely devastating against flying units (dragons and pegasus) but cannon fodder in close combat, without counting the various magical weapons capable of inflicting increased damage against certain units. However, this time Intelligent System really put a lot of meat on the fire: while in the previous episode the GBA owners found themselves facing only ~human~ units for a long series of missions, in The Sacred Stones to threaten our heroes we also find supernatural and monstrous creatures, against which it will be necessary to adopt new strategies, given that the Triangle System certainly does not influence the claws of giant spiders or the fangs of werewolves. It should be noted that these monsters, in addition to sometimes being the enemy to be killed in certain missions, will also appear on the map, as occasional and optional clashes during which it will be possible to train your units and, with a little luck, earn some money in more. Unlike the last episodes of the series, in fact, The Sacred Stones has included a map on which to move your troops, to stock up on equipment or other items in a village, perhaps, or to explore the optional ~dungeons~ that will appear in some stages of the adventure. This freedom of movement and action, however limited, gives the game a greater depth, which in the other Fire Emblems was missing: in The Sacred Stones, if a mission is too difficult, you can upgrade the characters you want at any time, always within the limits of tactics, of course, given that a high price is paid for the death of a unit, i.e. its definitive disappearance. Many characters, as per the script, to be obtained by progressing in the splendid story, or to be recruited by solving simple quests (generally it is enough to talk to one of them with the protagonist or another similar unit, but sometimes you have to satisfy certain secret requirements), all splendidly characterized, and which once defeated will be lost forever: the automatic and continuous saving system still creates some problems, forcing the player to repeat a mission all over again if he does not want to bring the death of one or more companions to his conscience, but is the price to pay to be able to define dethe real strategists. As before, more than before Once again Intelligent System demonstrates its ability to use the GameBoy Advance's technical capabilities without overdoing it, focusing on what matters most, the gameplay, and at the same time giving us a side dish of the highest quality. As per tradition, the lion's share is taken by the exceptional animations that show the clash between the various units, fluid and spectacular, embellished with transparent light effects or colored explosions in the case of magic and the like. The sprites, of modest size, are detailed and colorful, even if units of the same class often tend to look too similar to each other. The artworks that show the characters or the locations that form the background to the action are splendid, while the battle maps are always a bit bland, even if in The Sacred Stones there is clearly a greater attention to their composition, which makes them more varied and more pleasing to the eye for the duration of the ever longer missions. However, the soundtrack remains the most satisfying technical aspect of this cartridge: once again, the songs that the GameBoy Advance's albeit modest speaker gives us are of extremely high quality, always spot on for the situation and of great compositional variety, between fanfare, rhythmic battle tunes or tracks with a more tragic flavor that accompany some of the most poignant sequences of the narrative. In short, the triumphant song that acts as the classic sound-theme of the series explodes in the main menu, once again anticipating an audiovisual experience of great impact. Fire Emblem is a must-buy for any self-respecting RPG and/or strategy fan. It always has been, since the first episode for the NES, and still today it lives up to its great fame: Intelligent System offers us a new adventure in the world of the Fire Emblem that excels in practically all aspects. Beautifully characterized characters, an excellent plot narrated with great skill, a play mechanic as simple as it is deep and satisfying, and an uncommon longevity: not only is The Sacred Stones a decidedly difficult product, even if well balanced, but with its myriad of characters to recruit, of secret missions, with a plot that forks leaving the player the pleasure of discovering its complex implications, perhaps in a second game, the cartridge gives the player dozens of hours of adventure. Recommended to all lovers of the genre and, more simply, to lovers of good video games. Pros: Excellent storytelling Simple and deep gameplay Lasting like few other titles Technically excellent Cons: The autosave system may not appeal to everyone It's nice to know that Fire Emblem has now become a regular fixture for us Westerners too. Until a couple of years ago, the splendid strategic saga conceived by Intelligent System at the time of the NES had remained relegated to the eastern market in all its incarnations for NES and SNES, for very obscure reasons. The first glimmer of light illuminated Western players with Super Smash Bros Melee: in the roster of fighters, in fact, Roy and Marth peeped out, two of the most loved protagonists of the Fire Emblem series, who were fighting for their ideals in a GBA cartridge that won huge acclaim in Japan. Roy's adventure did not arrive in America or Europe, due to the numerous narrative connections to old episodes, but the next one, set twenty years earlier, paved the way for the Fire Eblem saga in English, and so after the splendid episode that we reviewed last year and which is considered one of the best video games available for the GBA, we find ourselves with a new adventure which, while waiting for the new chapter for the Game Cube expected in the coming months, keeps the qualitative level of one of the best serial videogame productions ever.", "date": "2005-06-17", "grade": null}