{"name": "E sparo al mondo da un obl", "ref": "https://multiplayer.it/recensioni/92715-zombie-gunship-e-sparo-al-mondo-da-un-oblo.html", "text": "Version tested: iPadRemember the section aboard the AC-130 in Call of Duty: Modern Warfare? Here, the Limbic developers have well thought of creating a title that revolves completely around the same mechanics, but replacing the human targets with many limping zombies to be blown up to pieces, all while sitting comfortably in your artillery position in the middle of the clouds. So let's see if the idea behind Zombie Gunship is capable of holding up a game properly. Kill, upgrade, kill, upgrade The answer is yes, because Zombie Gunship is a fun title, which for the modest sum of 79 cents offers an exciting gameplay whose undoubted repetitiveness is mitigated by a well-studied grinding mechanism. But let's go in order, starting from a completely accessory aspect such as that of the ~plot~: the quotation marks are a must because in fact there is no real narrative background, and all that the user is given to know concerns the objective to defend a bunker from the hordes of zombies that populate the game map. Which, as in the aforementioned section of Modern Warfare, is framed just as if you were looking at it from a gunner's viewer, or in black and white and with the graphic grains typical of such equipment. The occasional radio communications and above all the slow but constant rotation on the scenario contribute to the sense of illusion, recalling the circular trajectory of the plane. On the gameplay front, Zombie Gunship is a decidedly simple title: just move a finger on the touchscreen to move the camera, tap the top right corner to change weapons and the bottom left corner to fire. The zombies appear as black silhouettes, while the civilians are colored in white: the game ends when a single undead crosses the threshold of the bunker, or if the figure of three randomness is reached among the fugitives. Over time, the hordes of enemies become more and more intense, enriching themselves with individuals who are particularly fast or resistant to blows, and the game over is inevitable: but it is here that Zombie Gunship finds its dimension, managing to be something more than a simple pastime to be exploited for a few minutes and then thrown into oblivion. In fact, each match played yields the user a certain amount of money calculated on the basis of the zombies killed, the civilians saved and so on: the loot can therefore be spent to upgrade the three weapons supplied with the aircraft (in four parameters relating to the rate of fire , damage, reload and projectile speed, in turn broken down into a handful of evolutionary steps) or to improve extra features such as the effectiveness of the radar or the reward for each kill. This grinding mechanic is the real added value of the product, capable of letting the user enter a very pleasant vicious circle made up of games, upgrades and new matches to earn more money or even just to beat the score of friends on Game Center . The enjoyment of the gameplay does all the rest, given that Zombie Gunship is satisfying and well done, with well-differentiated weapons (a 25mm machine gun, a 40mm cannon and a devastating 105mm Howitzer) that behave in a credible way. Too bad for the substantial lack of content: a few more maps or modes would have given further appeal to an already winning product, especially in terms of value for money. The tested version is 1.1.1 Price: 0.79 App Store links", "date": "2011-09-06", "grade": "8.7"}