{"name": "Quantum Driver", "ref": "https://multiplayer.it/recensioni/92613-driver-san-francisco-quantum-driver.html", "text": "Tested version: PlayStation 3Who remembers the old show Quantum Leap, the TV series with more than twenty years of experience in which Scott Bakula, the future Captain Archer of the Enterprise, jumped in time assuming the appearance of random people, helping them solve small and big personal problems? Probably many given the numerous reruns between Rai and La7, but above all what do time travel and science fiction have to do with Driver: San Francisco? The new episode of the Reflections saga cuts ties with the past, even if everything revolves around the protagonists of Driv3r, the undercover cop John Tanner and the super-criminal Jericho, but in the very first minutes of the game it takes the luxury of carrying out raids around San Francisco in John's head, who fell into a coma after a chase gone wrong, effectively freeing the title from any kind of ~realistic~ claim of the series. To do this, the English boys have endowed the protagonist with a power called Shift, which gives him the possibility, once the camera has risen from the ground, to enter directly into the body of every motorist present on the map, starting a series of situations, and therefore of missions, which are the real flagship of Ubisoft production. Fantasy missions Shifting, becoming another person, is simple, you press the X key, while with the right stick, we will take a bird's eye view over the city, thus observing the traffic and deciding which car will suit us. With the progression in the game, and in accordance with the unveiling of the map, which initially is similar to a ~small portion~ of the city, but grows to show the whole Bay Area, we will be able to get up to a real satellite view , complete with extra mini maps, our playground is so vast. In short, the Shift allows us to move quickly as if it were a teleportation, thus avoiding long and boring wanderings, but this is only the zero degree of its use. It is not a simple trick to be activated when needed, Reflections has made it as important as the guide itself, sewing around tons of secondary and various, exciting and original main missions, whether or not they are related to the story. Without going too far into spoilers, this narrative stratagem has made the developers indulge by staging situations bordering on the absurd, of real science fiction, giving moments in which one is left speechless for the fantasy and the bizarreness of the gimmicks, which in any case require an indifferent handle. Want to chase a car while the whole city is on pause? Take a seat! Or do you prefer to drive two cars together? Does that seem too strange to you? Why not get under a truck to try and defuse a bomb? Too risky? Isn't it easier to participate in a race where you have to finish first and second? Or maybe to shake off the police or anyone who tries to hinder us, isn't it better if we get inside the head of a driver who is coming in the opposite direction to do a nice head-on eliminating the root problem? There is obviously no shortage of normal missions, and needless to say they too can be distorted by the casual use of the Shift. There is no shortage of typologies: we can devote ourselves to the destruction of objects or street furniture within a limited time, participate in races with or without checkpoints in which the use of the minimap is necessary (becoming experts in urban navigation is essential when we are asked to avoid main roads) or participate in escort and tailing duties. There are also real clandestine grands prix, which gives us the possibility of using various cars of all kinds, from normal sports cars to dream cars such as the Pagani Zonda, passing through the historic rally cars of Group B or the equally historic beetles raised from dirt. Basically, Reflections has even slipped off road racing into the game! The overview of the various types of missions, almost all free and easily recallable using the Shift with the map open, cannot fail to end with the acrobatic ones, also present here in industrial quantities, and those in which you just run, without turbo and without the possibility of changing cars, which further enhances the good driving model of the game. Tassinari vs. Steering wheel axes The secondary missions, like those of the story, are necessary to accumulate money and determination points, i.e. the two real coins of the game, which allow us to unlock further events and garages scattered around the city and to buy new cars and abilities, such as possibility of increasing the duration of the turbo. More generally, any type of evolution performed on the road, from going against traffic, to skids to jumpskilometers bring points, so just don't drive like Massa at Spa to increase your treasure trove of determination. We have therefore said that the game is not lacking in terms of quantity and quality as regards the missions, even if to be honest towards the end they often tend to repeat themselves, while some are quite difficult and frustrating. We have focused a lot on what to do, as if we were talking about an adventure title, but going to tighten Driver: San Francisco is a racing game whose heart is therefore the driving model. As previously written, it is undoubtedly good, immediate and one hundred percent arcade, all drifts and countersteers, or rather its being not at all ~real~ is its greatest value but also its greatest defect. The dozens of cars, in accordance with their class and typology, all real and licensed, from trucks to dreamcars are easy to master and really slippery in traffic, and so they must be in order to perform all those numbers that the game requires us to do . In the same way they are also terribly light, they tail and cross which is a beauty, and when someone touches us, it is either the opponents or the police patrols, real kamikazes on four wheels, not to mention the city traffic , you lose control in an instant, perhaps nullifying a race you are about to win on the wire, or canceling those few tenths of a second gained to get to the last check point. Initially this problem is not particularly important, the difficulty level is well calibrated, but going forward in the title, when the missions become more complicated and the opponents more bastards, we soon arrive at situations almost like trial and error, in which it is not enough to try to eliminate the opponents with a well-placed head-on, or close a road with a shot to try to recover the disadvantage. Super sports cars are very fast soap bars and exacerbate this problem, in short, frustration is around the corner. But that's not the only problem. When you take control of another car, artificial intelligence manages the one you just left. Unfortunately, our digital alter ego is limited to doing his homework, and sometimes not even that. We don't expect him to win a race for us while we dedicate ourselves to the noble art of ramming, but that he at least does the most basic overtaking and goes flat out, yes! Nothing is lost, there is no shortage of ways to arrive victorious in the end but sometimes seeing such an inept artificial intelligence leaves a bad taste in the mouth, given the good general work done. Ultimately what we liked most about the game is how the developers have been able to rethink the way we run, thanks to the possibilities that the Shift offers us. Getting to the end of a race, stopping a security rack, running into a truck, jumping off a car transporter is not just a matter of handle and reflexes, but also of ~preventive planning~ of actions. There is never a unique way to complete a mission, you can really indulge yourself, this, without a doubt, is the main merit that must be attributed to the developers. Playstation 3 trophies Driver: San Francisco rewards the player with 51 trophies, related not only to the progressive progress in the story, but also as you level up in the multiplayer. Obviously the bulk of the trophies is obtained by performing all the various types of missions, main and secondary, buying garages, cars and performing gambles and stunts, all present in large numbers. Online encounters The multiplayer component therefore cannot fail to benefit from the mechanics set up by Reflections. The game modes are many, and all quite fun, with the only limitation that they unlock when leveling up, so they are not all open from the start. There's a lot of substance here too, both online and in split screen. There is a bit of everything, from racing after a ~hare~, to a real capture the flag, passing through races in which you have to sweep the designated vehicles off the road, or those to chase cops and robbers. There are also ~smooth~ races without powers, to fully enjoy the speed of the graphics engine. All for up to six, eight players. We are therefore not on the side of a multiplayer implemented to lengthen the stock, but of something with a very strong and well-defined added value, capable of further enhancing the Shift system and the vast map of San Francisco. From a technical point of view the game is well done, there is certainly no lack of compromises with its sandbox nature, but on balance the level of detail inserted in a truly vast map is satisfactory, even if not lackingcanno texture not exactly trendy on buildings and elements of the background. The game gives the best in the frame rate, anchored, except for sporadic cases on 60 fps (while it is much more unstable via split screen), in the rendering of the cars, polygonally rich and equipped with an aesthetic damage system and graced by beautiful textures and good reflection effects on car bodies. Honorable mention for the large number of cars and pedestrians in the city. San Francisco is really alive and vibrant and with all the landmarks perfectly recognizable, and finally the high quality of the computer graphics movies must be recognized, which add, if still needed, a further cinematic touch to the title.", "date": "2011-08-31", "grade": "8.5"}