{"name": "La fede nella tecnologia", "ref": "https://multiplayer.it/recensioni/92650-deus-ex-human-revolution-la-fede-nella-tecnologia.html", "text": "Version tested: PC In the gaming world, the first Deus Ex was like a bolt from the blue. It was 2000 and the then Ion Storm packaged a science fiction title for PC destined to make school (and remain unsurpassed in many ways). Apparently it was a simple shooter, but by playing it one realized the wide freedom granted to the player which resulted in the possibility of using different approaches to carry out the missions. The sequel, Deus Ex: Invisible War, was also being developed on consoles at the same time and was a disaster. With hindsight, some merit can be recognized, but those who played it at the time, with the first chapter in mind, can only agree that the shock was such that everyone hated him a little: linear and very small levels due to the low memory of the previous generation consoles, choices reduced to the bone and a basic trivialization of the entire Deus Ex universe, decreed its failure. After only two chapters, the brand seemed dead, crushed by the myth of the progenitor. It was therefore with some surprise that, only many years later, Eidos announced the development of Deus Ex: Human Revolution, a title with a long gestation that programmatically aims to revive the series, starting from exactly what was good and excellent in the first chapter. Will it be true glory? A world in chaos The game begins with a dramatic sequence in which Sarif Industries is attacked by a group of modified terrorists, and the protagonist, Adam Jensen, is nearly killed. Ours will be saved thanks to the grafts developed by the Sarif industries, which will transform him into a kind of cyborg with exceptional powers. From here begins the real adventure, with Adam who must investigate on several fronts to discover the truth about the terrorists, about the groups of Luddites who want to stop the development of the grafts, about the political interests behind the Sarif industries and about the Sarif industries themselves . In short, without telling too many details of the plot, it is not difficult to say that the developers have tried to reproduce the feeling of the story of the first Deus Ex, that is, soon you find yourself crossing very blurred boundaries behind which right and wrong are mixed . Nothing is as it seems and the initial balance will soon be swept away, forcing the player to make choices, sometimes very difficult. Choices that will be reflected in the many dialogues, where it will often be necessary to make decisions that will influence the unfolding of events. The system that handles conversations is similar to that of Mass Effect 2, with up to four selectable responses on a four-way interface. In reality, if you have in mind the type of character you want to develop, it will not be difficult from time to time to understand the answer that is right for you. The social graft deserves a separate discussion, which makes some dialogues a real subgame, with Adam who interprets the character of the interlocutor and must try to give the most appropriate answer to obtain the desired result. For example, talking to a corrupt and arrogant policeman, it is possible to understand his bunny nature and put him in line with a tone joke, or, in another case, it is possible to extort an access code to a safe, which would otherwise be violated with hacker skills (if they have developed). Adventure dimension The kaleidoscope of values expressed by the scenario and the dialogues is framed by an open game structure, which allows personal approaches to the action. Adam roams the streets of a degraded and crime-ridden Detroit of 2027, with doors protected by electronic security systems, with cops everywhere and with criminals, junkies and prostitutes roaming the streets freely. The possible interactions are different and there are many hidden corners, reachable by developing specific powers, which hide bonuses or, perhaps, special objects such as weapons or other. Usually the rule is that the more difficult they are to find, the richer the loot is. Speaking of the grafts, or the powers that Adam can develop by assigning the praxis, the range of choices of Deus Ex: Human Revolution expands further. Do you want to create a war machine capable of wiping out dozens of enemies without blinking an eye? Just spend the praxis with physical grafts. Want to create a stealthy character who can infiltrate anywhere? Then it will be enough to spend the praxis to attenuate the sound of footsteps or increase the range of Adam's cybernetic radar, just to give two examples. The possibilities are many and the powers allow actions not available with the basic character: for example falling from great heights, the already mentioned possibility of bending thewill of a character by speaking or to penetrate computers with high levels of security. Listing them all would require an official guide, but we believe it is clear how Deus Ex: Human Revolution was designed to give players a great illusion of freedom, decidedly uncommon in the latest video games, even in the most famous role-playing ones. Fried brains Artificial intelligence deserves a separate discussion, also because it is the crux that chokes Human Revolution a bit and prevents it from achieving the desired excellence. The basic problem is that, let's face it, the enemies are a bit stupid. Too. With a rougher approach, the poor artificial intelligence is less noticeable: it's a little funny to see people throwing grenades on their feet or coming out of cover like kamikazes, just in time to get riddled, but, after all, they shoot that's it and, in situations of disadvantage for the player, something good can also be obtained from these creatures of vectors and textures daughters of the CEPU. It is by playing in stealth mode that the evil geniuses demonstrate their inadequacy. Want to put an insurmountable barrier between you and an alert enemy? Lock yourself in a bathroom. You will be like disappeared. In reality these poor souls of the future seem to have great difficulty with the management of the doors, their real enemies to be killed. Another limiting case is that of piling up corpses with a tranquilizer shotgun. Are there ten enemies in one room? Get behind good cover, put one to sleep, and you'll see the others procession towards their fallen comrade. Obviously, putting another one to sleep, the remaining ones won't have the slightest problem of looking for a cover, since there is someone who otherwise could knock them out, but they will go to their collapsed friends to receive their dose of tranquilizers (maybe they like it, who knows ). Other examples of absurd behavior by the AI could be given, but you should have understood that in Deus Ex: Human Revolution you will often find yourself faced with situations bordering on the ridiculous, which somewhat spoil the identification. The bosses themselves are very subdued and not much of a challenge (Westerners still have a lot to learn from the Japanese when it comes to boss fights), with their tactics monotonous and predictable. Furthermore, it should be noted that they can only be eliminated by shooting, which penalizes a lot those who have chosen to develop a more refined character and which contrasts with the general philosophy of the game. Technology of 2027 Graphically Deus Ex: Human Revolution is a title with ups and downs. If it is not possible to move notes to the artistic direction and the construction of the scenario, some drools remain, mostly due to the scripted sequences and facial animations. Especially the former are rather annoying, due to their overemphasis. Coming up behind an enemy, Adam can silently take them down. Logic would like it to act quickly and silently; instead our hero does his utmost in sensationally tamarre actions, which have nothing stealthy. Spectacular yes, but decidedly contrary to any principle of the stealth genre. Moreover, they do nothing but underline the stupidity of the enemies in the surroundings, creatures with punctured eardrums who do not notice the thud of a colleague of theirs who is blatantly landed with a Bud Spencer cartoon. To go back to talking about graphics, which are the only thing that interests many players, sometimes these sequences short-circuit with the scenario and there are cases in which you end up knocking an enemy down with his feet half buried in the floor, or with the body stuck into a wall (Sicilian method?). In short, for Human Revolution the maxim that sometimes it is better to limit the barrels is valid, if you risk that the show could turn against you. On the other hand, the technical flaws are well masked by the splendid work done by the developers on an artistic level, which has produced an incredibly lively and dirty cyberpunk city, with a perfect use of colors and the creation of some glimpses worthy of the classics of the genre, Blade Runner included. The color change towards yellow fits perfectly and perfectly conveys the sense of livid decay inherent in every element forming the characterization of the city. In short, we tend to consider the technical shortcomings as peccadilloes due to the vastness of the levels and the richness of the contents, which require greater synthesis work than more closed and linear titles. Ergo, we can not complain too much.", "date": "2011-08-30", "grade": "8.8"}