{"name": "Licenza di squittire", "ref": "https://multiplayer.it/recensioni/92598-spy-mouse-licenza-di-squittire.html", "text": "It should come as no surprise that in a very short time Firemint has become one of the most renowned developers in the panorama of games for mobile and tablet devices. After having long dominated the App Store with the original Flight Control and thrilled fans of driving titles with the two excellent chapters of Real Racing, the Melbourne team finally had to give in to the acquisition by Electronic Arts. There were many reasons: from the risky purchase of Infinite Interactive to the disappointing debut of the company on consoles, while the unpredictability of the iOS market did not allow a notable and hard-core title like Real Racing 2 to sufficiently repay two million dollars spent in almost two years of work. This SPY mouse is thus the first game that the Australian team publishes under the effigy of EA Mobile, and it is evident that, this time, the aim is to go without fail, offering a clearly casual experience, less ambitious but much more audience-friendly than the iPhone and iPod Touch. My name is Squeaky... With SPY mouse, Firemint takes up the same control system already seen in Flight Control, but reworks and adapts it within a small and lively game with stealth mechanics, in which, in the role of a mouse who poses as James Bond , you have to collect all the pieces of cheese scattered around the room and reach the exit without being caught by the guard cats. Most of the time, these will find themselves guarding a given area of the level, but if we have to enter their visual cone, they will come to attention, head towards us and leap to eat us. The interaction takes place entirely via touch screen, with Agent Squeak following the path traced by the player, collecting or activating the objects he comes across, but it is precisely the variety of gadgets and enemies that gives sufficient depth to what otherwise it would be a rather trivial game. An example are the numerous cats present: there are blind kittens that follow a fixed path, ninja felines that throw shurikens, or some stupider cat that tries to grab the protagonist with a quick leap, allowing the player to dodge at the last minute instant and crash it into a wall. To add more depth to the game, there are several factors that must always be taken into consideration, such as the weight of the cheese which ends up slowing down the protagonist's walk, or the presence of dens and pipes that allow you to hide and move from one point in an instant to the other of the room. Like a true spy, Agent Squeak can then use a series of gadgets to dupe his opponents, distracting them with the TV, throwing them a ball of wool or a delicious fish, while you can't help but smile when, mimicking to Snake in Metal Gear Solid, the player will hide under cups and bowls and begin to sneak around the room. Each of the six chapters that make up the adventure ends with a boss fight, although these sessions prove to be among the least effective moments of the game: introduced by a boring and superfluous sequence in which you follow a cat up to the boss' lair, the clashes they are almost always too simple and uninspired, although part of the blame would be to amputate the rather limited control system. Completing SPY mouse is child's play and takes just over an hour, but each level offers three optional challenges that can significantly increase the difficulty and replayability of the experience: sometimes you are asked to get to the exit without put the cats on alert, others you have to complete the entire puzzle by tracing the path only once and without corrections. Added to this are secret passages and hidden levels to be discovered by playing and replaying the puzzles already overcome. The attention to detail typical of Firemint games is also evident in SPY mouse, with colorful graphics flanked by pleasant menus and amusing tunes in full spy movie style. It is sad to note that some of the main flaws of the game seem to be due to the influence of Electronic Arts rather than to the deficiencies of the development team: all too often the game suggests resorting to the Gatta Kiska, a paid help which, just like the Mighty Eagle from Angry Birds, allows you to pass a level in which you are stuck. Furthermore, although Firemint has invested in both Game Center and iPad in the past, SPY mouse does not support either Apple's tablet or its social gaming service, preferring instead of the latter Origin, the new EA platform which, moreover , at the time of writing is also quite unstable. The tested version is 1.0.1 Price: 0.79 App Store links", "date": "2011-08-30", "grade": "8.8"}