{"name": "Recensione Freedom Force vs The Third Reich", "ref": "https://multiplayer.it/recensioni/recensione-freedom-force-vs-the-third-reich.html", "text": "Fighting the Third Reich As can be seen from the title of this game, the great enemy of the handful of superheroes in this second chapter is the Third Reich. Before starting the real game, whoever might have missed the first FF will have the opportunity to learn what is narrated therein through a presentation made in the classic style of the old American comics: in addition to the drawings, in fact, also the classic onomatopoeic writings for noises ( the legendary SOCK! for fists and so on) have been used to make the player feel like the protagonist of a comic created especially for him. This feeling will be maintained throughout the game thanks to the narrative style and some graphic details that we will see in the appropriate paragraph. Returning to the plot, the Nazis find a way to go back in time, thus attempting to change the adverse fortunes of the Second World War into a victory for the Hitler regime: here the Freedom Force will obviously come into play, a sort of US agency made up of Super heroes. For the entire duration of the story, the game never loses its tone, always being pleasant and captivating thanks above all to the large number of characters with which to form your group, but not only: the scalability of the difficulty system allows you to select the most congenial to the player, not excluding the possibility of repeating the entire game by engaging in a new, more complicated challenge. If the single-player bores you, know that FF also has a four-player multiplayer mode, both in the local network and via the Internet. The campaign mode obviously remains the main one of the game, but it's nice to know that you can enjoy yourself perhaps using your team in a simple battle against someone by jumping into the action more immediately. However, the multiplayer mode includes seven different very classic types: in fact, they range from free-for-all to deatchmatch and beautiful company. A respectable cast If someone had told me that FF is a video game based on a real comic book, I would have believed them without batting an eyelid: such is the creation and variety of superheroes at our disposal that it really seems to be facing much better known characters such as the X-Men or Fantastic Four, to name a couple. Even for every single superhero it is possible to view an animated sequence that describes the moments in which he obtained his powers, thus obtaining a level of characterization that borders on perfection. Moving on to the real action, despite being in front of an RPG it is not necessary to apply too much thanks to the immediate system created by Irrational Games. The first missions of the game act as a plot-tutorial in order to allow the player to become familiar with the various powers of the superheroes and with the game controls, especially by learning how to interact with the environment, a fundamental aspect of the game: for example the The strong superhero of the moment can take a car and throw it at his enemies, or use a traffic light uprooted from the ground as a weapon. Control of one's party (made up of a maximum of four superheroes) never escapes the player, who also has the possibility to choose how the game should manage pauses in combat, i.e. stopping the fight completely or slowing down the progress of the game. action. I assure you that once you become familiar with the control and combat system, a very easy undertaking by the way, it will be a pleasure to always look for a way to perfectly integrate the powers of the group you are controlling, interacting with the superheroes with the necessary timing. As we said, FF is not a classic RPG and it won't take away our time with excessive reasoning on how to grow your character: within the missions, each superhero will earn a certain number of experience points, which can then be spent at the end of the level. The only things available will be new powers or upgrades for the ones you already have available. If for some this may be an advantage, it is also necessary to think of the downside, represented by the fact that RPG purists may not like all this ... The technical sector If we have already had the opportunity to praise the FF graphics before this paragraph, there will be a reason: using the GameBryo engine (the same as Sid Meier's Pirates!, DAOC and Morrowind, and sorry if it's not much ...) the Irrationals have succeeded in arduous attempt to reproduce the classic drawing of American comics on our monitors, presenting each mission just like a new album of a virtual collectible series dedicated to the Freedom Force. Although some characters ricSince they obviously mention more famous colleagues (Minuteman, one of the main characters, looks quite like Captain America), the graphic representation of all of them is undoubtedly impeccable, as are the animations and the entire background. In the most agitated phases the game does not show excessive suffering in terms of frame rate even on machines that are not exactly avant-garde. The audio also defends itself very well, with English-language voices very suitable for all the characters. The music and sound effects are no different, making the gaming experience pleasant from this point of view as well. Comment Released a bit on the sly like its predecessor, Freedom Force vs the Third Reich has all the credentials to make it into the action-RPG category: to begin with, it is a game completely devoted to the world of superheroes made in America , and this in itself already represents a remarkable attempt at innovation, at least in the world of role-playing games. To accompany the originality of the theme we also have a longevity above the norm, guaranteed by the enormous variety of heroes with which to form your party and by a multiplayer mode which, like cheese on macaroni, never hurts. The only criticism is the usual one that can be made to a title similar to this: purists of the RPG genre be careful as in the end it is more of an action game than a real role-playing game. Even those who have never liked comics in general and superhero comics in particular may get bored quickly. For everyone else, this game is almost a must-have, and since this one too went well, let's expect a third installment of the series from Irrational Games in the near or distant future. Pros: Guaranteed longevity Original theme for an RPG Always fun, even in the long run Cons: Not suitable for RPG purists Limited to American comics fans only The return of Freedom Force When Irrational Games released the first Freedom Force in 2002, it managed to obtain a good share of quite unexpected positive acclaim we could say, although it did not end up in the limelight. The innovative idea behind the game was to create an RPG based on the world of American comics, something most gamers had dreamed of up until then but never implemented by any development team: even though it did not enjoy any particular license ( physiognomy and names of the protagonists are all invented, although some recall more famous characters) the game succeeded in its intent to bring a breath of fresh air to the RPG landscape, offering the possibility of immersing yourself in the classic comics made in the USA. The technical realization was no different, given that FF could boast good graphics, a well thought out plot but above all a gameplay that managed to satisfy everyone. As market law rules, but at least for this time also as gamers wish, here we are, therefore, facing the sequel to FF: we will discover together how after three years the game has changed enough, while keeping the level of fun offered by its predecessor intact.", "date": "2005-06-16", "grade": null}