{"name": "Vita tra i campi", "ref": "https://multiplayer.it/recensioni/91842-agricultural-simulator-2011-extended-edition-vita-tra-i-campi.html", "text": "It often happens that an occupation turns into a video game. After all, there are plenty of jobs that are varied and fun enough to merit a virtual simulator. In addition to the obvious choices of the secret agent and the formula one driver, the developers in the past have also created titles focused on far more mundane jobs, such as the train driver, the airplane pilot and the bricklayer (Minecraft! Ok .. perhaps this is a bit of a stretch). But these days we didn't expect to even see a simulation of a farmer appear. Forget Farmville and the like, we're not talking about a simple management where chickens and trees are given away via social networks and a fully functional farm develops within a few days. Here it is a question of carrying out all the extremely tiring tasks of a farmer in a video game: plowing, sowing, fertilizing, and managing herds of animals. At this point, dear readers, you will say: ~well, in the end it is a varied job. At least more than the train driver ~, and you are not entirely wrong. You have to remember, however, that there are few Train Simulators worthy of Game of the Year, and that a game where you play a factor has the potential to be a brick-busting of even more apocalyptic proportions than the latter. As you may have understood from all this process, today we're going to review a niche title that couldn't be more niche, that is Agricultural Simulator 2011 Extended Edition, developed by Actalogic. Considering then that it is not the only simulator of this type on the market, we will reveal to you whether this curious product is actually the best of its kind, and whether it is enough to be tolerable even for non-fans of plants and tractors. To make the tree you need the seed Agricultural Simulator 2011 Extended Edition attempts to translate a farmer's tasks into a computer as closely as possible. To do this, it uses a fairly classic game system, divided into a management phase and an active phase respectively. The management phase is full of menus, and allows you to purchase agricultural vehicles, animals, feed and helpers. The options are many, but the system is only apparently complex. It will only take you a few minutes to understand how to expand your facilities, feed and heal animals, and enhance the skills of colleagues. Positive, if you think that management is the best part of the game. The tasks in which you will have to move in three dimensions on your terrain are in fact too close to reality and you will have to perform them in all their tedious slowness, because there is no way to bypass them. Once you leave the menus, you will find yourself in command of your virtual farmer and you can go around the farm, get on a tractor, attach a plow and start working. A tractor is certainly not a fast vehicle, so you'll be moving at the epic top speed of 30 kilometers per hour. What's more, the game physics prevent you from using the tractors' working extensions above a certain speed, so you'll have to plow, fertilize and sow at a maximum of 10 kilometers per hour, or the tools will detach and damage. It takes forever to prepare the crops and, although it is possible to entrust the task to your collaborators guided by artificial intelligence, you will still not be able to exploit the option to make time pass faster on them. So it will always take them a long time to bring the fields to fruit, and there's only one thing more soporific than cultivating a field in this game, watching the computer do it for you with the same zeal. Arms given back to agriculture Technically the Actalogic simulator leaves a lot to be desired. The three-dimensional representation of your farm is certainly not a shining example of realistic graphics, and the sound quality is also of the bare minimum for a video game. The vehicle models, on the other hand, let themselves be looked at. The programmers have thought of adding a village to the areas that can be visited but, apart from the presence of a factory where it is possible to sell one's goods, there is no reason to go there. The physics of the game are the flagship of the engine, and it must be said that it works quite well when it comes to moving on wheels. The same cannot be said for the on foot stages, where your alter ego can bump and move objects, and the physics are often ridiculous. Want an example? Try running into a passing car, and you'll see it flip over as if hit by a charging elephant. We know that peasants tend to have considerable physical strength, but this is a bit of an exaggeration. Even the presentation of the menus is the most basic one can conceive, and not alza the overall quality. The title boasts the official Claas license, and therefore counts agricultural vehicles that actually exist, but we doubt it will be of interest to someone who is not a subscriber to ~Trattore Weekly~. The last option we cover is the multiplayer one, an interesting addition that gives the possibility to manage a farm with other players and undoubtedly improves the experience. We hope you can try it, not so much for its validity, but for the atrocious scarcity of available online games. Nothing to complain about in terms of longevity. It will take you a long time to develop your properties, unless boredom makes you give up sooner.", "date": "2011-08-12", "grade": "4.5"}