{"name": "Grand Theft Auto: San Andreas", "ref": "https://multiplayer.it/recensioni/grand-theft-auto-san-andreas_a.html", "text": "The return of Carl You know practically everything about San Andreas, but a brief summary is mandatory for those who returned from Mars today. The protagonist of the story is a black thug, Carl Johnson, who fled his infamous neighborhood to seek an ephemeral redemption. But for guys like him there is no hope of a normal life, and the return to the fold is practically a given. But nothing is as before. The discovery of the killing of his mother, the persecution by corrupt policemen and the bloody relations between the city gangs soon make Carl understand that his fate is inevitably sealed. Obviously ours will be the task of discovering those responsible for the assassination, restoring order to the streets and, last but not least, becoming the masters of the world! For those who have played the previous episodes of the saga, they will immediately understand that it is a feeble plot to justify yet another gigantic plot of missions aimed at the evolution process of the protagonist. The scenario follows the period of the early 90s, with an adequate visual and sound representation of the fashions of the times. The beginning is unsettling, and veterans will already know what to expect: a simulated world of bewildering vastness, dominated by complex behavioral and physical routines. Streets and buildings are teeming with an incredibly diverse population, ready to react in ever-changing ways to player interaction. The randomness of certain events is increasingly impressive, it is not uncommon to witness accidents unrelated to the action of the protagonist, elements that contribute to the sensation of interacting in a true virtual micro-universe. Like an RPG The fulcrum of the game is always to steal cars of all kinds to achieve the objectives suggested by the cpu, reach the pre-established places, solve the mission unharmed, survive the rigid martial system of the game. It seems like an overly simple mechanism, but it's the way Rockstar manages to polish it that makes all the difference. San Andreas does not overturn the winning formula of its predecessors, but proceeds by accumulation, amplifying the experience with an infinite series of additions, all incredibly enjoyable. The most conspicuous implementation is that of a system vaguely inspired by RPGs, in fact the character has values whose development has an impact on the interaction with the environment, and consequently the missions to be faced. The scenario follows the period of the early 90s, with an adequate visual and sound representation of the fashions of the times. The beginning is unsettling, and veterans will already know what to expect: a simulated world of astonishing vastness Like an RPG Just to give an example, to satisfy Carl's dietary needs it will be necessary to make him eat, but excessive feeding will cause him to gain excessive weight, compromising his ability to run fast. Or adequate gym sessions will make him more muscular and performing... You can really do everything: buy clothes in shopping malls, go to the barber, fill your body with tattoos. After just a few hours of play the character's appearance can change radically, needless to add that it is possible to reach hilarious excesses, complete with golden chains around the neck, weird hair and anything else our imagination can suggest. I am the law in the city! The amount of things to do is boundless, the explorable map even larger, including, among other things, particularly evocative areas outside the cities, such as the canyon or the countryside. Just to moderate the disorientation, the programmers initially limited the walking between the three main cities, a feature already present in the previous episodes. And it's a shame, since it is precisely in the locations that can be unlocked in the advanced game (memorable Las Venturas) that San Andreas shows its real potential. In any case, nothing prevents you from roaming freely around the city, diverging from the linearity of the missions in a sensational way, San Andreas amplifies this possibility to the highest levels, piquing the player's curiosity like no other title in the genre. It is possible to try your hand at mini-games of all kinds, find yourself involved in exhilarating dance competitions (complete with controls derived from rhythm games), drive helicopters, jump with a parachute ... There is no limit to the things to do in the Rockstar masterpiece. Fun is guaranteed, despite the very high violence present in the game it will not fail to arouse controversy. Even if diluted by a deliberately grotesque and caricatured style, the subversive and provocative nature typical of the saga is always present, the criminal action suggested with smug pride, so much so that the most sensitive could remain allrbati from certain situations. Xbox vs. PC Released simultaneously in the Xbox and PC editions, San Andreas presents itself on the latter as the graphically better version. The high resolution support makes itself felt, guaranteeing a clearly superior detail to the console versions. Provided, however, that you have an adequate configuration, especially the video card. In addition to this, there is also the option for personalized soundtracks, closing the picture of a truly exemplary port. For the rest, the game is substantially unchanged from the first release on PS2, which inevitably touches third place... Evolution Technically the Xbox version enjoys a series of graphic improvements that are not very evident, but detectable when compared to the PS2 counterpart. First of all, a better image cleaning, more defined textures, significantly reduced draw-in, the latter noticeable in the most critical sections of the version for the Sony console, and a useful instant replay of the most spectacular actions. We certainly expected a little more from superior hardware like Microsoft's, even if the graphics certainly don't represent the greatest value of GTA. San Andreas does not overturn the winning formula of its predecessors, but proceeds by accumulation, amplifying the experience with an infinite series of additions, all incredibly enjoyable. Evolution We also point out the support for the personalized soundtrack, among the available radios it will be possible to choose the user's one, which will play the songs present in the HD, complete with interludes from the speaker. It must be said that the quality of the soundtrack overshadows this possibility, but it is always a welcome addition. The controls have been remapped to the pad's capabilities, to good effect. The idea of associating the acceleration of the cars to the analog trigger is excellent, even if it is less functional in aerial driving. Also improved the pointing system, often confusing on the PS2 version. Absent Live support, on the other hand superfluous in a purely single player title. Comment GTA San Andreas is the state of grace of the Rockstar saga, the chapter that best represents the intentions of the software house to offer a credible and very entertaining virtual world. In a nutshell: a masterpiece. All the features of the previous episodes are brought back to the nth degree, with tons of additions that will keep you busy throughout the summer. The Xbox and PC editions have aesthetic and control improvements, but they are ports that don't take full advantage of the hardware they arrive on now, resulting essentially very similar to the original version. Regardless of this, GTA San Andreas remains an unmissable appointment for those who missed the one on PS2. But considering the non-linear nature of the game and its many facets, even those who have dominated the streets of San Andreas could find new stimuli, perhaps with the song of the heart in the background ... A real milestone. Pros: It's GTA: San Andreas on Xbox, having said that It will last you a long time Custom Soundtracks Graphic improvements... Cons: ...But perhaps it was reasonable to expect more in this respect Very violent, refrain the impressionable Some frustrating missions Xbox and PC users have had to wait patiently, but they can finally enjoy the second biggest Sony exclusive after Pro Evolution Soccer 4 and in its best form. San Andreas is certainly one of the most tantalizing summer outings, an unmissable appointment for newbies, but also an opportunity to return to the mean streets of Los Santos.", "date": "2005-06-16", "grade": null}