{"name": "Mia sorella  una fata!", "ref": "https://multiplayer.it/recensioni/91609-chantelise-a-tale-of-two-sisters-mia-sorella-e-una-fata.html", "text": "Recipear: An Item's Shop Tale was one of last year's nicest surprises in the PC environment. Not only was it an excellent game capable of engaging for many hours, but it was also the first title in the Easy Games Station catalog to be translated into the West by Cape Fulgur. The western version of Chantelise: A Tale of Two Sisters, the game we are about to talk about, was made possible by the success of Recettear. Chantelise tells the story of two sisters, Chante and Elise, who must embark on a perilous journey in search of the witch who has turned Chante into a fairy. On their way they will meet other characters, few in reality, who will help them with more or less important advice or revelations, up to the final twists that we will not reveal to you so as not to cause hysterics and crying attacks. The plot is narrated through dialogues, identical to how it happened in Recipetear, usually well written and funny, but which take more dramatic notes towards the end of the adventure (let's say from the end of the fourth chapter onwards). chantear At first glance, Chantelise shares some elements with Recettear, for example the objects are the same, as are most of the common monsters, not to mention the two protagonists, who reproduce the know-it-all fairy/sweet and naive girl couple. However, the similarities exist only at the level of assets, because the game mechanics are quite different: Chantelise is much more action-focused and has no management part. Those who expected an original title like Recipe will be disappointed. The same goes for the technical aspects, sadly subdued. It's true that Chantelise came out before Recettear, but from a visual point of view we're dealing with a product that we don't hesitate to define as underdeveloped even for the year of publication in Japan (2006). The protagonists and enemies are large 2D sprites that move in bare and often anonymous 3D environments, with textures reminiscent of the first 3Dfx that cover surfaces that seem to have been cut with an axe. Resolution is also an issue, as the choice is limited to three, all in 4:3 aspect ratio. Only the special effects of the spells are saved, especially the more powerful ones, which, while not throwing the underwear at Pugliese, are appreciated with effective animations. Luckily Chantelise is not just graphics, otherwise we would have cut it mercilessly. Easy to consume crystals The first thing that comes to mind after the first few hours spent in the company of Chante and Elise is that the game is damn hard. But let's go in order. As already mentioned, we are faced with an action in which the two protagonists play complementary roles: Chante, the fairy, is in charge of casting the spells, while Elise is in hand-to-hand combat. The only one of the two who can be injured by monsters, equipped with physical or magical attacks depending on the type, is Elise, who, however, can heal herself by collecting food dropped by dead enemies or by magic. If the combat system is rather linear, with a single key that is used to bring all the attacks and another that is used to jump, the spells deserve some clarification. By hitting the enemies, in addition to coins, crystals of four different colors are released, each linked to an element, which Elise must collect. Only when you have the crystals can Chante cast her spells. The more crystals used to cast, the more powerful the spell. We therefore have the basic spells, which consume a single crystal, which are quick to cast but not very effective, while with two and three crystals more devastating effects are obtained, which vary according to the element. Finally, by consuming four crystals of the same color, powerful creatures are summoned capable of carrying terrible attacks or supporting Elise in combat. Unfortunately the healing spell, which requires the consumption of three blue crystals and which is decisive for making the game more affordable, only becomes available from the third chapter. The game structure is very rigid: as soon as you discover a dungeon you have to face it in story mode, clearing each map of all enemies to open the exit. Only after reaching a section in the story will treasure hunting also become available, that is a mode in which you have to kill monsters as quickly as possible and which can be used to find the missing hidden chests, the latter usually linked to particular puzzles such as having to hit some stones or having to jump on all the floating platforms of the current map. No levels, lots of items and a few extras One of the things that you notice right away is chand neither Elise nor Chante accumulate experience points. Ergo, there is no leveling up. To improve its characteristics (life points, attack, magic, resistance to physical damage and resistance to magical damage) you need to buy or find objects: purchases are made in one of the two shops in the game, while in each of the dungeon levels there is a hidden special chest, which we have already told you about in the previous paragraph, which contains upgrades such as shields, gloves or other. Unfortunately, you can't use many items at the same time: at the beginning you have two slots available, but you get a third almost immediately and you get, practically at the end of the game, to five. You need to know how to choose what to use, based on the enemies you are facing and your own attitudes, learning to change battle configuration according to the needs of the moment. Especially at the beginning, it's not uncommon to die and find yourself in the village square where most of the story unfolds. Fortunately, all the objects found and the money collected are kept, so as to be able to buy various upgrades, including the very precious medicines that increase the number of hit points, and then try the adventure again. The clashes with the bosses deserve particular mention, big and tough enemies that must be faced with different strategies. Despite the very high difficulty of some fights, we can say without fear of contradiction that they are the best part of the game and that they involve exceptional fights, among the most beautiful played in recent years. In addition to the story mode, which takes about twelve hours to complete, but which easily reaches fifteen if you engage with the hidden chests, there are some extras that further lengthen the game time; for example, you can collect fish, using Chante as bait after receiving a fishing rod, or you can tackle the hardcore mode, which must be unlocked by passing the fourth chapter. Summing up we can say that longevity can reach twenty hours, also considering the numerous deaths and the idiotic editors who don't save games and lose hours of play. Not bad, also considering the price at which Chantelise is sold: 8.99 on Steam.", "date": "2011-08-04", "grade": "7.2"}