{"name": "La morte  al servizio del giusto", "ref": "https://multiplayer.it/recensioni/91511-warhammer-40000-kill-team-la-morte-e-al-servizio-del-giusto.html", "text": "The game is available for download via Xbox Live and PlayStation Network Tested version: Xbox 360Warhammer 40,000 is certainly one of the most fascinating settings created in recent decades, developed by various authors who have taken turns to give depth and content to what started out as a simple boardgame, and which has evolved over the time as one of the most popular franchises among science fiction fans. Keeping the endless battle between the Space Marines of the Imperium and the hostile races of the universe confined to a single dimension would have been impossible, and in fact there are numerous sorties of WH40K in the world of video games. The latest is represented by Warhammer 40,000: Kill Team, a ~twin analog shooter~ available for a couple of weeks on Xbox Live and also out on the PlayStation Network. The game consists of a main mode, which unfolds through five levels, and a survival mode that sees us resist the onslaught of ever-increasing hordes of enemies for as long as possible, to then share the score obtained via a global leaderboard (which clearly includes the results of our friends). The plot behind the story mode is quite simple: a Space Marine patrol intercepts a huge Ork ship and rams it. Having penetrated the hull, the soldiers of the crew launch an attack with the aim of eliminating all the enemies as well as their commander, a very complex operation given the size of the ship and above all the enormous quantity of Orks inside. We will therefore have to move by alternating power and cunning, hit the nerve centers of the structure and make our way through the many pitfalls that we will find on our way. For the Emperor! The supervisor's voice, well dubbed into Italian, guides us through each stage and explains what to do, which direction to take and possibly which elements of the scenario to destroy. It is a pity, however, not being able to skip the interlude scenes with the appropriate indications in any way, especially if we are replaying a stage that we already know well. The direction of Warhammer 40,000: Kill Team manages to be sufficiently varied and multifaceted, the events unfold at a good pace and there are some interesting variations on the theme, while maintaining the typical top-down shooter gameplay where both are used the analog sticks of the pad. The control system adopted by the developers is classic for the genre: the left stick moves our character, the right one activates and directs the fire, while the A and Y buttons are used respectively for the melee attack and the activation of switches. The left trigger of the controller allows us to make a short quick sprint, while the LB and RB back keys activate the special attack and the launch of the grenade. The yield of the weapons, in particular the sensation of impact on the objectives, is really good and alone constitutes an excellent reason to play with the THQ title, as well as to experiment with the various weapons that the four different Space Marines at our disposal can equip, unlockable by meeting certain kill quotas. The diversification of the units that we can control is undoubtedly one of the strengths of the game. At the beginning of each level, in fact, we can choose whether to play the role of a Veteran of the Resolute Guard, a Librarian, a Veteran of the Vanguard or a Techmarine. The fanatics four Each of the four selectable Ultra Marines has different weapons, upgrades, abilities, and special moves. The Veteran of the Resolute Guard is an ace in ranged combat, thanks to the powerful rifle supplied which can be replaced, in the later stages, by a devastating missile launcher. It is practically defenseless against melee attacks, but can call upon a highly effective special move: a barrage of projectiles capable of destroying any target in seconds, ideal for dispatching large groups of enemies or eliminating bosses. The Librarian, on the other hand, specializes in close-range attacks, wielding a fearsome sword, capable of slicing through any Ork, but his gun proves poor from range. The Librarian's special move is a kind of ~smart bomb~ that blows up everything near the character. The Vanguard Veteran is also strong in melee but disappointing from range, with his chainsword and light rifle. His special move consists of a series of rapid attacks, from a ~charge~ that he can unleash against multiple targets. Finally, the Techmarine probably turns out to be the best unit of the lot: the big mechanical arm that ha on the back blasts away lighter opponents with ease, while the shotgun can be replaced, in the later stages, by a deadly laser cannon with a persistent beam. Its special move consists in the release of an automatic turret, really useful in the most agitated phases. Each Space Marine can carry a limited number of grenades, as well as two power-ups that can improve ranged or melee damage, increase the health bar or increase the duration of the special move. Xbox 360 goals Warhammer 40,000: Kill Team contains twelve achievements to unlock, for a total of 200 G. Getting them is simply a matter of time, since they do not require any particular operations and it will be enough to complete the game, as well as score a few points in survival mode, to succeed in the business. A few examples: the ~Honour to my shield~ achievement is unlocked by completing a mission without dying, the ~Expert of the trade~ achievement is obtained simply by using a special move for the first time, and finally the ~Exterminatus~ achievement involves the killing five thousand enemies. Curse vain death There are basically three obvious limitations of Warhammer 40,000: Kill Team. Firstly, the game has a cooperative multiplayer mode, but only locally. The lack of the online component weighs a ton, especially due to the second limit of THQ production, or the poor balance of the available units. The Librarian and the Veteran of the Vanguard, specialized in melee attacks, even at maximum power, in fact, end up succumbing to the enemy's gusts. Character movement is too slow for a sword to outmaneuver a rifle, and while pairing a ranged Ultra Marine with one with a powerful melee attack can be a great tactic, this one is impractical if you don't have the a friend to play with on the same console. From this follows the third limit: playing alone it is possible to complete the adventure using the Veteran of the Resolute Guard or the Techmarine, ergo one of the strengths of the game (the differentiation of the characters) ends up being literally halved. The duration of the campaign could also be added to the list of defects, given that five levels are few and it is possible to complete the game within a few hours, but this value seems to us all in all adequate for the price of the game (800 Microsoft Points, 9. 99 euros on PlayStation 3), heralding an experience that may be short but intense, engaging and well directed. The technical realization is very good, with the only exception represented by some blunders of the visual.", "date": "2011-08-01", "grade": "6.8"}