{"name": "Blackwind", "ref": "https://multiplayer.it/recensioni/blackwind-recensione.html", "text": "The following is the review of Blackwind, the latest title from Catania's Drakkar Dev. After gaining experience on mobile platforms, the Sicilian studio gained good experience with home systems with War Tech Fighters, a space action in which the protagonist was a mech that seemed to come out of an episode of Robotech. A distant relative of his, tired of floating in the cosmos, has decided to land on an alien planet to resolve an outstanding issue between greedy terrestrial colonists and native more or less biological life forms. Obviously this is not the plot, but the substance does not change because an exoskeleton equipped with artificial intelligence and controlled by a little boy remains at the center of the action. However, the perspective changes, with a camera that is no longer positioned behind the robot, but from a bird's eye view and above all changes the nature of the game. For Blackwind, Drakkar has decided to dust off the mechanics of one of his greatest successes for smartphones, namely Clash Of Puppets, which are the same as isometric action games such as Bastion, Hades or the Halo Spartan series. An insidious territory, where it is necessary to come up with some original ideas so as not to end up forgotten in a few weeks. Shots and control system to be reviewed A melee attack against a robotic monster In search of this goal, typically platform sections often seasoned with environmental puzzles are added to the shootings (which act as the backbone of the title). Some of these are well thought out and require the synergy between the armor and a drone that is normally inside it but which can be detached to access inaccessible areas. The levels alternate (too) schematically between external locations, where there is apparently greater freedom of movement, and the interiors of hangars and laboratories, where narrow corridors lead to slightly larger rooms. It happens, perhaps a little too often, that you have to retrace your steps, perhaps after having found upgrades for the mech, to go beyond areas that were inaccessible at first. We immediately realize that one of the most critical aspects of Blackwind is the management of the camera which in some points gets so close to the protagonist as to prevent you from seeing what is around him. Situations that can be managed with the minimap, a pity however that this useful function is only available in ~closed~ levels, while in open ones you have to rely exclusively on your interpretative spirit. So the risk of getting lost is around the corner: we happened to spend about ten minutes looking for a path in the woods before being able to find it. To aggravate the picture there are phases in which pinpoint precision is required in the jumps: a circumstance which in itself can lead to frustration, even more so when it is combined with dancing shots and a control system which in these situations proves to be imprecise . It also doesn't help that, in certain (fortunately sporadic) cases, resurrection checkpoints require you to repeat some delicate steps. Satisfying action, a little less customization An alien portal Overcoming these non-negligible defects, Blackwind proves to be engaging and immediate from the very first start. It is useless to waste too much time explaining the plot (vaguely inspired by that of the recent Claire De Lune): it is little more than a pretext to set fire to the dust. The mech has three main attack types. Enemies can be dealt with hand-to-hand, thanks to energy blades that come out of the arms, or from a distance. From his right hand he can shoot laser beams, while from his back he can shoot guided missiles which, however, require the accumulation of specific energy globes in order to be launched. As you continue, the arsenal is enriched with a berserk mode, defensive shields and a series of combinations to be carried out with the white weapon (yellow, in this case) which allow, for example, to stun the aliens or carry out bloody ~fatalities~. Enemies and settings (extremely destructible) also drop spheres of other colors: the green ones are the only way to restore the energy bar, while the blue ones feed a ~wallet~ to be emptied in the aforementioned check-points which also act as points of fast travel. Unfortunately, the enhancement of the exoskeleton is not as satisfactory as this type of game requires: in the first few hours we were able to reach the maximum level of the secondary attack which is the one that is used most frequently. Furthermore, apart from some skins, there is no possibility to customize the visual rendering of the exoskeleton, edit's a shame because it would have opened the door for different kinds of approaches to battles. The variety of enemies is only discreet, despite this it is well distributed throughout the evolution of the game, helping to gradually but constantly raise the level of challenge. Most are killed with fire from the secondary weapon (but sometimes you tend to lose the pointer, which is a little too small), but in more crowded situations you need to use all the firepower available, especially in duels with ~bosses~ garrisoning certain junctions and being destroyed only by approaching to execute the finishing move. Multiplayer and longevity You shoot from all sides From a technical point of view Blackwind thrives on ups and downs. Among the most successful aspects are explosions and weapon feedback: the destructive power of the mech is well transmitted to the player's eyes thanks to a clever game of ~vibration~ of the shot. Too bad perhaps for the excessive agility during the jumps and shots that does not go very well with the slow and inexorable gait of the walk. The audio section is terrible - a couple of tracks that repeat ad nauseum will make you want to turn off the music after a few minutes, but the voice-over (English only) and sound effects are also rather schoolish. The level design, as initially written, would have deserved a less rigid schematic and a greater level of detail. Overall, however, Drakkar's game looks more than decent. There is an ~asymmetric~ local multiplayer mode, in which a second controller can take command of the drone alone; unfortunately there is no other way to approach the game in company. Blackwind's longevity is good, easily exceeding ten hours on the normal difficulty level. The title still has some bugs: sometimes it happens that the protagonist gets ~stuck~ in some corner of the map, and that the program does not memorize the screen resolution preferences. Details that should be quickly corrected and that did not influence the formulation of the final judgment.", "date": "2022-01-19", "grade": "5.0"}