{"name": "Cthulhu Saves the World", "ref": "https://multiplayer.it/recensioni/91352-cthulhu-saves-the-world-jrpg-damerica.html", "text": "H.P. Lovecraft was a pretty weird guy. A brilliant weirdo, but still out of whack. There are not so many other ways to define a man who, inspired by his nightmares, was able to create a being like Cthulhu: an ancient sleeping cosmic deity, hidden in the submerged city of R'lyeh, with a humanoid shape, with dragon wings and a beard of tentacles, whose awakening will spell the end of the earth. The most visionary of men would struggle to bring something like this out of a dream, even with two kilos of peperonata on his stomach. However, there are people crazier than the writer and, rightly so, they program video games. This is the Zeboyd Games team, a group made up of three cheerful developers located in California, who have seen fit to take our sprawling friend and make him the protagonist of a 2D RPG with a top-down view. Cthulhu Saves the World, this is the name of their latest effort, was first released on Xbox Live Indie, and has recently also appeared on Steam, to the delight of all PC players. At first glance, the game seems like crap created with RPG Maker, so much so that the measly two euros of price at which it is sold seem even excessive. However, you would be making a terrible mistake not to pay attention to this work just because it is ugly to look at. Indeed, these American jokers are geniuses and have created a hilarious title that any nostalgic of the old Japanese RPGs should have. We have played it, finished it and we can tell you with certainty that its value for money is absolutely off the charts. Not enough, it is sold in pairs with Breath of Death VII: The Beginning, the first experiment in the field of Zeboyd roleplaying. F'taghn! The adventure of our very green protagonist begins on a beach at night, a few moments after he wakes up from his long sleep. Like the good ancient deity that he is, Cthulhu is preparing to destroy the world and forever destined the minds of humans to an eternity of madness, when out of nowhere an unspecified guy appears who deprives him of his powers and leaves him passed out on the beach. Sin. Found the next morning, ours learns from the narrator of the adventure that the only way to regain strength is to become a true hero. From destroyer of the earth he therefore becomes the one who must save it. As you may have understood from the summary, the plot is completely insane. Cthulhu Saves The World relies heavily on the humor and madness of the characters that populate it. To give you an example, among your supporting characters there will be: a girl with a curious fetish for starfish who falls in love with Cthulhu at first sight, a talking and floating sword, and an emo necromancer armed with a whip. The best part is that not even the strangest characters will join you in the main campaign! Many titles often go overboard with nonsense and wacky humor, but that's not the case with Zeboyd Games' creature. Here, fun is guaranteed, and you'll have to really have a cold heart not to burst out laughing in front of the bullshit that the tentacled fighter and his friends shoot during their wanderings. No less excessive is the premise of Breath Of Death VII. In this other title the world has already ended, and now everyone is happy undead. Walking corpses don't breathe, but that doesn't mean they can't be heroes. You will then take control of DEM, a skeleton mute by choice (but above all because he has no vocal cords) ready to fight evil with the help of a group of friends as deceased as he is. Like Hulk, but slimier The gameplay of Cthulhu Saves The World will be familiar to anyone who has played an early Final Fantasy. The system is the most classic that has ever existed in turn-based JRPGs: you can attack, use physical abilities, magic, combined attacks, or put yourself on guard. No escape, only possible through specific abilities of some characters. At each level you get bonuses to characteristics or new skills, all predefined for each party member. The protagonists can be customized by carefully choosing the bonuses granted, but the paths that can be taken are few and are usually limited to the choice between a specialization in hand-to-hand combat or in magic. The real novelty consists of three mechanics introduced by Zeboyd Games, madness, the combo counter and timed monster boosting. The first is directly linked to the ability of Cthulhu and some of his companions to drive enemies mad. Once you lose your mind, the opponents will take more damage from the blows, but some of them will also start hitting harder, and using special powers. The combo counter is a simple countof hits scored during a fight. The more attacks you perform, the more powerful certain moves of your heroes will be. The timer instead makes every battle a race against time, as with each turn the monsters become more and more powerful, to the point of becoming unbeatable. All three mechanics are well implemented and add strategy to the fights. The timer in particular prevents you from eliminating an opponent from exhaustion, using healing spells and spells that do cyclical damage in time. Breath of Death obviously has the same mechanics, excluding madness, the power of only the lord of R'lyeh. No shirt can contain Cthulhu's awesomeness! Graphically Cthulhu Saves The World is pretty bad. It may be a tribute to the classics, but it can be seen that only 3 people have programmed it, and its pixelated 2D graphics certainly don't surprise. On the plus side, you can play it even if your computer is a 386 with a hamster power supply. The character designs are pretty crass too, but at least they have charisma. What is surprising is the structure of the dungeons. All rather complex, from the first to the last, however, they are intuitive and easily navigable. For better or worse, you can always find your way to the final area, where the inevitable boss resides. The idea of inserting a fixed amount of random battles while exploring a map is also clever. Once the maximum number has been reached or the boss has been defeated, the location can be revisited without danger of clashes, as long as you do not force them with the appropriate option in the menu. The sound is also good, without dubbing, but with very catchy 8-bit music. Longevity is great. The main campaign takes around 9 hours to complete in its entirety, and once you're done, you can replay it on a higher difficulty or indulge in multiple bonus modes. Among these the best is undoubtedly the one called Cthulhu's Angels, which features new all-female characters, and a modified plot accordingly. The longevity of Breath of Death is also excellent, but it is clear that the first GDR of the house is a prototype. it's visibly rougher and less inspired, though worth playing and often just as entertaining. Overall, don't be surprised if both titles manage to take you away almost thirty hours. Finally, if you love quotes, you will be happy. All adventure is full of them, and they are often fantastic.", "date": "2011-07-25", "grade": "8.0"}