{"name": "9mm di dimensione artistica", "ref": "https://multiplayer.it/recensioni/91294-9mm-9mm-di-dimensione-artistica.html", "text": "Tested version: iPad We don't want to place the usual emphasis on the magnificent copy and paste work that has historically distinguished Gameloft's approach to the world of video games on Apple systems also because, to be honest, perhaps this 9mm is the title that least seems to attract from the gameplay typical of other famous productions. In fact, we find ourselves in the presence of an extremely classic third-person action shooter in terms of style of play, shots and atmospheres but with a handful of additions to the gameplay that partially manage to refresh an otherwise rather static and plastered genre. Our protagonist, John Kannon, is a policeman used to dealing with the worst street criminals, constantly busy patrolling alone the most infamous neighborhood of a city that is very reminiscent in style and atmosphere of the worst Los Angeles of our days. Until he finds himself involved in a raid against a gang of drug dealers and, together with his most trusted colleagues decides to ~confiscate~ all the money earned from drug dealing to finance a direct attack on the criminal organization that manages the drug trafficking and in particular to its boss, El Diablo. Obviously between saying and doing there are several thousand bullets fired and a series of plot variations and decidedly improbable and forced twists involving the various secondary characters, all rather sketchy, and even the Kannon family who appears so suddenly as an additional pretext for some gratuitous violence. We don't want to add anything else to avoid the risk of spoilers but we assure you that unfortunately you will forget the story almost immediately to focus on the actual gameplay since, at least this, it will be able to give you some satisfaction. A cannon for Kannon The second negative note that afflicts 9mm is the typical control system adopted by Gameloft for its third person action. The writer is still strongly critical of the dual virtual analog due to its inconvenience and the obvious lack of feedback that also weighs in terms of precision and response of the inputs, but as if this were not enough there is a strong feeling of randomness in the arrangement of some command icons. For example, the area for firing is excessively close to that for activating bullet time (we'll talk about it later) with the result that very often you will find yourself pushing one in place of the other while the icons for shooting and above all to reload or change the weapon they are completely out of reach and force each time to remove a hand to touch them. The result is a noticeable slowdown of the action that often leads to frustration in the most chaotic situations. Theoretically, it is possible to lighten the controls slightly by using the gyroscope to rotate the view, but this choice, in addition to lacking precision, tends to tire the player a lot. And even if we haven't had the chance to try it firsthand, we can imagine that the situation becomes even more complicated in the iPhone version. However, don't be fooled by such a negative review opening because what works quite well in 9mm is its gameplay. And of course this is no small matter. The 12 extremely linear levels that make up the single player experience can be played with pleasure and in a few hours, no more than four, you will find yourself watching the end credits. The settings are quite varied and move through enclosed areas between factories, clubs and homes and even quite large open spaces, especially near the epilogue. But the variety of game situations offered is also positively striking which, even if they never manage to shine for originality, at least allow you to detach with a good frequency from the classic gameplay action. Let's start with the bullet time mentioned above. Unique, true ~copy and paste~ element from the famous and never forgotten Max Payne is implemented in 9mm in the form of a button that allows you to slow down the speed of the action for a rather limited time. But not only because the special ability icon behaves like a sort of analog stick: that is, it is possible to slide your finger in the various directions to activate the effect and at the same time launch yourself with a jump in the imprinted direction. And there is also a reinterpretation of the classic quick time events which here take place in two ways. On the one hand we have some micro-segments in which John finds himself chasing someone and it will be up to us to make the correct gesture at the right time. On the other hand there are the interrogations. In these situations we will have to limit ourselves to touching the icon of a dis very quicklytintive or a series of words that appear on the screen in green, avoiding the red or gray ones. All while we see our protagonist beating up the unfortunate person on duty with slaps. The idea is also initially interesting but seeing it repeated several times completely identical to itself and above all discovering that a single mistake in these moments leads to the immediate game over with consequent repetition of the entire scene, will soon tend to annoy even the most player patient. Not just single player The three difficulty levels available manage to offer an interesting challenge rate and even if the artificial intelligence of the enemies and companions who sometimes accompany you in the shootings tends to be null, in the opportunities for defense to the bitter end of the position it will not happen infrequently to struggle in the arduous attempt to stay alive. Gameloft's choice to offer a rather abundant paraphernalia including pistols, light and heavy machine guns, shotguns and even a sniper rifle, the only weapon that will allow you to use the zoom at the expense of bullet time, is certainly appreciable. There are even some irons that can be used akimbo, one in each hand. On the other hand, the grenades and the possibility of hitting an enemy in melee are totally absent, but you will hardly miss them since the action will take place mostly from a distance. The multiplayer unfortunately does not shine in abundance since it is reduced to the two simple deathmatch modes free for all and Cops and Gangsters, or the classic team deathmatch with support for 12 contemporary players. There are only four maps available, all medium-sized and rather focused on indoor clashes. Even if we weren't able to devote ourselves to this aspect of the game for many hours, we are however quite convinced that the multiplayer gameplay will prove unbalanced in the long run as it is based on a level system that equips players with ever more powerful weapons and greater resistance to blows. The supported connection methods are Wi-Fi, Bluetooth and online via the internet. Concluding with the technical aspect of 9mm we return to the descending phase of the evaluation. Gameloft's action has excellent fluidity and a graphic sector that at first glance may appear more than discreet, also thanks to the variety of scenarios mentioned in the body of the article. However, upon closer inspection, the numerous low-resolution textures and character models made up of a small number of polygons and animated in an approximate and often very woody way are evident. Not even lip syncing helps in this sense, certainly an interesting introduction for a title of this magnitude, but which very often does not work correctly with the result of seeing characters who move their mouths only for a few seconds or are blatantly late compared to the dubbing. Just the latter is of more than valuable workmanship even if completely in English. We Italians have to settle for subtitles in our language only. Finally, the music ranging between rock and dance is very pleasant, with various guitar solos to accompany the most intense actions. The tested version is 1.0.0 Price: 5.49 App Store links", "date": "2011-07-22", "grade": "7.6"}