{"name": "Esistono ancora i Laser Game?", "ref": "https://multiplayer.it/recensioni/90756-dragons-lair-2-time-warp-esistono-ancora-i-laser-game.html", "text": "The original Dragon's Lair by Master animator Don Bluth could not fail to have an excellent sequel, and so this ~Time Warp~ appeared back in 1991, at the time on the Laser Disc platform (those huge and wonderful discs) and Arcade. The story of this sequel takes hold years after the end of the first chapter and sees the protagonist Dirk married to Daphne, together with now numerous children who populate their house. Obviously here is the arrival of the bad guy on duty, the wizard Mordroc, upsets the merry little family by kidnapping the beautiful little wife. Guess what is the purpose of this adventure? Well yes, just like Super Mario, we have to recover our beautiful princess and defeat Mordroc through a series of levels (seven, plus a final one) that jump from one era to another thanks to the time machine that the wizard used to escape . Already from the second level we are even catapulted into prehistory and we have to deal with dinosaurs and primitive creatures, to then move directly to the end of the 19th century in the world of Alice in Wonderland, the Garden of Eden with the tempting snake and a busty Eva and finally, reduced to the size of a bookworm, in the study of Ludwing Van Beethoven. The finale, set in Egypt, slowly leads us directly to the castle of the wizard Mordroc with a daring conclusion. The ancestor of the QTE Just like its predecessor, Dragon's Lair II: Time Warp also bases all of its gameplay on ~timing~, the precision and timing in pressing the buttons (virtual, on the iPhone) or the four cardinal directions. Dirk only moves through the levels when we time the right button press, otherwise he crashes and dies, making us start the stage all over again. The action key (with the sword logo on the screen) is for everything else: attacking, mostly. The story, narrated very quickly through Italian subtitles, is very difficult to grasp because the gaze is always focused on the keys to press. Some sequences are so fast that we are not even aware of what is actually happening on the screen: if we want to pass certain phases, it is necessary to focus exclusively on the keyboard and press accurately and quickly when it lights up yellow. Dragon's Lair II: Time Warp includes both the original version of the game and the Director's Cut edition, with an alternate ending. The controls to play are decidedly precise and responsive, allowing you to perform actions more quickly and convincingly than in the past. It is also possible to choose whether to play with or without the on-screen visual guide. In the latter case, the difficulty will increase significantly making it particularly similar to the original arcade version, in which it was always necessary to have a very careful eye on what happened in the cartoon, rather than on the controls. The number of lives can also be set: 3, 5 or infinite. There is also the option to choose the ~Director's Cut~ version which contains an alternate ending. From a technical point of view, nothing to say: the transposition is perfect and the game enjoys amazing animations (it's an interactive cartoon) and orchestrated music. A note on the difficulty curve: with the classic commands (without seeing the on-screen aids) it is decidedly hardcore, while viewing them on the screen is very easy: perhaps the right balance is missing. The tested version is 1.0.0 Price: 2.39 App Store links", "date": "2011-07-21", "grade": "7.2"}