{"name": "Captain America: Il Super Soldato", "ref": "https://multiplayer.it/recensioni/91188-captain-america-il-super-soldato-scudo-stellato.html", "text": "Tested version: Nintendo WiiWe are in the middle of the Second World War. The puny little Steve Rogers, eager to serve his country, agrees to undergo an experiment that will transform him into the world's first and only super soldier. Armed with the indestructible adamantium and vibranium alloy shield, and dressed in the colors of the United States, the boy takes the code name of ~Captain America~ and with his deeds he inspires the allied troops, leading them to the final victory. Slightly ahead of the theatrical release of the film ~Captain America: The First Avenger~, the inevitable tie-in produced by SEGA arrives and entrusted, in the Wii version, to the care of High Voltage Software, the team known for having made The Conduit and Conduit 2 on the Nintendo console. The first impact with the game is not the best, basically due to some questionable design choices: the Captain America character has inexplicable balls instead of shoulders, and unfortunately it turns out from the artwork that these are not football-style protections but a bizarre interpretation of human anatomy. The character models, in general, are very bad and even have some legacies of the 32-bit console generation, i.e. the brick-shaped hands due to the small number of polygons used. To this we must also add a terribly poor set of animations, which does not involve normal walking and which therefore gives something comic to the scenes in which Cap or his friends move slowly, proceeding as if they were doing a light jog. Fortunately the rest of the graphics turn out to be better: the scenarios are often monothematic in terms of appearance and colours, but the arrangement of the elements inside them is functional for exploration, they flow in a very fluid way (apart from when the situation gets too tangled and note some slowdown) and even boast some sufficiently sharp textures. Likewise, the variety of enemies is very respectable: from simple soldiers to ~commanders~ capable of fomenting them, from armored enemies to ~brutes~ who charge with their heads down, passing through androids, agile swordswomen and finally the bosses, there is really a lot to fight and the dynamics that are created from time to time manage to be varied enough to keep the involvement and the challenge high. Captain you have your noble destiny in your eyes... From the first minutes, it is clear that the guys from High Voltage Software were inspired by the gameplay of Batman: Arkham Asylum as regards the combat system. And there is nothing wrong with that, on the contrary: punching the Nazi troops under the orders of the Red Skull, promptly pressing the Z button whenever an opponent wants to take us by surprise to hit him with a quick counterattack, turns out to be a practice very entertaining, undoubtedly one of the best things about this production. Let's not forget, however, that Captain America is most famous for his indestructible shield and his ability to throw it at enemies, which goes well with the Wii-mote's infrared pointer. So just hold down the C button on the Nunchuk to enter ~launch mode~, lock onto multiple targets by moving the reticle on the screen and release the button for the shield to ~bounce~ from one soldier to another, with all the consequences of the case . The same operation proves useful when there is a need to activate switches or destroy electronic workstations, actions that fall within the exploratory phase of Captain America: The Super Soldier, actually quite present within the gameplay. The locations are not limited to being the backdrop to our fights, in fact, but play a leading role between platform sections, puzzles and the search for hidden objects. Of course, it cannot be said that an excellent job has been done from all points of view: jumping from one handhold to another turns out to be a far too ~assisted~ procedure to cause any headaches, but the intention of the developers was probably to eliminate possible episodes of frustration. It goes much better with puzzles and hidden objects: the former revolve around the opening of doors thanks to the destruction of certain systems or the activation of sensors, often to be hit with the shield; the latter constitute a good reason to replay the nine levels that make up the adventure, in search of hidden passages and previously ignored areas, even if the unlockable rewards (character files, extra costumes and artwork) are not unforgettable. Stars sons. And some stripes. The picture described so far is that of an action game well done, featuring a varied and engaging combat system, as well as interesting exploration sections. In short, the approximately six hours needed to complete the game (which, of course, multiply if we decide to replay the levels in search of hidden objects and treasures), have proved to be pleasant, even if there were moments of perplexity. In the first place for the already mentioned design choices and for the technical realization in general, with some frankly unpresentable solutions even on a technically obsolete console such as the Wii can be considered. Secondly, for some quirks of the view, which can make certain situations very frustrating: when the scenario is ~narrow~, the camera tends to tilt downwards and in this way it becomes almost impossible to launch the shield, a maneuver that necessary to get the better of some opponents. We have already mentioned the platform sections: in an attempt to make them frustration-proof, the developers have oversimplified them, reducing them to a trivial pressing of the buttons. The plot, as per tradition for SEGA tie-ins, runs parallel to that of the film and indulges in numerous comic book references, introducing a large number of ~super villains~ in addition to the famous Red Skull. However, the development of the story appears very trivial, devoid of bite and spoiled by a dubbing in Italian that is in many ways unlistenable, the work of the usual professionals to whom, unfortunately, we end up referring more and more often.", "date": "2011-07-20", "grade": "S.V."}