{"name": "Enthusia Professional Racing", "ref": "https://multiplayer.it/recensioni/enthusia-professional-racing.html", "text": "What is certainly not lacking is the quantity, more than 200 cars to drive on over 50 circuits that are very varied and alternative to the usual and official routes. Yes, because in Enthusia there are no official circuits, except Tsukuba and the Nurburgring, but, a bit like in Project Gotham, the tracks are invented, thus resulting in either a great advantage or a great defect, depending on the player's taste. We sincerely appreciated the discreet imagination and creativity of Konami's designers. We will find ourselves competing in many races, designed to be as close to reality as possible, but talking about simulation means exaggerating a bit, the driving system certainly tries to be as simulative as possible, but unfortunately the control system does not help. nor does the idea of not having implemented virtual money to buy cars help. Cars are not bought, at most they are won or unlocked. This obviously prevents you from setting your sights on a particular car and winning as many races as possible to get it, almost everything is left to chance. A notable blow to the so-called simulation is certainly given by the sensation of speed, very low, especially if you love to use an external view, which absolutely fails to convince. When our vehicle loses speed, the situation is almost paradoxical, following a loss of traction, in fact, a blur effect will appear on our screens, however unable to make the scene credible. A small innovation brought by Enthusia is the Visual G System or VGS, which allows us to understand how the wheels of our car interact with the asphalt. Inertia is represented on our display by some yellow dots that move and, changing color, signal us in a more or less realistic way if we are losing control of the car. In fact, when we see them moving from one side to the other, this means that the car is about to skid, while if the icon turns red, it means that the omelette is now done and we have lost control. Another information provided by the VGS will allow us to grasp the movement of the car in relation to the track, through some yellow icons that scroll up and down, depending on acceleration and deceleration, and right and left to indicate the lateral push . Certainly a fairly intuitive system to demonstrate the physics of the car, but we do not fully understand its usefulness and indeed we advise you to deactivate it to increase your identification with the game. There are certainly all the classic modes of any self-respecting racing game: the time challenge, the free race, the one-on-one challenge, but the heart of the Konami game is the Enthusia Life mode. This mode, similar in many respects to the classic career, will keep the player glued for a very long time. The Enthusia Life is organized in weeks, every week we will be able to participate in new competitions that will be proposed to us. Some will be contests against multiple opponents while others will be duels against a single rival. Everything will revolve around the concept of challenge. Each race has a difficulty coefficient, based not only on the route but also on the rival cars and the car we will choose to race. The less performing our car will be compared to those of our opponents, the more points we will earn and therefore we will rise faster in the standings. Finally, after each victory, a sort of roulette will start which will assign the winner a car from those that participated in the race. Once won, it will obviously be possible to use it in the game. As mentioned before, there is no virtual money, but everything revolves around these concepts: challenge, skill and a pinch of luck. It is therefore obvious that it will be better to participate in races with less powerful cars, precisely in order to earn more points to unlock cars and events. Not a bad system, to avoid the player always running with the fastest vehicle. In Enthusia Life mode, clean driving is absolutely encouraged. In fact, for every small mistake, if we hit opponents or the guardrails of the slopes we will be penalized and Enthu points will be subtracted from us. Once all the Enthu points have been used up, we will have to stand still and not participate in any competition for that virtual week. Furthermore, at the end of each event, to calculate the points we have earned, the Enthu points we have lost will also be considered. So you absolutely have to drive cleanly and correctly. Certainly a choice that does Konami credit, however it must be said that it should have been better calibrated, in fact these penalties absolutely do not concern the other competitors, and therefore the opponents led by the A.I. may behave in an absolutely incorrect and aggressive manner without suffering the consequences. To conclude theour analysis we can only describe a further mode, a kind of mini-game, called Driving Revolution. In this challenge we will find ourselves driving any car, trying to hit the bright targets in front of us. That's all? No, absolutely not, the beauty is that these light indicators, a kind of small gate, will have to be crossed at a certain speed and they will change color to show us the right approach to the track. For example if we are too slow the color will be blue, if we are too fast it will be orange. A nice novelty designed to teach the player control of the vehicle on the asphalt. Speaking of controls, the system used by Enthusia is the canonical one which provides for the X key as a speed regulator and the square as a brake. Fortunately, it is also possible to use the right analog stick to accelerate and brake, making the driving experience more engaging, only that in this case this stick has been calibrated imperfectly, and in fact we will reach the maximum acceleration by bringing it only to half of his ~run~. We will therefore have to be absolutely sensitive to better control our fireball. Technically the work done by Konami is absolutely valuable, of course there is a bit of aliasing that annoys the scene but on the other hand the game engine is stable, the car models are very good, the atmospheric effects are well done and also the circuits, however fictitious, have their charms. As mentioned, more could have been done to improve the sensation of speed, but we can only appreciate the work done by Konami which has also managed to make loading absolutely rapid. To conclude, we just have to point out that the entire game has been localized in Italian. Enthusia Professional Racing had to come out earlier. Before what? But of Gran Turismo 4 of course. If the developers had speeded up the times a little, the Konami product would certainly have stood out more. Unfortunately right now it's difficult to even get close to a monster like GT4, of course Enthusia has its strengths, some defects, but in general it seemed to us a title deserving of a chance at least. Get involved in the Enthusia Life and you will not regret your purchase at all. Pros Technical Achievement The Enthusia Life mode Cons The control system It doesn't reach the heights of GT4 After the release of Gran Turismo 4, every racing game that appears on the horizon can only be compared to the masterpiece of Poliphony, this is also the case of Enthusia Professional Racing, the latest born from Konami. It is useless to go around it, Enthusia fails to reach the peaks of excellence of GT4, certainly if it had come out a few months earlier it would have managed to attract more attention than it did. However, before making definitive judgments, we can only thoroughly analyze this new racing game, it won't be GT but maybe it's getting close.", "date": "2005-06-10", "grade": null}