{"name": "Championship Manager 5 (Scudetto 5)", "ref": "https://multiplayer.it/recensioni/championship-manager-5-scudetto-5.html", "text": "Premise You may not realize it yet, but this review is a bit atypical. We have long tried to find a way to describe it, but Scudetto 5 (or Championship Manager 5 or CM5) is in such a particular situation that this seemed to us the only truly effective way. An old proverb has it that haste causes blind kittens to be born, and this is the case with CM5. Driven by the looming deadline of the major football leagues, Eidos and Beautiful Game Studios have released a product that can best be described as a beta: full of bugs and glitches. At the same time, however, the major problems are concentrated in areas that can be modified through the installation of patches (the first of which was released on the day of the game's release in England), and therefore can be corrected ~on the run~ . The official site from which to download the patches is cm5patch.com (be careful to download only the one of the version of the game you have purchased, because using the wrong ones crashes permanently). What goes and what doesn't... We will now go through all the main aspects of CM5 to see in detail what is currently working and what needs a fine-tuning. Interface: Although Eidos has kept the rights to the graphics package of CM03-04, the development team has preferred to start from scratch, with at least questionable results. The buttons with the main commands are scattered over three thin lines more than the cursor, one at the top, the second under the team name, and the last one at the bottom, forcing the player to look around for the option he needs the whole screen. As always, the players are characterized by a good number of skills, but this time it is possible to choose whether to see them displayed in twentieths as we have always been used to or in hundredths. Furthermore, the same list of skills has been changed compared to usual: it is now more precise thanks to the distinction between precision and power in shooting, heading and passing and the division into 4 categories, but suffers from the lack of fundamental skills such as free-kicks, penalties and technique, essential to adequately define a footballer. There are some flaws in the organization of the news, which are always focused on the most important leagues and not on the division in which you are playing. Database: Another unfortunate change of course: the collection of information to compile the database has been entrusted to professionals in the sector. Too bad that the Professional Football System has not been able to repeat what a handful of avid fans could do in years past, in fact the rosters of the teams are too often incorrect, players with the wrong names, duplicates or with the characteristics and roles pulled out to case. Furthermore, there are cases of companies, especially in the case of smaller clubs, which, even without carrying out any transfer market operations, find themselves in the red before the start of the championship. This happens because the salary of the players is calculated automatically based on their characteristics, while the team's budget is fixed in the database, so in the most risky situations you find yourself in the red without even realizing it. Look for the menu just for the whole screen in the long run it gets annoying Displaying the characteristics in cents has both advantages and disadvantages The database is completely devoid of historical information even on the most important samples; famous Market: The search for new talent has been improved, allowing you to indicate to the scouts also the role, as well as the country or the competition in which to search. However, the market itself doesn't really work: absurd transfers (Maldini always goes to Bayer), loans of excellent players and in absurd quantities (31 at once!). Furthermore, the management tends to block many transfers already accepted because they consider them beyond the financial capabilities of the club even when there are no apparent financial problems, or it happens that the money obtained from the sale of a player is not added at all to the transfer budget with no reason. It is now indispensable that the player and stafs search engine is fully customizable The most experienced players expensive at the moment... even if some values don't match the price. in heaven nor on the ground... The contract offer to the player, with all possible clauses What goes and what doesn't... Training: The first really good news is the training system. Instead of puzzling over to fill out every single exercise, we have a great workout creation form, where you just indicate how longor you want to devote to the various aspects of the game. The program then compiles a training table based on the data entered and our task is reduced to a few final adjustments before assigning it to the players. It is a pity however that CM5 is calibrated on the English Premiership which usually plays on Saturdays, and does not take into account the day on which other countries play. So the creation module always organizes a full session for Sunday, which we Italians (but also others) have to move manually so as not to lose it entirely due to the game. What is really wrong is the effect of training on the characteristics which, just like in FM2005, only fluctuate. Referring to the representation of the skills in cents, at the beginning those involved in the training grow progressively, up to 6-7 points, but then they drop by 13-14 (therefore up to -6, -7 compared to the starting score), and then go up again. The type of training set affects the type of skills and the amplitude of the swings. Strangely then, the characteristics listed are Temperament seem to be completely immune to any form of training. It is therefore extremely difficult to define whether a training program is effective or not, because you never know where in the swing you are (unless you check every day until you find the extremes for each characteristic and compare those, but it is crazy...). It always seems like everyone gets better...but only because they're better off. the decline is; sudden while progressive growth: as for a jo-jo The convenient workout creation module The training program after elaboration and some final adjustments What goes and what doesn't... Tactics: It is difficult to give an objective judgment on the tactical section, mainly due to the problems related to the 2D engine. In any case, the customization possibilities are rather scarce, limited only to the mentality, the intensity of the interventions, the type of passes and the areas in which to press. The possibility of indicating to each individual player the direction in which to carry out the passes was then implemented, but also in this case the defects of the 2D engine make it impossible to judge its effectiveness. Just to give you an idea of the effectiveness of the tactics, it seems that the most effective is the 4-0-6... no comment. 2D Engine: Imagine making all players drink 5 liters of a spirit of your choice before the game. Aside from the obvious health effects, you'll get an idea of what the 2D engine looks like - it looks like a drunken game. The players do everything but what they should: they are out of position, they don't care about the ball, they make suicidal back passes... The goalkeepers then can't make a catch, not even crying: when it's good they make a save in two stages, otherwise they have to a defender intervenes to sweep it away... only too often he kicks it directly on goal... So the goals end up being almost always the result of ridiculous and absurd mistakes, so much so that once the goalkeeper scored an own goal while trying to kicking the ball back from behind his own goal. In fact, the own goals turn out to be all too often the ~bomber~ of the opposing team. But that's not all: every now and then the ball bounces at absurd speeds, yellow and red cards abound and penalties are almost always missed. The white chalk arrows tell the players where to run, the red chalk ones where to send the ball... pity that using the red arrows you never score, better do without them... The statistics are updated in real time allowing us to always keep an eye on the performance of all players This needs to be explained: the Ancona striker shoots, my goalkeeper saves and, as always, doesn't keep the ball; my number 19 arrives and can't find anything better to do than shoot on the net... OWN GOAL! What goes and what doesn't... Audio: CM5 is muted, period. No music, just some audience effects worthy of the internal speaker of the case, which increases or decreases in volume and distorts badly when moving from one screen to another. In this respect, really pathetic... Speed: The other strong point of CM5. The engine is fast, furthermore, after pressing the 'continue' button, the player still has the possibility to navigate through all the options as he normally does, rechecking training sessions, having a look at the transfer market or adjusting tactics, all while the program takes the decisions of the rest of the football world and calculates the results. Comment version 5.0.1 (4.5 rating) The most energetic criticisms that were made of past editions of ChChampionship Manager were focused on the cumbersome training system and the extreme slowness of the game. Beautiful Games Studios has tried to satisfy these public requests when undertaking the development of CM5, and the results are to be commended, although still slightly shaky. However, good will and valid ideas collide with the actual realization of the game. To represent it with a metaphor: ~CM5 is full of bugs like a train of the FS is full of commuters at rush hour~. In the first 15 days of its UK release alone (March 18th) some 480 bug threads were opened on the BGS tech forum (although a good 15% mostly contained insults). The problems are scattered almost everywhere, from the 2D engine that looks like a pinball machine, to the absurd tactics, to the dispersive interface, to the disastrous database. Based on the experience with previous CMs (I'm mainly referring to CM4 which needed 5 patches before becoming playable), almost all of these problems can be reduced or even solved by installing the aforementioned patches. The database (as anyone who has played other managerial games knows) can be updated or entirely rewritten, the interface can be simplified with simple skins and the 2D engine and tactics variables can be corrected. What cannot be changed that much is the internal code and the way its results are presented to the player (to be clear, the FM2005 training system can never be fixed by a patch, so put an end to it) , but the internal engine is fast and seems to be one of the most successful aspects of CM5, so from this point of view we must be satisfied. In any case, however, after waiting so long for its release we would have preferred to wait a few more weeks to have a complete game in our hands, rather than this trickle of patches ... This analysis does not mean, however, that the game itself is valid: it is POTENTIALLY valid, but at the present time (patch 5.0.1) it is a semi-unplayable half-disaster, and as such insufficient. However, it is said that the next patches can improve it even to the point of making it a worthy competitor to FM2005 and, even if it were not, the next chapter in the series certainly will be. Update  patch 5.0.2 As expected, after the release of the second patch we tested CM5 again to see if the much-touted improvements had been done for real. Below we'll only look at the changes made as a result of the patch, not the things we've already covered. The major bugs, those that prevented it from launching, caused Windows to hang or crashed the game terminally, have been removed and many of the gameplay glitches have been reduced. The interface changes are minimal: a shortcut to advance the game and the possibility to choose the training program directly from the player characteristics screen. Instead, the news has improved, which now reports news regarding your division, even if you are continually followed by an excessive number of completely useless player offers from their managers. The database remains a question mark: if the inaccuracies in the minor divisions (however often they are often gross errors) can be forgiven, the same is not true for Serie A. Often the information of the players of the teams involved in European competitions is approximate . We find players in the first team who are actually part of the spring, for an average increase of a dozen players compared to the real squad and with obvious repercussions on the company's economy: many more salaries to pay. Even less understandable is the fact that these out of place players almost always have better characteristics than the starters. The chaos in the database could be one of the causes of the incomprehensible attitude of artificial intelligence in the market. The evaluation of the players remains a mystery: players with very high characteristics valued as a pittance who accept the C2 without a word, other mediocre ones who are exchanged for millions. Other problems in the market arise in the case of the so-called ~technical counterpart~. If players are exchanged, it is essential that everyone accepts, which usually does not happen, and there is no way either to understand which of our players would be interested in the transfer, or to understand which ones, if any, the other party would like. So no actual bargaining: just go and hope (or, more often, save, try and reload until you find the deal that satisfies t", "date": "2005-06-09", "grade": null}