{"name": "Senza mai voltarsi", "ref": "https://multiplayer.it/recensioni/90445-1-bit-ninja-senza-mai-voltarsi.html", "text": "From blatantly retro graphics to coins to collect, from power-ups that make you invulnerable to enemies similar to Zelda's Octorocs or Super Mario's Goombas, passing through the huge poles on which to jump at the end of a level. 1-bit Ninja, the new platformer from the British developer Ben Hopkins, is not limited to a few sporadic references to be fed to the nostalgic. Rather it can be seen as a huge tribute to the times gone by, to the never-waning beauty of pixel art and the excitement of listening to chiptune music, to the immediacy of controls and the severity of classic platformers. Ben, who prefers to be called Kode80 online, started programming at the age of 14, growing up on bread and GameBoy and evidently developing an antipathy towards the continuous simplification of games. Hate that took shape in the making of 1-bit Ninja, what is on balance one of the most difficult and infamous platformers currently on the App Store. Super Ninja Bros? In developing the game, the author had two main objectives, the first of which was to create an aesthetic that immediately brought to mind the games of the past and that replicated the feeling of playing some of the portable consoles on the iPhone more historic. The result is a very successful mix between Game&Watch and GameBoy, with microscopic sprites that detach from the design of the scenario. Stylistically nothing can be said about it: Ben Hopkins has done an excellent job both in making the game pleasant both in graphics and in sound. The author's other bet was to create a side-scrolling platformer designed to be enjoyed via touch screen, but whose controls ~don't suck~ like in most similar games on the iPhone and iPod Touch. To do this, he thus proposed a decidedly unconventional solution, limiting the player's interaction to just two inputs: holding down the bottom left corner of the screen moves the character from left to right, while a tap on the opposite side of the screen allows you to jump. The smartest of you will have already guessed where the catch is. In 1-bit Ninja it is completely impossible to go back, which means being forced to repeat each level from the beginning if by chance you have missed one of the hidden objects: each scenario contains five special coins that you have to collect to get more points and unlock additional options, but being able to take them all becomes an almost titanic undertaking as you continue in the game. Furthermore, while not reaching levels of frustration on a par with The Impossible Game, the player finds himself having to make millimeter jumps, since collisions are calculated to the pixel and touching an opponent means having to start the entire level from the beginning. The biggest problem is in fact the impossibility of being able to adjust the trajectory while in flight, or to move away from the edge of a platform before a jump. Curses abound, thumbs consume the screen, and in the meantime we find ourselves repeating the same point dozens and dozens of times in the hope that this is the right time. Another interesting feature is represented by the possibility of switching from a two-dimensional to a 3D view: simply by sliding a finger on the upper part of the touch screen it is possible to alter the point of view, allowing to discover new passages and secret paths in a very similar way to as seen in Super Paper Mario. Too bad that in this case the camera returns to its original position once the finger is released, thus forcing improbable twisting of the fingers or continuous interruptions to look for new ways along the way. Barring a few moments when it's needed to collect hidden coins, switching to the 3D view has no real use other than being a mere treat for the eyes. However, the very strict time limit represents an excellent incentive not to waste time, transforming many sessions into real speedruns, with the player trying to make each jump perfectly to reach the finish line in the shortest possible time. The tested version is 1.01 Price: 1.59 App Store links", "date": "2011-07-01", "grade": "7.3"}