{"name": "Ducati Challenge", "ref": "https://multiplayer.it/recensioni/90435-ducati-challenge-il-fascino-delle-rosse-a-due-ruote.html", "text": "There are very few global motor brands able to afford dedicated monographs, exhibitions or even video games; apart from the case of Ferrari, universally recognized as the most famous car brand in the world and already rich in numerous exclusive titles, in the two-wheeler field this role can only be covered by another large Italian company, Ducati from Bologna. Founded in 1926, the two-wheeled red house has recently sponsored a series of videogame productions dedicated to enthusiasts, called Ducati Challenge and intended for numerous mobile platforms; the fascinating Apple-Ducati union is now taking shape with the version for the very popular iOS devices, synonymous with the most extreme mobile gaming. A Ducati for everyone Ducati Challenge, it should be pointed out immediately, is presented as a tout-court tribute to the famous Italian company, therefore without any type of officiality linked to the famous MotoGP or Superbike championships; a sort of luxury showcase (complete with personalized photo galleries) for the stupendous bikes present, which will be able to dart freely through completely invented circuits and competitions. In addition to the classic Sfida Veloce, therefore, it is the Championship that represents the true heart of the gameplay: divided into three categories (easy, medium and difficult), it consists of a series of circuits to be tackled in succession, then unlocking them for the other modes; as per tradition, each placing is assigned a score, the sum of which will give the final result. There are only six motorcycle models that can be selected (available gradually by accumulating victories), but they represent the best available in Ducati production: Monster 1100 EVO, Hypermotard 1100 EVO SP, Diavel Carbon, Multistrada 1200 S, Streetfighter S and Superbike 1198 SP. However, the rather limited number of vehicles allowed a rather credible and personalized rendering of behavior for each model, starting with the different speeds and accelerations and ending with the weight and cornering reactions; however, all this work is partially diminished by the animations of the pilot, evidently less accurate than those of the vehicle. In fact, during braking and subsequent accelerations, the torso seems to move almost jerkily, a phenomenon present (but less evident) also when cornering; the worst, however, can be found in falls, with the poor victim forced to make almost interstellar flights (probably caused by a bug) or to roll on the asphalt while always remaining (and unrealistically) with motionless limbs, stationary in the normal driving position on a motorcycle. Continuing to talk about the crashes, despite various attempts we were unable to make the bike slide, neither with an excessive inclination nor passing on the dirt on the side of the track; the only way to end up on the ground is therefore to hit another driver or collide at speed with the barriers. Trying to ignore these blunders and concentrating instead on actual riding, it is still possible to take great satisfaction in Ducati Challenge: in fact, to obtain significant results, the setting of the trajectories must be precise and the braking time perfect, otherwise you will leave the track and the inevitable disastrous fall; thanks to the aids needed to familiarize yourself with the vehicles, the impact on driving realism is mitigated and decidedly less difficult. However, once you become familiar with the vehicle and disable all types of electronics, the challenge will become more difficult and the victories much more rewarding. A great advantage of Digital Tales production is undoubtedly its perfect technical scalability: thanks to the graphic quality settings present in the settings, it is possible to adapt the game to your Apple device even if it is now dated; the system actually disables effects and anti-aliasing for previous generation devices, restoring them to the maximum on the new iPhones and iPads (for the HD version). This solution, simple but effective, fully satisfies because in addition to making the title universal in the true sense of the word, it helps to soften that feeling of psudo-inferiority that inevitably affects owners of older products (especially if branded with the Bitten Apple). Going into more detail, the work on the visual sector turns out to be more than valid, both in terms of cleanliness and definition, a pity only for some sporadic drop in framerate. Excellent sound effects (to be enjoyed with headphones), with the noises of the individual models sampled live and reproposed; Finally, the support for Game Center is worth noting, even without online mode, with multiplayer limited to local wifi connection for up to 4 players. The tested version is 1.1 Price: 2.99 App Store links", "date": "2011-06-30", "grade": "8.0"}