{"name": "Remake d'autore sul Live Arcade", "ref": "https://multiplayer.it/recensioni/90210-bangai-o-hd-missile-fury-remake-dautore-sul-live-arcade.html", "text": "The game is available for download via Xbox LiveTreasure returns proposing one of its creatures from the late 90s, that very original and colorful Bakuretsu Muteki Bangaioh which appeared for the first time in a super limited edition on Nintendo 64 and then arrived ~to the general public~ thanks Sega Dreamcast. Going a bit against the tide of their own philosophy which sees them -almost- never engaged in sequels or conversions, this time Treasure has dedicated itself to a porting to Xbox Live Arcade, thus favoring this distribution channel rather than the traditional ones, in which, perhaps , today they would be a bit (sadly) fish out of water. In fact, we recall that the Japanese team, famous for working its products almost in an ~artisanal~ way, is an independent software house that can count on very few employees and limited resources. Bangai-o: Missile Fury, as the digital delivery version has been renamed, is a high definition port that includes some new features and improvements compared to the original. Needless to mention the remastered graphics that honor modern HD televisions, but in any case a great job was done given the original amount of sprites and textures on the screen, a real hellish bedlam of enemies and explosions. Bangai-o: Missile Fury is essentially a multi-directional shooter in which you can move freely on both the horizontal and vertical axes, with the possibility of also going back. Every Treasure fan will already know it: the gameplay is obviously intense and challenging, but at the same time intelligent and never ~rude~, i.e. random, bad, cunning. Treasure's prerogative is always to reward skill and the right dexterity, while putting it to the test with decidedly superior level articulation exercises. The difficulty curve, however, starts soft this time, allowing us to learn how to use the new controls with the double stick, very comfortable and more modern than the original ones. Bangai-o: Missile Fury is certainly not a shooter that can be framed in a precise and standard context, but it represents an original game even today. The controlled mach, which can move in any direction, is capable of double firepower and moves within ever-changing levels and with a very inspired design. Now a classic left-right scheme, then another vertical one, finally Geometry Wars-style closed arenas (which actually came years and years later, though!). In addition to the standard weapons, deadly and choreographed ~smart bombs~ are unlocked during the action. It starts from the homing missiles passing through the multi-directional ones, the laser, explosive napalm, breakshot to destroy the most tenacious defenses, rapid fire capable of devastating combos. Some specific missions require the use of one or another weapon to complete, and it is up to the player's intelligence to understand ~how~ and why to use a particular one. Xbox 360 goals Like every game available on the Live Arcade, this excellent Bangai-o: Missile Fury also offers the canonical 200 points divided into 12 objectives. Half are obtained very easily by simply advancing through the levels of the game, while the rest by specific actions such as editing a level, firing the millionth missile or making an attack at maximum level. Fun, and all within reach. A treasure trove of software houses Each mission of Bangai-o: Missile Fury can be played with a friend via Xbox Live or in local co-op on the same Xbox 360, but above all we are given the possibility, through a good editor, to create new levels and share them via the internet, a factor that profoundly affects the longevity of the stock. Bangai-o: Missile Fury is often confusing and ~tamarro~, crammed with sprites and objects on the screen, so much so that on many occasions you find yourself wondering what the hell you have to do to survive such massive attacks. In this sense, the Treasure game is not as punishing as some of its old shooters that functioned almost like ~trial and error~. Bangai-o: Missile Fury is more forgiving in collisions and it is generally possible to overcome its levels after a few game overs at most. Speaking instead of the purely technical and visual aspect, we are faced with an excellent game but which obviously drags along the many years it has behind it, even with a well-executed HD conversion. Some sporadic slowdown would have been easily avoidable, but it's there. The music and sound effects are suitable for the frenetic and fast gameplay context, but this time they don't shine for originality or a particularly high quality of the compositions and samples: they simply do their duty without infamy and without praise. We are sure che any old fan of Bangai-o, Treasure or shooters in general doesn't need this review to download (or not download) this game: they already have. Instead, the message is addressed to all the others who didn't know it before or have never heard of Treasure, that software house ~treasure~: simply download the trial version, give it a chance, try it and we're sure you won't be disappointed. disappointed.", "date": "2011-06-28", "grade": "9.0"}