{"name": "Affari di famiglia", "ref": "https://multiplayer.it/recensioni/90279-f3ar-affari-di-famiglia.html", "text": "Version tested: Xbox 360 Prototype of the perfect soldier, so much so that he doesn't even have a real name, Point Man is a genetically modified special agent, used to speaking little and following the orders given by the Armacham organization. Even when the directives require him to kill the one who turns out to be his brother, Paxton Fettel, in turn a superhuman being, endowed with terrible psychic powers and a deviant, evil personality, which led him to mercilessly massacre a large number of innocent people. Fettel is killed by Point Man at the end of the first F.E.A.R., with a bullet in the forehead, but his powers somehow allow him to survive, albeit on a spiritual level. The two brothers therefore meet again and are forced to form a bizarre alliance to prevent their worthy mother, the frightening Alma, from giving birth to a new and terrible monstrosity. Synthesized thus, the plot of F.3.A.R. it may seem at least intricate, but in reality the events fit perfectly into what is the narrative structure of a trilogy, which in the second episode saw us take on the role of a Delta Force agent, Michael Becket, and ended with the union (far from consensual) between the latter and Alma, with the consequent conception of the much feared ~child~ who could now destroy the world. Imprisoned by the Armacham, Point Man manages to free himself thanks to the ~supernatural~ help of his brother and reconnects with Jin Sun-Kwon, his partner in the F.E.A.R. (acronym of First Encounter Assault Recon) as well as the only person who can help him accomplish his mission. Modern Warfear The gameplay of F.3.A.R. it immediately reveals itself to be solid, frenetic and spectacular, with weapon management and a feeling of the same that in many ways recall Modern Warfare. The configuration of the controls, almost identical to that adopted by the Activision series, also contributes to fueling this sensation: to run you have to press the left analog stick on its axis, while the same action on the right stick translates into a rapid slash with the dagger; the A button is used to jump, B to crouch, X to reload and the right backbone RB to throw the equipped grenade (there are three different types: fragmentation, smoke or EMP). The only big difference lies in the use of the Y button, in this case deputy for activating the very important bullet time, where the left backbone LB instead allows us to switch from the main to the secondary weapon. We were talking about bullet time: with the passage of time and/or by scoring a series of kills, Point Man can load a circular indicator (cleverly integrated into the aiming reticle) which allows him to ~slow down time~ when necessary, thus to score comfortable headshots or hit the weak points of the more resistant opponents (see for example the mechs, but also the numerous bosses that we will find ourselves facing during the game). It is a fundamental element of the gameplay of F.3.A.R., a trait that immediately becomes distinctive and which emphasizes the spectacular nature of a large number of situations, especially when there are many enemies and perhaps even some enhanced soldiers are hiding among them. For the realization of this third episode of the saga produced by Warner Bros. Interactive Entertainment, illustrious names of horror cinematography have been recruited: on the one hand Steve Niles, author among other things of ~Thirty Days of Darkness~, who dealt with the film script; on the other John Carpenter, a cult director who has shot horror films such as ~Halloween~, ~The Thing~, ~They Live~ as well as the captivating ~Big Trouble in Chinatown~, and who has provided the developers with his advice to make the better the ~terror~ during the cutscenes. Now, if the plot of F.3.A.R. all in all it turns out to be exciting and in some ways ~sick~, especially as regards the background concerning the ~guinea pig~ childhood of Point Man and his brother Paxton, it certainly cannot be said that the game instills fear or creates that tension typical of products like Dead Space, Condemned or even the first BioShock. Perhaps the implementation of the bullet time tends to give us a certain security, given that any enemy will have to ~slow down~ when we resort to it and we can easily spread his buttocks, however it is difficult to blame this feature entirely for the case. In fact, the feeling of feeling really in danger derives more from being in seemingly hopeless situations, situations that do not occur very often in the eight chapters that make up the single player campaign. There's definitely a balance between challenging firefights withthe soldiers, the hordes of ~zombies~ that run against us (sometimes ready to explode), the phases in which we get behind the wheel of powerful mechs and those, terrible, in which there are supernatural beasts that ~come out of the fucking walls~ . However, the shock of a frightening enemy that suddenly appears in front of us is missing, of a door that opens by itself as we approach and reveals a monster; in short, sequences that draw on the fundamental ~rules~ of any self-respecting horror film. Strange indeed that Carpenter has failed to provide an effective contribution in these situations. Boom! Headshots! So putting fear aside, indeed one of the prerogatives of F.3.A.R., what remains is in any case a very well made and thick FPS, with a respectable arsenal and an excellent sensation of impact from the weapons, part of very rare cases. The game uses an ambush system similar to that seen in Killzone 3, perhaps even better: just press the B button near a crate or a low wall for our character to take cover there, with the possibility then of leaning out not only from the 'high but also to the side to score a few gusts. The solution adopted works quite well and even allows us to remain ~hooked~ to a relatively large object, such as a counter, following its corners to shelter, for example, from the powerful blows of a mech. You can ~unhook~ from cover simply by moving, but the operation is much more effective if we press the B button again, especially if we are in a hurry to leave cover to move elsewhere. Clearly, the enemies also make use of the objects of the scenario to lurk, and their behavioral routines are average in terms of the complexity of the artificial intelligence: they avoid leaning out at regular intervals, sometimes they just take out their weapon to fire a few shots or they even send companions (generally armored ones) to scout ahead, to track us down. Then there are the ~bosses~, i.e. the enhanced enemies, which we meet in the first instance in a single ~example~ but which in the final stages of the campaign are also offered to us in pairs: from the ~electric sniper~ to the mastodon capable of creating space to get behind us, finally passing through the various types of mechs, helicopters, armored vehicles and demonic creatures that gather around Alma. The variety is therefore very good, but the discussion should be extended to the overall direction of the game, which as already mentioned manages to create a series of truly spectacular and engaging sequences, of medium difficulty (even at the ~normal~ difficulty level there are points where happen to die several times) and, in fact, well diversified from each other. In addition, once the single player campaign in the role of Point Man is completed, we will be able to start it all over again, this time controlling his terrible brother, Paxton Fettel. This is a very interesting feature, because the character has incredible abilities (among other things, he can take possession of his opponents' bodies) and the situations experienced from his point of view often appear different, as well as the ending that we will get at the end of the adventure. Xbox 360 goals F.3.A.R. allows you to obtain the canonical 1000G through the achievement of more or less complex Objectives, many of which are hidden. The more modest rewards, from 5, 10 and 15G, are obtained by successfully completing particular sequences: the first multiple kill in slow motion, the possession of all types of enemies in multiplayer modes in which you control ~ghosts~, the achievement of a certain score and completion of the first few levels. The more substantial Objectives, from 20 to 50G, are unlocked by completing all the challenges, totaling high scores and completing the single player campaign, while for the only 100G Objective you have to finish the game on the highest difficulty level. Fear makes nine The duration of the campaign, which we finished in an interval between five and six hours, must therefore be multiplied by two. But that's not all, because it is possible to tackle the adventure together with a friend, both on the same console in split-screen and online, and there are four multiplayer modes that are decidedly different from the usual, with three dedicated maps for each. The first, Contractions, takes up the dynamics of Call of Duty's Zombie mode in many ways: you find yourself barricaded inside a building and you have to fend off increasingly numerous and cunning groups of enemies, with the possibility of building or repairing the axes that close the entrances, as well as access to more powerful weapons as you resist. The second mode, Soul King, sees four players affrot in the form of ~spectres~ and therefore able, like Paxton Fettel, to take possession of the simple soldiers to use their body until it is destroyed. Soul Survivor works in the same way, but only one of the four players, chosen randomly, takes on the role of the ~spectre~ and the others must try in every way to eliminate it, as well as to prevent it from collecting the souls of the killed opponents. Finally there is the F**king Run! mode, which works on a cooperative basis and is certainly the most frenetic, given that our team must make their way through hordes of enemies while a murderous fog advances inexorably in the background. Ah, here you can see Carpenter's hand! Moving on to a purely technical discourse, in some situations F.3.A.R. unfortunately it appears dated, even if the overall picture is certainly good. Interactivity with the scenery is poor (albeit with some exceptions), some effects leave something to be desired and the complexity of the polygonal models cannot compete with that of the most famous productions. The level design often smells of ~already seen~, but it is perfectly functional to the gameplay and in certain cases it boasts an at least interesting direction. Too bad for the sound, which in a horror game should take the lion's share and which instead does not stand out as much as it should. The Italian dubbing is discreet as regards the acting level, but the comparison with the original is merciless (especially Fettel's voice) and furthermore there are several gross errors in the adaptation (see the ~voi~ instead of ~tu ~).", "date": "2011-06-25", "grade": "8.0"}