{"name": "Le mille e una sfida", "ref": "https://multiplayer.it/recensioni/90227-1000-heroz-le-mille-e-una-sfida.html", "text": "Whoever says that games on the App Store cost too much compared to what they are worth in terms of ideas and depth in many cases is telling the truth, but at the price of a truly unfair generalization. On Apple's digital delivery, one can also find ideas so fresh as to be worth the outlay (small, but anyhow) even if only for the desire to contribute to an ingenious idea, supporting it economically and morally although then, perhaps, one does not you don't even find yourself spending much time on it. 1000 Heroz, in its smallness and simplicity, offers a couple of potentially disruptive insights for the structure of the videogame market, which if exploited accompanied by a more important play structure would represent new and precious sap for the market. The 79 cents required to download the game doesn't deliver us an already defined package of levels, a product packaged and finalized before arriving on the App Store. Instead, let's buy a game in progress, to all intents and purposes: the main feature of this RedLynx production is the continuous support promised by the developers, lasting a good 1000 days. For each of these days there will be a new level that will be automatically released every 24 hours, accompanied by a new online challenge. It is possible to replay previously released levels, but 1000 Heroz pushes us to take part in the live challenge, within the 24 hours in which it is active and online, renewing the play offer every day and the online game against the world . This fits perfectly with the essence of the iPhone: on the Apple phone it is difficult to set oneself in the spirit of the long and demanding classic videogame challenges, but the need to often handle the device, which accompanies us from day to day, makes a short passage natural day on a game that offers a different challenge every 24 hours, until it becomes a sort of daily habit. A history of runners We come to the gameplay. The game structure of 1000 Heroz could be combined with that of the now abused endless runner, but the comparison does not quite fit. First of all, the running in the game is by no means ~endless~, rather it is based precisely on the performance recorded within a short course and on the continuous improvement of this. We therefore find ourselves having a runner run along a short route - which changes every day - more or less bumpy, full of jumps, ditches, obstacles and bouncy platforms, trying to cover the short distance in the shortest possible time. There is a minimum of physics behind the race, which - albeit through rather primitive and artificial algorithms - determines an acceleration in the downhill stretches but also sudden braking in correspondence with obstacles, as well as diversified reactions depending on the angle of incidence with which you jump onto the launch pads. All this leads to quantifying the points in which to perform the jumps and the duration of these with millimeter precision (variable according to the pressure of the corresponding key), thus progressively improving the performance in each path, although the mechanics of the movements are not so intuitive and harmonious as, for example, in Tiny Wings. It is a very simple structure since it essentially requires the pressure of two keys with the right timing and on the other hand the 1000 heralded levels do not offer substantial differences in terms of gaming experience, essentially proposing the same elements in different order, albeit characterized by different and different protagonists, moreover inspired by different historical eras placed ~progressively~ starting from prehistory. There are three different medals that can be won by returning within certain time slots and there are also secret objects to unlock, which however have practically no value in playful terms except as a symbolic prize, but above all there is the comparison constant, direct, with the community of online players who populate the rankings every day with their respective times and who probably represent the greatest push to dedicate themselves day by day to 1000 Heroz. The tested version is 1.1 Price: 0.79 App Store links", "date": "2011-06-24", "grade": "6.6"}