{"name": "LEGO Star Wars", "ref": "https://multiplayer.it/recensioni/lego-star-wars.html", "text": "Lego Ergo Sum Spanning the entire course of Lucas' second trilogy, Lego Star Wars offers the user the possibility of tackling scenarios inspired by the most significant and spectacular sequences of episodes I, II and III. The title Traveller's Tales therefore presents itself as a sort of compendium of the adventures of Obi Wan and his companions, obviously filtered through the Lego ~philosophy~. So here's how already after a few minutes of play it is easy to classify Lego Star Wars in the category of products intended mainly for a young audience, thanks above all to an extremely simple and immediately assimilable game structure. The adventure begins inside a space tavern, where it is possible to select the stage to be tackled as well as view the extra purchase menu, which, as we will see, is of great importance within the Traveller's Tales action game. Introduced by highly enjoyable cut-scenes, the various levels of Lego Star Wars put the user at the controls of a single character, always supported by a companion or several allies, depending on the situation. In most cases, the stages offer a balanced mix of action and puzzle, all in the name of simplicity: the control system is eloquent from this point of view, which liquidates the practice by making use of essentially only four keys (attack, jump , special power and character change). Despite this, Lego Star Wars still manages to offer good quality gameplay, decidedly undemanding for any player with a minimum of experience behind them but still intelligent, especially in the division of skills between the various characters. Space constructions The strong point of the Eidos production is in fact the presence of a vast series of protagonists, each characterized by a peculiar special ability. Then there are the Jedi, armed with light sabers and able to double jump and use the Force to move objects or enemies; the droids, devoid of offensive powers but able to fly for short distances and to open certain doors; finally, other characteristic characters, with still different characteristics (for example, Jar Jar Binks can take dizzying leaps while Queen Padme Amidala is equipped with a Blaster and a Grappling Hook). Lego Star Wars therefore offers rather simple fights and puzzle solving phases, however enriching the overall experience with a whole series of elements of the various scenarios that can be activated or reached only by certain characters, thus increasing the replay value. As we said, however, an important part of the Traveller's Tales title is covered by the extras, which can be unlocked by spending the currency available in the stages: the list of bonuses includes not only playable characters, but also a whole series of goodies that can be activated to modify (albeit minimally ) the look of the game. Already valid up to this point, Lego Star Wars continues its positive path by offering enjoyable boss battles, vehicle sections and even a co-operative mode for two players, with the possibility for the second user to jump in and out of the game at any time. As in the vast majority of products aimed at younger people, however, Lego Star Wars shows its side in terms of longevity and level of difficulty, both quite low. Finally, from a graphic point of view, the Eidos product turns out to be delightful, with clean cosmetics capable of best representing characters and scenarios in pure Lego style. There is also no shortage of well-made special effects and settings teeming with characters, capable of making some stages of the game literally spectacular. Comment Despite the bizarre premises, Lego Star Wars is a more than valid action game, simple in form but well done in its contents, which can easily represent a good purchase for younger fans of the last trilogy. Graphically impeccable and fun at the right point, the Traveller's Tales title has qualities that can make it attractive even to more adult players, provided they are able to turn a blind eye to a basic gameplay and an extremely low level of difficulty. We conclude with the differences between the two PS2 and Xbox versions, really minimal if we exclude some bugs that can only be found on the Microsoft console. Pros: Graphically delicious Simple but well-crafted gameplay Great variety of characters and scenarios Cons: Low difficulty level and longevity Suitable mainly for young audiences Number one protagonist of the childhood games of millions of people, Lego bricks have repeatedly tried to extend their success on the videogame territory, actually obtaining mediocre results to say the least. mspotted by unsuitable game structures or simply by bad programming, the Lego-branded titles have never proved capable of honoring the historic name they bore. It is therefore inevitable that the combination at the base of Lego Star Wars could only arouse some doubts. And instead...", "date": "2005-06-07", "grade": null}