{"name": "Dead Cells: The Queen and the Sea", "ref": "https://multiplayer.it/recensioni/dead-cells-the-queen-and-the-sea-recensione.html", "text": "In the world of video games, when you invent a sub-genre and sell millions of copies, you can follow two paths: stand out and immediately try to do something new or take advantage of the work already done and continue to build new content on it, expanding your audience and continuing to monetize on the old one. As we will see in the review of Dead Cells: The Queen and the Sea, the French development studio Motion Twin has chosen this second path for the new DLC. The new contents The new content introduced by Dead Cells: The Queen and the Sea is in line with that of previous DLCs The Queen and the Sea is an expansion in line with the previous ones of Dead Cells, at least in terms of content: two new levels, some not particularly original enemies, a handful of new objects and a new boss. The main source of inspiration is Lovecraft, a rather problematic choice, as we shall see, even if not compromising. In general, the additions to the mythology that forms the background to the gameplay do not give much to what is already known, although they are focused on the protagonist's past. The two levels are located in the final part of the game, alternatives to the biomes High Peak Castle, Derelict Distillery and Throne Room, and are therefore very difficult. The first, Haunted Shipwreck, takes place inside a ship full of sea creatures and undead. It is not particularly original in its structure, which develops in several directions, even if its existence makes sense of the throwing shark, one of the new weapons (perhaps the most original). The second level is more interesting. The Lighthouse, so called, is in fact developed completely vertically, in an even more extreme way than the level of the Clock Tower. The challenge offered is very high, but what is remarkable is above all the originality of the structure, which focuses precisely on the high / low gameplay, making some weapons much more useful than others and taking certain situations to the extreme, however, already experienced in the previous levels. The goal is of course to reach the top to turn on the light and thus escape from the island. Here, in the La Corona scenario, the DLC boss will be faced, of which we won't tell you anything so as not to spoil the surprise. Levels and weapons aside, with the latter being obtained by killing enemies as usual, The Queen and the Sea adds some new costumes, to the delight of lovers of aesthetics, and little else. Creative fatigue Dead Cells: The Queen and the Sea: An artwork of the DLC Dead Cells: The Queen and the Sea is overall a good DLC and, for what it costs, offers a fair amount of new content, as you can read. The problem, from our point of view, is another one, which emerges from many of the choices made by Motion Twin. It just seems that the development team is in a phase of strong creative fatigue. In fact, the latest updates of Dead Cells, even the free ones, are a way to continue to exploit the commercial success of the title, but they are not very organic to what was the base game. They are additions of color, let's call them that, forcibly glued to the original mythology. Let's just take this DLC. The source of inspiration is, as already mentioned, Lovecraft, but the link with the rest of the game is very tenuous. It is clear that it was designed by taking the imagery of a figure much loved by the reference public of Dead Cells, adapting it as needed. Not that before the game lacked citations from the author of Providence, but in this case the effort to build references is even more evident, as if, no longer knowing what to propose, you chose to fish with both hands from a well-known and loved source just to make numbers. If we want, it is a bit what happened with the latest expansions of The Binding of Isaac, full of new contents but which made the drift with respect to the initial project more and more evident. This is not to say that Dead Cells: The Queen and the Sea is to be despised. Indeed, it is probable that fans of the game are waiting for nothing else, so as to be able to extend the experience for a few more hours. Except that the final effect is that of the classic diluted broth: it's still good, but the difference is starting to feel. The new enemies don't have particularly original attack patterns The bottom line is that Dead Cells: The Queen and the Sea is definitely worth the little money it costs. The two new levels are well done, although not particularly original compared to the canons of the series, and the fight with the new boss is quite elaborate. Of course, as pointed out in the article, we are faced with a DLC that shows a certain creative fatigue, but we are still on the tolerable side. So if you can't live withoutDead Cells, we definitely recommend you to try it.", "date": "2022-01-07", "grade": null}