{"name": "Pazza", "ref": "https://multiplayer.it/recensioni/90126-touchgrind-bmx-pazza-pazza-bmx.html", "text": "Among the very first software houses to support iPhone with its Labyrinth and iPint apps, Illusion Labs experienced its definitive consecration with Touchgrind, an innovative title that allowed executions to be performed on a skateboard using an ingenious multi-touch control system. It was therefore inevitable that the developers would return to such a fortunate path, and so here comes Touchgrind BMX which, as the title suggests, shifts the focus to bicycles while maintaining tricks as the primary objective of the playful experience. Holy patience Just like its predecessor, Touchgrind BMX requires the user to traverse a variety of stages filled with ramps and platforms and score as many points as possible through tricks, all while exploiting a control system that assumes a good level of coordination between the index finger and middle finger of the hand. By placing the first at the height of the pedals, the acceleration of the bicycle is therefore managed, while the second must be applied to the handlebars to be able to steer, but things get a little more complicated when it comes to evolutions: with a side swipe of one o of the other phalanx, rotations of the front or rear of the BMX are performed respectively, while sliding both fingers upwards or downwards produces spectacular front or backflips. The fact is that the game rewards only complex tricks resulting from combinations of the practices just described with more points, an activity that is anything but simple and which can lead to considerable frustration due to the numerous falls that are remedied along the way. Furthermore, if we consider that repeating the same trick causes a reduction in the score associated with it, the need to constantly vary one's repertoire in the few seconds of pause between one ramp and the next is added to the difficulty in itself. The peculiar method of progression in the various levels adds further fuel to the fire: in fact, to unlock new stages and bicycle models, it is necessary to satisfy a series of objectives that can oscillate between the achievement of a certain number of points and the execution of a distinctive movement or stunt at certain points in the scenario. A mechanism that forces the not exactly exciting repetition of the same segment many times to accumulate a sufficient number of medals to make new material available. In short, Touchgrind BMX is not a title that is easily loved, but which rewards the perseverance of the most patient: being able to perform complex tricks even though your fingers occupy most of the screen and the camera does its best to confuse the ideas gives a certain satisfaction, and the advanced levels offer stimulating challenges and graphically impressive glimpses. From this point of view, nothing can really be criticized for the Illusion Labs product: Touchgrind BMX sports a very detailed and clean entirely polygonal cosmetic, which offers its best sides during the replays, which for the cuts of shots wink at racing most famous games. The sound is decidedly less brilliant, with scarce and little present music and good sound effects but reduced to a minimum wage. The tested version is 1.2.2 Price: 3.99 App Store links", "date": "2011-06-22", "grade": "7.0"}