{"name": "Tattica estrema", "ref": "https://multiplayer.it/recensioni/89800-frozen-synapse-tattica-estrema.html", "text": "Frozen Synapse asks us to manage a team of armed specialists through a series of programmable waypoints that tell each unit where to move on the game map. On the field, made up of walls and windows randomly generated by the CPU and framed from a bird's eye view, we obviously find another team, an enemy, which is managed in a similar way by the CPU or by a human player. Once the movements have been decided, we move on to the test phase which allows us to verify if our units will move correctly through a simulation. Obviously in this phase the enemies are motionless, given that understanding the movements of the opponents is our task, but it is still a useful tool for noticing any errors in the formulation of orders. At this point it is possible to start the actual turn during which each unit automatically engages the enemies it is in front of. And it is in this phase that a whole series of modifiers intervene that determine who can fire and when they can. In fact, a moving unit is slower to fire than a stationary one, those who hold a rifle are faster to shoot than the others and a soldier with a missile launcher acts late but can destroy a wall by killing anyone in the affected area. We must also consider that each weapon has a different range, so it is good not to leave units with short-range weapons in the corridors or standing in front of a window. Finally, each action can be delayed with a timer that allows you to determine the timing of each movement with absolute precision. But the most important modifier is undoubtedly the aim. In fact, during turn planning the key element is the crosshair that determines where a unit will look during the action phase. The more closely aligned your aiming and enemy position are, the more likely you are to chill an opposing unit on your first shot. In short, for each move, almost as if we were playing chess, it is necessary to foresee as many opposing actions as possible, to try to insert all the countermoves in those five seconds which will then mark the actual turn. During the first few games, the game is undoubtedly frustrating, at least until the accumulated experience allows you to avoid the most trivial mistakes almost automatically, but precisely for this reason, achieving perfect actions is a real satisfaction. A separate title Not that the options are very many. Indeed, fans of tactical titles will immediately wonder why only one weapon per unit and will feel the lack of greater stealth options, such as the possibility of moving from crouched. But Frozen Synapse is not a classic type tactician, it does not try to emulate Jagged Alliance and besides all the limitations seem to be functional. In fact, already with the only options available it is decidedly difficult to predict the movement of the opponents or to imagine the outcome of a grenade launch. And in any case, variety is also guaranteed by the randomly generated maps which make it impossible to memorize pre-packaged tactics and also transform the single player, consisting of 55 missions often characterized by complex objectives, into a virtually infinite experience. Unfortunately, the randomness of the schemes also has a negative side as often the disposition of the team can favor one of the two contenders, perhaps placing a soldier alone at the mercy of too many opponents. But if that soldier were to take up a missile launcher, and this often happens in skirmish and multiplayer, the opponents, too close, would have to fear for their safety. In any case, the skirmish allows you to program various options in order to create any type of challenge and allows you to choose 5 different types of artificial intelligence that are capable of transforming enemies into kamikazes or almost perfect assassins. Infinite longevity The multiplayer sector of Frozen Synapse is divided into various modes which include Elimination, Disputed, Secure and Hostage. The first, as the name suggests, asks us to eliminate opponents but within a limit of 5 turns. In Disputed however, during the fifth round, some red boxes appear to be collected and taken to safety. Secure is a mode that sees players capture some areas, while Hostage includes some hostages to rescue and prevents the reckless use of explosive weapons. But even remaining only in the context of the direct challenge between two players, the rate of randomness guarantees ever new situations and between machine guns, shotguns, grenades and long-range weapons, the starting variables of any type of clash are almost infinite. Also the gameplay changes significantly if the matchesthey are light or dark. In the first case, as in the single player, we always see the enemies on the map, even when there is no visual contact between the units. The tactics are visible, chess-style, and the planning phase is undoubtedly slower. Instead obscuring the location of enemies the unknown eats up some of the planning but generates new gameplay forcing players to hunt down opponents and cover all possible exits of each room. To play Frozen Synapse in multiplayer mode it is necessary to choose and connect to a specific server that will save all our statistics. The non-portability of game data is undoubtedly a limitation but, to balance this lack, we find a network that allows you to directly challenge another player or automatically find a game. Additionally, servers can maintain a game by allowing players to adopt a chess-like rhythm. This is a factor that further enhances the strategic component of the title even though nowadays timing of the genre is far from the wishes of the players. From an aesthetic point of view, we find essential and bare graphics, but the minimalist look is suitable for the type of title and is in any case enriched by blood splatters and explosions. In addition, the color tones, the soundtrack and the visual effects convincingly recall the atmosphere of 80s science fiction video games and allow the title to have a well-recognizable personality that is satisfied with minimal hardware resources. Obviously the plot is also of a science fiction nature and gives meaning to the 55 missions available, but there is a lack of a more structured narrative component richer in side elements, such as animations or cutscenes, which could have given the single player something extra.", "date": "2011-06-20", "grade": "8.7"}