{"name": "Salto nel buio", "ref": "https://multiplayer.it/recensioni/88800-pixeljunk-shooter-2-salto-nel-buio.html", "text": "The latest exponent of a series of downloadable video games for the PlayStation Network platform created by Q-Games, PixelJunk Shooter 2 basically takes up the mechanics of the first episode, released two years ago, adding some innovative elements here and there. Those who already know and appreciate the style and gameplay of this particular franchise know very well what to expect from the game: a large number of increasingly challenging levels, a precise control system, many puzzles based on the elements of the scenario to deal with and finally an extremely fluid graphic with acid colors, able to represent in the best way the cartoonish reality in which our spacecraft moves. The situation brought to the screen by Q-Games undoubtedly draws inspiration from the film ~Leap in the dark~ (the one with Dennis Quaid, Meg Ryan and Martin Short), in which a vehicle was miniaturized and inserted by mistake into the circulatory system of a being human. In this case, however, the spacecraft has not been miniaturized: it is the organism that hosts it that is enormous, and it is not a person but a ferocious monster that lives underground. Our task within the various levels will therefore be to survive, in the first place; to rescue all scientists swallowed by the creature, and stuck in its digestive tract; and finally to open a passage to the next area from time to time, with the ultimate aim of becoming free and finally being able to act from the outside. That's how we are done PixelJunk Shooter 2's control system sees the Dual Shock's analog sticks used to move the ship and orient it in space. The two functions remain deliberately separate, given the inertial context in which we find ourselves moving, which allows us, for example, to move away from a target while hitting it. The dynamism that follows from this kind of solution is evident, and undoubtedly constitutes one of the strengths of the Q-Games production. In support we find the back buttons, which are called into question on the one hand to operate the ~mechanical arm~ which is used to rescue the scientists, collect the very important diamonds and activate any switches (button L), on the other to shoot with the only weapon equipped, which is a powerful missile launcher (R button). As far as offensive maneuvers are concerned, our vehicle can fire single projectiles or large bursts, with a substantial difference from the point of view of effectiveness compared to the centered target, but at the same time with a considerable ~overheating~ of the engines. And speaking of heat, the energy bar works in practice in the opposite way, i.e. it fills up when the spacecraft gets too hot and is at risk of melting, while it empties (thus restoring the vehicle's optimal state of health) when we manage to cool it down . Finding ourselves in a biological environment and actually moving between various liquids, it is clear that the harmful ones are identified with the acids of the monster's digestive system, while our salvation is represented by water: just a drop is enough to eliminate the harmful effects of a juice gastric. On more than one occasion we will have to expose ourselves to ~calculated risks~, or to cross areas soaked in dangerous liquids to reach switches or make last minute rescues, and then quickly take refuge in a small pool of water and cool the vehicle's coating . Playstation 3 trophies There are thirteen trophies that can be unlocked by playing PixelJunk Shooter 2. The nine bronze trophies are obtained by performing certain actions for the first time, such as pouring water on acid, crushing an enemy by moving a block, defeating a other producing itself in a rotation and so on. The three silver trophies are won by collecting all the treasures present in episodes 4, 5 and 6 of the game, while finally the gold trophy arrives when we have recovered all the survivors trapped in the monster's stomach. The beast with a billion backs The levels of PixelJunk Shooter 2 are each made up of a variable number of stages, to be completed in rapid succession. Their size is far from excessive, indeed a few seconds are usually enough to frame them in their entirety and understand what kind of puzzle we will have to face to solve them. In some cases it is simply the presence of some enemy that makes life difficult for us, in others there is an environmental factor between switches, traps, liquids and gases of different nature with which to come to terms. The variations on the theme are extremely numerous, in practice there is no stage equal to the other and the developers from this point of view have shown that they can draw on a reservevirtually inexhaustible of ideas. The extremes of this approach are represented by the levels designed around some special upgrades of the ship: the accessory that allows it to devour the calcifications in the stomach of the beast and push blocks at the enemies, the ~antimagnetic~ coating that repels liquid metals and can use them as weapons, what allows us to illuminate completely dark areas, and so on. Therefore, not only is the single player campaign a feast of variety, ideas and substance, but it also asks us to be attentive and possibly visit the already completed areas again, because the unlocking of the new areas only takes place when we have of a certain number of diamonds. A bit like in some Nintendo titles, and the combination appears anything but out of place given the quality of the Q-Games title. It is also interesting to note the presence of a competitive multiplayer mode for two players, which we were finally able to try thanks to the restoration of the PlayStation Network. The games see us alternate between an offensive and a defensive turn, in which respectively we have to collect as many objects as possible and transport them to the collection areas without being intercepted by our opponent, or in fact hunt down the rival before he collects and deposits more objects of us. The matchmaking is fast, on some occasions we have noticed some problems attributable to the lag but in principle the potential for this mode appears clear, and the experience system certainly represents a further incentive to try it.", "date": "2011-06-03", "grade": "8.5"}