{"name": "Dungeon Hunter: Alliance", "ref": "https://multiplayer.it/recensioni/87800-dungeon-hunter-alliance-dungeon-e-mazzate.html", "text": "Gameloft continues to churn out PlayStation 3 ports of titles originally designed for other systems, specifically the iPhone and iPod Touch. Dungeon Hunter: Alliance, in fact, is not the first title of the French software house to pass from the App Store to the Sony console, a clear sign that its products are very popular with the Japanese console audience. Among other things, this specific version of the game, available on the PlayStation Network at a cost of 12.99 euros (or 9.74 euros, it seems, if you have a premium subscription), is not a simple adaptation of the almost homonymous title released almost two years ago for mobile phones, as it also boasts some exclusive and unpublished news. Like the ability to play up to four at the same time in fun multiplayer games, Trophies and Move support. But let's proceed in order. Dungeon Hunter: Alliance is a classic dungeon-crawling in which the player's primary goal is to guide a character chosen from one of the three available classes, namely Warrior, Thief and Mage, within locations bristling with pitfalls and enemies . Each type of hero has its own characteristics and specific abilities: the thief can be exploited for his stealth skills, the warrior for his brute strength and skill in the use of weapons, while the wizard, obviously, to cast spells of every type. All according to fantasy tradition, in short. The gameplay is also traditional: by exploring the many dungeons or scenarios present in the adventure, the user is engaged in various quests and in fights against hundreds of monsters in the most typical hack and slash style to then collect objects from killed enemies. But also in the search for chests where you can recover weapons and money to then invest in the appropriate upgrades in the shop. Four is better The variety of material that can be acquired both after the clashes and during explorations is really high: armor, spells, potions, rings and other types of loot will delight all fans of the genre who love to fiddle around in the inventory among dozens of items and statistics . However, progressing from level to level (at the end of which you usually have to face a final boss) the user then improves the skills of his virtual alter ego, increasing various attributes such as those relating to attack, defense and capacity. The enhancement of the character also translates into the acquisition of new offensive maneuvers and powers that work ~passively~, i.e. which improve the fighter's characteristics without having to call them up. Nothing new under the sun, in short. Although to be honest, Dungeon Hunter: Alliance also has some particularly tough moments to deal with compared to the average of other products of the genre, to the point that it is necessary to resort to a good dose of cunning and the skill of the gamer to overcome certain obstacles. For example, it often becomes necessary to have to plan a strategy to take down a boss, rather than just fiddling with the buttons or casting spells, perhaps with the help of one or two human companions. In this sense, the Gameloft title offers an ad hoc option for PlayStation 3 for local multiplayer for up to four players, which on balance turns out to be good and without excessive problems (and God forbid). The cooperative mode can also be extended to online play, so that it can also be used by those who don't have friends to have fun with in their living room. At the time of writing this review, unfortunately there are problems on the game servers in this case, but it seems that the French software house is working to fix things quickly. Playstation 3 trophies Dungeon Hunter: Alliance rewards the player with nineteen overall Trophies. These are divided respectively into seventeen of Bronze and two of Silver. All are obtained by progressing in the main adventure by fulfilling certain conditions: earning a certain amount of gold, killing a specific number of enemies, reaching level 25 with your character or completing the game at Legend level, just to name a few. The Move as a controller The product also implemented Move controller support. But the latter is not comfortable to use and has a rather awkward command scheme. Another sore point is to be found, unfortunately, in a certain general repetitiveness of the situations that the gamer gradually faces, and of enemies and locations, which in the long run risks getting bored a bit. In the latter two cases, the former lack variety, the latter, on the other hand, suffer from a certain backtracking complete with the respawning of monsters in various quests. We conclude by taking a quick look at the technical sector of the productto and to the plot of the game. From a graphic point of view Dungeon Hunter: Alliance looks like a game for PlayStation 2 but with a slightly higher level of detail, at least as regards the cleanliness of the image and its strength due to the high definition. Considering the type of game and the ~platform~, so to speak, from which it comes, the title presents environments full of objects and details, cute character models and discreet lighting effects managed without particular uncertainties by a 3D engine. While the audio is typical of the genre, that is, with good sampling for background noise and music without infamy and without praise. As far as the story behind the adventure is concerned, as tradition dictates for 90% of action RPGs, it is only a pretext to explain the situations that the protagonist faces in his war journey. The character selected at the start awakens in the catacombs of the Gothicus realm, summoned to life by a fairy. The latter called him back from the realm of shadows to help her free the region from the mercenaries and demonic creatures that have been infesting it for some time. But there is one detail that shocks the resurrected hero: the Queen at the head of the enemies is actually the woman who was once his wife. We leave the rest of the story to the gamers who will buy the Gameloft title to discover.", "date": "2011-06-03", "grade": "7.3"}