{"name": "Impulsi musicali", "ref": "https://multiplayer.it/recensioni/88906-pulse-volume-one-impulsi-musicali.html", "text": "It is enough to take a quick look at the Cipher Prime website to understand what the manifesto of the young and talented development team is: to produce video games characterized by simple but original concepts, by a refined audiovisual style oriented towards minimalism and by a duration of rather limited life. A position fully confirmed by Pulse here, which marks the debut of the study on the iPad and which follows the three aspects just listed to the letter, perhaps even with excessive zeal as regards the last point on the list... Tap tap revelation As often happens, it is much easier to play Pulse than to explain its mechanics: the product is in fact part of the vast set of rhythm games, but with a whole series of peculiarities that make such a definition end up staying close to it. Also because the Cipher Prime title (deliberately) lacks the competitive component typical of conventional music games: there is no game over if you make too many mistakes, there are no leaderboards to indicate who in the world has obtained the best scores and the presence itself of the score is decidedly an end in itself. This is because the intent of the developers with Pulse is to offer an audiovisual experience rather than an old-fashioned video game, a message that clearly emerges from the graphic solutions adopted to bring this project to the iPad screen. The interface is made up of a series of concentric circles on a black background, on which dots appear which, once hit by the colored wave that rhythmically propagates from the center of the structure, must be hit with the right timing. The challenge lies both in keeping time and touching the spheres in the correct order, also considering that they can move along their orbits with different speeds and directions. That's all. Also considering that the eight songs that make up the package are the only basis on which the entire scaffolding of the title is supported, it is easy to understand how Pulse can be completed in about twenty minutes after which the product has quantitatively nothing else to offer beyond the replay factor in pursuit of the perfect score. However, as we said earlier, we are talking more about a sensory experiment than a real video game, and from this point of view Pulse fully hits the target: the minimalist graphic style is fascinating, especially as regards a careful use and emotional of colors, with short explosions of colorful shapes (of different shape and color depending on the stage) that punctuate each successful tap. The music is obviously the host, and the soundtrack boasts an enviable refinement: Composed entirely by Cipher Prime musicians Dain Saint and Kerry Gilbert, the eight tracks that make up the package move through all the nuances of electronic music, ranging from chillout to dance with the kick in 4/4 time. Depending on the song chosen, the game scenario also changes, with a quantity of circles proportional to the beats of the piece and with the balls faithfully following its rhythm. Precisely the attention to detail and the undoubted stylistic value are the greatest strengths of Pulse, and it is no coincidence that it is easy to get involved despite the absence of any stimulus related to progression or the achievement of the maximum score. That said, the price at which the application is sold may seem excessive in proportion to the content: however, it should be considered that Cipher Prime has promised free monthly updates that will add several songs to the initial eight. The tested version is 1.0.0 Price: 3.99 App Store links", "date": "2011-05-24", "grade": "7.8"}