{"name": "Rigore  quando arbitro fischia", "ref": "https://multiplayer.it/recensioni/88802-first-touch-soccer-rigore-e-quando-arbitro-fischia.html", "text": "Mobile gaming and football titles have had a rather conflicting relationship for years, the result of a very specific choice by the famous development houses which, by often recycling old graphics engines, have undoubtedly penalized their quality. In fact, both on classic consoles and on latest generation terminals (iOS above all) Fifa and Pes, the main brands that divide the market, have remained far from the high standards achieved in the home versions, not only for the obvious technical aspect but mainly due to a gameplay that is usually neglected, (badly) adapted and lacking the necessary tactical/strategic approach capable of providing the right degree of realism; however, a pleasant exception to what has just been stated is represented by Fifa 11, which in this latest incarnation has decisively rebalanced the disadvantage accumulated up to now. However, while traditional systems do not know any alternatives to EA Sports and Konami products, over time (at least) two other interesting titles have established themselves on iOS, i.e. Real Football by Gameloft and X2 Football by the homonymous software house, with the latter recognized as a watershed for the quality of football simulations intended for Apple devices; abandoned the parochial name therefore, it's up to First Touch Soccer to continue the tradition, despite the fact that the games in the various real leagues are now mostly done. You will become a star! Like any self-respecting sports title, First Touch Soccer offers different game modes, trying to reproduce the experience of a real match through the most famous touch screens in the world: you can therefore choose between the classic Training, Tournament and Quick Match modes in addition to the Full Season, options identical to those present in all other similar productions; decidedly more peculiar instead (for a portable system) the Dream Team modes and, above all, Stella. The first is actually the Master League equivalent of Pes, which also offers the possibility of creating a team from scratch, including editing the jerseys; the Star mode, on the other hand, almost completely mirrors the famous Fifa Be a Pro, providing for the exclusive use of a single player for each match. In addition to the single player described so far, a complete multiplayer sector is available, locally via bluetooth or Wifi and online via Game Center: unfortunately, however, playing against other users via the internet is currently a really difficult undertaking due to the strong lag, despite the last update the situation has improved slightly. Pad (virtual) in hand, First Touch Soccer confirms the good things seen in the previous episodes branded X2, starting right from the control system: the left analog stick in fact is not bound to a predetermined angle of the screen, but is automatically positioned below the finger with each pressure, centering itself perfectly and therefore resulting in precise and rapid movements; the three fixed buttons on the right instead have the task of making low and high passes and shots on goal, with the respective defensive versions in the event of movement without the ball (pressing, active player change and sliding). The approach to the match changes significantly depending on the difficulty set: selecting the highest guarantees a fairly challenging level of challenge, the only one actually able to worry in the least a player accustomed to the most famous football titles, while at lower difficulties the AI certainly does not shine in terms of commitment and tactics performed. Good dexterity and freedom of movement allow the user, after a minimum of apprenticeship, perfect control of game situations, with triangulations and choral actions, as well as fundamental defensive movements; a high-end player will of course, as always, be tempted to spectacular solitary actions (thanks to the ease of dribbling, which can be performed with quick taps on the screen in front of the player in possession of the ball) while the goalkeepers will alternate miracles with dubious interventions, resulting however overall quite credible (and also improved after the last update). A decisive step forward also comes on the animation front, now more connected and harmonious, even if the room for improvement is certainly still very large. The sound sector falls within the (low) average, with rather anonymous choirs and music, but from a graphic point of view, with iPhone 4 and iOS higher than version 4.2 the result is really good, both in terms of fluidity and at a glance general; sure, the players bear almost no resemblance to their real-life counterparts but the models now appear leaner and less boxy than in the past. Some drops in framerate, however, are reportedyear with iOS up to version 4.1 and on devices of the previous generation. Finally, the weather effects (rain and snow, complete with a red ball) are present and well done, while the annoying lack of league and team licenses is a bit disappointing, the cost of which probably could not be supported by a title sold at a lower price of a coffee. The tested version is 1.1 Price: 0.79 App Store links", "date": "2011-05-23", "grade": "8.5"}