{"name": "Le mille bolle blu", "ref": "https://multiplayer.it/recensioni/88662-puzzle-bobble-universe-le-mille-bolle-blu.html", "text": "It has been for many years now, since 1994 to be exact, one of the fixed presences in the arcade first of all, and then also on consoles; it is one of the titles most loved by the female public; is a puzzle game that is based, like the best exponents of the genre, on a formula that is as simple as it is engaging; and finally, it is based on the characters of Bubble Bobble, an almost antediluvian platformer that has remained in the hearts of all the more elderly gamers. It's Puzzle Bobble, Taito's historic success that is now also appearing on Nintendo 3DS: after so many years and since we're on consoles, it should be an edition full of content, right? Read on, but don't get your hopes up... bubble shooter Most of you know it, but to talk about what's new in this game compared to the basic formula, let's first summarize it. On the screen there are a certain number of bubbles of various colors, arranged differently depending on the level; at the bottom there is a sort of cannon from which other colored bubbles are shot, one at a time: if a bubble shot from below comes into contact with two or more bubbles of the same colour, they explode. The ultimate goal is to clear all bubbles from the screen, which is made difficult not only by the fact that the bubbles that do not explode accumulate, but also by the presence of an upper edge that every few turns lower by pushing all the bubbles to the bottom edge: in fact, when even one bubble reaches the bottom of the screen, it will be Game Over. The novelties of this particular version are grafted onto this highly effective basis, to tell the truth few and not all convincing. First there are two game modes, Puzzle and Challenge; the first is a sort of story mode, made up of seven worlds, each of which is divided into levels of increasing difficulty. To completely complete a world it is not enough to finish each level, but also to recover a certain number of keys by freeing them from the bubbles from which they are surrounded and to face a boss. The challenge with the boss is extremely easy: it involves shooting bubbles that explode when three or more come into contact, only the patterns of the boss are very predictable and furthermore, if you have unlocked all the keys during the levels, the ~shooting speed~ will be very high making the challenge already won from the start. In addition there are three ~special moves~ of different effectiveness, depending on the player's performance, but obtainable easily and which often manage to resolve a level that has gone badly. All this makes the Puzzle mode, however fun, very easy, it can be finished in less than three hours leaving the player with a certain bitter sensation in the mouth. The 3D effect Absolutely useless for gameplay purposes and, like the whole game, not very ambitious, the 3D effect in Puzzle Bobble Universe is reduced to the background detached from the playing area, the artwork of the dragons that appear following particularly successful actions and some nice little things like boss movements. It is however well done, resulting in the end even one of the best things of the game, and the sparing use made of it, in such a title, can also be considered as a good idea since it does not tend to distract from the action. Challenge (to longevity) The Challenge mode is slightly more satisfying, because it is divided into three different sections: the first two last respectively 100 and 300 seconds and the player's skill is measured on how many levels you manage to overcome in the given time; the third is the classic ~survival~ without time limits. Considering that there are also three different difficulty levels, the Challenge mode can be considered the most appreciable by fans of the genre, even taking into account the presence here too of three different types of ~special bubbles~ that facilitate the task. But, partly because there are no particular incentives to insist, partly because it is natural that this is the case, sooner or later even this game mode can get boring; at this point, generally, a modality takes over multiplayer, capable of significantly raising the level of longevity of any title and cornerstone of any self-respecting puzzle game, of the same Puzzle Bobble in its various versions. Well, in Puzzle Bobble Universe there is no trace of it, neither online nor offline, neither for four, nor for three or even for just two players. It is a choice that we consider frankly incomprehensible, given the genre and the game we are talking about and the relative ease of implementing at least one basic option for two players, which definitively sinks a title which, starting from very solid foundations, was already complicating life with some grafts of little significancevo, such as bosses and special moves. The music, which is a nice remake of the classic arcade music, and the simple and inconspicuous graphics, but in keeping with the genre, are of little value to improve its fortunes.", "date": "2011-05-19", "grade": null}