{"name": "Thor: Il Dio del Tuono", "ref": "https://multiplayer.it/recensioni/88607-thor-il-dio-del-tuono-thor-figlio-di-kmer.html", "text": "Version tested: Nintendo DSAfter making its debut in the 2D beat'em-up vein with Batman: The Brave and The Bold for Wii (if you don't know him, here's the review written by the superhero Fabio Palmisano), WayForward Technologies repeats itself with the version for Nintendo DS of Thor: The God of Thunder, which goes from the surprising third-person action game seen on home consoles to a scrolling fighting game in the style of Two Crude Dudes, therefore lacking the depth of the scenario guaranteed by classics such as Final Fight or Streets of Rage but governed by the same dynamics. With some important differences, however: firstly, the protagonist of the game is not just any guy dressed in a sleeveless denim jacket and a pair of fighting gloves, but Thor, son of Odin and god of thunder from Norse mythology; secondly, given that the action takes place on both screens of the DS, i.e. with the scenarios developing vertically rather than just horizontally, we can also speak of two and a half dimensions. In a nutshell, however, the fundamental elements of the genre remain the same: through seven substantial levels, in turn divided into various stages, our goal is to eliminate any opponent we face, regardless of shape or size. Tour of the nine worlds The plot behind this portable reduction of Thor: God of Thunder is nothing more than a variant of the one seen on other consoles, and in any case it has little to do with the film that recently arrived in theaters. The borders of Asgard are violated by an army of enemies who wound the brave Sif. This is immediately brought before Odin so that he can cure her but Thor, thinking she is dead, lets himself be blinded by rage and falls victim to one of the many deceptions hatched by Loki, his half-brother as well as the real responsible for the attack. The god of thunder therefore leaves for a desperate journey to bring Sif back to life: first he goes to Vanaheim, home of the trolls; then to Niflheim, home of the ice giants; then to Hel, the realm of the dead; and finally to Muspelheim, fiery lair of the mighty Surtur. The final battle takes place again in the territory of Asgard, now besieged by enemy forces. The game uses a classic control system, using the touch screen only to activate the divine powers: once the relative bar is full, Thor can in fact hit all the enemies on the screen with a lightning bolt, sweep them away with a tornado or knock them out with a powerful shock wave. For the rest, the commands are arranged in a very simple way: the Y button is used to attack with Mjolnir, using the directions of the d-pad to vary the type of blow; the X button allows us to throw the hammer at opponents; A is used to grab the enemies or the interactive elements of the scenario, which our character can therefore lift and possibly use as weapons; B is the jump button, which combined with the d-pad allows us to fly towards the portion of the background that is located on the Nintendo DS upper screen; finally, the backbones L and R allow us respectively to scroll through the divine power and to do a somersault to dodge enemy blows. Within the scenarios it is also possible to find runes and activate three of them simultaneously to improve Thor's abilities in various situations: the god of thunder can thus become stronger, faster, more resistant and able to use alternative powers. Thor rocks! From an artistic point of view, the work done by WayForward Technologies is absolutely excellent: the drawings that portray the various characters during the dialogues are splendid, and the in-game graphics manage to live up to them, with well-detailed and animated sprites, as well as great design for scenarios. It is clear that to obtain certain results on the Nintendo DS you have to resort to the good old bitmap and set aside the polygons, and it is a pity that Thor: The God of Thunder is one of the few products capable of reaching certain aesthetic levels. Technical sector and game design merge when it comes to enemies, which offer an excellent variety in terms of appearance and ability: Thor is basically faced with three races (trolls, ice giants and creatures of fire), divided however into a large number of sub-species each endowed with peculiar abilities and different offensive patterns. It is then a must to mention the bosses, increasingly bigger, with the enormous Surtur as a term of comparison in this sense, with a splendid citation of the classic Mazin Saga for Mega Drive. The bosses are clearly made up of several sprites and unfortunately this appears quite evident in terms of animation, but they remain very beautiful dto see. Instead, what leaves a bitter taste in the mouth are the offensive capabilities of Thor himself, which at a certain point stagnate and create situations that are in many ways paradoxical, in which even the divine powers do not eliminate the opponents and require additional blows. We are therefore in an unlikely condition, not so much for the level of difficulty (some stages are really difficult, especially towards the end) and therefore for the poor yield of Thor's strength, but for the repetitiveness of the attacks we have to resort to be right about our opponents. Lastly, bad news also on the longevity front: even if rather demanding, the game can be finished in a matter of hours and leaves us with three extra modes which unfortunately leave the time they find: a survival set in the same scenarios as the story mode, a rather similar mode but which allows us to control the other gods of Asgard and finally a curious minigame in which we control a lava giant intent on trying his hand at a particular version of bowling.", "date": "2011-05-18", "grade": "5.0"}