{"name": "Quindici uomini...", "ref": "https://multiplayer.it/recensioni/88671-lego-pirati-dei-caraibi-quindici-uomini.html", "text": "Version tested: Xbox 360 The Pirates of the Caribbean phenomenon was born from an idea that was not entirely obvious. When it was decided to make the first film back in 2003, the screenwriters and Disney took their cue from a pirate-themed attraction present in almost all Disneyworlds in America, and even in Disneyland Paris. From that day to today, the series can count on four films, the last one to be released in Italy these days, and a multi-billion dollar franchise that has expanded into many sectors. After having already exploited the brand with some not very successful titles inspired by the adventures of Captain Jack Sparrow - not counting the famous MMO recently canceled by Disney itself - it was decided to entrust the project to the talented guys from TT Games, who have always been closely linked direct to LEGO titles. The wide-ranging project will allow you to relive the deeds not only of the last cinematic adventure, but of all four films with the now usual style and the usual irreverence typical of LEGO games. On boarding As already mentioned above, the developers have decided to include all the chapters of the game accessible from the usual common area typical of the games in the series which is clearly inspired by the location of Port Royal. Each chapter consists of five different episodes that will try to concentrate all the salient events of the films, making them interactive. As has already happened in the past, the story is told by the images and gestures of the various characters since there is no type of speech within the game. All the various moments that we will relive in the role of the protagonists are capable of snatching more than a laugh thanks to the comedy and sympathy that the developers have used to tell the story, sometimes distorting the original narrative plot. The cast is made up of all the characters that have appeared in the series, for a total of seventy ~little men~, each with personal and useful characteristics for solving the classic LEGO puzzles that permeate the various game levels. If on the one hand we therefore have a narrative background known to all fans of the films, some news is instead given by the gameplay of the title, thanks to small but significant innovations. The classic platform setting with some (simple) puzzle game puzzles seems to have remained intact, despite this the title has the pleasure of offering some novelties in terms of gameplay. What certainly catches the eye most is the possibility for our heroes to be able to swim and even dive in the crystalline Caribbean seas. This new feature offers new and interesting gameplay mechanics that derive from this ability, with puzzles based exclusively on it. Another interesting addition, when playing as Jack, is the ability to use the compass to locate objects that would otherwise remain hidden from our view, many of which prove to be useful for completing all the various game stages. Finally, even if less influential in terms of gameplay, the party of characters that we will be able to use has been expanded, now manageable through a convenient choice wheel that can be consulted by pressing the Y key. Furthermore, the guys from TT Games reconfirm themselves as masters in insert the classic replay values that invite the player to further sessions in the same level thanks to the ~free game~ mode that allows you to use a fully editable party of characters, thus giving the possibility of reaching areas that were not accessible in the first run and being able so collect all the collectibles, which each level holds within it. So far, in short, the classic and usual LEGO title, except that from the first game session the first flaws catch the eye. The most obvious limit concerns the duration of the levels themselves, much shorter than the canons of the series. To complete a mission it will take about ten minutes, if not less. Obviously this factor clearly affects the longevity of the title, which as far as it can count on the usual secrets and collectibles, is drastically lowered compared to the other titles in the series. The same access area to the various levels, traditionally always full of secrets and mysterious objects (the classic red bricks of extras for example) seems to have undergone a downsizing with less content than in other titles. But longevity does not seem to be the only one to have taken a step back, the difficulty of the game is also undergoing changes, with puzzles that, although always fun and pleasant, appear to have taken a step back compared to what was seen only a few months does with LEGO Star Wars III: the Clone Wars, becoming too simple and too supported by a lot of help that appears on the screen. The kids imprint is therefore evident. Xbox 360 goals The game offers the possibility to unlock the canonical 1000 points through 40 game achievements. Most of them are earned by completing the various game missions, others by performing certain actions within specific sections of the game. As always, the classic 100% completion objectives of the various levels are back and particular mention goes to the 88 G objective in which we will be asked to collect 88,888,88 bricks ... in short, a real LEGO marathon! Caribbean bricks If there is a component where the stock shows its merits the most, it is within the technical sector. The settings and the cast are developed with the usual skill, typical of this development house. Particular attention is also paid to the characterization of the various protagonists: the typical walk of Jack Sparrow, the changes of clothes from one film to another and all the peculiarities of each setting will not fail to be noticed in the eyes of the most ardent and attentive fans of the series. The same can be said of the extremely differentiated level design, which will put us in front of situations that are always different and original. The audio sector understandably draws heavily on the original soundtrack of the film, using themes that we have already had the opportunity to hear in the cinema. Unfortunately, for the umpteenth time, we are here to document the lack of an online cooperative component, increasingly insistently and loudly requested by fans of LEGO titles. As always, through the tested drop in / drop out system it is possible to enter a game locally and exit it at any time without necessarily having to interrupt the game session. In short, trying to summarize what has just been described, it is easy to deduce that ours is not a rejection in the general sense, but a simple observation of how much the title is poorer in content than other LEGO titles. Obviously the basic scaffolding still makes the game extremely enjoyable especially for the younger generations, doing justice to the famous Disney saga. In any case, it remains a small step back from the developers compared to what was seen a few months ago with LEGO Star Wars III. Question of partnerships During an event to present the campaigns that will be implemented to advertise the game, an interesting collaboration between Disney and LEGO was revealed which will allow those who purchase several packs of bricks inspired by LEGO Pirates of the Caribbean to be able to find content inside available for download within the game. Unfortunately the explanation didn't go into too much detail, it is still an excellent initiative that deserved to be at least mentioned.", "date": "2011-05-17", "grade": "7.3"}