{"name": "Record of Lodoss War: Deedlit in Wonder Labyrinth", "ref": "https://multiplayer.it/recensioni/record-of-lodoss-war-deedlit-in-wonder-labyrinth-recensione.html", "text": "If there is something dear to all fans of role-playing games, whether they are Western or Eastern, it is certainly Dungeons & Dragons, the classic tabletop role-playing game that laid the foundations for any fantasy product on the market. Record of Lodoss War (Cronache della Guerra di Lodoss in Italian) is one of the favorite children, having started as a replay campaign of the main game written by a Japanese author. For the uninitiated, replay campaigns are transcripts of the masters who take care of them so that they can be played with anyone. In this case Ryo Mizuno, the master in question, even wrote novels about his campaigns dedicated to the Lodoss wars in the distant 80s. Books that were later converted into anime and manga, such was their popularity. From these bases all the mythology behind this new game dedicated to Lodoss War is born. In our review of Record of Lodoss War: Deedlit in Wonder Labyrinth we try to understand if the Playism title, developed in collaboration with the guys from the Ladybug team, in addition to having a nostalgic appeal, also has a soul that allows it to stand out among all the offer that is currently present in the metroidvania genre. History and legends A scene from Record of Lodoss War: Deedlit in Wonder Labyrinth The narrative behind Record of Lodoss War: Deedlit in Wonder Labyrinth is strong and omnipresent, with solid foundations rooted in the imagination of anyone with a minimum knowledge of the series. The events predate the novel ~Diadem of the Covenant,~ but later anything that happens in the anime and comics. The protagonist is Deedlit, a tall elf who will have to navigate the intricate corridors of the labyrinth of wonders to try to understand the reasons behind some of the visions she has had. Visions that have as protagonists all his comrades in arms met during the various vicissitudes faced on the island of Lodoss (and not only), among which there is also and above all Parn, his beloved and the protagonist of the whole story Main Record of Lodoss War. During the exploration you will learn about particular details that bind each member of the group and you will face enemies who were believed to have fallen in battle but who at this juncture seem to have come back to life for reasons unknown to us. You will meet the infernal dragon Shooting Star, Lord Ashram and the witch Karla, always omnipresent throughout the history of Lodoss, just to name a few, but you will also come into contact with all the rest of the light-hearted group who accompanied Deedlit on his raids around the cursed island. Gameplay Deedlit amidst some elemental attacks From a purely playful point of view, Record of Lodoss War: Deedlit in Wonder Labyrinth is certainly a solid and fun product, net of some small ingenuity which, even if desired, makes the experience slightly invalidated. But let's go in order. Like any self-respecting metroidvania, the aim of the game is to be able to unlock inaccessible passages in order to continue exploring, trying to acquire experience, magic, skills and weapons in the meantime. In this the title excels and we do not deny that we have repeatedly found ourselves remembering the good old days of Castlevania: Symphony of the Night or Metroid. The map is rather linear and not too varied, but certainly quite refined and in any case full of well-diversified enemies and passages to unlock. Something that will force you to retrace your steps over and over again. The opponents' patterns are not the most successful thing in the game, but fortunately a good variety of them compensates for this lack of diversification, sometimes mixing them in such a way as to put your skills to the test. Let's understand, it's not that Record of Lodoss War: Deedlit in Wonder Labyrinth is a difficult title, even without previous experience you can easily finish it 100% in about 5 or 6 hours, but it is still satisfying to kill some bosses or overcome some particularly difficult map situations. full of enemies. Our good Deedlit has - unfortunately - only one basic attack available that can be directed in 5 directions. In our opinion, this is precisely one of the main problems of the game, the lack of dynamism and the woodiness of the basic attack, in the absence of any combo animation. Surely in this sense the developers could have done better. The same cannot be said of abilities and animations in general. We will have available the elemental spirits that will help us in case of difficulty and will infuse their element into our attacks, as well as actively helping us during the clashes. A large part of the gameplay and of the game is based precisely on the elementsand combat tactics. In fact, many enemies will have fire or air-based attacks, the two main elements, and you will have the possibility to absorb these attacks by alternating between the two elementals. By absorbing the magic you will then load the relative bars which, once you reach level 3, will recharge your HP. This is one of the key features of the gameplay, so much so that it will be one of the main strategies to use against the strongest monsters. Scattered around the map you will also find spells that you can use in battles and these too will be fantastic allies in case of difficulty. They range from spheres of luminous energy to trapping plants, passing through elemental spirits and shadowy minions. These abilities can be activated by consuming mana. You will also have a bow at your disposal that will help you with ranged combat and will be useful for unlocking certain doors by solving environmental puzzles. The bow has no arrow limitations because it shares the use of mana with the spells, so our advice is to always pay attention to this resource so as not to remain helpless, especially in the face of the most difficult bosses. You can then buy items and equipment from the various merchants around the map, normally located near the save points where you can recharge your energy and mana. We won't spoil the surprise by revealing everything you can find around the labyrinth but know that there are 2 or 3 other very interesting goodies. Technique and style Deedlit in wonder Labyrinth - Record of Lodoss War: Narse the ancient black dragon of the Isle of Marble From an artistic point of view, the title is a little gem. The pixel art used, in addition to giving a retro tone, is really made in a workmanlike manner. Well done animations and highly sought after sprites make the game a little gem. There are some maps that are less sought after than others, but in general everything is quite diversified and pleasant, with palettes and music that manage to outline each biome present, making it recognizable and giving it a very specific identity. Unlike other pixel-art titles it doesn't use modern gimmicks for effects and particles, rendering every light, fluorescence and transparency effect exactly as it should be done with this style: all with pixels. This brings out Record of Lodoss War: Deedlit in Wonder Labyrinth compared to the mass, because it outlines the attention to detail and attention to detail that not everyone has in this historical moment in which we run after deliveries and many times we have to go down to compromises. The result is a fun and well-made game with a few small flaws and a not exactly exceptional duration.", "date": "2021-12-23", "grade": "7.4"}