{"name": "Ancora pi veloce", "ref": "https://multiplayer.it/recensioni/88431-fast-furious-5-il-gioco-ufficiale-ancora-piu-veloce.html", "text": "Given the exceptional success at the box office, it is really strange that very few tie-ins have been drawn from the ~Fast & Furious~ film saga. Indeed, in terms of plot, characters and setting, the films all lent themselves perfectly to a transposition based on clandestine racing, extreme tuning and spectacular manoeuvres. Skipping both HD and PC consoles, Fast & Furious 5: the official game therefore arrives only on mobile platforms, in this specific case iPhone and iPad, summarizing the events narrated in the film directed by Justin Lin (of which, moreover, much talked about) which sees the return of Paul Walker and Vin Diesel, as well as the debut of Dwayne ~The Rock~ Johnson as federal agent Luke Hobbs, tasked with capturing them. Only Walker appears ~officially~ in the interlude sequences of the video game, which in any case are only ancillary to the main structure, consisting of a full-bodied career mode, which winds through eight different scenarios, the possibility of playing quick races and finally a good online multiplayer for up to ten players. The latter relies on the Gameloft Live platform for managing matchmaking and friends list, works quite well and performs its role flawlessly, namely that of increasing the duration of the experience even after completing the story mode. Which, in fact, will not take much time due to a generally low level of challenge. Drift King? Anyone who has seen ~Fast & Furious 3: Tokyo Drift~ will remember well that most of the maneuvers carried out on the streets of the Japanese capital involved drifting, with the protagonist who was forced to follow a sort of special course to beat the truzz. er, the local champion and become the new ~Drift King~. Well, the same spectacular stunt is present in Fast & Furious 5: the official game, indeed an entire stipulation has been dedicated to it (a type of race in which, precisely, to win you have to drift all the time). Too bad that the Gameloft developers have not managed to create a control system capable of facilitating this: if we choose the commands based on the accelerometer, to perform a drift we have to brake during a curve and then release the brake, then control the slide by tilting the device; if, on the other hand, we opt for touch controls, we must instead use two fingers (to brake, we need to touch the central part of the screen) very quickly, moving them away from the icons that are used to steer. In both cases, succeeding in the enterprise is very difficult and when we are forced to perform drifts it becomes a big problem. Luckily there are also different stipulations, such as the classic race to the finish line, the one based on changing gears at the ideal moment (with necessarily tilt controls) and finally the elimination race, not to be confused with the one seen in some famous racing games : There is no timer that will phase out the drivers who are in last place, instead you have to literally ram a certain number of opponents to achieve victory. This stipulation also seemed rather weak and botched to us, with solutions that were a bit too simplistic even from a visual point of view. And speaking of points of view, it must be recognized that the technical sector of the game really boasts respectable numbers, starting with the scenarios that not only have an excellent level of detail and a considerable polygonal count, but also propose ~disastrous~ events in the style of Split / Second: Velocity, with the view that lingers on these duties before returning to our vehicle. The cars are fairly numerous, it is possible to modify them aesthetically in various ways and apply performance tuning kits by spending the money earned on the track, but their impact varies considerably depending on the color of the paint. In fact, if we choose light colors, we will emphasize the ~jaggies~ and the defects of the lighting system. Finally, the sound seemed a little too basic to us. The tested version is 1.0.1 Price: 3.99 App Store links", "date": "2011-05-11", "grade": "7.0"}