{"name": "Animali molto pericolosi", "ref": "https://multiplayer.it/recensioni/88404-cabelas-dangerous-hunts-2011-animali-molto-pericolosi.html", "text": "Version Tested: Xbox 360After a long wait, the latest chapter of the hunting simulation par excellence arrives in Europe. We tested the game, it's up to you to find out whether or not it's worth taking up the gun... Although Italy can count on a fair number of hunters - the latest estimates made in 2009 speak of around 750,000 people spread over the peninsula - if we analyze this phenomenon within our sector, we discover that the titles dedicated to this practice are not in good health. The major exponent of the category appears to be the Cabela's series, which has always been under the protective wing of Activision. On Italian soil, the brand can already count several chapters released in past years, but a negative trend in terms of sales had led Activision to block the publication of the aforementioned games. After a few years of silence, the American publisher has decided to try again, renewing and changing the look of this series exactly as it did last year with another of its most famous brands, Rapala. Rite of passage Our analysis obviously starts from one of the two great novelties included in Cabela's: Dangerous Hunt 2011: the strong narrative component. The title compared to the past, totally abandons the classic level scheme to offer a more engaging and sensible story mode, trying, as far as possible, to give a reason why we find ourselves shooting animals. The protagonist we're going to play is the eldest of two brothers born to a father famous for his hunting trips. Being a family tradition, the parent wants to pass on to his two children what the Reinford family has practiced for years, however finding the obstruction of the eldest son Cole, the player's alter ego, who had long ago decided to embrace a more chaotic life and less wild than the metropolis. Exactly from this point our story will begin, which will see us engaged in extreme hunting trips and with continuous and appreciated twists that will entice the player to continue the adventure to discover its epilogue. The narrative plot will obviously be the architect of continuous changes of location that will lead us to hunt in the great and snowy American mountain ranges, up to the Ugandan hunting reserves, not to mention the countless animal breeds that will try to hinder our path and with which we will have to deal with. Without revealing any type of spoiler, we can safely say that the plot was compelling at the right point, with a more than discreet pace and a constantly teased underlying curiosity that invites the player to find out how Cole Reinford's epic will end. Particularly appreciated are the numerous quotations - wanted or not wanted - from some Hollywood films inspired by the world of hunting, such as Spirits in the Darkness (film by Stephen Hopkins, released in 1996) just to name one. Wild nature Moving on to the gameplay, we can't help but notice how the decision to add a strong narrative component associated with the new Top Shot Elite peripheral - we refer you to our box for details - has deliberately changed a bit the typical canons of the series to which the players had been used to it. While on the one hand the typical first-person shooter setting has remained unchanged, there is a strong downsizing as regards the size of the game sections, now less free and more scripted to allow the narration of events with key moments . This linearity will be partially mitigated by some parts of the level in which the hunting area will be slightly wider, giving the possibility to choose different strategies and techniques for approaching the clash. Strategies, precisely, which are further explored by the possibility of choosing three different weapons: a pistol, a double-barreled shotgun and a sniper rifle. Needless to specify that based on the type of animal to kill or the distance at which you choose to engage in the fight, a weapon will have more value than the others. In addition to the predominant component, which is the action one, the game also boasts moments of exploration and collection of clues. In the first case we will have to find traces left by the animals that will open us a trail on their possible location; all thanks to a particular red lens mounted on the sight of our rifle which will allow us, by activating a particular vision with the B key, to find them within the vast vegetation. The collection of clues instead tends to increase the replayability of the title. In fact, in each level we will have collectibles and secondary missions to complete, the prhymes will serve to expand the game plot with a few more details, the secondary objectives will instead give experience points for our character. Contrary to what one might think, the experience points, which can be accumulated every time we kill animals as well as in the secondary missions, will be used to unlock new missions within the second big novelty of the title: the Arcade mode. We shoot in style Inside the game package you will find the Top Shot Elite, an essential peripheral for playing Cabela's: Dangerous Hunt 2011. The shotgun, despite being entirely made of plastic, is solid to the touch and of a fair size, with the possibility of adjusting the stock and the distance of the top-mounted viewfinder, thus adapting it to the needs of various players. The peripheral is completely wireless thanks to a sensor sold together with the rifle. In addition to boasting a viewfinder with a particular lens to be used to find clues within the various levels, there is also a manual reload, similar to that of shotguns, which gives further credibility to the peripheral. Distributed in various positions are all the keys usually found on the pad. On the gun barrel there will be Y and X useful for changing the type of weapon. Just above the trigger, on the other hand, one of the two analogs A and B are arranged with the respective functions of movement, zoom and special vision. All for 69 on Xbox 360, game plus Top Shot Elite, while the PS3 version sees the bulk sale of Top Shot Elite instead of the game. Party hunt Taking advantage of the new game peripheral, the developers of Cabela's: Dangerous Hunt 2011 have created this new mode called ~Gallery~ which includes more than 30 levels with three game variants: classic, survival and exploration. Unlike the Story Mode, this mode winks at the myriad of shooters on rails released in the arcade, giving it a very strong arcade component or better still a party game. In the first variant of the game, the Classic one, we will have to score as many points as possible in a certain amount of time by killing everything that moves on the screen, moving from one section of the screen to another. In the second, called Survival, we will find ourselves in a certain point on the map and we will have to defend ourselves from various hordes of animals that gradually become larger and more ferocious. Finally, just so as not to miss anything, the Exploration variant is the one in which frenzy reigns supreme; in fact we will have to kill animals in rotation with ever-changing weapons and variants, thus buying more extra time and leading us to make ever greater records. To help us there will also be some special power ups that will be collected during the missions: infinite ammunition for a few seconds, double points, slowed down time and more. All these modes described will be playable up to 4 players, two at the same time and the others in rotation, an indication of how the developers have deliberately tried to tip the balance towards a purely party game component. The only big flaw is the total absence of an online sector, which in our view, given the undoubted qualities of these game modes, could certainly increase the overall quality of the offer. Speaking in terms of longevity, the game offers a campaign that stands at 5/6 hours of gameplay plus the entire arcade sector. Since this is a historically short-lived series, the leap forward in this sense is perceptible and welcome, not to mention the strong replayability component given by the secrets and collectibles scattered throughout the various levels. Xbox 360 goals The game offers the possibility to unlock the canonical 1000 points through 19 objectives. Of these, 9 will be directly linked to Story Mode and will unlock as we progress through the story. The remaining 10 instead will require you to perform specific actions such as killing a certain number of birds or snakes, rather than any animal species with a single shot from a certain distance. Ultimately it is a very easy 1000 points for those used to unlocking all the objectives of a game. Animal aesthetics We conclude our analysis on Cabela's: Dangerous Hunt 2011, talking about one of the most controversial components of the game, the technical one. Making a judgment is absolutely difficult as the game has many ups and downs. In fact, if we have among the pros a realization of vegetation and various natural phenomena - such as snowstorms - more than sufficient, the polygonal modeling of the characters as well as certain animals is sometimes poor, with poorly defined textures and above all with not quite natural and low fluid. Fortunately, not all animal species suffer from this problem, which makes the nose turn up even more since greater attention to detail when finishing the game would have avoided this annoying problem. Nothing to say about the audio sector, which can boast a decent dubbing in Italian with a good characterization of the characters and an absolutely level sampling of animal sounds and noises present in nature. Finally, the response on the screen of the rifle, after calibration, was more than satisfactory.", "date": "2011-05-10", "grade": "6.8"}