{"name": "Mario Party Advance", "ref": "https://multiplayer.it/recensioni/mario-party-advance.html", "text": "Fight for your right to party The most astonishing element from the outset, and which alone contributes to decreeing a large part of the partial failure of Mario Party Advance, is constituted by the absolutely summary and badly organized implementation of the multiplayer mode, which from the point of view of this kind of titles should be the focal point of the experience. Of the more than 120 mini-games that make up the Nintendo product, as many as fifty are usable exclusively by a single user, and we will talk about these later. Another sixty units of the total figure are instead the so-called Stramberie (somewhat questionable Italian translation of the term ~Gadgets~), conceptually similar to the unlockable extras in Wario Ware: Twisted!: they are therefore very simple playful applications, sometimes interesting but others terribly useless, moreover, devoid of that humorous charge of which those of Wario are instead full. However, some of these Gadgets lend themselves to multiplayer for up to four players, but with a rather strange mechanism that does not always work perfectly. Basically, each user has control of a particular portion of the GBA, be it the directional cross, the A or B keys and the two backbones: it is thus possible to participate in mini-games with an extremely simple structure, which however lack any competitive location and suffering from a very fluctuating background quality. The real multiplayer via link cable is limited to a dozen minigames, which are not even exceptional from the point of view of pure fun. Even the concrete opportunity to develop a turn-based mode for multiple players has been badly wasted in Mario Party Advance, with such a section occupying an all too marginal relevance within the economy of the title. I dance alone and I'm proud of it On balance, therefore, Mario Party Advance evidently places a more decisive emphasis on the experience for a single player, which however, as we will see, struggles to excite. The main mode of the Nintendo product is structured in the manner of a board game, with the user being required to roll a dice and move the number of boxes assigned by luck. The various points of the map are marked by the classic Game of the Goose style bonus or malus which can condition the path of our digital alter-ego, whose goal is to reach particular locations in order to participate in the various mini-games: by overcoming these challenges, the The user is rewarded with new Gadgets to try out in the appropriate section, and with the possibility of replaying the minigame individually in another mode created ad hoc. Either for the very heterogeneous quality of the mini-games (some are nice, others really terrible) or for the rather bland game pace, the single player of Mario Party Advance turns out to be a not exciting experience, which boils down to the mere achievement of unlockable elements without offering big points of fun. In short, the GBA has much better to offer (the aforementioned Wario Ware, for example), both in strictly playful terms and in terms of exploiting the console's technical potential. Mario Party Advance indeed presents a mediocre cosmetics, which emphasizes its poor quality with poor animations and above all with truly primitive backgrounds. The sound sector does not offer any better, with extremely flat and anonymous music and effects. Comment Mario Party Advance is a decidedly ambiguous title: denying what its name would suggest, the Nintendo product has a multiplayer factor implemented in a questionable way and with a very thin thickness, leaving room almost exclusively for a certainly not exceptional single player mode. Mario Party Advance therefore finds its main realization in the classic formula of unbridled unlocking, with a large amount of elements to discover which however certainly do not make the Nintendo product one of the most exciting titles available for GBA. Pros Large amount of gadgets and mini-games Some fun and original gimmicks Cons Minimal multiplayer mode Slow and not very exciting gameplay Mediocre technical realization Having reached six for his Parties on Nintendo home platforms (three on the old N64 and the same number on Gamecube), Mario has finally decided to organize one of his minigame-based parties on GBA with this Mario Party Advance: but contrary to as much as it would be legitimate to think, on this occasion the guests are few and the amusements actually rather scarce", "date": "2005-05-13", "grade": null}