{"name": "Il mondo dei nani pervertiti", "ref": "https://multiplayer.it/recensioni/88223-cargo-the-quest-for-gravity-il-mondo-dei-nani-pervertiti.html", "text": "The human race has failed and endangered the balance of the Earth several times. To replace them, a group of mechanical deities has decided to stake everything on naked, bald and perverted dwarfs who base their existence on pure entertainment: the buddies. These bizarre-looking creatures, in addition to playing on boats and hanging around the islands that make up the game world, love to dance from morning to night. How are these useless, harmful and hateful beings going to save the world? Obvious: I'm absolutely not able to do it. In fact, the force of gravity has gone to bald dwarfs and the earth's crust is dismembering like a puff pastry. On their road made of songs and vices, the buddies will cross Flawkes, to which they will destroy the airship on which he is travelling. The reason? Celebrate it, what else? Now, if you have read carefully, you will have already understood that it is not easy to describe Cargo! - The quest for gravity. It's not mainly because it's one of the most original titles released in recent years, made by Ice-Pick Lodge, to whom we owe the splendid and underrated Pathologic and The Void. The gameplay is even more complex to describe, because there is nothing to compare it with, unless you want to make ambiguous or forced comparisons. Is it an action game? After the airship crash, the player takes control of Flawkes and can take his first steps into the world of dwarves. The first rule to memorize is: buddies just want to have fun. Why is it so important to know and repeat it? Because their entertainment is the only currency that can be spent to buy the parts that will make up the drivable vehicles and to buy some infrastructure necessary to move forward in the game, such as an ice tower or the Empire States Building. There are many ways to entertain buddies. The fastest is to kick them by throwing them in the air, in order to make them explode with joy in a riot of fireworks and colors. Another way is to make them attach to a vehicle and drag them running, forming real snakes of howling dwarves. What is the point of doing all this? Soon the deities will speak to Flawkes and ask her to put her engineering skills at their service to found the new world, so ours will have to perform impromptu activities such as throwing wreckage into a mystical vortex, saving the buddies from the charm of a turbine , recover some crates with mechanical components inside, kill very bad penguins who love to incorporate buddies by inserting them in... how to say... yes... backsides, participate in ice competitions, reactivate extinct volcanoes by exploiting buddies, break ice blocks and so on. Is it a building game? To accomplish most of the strange tasks required to move forward in the plot, you will have to build vehicles by buying their mechanical parts in the shop of the gods (what a scum: she demands to be helped and even paid to do it). The vehicle editor has two main sections: the first allows free construction using the parts you own, while the second allows you to use blueprints to immediately have the desired vehicle. Blueprints can be found around the maps or created by the player to be recalled at any time, even in the sandbox mode, which is completely focused on the use of vehicles. What kind of vehicles can I build? All: land, sky and sea; there are no limits except in the amount of fun available and in the type of mission to be accomplished. There are also musical notes around the maps. Collecting many of them gives you a key. When used, the keys generate a melody that calls buddies together, causing them to group. This is a very useful tool for accumulating fun or for performing plot-related tasks, such as making the dwarfs dance on an extinct volcano. Where did you hide the stuff? Obviously such a title could only be eccentric even in the visual aspect. While it doesn't shine in terms of three-dimensional models and details, Cargo! - The quest for gravity offers varied and original scenarios that are very nice to see. The graphics have focused on a very colorful palette that well underlines the light-hearted decadence of the whole adventure and the alternation of the four seasons. The improbable assembly of places that forms the scenario as a whole has something sublime about it. For example, seeing Big Ben sunk in ice next to a smoking volcano produces a strangely pleasant effect for the attentive observer who knows how to get carried away by the unusual composition. There is no shortage of special effects of various kinds, all aimed at creating situationsthe bizarre to observe. Too bad for a few too many mistakes, such as the cuts in the direction of some dialogues that can be very annoying or the unjustified slowdowns in some sections. Obviously, the soundtrack also follows the style of the graphics, with a choice of cheerful songs that seem to come from a carousel and some amusing sound effects suitable for the context, such as the screams of the buddies in moments of maximum happiness. Defects Cargo! - The quest for gravity has several flaws that can annoy more than one player. Firstly, it lacks many of those extras that video games have accustomed us to. So no in-game help, apart from a text at the bottom of the screen describing the current objective. Americans have found the bewilderment created by the lack of arrows or giant light indicators an inexcusable flaw. We tend to give it less importance, although we confess to having found ourselves wandering aimlessly on a couple of occasions. Nothing dramatic, but if you're one of those who enjoy self-ending video games, you might find yourself uncomfortable. Another problem is represented by the lack of appeal of the sandbox mode. In theory, it's for experimenting with designs, but in practice, it's useless because there's not enough variety to warrant more than a couple of visits. It would have been better if routes were created for each type of vehicle or a more specific scenario. The last flaw, perhaps the most serious, is the general lack of finish. It is not uncommon to come across some graphic glitches or to be appalled by some bad animation. Let's not talk about the Italian translation, to which we have dedicated a special box. Probably with more money and a bigger team, most of these problems would have been solved.", "date": "2011-05-05", "grade": "8.0"}