{"name": "Cani da guerra", "ref": "https://multiplayer.it/recensioni/87936-resident-evil-mercenaries-vs-cani-da-guerra.html", "text": "Appeared for the first time in 1999 on PSone, the minigame The Mercenaries: Operation Jackal could be unlocked once the main mode of Resident Evil 3: Nemesis was completed. It was a sort of ~speed run~ in which our character didn't have to look after objects to collect, puzzles to solve and so on, but could only focus on eliminating as many zombies as possible within a time limit. The experiment proved to be very welcome by the players, so much so that Capcom revived it in Resident Evil 4, with the simple title of ~The Mercenaries~, and in Resident Evil 5. The pure and simple third-person shooter action now seemed to be able to live a life own, and so Resident Evil: The Mercenaries 3D for Nintendo 3DS was put in the works, a title that is based only on shootings and sets aside, for once, the adventure elements that have always characterized the Resident Evil saga. Still looking for a product capable of ~breaking through~ on the App Store, Capcom has seen fit to offer the same dynamics to iPhone and iPod Touch owners, packaging an online multiplayer TPS, based on arenas, which can be played by four people simultaneously, both in team mode and in the classic ~all against all~. The three of the apocalypse Once started, Resident Evil Mercenaries VS. allows us to select a character among Chris Redfield, Jill Valentine and Albert Wesker, then to try our hand at a double training in single player or with multiplayer, both online and locally, within three different maps: Docks, Fortress and Castle . The training sections are the best choice for those who need to familiarize themselves with the control system, which indeed takes some practice to master. The game doesn't use the classic double virtual analog stick, in fact, and forces us to do a lot of maneuvers to perform even the simplest of actions. The character can move around the map normally, but when it comes to fighting he can no longer move and this clearly becomes a problem when there are several enemies nearby. In the upper right part of the touch screen there is an icon that allows us to quickly access the inventory and select the weapon to equip, after which it is enough to touch the relative icon to be able to use it. If it is the ordinance dagger, we can slash by touching the appropriate button while moving the view; if instead it is a firearm or a grenade, the virtual stick allows us to manage the aim (via laser) until it is time to open fire. In all three available locations there are many chests containing extra weapons and items, and the simple elimination of a zombie generally leaves something to collect on the ground, however the level design leaves something to be desired and does not lend itself to flawlessly to the multiplayer action. To win the game we must not simply kill more enemies than our opponents do, but obtain a mix of various performances such as to fill a special bar, which once complete even allows us to recall the maniac with the Resident Evil chainsaw 4 and unleash it against other players. Matchmaking is quick and intuitive, but unfortunately it's hard to find people online and it is therefore the case to make an appointment with friends if you want to play a few games together. As far as the technical sector is concerned, this new Capcom production moves between ups and downs. The characters are a bit angular but well detailed, recognizable and have a decent set of animations. What is really wrong are the scenarios, covered with very grainy textures and monotonous colors, really ugly to look at. The tested version is 1.00.00 Price: 2.39 App Store links", "date": "2011-04-27", "grade": "5.7"}