{"name": "Un coniglio  per sempre", "ref": "https://multiplayer.it/recensioni/87776-rabbids-3d-un-coniglio-e-per-sempre.html", "text": "You should know that the American title of Rabbids 3D is none other than Raving Rabbids: Travel in Time 3D; a bell will ring for the most attentive and yes, you are right, Raving Rabbids: Travel in Time is a delicious party game released for Wii a few months ago, in which the demented bunnies born from Michel Ancel's sick imagination decide to ~touch up~ the human history returning to different eras of the past to leave its mark, which should ensure, as Doctor Emmett Brown taught us many years ago, that the present and the future also change. Are we therefore facing the portable version of this nice party game? Unfortunately not: Rabbids 3D keeps on 3DS only the name (not even that in Europe), the premise and the settings of the Wii title, to transform itself into a very classic 2D platform. We do not know the reasons for this singular choice, but we do know its consequences, and we are about to reveal them to you one by one. History lesson We are not referring only to history as a pretext for the new misadventures of the Rabbids, but also to the history of video games itself, of which the 2D Platform, now brought back into vogue every now and then only by Nintendo and some other small software house, has for decades represented a fundamental pillar, and to which Ubi uses to introduce its mascots in the all-3D world of the new Kyoto laptop. The experiment is undoubtedly interesting, both for the peculiarities of the genre itself, and because we can see for the first time the 3D without glasses of the 3DS at work in a game with purely two-dimensional mechanics; but let's postpone our reflections until later and begin to analyze the game. We were talking about the story, which sees the lovable were-bunnies go through 4 different historical eras to change the future of the Earth; to tell the truth, the introduction is so short and frantic, in perfect French style, that it is not clear what is happening, the fact is that a washing machine is our means of moving between eras, that each era consists of sixteen levels including some bonuses, that in each level the task of the Rabbid that we play is to collect the classic coins and the not so classic duck-shaped life jackets, and that the energy is represented by exhausted rolls of pink toilet paper which (it is however possible to restore them by finding them in the game) you lose a life. Don't stare at the screen with that face, in the face of situations like this it's better not to ask questions: washing machines that travel through time, toilet paper and rubber ducks, with no visible connection between them. So? Think about playing. Yes, play: the actions available to the Rabbids are quite canonical; jump, walk, run, dodge, stun or eliminate enemies, use various background elements to reach otherwise impassable areas, break blocks, carry crates... More or less all the cliches of 2D platforming in Rabbids 3D gameplay, as well as in its level design crammed with platforms (and God forbid..), obstacles of various kinds, slides to speed up the pace and test your reflexes, hidden areas full of bonuses... Once the level is completed, then , it is possible to replay it in two modes: Chronometer, which consists of finishing it in the shortest possible time, and Missions, in which you must, for each level, collect everything there is to collect and eliminate all enemies; completing the levels in all modes gives you the opportunity to unlock various secrets, from the most meaningful ones in terms of gameplay such as the bonus levels, to the most useless but absolutely insane ones, such as the most diverse costumes that the Rabbid can wear. Geisha hairstyle with medieval armor? There is. Bee hive on the head but with a very elegant dark dress? There's that too. Why? There is no why, these costumes are just there. The 3D effect In a title with 2D dynamics, it can only be an aesthetic device. Which works, moreover: the levels of parallax, Holy Grail of the 8/16 bit era, are exalted in the rendering of depth, and there are no shortage of touches of class such as pterodactyls that make wide circles on the playing area and beetles that lean~ to the screen. Here too, as in Rayman 3D, however, it seems necessary to adjust the effect a little downwards to be able to capture it properly, since, with what is on the screen and with the great dynamism with which it often moves everything, duplication and headaches are lurking! How soft is toilet paper? Despite the great conventionality of the whole, the first impact with Rabbids 3D is even excellent: the action is fluid, dynamic and fun, the level design fits perfectly, the controls are precise and the atmosfera brings to mind the great classics of the genre, not least that Rayman who in hindsight is the progenitor of this game. The first levels are little more than tutorials and as you progress the game becomes more difficult, the design more complex and refined but, and this is where the great flaw of the title hides, without ever take the leap, without ever proposing anything really new or really difficult; all this means that towards the middle of a journey that is also quite long, interest begins to wane, precisely because the mechanics begin to know too much about what has already been seen and already done. Even replaying the levels in the two alternative modes, unless you are a purist of the collection, does not offer any incentive from a certain point on. It's a real shame, since the care placed in the programming is evident both in the action, which always remains fluid and fun, and in the great ~Rabbidiana~ atmosphere, and also in the technical sector: graphically Rabbids 3D is a great sight, it moves with a not total but always constant fluidity a lot of polygons covered with refined and colorful textures, and shows off various remarkable effects. As a game programmed specifically for the machine, it's a nice calling card for what we'll see from third parties in the future. Even the sound is not joking: in reality the musical themes are not so many, but they are declined in different ways depending on the historical era in which we find ourselves and above all they are very catchy and demented, just like the unattainable versacci of the Rabbids and all the atmosphere that you breathe at all times. A small side note to finish: the game does not record your progress in the Time Trial and Mission modes, so if you don't remember having already completed a level in one of these two modes, you must go and review the records that appear before entering in each internship.", "date": "2011-04-26", "grade": "7.0"}