{"name": "Sherlock Holmes: Lorecchino dargento", "ref": "https://multiplayer.it/recensioni/sherlock-holmes-lorecchino-dargento.html", "text": "An appreciable videogame reinterpretation of the exploits of Sherlock Holmes and Dr. Watson. Sometimes they come back Apparently, The Silver Earring has the setting of the most classic third-person point-and-click adventures, but underneath it hides a relatively original game mechanic, which in many respects differs from most of the products we have been to accustomed lately, that is both from the tradition of the genre handed down by recent successes such as The Longest Journey or Syberia and from the main characteristics of the Myst trend. The end result is an appreciable video game reinterpretation of the exploits of Sherlock Holmes and Dr. Watson, which enjoys respectable graphics and some really interesting gameplay ideas, but is affected by more than one flaw in the technical implementation and one o two unforgivable slips in game design. Frogwares, however, quickly learns from its mistakes: this is demonstrated by the substantial qualitative difference between ~The Mystery of the Mummy~ and ~The Silver Earring~. We therefore have high hopes for the third episode of the series, which the developer already has in the works and which should embody the maturation of his experience alongside the impeccable Sherlock Holmes... The usual suspects Holmes's Baker Street flat is beautifully reconstructed. The premises of the story are not the most original: Holmes and his trusted colleague Watson are casually invited to a gala evening which begins and ends with the murder of the landlord, a rich London invariably surrounded by a dense circle of enemies and greedy collaborators ready for any meanness. Suspicions immediately fall on the victim's unfortunate daughter who, having just returned after years of study abroad, has the foresight to be caught at the crime scene with a gun in her hand and a cloud of gunpowder around. Everyone points to the recent friction born between father and daughter and the conspicuous inheritance that would be due to the latter but, as soon as corpses begin to appear like spring buds, the yellow thickens. Will the lucid and infallible logic of our Sherlock shed light on the mystery of the silver earring? But above all, what does the silver earring have to do with this matter? We'll find out by joining Holmes and Watson in the investigation of the case, which will take place in a discreetly reconstructed 1897 London and will be based on the search for clues, the questioning of witnesses and a careful examination of the evidence collected. The investigations will take place in London in 1897 and will be based on the search for clues, the questioning of witnesses and a careful examination of the evidence collected. The usual suspects The first crime scene. Unfortunately, the involvement in the initial stages is rather limited, which seriously harms the player's ability to identify and enter the spirit of the adventure: the atmosphere that surrounds the crime in the introduction is not enough to intrigue us, nor are the first exchanges of jokes to make us bond with the supporting actors. In short, the interest in the plot in general borders on zero: the story is hackneyed, the rare twists and turns that punctuate it are often burned due to lack of adequate suspense in the narrative construction and, given the obvious or not always characterization happy with the characters, it is not even possible to become attached to the protagonists of the story, with some rare exceptions and the exclusion of Holmes and Watson. Indeed, our two heroes and that funny guy Inspector Lestrade are well outlined and faithful to the spirit of Doyle's stories. Sherlock gives his best in his surprising analytical disquisitions and Watson always gives us a smile with his pleasant manner and the casual desperation with which he constantly tries to keep up with his colleague. The dialogues are well written and not without a certain vein of humor, but not always engaging: sometimes, we find ourselves wishing intensely that one of the witnesses would finish spilling the beans, in order to continue with something more interesting. In spite of all this, the presentation of the product is very colorful and lovingly cared for, the investigations are constructed so well and the evidence scattered throughout the play areas fit together so flawlessly, that after a while you forget the initial skepticism and end up infected from the Victorian atmospheres and let yourself be carried away pleasantly by the intrigue that slowly unfolds before our eyes, for the pure pleasure of putting our analytical and deductive skills to the test. Elementary watson! Well, not really During the adventure, which is structured in an absolutely linear way and divided intofive days, we will control both Sherlock Holmes and Dr. Watson, passing from one to the other with an interesting change of perspective: generally, the first will be responsible for the detailed analysis of the crime scenes and the second more prosaic tasks such as the search for documentation or witnesses. The phases of gathering the clues are quite exciting, while the same cannot always be said of those of the testimonies or the scientific examination of the evidence in Baker Street, mostly conducted in a sterile and controlled manner. The documents and evidence notes collected in Holmes' diary have to be read and re-read, but they can also be rather long and hard to decipher (scribbles, difficult to understand handwriting, accounting records...), although it cannot be denied that this contributes greatly to the realism of the gaming experience. At the end of each day of investigation, you have to take a quiz to demonstrate that you have correctly interpreted the clues and summarize the point of the situation: you answer with a ~yes~ or a ~no~, each time supporting your choice with the evidence of the case found in the diary (clues, eyewitness accounts and notes by Holmes). The quizzes are a brilliant idea: in addition to being an interesting addition to the story, they make up for the relative lack of real puzzles in the game, even if the questionnaires sometimes risk proving to be dangerously frustrating, as they are affected by even a single incorrect answer. In case of error, in fact, Holmes will limit himself to suggesting to double-check ALL the questions and sometimes you get stuck for really negligible details. Elementary watson! Well, not really As has been said, most of the game time is dedicated to the search for clues in the highly detailed environments: the evidence is scattered or hidden in various forms (footprints, objects, residues of unidentified substances, documents...) and , as one might expect in real-life investigations, they are sometimes very difficult to spot  in short, on-screen pixel hunting is the rule in this adventure but, given the context and the importance of detail in the work of the 'investigator, we can tolerate it here! Interrogating the witnesses will be another activity of fundamental importance for solving the case: we will not have to appeal to our detective nose, as we will simply limit ourselves to examining all the dialogue options with all the characters. Conventional puzzles involving the use of inventory items are few and far between. The logical and mechanical puzzles are essentially concentrated in a single setting, which will also be consistent with the context of the game, which integrates them with a clear purpose, but exhausting for the player, who finds himself facing them one after the other . They range from deciphering the code of a safe to mathematical puzzles and some are quite difficult. It's a real shame that there are so few of them, since they appear singularly well thought out and inserted into the story of the adventure! On-screen pixel hunting is the rule in this adventure. Elementary watson! Well, not really The last element of the game mechanics to report, to the horror of all fans of the genre, is the presence of two unnerving action sequences: an awkward stealth phase and an odious timed labyrinth seriously jeopardize the delicate balance of the adventure and the equally delicate psychic balance of the player, with a control system that is nothing short of obscene and no margin for error. Jailbird was the ambitious pretext to move the pace of the game! It is unforgivable that developers of graphic adventures, while knowing their audience and the technical limits of the genre itself, persist in taking similar risks, especially when starting from an interface that already has a questionable ~path-finding~ in itself, such as precisely that of The Silver Earring: the movements are problematic even in the normal phases of the game, in which to move from one screen to another you have to hunt down icons in the shape of feet that appear where and how they want, so let alone when we have guards and dogs chasing us or running from one side to the other is running out of time! Not to mention the fact that sometimes, at the climax, Holmes and Watson simply refuse to move! A promiscuous technical sector The interface is dry and functional, the inventory practical and elegant, the diary well organized and finally useful for solving the game. The colorful and detailed graphics are undoubtedly the strong point of this title. The interiors of the refined Victorian settings are rendered with maniacal meticulousness: paintings, stuccos, tapestries, porcelain, elaborate embroideries,tables, exotic carpets and warm lighting effects will caress your eyes in front of every single beautifully pre-rendered two-dimensional backdrop. One cannot be equally enthusiastic about some cutscenes with an intermittent quality and questionable shots, nor about the animation of the characters, whose three-dimensional models sometimes appear rather woody and not always finished. The game is undermined by some graphical bugs, one of which in particular can make it even impossible to solve a puzzle and the download of the patch made available by the developer is mandatory. A promiscuous technical sector The soundtrack is entirely composed of pieces of classical music, from Dvorak to Tchaikovsky, which don't always fit the game atmosphere wonderfully, to the point of being disturbing in some passages, above all due to the difficulties encountered in set their audio levels against dialogue or sound effects. The latter aren't that great. Not all English voice actors deliver convincing and professional performances, some even verge on the ridiculous. However, Watson's voice stands out above every other, which is truly appreciable. Unfortunately, the game suffers from some sound bugs and conspicuous lip-synch problems, which will not even escape Italian users, despite the presence of subtitles for them. In this regard, we point out that the quality of the localization is on average good, if we exclude some oddities in the translation and a couple of recurring spelling errors. Comment The silver earring is a game that has potential to sell: unfortunately, it is precisely its qualities that put its flaws in a bad light, perhaps making them even more difficult to digest! It almost angers the fact that such a well-finished graphic presentation is impaired by bugs or sudden stylistic slips, that an apt videogame reincarnation of the characters of Holmes and Watson and of the England of their era is not always supported by a script and dialogues at the same time. height, or even that the careful reconstruction of the investigations is not enough to save the pace of the adventure, which here and there betrays the lack of real puzzles. Nonetheless, the all in all pleasant game mechanics and some innovative ideas force us to absolve him of his faults: not even the annoying interface defects and the preposterous action sequences jeopardize the fun in an irreparable way and this, for better or for worse, remains one of the most valuable adventures released in recent times. It goes without saying that it is a title recommended mainly for Sherlock Holmes fans and the most indestructible adventurers! Pros: Dignified transposition of Doyle's stories Evocative graphics Unique game mechanics Cons: Not always enthralling rhythm and atmosphere Unfriendly interface Some technical blunders Sometimes they come back This is not the first and will not be the last game dedicated to the famous detective made immortal by the pen of Sir Arthur Conan Doyle: fans will not have missed the two classics of the series ~The Lost Files of Sherlock Holmes~ developed by Mythos Software and published by Electronic Arts in the 90s (The Case of the Serrated Scalpel and The Case of the Rose Tattoo), nor the more recent ~The Mystery of the Mummy~, again by Frogwares. Encouraged by the rather favorable reception received by the latter title, the developer has decided to embark on a second digital transposition of the investigations of the detective par excellence, which by their very nature seem to lend themselves well to a reinterpretation in the form of a graphic adventure. However, as well as a factor of great appeal, the fame of Holmes and his companions represents a great responsibility: it must be a considerable undertaking to remain faithful to the spirit of Doyle's original stories and at the same time propose an exciting new case and a mechanic of game that is up to it!", "date": "2005-05-12", "grade": null}