{"name": "La resa dei conti", "ref": "https://multiplayer.it/recensioni/87826-conduit-2-la-resa-dei-conti.html", "text": "The Conduit promised to push the Wii where no other development team had been able to go, at least technically. The end result was instead a basically average FPS, with a good control system but a series of more or less serious problems, in particular due to the brevity of a not particularly inspired single player campaign (which can be completed in four or five hours) and mediocre level design. Given the results obtained in commercial terms (about 500,000 copies sold worldwide, a ridiculous percentage if we consider that there are more than eighty-six million Wiis around), we were therefore somewhat surprised to learn of the announcement of a sequel , which clearly would pick up the story where we left off, with agent Michael Ford chasing the evil John Adams (a powerful alien disguised as an Earth bureaucrat), while trying to improve everything else: the graphic style, the contents of the single player and also those of an already more than discreet online multiplayer, bearing in mind what the owners of the Nintendo console are used to (nothing, or almost). So, here we are: Conduit 2 is finally available in stores and we were able to test it well, a few days in advance, to understand if the developers of High Voltage Software have managed to make the leap in quality or not. Around the world in a few hours The single player campaign consists of thirteen stages, and sees us explore ancient ruins, snowy wastes, Chinese mountains and a lot of underground areas in search of both malicious aliens and heavily armed human mercenaries. The game starts immediately with a bang, projecting us onto a platform in the open sea towards which a huge sea monster moves, the Leviathan, which we will have to neutralize using some turrets. The amount of opponents that we will find on our way is respectable, also from the point of view of variety: from annoying creatures that emerge from devices attached to the walls to human soldiers with or without heavy armor, from simple alien warriors to be shot in the head to the big and menacing ones, which go down only after quite a few gusts, passing through a whole series of more or less successful variations. We have not detected particular shortcomings in terms of design, at this juncture, while the question changes drastically if we stop for a moment to analyze the protagonist of the story, agent Michael Ford. In fact, we are talking about a muscular guy with a pair of visor sunglasses, frankly unpresentable and to whom the developers wanted to give a completely different look during the game, designing him an armor halfway between the Crysis nanosuit and the armor by Master Chief. Better, but not by much. Then there are some considerations that must be made both in terms of game design and in terms of level design. First of all, the single player campaign is once again too short, the duration is practically the same as the first episode and we can't help but wonder why something hasn't been done to make it more substantial, considering that it is a defect highlighted by several parties and that High Voltage Software cannot fail to have implemented. Secondly, the difficulty appears poorly balanced: at the ~normal~ level you manage to survive without particular problems everything that Adams manages to throw against us, but the fight with the ~Chinese~ boss Li comes together with a sudden peak in the challenge , which forces numerous attempts to be able to keep up with the opponent and his multiple offensive maneuvers. A sudden increase in difficulty could also be there, but it would not explain why the subsequent phases return to normal instead, with a final battle that is all too trivial in its simplicity. And then, well, there's the question of the level design, which from the trailers seemed much improved compared to The Conduit but which actually leaves a bad taste in the mouth even in this sequel. The numerous underground galleries in which the action takes place are in fact all the same, harbingers of a ~high tech~ intention that is not convincing at all, with questionable chromatic choices. Ultimately, Conduit 2 lacks personality, and some discrete dialogue between Michael and Prometheus (which somewhat resembles the exchanges between Michael Knight and KITT in the ~Supercar~ series...) is not enough to patch it up. Total control Conduit 2 can be played using the Wii-mote / Nunchuk combo, using the MotionPlus or the Classic Controller (much better if in the Pro version). In all cases the commands can be fully customized. Support for MotionPlus appears more than aformal lter: the precision in the movement is certainly superior to that obtainable with the Wii-mote alone, but this sensitivity leads absurdly to a lack of precision, with the reticle moving at the slightest jolt and therefore preventing us from hitting the mark hits with ease. Using the Classic Controller instead you get the classic layout of the FPS on consoles, but as soon as you access the multiplayer, the inferiority of this solution compared to the motion detection one, much faster and more intuitive, becomes clear. Who doesn't play together... As mentioned above, The Conduit already had a good multiplayer sector and in the end this is the aspect on which the developers seem to have worked the most in view of the sequel. In fact, Conduit 2 has an engaging local multiplayer mode, via split-screen, as well as a very rich online component. The maximum number of participants in the games does not change, twelve for the normal ones and eight for the ~hardcore~ ones, but the ways in which it is possible to compete with friends or complete strangers are multiplying. In ~all against all~, for example, you can win based on the number of kills, try your hand at a race to see who holds the DIVA longest, in the classic ~capture the flag~ or in a mode called ~bounty hunter ~, in which each player is assigned a precise target from time to time and must try to eliminate only that (in the meantime, watching out for the onslaught of the others!). As for the team modes, you go from the most classic of deathmatches to ~capture the flag~, from the curious ~DIVA basketball~ (in which you have to throw the spherical device in an area of the map to collect points) to territorial modes such as ~annexation~ and ~overload~, in which respectively you have to conquer and control outposts or defend your base and then try to destroy that of the enemy team. All this action can take place within twelve maps, not beautiful to look at (there is always the problem of level design which leaves something to be desired, after all) but sufficiently large and diversified. When we first accessed Conduit 2's multiplayer we were amazed to see the game look for updates and then install them - something you don't see every day on the Wii, quite the contrary. The matchmaking works well, we have already found a good number of users online and the cases of problems related to lag have been relatively rare. Support for the HeadBanger headset is certainly a valuable extra, since it finally makes voice chat possible between players, although we will have to see how many will buy it. With the experience points earned during online matches, it is possible to purchase numerous items, weapons and upgrades for your character, which translate into an effective advantage on the battlefield. On the one hand, therefore, they stimulate you to try your hand at multiplayer, on the other they inevitably create an imbalance between the different players, especially as regards the novices. Moving on to a purely technical discourse, Conduit 2 is improved compared to the first episode, but not by much. The frame rate is generally fluid and effectively supports motion detection controls, but in the most agitated situations it shows the side of obvious (and annoying) drops. The textures are generally of a good quality and, as already mentioned, the enemies are quite varied in appearance and characteristics. The scenarios leave something to be desired, or at least most of them: too simple structures, badly chosen colors, an all in all poor polygonal count, which does not stand comparison with the best the past generation of consoles has been able to show in its most recent productions. significant. The sound, dialogues aside, is mediocre: the music is in fact insignificant, while some effects border on the ridiculous (the noise of Ford's fist against the aliens dangerously recalls that of the slaps in the films with Bud Spencer and Terence Hill...) .", "date": "2011-04-22", "grade": "7.2"}