{"name": "La torre pi bella", "ref": "https://multiplayer.it/recensioni/87732-sentinel-3-homeworld-la-torre-piu-bella.html", "text": "When a new, yet another exponent of the ~Tower Defense~ category arrives on iOS systems, it is normal for users to ask themselves a sacrosanct question: was it really necessary? Indeed, the number of these titles that crowd the Apple Store is truly incalculable, perhaps thanks to (or because of) the simplicity of development and the substantial immediacy of the gameplay, perfectly designed for the extreme portability of mobile platforms made in Cupertino. In fact, starting from Plants against Zombies, a PopCap title which due to its success and presence on multiple platforms can be considered as the main representative of the genre, we have witnessed an uncontrolled proliferation of more or less valid clones, with horror, fantasy , spatial etc. However, in Sentinel 3: Homeworld, as we will see, the concept of simple ~tower defense~ has been refined, expanded and enriched, to the point of making the Origin8 title almost as deep and complex as a strategic one. Stake up the gates! The assumption on which Sentinel 3: Homeworld is based does not actually see anything original: defending one's own territory from an invasion of alien creatures is in fact certainly not a prelude to awards for best screenplay; however, it is the heart of the gameplay that offers pleasant and unexpected surprises. The task of the player's fingers is in fact to place (according to tradition) defensive turrets on several strategic points along the path of the various invasion armies; these angry (and particularly repulsive) aliens inexorably point towards the gates, which are present in a variable number depending on the type of map. Guarding the first gate (following the line of attack) is a robotic commander, the last defensive bulwark and assigned to various tasks that can be activated as the campaign progresses. In fact, if initially the task of the powerful Mech will be only to physically face the enemies who escaped from the turrets, by accumulating credits you will obtain other skills, such as the ability to repair damaged gates, to move from one gate to another, the activation of extra weapons and so on; moreover, the parameters of the mechanical officer can be increased according to the experience collected in combat, thus improving strength, health, firepower and morale. These typical elements of role-playing games are then accompanied by the reinforcements of the turrets, equipped with three power levels; at the beginning only the basic ones, equipped with automatic machine guns, and the explosive ones, capable of launching small bombs, will be selectable, but as usual, later in the game, anti-aircraft missile launchers, laser towers, reinforcements for defensive structures will become available (useful to connect the turrets together and thus increase their damage and fire intensity), as well as a special rotating structure designed to launch slowing waves, essential for the particularly fast and elusive hordes of alien insects. As mentioned, each type of weapon has three levels of upgrades, which can be done by consuming credits; for each killing of an enemy you get a single credit to which, at the end of each wave, a bonus is added proportional to the intensity of the attack suffered. Of course, the more destructive weapons are more expensive to upgrade than the basic ones, but the result obtained is very rewarding indeed. In addition to the land defenses listed above, in particular more agitated situations the weapons launched by orbital ships can come in handy, which can be recalled from the appropriate menu and intended to quickly clean up the playing area: they too can be unlocked, ranging from missile batteries to very powerful explosions up to the possibility of creating a special incendiary area, crossing which all opposing troops are instantly incinerated; however, the use of these weapons is not unlimited and you have to wait several minutes before using them again. Finally, there are also challenging boss battles, with super robots to be faced in the middle and at the end of the various waves of a level; during these attacks no credits are earned (it is therefore impossible to build new towers), but there is still the possibility of using, if any, the orbital attacks still available. The choice of artillery to be used in battle, both orbital and ground, takes place in the pre-game menu via the Armory; the weapon slots must be purchased using experience credits (therefore not the game credits needed to physically build the defenses) and the price will grow as the number of slots unlocked increases. Even technically, the work done for Sentinel 3: Homeworld appears flawless: high-resolution graphics, iPad compatibility, textureshigh quality, very stable framerate and really well done turret animations are combined with an excellent audio sector, both in terms of background music and explosive effects. A small (and very marginal) defect is found in the turrets positioned on the edge of the map: the upgrade menu, which can be activated with a tap, is in fact partially hidden, making the operation a bit difficult; to reduce the annoyance, especially in the presence of fingers that are not exactly those of a pianist, just perform a pitch-to-zoom in order to increase the ~clickable~ surface and thus proceed with the enhancement. Finally, we note the simultaneous support for Game Center and Open Feint, for a finally complete social experience. The tested version is 1.1.1 Price: 2.39 App Store links", "date": "2011-04-21", "grade": "9.2"}