{"name": "La recensione di Close Combat: First To Fight", "ref": "https://multiplayer.it/recensioni/la-recensione-di-close-combat-first-to-fight.html", "text": "The context of our operations will be that Lebanon which in recent weeks has been decidedly in turmoil Video game soldier Dramatic Current Affairs Although Close Combat has been in the works for over two years, at the time of its release it seems to be able to grasp the closest current events. In fact, the context of our operations will be that of Lebanon which has been definitely in turmoil in recent weeks. However, the events are the result of an imaginative scenario but up to a certain point given that there are many elements of similarity with the conflict situations still in Iraq. We will thus find ourselves in an urban scenario (moreover very likely) in which we will have to carry out various military operations always characterized by the presence of firefights with the local guerrillas. FSW and R6 As you will certainly have already understood from the images, the title published by 2K Games is a First Person Shooter decidedly based on tactics and strategy in which we will be at the head of a squadron to which we will have to give the necessary orders (no switch between the marines: we will impersonate always and only the ~chief~) for the success of the mission. If the background closely resembles that already seen in Full Spectrum Warrior, in reality the interactive dynamics can easily be compared to those of Rainbow Six with the various commands (also very similar) to be given to the whole team or to a single marine with a graphical interface (which can be called up via a very well studied command system) which is undoubtedly comparable to that of the Tom Clancy series. If the background closely resembles that of Full Spectrum Warrior, the interactive dynamics can easily be compared to those of Rainbow Six XBOX vs. PC Basically Close Combat in the two versions in which it is available, does not differ much. Clearly the minor hardware specifications of the Microsoft console compared to a latest generation PC, have caused a lowering of the resolution, a slight loss of detail and some problems in the frame rate which in some cases (fortunately infrequent) is significantly lowered. For the rest, the porting of the mouse and keyboard commands to the joypad has been done scrupulously. On XBOX we point out the pleasant addition of offline multiplayer via split screen for up to four players with a single console and we will also be able to connect two with the system link. Unmissable support for XBOX Live services. War aesthetics Moving on to a technical analysis of the title, it is immediately noticeable how the various delays that marked the release of the game are decidedly evident compared to the more aggressive titles in the reference genre (the usual ... Half Life and Doom 3). If the Middle Eastern polygonal constructions have been made excellently and almost all the game contexts are very full and realistic, just as we note an excellent care in the creation of soldiers and guerrillas, one turns up a little nose noting the low quality of the effects light, physics and the almost total lack of interaction with the environment. Looking at everything from a positive perspective, it must be said that the hardware requirements are definitely within the reach of (almost) everyone and on latest generation machines, we can run Close Combat at very high resolutions without any slowdown problems. Lights and shadows also for the sound component: all the effects are state of the art and the dialogues (partly in English, partly in Arabic) are imbued with tension at the right point. On the other hand, some jingles that mark some key moments of the action are excessively reiterated, such as the arrival of the air forces or the surprise ~cleaning~ of a room. War aesthetics Lebanon in company Before moving on to the final comment, it is appropriate to spend a paragraph talking about the multiplayer component of Close Combat. The game provides two possibilities: the cooperative mode and a classic death match up to 8 players. If the latter mode fails to emerge (even for a decidedly limited number of players at the same time), the cooperative instead gives way to 4 players to face all the missions in single by controlling the whole squadron. This is precisely the strong point of the game, so much so that we advise you to play it directly in company to experience First To Fight in the best way from the very first moment. The cooperative mode (preferably in 4) is the strong point of the game Comment Without distorting, revolutionizing or touching qualitative peaks never reached, Close Combat still carves out a place in the sun among tactical team shooters. A little Full Spectrum Warrior (for the setting), a little Rainbow Six (for the command system), the published titleby 2K Games is clearly aimed at those who love war scenarios characterized by a strong resemblance to reality (we are in Lebanon, but Iraq does not seem to be so different these days). Some small flaws can be found in some situations in the artificial intelligence of our fellow soldiers and even the visual appeal is certainly not comparable to the more famous FPS. Despite this, thanks to a good construction and variety of environments, to the continuous tension that is breathed in every moment, First To Fight is a title to be recommended to fans of the genre (and of the ultra-realistic background), especially if they like to play it in company: in cooperative mode (even better if in 4), Close Combat is undoubtedly experienced in the best way. Pros: Cooperative mode Ultra-realistic background Voltage always very high Cons: Technically far from the most famous FPS The AI of fellow soldiers sometimes goes into jujube soup Online death match only for 8 players During the 6 game missions set in absolutely well-constructed internal and external locations, the tension is always very high since a few moments of a second are enough in which one of our marines or ourselves will be within the enemy's field of vision to be killed and don't think you can use quick load & save since the game unfolds through the arrival at various checkpoints located within the various missions. Forget about any use of mechanical means other than some fixed machine guns that you will find from time to time: however, you will have the air ~cavalry~ on your side that you can call up at specific moments to literally wipe out some guerrilla outposts. We must point out some demerit notes in relation to the artificial intelligence that controls the movements of our soldiers: in general the AI of fellow soldiers is absolutely excellent but in some situations it seems to absolutely lose its ~head~ and behave in a completely irrational way, leaving the marines at the total mercy of our enemies. Who knows if a repairing patch will arrive in this regard Video game soldier The relationship between American military forces and the world of video games is getting closer every year. Many of you will already know that some titles marketed for the general public are created specifically for promotional reasons in favor of enlistment (a similar operation was also performed a few years ago by our armed forces with a pleasant vertical scrolling shoot'em up distributed for free on Internet) but the video game medium is also used as a form of virtual training to enable soldiers to simulate possible situations which they will then face in reality. Close Combat: First to Fight was born as a commercial adaptation of a software specially created for the marines capable of simulating urban warfare situations. Despite camping everywhere that this title has not received ~official approval~ from the American armed forces, it must however be said that CC has been shaped with what are the rules of engagement (of course talking about it after the Calipari case takes a bit ' uncomfortable ...) for such situations and also uniforms, weapons (in fact we will have the exact same endowment of the ~real~ marines) and language have been slavishly taken from reality also thanks to the collaboration of dozens of marines who personally gave suggestions for the making of the title.", "date": "2005-05-10", "grade": null}