{"name": "Tiger Woods PGA Tour 12: The Masters", "ref": "https://multiplayer.it/recensioni/87630-tiger-woods-pga-tour-12-the-masters-tiro-da-maestro.html", "text": "Version tested: Nintendo Wii Thirty-five years old, two children and a divorce caused by the well-known scandals that broke out in late 2009, Tiger Woods is still the most famous and most successful golfer in the history of the sport. His recent misadventures have inevitably tarnished his enamel, causing him to finish in fifth place in the world rankings, but the sports division of Electronic Arts has never stopped focusing on his popularity and this year he is increasing the dose, adding to the already numerous modes present in the game dedicated to him the possibility of playing the prestigious Masters tournament, which Woods won four times in his career. Tiger Woods PGA Tour 12: The Masters therefore presents itself as the most complete edition ever made for this franchise, a real feast of content, capable of keeping golf enthusiasts busy for weeks. Furthermore, as regards the gameplay, the possibility of playing using the Wii-mote alone or combining it with MotionPlus or even with the Balance Board adds a great depth to the experience, which becomes even more multifaceted and guarantees to detect in the most precise way possible not only the trajectory of our swing, but also the balance of body weight while we swing it, translating all this information into a more or less successful shot. Masters of the Universe Once the game has started, it is possible to play a quick match or try the more complex and articulated modes. Among these stands out the ~Road to the Masters~, a career that sees us start from the amateur leagues and local tournaments to slowly arrive at the professional league, while improving our character's skills in terms of power, precision and how much other. We can create our avatar using a simple editor, then jump into the fray to test our skills and earn the necessary experience for subsequent challenges. Whatever the length of the race we are running, the mechanics remain the same and are easily accessible. In fact, our player is accompanied on the field by a spotter who basically provides him with two suggestions for each shot: the safe approach and the aggressive one. The first guarantees the best result with the minimum effort, aiming to get the ball to an area perhaps not very close to the hole but with greater guarantees of success of the throw, while the second asks us to take some risks to get something more. The selection of the club takes place automatically, based on the distance and/or the suggestion we intend to follow, however we can decide to try a different tool if we believe it lends itself better to our strategy. The only problem is that to select it we will necessarily have to use the infrared pointer of the Wii-mote: a somewhat cumbersome procedure, which could certainly have been made faster. By pressing the ~-~ key on the controller we can view the hypothetical arrival area of the ball, then use the d-pad to change it. At this point, it's finally time to proceed with the swing: by pointing the Wii-mote downwards and holding down trigger B, we have to move just as if we were holding a golf club in our hands and start the shot accordingly. It is at this juncture that the difference between the normal control and the one with MotionPlus is felt most, giving in the second case a better feeling which however also requires greater precision, if we do not want the ball to end up far from where we imagined it would arrive . If the variables that regulate the swing are numerous, in the same way the ~putt in~ turns out to be a far from trivial operation and indeed requires a lot of practice to be able to master it. The behavior of the ball in the area closest to the hole is in fact influenced by the inclination of the ground, as well as by the power and direction of our shot. These are few factors, numerically speaking, but which in practice can really cause us trouble, with the ball ending up long as if we had hit it with all the strength we have, it remains stationary on the edge of the hole or even ~bounces~ there above due to excessive acceleration. Honestly, we would have preferred a more permissive approach in such a delicate phase, or at least the possibility of activating a greater number of aids to avoid the inevitable episodes of frustration that accompany the repeated failure of an apparently trivial ~putt in~. Content issue As mentioned above, Tiger Woods PGA Tour 12: The Masters is distinguished by the enormous quality of modes availablebile. In addition to the career, it is in fact possible to try the ~Tiger at the Masters~ mode in which we can precisely take on the role of Tiger Woods and retrace his fourfold experience in this prestigious tournament, trying to get closer to the real results obtained by the player. There are also many other modes, divided into two categories: ~Golf Games~ and ~Party Games~, the latter designed to have fun with friends in a carefree way and also including the nice mini-golf. Finally, it is possible to access the EA Online service to challenge friends or complete strangers in simple or ranked matches, or by creating small tournaments. The multiplayer works well in terms of matchmaking, but in practice it is a bit disappointing, given that in fact you play simultaneously and you can only see your opponent's shot trajectory, marked by a red trail. Finally, let's move on to the technical aspect, which was the Achilles' heel for the 2011 edition of Tiger Woods PGA Tour and which, without too many surprises, proves to be mediocre once again. Beyond the polygonal models, characterized by slow animations and a general lack of detail, the scenarios are bare, with low-definition textures, even devoid of the public and with barely discreet vegetation. The sound doesn't do any better, given the small number of effects and a fairly limited and repetitive technical commentary in English.", "date": "2011-04-20", "grade": "8.5"}