{"name": "L'arma segreta", "ref": "https://multiplayer.it/recensioni/87635-magicka-vietnam-larma-segreta.html", "text": "Magicka takes us to Vietnam with an expansion that makes fun of the trends of an all too generous videogame market in terms of military-style titles. But with this DLC, Arrowhead Game Studios also takes the opportunity to bring a breath of fresh air to the mechanics of their title. Unfortunately, starting Magicka after installing the DLC, the first thing you feel is a pinch of disappointment. In fact, the update does not contain any campaign but only two new challenges. The first is a classic wave arena, obviously set in the Asian jungle, and the second is a prisoner rescue mission. And it's when you start with the mission that a portion of the disappointment vanishes. Although it is a single picture to be completed in the shortest possible time, in fact, the level is rich, wide and full of challenges. In addition, the expansion provides us with a new themed spell, or a smoke grenade capable of calling a napalm bombardment. But the heart of Magicka Vietnam is represented by the weapons among which we find the good old M60 flanked for the occasion by Kalashnikovs, single-shot rifles, M16s, missile launchers and so on. Fire at will The arrival of firearms, which are not the exclusive preserve of our character, substantially alters the playability of Magicka. Goblin hordes no longer attack in close combat but hide behind crates and trenches by shooting from a distance. And the change also involves the more corpulent monsters who, unlike the Viet-goblins, do not hide but can riddle us with more powerful weapons. The gameplay is therefore substantially transformed compared to the original formula and a good part of the frustration linked to some situations of the first title disappears here, however replaced by the frustration of never having to die. In fact, the rescue mission is designed as a time trial with only one life available and this means that there is little room to try your luck with suicide missions. The approach must therefore be tactical and when too many enemies form a common front by targeting us with tons of bullets, the right use of napalm becomes fundamental, which is revealed with the classic trail of hellish fire. Butchery meat Magicka Vietnam is a sort of mix between Cannon Fodder and the original title, all enriched by the possibility of ducking to avoid shots and by the new objectives which, just like in the Sensible Software title, include the destruction of particular buildings to stop the influx of enemies. Spells obviously remain an effective way to resolve situations but it is also possible to tackle the mission based exclusively on a ~shoot and hide~ type gameplay. The arena, on the other hand, is more classic with enemies appearing at a short distance forcing us to use area spells and magical traps. On the technical side, the title does not present any significant innovations, while from an aesthetic point of view, vegetation, structures and enemies have undergone a complete restyling. There is no shortage of excellent light effects and, scattered around the mission map, there are explosive barrels and crates which, in addition to enriching the gameplay, allowing you to involve your opponents in large explosions, increase the feeling of being in the middle of a war. A sensation also enhanced by the sound of whistling bullets and the soundtrack inspired by the rock sound that made Vietnam famous in popular culture.", "date": "2011-04-18", "grade": "8.0"}