{"name": "Alla ricerca dell'oliva perduta", "ref": "https://multiplayer.it/recensioni/87406-sr-mistu-alla-ricerca-delloliva-perduta.html", "text": "Sometimes a particular graphic and a well-edited trailer are enough to attract the attention of those on the App Store who are looking for a good alternative to a cup of coffee. And if the title in question is also original in its mechanics and, heavens, fun to play, then it's really the best. This is what Marc Sallent and Cinta Vidal, the duo behind the independent label We Choose Fun, immediately understood by creating Sr. Mistu, a small and nice puzzle game that is gaining various appreciations thanks to its stylistic taste and extremely simple. The extravagance of the game can already be seen from the bizarre premise: Mr. Mistu, a blind man who lives in the company of his guide dog, decides to leave the house and set off on a long and unpredictable adventure. Its purpose? Find the olives he needs to prepare a delicious pizza. A journey full of style Obviously, in order to cross seas and mountains in search of his desired olives, Mr. Mistu must rely on the help of his four-legged friend, who will lead him through the various game levels trying to avoid the obstacles scattered here and there. Each scenario, a small urban glimpse seen from above, represents an enigma in which the player, by tracing a path in a similar way to what was seen in Flight Control, must show the furry person the way to follow. In doing so you can be hit by a car, you can collide with a passerby, you can step on poo on the sidewalk or even be crushed by a piano in free fall: in these cases you are forced to start the level from the beginning , although the trace left in the previous attempt allows you to adjust your route from time to time. As mentioned, to overcome an enigma it is necessary, as mentioned, to reach the exit of the level, but those who want can devote themselves to collecting the three hidden olives, satisfying both casual players looking for a simple experience and those who want to keep busy with something more challenging. Unfortunately, the game's most obvious defects emerge when you want to trace the route to follow, since with your finger you often end up covering obstacles and important slices of scenery, while to collect an olive you need to cross it with extreme precision. It happens all too often to miss one by a millimeter, or to be forced to make small spins on the spot to be able to grab it. This is far more of a problem than long loading times, although hopefully future updates will no longer have to wait five to ten seconds to start a level. However, it is in her very original artistic style that Sr. Mistu makes up for it: everything, from the objects on the street to the buildings, from the game menus to the cutscenes, was drawn by Cinta Vidal using pastels on paper. A big job that led the young Spanish artist to create and animate more than 400 elements, with the result that the whole game looks like a wonderful illustrated book for children. It's almost a pity that, not being compatible with iPad, the entire graphics of Sr. Mistu can only be appreciated through the screen of a smartphone, thus risking neglecting some details or, alternatively, losing a few tenths of sight. When everything starts to feel familiar, the game amazes once again by moving the whole adventure to an underwater environment, while Mistu's story is accompanied by a passionate and bucolic song created by the Dutch indie band The Black Atlantic. Level after level we thus reach the end of the game, moreover in a rather cold way: everything is over too quickly and to welcome us there is no nice interlude scene, as one would expect, but a skimpy screen that promises us new worlds, characters and strategies with the next updates. The tested version is 1.0 Price 0.79 App Store links", "date": "2011-04-14", "grade": "7.7"}