{"name": "Metal Gear Acid", "ref": "https://multiplayer.it/recensioni/metal-gear-acid.html", "text": "A strange gear However, unlike what it was legitimate to think, the debut on Psp of Kojima's creature turned out to be very different from what everyone expected. In fact, with a surprising move to say the least, Metal Gear Acid, this is the name of the game in question, does not follow the action-stealth trend that the series itself has practically created. In contrast, Acid is a turn-based strategy game. You read that right, we are talking about that genre to which titles such as Front Mission, Final Fantasy Tactics and Disgaea belong, just to name a few, even if the comparison is rather forced for a whole series of reasons that we are going to explain. In fact, Konami has decided to put another particularly popular genre into the pot, that of card games, so much so that at the end of the fair Metal Gear Acid on Psp is anything but a game in the Metal Gear series as we are used to knowing it. The game structure is in fact quite complex, as well as made even more tangled by a cloyingly incomplete tutorial and a paper manual also devoid of any information in this sense. It therefore remains for the player to try to understand step by step the system of rules to which the game is subordinated, the latter factor further burdened by a bland and extremely slow pace of play. In a nutshell, each turn 6 cards are made available to the player drawn from the main deck, which can be used on the basis of their individual characteristics (i.e. shoot, perform an action or obtain a bonus), or converted into movement. In the latter case, the option is given to move a certain number of squares within the setting, which is precisely divided like a chessboard exactly like the most classic strategic ones. In any case, each of your actions must be evaluated on the basis of the ~Cost~ points, which are obviously in very limited quantities, thus requiring a careful analysis of the actions to be performed during your turn. Unlike the strategic ones that we have been accustomed to knowing so far, Metal Gear Acid does not put the player in control of a group, but - except on rare occasions - of a single character (obviously Snake). This element is rather difficult to appreciate, since it reduces the possible tactics and imposes a rather flat game conduct: move, locate the enemy, hit or avoid him, and then again. Snake, Snaaaaake! Obviously, to justify the use of the name ~Metal Gear~, the Konami programmers have placed the game within a context that is extremely familiar to fans of the series. The protagonist, as already mentioned, is the usual Snake, this time engaged in thwarting yet another threat from a group of terrorists who hijacked an airplane flight on which a candidate for the presidency of the United States was traveling. Although the story narrated takes up the concepts traced by Kojima, the result does not prove to be up to par. First of all, there are repetitions of concepts already seen too many times in the course of the series, see the infiltration of an enemy base that is aesthetically too similar to that of MGS 2. Secondly, in an attempt to instill those intriguing aspects of the plot that have become one of the trademarks of the series, the developers have exaggerated giving life to some characters that are far too bizarre, and weighing down the narrative with dialogues and frankly avoidable details on more than a few occasions. The general feeling, playing Metal Gear Acid, is precisely that of being faced with a title with good potential, but developed in a way that is not fully satisfactory and above all debased by a soporific pace of play for most users. A pity, because despite the development of a chapter faithful to the original game structure it would certainly have enjoyed enormous success especially in the face of the certainly not overabundant software park currently available on Psp, even the idea of bringing the Metal Gear universe within a different gameplay it was by no means to be rejected a priori. As things stand, however, Acid is a title with just enough content, partially raised by a technical aspect that only confirms the potential of the Sony laptop. Although it cannot be compared to what was seen on Ps2, the glance offered by this episode on Psp is truly remarkable, with well-defined characters, environments rich in detail and high quality textures. The animations, on the other hand, are woody, but this is a defect that the series has been pursuing for a long time. Comment Metal Gear Acid is a title that struggles and convince. An unconvincing, soporific and not at all original plot accompanies a gameplay that has nothing with the series in questionto do. Although this should not be considered as an a priori defect, the Konami production never manages to really involve the player during its development, the victim of a game mechanic initially obscure by a completely insufficient tutorial, only to later reveal itself simply boring and little variety. A bitter debut of Snake on Psp, in the hope that his future return to the Sony laptop will prove faithful to the gameplay that we are used to associate with his name. Pros: Technically very good Initially intriguing Always fascinating setting Cons: Boring and poorly developed mechanics Game pace too bland Brand not suitable for this kind of gameplay Beyond the cold numbers regarding polygons per second, cpu and special effects, what really determines the success of a console are quality games. Even better if they are famous names, capable of attracting even casual gamers and at the same time giving credibility and solidity to the system on which they run. Sony knows the lesson very well and with Psp, its debut in the world of handhelds, wanted to recall some of the most famous brands in the world of video games. Including a certain Metal Gear from Konami", "date": "2005-05-06", "grade": null}