{"name": "Quando il calcio incontra il 3D", "ref": "https://multiplayer.it/recensioni/87252-pro-evolution-soccer-2011-3d-quando-il-calcio-incontra-il-3d.html", "text": "What will be the next evolutionary step of football video games? Perhaps photorealism on a graphic level, or rather the development of increasingly credible and humane artificial intelligences, or even a more precise and accessible control system. Perhaps all these elements will go hand in hand in the same direction, maintaining the basic structure that has characterized the genre for years. Yet what is probably missing from the formula we are used to knowing and appreciating is greater involvement within the action and the playing field itself; today the user is a kind of deus ex machina, a superman who observes from a distant and privileged point of view, controlling his players like puppets. Taking advantage of the launch of the new Nintendo portable and its peculiar characteristics, Konami has decided to recover a concept that is certainly not new, namely that of the camera positioned right inside the green rectangle at eye level, but evidently intended according to the intentions of the Japanese team to find new lymph and perhaps definitive consecration thanks to the three-dimensional effect of the 3DS. Mission accomplished? Fluidizing fullback The answer, quite honestly, is no. The ~player~ view, i.e. the one mostly used as a promotional vehicle for this PES 2011 3D, in fact confirmed all our perplexities raised since the presentation of the game during the review phase; in practice in this case the camera positions itself just behind the controlled player's shoulders, always keeping the ball in the center of the screen. What does factual evidence mean? Simple: a continuous series of rotations and movements that deprive the sense of direction and create an unsustainable confusion even just to move one's player, let alone to create noteworthy actions. In fact, the narrow visual angle prevents you from having a perception of the position of your teammates as well as of the opponents who come up behind you, heavily limiting team play in favor of cloying and unrewarding individual actions. The defense phase is even less manageable, in which one ends up being totally at the mercy of the incursions of the opponents. Certainly the 3D effect is pleasant, and brings with it a real feeling of involvement and ~presence~ which however fails in any way to compensate for the limits it implies to the gameplay. Thinking that it is enough to move the visual angle inside the field to replicate the sensations of Messi or Cristiano Ronaldo is a naivety that soon shows its inconsistency. Even worse is the ~normal close~ view, which while maintaining a similar position blocks the rotation, remaining fixed parallel to the sideline. A totally unmanageable solution that prevents even just from seeing what is more than two meters away from the controlled footballer. A little more tolerable is the ~near vertical~, which however appears once again unable to guarantee a sufficient view of the field. Up to here the negative notes, if not inconceivable considering that they come from a team that has been dealing with football games for a lifetime. Fortunately, there are two other shots in addition to the bankruptcy ones just described; more conservative, less forcibly linked to the three-dimensional element, and for this reason simply more suitable for supporting a game mechanic that was born with this type of camera in mind. This is the classic ~wide angle~, in reality unfortunately not very wide nor adjustable in the zoom, but sufficient to immediately restore the sensations of the ~real~ PES; and the ~vertical wide angle~, placed on the short side of the field but very high up, so as to allow an almost complete view of the team and the movements of the players. A solution, the latter, that is worth trying, even to enjoy a bit of 3D effect without necessarily having to overshadow the playability. The 3D effect Among all the titles of the launch, PES 2011 3D is certainly one of those that prove to be more effective in demonstrating the goodness of the three-dimensional effect of the new Nintendo laptop. Although obviously in a variable manner in relation to the shot used, the sense of depth actually gives something more to the experience in the representation of the playing field, as well as in guaranteeing greater ~physicality~ to the players. The usual PES If PES 2011 3D tries, albeit failing, to amaze and change the cards on the table with regard to the visual aspect, where it does not bring anything new is in the game mechanics. In a nutshell, it is the same PES seen on PSP, which in turn was an adaptation of the chapters for PS2. The gameplay is therefore valid albeit familiar, perhaps even too much forlongtime gamers who have followed the development of the Konami series over the years; we are certainly talking about what was considered the absolute masterpiece and paradigm of the genre only a generation ago, but it is also true that the evolution of the recent chapters on the home console has brought so many new features that the gap now appears really marked. PES 2011 3D remains a pleasant product, immediate and without too many frills, but which cannot fail to have an ~already seen and already played~ flavor for those who have collected hundreds if not thousands of games with the various episodes for Ps2. Whether this is a positive or a negative element depends on one's tastes; the important thing is to know that on 3DS Pro Evolution Soccer this is a title that in this guise has begun (not today, by the way) to show its age. Turning instead to the game modes, it is a pity to note that, evidently due to the time limits imposed for the day one release of the console, the offer has definitely been narrowed down to a handful of options. In addition to the exhibition match, the single player, even deprived of free training, limits himself to offering the choice between the Champions League and the usual Master League, with the latter obviously destined to occupy the player for most of the time. The absence of online multiplayer weighs a ton therefore in terms of overall longevity, and local wireless can do very little with which to challenge a friend in the flesh. Little more than a note for the StreetPass support, thanks to which your own Master League team can automatically face that of any other 3DS users you cross on the street. As for the technical component, as mentioned, this is largely borrowed from the PSP version, with some slight improvements especially in the faces of the most representative players; on the other hand, the elements on the sidelines are very bare as is the audience, made up of a grainy texture that is even ridiculous during replays. The lower screen is instead used to house the radar and up to four tactics, to be applied with a simple touch of seamless action. On the other hand, the menus are worth mentioning, really ugly and with a microscopic size of the text characters.", "date": "2011-04-07", "grade": "7.6"}