{"name": "La Sfida del Clone", "ref": "https://multiplayer.it/recensioni/87124-rift-la-sfida-del-clone.html", "text": "Launching a new MMORPG is never an easy thing. It is said that it is almost a tradition that the first days of activity are undermined by problems, queues, lag and other amenities that generally raise a fuss and cast a shadow on the new product which will then be difficult to shake off. Even World of Warcraft, now considered the King of this very particular videogame genre, had a turbulent launch to say the least. Well, that wasn't the case with Rift. The Trion Worlds MMORPG surprised everyone with one of the best launches in living memory: on day one everything went smoothly and the servers proved to be rock solid, despite the large influx of players. In the following days, Rift confirmed the already excellent impressions it had during the Beta phase: a very stable client, fast and precise support, practically non-existent bugs and technical problems. A heavenly launch, in short, which made excellent publicity for the brand new IP of this anonymous software house. But does the game also deserve as much praise as its launch itself? Welcome to Telara Rift has achieved a certain notoriety in recent months mainly due to the aggressive advertising campaign with which Trion Worlds has launched a real challenge to the giant of Blizzard Entertainment. The slogan ~forget about Azeroth~ may seem a bit cheeky, and indeed it is precisely because Rift appears from the very first minutes as a real World of Warcraft clone. Over time it is also discovered that the developers were inspired, so to speak, by other products, first of all The Lord of the Rings Online. This strategy is not entirely condemnable: rather than try their luck with completely new and risky concepts, the Trion Worlds guys seem to have literally investigated the players' preferences to propose the best features of the most popular MMORPGs of the moment within a completely new package. Rift is a ~theme park~ MMORPG that includes a PvP component in the form of the conflict between the two opposing factions in the game, the Guardians and the Defiants, both grappling with the invasion of entities that belong to other ~planes~ of existence , especially the demonic dragon Remulos. Rift is based on a totally new lore and Trion World has done its best to develop a narrative background of a certain thickness, although at times it takes itself too seriously by leveraging real clichs already cleared by practically any fantasy genre media especially video games. Fantasy without fantasy? The main problem of Rift is in fact precisely this, that is a total artistic anonymity both from an aesthetic and conceptual point of view. Technically, the game is very solid: the polygonal models of characters and creatures are more than sufficiently complex and cared for and enjoy excellent and fluid animations; above all the quality of the settings is surprising, rich in details and details. The world of Telara offers truly fascinating panoramas and above all amazes the extension of the field of vision and the excellent geography that makes each location extremely realistic and never boring, often developing also in height. There is no shortage of graphic tricks that embellish the glance, between dynamic shadows and particle effects of all kinds. Even more striking, the excellent visual complexity does not affect the most chaotic game situations in any way and the performances remain stable even in the presence of numerous players and enemies. The Guardian capital, Sanctum, is a small keep connected to the mainland by a stone bridge Having said that, it is really difficult to be surprised in front of the Rift's art-direction which is basically based on an almost banal fantasy style without particular inspirations or original and characteristic touches of class. The seamless world of Telara is inhabited by humans, elves, dwarves, fairies, dragons, ogres and other creatures that belong to Western fantasy, and particularly European, without strokes of genius or particular inventions that attract the player's attention; even the various settings struggle to intrigue us, proposing clichs such as the enchanted forest, the haunted swamps, the desert, the snow-capped mountains and other inevitable locations in the fantasy imagination. Luckily, Rift is one of the few MMORPGs currently on the market that effectively encourages exploration and detours from the pre-set paths to the next quest or objective through clever play within the game, in the form of special items to find. to complete ~artifacts~ or real environmental puzzles or secret treasures to be reached by solving puzzles or platform-like paths.Soul and body As already mentioned, Rift is a ~theme park~ and the structure set up by Trion Worlds is very similar to that of World of Warcraft and especially of its latest expansion, Cataclysm, with small hubs in which to receive and complete quests that take us hand leading us to the next destination. At the beginning of the game, you have to decide your own vocation among the four available (Cleric, Warrior, Rogue and Mage) which basically outline our basic skills and the type of equipment we can wear, as well as the nine specific ~Soul~ related to that vocation. Within a handful of quests the player thus finds himself in possession of three Souls and subsequently will be able to obtain others: the Souls are basically the ~classes~ and the player can possess three at a time. The Soul system is a curious hybrid between the World of Warcraft Talents and the Final Fantasy XI Job System: each Soul corresponds to a skill tree that players can climb by spending the points bestowed at each level-up, thus obtaining bonuses and earning, as a consequence, the peculiar skills of that specific Soul. In a nutshell, you can customize your character to your liking, distributing the points on the selected souls in order to create ~builds~, to use a term known to fans of the MMORPG genre, which meet the player's needs. Wizards are the least versatile class in the game but also one of the most spectacular and powerful On paper, the Soul system offers enormous variety and creativity, but in practice, as you progress through the levels, you realize that it is almost necessary to follow a certain process in the composition of the Souls and in the distribution of points in order to create effective rather than hybrid builds, neither fish nor fowl, following the usual rule of role-playing archetypes (tank, damage dealer, healer). If at the first levels it is therefore possible to create Rogues capable of covering the role of tank, the same cannot be said at the higher levels, when certain skills or characteristics are necessary, which can only be obtained by distributing as many points as possible in a certain Soul. However, it is not a real drama since the game basically offers thirty-six ~unique~ classes, although some of them are very similar, to be complemented with the skills of the associated Souls. The variety of solutions therefore translates into the possibility of creating multiple builds at the same time and switching from one to the other almost at will, a bit like with the Dual Spec in World of Warcraft, to adapt to the various game situations, for example by designing builds to face content alone or builds for company matches, not to mention the need to create builds with fundamental skills for PvP, such as crowd-control or resistances to specific spells. Don't open that rift The quests in the Rift are unfortunately nothing particularly original and mostly all consist of collecting a certain number of objects and killing a certain amount of creatures, rarely detaching themselves from these types, which are repeated numerous times as we cross a certain area. The structuring made by the developers is convincing but at times the game design tends to linger too much on certain areas or portions of a certain area, forcing us to visit them several times and helping to produce a feeling of unpleasant redundancy. To weigh down this situation there is also a not exactly ideal arrangement of hostile creatures and a rather rarefied positioning of the connection points for rapid transport, elements that tend to disorient the player, prolonging their movements. There are two factors that help break up this slight monotony. The first consists of the ~Rifts~ that give the game its title, essentially dimensional portals which, from a strictly playful point of view, represent the evolution of the Public Quest concept developed by Mythic in Warhammer Online: Age of Reckoning. The Rifts appear as portals suspended in mid-air from which creepy tentacles and dangerous creatures emerge In fact, these are events generated randomly and with considerable frequency within each area, with variable difficulty, so much so that they can require a single player to entire groups to be addressed. Participating in one of these events is disarmingly simple: as soon as you arrive nearby, a click will be enough to automatically join the group of players engaged in the battle and an ingenious calculation of the contributions will take care of assigning each player the rewards he deserves. The Rifts can also appear en masse, during real interdimensional invasions that require a certain teamwork to be rejected, withmuch of final raid-boss. The idea works and the experience points, the special currencies to buy powerful items and the random rewards encourage players to participate in as many events as possible; however, in the long run the events tend to turn out to be excessively similar and repetitive, so much so that we end up ignoring them to focus on other content. Sometimes they even manage to be more annoying than profitable, especially when they appear in areas that affect certain quests and there aren't enough players to close them: at that point the only thing to do will be to focus on something else. Other content We mentioned PvP, which is perhaps the weakest element of the package in the Rift. To date, Trion Worlds is engaged in the development of corrective patches aimed at balancing the classes in PvP and PvE, a titanic undertaking that not even Blizzard, in five years of World of Warcraft, has managed to accomplish with unequivocal success. Rift's PvP is very generic and based on the skills of the classes, which makes some combinations of Soul inarguably more suitable for fighting than many others. A PvP battle can take place at any time, in the dedicated servers, or in the Warfronts, in practice the Trion Worlds version of the World of Warcraft Battlegrounds or the Warhammer Online Scenarios. In Codex players have to conquer certain areas and keep them under control for as long as possible They are essentially instanced zones in which two teams of players, previously enrolled in a cross-server queue system, beat each other hard to achieve objectives that resemble the typical capture-the-flag or conquer & defend. By winning a PvP battle you get special points useful for buying peculiar equipment, in short, nothing new under the sun. Between one PvP battle and another, players can still try their hand at crafting, which in the Rift does not particularly shine for its originality or usefulness. Commercial professions are typical of the genre and include alchemy or the production of fabrics and armor, which can be associated with other professions that can provide primary materials. The interface of the professions is very simple and intuitive but the actual process is far from exciting since it is only a matter of pressing a button. Moreover, the usefulness of the objects produced by the players is relative, since quests and dungeons are perfectly capable of providing equal if not better alternatives. However, crafting is an element of the game that provides a certain level of autonomy and contributes to the economic stability of the server in which it is played: there is no shortage of money in the Rift and the practical and immediate auction house is a clear example of this. If it is clear that the developers have drawn inspiration from the success of World of Warcraft, we can only be happy in the case of the Rift dungeons which are certainly the strong point of the game. These instanced areas in which some quests and narrative lines culminate have been designed keeping in mind the quality and the best features of the Blizzard blockbuster and have left us pleasantly surprised by their variety, complexity and balance. It's a real shame that Trion Worlds hasn't come up with a feature that allows you to queue up to automatically join a dungeon, a problem that forces players to search for groups for hours or to rely mainly on guildmates. The dungeons are not particularly extensive and take about an hour or so to complete by a properly equipped skilled group; each area offers the usual dose of lower threats interspersed with much more complex boss fights that require a certain strategy to be shot down. The learning curve conceived by the developers is really excellent, the first dungeons offer a fair level of challenge without risking being excessively easy, immediately forcing the participants to plan their actions and play as a team. Some encounters have proved to be truly original, often introduced or developed through narrative elements such as characters and real-time dialogues that make the experience decidedly more immersive. Darkening Deeps is one of the first dungeons in the game but it features really challenging bosses like the werewolf Michael Bringhurst or the giant arachnid Tagenar Deepfang Naturally, the most powerful creatures drop items as rewards, and a practical interface absolutely identical to the one proposed by the usual World of Warcraft allows you to roll the virtual die in the hope of winning the item. The setting is really very similar to that of Blizzard or Turbine's MMORPGs, but much better than similar experiences proposed, for example, in Warhammer Online or Aion. In the heat", "date": "2011-04-05", "grade": "8.0"}