{"name": "Il 3D  il migliore amico dell'uomo", "ref": "https://multiplayer.it/recensioni/87099-nintendogs-cats-il-3d-e-il-migliore-amico-delluomo.html", "text": "Nintendogs was an extraordinary success, perhaps the very first Killer Application for a system, the DS, which despite the presence of a very wide variety of ~traditional~ video games of all kinds and of great quality, has earned a reputation that he then never managed (perhaps he didn't even really want to, given what this led to in terms of sales) to get rid of, that of a console for ~casual gamers~ when not even for non-gamers. It is therefore not surprising that among the very few Nintendo games that accompanied the launch of the new laptop there is the new version of the casual game par excellence. What's new in Nintendogs + Cats? For the console on which we find it there cannot be the use of 3D, from the title we deduce that this time in addition to the dogs we will be able to give virtual love also to the very tender kittens, and then what? Let's go find out. What tenderness! When you first start the game we find ourselves catapulted into a kennel where we have to choose our first puppy dog: three breeds are offered to us (depending on the version of the game in your possession among the three available on the market, but in the end all the breeds are unlockable in all three versions), after which we can select the sex and color of our new puppy, and each puppy has a different character which is then admirably reflected in the game. Once he enters the house, our new friend needs to settle in, and to do this there's nothing better than teaching him his name, which from now on he will recognize every time we pronounce it into the 3DS microphone, and give him a first dose of pampering, obviously thanks to the touch screen. From here on, the real simulation begins. The possibilities available to the virtual breeder are numerous: in addition to providing for the puppy's essential needs, giving him food and drink, keeping him clean and making him feel loved and pampered, we can first of all teach him commands, up to three a day. They range from the most basic, like sitting down and giving a paw, to real ones stunts; for each command there are exhaustive tutorials, and once he learns one, the dog will execute it every time he hears it pronounced. Then you can go for a walk: while in the first episode we could plan the route and decide the area of the city to explore, this time it's the game that decides where we go, thus losing the sense of exploration. Along the walk, however, we can do many things: first of all, the puppy will take advantage of it for his needs (remember not to leave dirt around!), then we will be able to meet other animal lovers who, in addition to giving advice, will let our puppy interact with the them (and when the affinities are evident, we can even establish an ~appointment~ between the two little animals), and finally we can stop in certain places such as the bar to spoil ourselves and our dog a little, the gym to train in running and the park to practice with the frisbee... These games to play with the puppy are not an end in themselves, but functional to what is the most playful part of the title, namely the competitions. There are three types, Frisbee and race precisely plus the obedience competition, divided by ~difficulty~, and in the end they are the only way to earn some pennies with which to then buy tons of different material , from croquettes to water, gradually up to accessories to dress up the puppy, to furniture to furnish the house and to a new puppy, this time also a cat, if you like. In addition to all this, we can also play with the dog not for ~profit~, i.e. not in view of a competition, using objects such as balls, balloons and even old shoes, listen to some music with him by buying records in the appropriate store and finally simply watching it ~live~, which becomes fun if you have more than one puppy, perhaps of different species, in the house and observe them interacting realistically. The 3D effect Used with sobriety and skill, and perhaps for this very reason, really pleasant. It doesn't tend to give the impression that the game elements ~leap out~ of the screen, except when the puppy approaches us to bring us a gift or to say hello, but rather it can be compared to a window from which we look at the game world . Thus it is the depth, rather than the spectacularity, that is very well rendered, which adapts to the structure and philosophy of the game, giving a certain life not only to the animals, which are already very gifted by themselves, but also to all the environments. From a Nintendo game we could only expect one of the best uses of 3D in the launch lineup, and from this point of view we can consider ourselves morehow satisfied. Has Fidanken At this point, anyone who has already experienced the thrill of raising a virtual puppy on DS will find themselves with a heavy sense of deja-vu: and not without reason, because the previous paragraph, cats and how the walk works aside, could very well refer even at the first Nintendogs. So what's new? Let's obviously start from the cats, about which, however, there isn't much to say: the realism that permeates the game in fact translates into the impossibility of interacting with the felines in a wide and varied way. Cats are independent animals, and even if they certainly don't disdain cuddles and games, teaching them commands, training them for competitions, taking them out for a walk would not make sense, and therefore it simply isn't foreseen. Their behavior is superbly reproduced and watching them play or fight with the puppies is hilarious, but this is where the kittens' contribution to the formula stops. The other two innovations are linked to the functionality of the console. The first is the combined use of StreetPass and pedometer: putting the game in sleep mode and carrying the console around translates into a real walk, which will make the puppy happier the longer it has been; moreover, if along the way we cross another 3DS with the game at rest, the two consoles will exchange data and gifts. The other novelty consists in the use of augmented reality, which gives us the impression of having the puppy in the environment that surrounds us, without particular playful implications but with the possibility of taking beautiful photos to review in 3D. One point where the game really shines is the technical-graphics department: all the surrounding elements are clean and colorful, the graphics are fluid and the 3D effect is very well used, but what leaves you delighted is the reproduction of the animals, starting from a much more realistic modeling of the first episode, to then move on to the animations, really numerous and all superbly realistic, up to the behavior which, as we have already repeated several times in the course of the article, amazes for its coherence with reality, fruit evidently of commitment and love from the Nintendo designers. The sound is more average, which apart from a few discreet music is mostly made up of the verses and noises of our puppies.", "date": "2011-04-04", "grade": "7.4"}