{"name": "Hai una monetina?", "ref": "https://multiplayer.it/recensioni/86963-strania-the-stella-machina-hai-una-monetina.html", "text": "The genre of Japanese-style shoot em ups on Live Arcade is anything but inflated, if we exclude a few very pleasant exceptions such as Omega Five or Ikaruga. To fill the gap comes to the rescue Strania: The Stella Machina, by the team G.rev. Conversion of an arcade cabinet (original title Seisou Kouki Strania) with vertical scrolling setting, but embellished with numerous functional shot changes to underline the spectacular nature of the action. In the very tight shoes of two young pilots, we have to face a series of epic battles aboard mighty mechs, helped needless to say by a large group of recoverable items on the playing field. These essentially represent the weapons that we can mount on the arms of our destruction machines, up to a maximum of three interchangeable slots comfortably in the middle of the action. We go from devastating laser cannons, missiles, directional beams and even swords to be used at close range (who said Radiant Silvergun?). A few minutes of play are enough to boast an impressive paraphernalia, a requirement dictated by the brevity of the levels, among the shortest ever seen in products of this genre (we are talking about 5 minutes maximum), but above all due to the high dangerousness of the bosses. But we will come back to this painful point later. Exterminating angels As already mentioned, Strania offers extremely concise and hyperbolic levels, distributed through scenarios and situations that guarantee an excellent variety. Just to give an example, the first stage opens along a series of metal corridors, to then culminate on a bucolic landscape, yet another sees us busy protecting the engines of a gigantic spaceship from enemy attack, up to spectacular clashes at 'white weapon (or rather laser) against opponents reminiscent of Hideo Kojima's Zoe saga, or the very popular Evangelion. In a nutshell, you can breathe deeply the atmosphere of oriental souls, a sensation certainly strengthened by the colorful polygonal engine that supports everything. Despite the vertical and two-dimensional setting, as we have already said, Strania delights the player with continuous perspective changes and an excellent visual orchestration, all without losing a single frame. Fluidity is guaranteed even in the most chaotic situations, which certainly are not lacking, and to add the icing on the cake is a series of frenetic techno songs absolutely relevant to the action. The technical sector is therefore certainly not Strania's weak point, which despite its Live Arcade nature presents itself in a sparkling way. The biggest problem is that many of you will sadly never see the end of it... Xbox 360 goals 12 typical Live Arcade objectives, for a total of 200 player points. The simplest ones are related to the use of weapons, such as equipping only swords and lasers, an operation that can be done in a few minutes of the game. Very different speech for those relating to the completion of the game in the three difficulty levels available, considering that they require you not to use continue. A daunting task to say the least, reserved only for the most expert and consummate players of the genre. Good luck, you will need it! Call me hardcore What left us stunned about Strania is its exaggerated difficulty, especially after the third level, and considering that there are seven in all, it is sadly easy to understand the reasons. The poor balance does not allow the player to refine his technique and overcome obstacles with perseverance. The weapon system is rather confusing and you have little time to figure out which ones are best suited for a particular enemy. The action on the screen is excessively chaotic and it happens too often to be hit by elements that were not believed to be interactive, so much so that the game is forced to superimpose a green cross on our vehicle, to understand its contextual vulnerability. Worse than ever, by taking advantage of a particular move of the mechs we can become invincible for a limited time, but the programmers have exploited this peculiarity to eliminate many free zones in the patterns of enemy attacks. This leads to very frustrating situations, such as the fourth level boss, which represents a challenge within the reach of the most experienced players, but is practically prohibitive for all others. The presence of limited credits (only three!) to continue the game is the coup de grace, we sincerely hoped not to see such an obsolete and punitive formula again, when longevity is guaranteed above all by online rankings. Our advice is to try your hand at a friend, multiplayer is fully supported both locally and online, face theo mani is certainly a less traumatic experience. Thumbs down also for the partial localization, not a big problem for this type of product, but the presence of Japanese ideograms makes the objectives completely incomprehensible. A dlc with new levels is expected in the future, a solution that suggests that the one released is only part of the project. What to say? Let's hope for reasonable prices...", "date": "2011-04-01", "grade": "6.0"}