{"name": "Angry Birds Rio", "ref": "https://multiplayer.it/recensioni/86930-angry-birds-rio-uccelli-arrabbiati-a-ritmo-di-samba.html", "text": "When it comes to the Angry Birds saga, all the logic that has guided the world of video games for years suddenly collapses: in fact, to sell over 10 million copies a title had until recently only one option, that is to belong to the very narrow circle of multimillion-dollar brands by (almost) divine right (see Call of Duty, Grand Theft Auto, Gran Turismo, Halo), investing huge budgets both in development and in subsequent promotion. However, the advent of iOS and the App Store has literally upset these theories; without wanting to enter into a well-known diatribe that inflames the pages of more or less all the magazines in the sector, we can safely say that the Apple-branded revolution has had at least two main merits: expanding the pool of gamers, ~clearing~ the videogame even among those who out of ignorance or preconceptions would never have bought a portable console, and above all having re-focused the developers' attention on the gameplay of the product, being the technical part (but by now with some well-known exceptions) decidedly secondary on this platform. In particular, the budget limits and the need for an app to be cheap (which if it exceeds 2.50 euros is usually considered ~salty~) have pushed the imagination and creativity of the various developers in an exceptional way, managing in many cases to create small gaming milestones. Angry Birds Rio therefore arrives as the third, highly anticipated episode, announced by trailers and viral marketing almost as if it were the latest production by Kojima or Ueda; however, considering the numbers of the Rovio title, the media coverage is easily justifiable. Ornithological solidarity Having abandoned the fight against the voracious pigs, the furious birds of Angry Birds Rio therefore land in Brazil, a land that many children will learn to appreciate thanks to the upcoming release of the film Rio, produced by Fox, starring two cute macaw parrots called Blu and Jewel. The feathered fighters face the long journey to save the two parrots from captivity, using the only method known to them: to be launched from a slingshot with a kamikaze spirit to destroy the structures present and thus free the imprisoned ~colleagues~. Everything of the classic structure of Angry Birds is therefore left practically intact: the solid, simple and immediate gameplay, the collisions of the birds based on an excellent physics engine, the same types of birds with their peculiar properties, which have now entered the collective imagination and source of a not indifferent merchandising (mostly represented by cute soft toys). However, some nice diversion compared to the previous episodes is easily found, starting from the particular settings typical of the land of Pele and the most beautiful carnival in the world, such as the Amazon forest, and the consequent little monkeys, which from a certain moment on will take the place historically belonged to pigs. In addition to the usual objectives related to the destruction of the environment (and enemies), bonus objects have been introduced, in the form of fruit, to be collected during the execution of the various launches and which will help to exponentially increase the accumulated score. Also noteworthy is the presence of a final boss battle, an unedited fact for the series but certainly much appreciated. Angry Birds Rio then presents a clearly perceptible technical improvement compared to previous versions, although the graphic style remains substantially the same; the colors and game environments appear brighter and the style of the menus also helps to refresh, at least partially, the game interface. Full support for Game Center (achievements and online rankings) then completes the total picture, offering further reasons for replay value in addition to the classic ~three stars~ quest for all 60 levels. The tested version is 1.0.0 Price: 0.79 App Store links", "date": "2011-04-01", "grade": "8.0"}