{"name": "Cantami o diva...", "ref": "https://multiplayer.it/recensioni/86712-warriors-legends-of-troy-cantami-o-diva.html", "text": "Version tested: PlayStation 3For the pleasure of his fans and the displeasure of his detractors, in the past Tecmo Koei has from time to time recycled the hack'n'slash formula typical of Dynasty Warriors in other contexts, some more successful, some less. Among the most atypical are certainly the various Dynasty Warriors: Gundam and Fist of the North Star, a recent action game set in the universe of Ken the Warrior. Now, however, the Japanese company has decided to offer an even more unusual setting, this time aimed at a clearly more Western market. Entrusted to the Canadian division of Koei instead of the usual developers of Omega Force, Warriors: Legends of Troy catapults the player into the midst of the mythological Trojan wars, playing the role of the most famous characters of ancient Greece. Will this drastic change of stage be enough to refresh a game system that is struggling to capture attention outside the borders of Japan? Playstation 3 trophies Legends of Troy offers 35 trophies to unlock right away, along with a few secret ones. Fortunately, the developers have made an effort to add some more varied objectives, and in addition to carrying on the plot, they are asked to carry out particular combos or complete a fight by satisfying particular requirements. Achilles heel Warriors: Legends of Troy opens with the first verses of the Iliad, an introduction that is a bit obvious, predictable and full of clichs, but which thanks to the accompaniment of splendid Greek paintings first, and an agitated cutscene after , try to sketch a narrative that will immediately involve the player in the Homeric poems. And, without wasting time, you are immediately placed in the shoes of the brave Achilles, landed with a handful of men and ready to massacre the Trojans. The hero faces an unprepared group of opponents, cuts off the head of a too stupid Trojan, picks up his weapon and with great precision throws it at a fleeing coward. Then the unexpected: suddenly it gets dark, darkness arrives and the sun is covered by a cloud of arrows ready to strike the Achaeans. ~Use your shields!~ Achilles shouts to his men, advancing slowly in a sort of tortoise. The game does everything to make fans of feature films such as 300 and Troy fall in love, above all thanks to a sufficiently elaborate narration: dialogues in battle, cutscenes and sequences with external narrator try to tell the deeds of heroes such as Hector, Ulysses or Paris, dedicating a chapter to each of them as the story progresses. Yet, sadly, everything is poorly set up: the dubbing of the characters is almost despicable, often inexpressive and never engaging, while long and very boring sequences of button mashing alternate between one intermission scene and another. From this point of view, Legends of Troy collects the worst of the worst that Koei has ever made in its most recent games: the action is outrageously repetitive, the enemies are cannon fodder, and although the characters differ slightly in weapons and attacks there is no pleasure or satisfaction in slaughtering opponents. In order to make more elaborate combinations it is necessary to buy them by spending the Kleos collected in battle, but the game does not encourage you to do so, so much so that it is possible to see the end without any upgrades. Before each battle it is possible to associate unlocked equipment and skills with your hero, filling a grid with a limited number of slots: fortunately the same objects can be removed and bound to a new character, thus avoiding their being lost in record time. From time to time you get involved in some 1 on 1 fights, face to face with more difficult and hard to die enemies, each of which has its own attack pattern and, like the player, has the possibility of entering a sort of berserk mode, significantly amplifying the damage inflicted. In these cases the fight becomes slightly more strategic, prompting you to carefully alternate the attack, dodges and use of the shield; but that's not enough, and in a short time these clashes prove to be all too repetitive. A real shame, also because the developers have also dedicated a separate mode to these battles in which to challenge other fighters in some arenas. In this case you can freely choose one of the heroes used in the main campaign, and the aim is to win a certain number of battles against increasingly fierce contenders. However, boredom comes to the surface, and even after a few hours Legends of Troy proves unable to entertain or keep the player's interest high. If a lackluster technical realization is added to this, the resulttato is really disastrous: graphically poor and torn apart by equally questionable animations, the game never manages to offer spectacular moments, while even the soundtrack deserved some more epic and excited songs.", "date": "2011-03-29", "grade": "4.5"}