{"name": "XenoSaga Episode II: Jenseits von Gut und Boose", "ref": "https://multiplayer.it/recensioni/xenosaga-episode-ii-jenseits-von-gut-und-boose.html", "text": "Episode II: Beyond Good and Evil A shower of shooting stars illuminates the vermilion sky of Old Miltia at sunset. A man, praying in front of a tombstone, looks up at the celestial vault, which is being crossed at that moment by a gigantic spaceship. The Elsa darts across the sea, caressing its surface; on the prow, standing, a young woman, her blue hair blowing in the wind, free, her gaze projected towards the sun as it slowly dips into the ocean. At the same time, in the depths of the cosmos, mysterious individuals are plotting in the shadows. Thus ended Episode I, thus begins Episode II. The new chapter begins just a few moments after the conclusion of the prequel, although it opens with a long flashback that closely concerns chaos and two new, important characters: the android Canaan and Jin Uzuki, the long-awaited brother of Shion Uzuki. Both hide dark secrets, especially the second (a bit like his counterpart in XenoGears, the legendary Citan Uzuki), who also lives in a particularly conflicting relationship with his sister Shion. Because, and we want to remind you, XenoSaga is a story made up mainly of wonderfully characterized characters who interact with each other, giving life to an incredibly exciting plot. In particular, this Episode II seems to revolve mainly around two fundamental characters: the stubborn and ambiguous Jr and the wicked brother Albedo. Among them, the twin Nigredo and Sakura, the girl who inspired Dr. Mizrahi in the construction of the small android MOMO. Jenseits von Gut und Boose, ~Beyond Good and Evil~, another work by the philosopher Nietszche (Episode I was also titled Der Wille zur Macht, after Nietzsche's ~The Will to Power~, and we already know that Episode III will be entitled ~Also Spracht Zarathustra~, ~Thus spoke Zarathustra~) which has immensely influenced this second chapter of XenoSaga, and whose reading will make the most beautiful and complex narrative passages even clearer. There is no good and evil, and the new plot revolves around this particular (and far more complicated) concept, initially involving the characters mentioned above and ending up intertwining their story with that of the other protagonists and with the fate of the universe . A pity that the plot of Episode II meshes and becomes extremely exciting only on the second DVD, with a first disc that leaves one embittered by its brevity and inconclusiveness. It is good to realize, before talking about the gameplay of XenoSaga Episode II, that itself is a secondary element in Monolith Soft's ambitious project, a true videogame blockbuster that wants to tell a story, even before letting it be played. If you love captivating storylines filled with gorgeous characters, mystical elements, and cataclysmic events that you will spend more time watching than playing, then you can read on. Otherwise, please close your browser. But in any case, you would miss the opportunity to find out how XenoSaga has improved. Not that Episode I was a bad game, when you played it, for heaven's sake, but the care given to the narrative definitely exceeded that of the gameplay, which was thus too complex and unbalanced at times, especially as regards the fights which, in the end , were the soul of the playable stages of the adventure. Basically the excellent XenoGears battle system, reworked for the occasion in Episode I, also returns in Episode II, deepened and in some ways improved. Again, we have three characters on the field, but in this case we will be able to replace them at will with those ~on the bench~, giving us more strategic freedom. And it is the strategy that reigns supreme in Episode II, thanks to the new Zone system: as in the prequel, in Episode II too the characters will attack with combinations of blows, only this time each blow will be related to a ~ zone~ of the enemy's body. And each enemy will have some sort of combination of ~zones~ which will be its weak point: find the right combo and you will get a Zone Break, which will increase the damage you can inflict on the opponent. In addition, some characters have attacks that, after a Zone Break, can launch the enemy into the air or crash him to the ground, increasing the damage that other characters can inflict in the immediately following turn. Here is also the Boost already seen in Episode I, but which in Episode II is of absolutely fundamental importance: by taking hits or putting them on target, it will be possible to obtain the energy necessary to perform a Boost and, essentially, anticipate the turn of another character. Using the Boost at the right time during a Zone Break it will be possible to make it follow by further attacks from our party in the same turn, indealing nothing short of monumental damage to the enemy. It's easier to try the new battle system than to explain it, and it's not even easy to master it right from the start of the game: several hours of practice will be needed to be able to make the most of it, but once you learn how to control Boost, Zone Break and Stock, the Episode II battle system will prove to be exceptionally deep and strategic, fun and varied. We have mentioned the Stocks, which are nothing more than ~charges~ to be accumulated through a special command, which will allow us to increase the number of shots to chain together to attack the enemy, complete the Zone Breaks and use the brand new Double Tech: these replace the spectacular but very slow special attacks (Tech, in fact) that characterized the battle system of the prequel, and which here are performed by skilfully exploiting Stock and Boost, and which are expressed in short but spectacular cutscenes during which two characters will carry out devastating cross-attacks to enemy damage. The battles aboard the E.S. also revolve around the Stocks, the new mechs that replace the old A.G.W.S. and that can only be used during certain phases of the game (therefore no longer recallable at will) and piloted by two characters at the same time. To expand the ingenious new battle system there is also the enormous variety of Ether (the ~spells~ in XenoSaga) and skills that it will be possible to learn by spending the special points earned by fighting: while in Episode I each character could learn a specific series of Ether, in Episode II instead each character can ideally learn all the existing Ether and skills. This actually tends to depersonalize the characters in battle, whose skills differ only at the discretion of the player and the setting he wanted to give to each of them, but it certainly provides greater freedom and strategy (for example, MOMO might learn more useful Ether, such as healing ones, by virtue of the higher number of EPs he has to cast them compared to other characters, and so on). However, it is fair to say that in XenoSaga Episode II Monolith Soft wanted to give more space to the interactive phases than it had granted to the player in Episode I (very little, to be honest): thus, between one cutscene and another, you will only have to move from one location to another fighting enemies, but it will be possible to explore vast environments and solve a disproportionate number of optional side-quests (the so-called Global Samaritan Campaign) which allow you to obtain the most spectacular Double Techs or skills more useful. An ingenious and varied combat system, greater freedom of movement, numerous side-quests and fewer cutscenes... It would seem to be in front of the perfect XenoSaga, doesn't it? Revolution? The real revolution of XenoSaga II is certainly not the revised and corrected combat system, the short duration (ahinoi) or anything else, but its very appearance. The original XenoGears featured an absolutely Japanese character design and splendid animated cutscenes, in XenoSaga Episode I there wasn't much difference between the cutscenes and the actual game and the extreme realism of the setting was definitely undermined by the comic traits that characterized the various characters, so for XenoSaga Episode II at Monolith they wanted to follow the path of realism, remodeling all the characters from scratch (in some cases changing their look, see in particular Shion or chaos) and transforming that 3D cartoon that was Episode I in a truly impressive visual quality polygonal science fiction work. If we exclude the sometimes approximate realization of the hands, it is really difficult to find fault with the wonderful three-dimensional models of settings, protagonists and opponents: composed of a much higher number of polygons, very detailed and precisely proportioned, during the most impressive cutscenes it seems just to watch a movie, not a video game. The reverse of the medal, however, is that in seeking the best compromise to increase the realism of the work Monolith Soft has given up on inserting all those spectacular touches of class that made XenoSaga unique: the spectacular Techs based on cabalistic symbols of fire, formulas mathematics of light, sephirothic schemes of energy and all those exaggerated mystical-science-fiction details have practically disappeared, giving way to decidedly less elaborate and more plausible situations (however probable a boy who distorts space and produces globes of psychic energy for fight). A pity for the eyes, which in the economy of the new battle system is almost a blessing that speeds up the fights, sometimes soporific in the prequel. Returning to the new and realistic design created by Monolith Soft, it must be added that it also and especially influenced the locations: the aseptic nature of the prequel, characterized by ~dungeons~ set above all in spaceships or space labyrinths, is here replaced by a greater variety and complexity. Between futuristic cities full of luminous and holographic signs, passers-by, buildings and other numerous details, passing through ~mental~ forests or huge battle stations, it certainly cannot be said that Jenseits von Gut und Boose is monotonous, especially when these locations they are a real feast for the eyes. Obviously, in such a work, great space is given to the music, which is an integral part of the action, of the numerous cutscenes, emotionally loading them in order to make them even more impactful. This burden had been borne by Yasunori Mitsuda, in the prequel, who had created one of the best soundtracks ever, splendid, epic and incredibly adequate, between songs, orchestrated pieces and real carmina burana. In Episode II it is Yuki Kajiura who takes care of the musical accompaniment, and although the overall result makes one regret the masterful skill of the great Mitsuda a little, it cannot really be said that the work done by his replacement is not of great quality. Kajiura favors electronic and rock music and many tracks are characterized as such, sometimes fitting perfectly with the action and other times being a bit out of tune with what is happening on the screen. The general quality of the songs is still very high, sometimes overwhelming, especially those sung (the closing song, ~Sweet Song~, is simply splendid). Just as the composer has changed, some voice actors are also new, but this time the result is decidedly fluctuating: if characters like chaos or Shion have benefited from the change of voice, on the other hand the mechanical and mature inflection of KOS-MOS is been replaced by a less mature and decidedly inappropriate voice. In general, however, the professionalism of the dubbers is once again undisputed, although the quality is a little below that of Episode I, but it is certainly also due to the dubbing if some sequences of Shion's new adventure and companions are truly unforgettable. The expectations for the first episode of XenoSaga were immense: it is not easy to be the heirs of the most important, loved and complex RPG of the last ten years, which has influenced and changed the way of conceiving RPGs themselves. Even greater were the expectations for this second chapter: Der Wille Zur Macht had divided the critics, on the one hand those who had adored it by virtue of its excellent plot, on the other those who criticized the excessive amount of cutscenes and who, as a result, he didn't quite understand what he had spent the money on. The result is truly an enigma: technically excellent (one of the best video games for PlayStation 2) and with improved and in-depth play mechanics, more playable (in every sense!) and varied. And yet one is amazed: two DVDs for a main-quest that lasts no more than twenty-five hours and which for a good 80% almost seems like a subplot, then many other side-quests and secrets... but totally optional. In short, this time there seem to be more bonuses than plot, and this is a bit perplexing. It is for this reason that despite the decidedly superior technical quality and some excellent narrative segments, compared to the prequel, XenoSaga Episode II receives a slightly lower evaluation. Expectations have not been completely met, the new generation XenoGears has not yet arrived: if Namco realizes the strengths and weaknesses of these first two episodes, however, we can be sure that Episode III will prove to be a great title. And after all, Also Spracht Zarathustra will conclude Shion's story and usher in a new era into which we can't wait to venture. Pros: Technically outstanding Battle system revised and corrected More freedom and variety than the prequel Excellent plot and magnificent characters Cons: First DVD rather weak Main quest too short Not as visually spectacular as Episode I Soundtrack at times not very appropriate Any reader with a certain gaming culture associates the famous J-RPG with the word ~Xeno~ which in 1998 glued thousands of players to the screen with a plot of literally biblical proportions, still unbeaten in quality and depth by any product belonging to the same genre, and not only. That was XenoGears. This however is XenoSaga. The difference between the two titles may seem minimal, but the matter is more complex, and it is not easy not to dwell on it. Summarizing one of the most controversial and complex issues in the history of video games, we can say that the original concept behind", "date": "2005-05-05", "grade": null}