{"name": "La bibbia della derapata", "ref": "https://multiplayer.it/recensioni/86841-ridge-racer-3d-la-bibbia-della-derapata.html", "text": "It's a bit impressive to tackle the very first Ridge Racer 3D race on Nintendo 3DS in 2011 and still find yourself in front of Seaside Route 765, or rather the same track that at the end of 1994 made the whole world gasp on a Playstation at the market debut. More than 16 years have passed: whoever was born that day is now in high school, so many things have changed that just thinking about it makes one feel very old, electronic entertainment has experienced incredible evolution and success... yet Ridge Racer is always here, and it's always him. Of course we are not talking about the same game, of course; the launch title for the portable of the 3D revolution has an enormously higher amount of content than its progenitor, and in the same way the technical component is light years from that kind of test bed of polygonal graphics that was on the first Sony home console, yet the gameplay has remained in its foundations almost unchanged, intact, regardless of the past geological era. Impeccable symbol of the immortal quality of the progenitor or rather a sign of Namco Bandai's fossilization on the brand? Let's go find out. He drifted to his death Ask any video game enthusiast to concentrate Ridge Racer in one word, and the answer will be only one: drift. The title of the Japanese house has in fact built its fortunes precisely on that single but ingenious game design idea: the curves, even the most demanding and narrow ones, should not be tackled by dosing the speed and working with the brake to set the trajectory. No. Curves must be taken full throttle, lifting your finger off the accelerator for a moment and then pressing it again while steering, so as to generate a controlled drift with which you can reach the next straight quickly and happily. Simple, immediate and satisfying. A winning formula, which has in fact led Namco to find itself in its hands a real goose that lays golden eggs exploited over the years with a good ten episodes including conversions, spin-offs and actual sequels, well beyond the seventh and so far the last chapter of the main series released on Ps3. Obviously Ridge Racer 3D is also based on this dogma, despite an alternative and simplified version of the control system that allows you to activate the drift with the simple push of a button; casual stuff, nothing that true fans of the series would want to consider. On the other hand, Ridge Racer's game mechanics are a sort of Zen art, which you learn corner after corner and which, specifically in this episode for 3DS, manifests itself at the start of the second championship, when the cars reach such speeds as transform the idle and in some ways boring progression in the beginners league into a test of reflexes and concentration, a ~flow~ to be made as clean and precise as possible, and consequently gratifying beyond measure. In this sense, the Circle Pad of the console is a perfect ally, truly one of the crucial and most happily made points by Nintendo designers; the analog is precise, reactive and above all very comfortable, decidedly superior to the similar one of Psp. Completing the gameplay discourse there are 3 levels of nitro, to be filled with drifts (just think about it) and staying in the wake of the opponents; by strategically deciding when to vent this resource, it will be possible to obtain a speed boost that is often essential for recovering positions in the race. Yes, because the start always takes place from the last position, as per tradition. The 3D effect Ridge Racer 3D is one of the launch games that best exploit the three-dimensional effect of the console, without a doubt; once the 3D depth has been calibrated with the appropriate slider, it is in fact possible to clearly perceive the added value of the option in question, which gives greater involvement and allows for a significantly higher appreciation of the graphic component of the product. Some solutions then, such as the petals of the flowers of the trees or the drops of water that break on the screen, appear really pleasant and incisive. Lots of stuff Therefore, if Ridge Racer 3D focuses on safe used games for gameplay, it still manages to offer a decidedly considerable amount of content and such as to guarantee its longevity. The main mode, Grand Prix, unfolds through series of events that collect within them a set of races to be concluded in the best possible position. Excelling allows both to continue in the mode and to collect money to spend on buying new models or vehicle upgrades; moreover you can also buy a series of aids with which to make life easier once on the track. The tracks, largely recovered from old episodes such as in a sort of compendium, there are roughly thirty to which all the variations must be added in reverse and mirrored. In addition to other not particularly interesting single player offers, such as fast racing or racing against opponents with the same car model, there is a multiplayer mode that allows up to 4 human drivers to challenge each other only on a local network. An online option would undoubtedly have given more prestige to the overall package, and StreetPass support helps little in this regard, thanks to which to deal with the ghosts of other users automatically downloaded from nearby consoles. Even with the benefit of the doubt, we remain skeptical of StreetPass's application in the West. Finally, from a technical point of view, Ridge Racer 3D is a first generation game on 3DS that doesn't make you cry out for a miracle, but you can appreciate it; we are roughly at the level of the chapters on Psp, with the polygonal modeling of the cars which appears pleasant but far from complex as well as the lighting and refraction effects. For the tracings, on the other hand, there are ups and downs, in relation to the chapter from which they were taken; those of recent episodes are obviously richer in detail and better made. Tacky and forgettable, as per tradition, the sound; guitars over banal rock tracks and techno beats and the annoying company of the commentator are all that the Namco Bandai title has to offer in this sense.", "date": "2011-03-28", "grade": "8.0"}