{"name": "In bilico su due ruote", "ref": "https://multiplayer.it/recensioni/86716-mototrialz-in-bilico-su-due-ruote.html", "text": "Of all the existing motorsport disciplines, Trial is certainly one of the most spectacular but, unfortunately, also one of the least publicized. Without breathtaking curves to be tackled at the limit, incredible speeds and drifts that ~brush~ the track, this category of races actually almost exclusively rewards the balance of the rider, destined to overcome improbable obstacles astride a special lightened motorcycle, without the possibility to put the foot on the ground. MotoTrialz therefore tries to reproduce this somewhat precarious situation on compatible iOS devices, also giving the mistreated Trial a pinch of extra visibility. Who goes Slow and steady wins The most classic of popular mottos could very well represent the subtitle of MotoTrialz: if in fact the journey time of a stage still remains the parameter according to which the global rankings are drawn up, it is also true that to reach the end of the level it is not enough to accelerate everything is clear but, on the contrary, it is advisable to dose both the propulsive and the braking thrust appropriately. The control system is in fact totally focused on the contrast between these two forces; in addition to the acceleration and braking keys, therefore, the only other (virtual) input button is represented by a horizontal slide, in charge of distributing the pilot's weight forward or backward during jumps. The slide can be replaced by accelerometers, a solution that still appears rather uncomfortable despite the possibility of adjusting its sensitivity; the meager options available end with the choice of activating or not the game audio. The concrete approach to the competitions is certainly simple and immediate, thanks to the ease of the evolutions during the initial levels; thanks to a side 3D view (slightly off-centre to the left) you can guide the pilot along ramps, loops and jumps of various types, in addition to the classic obstacles that Trial enthusiasts know well such as pipes, crates, stacked cars, trailers and wooden logs. The behavior of the vehicle and of the pilot generally respond to the main physical laws, with however some excesses due to a particular choice of the programmers: in fact, the protagonist can never fall until a part of his body comes into contact with any surface, vertical or horizontal; as a consequence, it is not uncommon to see unnatural movements of the bike and rider, following for example improbable wheelies or even climbing up perfectly vertical smooth walls. The particular nature of the vehicle also contributes to making the animations of the rear wheel not very credible, completely detached from the rest of the bike and protagonist of annoying polygonal interpenetrations with the frame; the same type of graphic defect is then found during falls, as mentioned, possible only if you come into contact (even slowly) with any object or surface, but which are reproduced in a daring way, to say the least, as if the unfortunate pilot during accidents turn into a sort of lifeless orange crash test puppet. Despite these undeniable imperfections, the 27 stages of which MotoTrialz is made up appear varied and rather original, thanks also to the self-propelled ramps, the tilting beams and the rotating planes like mills, as spectacular as they are dangerous passes to cross, being careful not to fall down; after each particularly demanding portion of the track, a very useful traffic light will act as a checkpoint, without prejudice to the possibility of restarting a stage from the beginning in case of excessive loss of time. The recent update of the game then improved the graphics as a whole, introducing anti-aliasing and maintaining excellent fluidity; however there are no very high quality details and textures, while the Open Feint achievement system makes its appearance, always welcome even if, as is now becoming the habit for the main titles, integration with Game Center would have been a further point to its advantage. The tested version is 1.2.0 Price: 0.79 App Store links", "date": "2011-03-25", "grade": "7.7"}