{"name": "A testa in gi", "ref": "https://multiplayer.it/recensioni/86474-shift-2-a-testa-in-giu.html", "text": "May 2009: the Fishing Cactus development team, already active on the WiiWare and DSiWare digital platforms, publishes an original action-type puzzle game on the App Store, entitled ~Shift~. The game mechanics see the protagonist, an anonymous little monochrome man, grappling with a certain number of levels, in which the goal is to reach the exit from time to time. In some cases the little man is faced with traps or chasms, in others he has to activate devices that allow him to reach the coveted little door. To do this, in addition to jumping, he can resort to the ability to ~overturn~ the scenario, reflecting his own figure from one side of a platform or a staircase to the other. In this way, too high steps become accessible recesses, for example, and it becomes possible to approach the goal and then, perhaps, touch the ~shift~ button again and reflect the setting once again. An extremely simple gameplay on paper, accompanied by a nice soundtrack in jazz style and by very respectable numbers as regards the endowment of the stage. For the creation of Shift 2, available for a few days on the App Store, Fishing Cactus has decided to re-propose the same elements that made the first episode popular, without therefore distorting in any way a formula that has proven to work very well, conquering the favor of many iPhone and iPod Touch owners. Let's think about it With something like one hundred and twenty levels plus thirty unlockables, Shift 2 certainly has no shortage of numbers. The game has an online leaderboard via OpenFeint and thirty-four achievements, an element that is really interesting and capable of promoting replayability. The developers have also included a greater number of objects and variations on the theme: walls to disintegrate, switches that rotate the scenario instead of reflecting it, keys for activating bridges and so on. In short, the gameplay is in many ways richer than the first Shift, more multifaceted and also equipped with a greater level of challenge, which is what is generally asked of the sequel to a product that is already very valid in itself: more of the same, perhaps accompanied by the resolution of some problems. In this regard, we cannot speak of real defects for the series created by Fishing Cactus, but rather of edges, which could be easily filed and which instead remained there. We are referring above all to the control system, made up of two arrows placed on the sides of the game box (which for obvious reasons is, in fact, perfectly square), one to move the character to the left and one to move him to the right, with the jump it activates when the arrows are pressed simultaneously. A practical but simplistic solution, sometimes not precise enough (missed jumps are frequent), which would have gained immediacy and agility through the use of a simple virtual d-pad and a single button to operate the jump. The story is different for the graphics, which have remained deliberately sparse: a mix of black and white that characterizes the title well, giving it an essential but nice look. Shift 2 focuses on content more than on visual impact, this is clear, and in the end it's fine with it. The tested version is 1.0.1 Price: 0.79 App Store links", "date": "2011-03-23", "grade": "8.0"}