{"name": "La conclusione della trilogia", "ref": "https://multiplayer.it/recensioni/85817-prince-of-persia-i-due-troni-trilogy-hd-la-conclusione-della-trilogia.html", "text": "The Two Thrones is the last episode of the trilogy contained in the Prince of Persia Trilogy HD collection, part of the quadrilogy of the Sands of Time saga. In this final chapter, some aspects of the plot and of the characters are further explored, as in the case of the dark side of the Prince who here evolves to the point of even generating himself into a real alter ego who will come to personify himself, taking over his personality in some situations. and on the physique of our fearless oriental hero. After his adventure in the Isle of Time, the Prince returns to his hometown together with his new love Kaileena, the Empress of Time met and saved in Warrior Spirit. Unfortunately, however, the two are welcomed in a certainly not friendly way: while Babylon is under siege and put to fire and sword, Kaileena is kidnapped after she and her partner are shipwrecked on a beach after being thrown into the sea by a group of assailants of the ship on which they were. Our hero therefore sets off in search of the woman he loves but surprisingly comes across an old enemy, the hateful Vizier Zervan. These due to the exploits of the Prince of Persia on the Isle of Time and the implications of those facts on the historical continuum, he never died as the events of the first game never happened. Then the big bad guy releases the Sands of Time and wreaks havoc again. As if that weren't enough, the unfortunate Prince discovers that the aforementioned sands have caused him further collateral damage: the magical ~powders~ have in fact divided his personality in two, thus splitting the logical, normal, all in all good part of his psyche from the most resentful, cruel and violent one. In the absence of water and blinded by anger and fear, the Prince gives in to the presence of his negative side which completely takes control of his entire body, mutating it. Already from the plot as well as as we will see from the very first bars of the game it is evident how The Two Thrones marks a decisive return to the past in terms of atmospheres and gameplay. The dark half The product therefore presents the classic structure of the series: there are the Magic Sands with which to control space-time. Then the jumps, the puzzles, the stunts and the fights. It must be said that the latter do not denote major improvements of any kind, resulting more spectacular from a visual point of view than from a playful one, due to a system oriented towards mere button-smashing. However, there are also several novelties in the game. Among these, the so-called quick kills stand out in particular, which allow the Prince to eliminate enemies in one fell swoop by making use of some simple stealth tricks, and the possibility of having our hero transform into his dark half, as mentioned above. of the plot. In the first case, in certain junctures of the adventure, the user has the opportunity to move silently behind the enemy, then swooping down from behind to eliminate him with a quick move. Furthermore, this type of killing has intelligently been inserted in many cases by the developers within the puzzles, in order to stimulate the player to look for this form of attack more and more often. In the second, however, the gamer can take advantage of the devastating strength and special abilities that the Prince acquires, at more or less regular intervals during the adventure, transforming himself into a real evil creature. Equipped with a devastating chain tied to his arm, the Dark Prince offers absolutely different gameplay moments compared to the traditional ones for the series: his superhuman strength, his blind fury, but also the urgent need to recover vital energy (in this state the Prince of Persia tends to weaken in terms of health) lead our character to collide with dozens of enemies in frenetic fights to the death, and without too many frills. Playstation 3 trophies Prince of Persia: The Two Thrones has 18 Trophies to unlock throughout the game. These are respectively 1 of Platinum, 8 of Gold, 4 of Silver, 1 of Bronze and 4 Secrets, all obtainable during the main adventure. Collect 10,000 Sand Credits and you will get the reward called Sand Collector, get all extra lives and you will get the one called Healthy instead, kill 50 enemies with a Quick Assassination and you will earn the Silent Prince reward. And so on. New skills but not too many The time available to recover the sands from the bodies of defeated opponents to restore one's energy is in fact made ~short~ precisely by the speed with which this vital force diminishes, decreases. So the user is forced to act with extema speed, often using the chain on the dark creature's arm to cling to otherwise unreachable holds, to activate various levers or switches and then move around the area in search of enemies at maximum speed. Some news also for the ~technical-acrobatic~ skills of the Prince. These appear in truth and in most cases, more than anything else, extensions of the abilities already known to the connoisseurs of the previous chapters: for example the one that makes it possible to hang the hero in bars. Well, now, the ability to make the character climb over them has been added to this ability. But nevertheless there are some real new entries, such as the one relating to the Prince's ability to hang himself with his dagger from some loopholes, then moving from there if necessary. In essence, therefore, it is a question of new game opportunities offered to users without however compromising the functionality of a control system that is always excellent in itself, quite precise in managing the movements of the character on the screen and an active element of the success of a virtual camera comfortable and versatile to control. Among all the technical elements that play in favor of this episode of Prince of Persia, not even the often mentioned general design of the product should be forgotten, also in this case returning in the footsteps of the first chapter. Closing the parenthesis of the wild backtracking seen in the Warrior Spirit, The Two Thrones certainly presents a more linear scenario than the prequel but paradoxically for this very reason it appears much more enjoyable and fluid. The Sands of Time saga The Sands of Time is a quadrilogy made up of 4 games, all linked together by a compelling storyline that takes place in the same narrative universe. The first is Prince of Persia: The Sands of Time (PlayStation 2, 2003), pseudo remake of the original Prince of Persia. The second in chronological order, i.e. following the plot of the series, is Prince of Persia: The Forgotten Sands (PlayStation 3, PlayStation Portable, Xbox 360, PC, Nintendo DS and Wii, 2010), which however is the last as a production. The third episode is Prince of Persia: Warrior Within (PlayStation 2, 2004), the second in chronological order to have been released on the market. While the fourth and final chapter is Prince of Persia: The Two Thrones (PlayStation 2, 2005), which is the third as a production. Babylon in flames The adventure winds its way smoothly through the streets and Babylonian palaces, among the ever-exciting plastic movements of the protagonist that punctuate the platform sessions and alternate with the intelligent acrobatic puzzles that have become a symbol of the series. And it matters little if in the end the duration of the adventure is slightly shorter than the previous one. After all, the developers must have rightly thought that sometimes it is better to focus on quality rather than quantity. The Two Thrones puts aside the scenarios and the dark look seen in the previous Warrior Spirit, presenting itself to the eyes of gamers with a cosmetic that is convincing from every point of view. Starting from the lush scenography which, thanks to the return to more classic settings for the saga, shows the interiors of colorful buildings with a Middle Eastern taste that alternate with the spectacular glimpses visible when moving through the streets of Babylon. Thanks also to vivid colors and very suggestive light and refraction effects, well enhanced by the new 720p graphics of the Prince of Persia Trilogy HD collection, which gives the whole a significantly cleaner appearance than in the past thanks to the higher resolution and textures more defined, the product can be enjoyed to the eye. On the other hand, the angular polygonal models of the characters are less beautiful, showing their age, even if it must be said that seen in motion, thanks to the many animations they have, especially the Prince, they do not cause too much ~annoyance~. The audio sector is good, with a nice dubbing and an old-fashioned soundtrack that goes well with the context in which the events narrated and played in The Two Thrones are set. The same goes for the various samplings and ambient noises. Ultimately, a nice job.", "date": "2011-03-21", "grade": "8.0"}