{"name": "Top Spin 4", "ref": "https://multiplayer.it/recensioni/86556-top-spin-4-non-proprio-un-ace.html", "text": "Tested version: Nintendo WiiWhile on Xbox 360 and PlayStation 3 the latest incarnation of Top Spin proves to be excellent in terms of technical realization, depth, quantity of content and multiplayer mode, the Wii version reiterates the limitations already encountered in the third episode, offering an experience mediocre in all respects. The crux of the matter starts, as it should be, from the controls: with a quality product like Grand Slam Tennis effectively exploiting the greater precision of the Motion Plus and a Virtua Tennis that does not equal these results but at least tries, the 2K Czech developers decided to ~abandon the race~ right away, effectively implementing a system that is not based on detecting the player's movement in relation to the character on the screen, but on a series of ~gestures~ that go to replace at the push of a button. Do we want to make a cut shot? Well, we have to move the Wii-mote down. Do we want to perform a ~top spin~? Then the movement must be done upwards. Forehand is achieved by moving the controller from right to left; the reverse, on the contrary, moving it from left to right. But be careful: the gesture does not change, whatever the position of our tennis player's body. In short, as mentioned above, there has not been the slightest attempt to implement a motion detection control with 1:1 mapping. And there's more: to play, you have to hold the Wii-mote ~from the side~, pressing the trigger B with the right forefinger and the A button with who knows what, since we will hardly be able to reach it with the thumb. The Wii controller is comfortable enough to hold because, clearly, ergonomic studies were done when the Nintendo designers designed it. Holding it in this way is equivalent to taking an Xbox 360 controller sideways: what's the point? However, there is a precise reason why the developers have adopted such an impractical solution: the lateral movement of the Wii-mote actually produces a precise response in exchange for a limited range of movement, while the vertical movement (which in this case becomes lateral) needs a wider arc to return the same results. We will be able to realize this when our tennis player does not make a forehand or a backhand in response to a merely sketchy wave of the controller. The picture is completed with the role of the Nunchuk, whose analog stick not only serves to move our character on the screen, but also to determine the aim of the shots, with a circle that becomes more or less large depending on the timing with which we react to the vibration that suggests the ideal moment for the impact with the ball. In summary, therefore: the control system of Top Spin 4 works via gestures of the Wii-mote, which replace the simple push of a button and have nothing to do with the position of the tennis player. And wishing, at this point, would it be possible to use the Classic Controller to obtain gameplay in line with the Xbox 360 and PlayStation 3 versions? Nisba, it can't be done. And let's add a note: we saw the game in action on the Sony console with the Move controller, and at this juncture it seemed to us that the movements were faithfully replicated on the screen. Everyone draws their own conclusions. Right, left... left, right... The Wii version of the game has also undergone numerous cuts in terms of game modes and, above all, multiplayer. The latter is present only and exclusively locally, for up to four players, where the aforementioned Grand Slam Tennis (released two years ago) implemented excellent quality online modes. It is possible to challenge friends in the ~King of the Field~ mode, a tournament regulated by particular dynamics, or in the ~Tournament~ mode. The latter consists of six different variants: ~Tie-Break~, with the classic rules; ~Pittura il Campo~, in which each shot throws paint on the field and whoever smeared it the most wins; ~Marathon~, where longer rallies yield more points; ~Tennis Polare~, with the court divided into blocks that can be shattered by the impact with the ball, becoming ~out~ zones; ~Zone Bonus~, with portions of the field that multiply the score if hit; ~Enemy Hole~, in which each impact of the ball creates an ~out~ area to avoid. Finally, there is a ~Minigame~ mode for only two players, in which you can try your hand at the variants just described. As for the single player, only the ~quick game~ is available, to be played using one of the twenty-five real players within twelve different playing fields, and the ~career~. The latter is the core of theproduced by 2K Sports, and sees us create our tennis player from scratch, choose a coach among those available (each of them provides us with a bonus point for one or more characteristics) and then divide ourselves between challenges and tournaments, with the aim of starting from below to then establish ourselves on the international scene. Our character has a series of unique skills (forehand, backhand, serve, volley, speed) that can be improved by spending the points earned thanks to victories, a fundamental operation for facing more advanced opponents. Unfortunately, the technical realization of Top Spin 4 goes hand in hand with the limits of its gameplay: the tennis players all have the same animations, not at all fluid (comparison with the first Virtua Tennis for the Dreamcast appears merciless), and even the scenarios reveal poor in detail and definition. Fortunately, the public, when present, is rarely framed. The sound accompaniment seemed mediocre to us: the voices are few and are not reproduced when they should (the tennis players actually rejoice in silence), the soundtrack is partly ~signed~ and partly not, and the interlude music they made a big impression on us (there's a song obviously copied from a Coldplay song, by the way).", "date": "2011-03-21", "grade": "9.0"}