{"name": "L'eroe dalle grandi tasche", "ref": "https://multiplayer.it/recensioni/86333-torchlight-leroe-dalle-grandi-tasche.html", "text": "There is something subtly perverse about Torchlight. The PC user had already understood it two years earlier, that console will understand it today at their own expense, in this case the many hours invested in this brilliant code. Someone may be impermeable to the work of Runic (a team in which many Diablo programmers play), but it will be enough to be at least passionate about the RPG genre to end up swallowed up in its meanders. We were saying, what is the magic of this great little action-RPG-slasher routine? First of all, the contrast of something that is, in fact, incredibly small, but destined to expand into something dangerously large. Once you start the game you are immediately struck by its rigorous essentiality, no bombastic presentation, no pompous screen, you are immediately delivered to the choice of character, again limited by extreme minimalism. We switch between three decidedly stereotyped classes, the wiry warrior, a wizard with a rather bizarre design and the inevitable girl. No aesthetic or sexual customization, everything is ready, turnkey and ready to go, but don't forget to take your faithful puppy with you. Whether it's a wolf, a feline or a wacky dinosaur, little changes, you'll soon discover that it's much more than a useful company. The next step takes us to the town of, needless to say, Torchlight, which represents a real free zone in the economy of the entire game. Where is my flashlight? The purpose of Torchlight is the slimmest imaginable; enter a myriad of dungeons randomly generated by the game, in a descent that seems to have no end, populated by numerous and fierce enemies, profusion of fights, and many, many objects to collect. Yes, there really is nothing else, and if for Diablo lovers we are talking about a formula that strikes directly at the heart, for all the others it can be an unsettling solution. But don't be fooled, Torchlight has a lot to offer, it has an almost surreal magnetism, difficult to rationalize with words. Its greatest charm lies in the compulsive collecting in its most intimate form, that is aimed at the development of a single character. The dungeons are filled with objects to recover, chests full of treasures, secret passages, amphorae, and so on and so forth. Obviously the carcasses of the enemies are no different, also releasing money and further objects. When the inexorable collection fever is inevitably curbed by the exhaustion of the available slots, the time comes to deal with the elaborate inventory menu, and really understand the acute function of our pet. We want to go into this section in particular, since it almost represents a game within a game, and you will spend a large part of your time inside it. Here we have a subdivision between the weapons, the parts of the armor, the spells and the support objects, which range between healing potions, envelopes with disparate effects, rings and special gems to be grafted on prepared objects. The items used to enhance the character are subordinated to its four main values, namely strength, dexterity, magic and defense, these in turn linked to the level achieved, which provides the experience points necessary to increase their values. It is very important, depending on the chosen character, to establish his fighting nature by finding a balance between offense and defense. Consequently to this need, we must keep a close eye on the resources required by each object, and dispense points accordingly for their use. The spasmodic quantity of recoverable objects does not facilitate the task, considering that the rarer ones require special recognition envelopes, of which the game is certainly not generous, even if through a special (and expensive) type of envelope it is possible to remove all the points experience invested, to apply them elsewhere. The functionality of the pet takes on crucial importance in its ability to transport objects, effectively becoming a walking archive for the player. All unworn or superfluous objects can be transferred to our trusty little beast, in order to then be easily resold to Torchlight, where the character can easily teleport through special scrolls or portals. Among other things, a fundamental practice in the economy of the entire game, the town is the main hub for trade, the acquisition of new quests and the upgrading of objects, if not the possibility of creating new ones. It also represents an ideal area as a reference with respect to the numerous bonus dungeons, unrelated to the main campaign, and always reachable throughtowards special parchments. Make sure, however, that you have reached an adequate level and equipment before launching! Technically Torchlight is a real treat for the eyes. Although the isometric shot focuses more on a functional rendering of the action, rather than the analysis of the details, this does not prevent us from appreciating the lively and vaguely comic style that characterizes the whole. Nothing shocking of course, but it's nice to zoom in on the shot to discover details on the armor or something that always manages to capture the interest, revealing a commendable care. Xbox 360 goals Torchlight offers 12 objectives for a total of 200 player points, which is the standard for Live Arcades. Most of them are linked to the completion of the main campaign, which settles on 8 hours, after which you will have obtained almost all of the coveted points. Good luck. Elective affinities The yield of the framerate is less pleasant, subject to several drops in the most agitated phases and when the screen is filled with enemies, a far from remote eventuality. Annoying is also the impossibility of rotating the shot at will, a limitation that makes itself felt precisely in the fights, which often makes them chaotic, especially when monsters of considerable size come into play (the carnet is quite large). Fortunately, nothing that affects the gameplay, but in a product of this type it is important to understand exactly what is happening on the screen. The game interface has been adapted to the needs of console users with a good result, but its pc oriented nature does not make this transition totally painless. The subdivision into categories navigable with the back keys leads to some moments of confusion and is not as intuitive as other products, see Oblivion. The complexity of the special moves and spells available collides with the natural limitation of the pad, forcing them to be mapped on the keys through interchangeable sets with the directional cross, making it sometimes confusing to understand which one we are actually using. The fights are certainly not characterized by an excessive strategic level, but on the other hand this is a prerogative closely linked to the type of game, and the Runics prove to be decidedly skilled in avoiding boredom by pushing on the main driving force of Torchlight: the collection of objects. Absent any multiplayer mode, a pity considering the sharing potential of the product. The only possibility is to give some items to friends on the list, and put an end to their social life! Torchlight has no Italian localization, so a good knowledge of English is required to fully understand its mechanics. User warned...", "date": "2011-03-16", "grade": "7.8"}