{"name": "What the Car?", "ref": "https://multiplayer.it/recensioni/what-the-car-recensione.html", "text": "The success of What the Bat and What the Golf continues to generate sequels and derivatives, and precisely this natural path of evolution and reworking leads us to this review of What the Car?, Triband's new madness launched on Apple Arcade. As also demonstrated by the official site, appropriately named ~What the Games~, there is a programmatic idea to continue on this style, a kind of common thread in the team's productions, although at first glance it may be difficult to find an underlying logic . Indeed, probably the absence of this is a key feature of the series, but we are not complaining at all. At first glance, What the Car? It looks like a driving game designed under hallucinogens, however upon closer inspection it emerges that yes, it is truly a racing game developed in the grip of madness but it also contains a rather functional game structure. This focus on gameplay shows how the project was well researched, beyond its insane looks: What the Car? manages to offer an exercise of skill with increasing difficulty that systematically destroys the conventions of the driving game, at the same time also succeeding perfectly in making fun of all the car culture that is usually at the center of this type of game. In this way, the car becomes a clumsy and essentially useless object, requiring considerable skill to simply be brought from a starting point to the finish line, regardless of all the classic challenge elements that are normally posed in a racing game such as basic features of the gameplay. In this we find precisely the characteristic that binds the ~What The~ series: in the construction of games through the systematic deconstruction and making fun of the conventions of the reference genres and finding, in this operation, new rules consistent with an idea game accuracy. The machine with legs In What the Car, the car takes on ever more bizarre connotations The gameplay is conceptually very simple: it's about taking the vehicle from a starting point to the finish line, without having to worry about opponents to overcome or relentless timers but simply trying to get to the end somehow, which proves to be anything but that easy, in many cases. Performance is still evaluated at the end of the race, but in the heat of the action we have to struggle with the bizarre controls and at least try to steer the car towards the finish point, without looking so much at speed, style or the bears that they can inexorably end up under the wheels (or feet) of the car. All we have at our disposal is a steering wheel to turn and a button that, if necessary, can act as a horn or a trigger for jumps, rockets or other modifications applied momentarily to the car. This is because the vehicle changes continuously with each race : the wheels are often replaced by legs, many legs, huge legs, jetpacks or bears, each time causing a substantial change in the way we have to steer the car. Together with the difficulty inherent in the use of such a vehicle, there is also the track, which in the various tracks can take on very convoluted configurations between curves, overhangs, bridges and obstacles to avoid, making the race a real challenge. What the Car puts us in front of unsettling situations This especially in the more advanced stages, given that What the Car? starts very light but then reaches impressive levels of chaos, continuing on its branched map. The graphics of the game recover the style seen in the previous ~What The~, staging a strange minimalist 3D world, populated by handyman bears and strange vehicles animated. The aesthetic choices are all in line with the insane aspect that Triband has given to its strange multifaceted world, moreover with a considerable attention to the animations that emerges even in the most absurd situations. The somewhat rough physical management obviously plays in favor of chaos, capable of generating further fun for everyone.", "date": "2023-05-14", "grade": "7.5"}