{"name": "3DMark si rinnova", "ref": "https://multiplayer.it/recensioni/83640-3dmark-11-3dmark-si-rinnova.html", "text": "Born at the end of 1998, 3DMark immediately established itself as a simple and effective tool for determining the computational capacity of 3D video cards and PCs in general. The first edition of the software developed by Futuremark, 3DMark99 (updated in 1999 to the MAX version), was compatible with DirectX 6 and proposed a series of very spectacular tests for the time: the management of a spatial panorama, a futuristic race in full wipEout style, the passage through a rainforest, the visit of an ancient scenario by a mysterious spacecraft, the first-person exploration of a sort of space base and finally the devastating effects of a planetary bombardment. Over the years, the powerful benchmark has adapted to new technologies and at the same time has tried to evaluate their implementation in an increasingly detailed way, with the consequent expansion of test execution times. The latest version of the product, 3DMark 11, which on the contrary stands out for the brevity of the benchmarks, brings Futuremark's software into the new generation thanks to the full support of DirectX 11 and its exclusive functions, such as the much talked about tessellation. All through a total of six tests: four graphs, one physical and one combined. Let's see them in detail... Field test 3DMark 11 has, in the version tested by us (Advanced Edition), three presets that can be adapted to the performance of the PC on which we intend to run the program: ~Entry~, characterized by a resolution of 1024x600 pixels and a low workload , ideal for testing the capabilities of notebooks and even netbooks; ~Performance~, which uses a resolution of 1280x720 pixels and is presented as the best solution for most gaming computers; ~Extreme~, with a resolution of 1920x1080 pixels, reserved for the most powerful PCs. You can also run the software in full mode or just run the demos or benchmarks. The first graphic test lasts just thirty seconds and is basically based on the rendering of volumetric lighting. We see some underwater devices that move at great depths, projecting their lights onto the surrounding environment and thus creating a large number of shadows, which are calculated by the video card in the fascinating aquatic context. In this case tessellation is not used, leaving room for a series of lenticular and post-processing effects. In the second graphic test, just as short, it is instead tessellation that plays a leading role: the underwater exploration continues, in fact, but in addition to the contrast between lights and shadows we see some close-up shots of rocks and corals, whose surface acquires depth and realism precisely thanks to the exclusive effect of DirectX 11. The third graphics test takes place in a completely different scenario, Tomb Raider style, with mysterious stone statues that are hidden inside a forest. In this case we see the alternation of shadows and lights, the tessellation gives details to the tree trunks and rocky surfaces, while some post-processing effects act on the depth of field, helping to create a spectacular sequence. The fourth and final graphic test, again lasting thirty seconds, takes up the same scenario but switches to night lighting provided by the full moon and the headlights of a jeep. The stone statues are shot from various angles, highlighting the shadows and, again, the detail of the surfaces. The physical test does not have a fixed duration, but varies according to the time that the PC takes to complete the sequence. In this case, no graphic effects are used. We see structures made up of blocks not fixed together, on top of which spherical rocks are dropped which, on impact, cause the movement of all the ~bricks~ and the complete destruction of the buildings. This is a CPU usage and consumption test, which therefore returns better results depending on the speed of the processor. Finally, the combined test takes up the same scenario as the physical test but applies all the graphic effects. So we find ourselves witnessing the same scene, with the rocks falling on the structures and causing the pieces to fly away, but with the sun providing the main source of illumination, the shadows refracting on all the surfaces, the rocks and the vegetation that use tessellation to look their best. The 3DMark Score is calculated on the basis of all the results obtained, even if the ways to obtain this value vary according to the preset used, with a preponderance of physics over graphic effects as regards the conless powerful gurations. Conclusions Those who expected a large number of tests or a series of very spectacular sequences will inevitably be disappointed by 3DMark 11, which seems to put aside some purely aesthetic choices made in the past in favor of greater practicality. The four graphic tests lasting just thirty seconds and the presence of only three scenarios (let's even say two and a half, indeed), must be seen from this point of view, elements that undoubtedly deprive the Futuremark product of that sense of wonder that characterized above all the first releases. On the validity and actual value of the tests, however, the situation is different: the benchmarks work very well and have a large number of adjustments that allow you to evaluate even a single effect compared to the others. The overclocking community, simple enthusiasts and clearly insiders, therefore, can only welcome this new edition of 3DMark with enthusiasm. The product is available completely free of charge, but with serious limitations: it is possible to save only one result, view the results off-line and use only the ~Performance~ preset. It is inevitable to evaluate the purchase of the Advanced version, which costs only $19.95 but allows access to all the program's functions - except for things like demo looping, some automations and the professional use license. reserved precisely for the ~Professional~ version which costs the beauty of 995 dollars.", "date": "2011-03-16", "grade": null}