{"name": "Megaman X 8", "ref": "https://multiplayer.it/recensioni/megaman-x-8.html", "text": "Unity is strength The new Megaman X adventure is decidedly more original than usual, even if it leads to the usual race from stage to stage, from boss to boss, which has always characterized the chapters of the series and which leads directly to the final showdown. However, things have changed a lot, and if the raids of X, Zero and Axl around the world are motivated by a slightly more logical and compelling plot than in the last few episodes, the final showdown will certainly leave fans of the series amazed which, despite the premises, will not see our heroes oppose the misdeeds of a certain, very hated villain. The fact is that it is always Megaman X and it is always played in the same way: a large number of stages to be tackled in the preferred order, a boss for each level to be defeated to obtain specific powers (to which another boss will be more vulnerable, in a chain , effectively establishing a secret order for progression), a sort of virtual shop in which to buy upgrades for our favorites, armor and secret power-ups... There is everything that made the series famous, along with some other news. The team-up, for example: now at the beginning of each stage we won't choose just one character among X, Zero and Axl, but two. At any time, during the level you are facing, it is possible to switch the two selected Maverick Hunters to face the obstacles by exploiting their peculiar abilities (Zero's lightsaber and double jump, Axl's levitation and rapid machine guns, balanced characteristics and X-Cannon of X and so on), and in addition, once a special bar is fully charged, it is possible to launch a spectacular combined super-attack on the enemy, inflicting a disproportionate amount of damage (and which in fact simplifies the boss-fights a lot). The possibility of facing the stages with two characters has very little influence on the classic and tested mechanics, in fact it does not distort it but, on the contrary, gives it an interesting strategic component, based on an initial choice that can make a level very simple or so difficult that it has to be start over with a new combination of protagonists. Among other things, before each internship it will not only be necessary to choose the Hunters to be sent on a mission, but also their Operator: in addition to the usual Alia we now have two new Reploids, and each of the three influences the mission in a different way, even if not transcendental, with advice on the location of items, power-ups, secret passages and more. If these choices already give a certain originality to a gameplay that is now suffering the weight of the years, the variety of stages also contributes to making the playful experience pleasant: in addition to the usual side-scrolling levels we have stages with a shoot'em-up flavor aboard flying vehicles, missions where one wrong movement in a frantic descent can lead to an early end, mix of all these things and more. We told you, X is back and in great shape. Even technically. Back to the origins...? As we said at the beginning, the biggest flaw of Megaman X 7 had been Capcom's courageous choice to force the gameplay of a historically two-dimensional series and place it in a 3D environment, mixing typically 2D side-scrolling stages in the levels with segments in which the camera moved behind our alter-ego, causing an unfortunate transition that ended up confusing the player. In Megaman X 8, however, Capcom reworks the graphics engine of Megaman Network Transmission for GameCube, which in practice pretends to be three-dimensional: the environments, characters and enemies are all completely polygonal, but the fixed camera captures the action from the side (in the most cases) and so it seems to play a two-dimensional action-game. The result, this time, is convincing and everything would work perfectly if there weren't some sporadic but annoying slowdowns. For the rest, the care given by Capcom to this eighth episode of Megaman X series is really surprising, so the polygonal models are detailed and colorful, both of the protagonists and of the opponents, but above all the various stages surprise for the amount of details and colours, from the forest to the archaeological excavation, not to mention the splendid nocturnal city in which a ferocious chase between neon and luminous signs is set. Too bad for the animations, a little wooden and lacking the fluidity we were used to with two-dimensional episodes, a sign that Capcom still has to get carried away with this new incarnation of the Blue Bomber. A comment on the audio is inevitable: the musical tracks of the stages, although not particularly inspired, worthily accompany the action without weighing down the player, and areor mostly decidedly spot on, with a typically rock taste. Megaman X 8 is certainly not the best action-game available on PlayStation 2 (now that Mister Kratos is running, then...) but it is certainly one of the funniest and it will certainly appeal not only to Megaman fans. After the mediocre prequel, Capcom with Megaman X 8 wanted to correct the mistakes of the past: a revised and corrected gameplay, various novelties in the mechanics, a captivating and more original story than usual ~Sigma is back, let's save the world~ which still connects to the saga and gives us new characters, including allies and opponents, who we will certainly see again in the next few episodes of the infinite X series. The idea of ~couples~, although not particularly incisive in relation to the naked and raw gameplay, is definitely a welcome novelty , and we can only expect any evolutions from the next episode. If Capcom manages to translate the feeling of the X series into a truly three-dimensional game, without betraying the illustrious origins of the series, then we could find ourselves facing a saga that still has a lot to say to casual-gamers and fans, but until then the compromise reached by X 8 is quite satisfactory and will not fail to amuse those looking for an action-game of not too many pretensions, difficult at the right point but, unfortunately, not too long-lived. Advised. Pros: Maintains the feeling of two-dimensional episodes Technically very accurate Valid innovations to the gameplay Cons: Not very long-lived Some slowdowns too much The first Megaman X released on PlayStation 2, seventh episode of the famous saga, was not a real success. The fans of the Capcomian Blue Bomber liked it, mostly because it introduced a new interesting character in the mythology of the series (Axl), but above all because after a long time it was a pleasure to see Megaman, Zero, Alia and company again, whom we had greeted on PSOne, at the end of the excellent Megaman X 6. However, Capcom's choice to forcefully insert the tested gameplay of Megaman X, which has always been associated with two dimensions, in a new three-dimensional environment, however interesting, was not successful: Megaman X 7 was a not too successful 2D-3D hybrid, in which the resulting uncertainty negatively affected the controls and the precision of the movements, crucial elements in such a game. A year later, Megaman X 8 certainly did not promise sparks, apparently maintaining the same characteristics as the prequel, but fans of the saga will be delighted and fans of the genre pleasantly surprised: X is back, and in great shape.", "date": "2005-05-03", "grade": null}