{"name": "Un flipper nel cervello", "ref": "https://multiplayer.it/recensioni/86041-trigonon-episode-one-un-flipper-nel-cervello.html", "text": "Timing a game release with an event like the Game Developers Conference in San Francisco is never a good idea. In the tom tam of the Californian fair there is a flurry of bomb announcements, important declarations and previews of highly anticipated games, and the risk is obviously that of going unnoticed, suffocated by the flood of press releases that are flocking in these few days. This is what happened to Trigonon: Episode One, an interesting puzzle developed by the Italian indie team Just Funny Games, whose launch seems to have passed particularly quietly outside the Bel Paese. Yet, although to some it may seem like just an elaborate Labyrinth clone, the game is presented impeccably, accompanied by an excellent computer graphics trailer, demonstration videos and images that show very well the care and attention paid to the aesthetic component. At this point, one important question remains: how much substance is there behind the mere appearance? Mind balls At the beginning, Labyrinth was not mentioned by chance: the purpose of Trigonon is in fact to lead a metal sphere towards the exit of an arena, although in the Just Funny Games title the interaction takes place in a completely different way. Instead of using the device's motion sensors to tilt the plane, the player must this time place barriers in the scenario, orienting the angle so that the ball bounces in the right direction. The idea may seem trivial at first, but as you progress through the levels the difficulty increases and stimulating design ideas are introduced: you thus find yourself interacting with multiple spheres at the same time, exploding blocks, switches to hit and portals in able to teleport the sphere from one point of the scenario to another. The difficulty curve is calibrated very well, despite the puzzles only starting to get really interesting towards the middle of the game, becoming nothing short of diabolical only in the very last levels. Approaching the conclusion, Trigonon gives its best, showing off some examples of excellent puzzle design and boding well for the new scenarios that will be introduced with the next updates. To make life harder for the player, the developers have however decided to impose some significant restrictions. First of all, depending on the time taken to solve the puzzle, you are rewarded with a gold, silver or bronze star, but those who are too slow risk having to repeat the level from the beginning. As if that weren't enough, although the player can rotate and destroy the barriers he has inserted, he is not able to move them freely, and since the number of attempts available is very limited, he often finds himself forced to restart the puzzle More and more times. This, if on the one hand it forces you to think before making a move, on the other it ends up interrupting the game action for a few moments: a step forward could be to speed up the restart of the level, and perhaps to further reduce loading times. Where the mechanics do not represent the pinnacle of innovation, Trigonon tries to show some personality through a rather atypical basic idea, and which recalls that fascinating attempt to connect psyche and materiality already seen in films such as Inception or The Matrix . In the game, the metal sphere represents a lost thought in a forgotten area of the mind, and the aim is to bring it back into memory using positive and negative thoughts, connections and intuitions. To tell the truth, sometimes the impression is that a setting of this kind is excessively emphatic, a little forced, perhaps even superfluous, but luckily it doesn't clash with the overall experience, and at least Just Funny Games' attempt to create something more original and distinctive. As already mentioned, however, what is particularly striking is the commitment that the developers have dedicated to creating a title that was aesthetically elegant and coherent, pleasant to see both during a game and when browsing the menus. Nothing is left to chance and stylistically the game is reminiscent of the excellent Dark Nebula, although support for Retina Display will have to wait for the first update. Finally, the unlockable achievements, the rankings via Game Center and the possibility of obtaining better ratings are all elements that give the player an excuse to play and replay the 40 levels that currently make up the game over and over again. The tested version is 1.0 Price: 0.79 App Store links", "date": "2011-03-10", "grade": "7.8"}