{"name": "Inizia la nuova era dei dragoni", "ref": "https://multiplayer.it/recensioni/86097-dragon-age-ii-inizia-la-nuova-era-dei-dragoni.html", "text": "Version tested: PlayStation 3Dragon Age II has evolved over the months remaining constantly poised on a thin thread that seems always about to snap. From the first meeting at one of the trade fairs, seeing the sequel live, sometimes even trying it firsthand, always gave us different sensations, sometimes even in contrast with each other. Sometimes we were left with a bad taste in our mouths, other times we left the test session exhilarated and there were times when we felt completely indifferent to the game. We also tried this mixture of moods during the first, long hours of the game in view of the review; but fortunately the more we let ourselves be carried away by the flow of events, the more our negative sensations were dissolved and replaced by positive ones. Dragon Age II is evidently a schizophrenic title that forced BioWare to reach great compromises in the design phase in the final attempt to create a deep and detailed action role-playing game in the contents but at the same time immediate and simplified in the game mechanics. Better than a good history book After about ten minutes of installation and a little more than three GB of data occupied on the hard disk of the PlayStation 3, Dragon Age II presents itself immediately proposing a full-bodied fight that serves as a tutorial at the same time: the indications on the screen are minimal and player is required to experiment and try the controlled protagonist's various tactics or spells. You can't practically die and the trick adopted allows you to immediately touch the great frenzy and choreography of the almost completely revised combat system. The class is chosen at the start of the game and allows the only three choices already seen in Origins: thief, warrior or wizard in the female and male versions. In the same style already seen in Mass Effect, as soon as you pass the tutorial, it will be possible to access the actual customization of the protagonist: from his physical appearance to his portrait, passing through the name, but not the surname. At this point the game allows us to import a save from the first Dragon Age or to select one of three rather different pre-set scenarios. In this way the game will create the historical outline that narrates the deeds of Hawke, the champion of Kirkwall: who is the king of Ferelden, who defeated the Archdemon, what are the balance of power between the templars and the church, elves and humans and Dalish and werewolves and so on. All this to give historical substance to a sequel that starts chronologically almost simultaneously with Origins (the new protagonist is a fugitive from Lothering, the first country wiped out by the Dark Spawn of the Fifth Scourge) but which goes forward in time for about ten years showing all the weaknesses, power games and new threats that are slowly replacing what was seen and told with horror in the predecessor. The result is a narrative canvas managed through small flash-forwards that act as a link between the various crucial moments in the life of the protagonist and which probably does not stand out for its originality or for real epic moments of emotional transport but which is told impeccably throughout the game and enthralling by properly exploiting the enormous quantity of dialogues proposed, relying on short but constant interlude sequences with a good directorial cut and above all by properly exploiting the numerous facets and the charisma of the various characters that the player will meet on his way and who will become members active members of his party. Instead, the origins have been completely set aside and with them the possibility of choosing a race for the protagonist, forced to be a human. The first was an extremely criticizable choice but probably a necessary evil to allow BioWare to focus more heavily on the narrative, making the consequences of the choices made by the player during the game credible and coherent. The downside is a degree of replayability that is not in the least bit close to the first Dragon Age: the first abundant ten hours of play in this sequel are practically always the same and changing your fighting style by choosing another class is not enough in our opinion to push the player to move forward to find out what happens by behaving differently. In any case, there is plenty of meat on the fire even for a single game: you will hardly be able to complete Dragon Age II in less than forty hours but you will not find great difficulty in reaching fifty or even sixty hours of play. Novice craftsmen A crafting draft also remains in Dragon Age II. Considering that even Origins did not stand out from this point of view, there will be few to complain about the substantial changes made by BioWare. Now it will no longer be necessary to collect tons of elf root or mushrooms of the depths by rummaging through every single location to create your own potions but it will be enough to discover the varieties of herbs or minerals scattered around the game world and buy the recipes from the different vendors. At this point when interacting with the dedicated workbench, it will be possible to create a virtually infinite number of runes, potions, poisons, bombs and so on without worrying about reagents since only money will count. In fact, each recipe has unlocked variety requirements which, once satisfied, allow for ad libitum crafting. You are just talk and badge! Let's spend a few more words on the game's dialogues. In this sequel they are definitely more present and better outlined especially in the characterizations of the characters. The multiple choice remains without any kind of time limit with the addition of a small visual indication that should suggest to the player Hawke's approach to the dialogue if that option is chosen. The system works quite well, especially in the dialogue deepening component: it is in fact possible to investigate during the chats to get more story elements and, depending on the characters present in the party, sometimes options are unlocked to make people participate in the discussion or to make them act their own companions. Unfortunately there are times when the choice you are about to make is inevitably misunderstood and above all we feel like criticizing BioWare's precise choice to completely eliminate the protagonist's competence in persuasion: therefore forget the dialogue options to avoid fights or circumvent the 'interlocutor except in very rare cases foreseen by the story itself. But let's get to the heart of Dragon Age II: the fights. Here the search for a compromise made by BioWare during the realization of its project is forcefully expressed. It is evident how we wanted to simplify and make the fights much more immediate, active and probably engaging by shifting the focus to the action in real time as if to seek the more action soul of any self-respecting action RPG. The result is only partially good and is extremely linked to the chosen difficulty level (which can however be changed at any time during the game). In fact, playing at the easy or normal levels, you will go on by forcefully playing the X button, that of the standard hit, almost on the button mashing limit of any scrolling fighting game. The important thing is to adequately manage the mana or vigor depending on the class to activate the various spells and special abilities and to have ~configured~ the party members at each level change through the tactics menu, taken from scratch from that of origins. In this way, for example, it will be possible to set, even automatically through pre-set sets, the aggressiveness of teammates and have the artificial intelligence manage the use of their skills. The so-called tactical pause is always present with the pressure of the left trigger but it will only be necessary in the most difficult battles to stop the action to perhaps make a companion drink a potion or direct him towards a particular enemy. The result is a constant, frenetic and also rather adrenaline-pumping action but which obviously leaves out the typical depth of advanced party management altogether. Management that instead becomes crucial and constant if you choose the two higher difficulty levels but with a dramatic downside: manually commanding your companions becomes a fundamental requirement for overcoming even the clashes with the stupidest enemies, especially if they present themselves in large numbers, under penalty of constant death of the weakest characters or the incessant use of potions (to the detriment of the protagonist's economy). But in doing so, all the cumbersomeness of the control system comes out, which relies on a radial menu that appears when using the tactical pause and which is used to give any type of command. The impossibility of moving the camera freely (except through the use of magic and skills with area of effect) and a targeting system based on the viewing angle of the characters help to make each fight a sort of painstaking micro-management. Surely this style can satisfy the most hardened role-playing players (even if our advice in this case is to jump on the PC version which, if nothing else, allows the use of the mouse for the selection of characters and skills) but increases dramatically the duration of each fight. It is also interestingwork done by BioWare to stimulate skill combinations between different classes. In fact, there are a whole series of skills and spells that gain bonuses when they hit stunned or faltering enemies, for example, and obviously there is no shortage of actions that make opponents such. In this way, the player is stimulated to cross-reference the various skills and to always keep an eye on the entire combat area as far as possible. My magic diary Where Dragon Age II shines, arguably even more than its predecessor is in the quests. There are so many, probably not particularly original or varied, but closely linked with the gameplay and its continuation. The quest log in particular does an excellent job of dividing them into main, secondary, sub-plots, travel companion quests and rumors to investigate and, it will never happen to remain undecided on what to do or lost around the game world also thanks to the functional navigation system between the locations of Kirkwall and the external borders which always clearly shows which quests are present in each area. Probably an excessive fund of linearity remains, especially in the main plot which could make lovers of unguided exploration turn up their noses but there will be a substantial amount of material that can be collected wandering around and which feeds an extremely deep and rich codex of that lore to which Dragon Age: Origins had positively accustomed us. More role for everyone Once the creation phase and the fights have been archived, we come to the third key aspect of role-playing games: character management. Dragon Age II offers a classic experience level system with a cap set at the twentieth (waiting for the inevitable DLC). There are the classic stats that change in use and importance depending on the class chosen (strength and toughness are crucial for a warrior, versus dexterity and cunning for a rogue or magic and willpower for a wizard) and a completely revised talent system compared to that of Origins. Now basically every character has a handful of skill branches at their disposal, think of them as different schools of magic or attack types. Each of this screen is then divided into the various talents (usually 10 per branch) which are of three types: those that can be activated that act as special shots or spells that can be cast, those passive that offer permanent bonuses and buffs that, once activated, reduce certain percentage of the character's mana or stamina pool. There are obviously requirements for the highest level talents of each branch both in terms of statistics and other unlocked skills but in general this apparent simplification has convinced us for a freedom of choice and a better subdivision that adequately compensate for the lack of talents ~accessories~ and less related to combat (e.g. the already mentioned persuasion or the possibility of pickpocketing for the thief). But that's not all: the player also has three further branches that he can unlock by investing the specialization point he earns at 7th and 14th level; the other characters who will follow the player in his wanderings will instead have a personal branch with some specific and unpublished skills and two particular passive bonuses that will be activated in a mutually exclusive way (or one or the other) depending on the degree of respect towards Hawke (friend or rival). Also in this case we therefore have a sweetened version of what was found in Origins and which meets the reduced possibilities of interaction with companions: obviously there remain specific quests and the possibility of relating even in a loving way (yes, there are also the horrible scenes of sex of the BioWare tradition) but the whole system of gifts and the growing release of skills and talents is now reduced to a minimum if not completely removed. The inventory has also undergone some changes that make its management certainly faster and lighter and not necessarily worse for this. In practice we find the classic slots for placing the pieces of armor, the various rings and amulets and the weapon complete with a window for comparison and a convenient system for selling all objects deemed junk with the press of a single key. All this, however, only for Hawke, the protagonist. For the other characters there is no armor management but only the weapon and amulets: armour, hat and boots are in fact combined in a single slot which cannot be customized but is an integral part of the character itself. The player is allowed to purchase individual upgrades from various merchants (or as a reward for some quests) which are automatically applied to this slot. In total there can be q", "date": "2011-03-08", "grade": "9.0"}