{"name": "Cuore impavido", "ref": "https://multiplayer.it/recensioni/85994-battleheart-cuore-impavido.html", "text": "Although there are similarities between mouse control and the touch screen of a device such as the iPhone, at least in the context of a real-time strategy game, so far practically no one has managed the feat of publishing a title capable of convincing the App Store in this sense. The biggest problem is probably the small screen size: while on the iPad it would be possible to select a unit and then indicate its objective while maintaining a good view of the battlefield, doing the same thing on the iPhone and iPod Touch would be complicated, especially often having to use the zoom function. Therefore, wanting to create a quality RTS, the imperative is to design it around the peculiar characteristics of the device on which it is intended to run. In the case of Battleheart, for example, the action is limited to a single screen, a scenario that actually performs the functions of an arena and in which we find ourselves facing all the enemies on duty, until the battle ends with a win, with a loss or - why not? - with a retreat. Therefore, the need to scroll and possibly zoom the background is missing, and it is possible to concentrate on controlling the characters. Another important intuition of the Mika Mobile developers is identified with the numerical limit placed on the team we manage: regardless of how many characters we have hired, in fact, only four of them will be able to attend the battle, eliminate as many opponents as possible and collect the fruits of one's performance in the form of experience points and the consequent level up. A further strong point is represented by the graphics, designed with a style reminiscent of children's books, very pleasant in all its solutions, fairly varied and very well animated. A feast for the eyes, indeed. It's time of destruction! The mechanics behind Battleheart are actually very simple. In fact, it is enough to touch one of the characters on the team and draw a line towards an enemy for our warrior to move in that direction and start attacking until the target is eliminated. When the character is a healer, the same procedure must be performed to cast spells capable of restoring energy, an operation which proves to be essential for survival even during the first levels of the game. Similarly, if we have a mage capable of throwing fireballs, the procedure will be identical but the attack will be carried out from a distance. As mentioned above, each of the more than thirty available stages involve a furious battle, which becomes more and more complex both for the increasing number of enemies and for the arrival of more powerful than average opponents, or even big bosses. Once a challenge is completed, the members of our team earn experience points and cash, the latter spendable in the appropriate shop accessible from the menu screen, where we can buy or sell weapons, armor, robes, sticks, magic rings and many others objects - there are more than a hundred of them. In another screen we will therefore be able to assign the purchased items to the various characters, thanks to a very clear interface that promptly indicates whether this solution will actually serve to improve the performance of that particular member of the team or not. With money it will also be possible to hire new characters, choosing from the available classes (knights, thieves and wizards) the figures that most intrigue us and that we would like to test on the battlefield. Finally, having reached a certain level, each character will have access to special moves and we will be given the opportunity to choose them according to our needs. These extra hits will also prove important in battle. But let's go back to the actual gameplay: the control system works very well, showing the side of some uncertainty only when two characters overlap. In that case you need to quickly move one, but at some point this will become relatively easy to get around. The tested version is 1.0.5 Price: 2.39 App Store links", "date": "2011-03-08", "grade": "8.4"}