{"name": "L'altra fuga", "ref": "https://multiplayer.it/recensioni/85927-dead-space-2-severed-laltra-fuga.html", "text": "Version Tested: Xbox 360Announced well in advance, the first DLC for Dead Space 2 arrives almost over-timed. On the other hand, many are still trapped between the walls of the Sprawl but Severed is a reality that allows you to expand the main game with two new chapters, for an abundant hour of play (depending on the player's skill). As already known, the story distances itself from the story of Isaac Clarke, but runs parallel to it through the eyes of a new protagonist, Gabe Weller, already seen in Extraction. The aim is to guide Gabe to the Sprawl infirmary, to reunite with his wife Lexine, and escape the station. Those who have already thoroughly explored Dead Space 2 will quickly understand how this additional episode is structured, culminating precisely in the location where Isaac's misfortunes began. New intrigues are just waiting to be revealed, as well as new conjectures concerning the sinister alien brand that characterizes this saga. Characters even taken from the comic Salvage come into play. Nothing fundamental in any case, Severed is certainly not designed to add crucial pieces to the economy of history, but rather as a more of the same and a link with the aforementioned Extraction. And no... Gabe and Isaac do not meet, but rather we will find a rather petulant antagonist over the course of the two chapters, and a type of necromorphs recovered directly from the first chapter, the Twitchers. Gabe is also a significantly different character from Isaac, much rougher and tougher, and the tenor of his adventure is more geared towards action and the horror component. Xbox 360 goals Dead Space 2: Severed adds 250 points for a total of 8 new achievements. Nothing transcendental even in this sector: they are all related to the main campaign, and if in large part they can be conquered simply by finishing it, others require actions subject to certain conditions, which slightly stimulate replayability, obviously together with the inevitable goal of ending the game at the Fanatic level. Rest assured, you will still find Peng's treasure! Good luck. Mini Dead Space Gabe has a completely new suit compared to the main game and new downloadable packs, as well as a heavily modified version of the Pulse Rifle, and a lot of credits to invest. We can buy all the other weapons in the shops, even if the default one actually proves to be very effective, even too easy, and it is possible, as always, to exploit the nodes to upgrade the suit, the stasis and obviously the weapons. The biggest problem of Severed is its summary realization, unfortunately suggested by the low price, but which considerably weakens its legitimacy as paid content. It also turns out really too short to complete. The locations already seen in the main game are reused excessively, and the wonderful zero-g sections and epic moments of Isaac's campaign have been completely omitted. The twists set up are not enough to ward off boredom in revisiting places already visited, even if some pleasant gimmicks still guarantee a few jumps on the chair, and the greater darkness of the environment imposes a more circumspect action. The conclusion does not disappoint, and we will not spoil the surprise for you, but the time to get there is dangerously short, with few pretexts (excluding the obvious objectives) to go back to it. Survival horror or more specifically gore lovers will in any case find some satisfaction in this DLC, characterized by an excessive and disturbing level of violence as usual, but also a considerable pathos. The Twitchers are decidedly scary enemies, and it's a real pleasure to find them in these two episodes, but this does not erase a slight underlying bitterness for an expansion that could have been presented in a more substantial form. Severed can be downloaded from the Live marketplace for a cost of 560 MP, and from PSN for 6.99.", "date": "2011-03-07", "grade": "6.0"}