{"name": "Mechajammer", "ref": "https://multiplayer.it/recensioni/mechajammer-recensione.html", "text": "How nice, a turn-based isometric RPG set in a cyberpunk open world that promises to be complex and deep and to give the player a very wide freedom of choice. Moreover, the project was created by true fans of the genre, who were able to work freely thanks to the funding received on Kickstarter. What can go wrong? To find out, just read the review of Mechajammer. Make yourself comfortable. The terrible suspect Mechajammer is a very deep game... so much so that it's unreadable You already have the suspicion that something is wrong from the tutorial, which lasts about half an hour and in all this time fails to explain all the game systems well. Okay, this isn't the first time this has happened. We are not newbies and will definitely compensate in some way. So let's create our character, without really understanding some aspects of the editor (we'll talk about it again) and start playing. The idea is to have an interesting and multifaceted alter ego. We therefore opt to tackle the game with a kind of nerd who is very skilled in hacking, but not very versatile in combat, who in a previous life was first the data entry and then the laboratory assistant. Mal didn't blame us, since it is often simply not possible to avoid confrontations. The result is that we struggle enormously to overcome the first boss. Ok, let's try again. This time we did it. What can possibly go wrong with an energy-savvy heroine in a Cyberpunk world? Everything, as we shall see. Anyway, let's start playing. The control system seems quite typical to us: you click to walk and when facing enemies you press the right mouse button to attack. We can also move stealthily, ducking to take advantage of shadows or tall grass, so as to be difficult to spot by enemies. Despite the apparent clarity and the alleged depth of the whole, after a few minutes of playing Mechajammer actually reveals its worst sides, which lead to a request for divorce after a few hours. Character creation Some mechanics are obscure The main problem with Mechajammer is that its rules system half works and is very confusing, since the creation of the character, which we have only mentioned before. Meanwhile, it is not clear why the advantages and disadvantages of a career should not be easily identifiable. Also the disadvantages often don't make sense, because they literally break the game. Let's explain: when you create a new character, you can decide which career he has faced in a certain amount of time, then you can select one of the associated disadvantages which, in theory, should deepen the construction of his character and add a level of more complexity to the action. Too bad that some disadvantages are so invasive as to ruin the whole experience, especially during fights. Let's say, for example, that you want to create a kind of soldier, very skilled with weapons ... so you can give him disadvantages, such as having hands of butter or being prone to panic, which in fact make it a pain to fight, because after each action our hero will either risk losing his weapon, or run away (without success). In fact some careers and some disadvantages are not combinable, unless you want to have an experience beyond frustrating. It is true that if you want you can choose not to have any disadvantages, but in that case the creation of the character becomes a uniquely flat operation and in fact we are asked to give up one of the most significant choices among those feasible in this phase. After all, why put them in if at a certain point they become counterproductive for immersion? What is the point of producing similar paradoxes? Combat system The game world is well laid out Another huge problem of Mechajammer concerns the combat system. Basically, the first part of the game is spent facing melee enemies, armed only with knives. Everyone has damned knives. There are no other types of hidden weapons and there is no option to buy them. Nothing at all. Even the first boss has to be tackled with stabs, so to speak. What is the problem in this case? Easy to understand: if you have created a character skilled with firearms, you are left for hours with the impossibility of using it at its best, because we are not even provided with a dog slayer. But when you get the first firearm, you realize another problem: the enemies are very fast to reach us, so to bring the fight back to melee ... moreover, there is very little ammunition around. Unfortunately this is not even the biggest problem, because there is more. The whole system is extremelyand confused. For example, it is possible to land targeted shots, but to do so the enemy must be adjacent to the character (at least with melee weapons). The trouble is that it is often better to anticipate the blows to kill someone, that is by attacking towards a still free square where the opponent is expected to arrive. Too bad that in this way it is not possible to tell the character to aim, so bonuses and tactics go to hell. So forget about deep systems like those of Divinity: Original Sin II or Obsidian games. Here you must first come to terms with the absurdity of certain mechanics, then you can start role-playing, but always with the feeling of not having something clear. Control system The confusing character sheet Another problem is the control system, which couldn't be more anti-intuitive. Mechajammer is an isometric RPG based on a point and click exploration system, so why do you have to press the space bar and then give direction with the mouse to make jumps? Why not put a contextual action to overcome obstacles? Also, why do you switch to WASD controls when you pick up a vehicle? But that's not all: why doesn't the interface make me clearly understand what I'm doing? Want to break into a door? The roll of the dice starts whether it is possible to do it or not, without giving a way to fully understand the what and how. In the end it's always better to break everything, so as not to live oppressed by doubt. The same happens with hacking and other actions such as charisma, which require high values to start working. But that's not all... do you want more? Mechajammer is littered with bugs, some serious, some really serious. For example, the quicksave makes all killed enemies reappear. When it works. Or you can lose objects for no reason (read that disappear from the inventory) finding yourself in trouble, especially when they are particularly important. Again: the system takes wrong inputs by performing actions other than those intended to be performed. How we would have loved to love him When this happens in combat, you often end up dead and buried within a couple of turns. But the bug festival doesn't end there, because there are also interactions that block movement, menu buttons that stop working for unknown reasons and many other flaws that are simply not justifiable.Of course, after a few hours you get used to it and some some of these problems are mitigated by experience, but does a video game really have to torture us beyond measure before it starts making us play decently (and we stress decently, therefore not well)? The only aspect of Mechajammer that really works is the retro pixel art graphic style, which at least looks focused and conveys a dirty and merciless way. For the rest it seems to be faced with a set of rules designed to brutalize the players as much as possible, written by someone who misunderstood the concept of role-playing and decided to make every action opaque and unreadable, leaving only intuition the honor to decipher what happens on the screen.", "date": "2021-12-13", "grade": "4.0"}