{"name": "In cerca di redenzione", "ref": "https://multiplayer.it/recensioni/85935-painkiller-redemption-in-cerca-di-redenzione.html", "text": "Painkiller was released in the now distant 2004. Then it was the turn of the first expansion, Battle out of Hell, which (apparently) put an end to the main story, then the special version, the Black edition, which brought together both. The change of developer, with People Can Fly who ended up making Bulletstorm for Epic, produced the terrible Painkiller: Overdose (2007), an overdose yes, but of banality, despite being the sequel that most ~experienced~ compared on the first episode. Having lost its stability, the series undergoes another change of developer and the market can enjoy the disastrous Painkiller: Resurrection (2009), the only game that at the time of its release on the market did not have the most advertised mode in the marketing phase. the cooperative one (actually it was hidden, but it was better that they had canceled it seeing how it worked) and whose bugs have become legend more than the game itself. In these five years, in addition to the aforementioned releases, there have been other collections and a decent Xbox version to conclude the recycling of a game exploited beyond belief, far beyond the lawful. However, after the failure of Resurrection we all hoped that it was over and that Painkiller was a dead brand, instead JoWood, probably looking for cash to avoid definitive bankruptcy, decided to market yet another sequel so to speak, renamed Redemption for the occasion and sold for just under five euros on digital delivery services. redeem yourself! Redemptiti! redeem yourself! There isn't much to say about Redemption and you just need to start it to understand its nature as a mod to which the executable file has been pasted to make it a stand alone product. Again compared to the other Painkillers there is nothing to report: the protagonists are recycled, the enemies are recycled, the environments with their textures are recycled, the objects are recycled, the weapons are recycled and the menus are recycled. The soundtrack is made up of recycled metal songs and if you want we recycle something too and link to the old reviews so you read them and get a general idea of the game, without repeating here that it is a fast-paced shooter with a dark/gothic/metal/fantasy/fetish/porno/cyberpunk/Nazi/communist/post apocalyptic setting, which does not lack sprinkles of Dante's inferno and Miltonian paradise lost and which, despite the ridicule, is not gifted of no irony. In 2004 it was even fine, because a certain underlying creativity was still visible in such a kitsch meatloaf, but in 2011 everything seems cloying like an episode of La Prova del Cuoco. happy? We are sorry. Unfortunately the truth is that we have to get to three folders of text and that, therefore, you have to syrup a few more paragraphs of delusions. The Alternatives If you like the Painkiller-like shooter genre, where frenetic action is predominant, you can't miss the recent Bulletstom, created by the same authors of the first chapter of the JoWood saga. Bulletstorm is all about stylish kills that guarantee points accumulation. Try it. Wanting to look further back, we suggest you also try Dreamkiller, made by the same authors of Painkiller: Overdose and, above all, the first two Serious Sams by Croteam (not Serious Sam 2, which is not worth it), recently re-released in HD, where clashes with hundreds of enemies take place on huge and spectacular levels. To what? Redemption is structured in this way: you enter a more or less large room, activate the checkpoint and start shooting at hundreds of enemies (literally). When the bad guys are finished, you move on to the next room and start the massacre again. Repeat the formula n times until the end of the level and multiply by six (the total number of levels) to get the last Painkiller as a result. What about multiplayer? Not at all, nothing, nada, niet. Among the game options there is only the possibility of varying the level of difficulty in order to make the game incredibly more difficult and lengthen the challenge a bit. Mind you, shooting against hundreds of enemies is fun, as is seeing the kill count at the end of the level exceed a thousand units, but there's really nothing that hides the amateur nature of the project, including level design. It's a small tribute that may make some hardcore fans happy, but that doesn't make much sense outside of its celebratory mod nature. The bad thing is that the publisher tries to pass it off as a new chapter in the series and that in the pneumatic vacuum that composes it there is also a kind of story to act as a glue between the levels and to justify the crossover between the protagonists of the other episodes. Technically there isn't much to dire more than what was said. It's a 2004 game, so the graphics engine is from 2004. It had a certain effect at the time, today it doesn't hold a candle to even an indie game like Amnesia: The Dark Descent, let alone other projects with higher production values. Moreover, the defects are accentuated by the lack of any novelty, even in terms of soundtrack. True, it's cheap, but it's still a little bit with which you can buy better games.", "date": "2011-03-07", "grade": "5.5"}