{"name": "Le notti di Tokyo", "ref": "https://multiplayer.it/recensioni/85896-shibuya-le-notti-di-tokyo.html", "text": "Shibuya is one of the most characteristic districts of Tokyo, as you know. People usually meet near the statue of Hachiko (a bit ugly indeed...), also because finding yourself in the midst of the huge crowd that populates the area would be difficult. In Shibuya there is the most populated intersection in the world, with hundreds of people crossing the street every time the traffic light for pedestrians turns green, but it is especially in the evening that the district comes alive, turning into an evocative spectacle due to the dozens of giant advertising screens that project lights and colors into the night. It is precisely this image that the developers of Nevercenter were inspired to create Shibuya, a puzzle game for iPhone and iPod Touch which basically aims to create a certain atmosphere, thanks to its bright colors, which contrast with the black background, and to the fascinating soundtrack signed by Millionyoung (the songs are on sale on iTunes, by the way). The game is an answer to the age-old question ~is it possible to make an original puzzle game that is fun and long-lasting?~, with its simple but fresh mechanics and with an unexpected depth. It works like this: rectangles without a fill color, let's say ~transparent~, fall from above and line up on the scenario, while on the left side of the screen we can see the colors available in a precise order. As in most action puzzles, our goal is to match blocks of the same color, as many as possible, and then eliminate them all together. Well, keeping in mind the order of the colors we have to touch the transparent rectangles and make them take on the first shade available in the order, distributing the touches so as to create combinations which we will then eliminate. It's actually harder said than done, and it only takes a few seconds to figure out exactly how the game works. Lights and colors The games with Shibuya flow away pleasantly, in an almost surreal atmosphere due to the colors, the strong contrasts and the suggestive music. The Nevercenter title has been available on the App Store for a while, but recent updates have made it even more attractive, especially considering the retail price. There are two ways in which you can try your hand: Quick Play and Endless. In the first case, the game has a predetermined beginning and end, and in the time frame available to us we must be able to hit as many eliminations as possible, with an eye to the combos and above all to the forty-seven achievements to unlock, which by the way themselves constitute an added value to the experience. In the second case, as is clear, the game is in fact infinite and ends only when we can no longer keep up with the flow of rectangles, which line up without interruption, reaching the top of the scenario. For each mode there are five different levels of difficulty, or rather five possible speeds: mastering the first two is a relatively simple undertaking, but starting from the following levels things become really complicated, and lasting even just a handful of seconds implies a not indifferent hand-eye coordination, as well as an excellent ability to make sensible decisions quickly. The gameplay of Shibuya, in fact, is a continuous evolution of situations that are determined on the basis of our choices: if we manage to put together a large number of elements of the same color to perform a combo, we must likewise take into account all the rectangles mismatches that such an operation will inevitably end up producing. Because the flow won't stop, continuing unabated until game over. In fact, there is little to say about the graphics of this title: the interface is well designed, the screen is always very ~readable~ and the style, in general, is effective. The tested version is 1.1 Price: 1.59 App Store links", "date": "2011-03-04", "grade": "7.6"}