{"name": "Una storia al di l del bene e del male", "ref": "https://multiplayer.it/recensioni/85863-beyond-good-evil-hd-una-storia-al-di-la-del-bene-e-del-male.html", "text": "Version tested: Xbox 360 HD re-editions are a trend born in the last period, precisely with the advent of high definition, taking the form of operations motivated mainly by a couple of causes: the exploitation of a highly appealing brand, in which case the remastering takes on the contours of a tribute to a game that has made the history of the industry, or the desire to leverage the nostalgic factor, therefore the title is mainly taken into consideration by a more or less large niche of enthusiasts. Starting from these assumptions, the re-edition of Beyond Good & Evil already presents itself as an element of discontinuity. In fact, Michael Ancel's game, although universally recognized by critics as a high-level product, has never known a corresponding success from a commercial point of view and furthermore it is still too recent a game to be the protagonist of an operation- nostalgia. Then Beyond Good & Evil HD is configured as a different product from what has been seen so far in videogame remakes, proving to be a game that is still fresh, current, whose discovery or rediscovery surprises the player for the value of the original idea and for the modernity and maturity of the its conception and its realization, leading this game to be almost a direct competitor for the current action-adventures. Certainly it feels the weight of 8 years in which graphics technology has made giant strides, despite the dusting off in high definition still makes it enjoyable, but it is in its atmosphere, in that particular world and in its well carved characters that Beyond Good & Evil keeps its drive intact, etching a trail into the player's memory. The story of Jade and Pey'j, despite the excellent critical reception, did not have the hoped-for success at the time, due to one of those cosmic injustices that make the videogame firmament, like that of any other artistic field, studded with minor stars which are likely to end up forgotten in a hurry. This remastered version is the right opportunity to recover an experience that it would be a real shame not to try. Assault photojournalist Jade and Pey'j, an anthropomorphic pig, live in a lighthouse that houses a community of orphans. They look after them and help them grow, defending them, when they can, from a world in constant conflict between the creatures called DomZ and the Alpha teams, the police force of the planet Hillys, who always seem to arrive an instant too late on the place of need. Jade works as a photojournalist for a living and is in charge of collecting snapshots of all life forms on the planet on behalf of a scientist, who wants to catalog them. But our heroine is also a curious and heartfelt girl, who will find herself involved in an intriguing story, made up of genetic manipulations, the sinister confusion between good and evil and the evolution of affections and personalities of characters to whom it is impossible don't get attached. A mature story, narrated with excellent style, which however only wants to entertain without lessons to be imparted and does so with the usual attention to design that has made the fortune of this team of programmers. This time the imprint becomes more adult and the result is remarkable, freeing Michel Ancel and his friends from Rayman, a mascot as famous as it is cumbersome, and giving him infinite possibilities for evolution. The donut hole is not perfect, in about fifteen hours it is possible to see every corner of the planet, finishing the game, and some of the ideas, which its structure would have allowed, remain just mentioned. The living world and the population that reacts to Jade's exploits, being dragged into the revolt, help to recreate a first-rate general feeling, but surely there would have been room to create a truly unique work. The evolution of the game, apart from a few sub-quests, is a bit too linear and the idea of a completely free world available to the most curious remains only hinted at, while remaining the goodness of a narrative complex that involves for the entire duration of the game. Dynamic duo Beyond Good & Evil is an action adventure in which combat and stealth sessions alternate with puzzle solving and those where we find ourselves piloting vehicles, starting from a hovercraft, to explore the different locations on the planet. In dungeons there will always be two ways to and solve adversity, a noisier one and a more painless, but dangerous one, which consists in overcoming guards and various creatures hidden in the shadows. There are no visibility indicators, a la Splinter Cell, but only the common sense to understand, aided by an always functional camera, in which direction the opponents are oriented so as to be able to overcome them unnoticed. These parts are up to youpredominant lts and those who do not like the genre may turn up their noses, but honestly it is difficult to imagine someone who abandons the title for so little. The heart of the game certainly remains the possibility of interacting with a second character who assists Jade during fights and explorations. If you need a hand to operate two switches at the same time, to press one remotely, to unhinge a grate that is too robust for Jade with a single button, the problem can be solved thanks to the skills of the various supporting actors who support our heroine. During the clashes the artificial intelligence that manages these digital helpers is very good and only in rare cases gives problems, forcing the player to retrace his steps in search of the companion stuck in some element of the seabed. The management interface of the duo during the fights is simple to manage, given that with a button you activate the special shots of the other character, thanks to which spectacular and effective combos are created, and with another you feed him making him the power. The interaction between the two, in reality, ends in these few elements, since you will have to eliminate the enemies substantially by yourself, once you realize that your partner does nothing but get caught by the opponents and ask for help, not eliminating even one on his behalf. A further note of merit must be assigned to the camera, which during the fights switches to a third-person view slightly raised on Jade's head and which never loses the focus of the action. Xbox 360 goals Beyond Good & Evil HD contains 12 achievements for a total of 200 points to collect. Some are scattered throughout the game and are necessarily unlocked by progressing through the story, while others require more particular actions, such as collecting certain power-ups or obtaining results in runs and secondary mini-games. Hillys Dawn Talking about the graphics sector of a game released in 2003 on Xbox, PlayStation 2 and GameCube doesn't make much sense nowadays, at most we can take into consideration the adaptation that has been made of it, or evaluate how much of that excellent graphics that built the vast world of Hillys has remained intact and has come down to us eight years later. Of course, the modeling of the characters and the vastness of the environments to explore no longer arouse the wonder of the past, but much has remained of the original charm, in particular as regards the characterization of the characters and the bright colors used, which remind ' the ~old~ The Legend of Zelda: Wind Waker is a bit of a Miyazaki film, between semi-futuristic European-style cities, wild nature, anthropomorphic animals and seas to sail. At first sight it may seem like a product with a childish imprint but it is a big error of evaluation: the fantastic characterization serves to create a complex and wonderful world, in which adult and profound themes are inserted such as the dictatorship perpetrated through the control of the media , political duplicity and the shades of gray between good and evil. The high definition ~remastering~ did not improve the polygonal models very much, which today are rather spartan, but it did give a great cleaning to the image, making the colors and even simple textures stand out even more, with some even impressive points, like certain glimpses on the surface of the water in the exploratory sessions aboard the hovercraft, just to give an example. The audio sector has remained of the same excellent level as the original, with some additions as regards the soundtrack and the very above average dubbing that also characterized the 2003 version and which contributes to further enriching the atmosphere and the characters that populate the game world. The other additions applied in this version concern the presence of unlockable objectives and online rankings, marginal entries but which are still pleasing.", "date": "2011-03-02", "grade": "8.2"}