{"name": "Botte e GDR", "ref": "https://multiplayer.it/recensioni/85317-trinity-souls-of-zill-oll-botte-e-gdr.html", "text": "For most western gamers, the development team called Omega Force is the one within Koei responsible for the famous Dynasty Warriors series. But in Japan, as well as among many fans of our own genre, these ingenious developers are also known and appreciated for another series of games, this time role-playing, called Zill O'll. Originally born on PlayStation in 1999 and then evolved on PlayStation 2 with the sequel entitled Zill O'll Infinity, this saga did not have much luck outside the Asian market where it never came out. In the first case, overshadowed by the presence of the blockbuster of the time, Final Fantasy VIII, the progenitor of the series was so eclipsed even at home that the software house decided to avoid a western release. In the second, however, while counting this time on a moderate success in Japan, Koei thought the same not to risk exporting the game in our area. Now, however, evidently the time is ripe and finally Omega Force and its publisher have decided to give it a try, opening the doors to the western market for the first time to the franchise and bringing its new creation to us too, with the third, anomalous, episode of the series titled Trinity: Souls of Zill O'll. The plot behind this third episode of the series is, among other things, a prequel to the first Zill O'll: set five years earlier, in fact, Trinity still takes place in the world of Bascion, a place populated by the classic races of all self-respecting fantasy world, such as dwarves, elves and humans. Here will revolve the events related to the emperor Balor, King Selmonoe and Queen Eris, a terrible prophecy, the classic clash between good and evil represented as tradition has it by two rival kingdoms, Dyneskal and Rostorl located respectively north and south of the continent by Vyashion. And of course those relating to the protagonists of the adventure. And here we stop so as not to spoil too much and deprive you of the pleasure of discovering the details of the story for yourself. Mixed blood Also because the plot in Trinity: Souls of Zill O'll has several facets that make it complex in some cases and in some respects not very linear. Suffice it to say that it also deals with the problem of racism and its consequences in the world, revisited in relation to the fantastic races present in the video game. Speaking of actual gameplay, the player will mainly follow the vicissitudes of three protagonists: Areus, a half-human and half-elf gladiator with a grumpy character, alienated during his growth due to his hybrid origin and by the events of his past related to Balor . Dagda, the strongman, who fights with bare hands and has a primitive appearance, but is surprisingly intelligent. Finally Selene, the last survivor of the Darkenith tribe exterminated by humans, a murderous vampire. Others, such as the charismatic Nemea, the adventuress Orpheus or the swordmaster Reig will cross paths with our heroes during the adventure. Much of the story is told textually, and the dialogues usually take place in fixed screens with the three-dimensional avatar of the characters placed on the left and right of the screen, and their lines written in special boxes. Every now and then some CGI footage comes out with a lot of English dubbing to underline the most salient phases of the story, but nothing more. Everything then develops in terms of actual playability mainly through a series of main quests that allow the plot to progress and secondary missions that players can obtain by exploring the game world or by visiting the ~guilds~ in the various cities: unfortunately the latter cannot be ~really~ visited and this is particularly annoying since it is still a product that should also have RPG elements well outside the usual level-up of weapons and PG. In fact, the exploration is undermined from the start, except for the dungeons which are fully explorable. Quests and subquests The interaction, so to speak, with the city areas, therefore, is reduced to a point-and-click navigation system: when you want to go to a place, you select its name and you get there right away. But once on site, one realizes that one can only choose further, against a background depicting the location in which one is located, whether to access a tavern, a guild or an item shop. Even here virtually, since only the design of the backdrop changes. Luckily, as mentioned, there are quests to tackle, which are really quite a lot and quite varied, complete with rewards linked to them which are clearly money or new items. Some of these missions, as mentioned above, fansno as a common thread for the entire primary narrative part of the adventure. Many, however, are disconnected from the narrative and have been created with the sole purpose of making them face the most ~fanatic~ users to grow the characters or to unlock new content. Among other things, if this should get boring, the developers have seen fit to vary the structure of the game a little with the Liberdam Arena, a place where you can overcome various combat challenges to obtain further prizes and awards for our heroes. According to the developers, it will take a player about thirty hours to complete the adventure by following only the main story, but almost double if they fully explore each setting by solving all the optional missions. In any case, this structure guarantees a certain freedom and variety, given that then through the choices made during the key events it is possible to change the consequences and also the reactions of the NPCs. The same freedom has been proposed in the combat system, with the latter usually breaking simply when enemies cross the screen: unlike the prequels, Trinity's battle-system is much more oriented towards pure action and resembles at a cross between The Legend of Zelda, Namco's Tales series and Dynasty Warriors. Playstation 3 trophies Trinity: Souls of Zill O'll offers gamers 42 Trophies divided as follows: 28 Bronze, 9 Silver, 4 Gold and 1 Platinum. As a general custom, to obtain these prizes it is necessary to satisfy various requests of the game, such as enlisting specific characters in your party, winning cups in the arenas or crossing all the dungeons and cities present in the course of the main adventure. Real-time fights Taking advantage of the classic commands of the genre and therefore jump, dodge, attack and parry, the trio of protagonists will face enemies simultaneously but the player will be able to directly control only one character at a time while the others will be managed by artificial intelligence. However, with the simple touch of one of the buttons on the PlayStation 3 pad (L2), the companions of fortune can be controlled, always one at a time, at any time by the user, who can then take advantage of their unique abilities that distinguish them from each other. others. Each of them, in fact, has a wide repertoire of magic and special attacks, freely configurable on the three main keys and can even be linked together, as well as from character to character, to produce devastating combos against unfortunate enemies (Trinity Attack Combos). Furthermore, for each of them you can equip two sets of three skills each to alternate if you want by pressing the R2 key. In this way you have six skills (usually magical and physical attack) available to use based on the specific situations you face. When changing characters, it happens that you have some problems positioning the game camera, but nothing that cannot be solved by repositioning it manually. In these situations, the discordant note is, if anything, the presence in many areas of enemies that are too similar to each other in terms of resistance, appearance and skills. For example, if you face orcs these tend to be all the same not only visually but also in the technical parameters that distinguish them, in the movements and actions they perform, thus making the clash with them repetitive in the long run and devoid of those strategic elements which certainly usually represent the salt of certain products and a positive increase in the proposed level of challenge. In any case, for each enemy killed, the game rewards the player and his party with points to be used to unlock new skills, and for the typical upgrades of the genre, from those relating to weapons to the abilities of the characters. A particular graphic The gameplay they said earlier also presents reminiscences of Dynasty Warriors, at least as regards the hack-and-slash fights, but compared to this series, however, Trinity: Souls of Zill O'll appears more complete thanks to the possibility of using magic and make more allies interact, as mentioned in the previous paragraph. Of course, it is also true that this collaboration between the three party members is not always effective given the not too advanced artificial intelligence of the CPU. So much so that often the contribution and support of the two elements of the group managed by the game loses its effectiveness in the most chaotic or slightly more elaborate clashes, but it is still pleasant to be able to use them in rotation or create group combos. Final note on the graphics and sound of the product. The engine behind Trinity: Souls of Zill O'll issame that for many years we have seen used for the various Dynasty Warriors 5, Dynasty Warriors 6, Dynasty Warriors: Gundam, Fist of the North Star: Ken's Rage, and the whole plethora of themed titles, even if in the game covered in this review it presents itself in a rather peculiar way. The visual technique adopted by the graphics, in fact, is really intriguing and the style used for the coloring and the effects are reminiscent of an oil painting. Especially in cel shaded backdrops. However, this bizarre choice fits quite well with the exquisitely fantasy setting of the game and paradoxically seems to perform better overall than the other games mentioned above where the engine has been used. The characters are fairly made and characterized, especially the main ones, apart from some uncertainty in some animations, while the monsters do not stand out for their originality or high level of detail, except for the mammoth and fascinating bosses in their own way. The audio features a normal soundtrack without infamy and without praise, and an English dubbing in the few cutscenes in medium-level computer graphics.", "date": "2011-03-01", "grade": "6.4"}