{"name": "Castigati dal caos", "ref": "https://multiplayer.it/recensioni/85773-warhammer-40000-dawn-of-war-ii-retribution-castigati-dal-caos.html", "text": "It is undeniable that Relic has a precise design behind its brand developed under the omnipresent artistic direction of Games Workshop, holder of the rights to the entire franchise. In February 2009 Warhammer 40,000 Dawn of War II arrives on the market, while just over a year later it is the turn of Chaos Rising, the first official expansion. And now, in the first week of March, again just 12 months later, it's the turn of Retribution, the second add-on of the real-time strategy. Once again it will be the competitive price of the package and its stand-alone nature - in fact, to play it there is no need to have the two previous games installed - that will stimulate the propensity of players to purchase. But of course there is no shortage of tasty novelties in terms of gameplay; let us analyze them in detail. apparent freedom So let's start by saying that Dawn of War II: Retribution obviously offers a brand new single player campaign that has an interesting peculiarity. In fact, the 15 missions that make up the adventure follow a rather light narrative plot, based on a plot that unfortunately distances itself in the negative from what was told in the original game or even in Chaos Rising. However, the decision taken by Relic has a very interesting aspect for true fans of the universe: for the first time in the series, the campaign can be tackled with any of the five races previously seen: Orks, Space Marines, Chaos Marines, Eldar and Tyranids with the happy addition of the Imperial Guards, introduced for the first time with this expansion. Basically the story remains the same and takes place ten years after what is narrated in Chaos Rising: the Blood Ravens, one of the chapters of the Space Marines, have been betrayed by their Chapter Master and Chief Librarian who has succumbed to the lure of Chaos and, after having killed the demon Ulkair who threatened the Aurelia sector, they are desperately searching for the traitor in the last attempt to get rid of the accusation of renegades that weighs on their head and, above all, prevent the application of the Extarminatus, the final weapon of mass destruction of the Empire, just arrived in the sub-sector to verify what is happening. Each race will obviously act for its own personal gain and there will therefore be minimal variations on the theme, as well as a different incipit and epilogue, but the succession of missions, despite the different objectives, will remain the same. Depending on the difficulty level chosen (four as usual), the number of optional missions completed and personal competence with the race used, it will take you no less than 8 hours to complete the campaign but you will have no difficulty reaching even 12 in certain conditions. And even if the narrative device used by Relic will probably leave you disappointed by a lack of affection towards the heroes and above all by a lack of epic tones in the story, we can assure you that you will be very stimulated to replay the campaign no less than 2-3 times to experience the different attack and defense styles that characterize the different races. Originality and compromises If you have decided to read this review it is very likely that you know Dawn of War II and its distinctive style of gameplay. In fact, the title of Relic, although belonging to the real-time strategy genre, completely sets aside the mechanics of building the base and troops in favor of the meticulous and extremely tactical management of a handful of heroes through careful planning of movements and assaults . The covers are in fact a crucial element of the gameplay and to use them properly it is essential to exploit the verticality of the terrain, its roughness and more generally all the elements of the scenario. With Retribution, part of this originality of the video game project is lost but, fortunately for those who play, with not completely negative consequences. During the missions it will in fact be possible to conquer the various teleporting lighthouses and headquarters to increase the population limit and invest the energy and relic points collected in the construction of infantry and vehicles. The resources always remain scarce enough to prevent assaults with large numbers typical of other RTS, but there is no doubt that in doing so the chaos of the battles increases and the gameplay tends to lighten its tactics, given that it becomes much more permissive for the player to send to the assault handfuls of troops without worrying too much about the placement of your own and especially enemy units. This is especially noticeable in the more advanced missions, when we manage to gain access to the vehicles and themore armored infantry. This revamped style of gameplay obviously has consequences outside of the actual missions as well. First of all, as a reward for each mission we will have to choose between the inevitable piece of equipment and two upgrades for our units. Secondly, during the deployment phase that precedes the loading of the map, we will be able to decide to leave the heroes at home to have access to a slightly enhanced version of some units and unlock a handful of ancillary bonuses, such as a higher population limit or damage increased for certain troops. The whole system works quite well and exponentially increases the degree of freedom given to the player in the composition of his own assault force without excessively showing the side to balancing problems (even if Retribution, compared to its predecessors, is much easier to complete ). However, also to meet these changes, the number of heroes has been drastically reduced: now there are only four per race and the level cap is locked at 10th level with a reduction in the enhancement system of one's pets that always remains divided into the three trees Stamina, Attack and Willpower but each consisting of only 5 levels. Playing better in company! We also find some news in the multiplayer sector of Dawn of War II: Retribution. Of course, the possibility of playing the entire campaign also remains valid in cooperatives accompanied by a second player as already seen in the two previous titles, with the addition of a chat that is always active in all game screens except during the real mission and its own, useful for meeting people to play with in an instant, appropriately divided into the various rooms available. Also inevitable is the Last Stand mode that returns in this expansion enhanced by the obvious addition of the Imperial Guard. It is a cooperative mode that allows four players in total to resist waves of enemies of increasing difficulty and increasingly varied composition. As far as competitive multiplayer is concerned, we find the two game modes that Dawn of War II has accustomed us to, Annihilation and Victory Point Control, accompanied this time by two very classic types but, if memory serves us correctly, historically absent in the series : the classic Free-for-All and the team variant. In all cases the limit is six simultaneous players, possibly divided into three different teams. From a technical point of view, however, we have not noticed any particular changes. Retribution, like the whole series, remains absolutely splendid to look at with excellent lighting effects and a great detail for the structures and models that are always animated to perfection. And as per tradition, the game amazes with the excellent rendering of explosions and debris that always behave in a very believable way, thanks to the excellent physics that manages the game world and which allows constant modification of the terrain and buildings in consequence of the most violent impacts. Applause must also go to the excellent audio sector composed of a really well acted dubbing in English (the game is in any case fully subtitled in Italian), audio effects up to the production and some orchestral music perhaps a little weak but never boring.", "date": "2011-03-01", "grade": "8.0"}