{"name": "Ben 10 Ultimate Alien: Cosmic Destruction", "ref": "https://multiplayer.it/recensioni/85571-ben-10-ultimate-alien-cosmic-destruction-il-futuro-del-mondo-e-nelle-nostre-mani.html", "text": "Tested version: Xbox 360Ben Tennyson ~aka~ Ben 10 is the protagonist of a cartoon television series signed USA, the boy at only 10 years old has the power to transform into 10 different aliens - the number ten or ~ten~ is be the fulcrum of the story - thanks to the discovery of an extraterrestrial artifact. Ben 10 Ultimate Alien: Cosmic Destruction is part of the series of video games dedicated to the protagonist: a completely hilarious story with travels between the most important capitals in the world including Paris, Rome and Tokyo, in search of ancient artifacts of the galvanic race, necessary for the preservation of the world. The title follows the plot of the Cartoon Network animated series where the protagonist, supported by his cousin Gwen and his friend Kevin, will have a powerful bracelet called the Ultimatrix, capable of transforming him into sixteen aliens between normal and Ultimate and in the specific case of the console Xbox 360 you have available as a unique alien Tiger, a feline-like humanoid with strong aggressive tendencies. Alien fight The title puts us in the role of the protagonist, with the aim of recovering the remains of an ancient artifact to prevent the enemy - an alien being - from destroying the Earth. We therefore collide with his robot henchmen, but also aliens or hominids who will inevitably try to put a spoke in our wheels. The locations are quite realistic, considering that it is a title for children, the game takes us between the most suggestive capitals of the world and their most important iconic areas such as the Great Wall of China, the Eiffel Tower, the Colosseum or the Amazon Rainforest . The first missions of Ben 10 Ultimate Alien: Cosmic Destruction create a sense of freedom which is however apparent: despite having the autonomy to choose an alien transformation to our liking, the title often forces us to follow the suggestions it offers us and only in this way we will be able to pass the different missions. Although it is not exactly a difficult game, the puzzles present in the title are directly proportional to the average age of the players who prefer this category, and refer particularly to the careful choice among the available aliens precisely because each of them has a well-defined purpose. accurate. The combat phase against the enemies should be enhanced thanks to the collection of DNA fragments that increase the resources of our aliens making them stronger in battle, but this peculiarity turns out to be almost nil going on with the game, only at the beginning is there a Power boost on Omosaurus. Still speaking of the attack, it can be observed how the counterattack to the enemies is carried out absolutely automatically, it is enough just to control the blows or even simply to attack, since the directions are mechanically facilitated by the title itself. On the gameplay we can say that it inevitably exploits the playability of a typical action title, with the bad habit of running into some little defects such as the difficulty of climbing ledges which often turns out to be imprecise or even tiring, an excellent approach instead is found in the fairly rapid transformations and in the various viewing angles in our possession. Ben 10: the hero of the moment Thanks to its story, the title manages to satisfy the ranks of little Cartoon Network fans, but obviously the fun lies in the total knowledge of the animated events, this is exactly how you can enjoy the adventure of Ben 10 Ultimate Alien: Cosmic Destruction with his multiple alien transformations. In fact, it is precisely because of the story that all eight missions can be tackled well, but in particular we start with an advantage by knowing the powers of the aliens available to our transformations: Gelon has thermal control, invisibility and the ability to fly, Omosaurus is endowed with superstrength and shapeshifting, Mudflame as the name suggests ~plays~ with fire and EcoEco is a nice little alien with the peculiarity of splitting in two and tricking his prey thanks to sound waves. Impersonating your own hero is every child's dream and Ben 10 is now a symbol for kids, it has become an irreplaceable must that appears in every magazine, backpack or video game. The only oddity is that you can enjoy the game more through the single player mode, the multi-player mode makes you lose concentration and even our partner gets tired a lot who won't be able to interact, but obviously wait for his turn. The advice in reference to this title is therefore aimed at fans who will fully enjoy the adventures-misadventures of Ben Tennyson! Comment Graphics Low difficulty Intriguing plot Technical inaccuracies Modalmultiplayer ity Suggestions", "date": "2011-02-24", "grade": null}