{"name": "Winnie the Pooh e le Pance Brontolanti", "ref": "https://multiplayer.it/recensioni/winnie-the-pooh-e-le-pance-brontolanti.html", "text": "Winnie, do you still remember Wanting necessarily to ascribe this title to a canonical genre other than that of ~children's game~, we just have to dust off the perhaps too generic but always useful Action Adventure: the three-quarter shot from above and the patterned structure with which the forest and surroundings are represented brings to mind Luigi's Mansion, and perhaps it is no coincidence that by pressing the two backbones the controlled character performs nice verses. Every memory starts from Winnie's house and the goal is always to bring the organization of the birthday party to a successful conclusion, going around, talking to the other inhabitants of the wood, occasionally recovering and using various objects. There is no shortage of jars of honey to be found in those objects on the seabed that have a strange luminescence and which, once found, will go around the area with you to chase them, just as enemies are not absent, in this case freckles and knots (and they are not typos), of the most varied types. Obviously, although in theory Pooh is equipped with attack moves, not with these, which are only used for the aforementioned jars, he will overcome his opponents; but he will have to flee from them to get to a balloon to blow up, thus scaring the grotesque (er) creatures. It is in these situations that the title gives its best if you want to talk about the dear old gameplay, because for the rest, you will understand, there is not much. It is in these situations that the title gives its best if you want to talk about the good old gameplay Winnie, do you still remember Of course, it's a very normal thing: the title is expressly dedicated to a very young audience and there are few and easy things to do; furthermore the dialogues and the very frequent cut scenes are a didactic guide that explains to the player exactly what he must do to overcome the obstacle, at the same time creating the illusion of being in a Pooh film rather than in a video game, an illusion which , we are sure, the little players will appreciate it a lot. Closing the Adventure discussion, occasionally we will be driving the friends of Pooh, Piglet, Tigger and Hi-ho. With Piglet and Tigger we will have two different ways to eliminate the opponents: the little pig will have to spot them from as far away as possible and scare them with grimaces to be performed by pressing the buttons that appear on the screen as in a Quick Time Event, while the feline will have to plush, simply avoid being seen. Hi-ho instead will carry Pooh on his back for a few moments, necessary to catch a few butterflies useful for the most varied purposes. The controls are quite simple but often not precise, just as some collisions would seem to be not very logical: usually, with such a slow pace, there is no problem, but in the ~clashes~ with phlegants and knots the little gamer could even lose his patience ... The picture is completed by a series of simple and fun mini-games to be played alone or in pairs and a Junior mode dedicated if not to babies in swaddling clothes, to those just a few months older: it is a question of going around and pressing A where indicated , to see what happens The Wood of 100 Pixels Graphically, the first impact is surprisingly good: the image is bright, clear and colorful, and the 100 Acre Wood is rendered with a wealth of detail and absolutely impeccable fidelity to the original. There are quite a few polygons used and the textures do their duty with more than enough results; of course, to examine them closely there would be some perplexity, but in fact they are almost never framed up close and if it is the final effect that counts, we are faced with an excellent job. Even some ~direction choices~ are commendable, made on purpose to make the most of the spectacular scenery. The same thing goes for the characters, all of them, even the unusable ones like Uffa and Cork, very faithful to the animated counterparts with fluid animations and taken verbatim from the cartoon. However, the nature of the conversion from PS2 emerges, as well as viewing some elements of the landscape such as the water of a waterfall, as soon as the scrolling moves a bit and the framerate regularly drops below the guard level: it's a real shame , because in this way that feeling, otherwise so well restored, of being inside the carton is somewhat removed. The sound is even excellent, not so much for the nice but canonical music and effects, as for the dubbing of the numerous dialogues, which makes use of all the Italian dubbers of the films for an impeccable final result, superior, and not just, to that of many much more famous games; on the same line are the computer graphics videos, well done from a technical point of view, even if we had facedat the work of the Disney animators themselves we would have been even happier. Such a positive picture of the technical sector is unfortunately marred by a couple of glaring errors that we found in the test: movies that go slower than they should, sound that lowers for no reason whatsoever and even disappears completely in a cut scenes. Technical aspect, with its lights and shadows aside, this title is rather difficult to judge, like all titles dedicated to an audience of very young people, for whom a pedagogue would be needed rather than a player... However, we recognize the attention instilled by the Phoenix programmers in making the title as ~immersive~ as possible, sufficiently fun and guided to represent a rather soft and apt way to introduce a young child into the fantastic world of virtual puppets. The small number you see on the side therefore represents purely an attempt to weigh the playful quality and the pros and cons of the technical implementation ~as an accountant~; it goes without saying that if what you are looking for is a title suitable for a little brother or a little son, the new Winnie Pooh will most likely be for you, but it must really be about children of preschool age or little more, given that today an innocent little he probably knows more than you about how to unleash some healthy gratuitous violence in GTA. Everyone else can safely pass by; oh god, if you're thirty and you're a fetish for Pooh and his companions, take a seat... Pros Good exploitation of the license Great dubbing, excellent scenarios and characters Suitable for the target audience Cons Controls and collisions to be reviewed Framerate inconsistent Technical bugs that can be avoided... It is easy to deduce that Winnie Pooh is not exactly a stoic teddy bear when it comes to resisting honey, even by looking at his not exactly perfect figure: his penchant for the sweet bee product, however, risks putting him in serious danger when in the Wood of 100 Acres are raging knots and ephelants, as well as being the antecedent of this new videogame performance. The title under our severe judging eyes is in fact made up, in its Adventure mode, of five memories of as many birthday parties for Pooh and his friends, which the bear tries hard to remember so as not to hear, guess what, the hunger pangs", "date": "2005-04-29", "grade": null}