{"name": "He's on fire!", "ref": "https://multiplayer.it/recensioni/85431-nba-jam-hes-on-fire.html", "text": "It was back in 1993 when Midway brought the original NBA Jam to theaters: a distinctly arcade basketball game, in which teams made up of only two components faced each other in the official NBA championship, complete with logos and real players, with three-pointers, jumps and dunks so impossible to conquer both the audience of basketball fans and those who had never seen a basketball game in their life. The success was immediate, the game was converted for all platforms of the time (SNES, Mega Drive, Mega CD, Game Boy and Game Gear) and also produced some sequels, but the story ended more or less three years later, basically because the series had said it all and Midway's attempts to reinterpret it in different keys did not have the same public response. Last year Electronic Arts recovered the NBA Jam brand and made an excellent reboot for Wii, PS3 and Xbox 360, capable of combining the classic gameplay of the 90s with current technical solutions, including an online multiplayer mode. The iPhone reduction of the game is evidently the daughter of the same idea, but on the Apple portable device it presents itself in such a convincing guise as to demonstrate that the App Store can certainly be full of ultra-arcade games and various brain teasers, but that when a publisher is serious there is none for anyone. Boom! NBA Jam for iPhone is precisely NBA Jam, not a pale imitation. The game provides us with all the teams of the National Basketball Association and the structure that fans of the series created by Midway know well: quick games or an extremely full-bodied career mode, in which as a team leader we have the task of beating all the others in an increasingly impervious path. The presence of unlockable achievements proves to be a nice extra, but it is the gameplay that plays a leading role, also thanks to an excellent control system, based entirely on the touch screen. Using a virtual analog stick and three buttons, we have the ability to move our player on the field, activate the ~turbo~, dunk or make jump shots, pass or steal the ball, make spectacular alley-oops and much more. Where individual keys do not arrive, the imagination of the developers takes care of it: by holding down the turbo button and sliding towards the shot button or towards the pass button, we can respectively perform a dunk with a run-up or a push. The typical elements of NBA Jam gameplay are all there, nothing is missing, and the only, unfortunately systematic, limit of this solution lies in the space occupied by our left thumb, which inevitably ends up hiding the action when it moves suddenly on the left side of the screen. Moments of confusion during matches, in fact, never fail, but in the end it is a question of one of the peculiarities of the series: if during the defensive phase an opponent escapes the marking and flies away for the basket, it is clear that our player will take a while to close the gap again, and the basket will be almost inevitable. The quality of the AI is also surprising, both as regards our partner on duty and as regards the opponents, with the increase in the degree of difficulty which is rendered very well, at least up to a certain point. There are players and teams to unlock for a fee, but in reality what the EA product offers us from the start is already enough to have fun for hours. Similarly, the technical realization of the game is extraordinary: apart from the big difference in terms of fluidity of the animations, the iPhone version of the game is not that far from the Wii version, commentary included. What is really missing is a multiplayer mode: the career mode is full-bodied but runs out at a certain point, and the paid packages alone do not guarantee greater longevity for the product. Hopefully this feature will be added in a future update... The tested version is 1.0.0 Price: 3.99 App Store links", "date": "2011-02-21", "grade": "8.6"}