{"name": "L'anima ludica della tavola periodica", "ref": "https://multiplayer.it/recensioni/85238-spacechem-lanima-ludica-della-tavola-periodica.html", "text": "Few things in the world are more geeky than molecular chemistry and puzzle games. In application of the holistic philosophy, a puzzle game that asks you to fuse atoms together to obtain molecules, certainly falls into this short list. SpaceChem, developed by the semi-unknown but not newcomer Zachtronics Industries, has been released for some time now and after puzzling over it for several days and nights, we are ready to discuss one of the most original, challenging and well-studied exponents of the genre in recent years . The twenty dollars required to receive the serial code that unlocks all three versions of Windows PC, Mac and Linux might seem like a lot at first glance but already at a very first glance the production values are clear as day, to the point of making it a worthy competitor for the titles of the most famous brands, such as PopCap Games. From fish to space In the future told by the game SpaceChem is a company which, founded in 2745 to operate in the fish sector (?!?), has grown over time to become a powerhouse in the energy sector. One of those multinationals that in science fiction books decide the fate of entire galaxies and in this case also of the protagonist of the game, a specialized technician who will be accompanied in his career. From the first experiments to the management of complexes formed by several plants and then to alien attack scenarios to be rejected not by holding some gigantic weapon, but by propitiating their functioning through the creation of the conditions for the right chemical reactions. The whole presentation part, graphic but also narrative, is clearly of secondary importance but the set of 2D tables and text still manage to give a modicum of identification, just enough to immerse yourself inside the reactors where the real magic happens own... In fact, the puzzles must be solved on special benches that represent fusion reactors equipped with two inlets from which atoms and molecules flow, and as many outlets to be used as outlets for the finished products. To modify the former, the player has two lines available on which as many cursors slide which, by passing over the appropriate orders positioned along the path, activate the desired reaction. To create a molecule of oxygen present in the air, O2, for example, two cycles must be carried out which collect the individual O atoms, take them to the point set up for creating the bonds necessary to unite them in a molecule and then lead them to the exit point. The set of mechanics is conceptually simple but the freedom offered to find the possible solutions initially leaves us dumbfounded: SpaceChem's approach goes against the trend of traditional puzzle games which make all the possible solutions explicit right from the start - combinations of colours, numbers, objects and so on - choosing to pose a problem to the user and put the tools in his hand to attack him until the coveted solution. A choice that would have deserved a better set of tutorials but, having overcome the initial discouragement, it gives great satisfaction precisely because certain methodologies learned during a scheme can be useful in subsequent ones and so on, giving the whole a very rigorous flavor. Almost scientific. Even simple options such as being able to view the number of moves and triggers used in a level or sharing a video of a solution on YouTube stimulate you to go back to the puzzles to complete them again but in a more elegant or imaginative way. There is also the demo! Anyone wishing to try SpaceChem before deciding to buy can do so thanks to the special demo, which can be downloaded at this address. The demo version is available for Windows, Mac OSX and Linux. Beyond expectations However, where SpaceChem really leaves you speechless is in the variety of situations proposed, how far beyond the premise it manages to go. In contrast to an indie market that is often excellent in the search for innovative ideas but unable to develop them to the end, Zachtronics Industries has created more than fifty standard levels and optional puzzles to be dedicated to as a further, sometimes inhuman challenge. After the first interlocutory skirmishes we find ourselves struggling with the need to devise projects divided over several reactors or to create multiple paths that take into account a flow of non-heterogeneous atoms. You have to bend your science to the most unlikely needs, including machinery to stop before they compromise the integrity of the planet you are on or monstrous alien creatures to shoot missiles at. The nature of the experience allows you to play SpaceChem a bit like playing turret strategy gamesni, reflecting on the moves and going back to it: having started a puzzle you never really leave it until you have completed it and the hassle of completing it also follows when the game window is minimized or the computer is turned off. Among other things, the options sector is taken care of by offering some useful tools, such as the possibility of saving reactors in operation and then reusing them in other similar or larger contexts. Sure, there are flaws especially related to the balance of certain schemes compared to others or the quality of some slightly subdued passages, but overall the experience does everything in its power to bewitch from start to finish. It would be nice to have an editor to create your own challenges and then share them, just as some extra modes wouldn't hurt, but these are details of secondary importance.", "date": "2011-02-15", "grade": "9.0"}