{"name": "Nella mente del nemico", "ref": "https://multiplayer.it/recensioni/84859-mindjack-nella-mente-del-nemico.html", "text": "Tested version: PlayStation 3The success of titles such as Gears of War has given the ~there~ in recent years to dozens of more or less successful clones of third-person shooters based on game mechanics in which the tactical element focuses on cover rather which on the mad assault is the cornerstone around which to rotate the entire structure of the gameplay. One of the best in this sense, even if with a more action and frenetic style than the Epic Games masterpiece, was Mikami's Vanquish, just to give an example. Now Square Enix is also trying to have its say in this genre with a title developed by feelplus Inc., a team already seen at work in games such as Mistwalker's Lost Odyssey (they collaborated in the creation) or Ju-on: The Grudge for Nintendo Wii . Mindjack is in fact a third-person shooter set in a near future imagined by the writers around the year 2031, where the usual mega corporations are the masters of national governments now in constant decline. Thanks to new technologies, the entire population has access to all types of information, through special earphones directly connected to the brain, obviously at the price of traceability and personal freedom. But as with everything there is always someone smarter and more skilled than others who manages to exploit certain resources or situations to their advantage. Specifically, someone has found a way to hack the headset to take possession of the minds, but above all to transfer their consciousness to another individual, thus acquiring their skills and weapons and making them do whatever they want. In this scenario, the events of special agents Jim and Rebecca take place, engaged in the recovery of valuable information relating to Nerkas Solutions Inc., a company with illicit business that poses a serious threat to humanity. Bondage of conscience The game, in the intentions of the creators, starts from the basic idea of merging the single player campaign with the team deathmatch dynamics. Borrowing the basic idea from Demon's Souls, the developers have therefore created a single player campaign, which if open to the network, allows players (up to a maximum of five) to enter the host game, both as an enemy and as an ally, initially in the form of a red and blue cloud, to then immediately seek the bodily form to enslave or possess. Consequently, to the typical third-person shooter dynamics, a whole series of mechanisms are added for which, what was a simple mission one against all, becomes a challenge in which two teams face each other, where players from different 'one and the other side, in an incessant exchange of roles, impersonating any NPC present on the scene, be it a soldier armed to the teeth, an unsuspecting passer-by caught in the middle of the firefight or robotic or biomechanical entities. Through this power it is in fact possible to enter the minds of anyone, and make them do whatever you want indirectly, that is, by giving them orders, or directly, assuming physical control. In the first case, the mindjack mechanism is quite simple: after putting an opponent on the ground, before any coup de grace, if you don't want to kill him, just press a special key when an ad hoc icon appears to enslave him (hence the term that indicates this technique, Mind Slave), and what was previously an enemy or a neutral person will begin to turn against his former teammates or in any case against the opponents of the gamer. The latter can then decide on the spot how to use it, that is, whether for purely attacking tasks or as a simple diversion. Playstation 3 trophies Mindjack offers gamers 51 Trophies to conquer. In detail they are: 41 of Bronze, 7 of Silver, 2 of Gold and 1 of Platinum. To get them, you need to meet specific game requests such as joining forces with Rebecca to repel a terrorist attack or reaching a certain level as a hacker. Mental piracy However, this type of mind control is limited by the game itself to ensure that the user does not abuse this ability. For example, in each map it is possible to ~possess~ a maximum of three people at a time, furthermore this operation cannot always take place, thanks also to the presence of a timer that warns the player when there is the possibility of acting to enslave someone . On the other hand, the situation is different when the consciousness of an individual is taken over and therefore controlled directly through the two analog sticks of the pad, therefore the second case mentioned in the previous paragraph. For the transferof oneself, or rather, of one's essence in the body of another being, just point at a person or a drone while wandering around the game setting in a sort of ethereal form, to start living in its ~shell~ , while the old one that represented the gamer until a moment before is managed by artificial intelligence. At this point it becomes possible to exploit its capabilities and characteristics to fight or perform a series of actions useful for continuing the adventure. For the rest Mindjack, as mentioned at the beginning, is not so different from other modern third-person shooters and consequently re-proposes all the technical clichs of the genre, such as the possibility of taking cover behind objects to take advantage of their cover and an arsenal of weapons to be the envy of a secret agent of the future (even if inexplicably at the beginning of each mission you are only equipped with only the default weapon and not all those recovered perhaps in the previous scenario), only that it does, as we will see later, wrongly. The progression of the levels is in watertight compartments, with well-defined areas and stages, complete with final statistics on the winning team in the event that some guests enter the game. Like all online shooters of recent years, there is an experience system, as the experience increases, new skills and upgrades are unlocked, such as the increase in speed between one conversion and another, the ability to make it more powerful with the possibility of hook multiple people in a single hack or even make the controlled character invisible for a few moments. Often, however, these improvements turn out to be useless for the purposes of the adventure since they add nothing concrete to certain mechanics. Bugs a go go What further differentiates this from other action and shooting titles are some negative aspects of the production, such as the character control system which here leaves something to be desired in terms of precision in coverage, poor fluidity of movements and other various amenities ranging from adversely affect gameplay. To be clear, if in games like Gears of War or in the more frantic Vanquish, hiding behind cover to fire on enemies or moving between scenarios to then find the right moment to place a nice straight shot on someone's head always happens in fluid, ~natural~ and well calibrated way, in the feelplus Inc. title everything is very cumbersome and imprecise due to robotic animations and programming errors. Furthermore, the artificial intelligence of the characters controlled by the CPU, allies or enemies, takes care of ruining a good part of the gaming experience, which often borders on stupidity and which therefore ends up making every possible tactical choice made by the user useless, or because it is done badly or because on balance it turns out to be useless, unnecessary. In fact, if the enemies do not run in circles for the area in which you are fighting at most, they hide behind a shelter and shoot, leaning out every now and then. Nothing more: no strategy, no logical movement, attempt to outflank or sensible assault. So why bother studying possible countermoves? And of what then? Things obviously improve when there are other human players during the adventure, as they move the characters. Other little guessed elements in Mindjack are certainly a combo system that is easy to execute with a single key but often useless, and the more or less random arrangement of checkpoints. The latter are often positioned in points far from certain locations, therefore effectively forcing the user to start long sessions from scratch when the two agents are killed in one of those areas. Having said a little above about the not excellent animations, we conclude the article by going into detail on those aspects related to graphics and audio. The graphics engine that moves everything that is visible in the adventure seems to have been borrowed from an old PlayStation 2 game and recycled for the occasion, full of those bugs and defects that it would be unthinkable to see today with the technology available. The visual defects are not wasted: from the repetitiveness of the scenarios to the poorly defined textures, from the characters that appear out of nowhere to strange and incredible polygonal overlays caused by the engine which should recognize and manage collisions and physics: it often happens that some NPCs fit into the scenario as has not been seen for some time. While for the sound we have an uninspired English dubbing and an equally annoying techno-themed soundtrack.", "date": "2011-02-11", "grade": "4.0"}