{"name": "Space Hack", "ref": "https://multiplayer.it/recensioni/space-hack.html", "text": "Engraving space The manual and the dialogues (written and spoken) are completely in Italian. The translations are good and certainly give plus points to the title. This, especially considering that even today in the vast majority of games (even at full price) you can find, when it suits us, the dialogues written in Italian and voice in English. Extraterrestrial take me away Starting a new game will instantly launch you into Maximus XV. The introduction will not fail to explain all the background of the setting, as well as to introduce the character you will then play. In fact, Space Hack himself will narrate from off-screen the events that have brought about the current state of things. After the introduction we will find ourselves in the last human stronghold, besieged by terrible alien creatures. You will begin your mission by talking to Patrick Van Horn - captain of the surviving biosphere - who, having recognized your fame, will charge you with carrying out the search for the ~Mother~ module for the good of all. From this was indeed sent a desperate call for help. It will therefore be your task to find a way to reach it and report the coordinates useful for the calibration of the teleporter to locate it. In fact, this seems to be the only way out for the surviving people to regain control of the spaceship and correct the course. To undertake this you will have to start by exterminating the creatures that are holding you prisoner, Space Hack will be called to eliminate all the aliens that surround you and clear the way to the other biosphere. Getting started can be quite difficult. You will be constantly forced to return to the safe zone to heal your wounds. After all, the weapons that you will initially have are rather poor. Yours will only be guns of little importance, but don't despair, having collected a few accumulators - the only exchange good for purchases - you will finally be able to buy weapons worthy of the name. Weapons exist for all tastes: clubs, bows, swords, axes and more, up to the most technological. To use the arsenal it will be enough, through the inventory, to apply them to the different areas of your body. Initially a weapon to strike from a distance may be fine, this is because fortunately the first enemies we will encounter will never carry out attacks from a distance and will give us the opportunity to kill them before the otherwise lethal melee. The combat mode is simple but effective. Forget the dynamics normally found in more complex CRPGs, Space Hack immediately betrays its piqued Action nature and can only recall the much-quoted ~Diablo~. Unlike what happened in the latter however, and similarly to titles such as Dungeon Siege and the more recent Sacred, it is not enough to select the target once to start an attack that is renewed automatically, in fact you will have to continue to ~click~ to inflict blows . The title focuses heavily on fighting, and level advancements will be granted to you with the accumulation of the usual experience points, which can be accumulated by killing the monstrous aliens. By checking your character sheet you can check how many experience points you are missing to increase your skill. Each new level acquired will bring you five progress points that can be divided between: strength, dexterity, knowledge and resistance. Strength will allow you to deliver more powerful blows to your enemies in close combat. Dexterity will enhance your ranged weapon skills. Knowledge will give you the opportunity to increase your skill in using ever more lethal and technological weapons. Stamina, as you can guess, affects your total hit points and the ability to run longer without resting. You will have to complete many missions within the game passing through the countless environments present on the spaceship. Unfortunately, however, monotony will soon begin to dominate, above all by virtue of a little varied bestiary and a one-way game action to say the least. Each level always resolves in the classic: ~find the way out~ and little else. Absent any investigative quest or, in any case, requiring even a minimum of cerebral matter. As usual, the background music is influenced by the situation in which you find yourself. While the sound effects can get a bit repetitive, the voice acting of the game's actors is certainly well done. Undoubtedly the Italian translation and tests were carried out thoroughly and with care. Extraterrestrial I thought about it again... The story is very good and compelling with an ending, as usual, unexpected. You will come withinvolved in the plot, reconstructing it thanks to the excellent distribution of information during the game. We may have some regrets about the graphics and the game mode. The characters have some ~angularity~ that today's games are almost eliminating completely, however the strong use of pastel colors in the context of the game textures give the title a ~cartoony~ aspect, which manages to revive the aesthetic aspect of Space Hacks. The technical limitations of the graphics engine certainly derive from the fact that the title was released in Italy almost two years after its creation, and it shows... On the other hand, even the hardware needed to enjoy the game to the fullest is not demanding : all you need is a one GHz processor and an old Direct X 8.1 compatible graphics card. The view reminds us of the old isometric masterpieces of the past (someone said Baldur's Gate?), However the use of a totally 3D engine allows us to rotate the field of view at will ... too bad, however, we cannot change the zoom level. Especially at the beginning you might find iterating with the visualization awkward. In fact, to rotate the perspective you have to use the mouse wheel or, alternatively for those who don't have one, the ~,~ and ~.~ keys. By improving the graphics, the management of the actions, and not forgetting even a little more game variety, we will have found ourselves faced with a certainly more deserving title Extraterrestrial I thought about it again... For better management, for example, the technique used by BioWare in titles such as Neverwinter Night could have been implemented, where the visual angle changes following the mouse pointer: at the ends of the screen the view rotates. All character information is well integrated into the game interface. Each function can be recalled quickly using the shortcut keys. Good implementation adapted for map consultation; in fact, this will appear full screen in transparency to the normal graphics. You will be shown your position and, by means of an arrow, the direction in which you are ~looking~. It would have taken very little to improve Space Hack. By improving the graphics, the management of the actions, and not forgetting even a little more game variety, we will have found ourselves faced with a certainly more deserving title. We therefore trust in the next release of Rebelmind: ~Frater~. The developers have in fact announced that they will use an enhanced version of the graphics engine used by Space Hack. If that gives us that much, it will be a good title. Comment Given the sale price, one could have expected even less, that's for sure. Despite this, Space Hack's flaws are many and such that I would recommend the game only to avid lovers of the genre, or to those looking for low-cost games. Too bad because from the point of view of characterization and plot the title is undoubtedly well done, even if we are talking about an Action RPG, but this is not enough to support such a flat and monotonous game. Pros: Engaging in terms of setting Impeccable Italian translation Price ( 19.90) Undemanding system requirements Cons: Outdated graphics Difficult and limited iteration with the view Repetitiveness of sound effects in combat Monotonous game action You are imprisoned. Away from home. Your existence is marked. The destination is the prison. A spaceship is what you call home. Biospheres make up the rooms. The spaceship Maximus XV proceeds towards its destination, but something goes wrong, a black hole engulfs you. If that weren't enough, during this transition into the nebula, horrible alien creatures attack you. Obviously the aliens are very hostile. The fighting leads the remaining humans to lock themselves in the last biosphere, and to put up an strenuous resistance. Only you, Space Hack, can lead to victory over the aliens! Eh, never a moment of rest for us gamers...", "date": "2005-04-28", "grade": null}