{"name": "Beato quel dungeon che ha bisogno di eroi", "ref": "https://multiplayer.it/recensioni/84921-dungeons-beato-quel-dungeon-che-ha-bisogno-di-eroi.html", "text": "There are many who consider Dungeons by Kalypso Media as the spiritual sequel to Dungeon Keeper by Peter Molyneux and associates (we talk about it in a separate box). The reason is very simple: the concept is exactly the same. Also in Dungeons the player is called upon to impersonate an evil lord who must manage an editorial board specialized in video games and try to accumulate as many Ferraris as possible, adulterating the votes without letting the reader understand anything. No, wait, we played the wrong game. In this the lord of evil remains, but he has to manage dungeons in order to attract heroes in packs and kill as many as possible. Obviously there are heroes and heroes, and while the weaker ones pose no threat and can be exterminated by the simplest traps, the more skilled and higher-level ones will be cooked with an ever more terrifying and imposing array of monsters and means. If all the heroes were not eliminated, they would reach the heart of the dungeon and tear it apart, forcing us to pack up and move to Antigua, where there seems to be a resort for retired evil lords. In reality, Dungeons also has a kind of plot: to regain enough strength to match Calypso, the ex-girlfriend of the new villain who chased him away by keeping all the presents and demanding a rich maintenance check in fragments of a broken heart ( then you say that one doesn't feel like destroying the world). Are the cursed fortune-seeking heroes his allies? Something is rotten in Denmark. Between saying and doing The first game session opens with the most classic of tutorials. In a few minutes we are shown the basics and some advanced concepts to take into account in order to be able to keep the levels under control. We are in a preliminary phase, but the dominant impression is the one that will prove to be predominant for the rest of the gaming experience: Dungeons looks like a tower defense crossed with a real-time strategy crossed with an action rpg (the lord of evil controls himself in first person). Entering the game, after taking a quick look at the dungeon, the first thing to do is convert some pentacles. They are mainly used to increase the goblin manpower, but also to increase the area of influence of our kingdom. The cute little green creatures do all the work it takes to run a dark and dangerous place like this: from building new infrastructure to maintaining damaged ones. Each dungeon allows you to summon a maximum number of goblins. Once the preliminary operations have been completed, valid for each map played at any level of difficulty (without slave and poorly paid workers you are not competitive on the market, sorry) you need to work hard to make the dungeon attractive for the heroes. In what sense? Time to explain how Dungeons really works. Dungeon Keeper Dungeon Keeper (Bullfrog, 1997) was born from an original assumption: what if instead of being the heroes who free the world from evil after having crossed dangerous dungeons, we were the villains who must prevent the heroes from doing their duty by designing traps and training increasingly terrifying monsters? The result was an over the top management game, very fun to play and which finally gave an account of the difficulties that the lords of evil had to face to put together their reigns of terror. In addition to the official sequel, from that idea we can also derive the two Overlords by Codemasters who, despite the gender differences, share the basic concept of Dungeon Keeper (putting the player on the side of the bad guys). In short, it seems that being on the side of the wicked can sometimes be fun. Killing is not enough Killing heroes can be fun, but doing it too soon is counterproductive. The aim of the game is not simply to carry out indiscriminate slaughter, but to reap spiritual energy from the inert bodies of the victims. Unfortunately, a hero who has just entered a dungeon does not have much spiritual energy. To make it grow you need to place ~attractions~ around the map with which to entertain it and grow its ego. A hero engaged in a difficult but not impossible task is a hero whose spirit grows; the evil lord really needs spirited heroes to return in strength. When the good guys enter the dungeon, they roam it looking for things to do. It is essential to know how to dose the dangers in order to get the most out of every dude, spiritually speaking. There are two ways to extract energy: weapons, the most used, and prisons, where torture allows you to squeeze every last drop of spirit from any body (great to use with well-fed heroes).In addition to the heroes, the player will have to face other dangers represented by special enemies, underlined by the story, and by side quests. These are interesting diversions compared to the basic gameplay, which otherwise ran the risk of becoming repetitive after a few hours of play. They also make the action more dynamic and often force us to carefully dose the use of the resources at our disposal, forcing us to evaluate the risks of facing one danger rather than another. Resources and skills In addition to spirit energy, the good evillord has to worry about two other resources: prestige and gold. Prestige is gained by building attractions (spending spirit energy) and giving the dungeon a more evil aura, but also by filling it with riches. Here comes gold, which is obtained by killing heroes. As you can well assume, gold is used to buy some specific attractions that tickle the main motive of any self-respecting hero: greed. The dungeon lord's recovery of strength is emphasized by skill growth, which is manifested by allowing the player to allocate the points earned on three tree diagrams concerning combat , construction and efficiency, and by the growth of characteristics ( strength, agility, intelligence, and toughness) that enhance his combat prowess. Basically, we found the tactic of making clear choices better than trying to improve in all areas. Having a well-defined strength is better than being able to do everything without excelling at anything. Even in demo! Anyone wishing to try the game before deciding should know that an English-language demo is available. The address to download it to is this. Dirty bricks Technically speaking, Dungeons is just mediocre. The atmosphere that is expected of a dungeon is there, but by observing the different elements that make it up in detail, one notices a general poverty that is a bit annoying. Also considering the fact that the developers have chosen a light-hearted style to represent the setting and the characters, the sloppiness of the textures and the lack of a strong characterization of the objects (attractions included), which stand out for their genericity and anonymity, are incomprehensible . The same can be said from an audio point of view: sound effects and music serve as accompaniment and nothing more. Dungeons simply does not affect from a technical point of view, an aspect that could be summed up in one word: functional. Less functional is the management of the camera, problematic in changing shots and, especially during the first hours of the game, a source of some confusion.", "date": "2011-02-10", "grade": "8.0"}