{"name": "Sora incontra Matrix", "ref": "https://multiplayer.it/recensioni/85053-kingdom-hearts-recoded-sora-incontra-matrix.html", "text": "Originally released for mobile phone in episodic form, Kingdom Hearts Coded had certainly not had the claim to establish itself on the videogame landscape as a significant series for the successful franchise created by Tetsuya Nomura, therefore this conversion for Nintendo DS, graced by an updated technical sector and the new title Kingdom Hearts re: Coded, is already perplexing from the start, especially by virtue of the numerous spin-offs that Square Enix has given birth to in recent years. If we also add the usual ~Final Mix~ editions for each episode, although generally limited to the Japanese market only, it is clear that at the moment the franchise is the main dairy cow of the famous Japanese software house which gave birth to Final Fantasy. With Kingdom Hearts re: Coded, in a certain sense, we touch rock bottom and even begin to dig a little and after about fifteen hours of play the only question that arises is: was it really needed? Follow the data-Rabbit And in the complicated idea that Nomura has made of the whole saga, yes, indeed there was a need, because Kingdom Hearts re: Coded answers the question that fans have been asking since the conclusion of Kingdom Hearts 2: it was 2006 and everyone was wondering what the hell was written in Mickey's mysterious letter, the content of which was theoretically the starting point for that Kingdom Hearts III which should give an epilogue to the saga and which everyone is waiting for but which never arrives. In short, the puzzle has become increasingly complicated and in a certain sense the entire franchise has somewhat lost its way, passing from the carefree fantasy of the Disney worlds to secret organizations, science fiction technologies and would-be Darth Vaders. It is a pity, therefore, that one of the most important pieces is bound to the final moments of a terribly confused and insipid story like the one told in Kingdom Hearts re:Coded, in which the very low quality of the dialogues makes yet another heavy peregrination of the Disney worlds that by now we know to exhaustion: Wonderland, Agrabah, the arena of Hercules and so on. Kingdom Hearts re: Coded is in fact a sort of reinterpretation of the first adventure of Sora and his companions but although the context is rather original, the magic of that first adventure is extinguished due to the predictable outcome and the influence of sci terms and situations -fi that look like something out of the Wachowski brothers trilogy. Jiminy Cricket's Grillario hides a real mystery, so King Mickey decides to rely on Chip and Dale's technology to create a digital Sora who can explore the virtual worlds of the diary and find out what's going on. Confused? Well, as we said a few lines ago, when the end credits scroll, only the aforementioned letter remains and the rest of the story is definitely to be forgotten. Collage of genres The evolution of the adventure is therefore based on the ~rereading~ of the Grillario, which starts again from the Destiny Islands and continues passing through the Middle City, some Disney worlds and some important areas that are now part of the mythology of the franchise more than the Disney worlds themselves. In reality, each world has been downsized a lot and is now made up of a handful of rooms and one or more absolutely anonymous ~virtual~ areas. Exploration is based on typical Kingdom Hearts gameplay; the player directly controls Sora and occasionally interacts with some secondary characters, fighting the various enemies in real time using combinations of melee shots, special attacks and various spells. The battle-system is now based on a growth system that is initially a bit confusing but then quite intriguing, which allows us to decently customize our ~data-Sora~ both in terms of statistics and in terms of arsenal of skills and attacks. mainly Kingdom Hearts re:Coded, and which all in all makes it a more than pleasant foray, is the variety of playstyles that Square has managed to squeeze into the cartridge. Each world, in fact, offers one or more game sections that are absolutely peculiar and distant from the classic gameplay of Kingdom Hearts. There are moments where the game becomes a real JRPG with turn-based combat, there are side-scrolling platforming sections and rail-based shooter-like battles. There is no shortage of variety, unfortunately, however, these sequences are perhaps too dilated in time and excessively long individually. However, it is a rather apt choice which makes the adventure less repetitive and keeps the player's interest sufficiently high. Ups and downs From a technical point of view, Kingdom Hearts re: Coded behaves without infamy or praise, proposing a better three-dimensional engineiorated compared to the one already seen in Kingdom Hearts: 358/2 Days. The polygonal models are more accurate and much better animated, in general the visual rendering is defined and detailed, certainly a step forward compared to the previous spin-off for Nintendo DS. The previous identity of mobile software emerges during conversations between static images of the characters and pure comic-style balloons, which clash terribly with the less frequent, but decidedly more beautiful, fully dubbed cutscenes (in English, but subtitled in Italian). The main problem of Kingdom Hearts re: Coded all in all lies in the terrifying management of the camera: not only is operating it manually a real drama, but the automatic movement makes the numerous platform situations that are still imposed on us by the game-design absolutely frustrating. Sora often has to jump from platform to platform, hopping on moving or retractable blocks, which isn't exactly easy with the game's camera, although it's possible to automatically jump from one point to another, not to mention when engaging in battle and you find yourself surrounded by enemies without being able to look around in a more natural and intuitive way. A step forward and a step back, therefore, and it's a shame because from a technical point of view this latest incarnation of Kingdom Hearts for Nintendo DS had really convinced us.", "date": "2011-02-10", "grade": "6.5"}