{"name": "Heavenly Bodies", "ref": "https://multiplayer.it/recensioni/heavenly-bodies-recensione.html", "text": "Space has long been one of the favorite places of writers, artists, screenwriters and, more generally, of those who love to dream of the unknown and great adventures. The Universe that envelops our Earth is home to wonders and horrors beyond our imagination. It promises star travel, black holes, alien races and unthinkable technologies. Sometimes, however, traveling in space comes with some problems, such as lack of gravity. Moving even just a few meters is a big undertaking when there is no mass to attract you: Heavenly Bodies is about this. Erase from your mind the spaceships of Mass Effect, the adventures of Star Trek or the political and military intrigues of Dune. Heavenly Bodies offers us the true Space within man's reach, the one immediately outside our atmosphere. Is that enough to entertain us? The answer is in our Heavenly Bodies review. The other lever The two Heavenly Bodies astronauts in a space station As already mentioned in our introduction, Heavenly Bodies is a new space adventure, but one that does not try to propose colorful alien races or pseudo-scientific big words that justify space jumps from one part of the galaxy to another. The work of 2pt Interactive takes us to the 70s and puts us in the shoes of a cosmonaut (or two, if you play in coop) who must move in narrow spaces, drag objects, press buttons and connect cables. In fact, when we are launched into space, we arrive at a run-down space station and are given the task of fixing it up. Each level (7 in total) offers a completely new area, but there is still a narrative thread that connects our extraterrestrial exploration and leads us fluidly to the conclusion. The focus of Heavenly Bodies isn't the plot, of course, but the control system. The lack of gravity is a very serious problem and moving around is not easy. Using the triggers of the controller (the keyboard is strongly discouraged) we will have to grab objects and surfaces to be able to launch ourselves from one part of the space station to another, perhaps using our legs to give us some push, like springs bouncing off the walls. It's easier said than done, but the challenge is precisely this: mastering the movements of the character, who will struggle even to pull a lever to open a hatch. Heavenly Bodies is a physics-based adventure, where it's easy to figure out what to do, but it's more complex to do it right, quickly and without banging your head against every wall. Speed isn't really a big concern, except for a few minor challenges. Each level, after being completed once, will in fact reveal additional missions such as the search for a collectible - often hidden in an awkward place to reach -, the execution of some particular secondary tasks, the completion of the level within certain times and with the selected maximum difficulty. Control system The Heavenly Bodies astronaut grabs hold of a space antenna The difficulty level of Heavenly Bodies is actually a selection of the control system. The most complex is the ~Newtonian~, i.e. more ~physically accurate~ one. The main difference is related to the fact that, compared to the lower levels, any ability of the astronaut to move without the help of objects and surfaces is almost completely eliminated. On Classic difficulty it is possible to make our character turn on himself simply by waving his hands clockwise and counterclockwise. In addition, it is possible to ~swim~ in a vacuum by moving the arms in a breaststroke style. Both of these movements, however, cannot perfectly counteract a wrong movement or a too strong push in a certain direction. We believe it is the best choice to play, at least at the beginning, since it forces you to pay attention and take advantage of every handhold within reach to perform the right movements, while always allowing some room for maneuver to correct a mistake. Finally, we have the Assisted mode which basically allows you to point your arms in one direction and move towards it automatically. It is important that it is included, especially in terms of accessibility for those with mobility impairments, but we do not recommend it for the average player as it eliminates what is the core of the game. An explosion pushes the astronauts out of the Heavenly Bodies space station Regardless of the level of difficulty, the control system works well enough. At any moment we can recalibrate the camera so that the ~up~ is where our head is pointing. If you want a point of comparison in terms of control difficulty, think of games like Snake Pass or the more recent Struggling: your fingers canThey'd twist just as well, but in Heavenly Bodies - unlike the examples - getting a move wrong is an integral part of game design and you're never really punished. There's a sort of game over if you launch into deep space when you're off a ship, but checkpoints save upon completing each intra-mission task, so there's no risk of wasting time or progress. Speaking of time, on Classic difficulty we completed the seven levels in about 4 and a half hours. That's not much, but we ignored most of the side challenges, and a second game of Newtonian mode basically doubles your longevity. Galactic tasks Heavenly Bodies astronaut explores space with a spacecraft The quality of a game is obviously not directly proportional to the number of hours on the counter. What matters is that every minute is intense and that there is no shortage of variety. Heavenly Bodies is certainly not the fastest paced game available on the market, it must be said, as it can take several minutes just to exit a room and move a couple of objects: the least patient and those who don't like having to work hard to play seemingly simple tasks may be bothered by the experience after a while. Those who, on the other hand, like to be put to the test with an alternative control system that is not interested in the comfort zone in which we live, will find various types of tasks waiting for them, together with the level and type of equipment they will have to deal with. Sometimes we'll have to move indoors and interact with some buttons and cables, other times we'll be in a large region full of asteroids to be explored using a small spacecraft. On other occasions we will have to control robotic arms to interact with complex appliances, or we will have to use a plunger to well, you'll find out. But we can tell you that Heavenly Bodies kept us glued to the screen every minute and when we finished the adventure, we had a big satisfied smile on our faces.", "date": "2021-12-06", "grade": "8.0"}