{"name": "Il piacere di impennare con liPhone", "ref": "https://multiplayer.it/recensioni/84503-mad-skills-motocross-il-piacere-di-impennare-con-liphone.html", "text": "Dirty, tired and even a little battered: motocross riders, at the end of their race, really show a pitiful aesthetic aspect. And yet, it is enough to look closely into their eyes to see reflected that light of personal satisfaction and satisfaction, typical of those who love the work they do. Jumps, tricks and acrobatics performed on sprung cross bikes in fact represent one of the most spectacular sides of motorcycling, beautiful to look at but at the same time difficult (and rewarding) to perform. There have been many attempts to reproduce this golden and dusty universe in a playful video key, more or less successful; Mad Skills Motocross represents a new experiment on the iOS platform even if, as the most savvy fans will remember, the Turborilla title is already present (in an unmemorable version) on the PC platform. All mud physics Mad Skills Motocross is therefore an arcade racing title with a side-scrolling view, whose fulcrum of fun is based on the management of the physics of the bike and rider. In fact, the simple game interface allows you to control the indispensable parameters of the vehicle: two virtual buttons are assigned to the accelerator and brake, while the other two are responsible for distributing the weight of the pilot during jumps and stunts. Other contextual keys can be activated to use the power ups available from time to time, some very useful (such as the turbo) others a little less (such as the small jump from a standstill); the management of the rider's balance can also be delegated to the use of the accelerometer, according to pure personal taste. However, the size and sensitivity of the game keys represent the first and perhaps only real criticality of the game: very small, the buttons are quite uncomfortable when used by ~important~ hands and to make matters worse the reactivity does not seem to be at the top. For the rest, Mad Skills Motocross is really fun to play: the jolts caused by the various bumps, bumps, accelerations and steep platforms are rendered credibly by the effective physics engine, despite the fact that inevitably all the movements appear decidedly exaggerated. Even if the ultimate goal obviously remains to win the races faced from time to time, some secondary objectives linked to the execution of particular stunts add some ~pepper~ in a pleasant way to a recipe otherwise destined to tire after a short time; usually, before tackling a race, the particular trick necessary to perform to obtain the maximum score will be explained, also giving the possibility to try it in free mode. The execution of the stunts depends on the timing in pressing the buttons that move the pilot's body and, due to the aforementioned control problems, there will be disastrous falls. The game modes available, only two (career and time trial), still guarantee fun thanks to the presence of a large number of races, over 50, of increasing difficulty; the matches are always played against an opponent controlled by the CPU (without the possibility of multiplayer), but through Open Feint it is possible to share one's ~ghosts~ to be faced by friends. Technically speaking, the title offers a good overview, although the small size of the bikes (and of the riders) allow detail to be sacrificed in favor of fluidity, which in fact is truly excellent. A few notes could be raised regarding the animations of the falls, almost in the ~Pinocchio~ style for how the pilot finds himself at the end of the tumbles but, considering the arcade / goliardic context of the game, at most this bizarre feature could make one smile more . Two interesting curiosities remain to be pointed out: the first concerns the complete integration with social networks, both Facebook and Twitter, through which the opportunity is given to share times and results (the only pity is the non-compatibility with Game Center) while the second is inherent in a very recent update released by the developers which, in addition to the usual bugfixes, has substantially reduced the difficulty of some races, evidently considered too demanding for the imagined standard of buyers. The tested version is 1.3 Price: 1.59 App Store links", "date": "2011-01-28", "grade": "7.0"}