{"name": "Un platform esplosivo?", "ref": "https://multiplayer.it/recensioni/84229-maxplosion-un-platform-esplosivo.html", "text": "Generally, video games sold on the App Store become famous when millions of people buy them, see for example the disruptive success of Angry Birds. MaXplosion instead rose to the headlines even before its release, due to a possible plagiarism against 'Splosion Man, a title developed by Twisted Pixel and available on the Xbox Live Arcade platform. Looking at the two games in motion, the similarity is actually too marked to be considered random: both characters have the ability to ~explode~, in this specific case to do it three times in a row, to jump on platforms or to eliminate their own enemies. Even the ways of ~bouncing~ against the walls are the same, as well as most of the traps that the scenarios are full of. If we add to this that the Twisted Pixel guys had presented their project to Capcom (albeit to a different division from the one that deals with games for Apple devices) when they were looking for a publisher, the conclusions we can draw are quite disheartening. In the hope that in any case this story can ~do good~ for both parties (a little publicity never hurts, after all), let's try to understand what exactly MaXplosion offers us. Boom shakalaka As a little red devil, our goal in each of the twenty stages available is to find the exit. We can complete the levels in more or less long times, as well as dedicate ourselves to the search for all the collectibles, which should in some way stimulate the replayability of the Capcom title. Our character does not have an upgrade system: his abilities always remain the same, that is, he can emit three explosions in a row, useful both for jumping on platforms and for eliminating any enemies. If performed near a wall, the explosion also allows us to ~bounce~ and thus reach otherwise unthinkable heights. Similarly, there are devices that must be activated with an explosion and very quickly project us a great distance. The first stages turn out to be quite simple, but continuing you will come across an ever-increasing number of traps and pitfalls: watchtowers, ice sheets that disintegrate if we explode close to them, mobile platforms, pits full of spikes, and so on. Soon finding the exit of a stage involves a near-complete exploration of it and a certain amount of backtracking, especially if a switch placed at one end of the stage proves essential to open a door at the opposite end. These are not always very happy situations, in particular due to a control system that does not work as it should. Instead of implementing the more classic virtual stick to move and manage the character, in fact, the developers thought (wrongly) of using a sort of horizontal slide that can be activated to move left or right at different speeds, while a virtual button on the right of the touch screen he is responsible for the explosion. Well, this type of solution turns out to be cumbersome and not very precise, heavily undermining the playability of MaXplosion. Above all, the lack of any options screen that gives the possibility, as happens in many other games for iPhone and iPod Touch, to opt for a different configuration of the controls is surprising. It's really a shame because, beyond a nice but too repetitive musical accompaniment, this platformer boasts a really stylish graphic sector, with an excellent character design that only sometimes has to deal with generally anonymous scenarios. The tested version is 1.0.0 Price: 0.79 App Store links", "date": "2011-01-25", "grade": "6.0"}