{"name": "Recensione : Jade Empire", "ref": "https://multiplayer.it/recensioni/recensione-jade-empire.html", "text": "Shoot'em up what a passion To move our alter ego and the rest of the crew from one place to another in the Jade Empire it will be necessary to arm yourself with the precious maps of the winds and, obviously, with an aircraft capable of flying and at the same time giving battle to all the bad guys that will hinder our journey. Could Bioware just show the movement thanks to the animation of an arrow on the map? Of course not, and therefore Jade Empire turns into a vertical scrolling shoot'em up, complete with power ups and enemies in every corner. The player will also be able to replay the open stages whenever he wants, as well as be free to skip these sessions within the game. Knights of JadeEmpire The success achieved with Star Wars: Knights of the Old Republic Bioware deservedly earned it also by setting up a credible plot completely in line with the LucasArts epic. In any case, it must not have been easy to remain within the rigid schemes dictated by the world of Star Wars and, despite this, to create an engaging plot. In this Jade Empire the problem did not logically arise, and the Canadian softco was able to explore every meander of oriental mythology, giving free rein to all those incipits that have always distinguished it. After selecting the character from among those available, we will discover, in fact, that our alter ego is a sort of chosen one for the protection of the world, the last of an important lineage of monks. Obviously, in the initial bars, we don't know the reasons for this reverence towards us, nor the arduous task that weighs on our rump. The narrative plot soon proves to be well thought out, albeit without excessive peaks of originality, just as it becomes clear how much the work done in terms of storyline is at the service of morality, which as a Bioware trademark also features in this title . In fact, there will be countless opportunities to demonstrate that one is good, and therefore followers of the path of the Open Hand, or bad and adept of the Closed Fist. The interaction with the numerous NPCs will be the fulcrum of the game, or rather of that portion of the game aimed at building the character with which to wander around the Jade Empire. The numerous lines of text will lead to properly developed dialogues, to which the player will have to associate the answers he finds most congenial. Those who play have the right first of all to choose whether or not to listen to the story of those in front of them, an option that will make the avid skip fans happy, only to lose a good portion of side quests. In fact, by talking to the NPCs, main and secondary missions will be activated, which in addition to giving material rewards will have an impact on the morality of one's alter ego and, consequently, on his relationship with the characters encountered. Helping a merchant, for example, can lead the latter to give us discounts on the goods sold, or following one moral path rather than another can convince a martial arts master to teach us his style. The same actions have a precise weight on the continuation of the game, always staying on the good / evil mechanism so dear to Bioware. Too bad only for a certain immobility on the part of the coders, who have done little to innovate the concept of morality already widely savored in KotOR. Deadly dances Exploring the world of Jade Empire means, first of all, being ready to fight at any moment. In this sense, pleasantly of course, the choice made by the developers to prefer combat totally in real time rather than confirming the hybrid one seen in KotOR is surprising. With good reason, one might add, given that we are talking about lethal martial arts here. Pad in hand makes you want to offer a coffee, or maybe even a beer, to all the employees of a Bioware capable of creating a combat system that is as choreographic as it is beautiful to play. In fact, like dances, the duels will be imbued with harmony and style, also thanks to the splendid animations with which the participants are delighted. Balanced and complementary, the fighting styles soon become the cornerstone of the development of one's alter ego. We will be able to slow down the enemy with a support style and then strike him with a feral sword blow, or perhaps petrify him with a powerful spell after draining him of all the Ki he possesses. Often changing technique is not only optional, but necessary, given that most of the enemies manage to immunize at least one style. It all revolves around knowing the style used and knowing how to use energy points, Ki points (magic) and concentration points properly. The latter, necessary to use a weapon or to drastically slow down time, are well takenas necessary as Ki and vital energy precisely to get out of the most agitated situations, or, more simply, to alternate styles in order not to consume all the points of one or the other. There are numerous combinations, to which is added the possibility of transforming into some of the enemies encountered, and each player can shake everything up in order to create a single, personalized style. Pad in hand makes you want to offer a coffee, or maybe even a beer, to all the employees of a Bioware capable of creating a combat system that is as choreographic as it is beautiful to play. Deadly dances A note of merit also for the graphic sector set up by Bioware, which has succeeded in the arduous undertaking of reproducing, while preserving its credibility and charm, that bit of an oriental world linked to myths and legends. Some locations literally take your breath away as they are so beautiful, poetic and fascinating. The lighting, as well as the skilful use of colors, in this sense contributes heavily in giving the game scenarios worthy of a postcard. The polygonal constructions of the settings and characters are good, as are the textures applied to them. Just a pity for some too much uncertainty of the graphics engine and for a camera that is not always reliable. On the other hand, the translation into Italian is well made, even if only textual. Soundtrack without infamy and without praise, a pity if you consider the inspired setting like that of Jade Empire. Comment Jade Empire is, above all, a huge declaration of love towards oriental culture. Difficult, if not impossible, not to be enchanted by certain landscapes, certain stories and certain fights proposed by Bioware. Something more was expected from that morality so dear to the Canadian softco, which instead limited itself to largely reproducing the one seen in KotOR. It works well, for heaven's sake, but a little step forward certainly wouldn't have disappointed us. It is also true that the bulk of the work, speaking in terms of innovation, was done on a damned fun, as deep and varied combat system. A few too many technical gaps scratch, if only on the surface, a title capable of seducing anyone. Recommended to all Bioware fans, lovers of Rpg made with care and wealth, martial arts and, more generally, fun and exciting games. Pros: Cured plot, as well as the NPCs within it. Deep and fun fights. Technically of excellent workmanship ... Cons: ... albeit with some unfortunate shortcomings. Zero innovation in the field of morality. Uninspired soundtrack. Me as Bruce Lee The creation of your own character goes through some fundamental steps. First of all you have to decide the type of warrior you want to create among some stereotypes present, then you move on to the phase of assigning points, which occurs again at each level up. It will be necessary to assign points by choosing what to increase between physical energy, concentration and Ki, then we move on to assigning points by style. Logically here the choices are more difficult since the more numerous voices present, but once you have found the preferred techniques, every choice becomes less painful. To take the place that generally belongs to the equipment in this genre of games are gems capable of increasing the character's statistics, here too the choice must be careful and reflect the type of fighter you want to be. The Official Guide! The activity of publishing official Multiplayer.it guides continues with that of Jade Empire! All the tricks and secrets of this fantastic new Bioware epic in 160 color pages for 14.90, which can be purchased in all video game stores and also at our Shopping. Dreaming of being a rock star is sometimes harmful. You find yourself there, sitting on your trusty sofa, imagining yourself dressed only in a pair of leather trousers and a black gilet, riding a limousine, obviously overcrowded with beautiful and audacious girls, which will ferry you to the most glamorous of events. So far, so good. The problem arises at the very moment in which your daydream prompts you, like any self-respecting rock star, to throw yourself into the midst of the exalted crowd, only to wake up abruptly with a big face well printed on the floor of the house. On the other hand, there are those who, in addition to making them, manage to make them come true. This is exactly the case of the emblazoned Canadian softco Bioware, which, after having enchanted role players from all over the world for years, has decided to realize a dream kept in the drawer for years: an RPG set in the East, with fights based on martial arts and warriors with lightning moves, all seasoned with myths and legends typical of the cultureOriental. Luck has it that the creators of many masterpieces, Baldur's Gate and Neverwinter Nights above all, have finally found the necessary resources to finalize this important project: Jade Empire. After the successful debut on Xbox with Star Wars: Knights of the Old Republic, Bioware dives back on the Microsoft console in an attempt to repeat the success of its debut.", "date": "2005-04-26", "grade": null}