{"name": "Un regno in miniatura", "ref": "https://multiplayer.it/recensioni/83937-aralon-sword-and-shadow-hd-un-regno-in-miniatura.html", "text": "That smartphones and mobile devices are only suitable for casual games and quick pastimes seems to have become commonplace, both among those who own an iPhone and download new applications every day, and among those who judge despite not having direct experience. Yet titles like N.O.V.A. 2, Real Racing 2 and Chaos Rings have been able to demonstrate that more complex, full-bodied, deep and, of course, hardcore productions are not only possible on the iPhone and iPod Touch, but can also prove to live up to the most optimistic expectations. So, after warming up with the more than decent Ravensword and Rimelands, the Crescent Moon clique of Californian nerds is back on the App Store together with the developer duo behind the Galoobeth Games label. The result is Aralon: Sword and Shadow, a new fantasy RPG that tries, obviously as far as possible, to compress a vast and deep world like that of Gothic and The Elder Scrolls into the tiny screen of a smartphone. The fact that the inspiring muses respond to the name of Oblivion, Morrowind and Dragon Age suggests the size and ambition of this project. A kingdom without borders Aralon was born with the intention of allowing players, anywhere and anytime, to access an immense world simply by slipping the iPhone out of their pocket. The team's dedication from this point of view has led to results that are now there for all to see: the game offers a vast kingdom, divided into several large areas full of outposts, cities and dungeons, while the amount of quests and side missions takes away from 20 to 30 hours. As per tradition, at the start of the first adventure you are greeted by a rather classic and, to tell the truth, also quite bare character editor. Humans, elves and trolls are the three races available, not very customizable when you consider a handful of boxy hairstyles, a few alternative hair colors or a series of ugly faces. Things are a little better with the classes to choose from: Warrior, Rogue, Ranger and Mage differ quite well in their skills and characteristics, whereas, for example, the Rogue is able to hide and learn increasingly effective sneak attacks , while the Mage can soon summon a pet to join him. The Paladin class will also be introduced with one of the next updates, which bodes well for the pace at which Aralon will be updated over time. Each class has its own skill tree to grow as you level up and earn points, some of which will be introductory or have special requirements. All as usual, in short. The graphical interface deviates from that of Ravensword to embrace a more common choice in RPGs, with the skill grid at the bottom of the screen and character information at the top. However, the big problems affecting Aralon's playability are not due to its interface, nor to the combination of a tiny analog stick with a contextual action key: alas, the default camera is almost unusable, forcing every moment to move the character with a finger and rotate the shot with another. Fortunately, it is possible to set a fixed camera behind the protagonist, or a subjective one, although neither proves to be natural and comfortable enough. To further spoil the party there are two other big defects: the first is linked to the terrible collision system and the dull physics of the game, due to which we often find ourselves having to make long laps just to climb a microscopic step, when a few moments earlier you had safely climbed over an obstacle twice as high. The other trouble comes into play when you face an enemy, since, although a real-time combat system is sketched, the feeling is instead that of playing a turn-based RPG, in which your attack and that of the opponent alternate with a metronome rhythm; in this case, in addition to the simple boredom due to less dynamic clashes, the annoying targeting system also gets in the way. Let's be clear, Aralon has several positive aspects and some good ideas: there is, for example, no maximum level limit, although much weaker enemies stop giving experience points. The Crescent Moon game is like a stuffed turkey, and this is its main advantage: the developers have really tried to put everything in it, from the day / night cycle to the possibility of being wanted by the guards of a city. There are also mounts to buy or unlock thanks to side missions: one of these leads the player to search for an egg on an islandola inhabited by dragons, so that you can then gloat while flitting around the kingdom. However, quantity and quality are often elements that are difficult to reconcile, and Aralon is clear proof of this: the impression one gets is that of playing an incomplete and poorly finished title, which offers an avalanche of ideas, none of which, however, is explored as a good RPG deserves. The plot is rather trivial, never manages to reach peaks of epicness and presents a series of clichs and situations that will be all too familiar even to the freshest of Tolkienian followers. The dialogues between the characters, totally in English, are often devoid of bite and sometimes force you to go back to statements already said in order to activate a quest. Technically the title looks very good, at least overall, but it is still rather rough, and unfortunately stumbles into small defects and sporadic clipping problems. Not to mention the ubiquitous pop-in effect or a rising sun that peeks out of the ground like a daisy. Fortunately, the developers seem to be aware of the various flaws that Aralon suffers from, and since the last update they have corrected the senseless respawn times of the enemies. However, this is not enough to solve a game that sees one of the biggest problems in its lack of balance. As much as we can compliment Crescent Moon for having at least tried to offer a deeper experience full of game elements, the superficiality with which each element was created will displease not so much the younger players, but above all those who , having grown up with balanced, immersive and living worlds, cannot help but regret the nights spent between Ultima and Daggerfall, when growing one's character consistently did not mean only adding points to the statistics of a puppet with a sword. The tested version is 2.2 Price: 7.99 App Store links", "date": "2011-01-17", "grade": "6.6"}