{"name": "The Kids We Were", "ref": "https://multiplayer.it/recensioni/the-kids-we-were-recensione.html", "text": "Don't be misled by the vote you find at the bottom of our review of The Kids We Were, developed by Gagex, released on Nintendo Switch on December 2nd: despite the quality, it's not a game we recommend to everyone. Maybe, to tell the truth, it's not even a ~game~: however, we will continue to use this word for convenience. Also because there are few alternatives: The Kids We Were has nothing to do with ~cinematic experiences~, it is essentially a novel in the form of a video game, a video game in which the main activity is to move the protagonist from one point to another. 'other, talk to other characters, read the dialogues. An important detail to understand is that the player, in The Kids We Were, has very little ~narrative potential~; just like in a novel, the story can be read and lived, it doesn't influence itself. Almost every one of us, downloading The Kids We Were, will experience the same moments in the same order; the collection of some hidden objects is an exception, completely secondary. At an interactive level, the player's task is limited to moving the character, pressing a button to speak and collect coins/objects, consulting the menu, the map, and... that's it. What is there, however, isn't bad. The controls are precise and clean: The Kids We Were is much more coherent and courageous in indulging in its narrative vocation than many other titles that force playfulness in a superficial way, out of habit, even where it would not be necessary. The Kids We Were comes from the mobile world, where it was released just before the pandemic, in February 2020. The developers have adapted the experience to Nintendo Switch well, and it was not obvious, both for the different controls and - above all - for horizontal screen. Unfortunately the game is available, as well as in various oriental languages (Chinese, Korean, Japanese) only in English: for this reason, to enjoy The Kids We Were, it is essential to know the Bard's idiom quite well. Well, now that we've tried to scare you, that we've told you all the reasons why you might not like The Kids We Were, let's continue our review by telling you why, on the contrary, you might love it. Atmosphere and graphics The Kids We Were: Kagami Town, where most of the story takes place, at sunset Take 100 grams of Back to the Future, add a teaspoon of Haruki Murakami and some Ganbare Goemon spice, blend with Stranger Things and, at the end, season with Earthbound. The result will be The Kids We Were. Precisely because it is a mainly narrative experience, we warn you: in this paragraph we will talk about the title in general, introducing the plot in a summary way. In the next one, we will discuss it - without inserting major spoilers - in more detail; you want to avoid any kind of anticipation, you know what to do. The story begins when Minato, an eleven-year-old boy, takes the train to Kagami, a small village (where almost all of the adventure takes place) where his parents grew up. Minato accompanies his mother, who has to go to Kagami to attend a memorial service; with them is also Mirai, his younger sister, who is ill with leukemia. Neither Minato nor his mother are able to help her, they don't have a bone marrow compatible with hers; Minato's father abandoned them many years ago, but the child has discovered that until recently he was still living in Kagami, and intends to find him. Not to know him, but to save his little sister from certain death. The Kids We Were: the setting is proudly Japanese Minato is not like all other children, because he has paranormal powers; is able to predict the future. Not the distant one, but he perceives what will happen within a day, and is able, thanks to this power, to alter the harmful events that could happen. At the base of the experience there is also another sci-fi touch: Minato, through his future self, will be able to go back in time. To fix things, to avoid certain events, to get his family back on track. The game is set in 2020, but most of the adventure takes place thirty-three years earlier, in 1987: the nostalgic references of the period - as in Stranger Things - are many and powerful, but never forced. It is very nice to savor the architectural and costume differences between the Kagami of 1987 and that of 2020. Graphically, The Kids We Were relies on a voxel-based look; commonly said, ~three-dimensional~ (and cubic) pixels. The framing is not modifiable, and the characters are very simple, not very realistic (much less than objects, or houses), as well as the aanimations: visually it is powerful, pleasant and distinctive. The child protagonist with backpack and hat, in addition to the daily and city setting, added to the stylized appearance, make it comparable to Earthbound (and, mind you, it's a compliment). The music is beautiful, mainly melancholy, but also distressing and pressing at the right moment: unfortunately, although valuable, in our opinion there are few. unfolding The Kids We Were: the comet that passes every thirty-three years As we anticipated, from here on we will provide you with a few more details on the rest of the story: no central points, but so far we have only talked about the narrative context and the incipit, so we are forced to delve into the discussion a little. After all, story and game in this case are not the same thing, but they have many features in common. The adventure unfolds in chapters, each with its own theme, but not independent from the others. As already written, almost all the events take place in the heart of the small village of Kagami: between shops, spas, schools, swimming pools, cemeteries, temples. Minato has a notebook that should guide him in his adventure (in the past), delivered to him (in the present) by a Buddhist priest: the author is unknown, but it came to him at the behest of his father. The child can only stay in the past for three days, coinciding with the passage of a comet that passes over Kagami every thirty-three years: at the end of the 72 hours he will be forced to return to 2020, when he will find out if his actions have had a positive outcome in present. The Kids We Were: the protagonist Minato, with his four friends in the background In this notebook there are various notes of mysteries to be solved, which form the backbone of the experience: but more than the events in and of themselves, what makes The Kids We Were special are the dialogues, the friendships that Minato weaves with the kids of the 80s. Four children, in particular. Without going into further details, the main theme of the work is the relationship between parents and children, the frustration of children not to be heard, the rejection of violence, the desire not to become like their fathers (and mothers, too). The science fiction component of the story, as it should be in any good story, is only a pretext to deal better, and more ~mimetically~, with this main topic. The Kids We Were, towards the end, makes a very courageous choice, and ~tells~ it in a meta-narrative way: maybe some of you won't even see the real ending (and it will be your fault, because the opera will do everything possible to tempt you ). The conclusion is cathartic and moving, touching; he achieves this result delicately, without giving in to pathos. The Kids We Were: There's a lot of everyday life in this game, which is rare for a video game The bonus chapter added on Nintendo Switch is separated from the main story, and is a less successful appendix, in which the perfect balance falls apart, the time leaps are too frequent, the paradoxical plots too, the excessive melodramatic events. Proving how difficult it is to write a good story, and how special The Kids We Were is: one of the best indie games of the year.", "date": "2021-12-05", "grade": "9.0"}