{"name": "Si torna ad Adventuria", "ref": "https://multiplayer.it/recensioni/83533-drakensang-phileassons-secret-si-torna-ad-adventuria-di-nuovo.html", "text": "Although in recent years a lot of users have abandoned the PC to devote themselves to the new generation consoles, there are several genres that remain anchored to the oldest gaming platform currently in use. One of these is the role-playing game, thanks to a hard core of enthusiasts and a fair amount of difficulty in bringing it to consoles due to its innate complexity, and also the subject of a true rebirth in recent years thanks to sagas such as The Witcher or Dragon Age, but not free from some slips, however, as demonstrated by the recent Arcania. Still on the PC, we are also noticing an ever-increasing presence of budget-priced titles, perhaps developed by minor software houses which, not being able to count on the powerful means of large multinationals, prefer to devote themselves to the development of playability rather than the mere graphic aspect, focusing on reduced introductory prices and products which, while not proving to be masterpieces, maintain a remarkable quality/price ratio. One of the latest examples is the successful Divinity series, and, last but not least, the excellent Drakensang saga, set in the fantasy world of The Dark Eye, a well-known tabletop RPG and currently a good competitor to the excessive power of D&D - it will be the fault of the 4th edition of the latter? - of which we are going to analyze the latest incarnation. Tradition at any cost Drakensang: Phileasson's Secret is, as you may have already guessed, the latest expansion for the successful second chapter of the series, as well as a prequel to the first, and in common with all expansions it needs to own the original title in order to be played. As per tradition of the series, the first value is given by the low launch cost: the expansion alone costs 9.90 euros, and for those who don't have the original at hand, a collector's edition has recently been released, including all the three titles in the series plus a soundtrack for 20 euros, which, given the undoubted quality of the product, should be a must-buy for anyone who has ever played a role-playing game worthy of the name. As for the contents, Phileasson's Secret is closer to what could be a DLC rather than a real expansion: in fact, there will not be a new main adventure, nor new player characters to add to the River of Time party, but rather a pair of new secondary missions that will see the player confront one of the most important characters of the board game from which it is inspired, or the Thorwalian commander Phileasson, now busy solving some mysteries related to the fall of the elf city Tie'Shianna. In terms of the game we are talking about about ten hours, several new enemies, some of which are quite charismatic such as the cave giants or the cursed elves themselves with an openly drow style, and several unpublished objects and non-player characters. As per tradition, however, there remains the possibility of abandoning the quests at any time and perhaps returning later to complete them, thus leaving the free structure that has done so much for the success of the series unchanged. On the other hand, however, it should be noted that the new opponents will remain linked to the places of the expansion missions, without there being the possibility of meeting them in the other numerous quests. It is therefore established that Phileasson's Secret does not intend to make any distortion to the original gameplay, in fact keeping it unchanged compared to the already excellent second chapter: the speech remains the same with the graphic effects, such and such as what has already been seen previously, confirming between the another thing is the goodness of the graphics engine, capable of giving truly evocative glimpses and quite epic settings, while maintaining some doubts in the animations and in the models of the characters. Therefore, those who expect graphic or technical improvements, such as the success of the excellent Divinity II, are warned: Phileasson's Secret does not modify the original game, limiting itself to offering new intrigues and subterfuges, moreover well orchestrated and entirely dubbed in Italian, leaving the River of Time main storyline. For the record, it is necessary to point out that numerous crashes occurred on the test PC when starting the game, a defect which however does not seem to be repeated on other systems, but which in any case will require a corrective patch in the short term (although such crashes are rare and once the adventure has started they do not happen).", "date": "2011-01-13", "grade": "8.5"}