{"name": "I quattro dell'Ave Maria", "ref": "https://multiplayer.it/recensioni/83455-battlefield-bad-company-2-i-quattro-dellave-maria.html", "text": "In the first episode they had gotten into trouble because they were ~distracted~ by the discovery of a large number of gold bars on the battlefield. Will they have settled down in this sequel? The protagonists of the Battlefield: Bad Company series are back in a ~reduced version~ and are preparing to face truly formidable opponents, in one of the most competitive scenarios in the world: the App Store. The evolution of the first person shooter genre for iPhone and iPod Touch has in fact led to the birth of high quality products, above all the recent Modern Combat 2: Black Pegasus, which impressed us both for its excellent technical realization and for the 'excellent gameplay calibration. The Gameloft title is equipped, in particular, with a very precise control system, which solves the problem of the fire button fairly well and which, moreover, can be customized to better adapt to our style of play. Although launched in a big way by an initial promotion, Battlefield: Bad Company 2 cannot therefore escape direct comparisons and must be able to carve out its own space in a trend that is now quite popular even in the portable field. The EA production numbers speak for themselves: fourteen single-player campaign missions, as many usable weapons, the ability to control attack posts and armored vehicles and finally an online multiplayer mode (with 3G network support, as well as Wi-Fi). fi) for up to four players. Unfortunately, it is precisely the multiplayer that represents the most lacking part of the experience: four slots are few to guarantee engaging battles, the maps are too small and finally we encountered many, too many problems deriving from the lag. An update on this would be extremely welcome, in short. Dice roll As mentioned above, the single-player campaign is made up of fourteen stages, all characterized by a good level of challenge and a fair variety, the latter undoubtedly conferred by the possibility of putting yourself in command of fixed positions or vehicles. Our soldiers find themselves facing complicated situations, with a large number of enemies stationed at every corner and a structure that often winks at ~trial & error~ to overcome the limits of a direction that smacks of already seen or excessively ~scripted~. The final result is discrete but not transcendental and in this context, unfortunately, the control system does not constitute a positive variable. The developers have opted for a solution halfway between classic and experimental, with two ~invisible~ sticks placed at the ends of the touch screen that allow us to move our character and manage his aim in a casual way, effectively recalibrating the controls every time we touch the screen. The default assignment of fire to a double tap of the right thumb, however, does not work as hoped: to shoot you have to abandon aiming in the case of a single shot weapon, while for automatic weapons you can move the crosshair while a burst is emitted, however to the detriment of the ammunition. On the iPhone we have seen several solutions for FPS so far, but that of separate fire (to Modern Combat, to be clear) seems the best, although in some cases it forces you to use more fingers than usual. Beyond the layout of the commands, Battlefield: Bad Company 2 also suffers from a late response to inputs, but above all the driving of vehicles proves to be very cumbersome and problematic. As far as the purely technical aspect is concerned, the sound sector of the game is full of dialogues in English and the effects are average, while the graphics make use of polygonal models that are a little too simple and angular, which moreover are not enough because the frame rate is always stable and fluid. The tested version is 1.0.0 Price: 2.39 App Store links", "date": "2011-01-12", "grade": "6.8"}