{"name": "Scegli il tuo destino", "ref": "https://multiplayer.it/recensioni/83465-ultimate-mortal-kombat-iii-scegli-il-tuo-destino.html", "text": "Strengthened by violence, deliberately manifested in an exaggerated way, and by the unique charisma that some of the most famous fighters were able to convey, the Mortal Kombat saga was the only one that over the years has been able to stand up to the historic Street Fighter one. Fans of both titles, to be honest, have for years led a host of opposing factions so fierce as to make the (not very intelligent) ~console war~ currently underway look like a tournament of checkers between the elderly. However, while Street Fighter by changing the platform only improved in quality (with some exceptions, to tell the truth), the fate of the historic rival series was different, which came to the brink of the abyss several times. The last chapter, a fairly successful crossover with DC heroes, mainly sinned in the lack of violence, thus distorting one of the trademarks; while waiting for the new episode, which will see on PS3 the debut of none other than Kratos among the bloodthirsty wrestlers, Ultimate Mortal Kombat 3 arrives on the iOS platform, a historical remake that joins the beautiful transposition of Street Fighter 4 thus completing the array of historic fighting games in full touch version. Finish him! Launched the application, weighing 171 Mb, you immediately find yourself in front of the typical settings of the series, surrounded by disturbing skeletons; in truth, the initial menu appears rather bare, allowing only to modify very few options, view the license documentation and the guide and access the extras, such as the ranking, statistics, achievements (not integrated in Game Center) and the biography of the characters. Obviously present the entry dedicated to the actual game, from which to choose the classic Arcade mode, local multiplayer, survival and the unpublished Shao Karnage, whose usefulness as we will see appears rather doubtful. While in fact there is very little to say about the traditional modes (the arcade can be tackled in the usual 4 levels of increasing difficulty with 13 characters), the Shao Karnage allows you to immediately face the emperor Shao Kan individually, destined instead for the last Arcade mode level. The reason for this clash? None, if not to accumulate points for each hit scored, considering that the emperor is destined for a certain victory (his strength is clearly unbalanced compared to the other characters). Once in the arena, the approach preferred by the developers of Ultimate Mortal Kombat 3 is diametrically opposed to that chosen for the analogous iOS version of Street Fighter 4: while in the latter it was preferred to give more space to the excellent animations and to the intuitiveness of the controls to the detriment of the detail of the backdrops, in Mortal Kombat there is generally a very high graphic quality, with lively and partially interactive scenarios (there are for example the multi-level arenas), however burdened by the same animations of the 8-player versions bit. This return to the past, it is good to say, will still be able to please the most loyal fans of the series; certain, however, that witnessing some types of blows (and reaction to blows) nowadays still leaves one perplexed. The biggest problem, however, is undoubtedly represented by the controls: both the left virtual stick, responsible for movement, and the 5 action keys on the right are in fact uncomfortable and imprecise, totally inadequate for the speed and complexity of the game's moves. In fact, it will often happen to ~lose~ contact with the analog stick, remaining motionless in the center of the screen and suffering the opponent with impunity; furthermore the parry on the key, which recovers the original choice of the programmers, makes this fundamental feature practically useless, precisely because of the difficult access to the touch buttons. Basically, while the perfect control system of Street Fighter 4 already allows after a few rounds to better master Hadoken and Shoryuken even on the iPhone touch display, in Ultimate Mortal Komabat 3 it will be chance, with its unpredictability, to decide the winner . Of course the fatalities remain, simplified for the occasion, the blood and the memorable soundtrack; however, this transposition of the Warner Bros-EA masterpiece is currently very incomplete. Price 2.39 The tested version is 1.0.5 Apple Store Links", "date": "2011-01-04", "grade": "5.8"}