{"name": "Tra illusioni e misteri", "ref": "https://multiplayer.it/recensioni/83495-gray-matter-tra-illusioni-e-misteri.html", "text": "Tested version: PC In a videogame panorama dominated by technicians and only recently massively contaminated by external personalities - often big names like Del Toro and Spielberg, whose actual creative contribution is difficult to weigh - a figure like that of Jane Jensen could only become legendary: born professionally as a programmer, she joined Sierra On-Line at the dawn of the 90s to leave it a decade later with the writing and design of graphic adventures that have become legendary in the meantime. The multifaceted ingenuity of the American is expressed especially between 1993 and 1999, a period in which she directed the work on the three works of the Gabriel Knight saga, experimenting with an approach strongly focused on narration to the point of obtaining a couple of novels, a forerunner to the following professional story as a writer that earned her in 2003, with Dante's Equation, a nomination for the annual Arthur C. Clarke award. The advent of the new millennium has therefore meant for Jensen a reduced commitment from a videogame point of view, with the creative drive that once allowed her to define the features of a trilogy in such a precise way despite the technical-technological differences of the individual chapters, turned elsewhere and the commitments as a game designer first reduced to the bone in the form of casual products and then diluted in the epic that was the production of Gray Matter. Announced seven years ago and initially scheduled for the end of 2004, the latter has occupied its creator on and off, just as the work of the software houses that have supported it has been fickle: after a few arrived at the French Wizardbox who have ferried to completion a project on balance interesting even if not entirely up to the premises. The story first of all In a similar way to what was experienced in the products that made her famous, Jensen chose an approach for Gray Matter that started precisely from the care in the development of the plot, especially in the figure of the characters who enliven its development. In the role of Samantha Everett, an aspiring American magician traveling to Great Britain, the player will be able to track down the Daedalus Club, the most prestigious magic club in the world, and by a fortuitous twist of fate get in touch with the enigmatic Dr. Davis Styles, the other alter ego that can be controlled in the chapters dedicated to him, former university professor and researcher of which Samantha will pretend to be the new assistant, remaining involved in his research in the field of neuropsychiatry. The alternating use of the two highlights a good writing and above all the great research work on the sources, appreciable both in the form of references to the world of illusionism, but above all to that of borderline psychiatry, with Styles' maniacal research for a contact with his wife, who died years earlier in an accident, which is supported by technical surveys, documents and dialogues evidently the result of a study that is anything but amateurish or botched. The first chapters of Gray Matter therefore flow a little too slowly but fascinating, to the point of creating an expectation for what comes after only partially satisfied. After years of success of adventures such as the light-hearted ones of Telltale or with an adventurous tone as in the various Runaways, of horrific digressions like Black Mirror or focused on the more strictly visual aspect such as Machinarium and the recent The Dream Machine, experimenting sessions entirely focused on the evocation sensory experience of memories of the time spent with his missing woman, such as the one that Styles sees as the protagonist in a park, amazes at first, unfortunately leaving us partially disappointed when we see how these premises do not lead to an effective growth path. Even without wanting to field the pending ending with lots of unresolved questions attached, the gothic characterization given to the protagonists seems in the long run a little too tied to the desire to create a character more on the strings of female sensibility - in the case of Samantha - and to the narrative fashions of recent years - Dr. Styles mourning by wearing black and wearing a mask, in Great Britain in the year 2000 - with the (almost) total absence of characters and lighter moments or big accelerations of pace which would be fine in the case of a book or a film, but at times it mixes badly with the necessary suspension of disbelief required of those who enjoy an interactive product where every reflection, discourse and suggestion is at the mercy of the logical ability of the user and his ability to move forward. Half satisfied also for the setting of Oxford, perfect all'beginning by giving the right atmosphere and background to the events but a little underexploited in its capacity as the university city par excellence, and throughout the central phase inside the campus where Samantha will interact with the members of the group who will undergo the ( fascinating) experiments by Styles, which do not seem to have a sequel in the interpersonal relationships between its components despite the not a little destabilizing events for their lives. If therefore Gray Matter has in common with the three Gabriel Knights the great care for the sources and also pays greater attention to certain aspects related to the narration, such as the precision in the English dubbing, the shift of the focus towards a more complex matter than voodoo rites, werewolves, vampires and the stories of ancient European families, does not seem to have fully rewarded in terms of characters and memorable moments, resulting overall inferior. In the balance between old and new In terms of game mechanics, Gray Matter is a complete graphic adventure: by exploring the environments with the mouse cursor and making Samantha, now Styles interact with the points of interest, the player has the task of solving a quantity of puzzles almost entirely based on the use of collected objects, leaving the other half of the time spent living an experience that does not lack of exciting moments from a playful point of view - especially the eighth and last chapter - to the development of the many dialogues but overall it is a bit too easy. The division into episodes is studied in an appropriate way and allows a certain freedom of movement in completing the highlighted tasks, as well as an aid system that shows which places still hide reasons of interest, a screen that summarizes the points obtained to the total for each goal. This solution represents an evolution of the old points system used in the Sierra titles and highlights how Jensen has remained tied to its past under certain points of view, although other aspects mark significant changes of course: the adoption of a system game based on the use of only the left button to interact with each element of the backdrop or character, above all, returns great immediacy while perhaps representing an excessive simplification of what is usually done and even a law of retaliation if compared to Gabriel Knight who still in the second chapter, now in 1995 a little out of time, he proposed the classic interface with the choice of a variety of different types of interaction. The most original element within the gameplay should have been represented by the possibility, in the chapters starring Samantha, to select and then perform the correct magic trick to unravel the most complex situations. The idea of bending such an important premise within a game mechanic was excellent, a pity that it is resolved in the use of a simple interface that is always the same except on a couple of occasions, which make clear how the final result was the result of the need to complete the development and complete a work already from biblical times. Paradoxically, some digressions on the classic search for the object and the place in which to use it are much more compelling, which take place during the less pretentious sessions in Dr. Styles' laboratories, between computers and analysis of the results obtained during the experiments, deprivation tanks sensory and strange machinery with which to get in touch with further planes of consciousness. There are some logical inconsistencies that afflict certain passages - Samantha not seeing the key in the mouth of a statue until she has ascertained that the door she has to open is not actually closed, for one - but they are sporadic cases and do not compromise anything. Middle ways Oxford shown through dozens of different environments and those who populate its foggy streets, colleges, clubs and the immense country villa built just outside the city centre, exploit a hybrid system that mixes two-dimensional backdrops and three-dimensional fixed 3D similar to that of Resident Evil released on PlayStation. The former are excellently made as well as in large numbers, with detailed glimpses and often made even more suggestive thanks to an exceptional musical accompaniment. Different speech for the 3D part which, while barely sufficient in terms of pure and simple modeling, hangs over when analyzing bad animations, unable not only to properly manage the interactions but also the simple movement routines, such as walking or running characters who most of the time are not very creativedibile. Unfortunately, the work of WizardBox, former authors of So Blonde, is not perfect even in terms of the arrangement of interaction points that can be imprecise, even when the system is activated which highlights them by marking their name and position on the screen . The interlude scenes use a technique that animates static artwork through zoom, movement of the boards and overlapping of the same, with a generally engaging result although the style is not always homogeneous to that of what is visible while playing. As mentioned, the English-language dubbing is well done and the same goes for the lip synchrony; the version we tested did not have any localization in Italian but will be available, in the form of the classic subtitles, in the one on sale for PC and Xbox 360 from next January 27th.", "date": "2011-01-03", "grade": "7.0"}