{"name": "Le mirabolanti avventure di Lara Croft", "ref": "https://multiplayer.it/recensioni/83333-lara-croft-and-the-guardian-of-light-le-mirabolanti-avventure-di-lara-croft.html", "text": "Tested version: iPadLara Croft can rightly be considered one of the most famous heroines not only in the videogame field, but also outside of it thanks to the numerous film adaptations that have seen her played by women of extraordinary beauty and athleticism such as Angelina Jolie. The series that sees her as the protagonist, or Tomb Raider, is equally much appreciated as she was one of the first who managed to competently bring the adventure genre into three dimensions with a strong platform and puzzle connotation. Waiting for the new chapter in the saga after the last rather controversial ones, 2010 saw the arrival of a spin-off on consoles and personal computers starring the beautiful adventuress, less and less busty, which was considered by most critics to be the best title in the digital delivery of the year and in general a must-try video game. So it's nice to know that Lara Croft and the Guardian of Light HD also arrives on the iPad (and iPhone/iPod Touch with a dedicated version) mostly with unchanged content and full support for the two-player cooperative mode, both offline and online. The view you don't expect The connotation of spin off materializes above all in the type of view used, from above and with a fixed ~isometric~ angle managed directly by the game itself. Lara's control is instead the classic ~dual stick~ one, on the left of the screen there is in fact the icon assigned to the movement with the selection of the weapons around, on the right instead those dedicated to shooting, jumping and using bombs. The result, although unsettling perhaps for lovers of the saga, is instead absolutely convincing, because the camera always does its duty well and the title keeps key elements such as platform and puzzle intact, only the point of view and the type of control that is closer to titles that offer the same type of solution. Lara Croft is a treasure hunter and the object of her new research is the Smoky Mirror, a relic kept in the South American jungle of rather unknown origins. It goes without saying that her recovery causes the awakening of an evil deity by the name of Xolotl together with the warrior Totec, who had imprisoned her for several millennia thanks to the Smoky Mirror. The aim of the game is therefore to chase Xolotl through 8 levels made up of temples, tombs and forests linked together, facing jumps between platforms, environmental puzzles and various obstacles represented by traps but also by rather aggressive enemies. Everything works quite well because first of all the control system, after the due initial practice, allows you to jump from one platform to another without a shot being fired, while the virtual stick assigned to the shot allows you to hit objects and opponents in all directions. Environmental puzzles usually propose the activation of gears to overcome certain obstacles, some are as simple as pressing tiles in sequence, others are more complex and include puzzles that involve large portions of the game map and are perhaps divided into numerous tense steps to unlock, for example, access to the next temple. At Lara's disposal, as mentioned, there are bombs, useful for destroying some elements of the scenario that block the road rather than gears that continuously shoot arrows, or even pistols, machine guns and even a sort of javelin ideal for skewering enemies but also for be wedged into walls and become an additional step to reach otherwise inaccessible places. Together with the grappling hook, which is activated by clicking on the screen near the appropriate hooks, the javelin constitutes the backbone of the puzzle/platform phases of the game, which cleverly alternate with the adventure and exploration part. In the latter case there are special small tombs and ~optional~ parts of the scenario where special upgrades and finds are often found. The former can be equipped to improve health, defense or attack ability, the latter instead are linked to a bar placed under the health bar which fills up following successful attacks without taking damage, and allow you to temporarily increase the athletic and attacking abilities of Lara herself. Each level, beyond the objects present on the game map, provides an online ranking for the score and an interesting series of challenges related to the score itself rather than collecting certain objects and solving puzzles within a certain amount of time. The prize for their completionto is represented by additional power-ups and finds (there are several dozen in total) which have a decisive impact on replayability, also because the gameplay is anything but repetitive or frustrating. Lara Croft and the Guardian of Light HD is in fact a title where all its components are perfectly balanced, it is quite replayable as a setting and it is extremely fun, the extras are present in good numbers and the control system works well even in touchscreen mode after the necessary learning period, also because the pace is not so high as to make its use confusing and frustrating. The online rankings are then only the pinnacle of what adds further longevity and variety to the title, or the cooperative component for two players. Available both offline thanks to the Wifi and Bluetooth connection, and online thanks to full Game Center support (which also ~gives~ 38 objectives to unlock), the multiplayer mode makes Lara Croft and Totec available in the same levels as the single player. The nice thing is that the puzzles must be tackled in a different way using the two characters, for example Totec can use her shield to parry the arrows coming from the gears and make her way while Lara places the mines, the latter can use her grappling hook to tow Totec after having used the javelin to reach high places that cannot be reached by the jump of one's partner. Dulcis in fundo the technical sector; in recent times on Apple devices we often talk about the ID and Epic engines for Rage and Infinity Blade, but also Lara Croft and the Guardian of Light HD has a top-level graphic component, as had already happened on consoles and PCs. The polygonal mass makes the structures solid and ~full~, the detail of the textures increases the visual variety, the presence of different light and particle effects helps to make the impact absolutely pleasant, also because the fluidity is excellent for most of the adventure and obsessive attention to detail adds further graphic beauty. The sound sector has English dubbing with the voices of the protagonists during the interlude sequences and the text in Italian, the music follows the lines of the graphics and is catchy and atmospheric for their entire duration. The only qualms from a technical point of view are due to the rather high instability of the version currently available on the App Store: in fact, on more than one occasion the game froze on returning to the dashboard and for no apparent reason, in an absolutely random way both after a restart of the device or after using different applications. A future update should solve this problem and make the title perfect from this point of view as well. The tested version is 1.1 Price: 7.99 App Store links", "date": "2010-12-30", "grade": "9.0"}