{"name": "Libeccio o tramontana?", "ref": "https://multiplayer.it/recensioni/83417-europa-universalis-iii-divine-wind-libeccio-o-tramontana.html", "text": "~General, sir, look out the window! There is a line of barbarians who have occupied the city!~ The general wastes no time and opens the shutters of his room. After a quick glance at the square below, he closes the shutters and calmly explains to the alarmed conscript: ~But no, they're not barbarians. They're taking part in an audition...~ ~To enlist?~ ~No, for Big Brother~. The conscript does not seem to understand. ~Sir, who is this Big Brother?~ ~A mysterious and omniscient eye for which Western men and women will gladly degrade themselves to the level of beasts.~ ~And why do we allow such a thing in our squares?~ ~And who are we to judge them? Besides, the production paid us well.~ The soldier is perplexed, but the general dismisses him annoyed looking for the lost peace and his erotic magazine. Unfortunately for him, he doesn't have time to leaf through the first page and unbutton his fly that someone else knocks on his door. It is one of his most trusted men who speaks to him in alarm: ~Sir, two generals have changed their minds. We lack the votes to declare war on our neighbors.~ ~But are you all alarmed today? What will it be! All this mess for a couple of votes... let's learn from those who know a lot, let's buy them!~ ~Sir, how can we do, sir?~ ~Amateur. Easy, let's ask the king to postpone the declaration of war for a month and let's start working on the flanks. Let's send him some women, pay him the mortgage, things like that.~ ~But they are all honorable men, sir, they will never fall!~ ~Pfui, honor is the stuff of a serial novel. They're mediocre men, so they're corruptible. You'll see that with a couple of prostitutes and a few bribes everything will be settled and next month we'll have our beautiful war. Just knowing how to wait.~ Little breeze from the township Divine Wind is the new expansion of Europa Universalis III, a turn-based strategy released in the now remote 2007. We won't waste time re-discussing the extremely complex mechanics that regulate it, which cannot be summarized in a few lines. Suffice it to say that the player has to manage a nation in all its aspects, with an unprecedented level of detail, but with a very steep learning curve (we are talking about several hours to spend studying the interface and all the functions of the game ). If you want more information, go and read the review by clicking this link. It is important to note the incredible longevity of the title, given that four years after its publication it is still supplied with expansions, a sign that lovers of strategic games have promoted it with flying colors, even on a commercial level. In fact, the strategists who can boast the depth of any Europa Universalis are very few, and it is not so strange that those who bought it then still play it today. Trip to China and Japan The main idea behind Divine Wind is to offer the enthusiast the possibility of dealing with nations and historical periods other than the classic ones. It is therefore possible to play with China and Japan, which have different resources from the ones we have come to know. Playing as China you will have to manage three factions. Each has specific strengths and fields of influence: Eunuchs are interested in economic and territorial expansion, Temples in religious expansion, and Bureaucrats in domestic enhancement. By playing it is possible to manage the situation in different ways, for example by trying to support the most powerful faction, or by favoring another one to make it assume power. It's impossible to keep the balance between the three factions, so you have to choose how to behave and act accordingly, if you don't want to penalize the entire empire. Japan is very different to manage than China. Taking on the role of a Daimy - Minamoto, Fujiwara, Taira or Tachibana - the player must try to become Shogun by overthrowing the one in charge. To do this, one must act diplomatically or militarily. Succeeding is not easy at all, given that after having made a Shogun fall, one must act to be elected and it is not certain that the other Daimy will die from the desire to place power in the hands of the usurper. To succeed, you will have to convince them diplomatically or defeat them on the battlefield after the outbreak of civil war. Assuming the role of Shogun is only the beginning, because once that goal is achieved, it will be necessary to manage the whole of Japan, making decisions in all fields. Each choice involves the alteration of the value of influence on the Daimy. If the influence drops too much, you will have new wars and risk being overthrown from the role of Shogun. The winning faction Of the two new nations, the most interesting one to play is definitely Japan. China, due to accounts eventsngent to the territory, it requires more schematic choices and in the long run less free than those of Japan. In general it is now more difficult to wage war. The call-to-arms mechanism of the allies makes conflicts more difficult to win and in some cases we find ourselves fighting on a much larger scale than initially estimated, with the risk of having to face nations more powerful than the one attacked, for the sole fact that they are allies of the offended. Another change concerns the production of buildings: now there are more of them and it takes more time to make them, especially in the early stages of a game, which are always the most delicate. From a technical point of view, Divine Wind adds nothing to what has already been seen in Europa Universalis III. So, expect the usual summary screens and the usual, bare-bones world map. Not that technical poverty is a defect for such a title, which thrives on very different qualities, and it wasn't even the case to expect who knows what from an expansion, which must mainly lengthen the original gaming experience, certainly not revolutionize it , which Divine Wind does very well.", "date": "2010-12-29", "grade": "8.0"}