{"name": "Non  un paese per vivi", "ref": "https://multiplayer.it/recensioni/83278-dead-nation-non-e-un-paese-per-vivi.html", "text": "It was George Romero who put the flea in our ear for the first time with his 1968 ~Night of the Living Dead~: the film told the story of a group of people struggling to survive a mysterious invasion of the undead from cannibal tendencies. The situation shown on the screen was so strong as to be indelibly imprinted in the collective imagination, and although there has been a long period in which zombies seemed to have lost their charm, in recent years it seems that nothing else is being talked about. If the videogame representation of a ~zombie outbreak~ can contribute to the success of a product, then why not take advantage of it? This seems to be the philosophy embraced by various development teams, which only in 2010 gave us the living dead in any sauce. The guys from Housemarque, therefore, bring only the last contribution to a vein that, we are sure, will certainly not end with the year that is about to end. And after the success of Super Stardust HD, the genre chosen for Dead Nation could only be that of top-down shooters. In the ten stages that make up the game (available exclusively on the PlayStation Store, at a price of 12.99 euros) we won't have to deal with stars and spaceships, however the re-proposition of some elements that the developers evidently considered interesting, such as for example the ability to take a quick shot to escape a problematic situation. And the two characters that we can control, Jack McReady and Scarlet Blake, will experience a lot of problematic situations, survived the extermination due to some mutation in their DNA and intend to free the streets from zombies once and for all, even if the hope of finding someone else alive becomes increasingly feeble. The Walking Dead Top-down shooters typically use both sticks on the controller to control character movement and weapon fire. In Dead Nation, however, a less arcade approach than usual has been opted for: the right stick determines the direction of our shots, of course, but the fire is not automatic and must be activated by pressing the R1 back button. The solution is combined with a thick management of weapons, magazines and rate of fire, which constitutes one of the most interesting aspects of the Housemarque branded product. Within each stage our goal is to eliminate the greatest number of zombies and reach the checkpoint each time, but there is also an exploratory component that rewards our courage through the allocation of money, which we can then spend at the shops located in the free zones. Depending on the progress and the objects unlocked, we can therefore upgrade the weapons in our possession (improving their power, rate of fire, magazine capacity, ability to carry ammunition, range, etc.) and buy new ones new. From this point of view, an excellent job has been done: the default rifle, the machine gun, the shotgun, the flamethrower and the blade gun are well differentiated from each other and each lend themselves to a different approach. And the same can be said of secondary weapons including grenades, beacons and proximity mines. The speech acquires a precise sense in the cooperative multiplayer mode, as you can organize yourself with your teammate to upgrade different weapons and coordinate your maneuvers, with a player perhaps slowing down the more numerous waves of zombies using the flamethrower while the 'other mows them down with the machine gun. Playstation 3 trophies Thirty-five trophies are contained in Dead Nation. As usual, to get the twenty-one bronze trophies, just complete objectives such as eliminating a thousand zombies, performing five hundred melee attacks and completing each of the ten stages. For the eight silver trophies the requests become more expensive, and in fact you have to upgrade all the weapons to the maximum, complete a mission without suffering any damage and get to the end of the single player campaign at all difficulty levels. The three gold trophies include, among other things, the killing of over fifty thousand zombies, while finally the platinum trophy is unlocked once all the others have been obtained. Died there Unfortunately, it must be said that it is precisely on the multiplayer front that some perplexities arise. The local cooperative mode works great, nothing to say, but the online one needed much more attention. Firstly, matchmaking is very slow and you have to wait a very long time to find a match, unless you organize yourself with a friend and invite him to join, a solution that fortoday it seems the only feasible one. Secondly, there is no voice chat at all, which makes it impossible to coordinate your actions with those of your partner. These are far from marginal shortcomings, and given that the game was released on December 1, the developers are making the release of the patch wait a little too long which will probably put things right. The other limits of Dead Nation are instead systematic, i.e. they simply depend on the genre: the most crowded situations are very confusing to manage, the ~trial & error~ structure of the more advanced stages can lead to episodes of frustration and the action ends to be a little too repetitive, forced within very specific boundaries. Graphics and sound combine effectively to represent a city overrun by zombies, blood gushes (although, technically, the dead shouldn't bleed...) and the engine manages even sequences with hundreds of zombies on the screen in complete tranquility . There is a good variety of enemies, with creatures as gruesome as they are dangerous that peep out from a certain point of the adventure onwards, and the management of the controls (although configurable at will) does not always prove to be up to the situation, with the weapon change in particular which is a bit uncomfortable. The use, indeed the abuse of darkness on the one hand helps to create a certain atmosphere, with the character's torch whipping through the darkness and revealing sudden threats; on the other it inevitably ends up making the experience uncomfortable or even annoying. Finally, nothing to say for the level of detail and attention to detail, rendered in an excellent way even if the view from afar doesn't do it much justice.", "date": "2010-12-22", "grade": "8.4"}