{"name": "Russian Strike", "ref": "https://multiplayer.it/recensioni/82895-apache-air-assault-russian-strike.html", "text": "Version tested: PCWhen video games and helicopters are juxtaposed, one thinks of the very old Choplifter, the Desert Strike trilogy or the LHX Attack Chopper. In fact, recent titles in which you only drive these fascinating vehicles are very rare, although their representation as vehicles to be piloted extemporaneously is still quite widespread (see GTA IV, Battlefield: Bad Company 2 or Prototype). After working on the excellent Wings of Prey (known in the console version under the title of ~IL-2 Sturmovik: Birds of Prey~), the Russian developers of Gaijin Entertainment have decided to fill this gap with Apache: Air Assault, a title strongly oriented towards simulation which, however, does not disdain the action phases and indeed offers us sixteen missions set in the (imaginary) scenarios of Tarzistan, Salcedo and the People's Republic of Lualia. These are locations characterized respectively by the presence of mountains, plains and coasts, with suggestive landscapes (also thanks to the excellent lighting system) on whose surface there are only interactable objects. From this point of view, the difference between Apache and the recent Tom Clancy's H.A.W.X. 2, for example, is clear: in the Ubisoft product the tessellation and the implementation of the GeoEye technology allow the reproduction of very detailed landscapes, which, however, proved to be mere ~postcards~ with which there is no way to interact. In Gaijin Entertainment's product things work differently, and so the weapons can pull down trees, buildings and so on during the action. The price to pay for so much thickness translates into a not incredibly extensive visual horizon, sometimes hidden by portions of the scenery, but ultimately of great impact. Course for helicopter pilots The simulation component in Apache: Air Assault is predominant, at least as regards vehicle control; and it is a rather difficult aspect to digest, in certain situations. Before starting the game it is possible to select the ~training~ style to obtain a more arcade experience, with the helicopter that moves without major problems but which, on the other hand, reacts in a far from immediate way to our inputs, putting us in difficulty especially when you have to dodge enemy fire. The ~realistic~ style instead allows us to have faster reaction times and total control of the vehicle, provided that we dose the maneuvers very carefully and accept a certain degree of difficulty even for the most trivial movements. Using a controller for Xbox 360, the default configuration sees the management of the propellers assigned to the analog sticks: the left one adjusts the inclination of the vehicle to three hundred and sixty degrees, the right one increases or decreases the power of both engines, thus also allowing us to rotate the middle. The combined action of both sticks is required to move forward at more or less high speed, make quick detours, raise or lower altitude, and so on. The engine of the game is perhaps permissive as regards the contact with the surfaces, but in general the physics represented on the screen is plausible and merciless, placing clear obstacles to our incursions, especially the ~targeted~ ones. Fortunately, the combat system provides an automatic flight mode (obtainable by pressing the sticks on its axis) which stabilizes the helicopter and gives us the possibility to move virtually to the gunner's position. At that point, with a first person view, the ability to zoom and activate an infrared viewer, destroying targets will become a much easier and more fun operation. Provided that we immediately regain control of the vehicle when the radar signals the arrival of a missile at our address! Even in this sense, however, we note a relative permissiveness: the enemies have a very bad aim and therefore will hardly be able to hit us on the first shot, while the helicopter's shielding can withstand at least two or three attacks of a certain size. The thin red line If the developers of Gaijin Entertainment have paid particular attention to the aspects relating to the physics of the vehicle, also designing a complex control system capable of returning great satisfaction, the same cannot be said of the single player campaign. Beyond the quality of the scenarios, in fact, the missions are not supported by a narrative background up to the situation, and their very structure is limited to three variants that often see us move from point A to point B for the purpose to destroy enemy units (whether stationary or moving) or to protect deglthe allies. Getting carried away with the controls, performing assault maneuvers and destroying anything in our way turns out to be fun, but in our opinion a thicker artistic direction would certainly have benefited the whole experience. The ~free~ mode, or the possibility of starting a personalized mission in terms of scenario, difficulty and enemies, represents in this context a pleasant but end in itself extra. Instead, the ~team operations~ appear more interesting: thirteen missions to be played online, in cooperative mode, for up to four players. Too bad we couldn't test them during our trial period. Moving on to the technical implementation, as written at the beginning, an excellent job was done to make the locations full of details and at the same time completely interactive. The graphics engine used for Apache: Air Assault is the same as Wings of Prey, and proves to be excellent both in terms of quality and scalability: the many adjustments available allow you to play smoothly and without slowdowns even on high-end PCs medium/low, and in this case we obtained around 30 fps at a resolution of 1600 x 900 pixels with the test configuration, only slightly lowering the antialiasing. There are certainly situations in which you end up watching scenes that are a bit drawn out, such as for example when the helicopter is hit and falls to the ground, but in general the visual impact is truly remarkable and the three views available (third person, from the cockpit or in the first person) are equally useful and functional to the action. Bad news instead for the sound sector, made up of average effects that are accompanied by decidedly already heard and quite repetitive musical themes.", "date": "2010-12-21", "grade": "7.7"}