{"name": "Chorus", "ref": "https://multiplayer.it/recensioni/chorus-recensione.html", "text": "We approached the Chorus review with curiosity, aware of the excellent work that the guys at Fishlabs have done on mobile with the Galaxy on Fire series. The German team has never hidden the ambition to create a real space opera, but to abandon the comfort zone of iOS and Android devices to try their hand at the more complex and demanding reality of development on PC and consoles, even new generation, it was a far from simple task. The studio faced it with courage, it must be said, telling for the occasion a story that may not be very original, but interesting: that of a warrior who decides to fight the dangerous cult she has served for years and threatening to destroy the entire universe. The initial stages of the campaign inevitably betray a certain degree of inexperience, both on the narrative and gameplay fronts, but then Chorus meshes, accompanying us towards increasingly frenetic and demanding clashes. History Chorus, here is the protagonist, Nara Nara is a special girl, literally. Top pilot of the fleet in the services of the Circle, the space sect controlled by the mysterious Prophet and in contact with the dark force of the Faceless, he realizes over time that the battle in which he took part is becoming increasingly bloody and ruthless. and the religious motivations behind so much death and destruction are no longer convincing. One day she is ordered to use her devastating powers, combined with the capabilities of her sentient starship, Forsaken, to blow up an entire world. Nara obeys in spite of himself and launches an attack that devastates the planet, exterminating its population, but he immediately realizes the seriousness of his actions and decides to flee in an attempt to rebuild his life away from the Circle. Abandoned the Forsaken in a remote place, the girl joins a guild of mercenaries who defend the colonies from pirate attacks, but one day the Circle knocks on her door again and also invades the system in which she has taken refuge forcing her to take a stand. Will she keep running, regardless of the fate of her new friends, or will she decide to fight against the Prophet and his hordes of Faceless Ones? It goes without saying that Nara will choose violence, but will have to recover the Forsaken to achieve her goals and make peace with the conscience of the ship, in the context of a plot that in many ways incorporates the dynamics of the classic Navigator. The interpretation of the protagonist is heartfelt and intense and it is a pity that the budget limits weighed on the ambitions of the authors, who had to characterize the numerous supporting actors only through radio exchanges. Gameplay Chorus, a flight phase at the start of the campaign Chorus is a space shooter, so everything you do in the game will be on board a ship, whether it's the starfighter from the first missions, the Forsaken or the big flagships that we'll find ourselves controlling during some sequences. We thought it was appropriate to specify this because of the emphasis with which the Fishlabs title is advertised, showing the protagonist Nara and her special powers: these are elements that you will only see in action during the interlude sequences. In the game we will be asked rather to fly within different scenarios as large as they are desolate, reaching from time to time the starting point of missions that almost always revolve around combat, against increasingly stronger and more numerous opponents; but they also include the exploration of hidden areas, the resolution of environmental puzzles based on the activation of switches or the destruction of specific objectives, the defense of allies as well as the collection of resources. Control system Chorus, a space combat sequence The control system of Chorus is very particular and requires some practice to express its full potential, which will inevitably happen during the final stages of the campaign. To move slowly it is possible to use the left analog stick, while to accelerate it is necessary to dose the L2 trigger and to ~slip~ it is necessary to act on the L1 backbone, with the ship which at that point can turn on itself maintaining the inertia of the thrust: a fundamental maneuver to be able to quickly engage enemy ships. The right stick is used to turn and to aim, rigorously without lock-on, with the R2 trigger which activates the equipped weapon among the three available (selectable via d-pad), all equipped with cooldowns and therefore impossible to use indefinitely during the clashes. Then there are the special abilities of Nara and the Forsaken, called Rituals, which are unlocked during thestory and allow you to sense objects and targets, teleport behind enemies, launch energy blasts that destroy their shields, perform a disruptive charge and more. Chorus, the Forsaken in front of an allied ship Although the introduction of new features is gradual, in our opinion the Chorus commands could be rationalized in order to be less chaotic when you find yourself using all the resources at your disposal. The degree of challenge of the fights also gradually increases, but towards the end of the game you have to face really complicated situations and the controls don't always help you extricate yourself from real delusions of enemies, laser beams, bombs, surfaces to avoid and so on. To give you an idea, we had to repeat several times a fight that takes place in a narrow place, therefore with so many obstacles to be careful not to crash into, always continuing to move and skilfully dosing the L1 and L2 backbones to quickly collect the propulsive reloads to take down swarms of particularly annoying Nameless, all while trying to watch your back from other traditional enemy units that deal deadly damage at the first opportunity. Side missions Chorus, an ~indoor~ sequence in search of memories of the past To keep up with the difficulty of the Chorus campaign, the duration of which should be close to twenty hours all things considered, it is important to try your hand at the many extra missions scattered within the scenarios, which often and willingly are worth the unlocking of a more powerful weapon or the simple obtaining of credits that can then be spent at the hangar of a space station in order to improve the effectiveness of the guns, the resistance of the hull and shields, as well as for the purchase of items that improve certain functions of the ship. Unfortunately, however, it is precisely during the secondary missions (but sometimes it also happens with the main ones) that you come into contact with some of the uncertainties we mentioned at the beginning, represented in the first place by the tasks in which you have to find objects. In fact, we are not told what exactly we are looking for and the space to be searched is often enormous, which obviously does not help and indeed gives rise to rather frustrating situations. Enemies and bosses Chorus, a huge warship that we'll have to shoot down one piece at a time There is no doubt that the developers of Chorus have put a lot of effort into creating a large number of different enemies, each with its own characteristics, which add variety and challenge to the fights. They range from standard spaceships to those equipped with shields, from bombers to snipers, from dangerous ~swarms~ to the tough Sentinels, with their thermal rays and few weak points to target. After that there are the bosses, with some notable acute ones. We start with huge warships that we will have to fly around in an attempt to destroy energy cells and engines, thus deactivating the shields and moving on to the turrets and main devices, which once destroyed will cause the entire structure to explode in a spectacular way. There are also gigantic creatures that present equally multifaceted clashes between sensitive elements to hit, tunnels in which to slingshot on the fly, barriers to overcome and so on. Graphics and sound Chorus, a very fascinating ~indoor~ setting Let's go back to the starting point: Fishlabs is a studio that cut its teeth on mobile devices, managing to create fascinating worlds, but which are obviously far from what is possible to do with a new generation console like PS5, a platform on which we tested Chorus. Passing from one dimension to another was not easy for the developers, and this is mainly seen in the low complexity of the geometries (see in particular when the large ships end up in pieces), in a low-impact effects and in environments that they fail to impress as one would expect from such a production. In the ~indoor~ areas there is certainly a reference to the symmetries and geometries of Control (here the review), and there is no doubt that Nara has commonalities with Jesse Faden, including hearing a mysterious voice inside; however, when you move to the open space the situation changes, some glimpses are suggestive but everything is inevitably too empty, the rendering of the lights is ~fake~, the structures tend to look alike and therefore the impact that a similar location should have is not found to aspire. Chorus, Nara aboard the Forsaken in a space station Considering an overall modest polygonal count, the presence of the two classic mo is surprisingquality, resolution and performance, because it was legitimate to imagine that the game could handle this type of graphics even at real 4K without having to drop to 30 FPS. But no, and there is clearly no doubt as to which option is to be preferred to enjoy greater gameplay reactivity during fights: 60 FPS for life. We have already mentioned the good interpretation of the actress who lends her face to Nara, but thanks to the English accent and many whispered sentences it is difficult to follow the dialogues without activating the Italian subtitles, which can be set on three dimensions and characterized by an sometimes imperfect translation. As for the soundtrack, there is undoubtedly some interesting music but even here it would have been reasonable to expect something more enveloping.", "date": "2021-12-03", "grade": "7.3"}