{"name": "Altri omicidi e pochi indizi", "ref": "https://multiplayer.it/recensioni/82518-julia-innocent-eyes-istinto-predatore-altri-omicidi-e-pochi-indizi.html", "text": "Spoiler: to talk about the second chapter of Julia, we will be forced to reveal some details on the plot of the previous episode. If you don't want advances, skip directly to the second paragraph. We talked about the first chapter of Julia here, so, dear reader, we invite you to read that article to know what you have missed. In honor of the virgins of the series, we briefly summarize the plot and the main features of the game: it is an investigation-oriented graphic adventure, in which Julia has to stop an assassin who, living up to his common name, killed a young girl , daughter of a well-known judge. The first chapter ended with several open leads, all unconvincing for the purposes of the investigation. The developers have chosen to make use of various playful devices to give an idea of the various means by which investigations are conducted, creating a series of mini-games that must be solved in order to continue. There is no shortage of investigative sections in which you have to hunt for clues in a more classic way. What was said for the first episode, plot aside, also applies to the sequel, which begins after the dream that closed the first chapter, with Julia who decides to freshen up to get back on track after the bad night just spent. The hypotheses on the case are still all open and ours must resume investigating, alternating on the scene with the usual Alan Webb and with a new entry: Ben Irving. Run, Ben! If you read the review of the previous episode, you can consider it largely valid for this one too. The only substantial differences are that here you will have to complete two acts instead of one and that you will be faced with slightly different game situations that we will discuss throughout the article. Obviously, the mechanics have remained unchanged, including the obnoxious control system. The latter, unfortunately, has more than one occasion to show off negatively, especially in the sequences of Ben Irving. As already explained in the other article, you have to click on a point in the scenario to make the hero on duty move, but by holding down the mouse button there is no way for him to follow the cursor. Not bad in sections with fixed screens or with few movements to make. Too bad that Julia has large exploratory sections, framed from a bird's eye view, which force continuous clicks on the screen to reach the desired area. But we talked about Irving's specific problems. Good Ben has a bandaged leg that forces him to move on crutches; imagine at what speed. Think how nice it is to explore environments with a character who takes several seconds even to walk a few meters. Luckily Ben is only active in two sequences, the first of which doesn't require you to travel far. Unfortunately the second is longer and, if you don't immediately identify the areas to interact with, it can take several minutes to finish. And we're talking about just three puzzles. Waiting for it to pass In another sequence, it is Webb who gets into trouble with the interface. The cop has to manage to plant a bug on a suspect's phone line, without being seen by his henchmen. The greatest difficulty of the section lies in the sudden changes of shot which, by not concluding the movement, risk ending up right in the enemies' field of vision. In reality, it takes little to get used to and to stop the inspector by clicking on the right point with the mouse, but the fact remains that these are situations that can be avoided by carrying out tests and studying the scenarios better. The only improvement compared to the first episode is the overall duration of the adventure, which stands at three, four hours. In general there are more dialogues and more reconstructions to be done, some nodes of the previous chapter are dissolved, while new avenues of investigation open up. The structure of the yellow book is respected and, as was to be expected, the third episode will shed light on the case (provided someone decides to invest the money in it). From a technical point of view, the level is the same as the previous chapter: mediocre three-dimensional models, poorly defined textures, bare environments, but higher system requirements than GTA IV (not to always mention Crysis).", "date": "2010-12-15", "grade": "5.5"}