{"name": "Un clone al testosterone", "ref": "https://multiplayer.it/recensioni/83113-trucks-and-skulls-un-clone-al-testosterone.html", "text": "There's an unwritten rule when you want to rip off a hugely successful game without necessarily looking like a poor thief: take the mechanics of the original, go out of your way to add any gameplay ideas that make it feel new and more funny, and then launch it in the hopes of following in its wake and selling a lot of copies. On the App Store it has already happened with the best applications inspired by Canabalt, Doodle Jump and Angry Birds, but with Trucks & Skulls the Appy Entertainment development team has decided to do things in a slightly different and not at all veiled way. The new game by the authors of FaceFighter absolutely does not want to touch the ideas behind Angry Birds, it does not renew its mechanics, it does not change the skeleton and it does not introduce anything that could even minimally alter its playability. Trucks & Skulls doesn't want to be funnier than Rovio's colorful title or more original: instead it wants to be more male and rude. Gentle as a trucker Those who have played Angry Birds end up being faced with the same and identical game, with a single but fundamental difference: instead of the funny green pigs, the colorful birds and the gaudy cartoon-style scenarios, Trucks & Skulls replaces respectively gigantic metal skulls trucks and cold and scary levels. The new graphic and stylistic look totally distorts the impact with the game, as well as giving a greater feeling of coherence. Explosions, pools of magma and metal monsters on four wheels ready to crash into imposing wooden and iron structures: if Angry Birds were a PlayMobil package, the Appy Entertainment title would be Action Man, G.I. Joe and Big Jim combined. Yet, even more ingenious and successful is the way in which the developers have taken everything to excess, giving the impression that the game is constantly trying to make fun of its own muscles: from this point of view the absurd sound effects must absolutely be mentioned , the macho voices that are heard with every throw and the heavy guitars at the end of each level. The care for aesthetics and attention to style are palpable even outside of a game, since the menus and icons are quite captivating and elaborate, while nothing is tacky despite the fact that, with all those visual excesses, it was almost impossible to make something that it wasn't an eyesore. However, behind an unashamedly virile and exuberant graphics hides a perfect copy of Angry Birds: not only is the aim the same, that is to eliminate opponents using a huge catapult, but also all the nuances of gameplay, game elements and rewards have been reproduced exactly as in the successful Rovio title. Based on your performance, the number of attempts and the score obtained you receive an evaluation at the end of each level, where hitting barrels of explosives can blow up entire structures. The different types of trucks and trucks follow one by one the birds of Angry Birds, passing from the explosive tank to the one that splits into three small projectiles, from the tank that slingshots against the enemy in a devastating way to the one that releases a torpedo towards the Bass. Shamelessly, Trucks & Skulls steals each idea and proposes it again in a practically identical way, although, as almost always happens when it comes to clones, there are always some small differences: the game is in fact slower and less immediate, with of the catapult slightly more imprecise and times between one launch and the other more dilated; these are small differences which, however, make the overall experience slower. The game, however, refers to the amount of levels available, offering about 150 levels scattered in four different settings. It must be said that some scenarios look a lot alike, but once they've all been completed it's possible to create new ones thanks to the excellent level editor, the same one used by the developers to create the available scenarios. This, unfortunately, only in the iPad version, a lack that makes Trucks & Skulls for iPhone and iPod Touch much less attractive than its older brother. The tested version is 1.1.1 Price: 0.79 App Store links", "date": "2010-12-15", "grade": "8.0"}