{"name": "WWE SmackDown vs. Raw 2011", "ref": "https://multiplayer.it/recensioni/82538-wwe-smackdown-vs-raw-2011-you-cant-see-me.html", "text": "Tested version: PSP It's been quite some time since WWF Superstars depopulated in the arcade: they were the first years of wrestling in Italy, with Dan Peterson who between one comment and another dispensed very useful notions of English and first-rate stars like Hulk Hogan, Ultimate Warrior, Ted DiBiase, ~Macho Man~ Randy Savage and Andre the Giant facing off in the ring in matches that seemed extraordinary to us at the time. The distance from those sensations is measured both from the point of view of the television shows, now very different and clearly driven by new protagonists, and from the related videogame adaptations, always edited by the developers of Yuke's in the last ten years. WWE SmackDown vs. Raw 2011, also on PSP, represents a bit of a synthesis of the work done so far, from some points of view tremendously conservative but at the same time aimed at reproducing the contents of WWE broadcasts as faithfully as possible. And so here is a roster made up of about seventy ~superstars~ and ~divas~ (many of which to unlock), the now classic ~Road to WrestleMania~ mode that offers five new storylines (as John Cena, Christian, Chris Jericho or Rey Mysterio, or in an attempt to end the Undertaker's winning streak using R-Truth, Dolph Ziggler, John Morrison, Kofi Kingston or a wrestler created from scratch), the brand new ~WWE Universe~ mode, multiplayer (only locally, however) and the usual, huge list of stipulations for the matches, which sees the addition of the always fascinating Hell in a Cell and the street fight inside the backstage. Finally, there are the various editors to create a wrestler, a set of moves, a finisher, an entrance or even a particular stipulation from scratch. In short, for a wrestling fan, the offer could not be more complete. Awesome? As mentioned above, Yuke's work has remained very conservative over the years, a choice that evidently paid off given the good results obtained both in terms of critics and audiences. The progressive increase of wrestlers, modes and options, added to a gameplay that is in itself anything but fast, has however led to dramatic consequences from the point of view of pure playability: several minutes are needed just to start a game (even and above all due to a lack of optimization of the loads), and once in the ring the woodiness of the characters still represents a big limit compared to the dynamism that certain matches should instead offer. On PSP, in particular, the lack of a right analog stick ends up making the experience poorer and lacking in depth compared to what we saw on PlayStation 3 and Xbox 360, with some changes in the controls that unfortunately don't solve the flaws. No steps have been taken in the direction of realism, with five hundred pound wrestlers like The Big Show being easily lifted by almost anyone, but more than anything else it is the cumbersomeness of the experience that dampens the enthusiasm of even the most diehard aficionados. The ~WWE Universe~ mode itself, which practically guarantees ~free roaming~ with respect to events and their determination (a bit like the old ~General Manager~ mode), despite all its potential, is not fun to play, at the end of the day. It was necessary to make the game faster and more dynamic, while finding an effective solution to better balance the encounters: the reintroduction of ~button mashing~ is a good start, but in our opinion the revision necessary to rejuvenate the series is much deeper and must be implemented as soon as possible. Technically speaking, WWE SmackDown vs. Raw 2011 doesn't work miracles, unfortunately, presenting itself with some good polygonal models, moreover equipped with animations extremely faithful to the reality of television shows, which contrast with others that are much less cared for and more angular (for example Sheamus, unwatchable). The polygonal audience is present only for the front rows and is monstrous as usual: if it really wasn't possible to do more with this graphics engine, perhaps better to focus solely on what happens in the ring. The sound sector is instead very rich in dialogues, recited by the real WWE superstars, while the musical accompaniment is entrusted exclusively to the various ~entrance themes~.", "date": "2010-12-10", "grade": "8.0"}