{"name": "Toccatemi tutto", "ref": "https://multiplayer.it/recensioni/82510-simon-the-sorcerer-v-linvasione-degli-extraterrestri-toccatemi-tutto-ma-non-la-mia-alix.html", "text": "That Simon is an atypical character in the history of graphic adventures can already be understood from the packaging. Despite the somewhat childish cover, there are more PEGI warnings on the back than on Grand Theft Auto IV. From an irreverent wizard we expected that at most he would go on a motorbike without a helmet with Harry Potter. Or steal two coins from the Offertory with a magic trick. Instead, he is a first-class loser. This is part of the rebirth project of the series, which has its roots in the nineties, the golden age of point and click. In those times Simon the Sorcerer had a great success with the first two episodes. Then things crashed in 2002 with Simon the Sorcerer 3D and the reins of the brand then passed into the hands of Silver Style Entertainment, which published the fourth chapter, Chaos Happens, and which today comes out with this fifth episode, finally re-emerging from the depths in which Simon he had sunk with the risk of drowning permanently. So let's talk about Simon the Sorcerer V. The event that breaks the balance and sets the narrative in motion is the arrival of two green aliens in Simon's magical world, the day after a big party. Although the stinking wizard manages to escape the two assailants, they kidnap Alix, Simon's girlfriend. The young man has nothing left to do but set off on an adventure that will take him almost everywhere before reaching the enemy's base, a spaceship called the Eye of Death. In the course of his personal Odyssey, Simon will also meet numerous helpers, who unfortunately are as pleasant as salt on a wound. To say. Do. Touch For a graphic adventure released in 2010, Simon the Sorcerer V doesn't offer anything new. There are objects to click with the mouse to hear their description, interact with them, or put them in the inventory (Simon's pointy hat). Once collected in the inventory it is possible to use them with each other. The rest is just multiple choice dialogues and walking around the screens. The only variation is the happy marriage between 3D and cel-shading, which gives its best when the lighting brings out the contrast between the color tints. In those moments it is like having before your eyes a book of colored illustrations with brushes; a very pleasant sensation. Too bad that the vitality that I imagine with this technique is wasted by the animations of the faces, too rigid to become a mirror of the emotions that the characters feel while they speak, also because there is no synchronization between lips and speech. On the other hand, the animations of the bodies are worthy, such as those of the moles as secret agents (why lately, in graphic adventures, everyone is obsessed with moles, we still have to figure it out). For once, the puzzles strive to be original: among all we remember the one in which contracts must be drawn up for a gay pirate, the future captain of our flying vessel, to sign. In the last section of the game, which mentions Star Wars, the developers have included a puzzle system that is solved with the use of powers, without collecting any objects. In any case, the puzzles are also within the reach of an audience less accustomed to point and click, thanks to a system of objectives that keeps us updated on what we have to do and which offers some small general suggestions if necessary. The most demanding may turn up their noses at the limited longevity and the absence of challenges worthy of their adventure experience, but they will certainly appreciate the effort put into inventing imaginative puzzles. As expected, Simon's old acquaintances return: Little Red Riding Hood, the Wolf, and the unbearable Swampy, a pain for the eyes and ears. In short, there are many ingredients in the magic cauldron, but if the recipe as it is can work, the doses need to be reviewed. Let's see why... Beat on the fingers The weakest point of Simon the Sorcerer V is the dialogues. First of all, jokes are not funny. When compared to the lucid irony of the Telltale adventures, they seem like the attempt of someone who wants to make himself likeable at all costs. Thankfully Simon is the most level-headed (read also ~flat~) of the company. Swampy just can't be heard speaking, and the verbal violence of Little Red Riding Hood, a child so feminist as to be ridiculous, contrasts grotesquely with the appearance of the character. Furthermore, many of the people we meet get lost in long and tedious disquisitions about their past histories, with dialogues even five or six lines long. Clichs abound, as in the case of the homosexual captain, and some gimmicks, rather than crazy, appear only gratuitous. Added to this is a weak dubbing, which suffers from the budget limited invested in the project. Even the constant sexual references weaken the attempt to make the series a mature product. When the developers realize that snickering in front of a plunging neckline is childish behavior, it will never be too late. Apart from these limitations, which we hope are only a first step towards a rebirth of the series, Simon the Sorcerer V has taken the right course and, as it is, it is already an enjoyable adventure, suitable for a varied audience.", "date": "2010-12-08", "grade": "7.0"}