{"name": "Soldati", "ref": "https://multiplayer.it/recensioni/82514-swords-soldiers-soldati-allattacco.html", "text": "Tested version: PlayStation 3 The Game is available for download on the PlayStation Network service Having become quite popular among iPhone owners, the ~tower defense~ genre may be completely unknown to PlayStation 3 users. It is a particular branch of real-time strategy, in in which the player does not directly control his troops but only has the task of putting them in a position to advance and attack the enemy, in an exquisitely two-dimensional as well as one-way context. And so, if we play to the left of the scenario, our soldiers will move to the right and attack the enemies as soon as they come into contact with them. One of the basic rules of RTS is that you have to outnumber your opponents, and in fact the clash between two ~equivalent~ units leads in most to a double elimination. It is therefore necessary to follow a first phase of ~construction~ of resources and troops, followed by a second phase of attack or defense, depending on the objective to be pursued. In Swords & Soldiers, these mechanics are enriched by funny characters and funny dialogues, with a single player mode thirty stages long and divided between the three available factions: Vikings, Aztecs and Chinese Empire. The campaign driving the Vikings is the first we can access, and in the end it turns out to be a ~walk of health~, practically acting as a tutorial with respect to the increase in difficulty that we will be able to experience already by switching to the Aztec campaign. The Vikings love to eat and revel, and they won't fail to point this out to us during the ten missions that involve them, based almost exclusively on the attack (that is, on the destruction of enemy positions) and sometimes on defense (in some cases, in fact, our task will be to survive for a certain period of time, waiting for reinforcements). These Aztecs are crazy After a very short period of loss, the control system adopted for Swords & Soldiers proves to be almost perfect: by holding down the L1 back key, you access the menu for creating ~workers~ (in the case of the Vikings, these are extremely robust women ) and different types of warriors, while the R1 key allows us to use special moves that exploit mana, the magical energy that recharges spontaneously over time. As soon as they are created, the workers begin an inexhaustible march that takes them to the nearest gold mine and thus make us accumulate money to ~buy~ other units. Pressing the Triangle button also displays the menu for acquiring upgrades and special abilities. Vikings can improve the speed of mana regeneration, cast a healing spell on a single unit, use their devotion to the god Thor to cast lightning and create snowstorms, build defense towers and catapults of devastating power. For its part, the Aztec faction has at its disposal sorcerers capable of bringing the dead back to life to make them fight again, quick and powerful warriors who join other exiles but effective from a distance, as well as stone monsters who can to make the earth tremble. Finally, the Chinese Empire can resort to magic, barriers and powerful special attacks on a ~territorial~ basis, such as the storm of flaming arrows. In short, each force in the field has different characteristics and equally valid resources. The only difficulty that can be encountered, as far as controls are concerned, concerns the engagement of a single target within a large group of units. For example, if we want to electrocute a particular enemy, or use the Aztec ability to sacrifice a man to increase the amount of mana, unfortunately the analog stick is not precise enough and can mislead us. However, this is a problem attributable to the game, certainly not the controller. Playstation 3 trophies There are twenty trophies contained in Swords & Soldiers, and they are obtained by completing the individual campaigns, surviving for a certain period of time in a survival mission and achieving a series of particular objectives: obtaining victory with a certain number of remaining units, eliminating various enemies with a single soldier, clear a level with all towers intact, etc. Do we eat Chinese? As mentioned above, the first ten missions leading the Vikings turn out to be quite simple and are certainly valid as a ~warm-up~ for the campaigns leading the Aztecs and the Chinese Empire. Unlike many other ~tower defense~, the title developed by Ronimo Games does not allow us to enhance the singlesole units, but this does not demean the action in any way, which in the more advanced stages becomes really intense and can make the games last quite some time, with continuous reversals of the front. By completing the campaigns you can unlock some minigames, such as the one based on rolling rocks, which act as a nice extra together with the ~skirmish~ mode but which, from an entertainment point of view, clearly do not hold up to comparison with the potential of multiplayer . In fact, it is possible to challenge a friend on the same console, using a horizontal split-screen, or access online multiplayer and confront a stranger (the latter option also available ~on the fly~ during any game). At this juncture, the game performs very well, without any problems relating to the quality of the connection, but perhaps some problems relating to the balance between the factions come to light, with the Chinese Empire appearing substantially to have an advantage. The graphics of Swords & Soldiers are very colorful and cartoony, and the animation of the characters fully reflects this style, even if the design in some moments gives the impression of being a bit immature. It's nice to see that even in the most agitated phases, with dozens and dozens of units colliding on the screen, there is no slowdown or drop in frame rate. The sound does its duty without infamy and without praise, finally.", "date": "2010-12-07", "grade": "8.4"}