{"name": "Viewtiful Joe 2", "ref": "https://multiplayer.it/recensioni/viewtiful-joe-2_a.html", "text": "What has changed? In Viewtiful Joe, our hero found himself projected onto a cinema screen, in a world populated by creatures from Japanese Z-series movies, all rubber monsters and spaceships, with the aim of saving his girlfriend and the world. Things are not very different in VJ2: a new enemy threatens to conquer the planet by escaping from the films, and begins his work by transforming Captain Blue, Joe's idol, into one of the magical statuettes that will decide the battle. This time Silvia does not play the part of the girl to defend, but takes an active part in the action, thanks to her special costume. And this is the most relevant novelty of the game: we will be able to choose at any time to change character between Joe and Silvia, also using the rotations (the so-called ~V-Touch~) to cause damage to the opponents. Both characters are equipped with VFX Slow Motion and VFX Zoom powers, but while Joe can use Mach Speed to speed up his attacks, Silvia has Replay available, i.e. the ability to replicate certain actions (usually attacks) to maximize their effectiveness. effectiveness. All this translates into spectacular sequences, in which characters are quickly changed to take advantage of their specific characteristics: Joe is not afraid of flames, Silvia can effectively defend herself from electric shocks, just to give an example. Their powers affect the interactive elements of the stages in different ways, and in particular Silvia is equipped with a laser gun whose shots can cause enormous damage if ~loaded~ using slow motion. Furthermore, some locations require the use of one character instead of the other Videogame courses and appeals The game structure of Viewtiful Joe 2 is identical to that of the first episode of the series: you face one chapter at a time, with a specific setting and characteristic enemies, and you have the possibility to buy upgrades between one stage and another . Also in this sense there are some novelties, but almost exclusively due to the presence of Silvia: the developers have not made a great effort to vary Joe's repertoire. The end-of-level bosses are also an integral part of VJ2, and as always they are as insane as they are lethal. The use of super powers, on the other hand, has been emphasized in the puzzle solving phases: as in the first Viewtiful Joe, you will have to use the various Slow Motion and Mach Speed to activate particular switches and influence the interactive elements of the stage. In this sequel, however, these aspects have been greatly emphasized, and so you will have to use the powers in the most imaginative way, combining them to obtain the desired effect. Finally, the level of difficulty remains high: on the one hand, the challenge spurs you to commit yourself to passing the stages, on the other, it is a wall that less experienced gamers will certainly hit. As far as the technical realization is concerned, Viewtiful Joe 2 differs little from what was seen in the previous episode: the animations of the protagonist are the same, several enemies have been borrowed and the level of detail of the stages is more or less the same. The GameCube version is practically identical to the PS2 version, apart from perhaps the different use of some special effects. A similar discourse must be made for the sound: practically unchanged music and effects, voices in English (subtitled in Italian) distinguished by an average level of acting for productions of the genre (nothing spectacular, therefore, but in a humorous and demented game perhaps less noticeable). [C] As always, the bosses are huge and ridiculous. Slow motion becomes indispensable to avoid certain attacks. In two is Better! [/C] Comment With Viewtiful Joe 2, Capcom has created a sequel according to the classic canons, proposing the same game with some additions. The presence of a second character becomes simply a matter of numbers, even if the use of super powers in this sequel has become much more frequent, above all to overcome obstacles. On a technical level, VJ2 is practically identical to what was already seen in the prequel, and in this case the NGC and PS2 versions boast no difference. Those who enjoyed Viewtiful Joe will not fail to love this sequel too, but it is undeniable that the developers could have introduced a few more innovations and varied the game structure more ... Pros: One more character Demented as usual Practically identical to the prequel Cons: Virtually identical to the prequel Quite difficult Very few technical changes The first Viewtiful Joe represented not only the umpteenth success of Capcom, but also an important return to the origins as regards the videogame. Despite being equipped with polygonal graphics, in fact, the game was proposed in the two-dimensional structure of a sort of scrolling fighting game, in which the blows delivered to the enemies represented the exaltation of beauty. If Devil May Cry introduced ~stylish combat~, therefore, Viewtiful Joe is a clear caricature of it, with the character assuming absurd poses between a blow and a dodge. The inevitable sequel, this time developed simultaneously for GameCube and PlayStation 2, fits perfectly into the things that can be expected from Capcom for this type of production: anything but a revolution.", "date": "2005-04-20", "grade": null}