{"name": "Il Far West non  poi cos lontano!", "ref": "https://multiplayer.it/recensioni/82882-western-heroes-il-far-west-non-e-poi-cosi-lontano.html", "text": "As in an overseas Western film, the title gives us for the first time on the Wii console, a nice shooter with an interesting storyline. It is therefore a challenge launched by our enemy, Professor Molina who will set traps at every level where we should prevent him from continuing towards the construction of his Doomshell bomb which has the intent to devastate the West. The moment is even more intriguing and fun as the package includes a hilarious element with a completely realistic look: a cowboy shotgun replica of Steve McQueen's sawn-off Winchester. The Wii Remote and Nunchuck will be placed inside the latter and then you will begin to really get into the part. It is interesting to go through all the twelve levels available because each step corresponds to a pivotal point in the story and before continuing with the game, the presentation page will illustrate, with a short message, the summary of the mission to be carried out and will often suggest the ~Bonus~, i.e. the strategy for passing the level. An example can be given by the third level where the Bonus says: ~Professor Molina has taken over the windmill just outside Veranopal, destroy it!~. With this invitation we are so ready to face the challenge by paying attention to the recommendations. BANG BANG... You shot me down! Preparing your rifle, from the very first moment, is what you need to do as soon as you start playing, in fact, to be a little more precise in aiming, there is the possibility of calibrating the player's view by preparing for the best shot. We have the opportunity to impersonate four different types of protagonist: Jesse the athletic and agile cowboy, Chava sexy trigger-happy heroine, Corporal Jake strutting duelist in uniform and Qaletaqa free-range American Indian ready to fight for freedom! One of these characters is chosen individually, however having the possibility of using the whole team at the same time by managing the game in multiplayer mode. The first scene opens in a flat expanse that immediately makes us measure with an exhilarating chase of a steam train, the SteamBean full of enemies to hit and in which Professor Molina's famous bomb is hidden. Here you have to be alert, attentive and ready for action: the shooting is incessant for the duration of the levels, you have to hit the opponents who pop up from all sides, from the cowboy to the squire, to the walking mass of muscles, who will often try to come towards us to kill us, but you have to be clever to ensure that it doesn't happen. However, innocent people often hide among the enemies, who suffer even involuntary blows and this is precisely the challenge, trying while you are shooting, to hit only the enemies who frequently cross simple passers-by. The final score of the test is divided into categories which also include shots to the head or in a particular area and are worth more points. Western Heroes really gives us the atmosphere of the old West, thanks to its graphics but especially to the suggestive soundtracks. This is also a way to have fun in company, tackling collective playful themes not exactly on the agenda, like a very amusing shooter, which very often is not a title suitable for groups. The game flows pleasantly thanks to the help of the camera that frames the action point exactly, without making us miss any shots and to the immediate way of being able to reload the weapon with a simple inclination of the rifle lever. The story itself is fluid and simple, but still keeps us in suspense, thanks to the pitfalls that Professor Molina prepares for us at every level. The landscapes change step by step and manage to make us identify with the spirit of the game: the old saloons with the characteristic double-opening door, unpaved squares with high noon, steam trains and endless expanses. Western Heroes could be our breath of fresh air between spurs and rides to have fun in company.", "date": "2010-12-06", "grade": null}