{"name": "Lo sport su Kinect  Made in Italy", "ref": "https://multiplayer.it/recensioni/82789-motionsports-lo-sport-su-kinect-e-made-in-italy.html", "text": "The game requires Kinect for Xbox 360Ubisoft Milano protagonist in the launch lineup of the new body detection device intended for Xbox 360, that Kinect that has made so much talk about itself and which is finally available in stores together with a large group of related titles dedicated. Among these also the very Italian MotionSports, a multi-event game along the lines of Wii Sports and Kinect Sports, but with a strong personality due to two factors. The first, very important, is to offer mini-games to events based on new and never tried sports on consoles and with a deeper structure than the classic Casual games. The second, unfortunately, is that of having a decidedly difficult and not very functional control system. Ups and downs, pros and cons. Motion Sports puts six main events on the table, which are in turn divided into mini-events: Equestrian, Soccer, Hang Gliding, Skiing, Boxing and American Football. Each of them is not represented with large-scale events (full matches or championships), but is structured in quick and fast levels to be tackled in sequence, perhaps in multiplayer since almost all sports are equipped with split-screen mode to tackle a friend next to us. Once the game has started we are asked to do a quick check of the controls and the camera, after which we access the main menu where all the available events are displayed. Not all of them are selectable at the beginning, and one of the main flaws is precisely that of not making the ~unlocking~ methods of the initially obscured mini-games transparent. It is not very clear what to do, whether to reach a certain experience score, whether to complete all the others, or whether it is necessary to perform some particular action. The release is clearly linked to the increase in the player's fame, which grows after each event, but after two hours of play, it still happens to find yourself bound to the basic events. The menus and the general design are spartan, but functional to use: hand gestures are well managed by Kinect and it is very easy and fast to enter and exit the various screens (apart from loading a bit too long!). In short, what MotionSports lacks is certainly not the originality of the contents, rather the optimization of the commands and their reactivity according to the actual game. Xbox 360 goals Even the Ubisoft game puts the canonical 1000 points on the plate to unlock, through 50 objectives to be obtained in all available events. Coming to be a ~legend~ in any sport they will all be obtained without difficulty, if not the intrinsic one of the game in understanding ~how~ to do it, which passes through a good number of game sessions. A game made up of ups and downs The characteristics and functions of each sport offered vary in quality and implementation, where the latter does not mean the graphic or visual impact in general (always discreet), rather the quality of interaction with Kinect. Let's start by describing the probably most successful one: hang gliding. Thanks to a mild game rhythm, the controls respond perfectly to the solicitations of the arms and hands, the only limbs used to control the vehicle. In games that also include the lower limbs, such as football for example, some problems arise. Precisely in our quintessential Italian sport, the development team was unable to coordinate body movements, legs and feet well, and the end result is that Kinect does not perfectly detect angle and shooting accuracy. In short, the accuracy is totally ~random~. A pity because the mini-games are potentially well structured: passes, shots, penalties and saves, there is almost everything about football. As regards the execution of penalties, for example, you have to place the ball on the ground with your hands, move away from it and then kick on goal. Horse riding, contrary to what was imagined, is instead one of those events that responds better to requests. The reins are kept in front of the body, urging the horse with rapid downward movements (as one really does) and when it is time to jump, one crouches down and stretches out on one's feet, performing in fact the same movement required of any good rider in saddle. Absolutely not accused of the ~delays~ in the response reported by many, on the contrary, playing as the tutorial teaches before each race, the gameplay is very fluid and responsive (in this sport!). In a limbo between mediocrity and functionality we insert American football, a series of tests during which we are called to throw the ball to a teammate, dodge enemies of the opposing team, or tackle them in the defensive phase. In this case the problem is not given so much by the controls, quantor from the gameplay stripped down to the bone and really simplistic. It is a question, for example, of jumping or bending over at the right moment to avoid being tackled, or throwing to the right or left with some degrees of power. The simplicity and depth experienced by the ~progenitor~ Wii Sports and sought after with partial success by Kinect Sports, leaves room here for a certain banality and superficiality. The worst successful sports, however, are definitely boxing and skiing. The first suffers from a chronic lack of precision in the controls, as many blows aimed at the TV are recognized poorly, or just missed by the detection of Kinect. Often this also causes the end of the game with our carpet KO, very frustrating the fact that it doesn't depend on us. The delay in response little noticed in other mini-games here becomes more obvious and irritating. Skiing competitions, on the other hand, have already been tested with relative success by some titles that exploited the balance board on the Nintendo Wii. The problem with MotionSports, in this case, is the absolute lack of sensation of speed that this sport imposes. In order to go faster, one must literally flatten ~egg-like~, but this is only possible for a few seconds as it soon becomes tiring and too expensive, from a physical point of view. Standing up and rotating the torso will cause our virtual alter ego to turn around without picking up speed, decreeing the failure of this sport and the tendency to avoid it in the future. The outline of Motion Sports Having ascertained that every sport contained in the Ubisoft title suffers from terrible ups and downs, showing very nice things (hang gliding and horse riding) but also decidedly low playability points (football and boxing), our attention focuses on the whole that ~side dish~ that can transform a mediocre meal into something appetizing anyway. Apart from the various multiplayer modes, MotionSports is lacking precisely in terms of the completeness of the package offered, with few modes other than the classic challenges proposed, no exploitation of Xbox Live in the slightest creative way (some games even offer an integrated social networking system, nowadays), zero options. The commentary, entirely in Italian, is entrusted to our local Guido Meda, a much appreciated reporter in the world championship where his ~Rossi c'!~ they made history. His contribution, we must say, is very pleasant and gives a feeling of ~familiarity~ that only a voice that has already entered our living rooms like his can give. A few repetitions too many, a few sentences out of time, but in essence the audio sector is decidedly good. The same can be said for the graphic one, from a technical point of view very pleasant and unexpectedly performing as regards a title with a casual target such as MotionSports. Some games such as hang gliding or skiing make you appreciate decidedly good visuals and appreciable polygonal detail. The modeling of the characters and the horse is also good, very realistic and well animated. Ultimately, Motion Sports turns out to be a bet played with excellent intentions, but only partially paid off: that of an entirely Italian studio that can create a wide-ranging title. The basics are all there, both technical and as regards the ideas proposed, now the only thing missing is (so to speak) the right ability to make them more functional and fun, perhaps with a more substantial and captivating ~side dish~.", "date": "2010-12-02", "grade": "5.0"}