{"name": "Di che colore sei?", "ref": "https://multiplayer.it/recensioni/82696-wispin-di-che-colore-sei.html", "text": "The App Store is full of immediate and fun arcades, which for just 79 cents can keep you entertained for hours. Some of them have a ~survival~ type structure, i.e. they offer a ~single game~ in which the goal, often with only one life available, is to play as long as possible without being eliminated. There are numerous examples of products of this type that have achieved great success; however, the line between a well-made arcade and one that disappoints is very thin. Wispin is placed exactly at the center of this line: the action is pleasant and immediate, as per tradition for the genre, and there is a gradual increase in difficulty which leads not only to the multiplication of opponents to face, but also to their diversification . All through two modes (one ~normal~ and one based on time) and two different scenarios to unlock, with the support of Game Center for publishing your records online. Trample that passes you The game sees us control a funny character who has the chameleon-like ability to change color. This maneuver proves to be essential for eliminating the enemies, increasingly cunning and numerous, who come out of the ground to injure him. We can literally ~trample~ these creatures made of paint: to do so, just touch them with our feet. However, in fact, it is necessary to do it only after having assumed their same color, or you will end up losing part of your vital energy. Positioned at the bottom right of the touch screen we find an icon divided into three sections of blue, red and green: by touching it we can change the color and therefore look for the impact with the enemy, eliminating the waves one by one until we establish new duration. The creatures are initially very weak and submissive, but over time they are replaced by variants that are faster, more resistant or even capable of carrying different types of attacks. The useful strategy to deal with them is always the same, and the eliminations must be carried out quickly to keep the score multiplication bar charged. However, in certain cases it is possible to acquire weapons (arrows, bombs, etc.) capable of breaking the monotony of the action, as well as momentary power-ups that will almost transform us into a pinball machine capable of wiping out everything and everyone while it lasts the effect. The games are therefore revealed to be full of dynamism and speed, with ~on the fly~ color changes that allow us to crush several enemies in sequence and earn quite a few points. However, it must be said that the collision detection is not always precise, and the fact of having to impact the creatures only with the character's feet often creates some difficulties. The control system can work both via the accelerometer and exclusively via the touch screen, in this case via the appearance of a virtual stick. Unfortunately, the first solution does not prove to be precise and rapid enough to allow us to perform up to expectations: the character responds relatively slowly to the inclination of the device, and therefore lacks the speed necessary to perform the best combos. On the other hand, the controls via virtual stick perform their task quite effectively. The technical realization is good: both the main character and the various creatures are characterized by a pleasant design, and move convincingly. Too bad for the presence of only two scenarios, which make the experience visually monotonous. The tested version is 1.0 Price: 0.79 App Store links", "date": "2010-12-02", "grade": "7.3"}