{"name": "Solar Ash", "ref": "https://multiplayer.it/recensioni/solar-ash-recensione.html", "text": "That video games are an exceptionally competitive universe is well known and the constant battle between blockbusters for the top of the charts is a phenomenon that anyone can observe without effort. However, it is a mistake to think that this form of competition is typical only of the big development houses: independent developers are often as competitive as the most impressive software houses. Indeed, in a field where talent and ideas practically always outclass any other aspect in importance, the challenge is even bloodier, because only truly brilliant creators manage to stand out (and sometimes not even genius is a guarantee of success). The battle even involves those teams that ~made it~, winning the headlines with at least one valuable video game. In that case, however, the scope of the challenge shifts and from an open war against the other studios we move on to a constant struggle with ourselves to overcome what has been done in the past. Initially one could think of a natural evolution: a team full of minds acute shouldn't have any problem churning out games that are increasingly deserving of the public's attention, yet it is enough to analyze the history of many software houses to realize that they are often more those with a tendency to run aground than those capable of reaching ever higher peaks at there Supergiant Games. Studio that, to understand each other, still wobbled slightly with Pyre before exploding again with the fantastic Hades. Specifically, the independent software house we are dealing with today is Heart Machine: initially a team made up of only five developers who, after the excellent Hyperlight Drifter, decided to take the next step by creating a three-dimensional title called Solar Ash. give shape to a game supported by a much more advanced technical sector than the past work, the Heart Machines have increased fivefold and today we can finally try their new creature. Have they managed to grow enough, or is Solar Ash their first big misstep? Let's find out in the Solar Ash review. Story: the gang of the hole Solar Ash: Mushrooms in a Black Hole? Here you can The protagonist of the game is Rei, a Voidrunner (the Italian translation is ~relay of the void~, but being rather atrocious we prefer the original term), committed to saving her planet of origin from a mysterious and gigantic black hole called Ultravuoto which has already consumed various worlds in its journey. However, this frightening phenomenon is not limited to destroying everything it encounters: it seems to ~incorporate~ part of the consumed worlds, and thus evolve a sort of internal ecosystem. In this eccentric ~corner of the universe~, Rei has the mission to activate the Starseed: a powerful mechanism so full of energy that it can stop the advance of the Ultra Vacuum. Too bad that the Voidrunner team with which he undertook the task no longer responds to communications, that the only artificial intelligence capable of making everything work is malfunctioning and that there is absolutely no lack of dangers in the Ultra vacuum. Given the premise, it is not surprising that Solar Ash is predominantly an exploratory game, yet it is not the case to expect a slow adventure designed to promote meditation. Among the inspirations of the founder of Heart Machine, Alx Preston, in fact there are various three-dimensional Mario, Shadow of the Colossus and Jet Set Radio. And mentioning games of this kind often in the indie field might seem like the ravings of a madman, but Preston doesn't seem to have taken them as an example with the ingenuity typical of other developers: he remade them with the desire to create a video game with an intuitive and finely calculated, capable both of gently accompanying the player's progression and of putting it in constant difficulty with ever new challenges. Gameplay: skate against the clock Solar Ash: the Ultra Vacuum in all its glory The mechanics that support Solar Ash, given the underlying philosophy, are immediately understandable and well applied. To all intents and purposes, the game is a platformer in which the protagonist can skate on the ground with great speed, use a grappling hook, make sudden shots and take advantage of various interactive elements of the landscape to perform more complex maneuvers. The combat is not particularly more complicated, and boils down to the possibility of slowing down time and launching some energy slash. The fact that the underlying system is so basic does not mean, however, that its components are not well-developed. The movement is in fact rapid and controllable with great precision, and the limited variety of maneuvers is counterbalanced by an often very cunning use of the maps and by fairly busy puzzlesvi during progress. The world of Solar Ash is indeed varied to say the least, with numerous locations that are distinguished not only by their appearance, but also by their environmental characteristics. You will therefore encounter clusters of clouds full of ruins and attack points that can only be reached with your own grappling hook, seas of acid in which Rei can only stop for a limited time, areas full of spores that can be used to obtain solid bars on which to ~grind~, and so on Like this. Solar Ash: Certain maps are full of ruined buildings The real star of the campaign, however, are huge creatures called Vestiges, which are activated by destroying mounds of slime scattered across the maps and then eliminated in spectacular clashes reminiscent of a ~turbo~ version of Shadow of the Colossus' climbs. In practice, once these enormous beasts have been set in motion, you will find yourself running several times on their bodies destroying mobile targets similar to those eliminated in the muds just mentioned, in a race against time before their body becomes incandescent and suddenly sends you back to the nearest checkpoint. The idea, in all honesty, is excellent: these circuits are challenging and fun to ride and the game mechanics are clearly designed to make them phases similar to those of a rhythm game, where directional control is limited but the instinctive understanding of the position of each target and memorization of the path fundamental. The controls themselves are clearly meant to foster a near-automated experience - Rei's movement is partially driven by some kind of slight magnetism which makes it easier to hold on to platforms when sprinting and leaping and even attacks have huge range and tendency to hit the closest target effortlessly. However, do not believe for a moment that the title is a walk in the park. Structure: an interrupted flow Solar Ash: An old image of Echo. His appearance is now different In fact, when we talked about an ~almost~ automated experience, the emphasis was on the adverb. Solar Ash takes the player by the hand during every gesture trying to direct him here and there, but he has no qualms when it's time to slap him badly at every tiny input error. If understanding what to do during the campaign is therefore rather immediate, the same cannot be said for completing all the protagonist's objectives: as already explained, the black hole in which Rei finds herself is full of environmental puzzles and phases complex platformers that require ingenuity and precision, where the ~paths~ on the body of each boss are crystal clear, but an extremely fiscal timer brings the tension to the maximum during each of these phases and a millimeter movement in the wrong direction is enough, a badly calculated leap , or a slash launched a few moments before due to have to start all over again. Here we believe we can make a small criticism of the gameplay, given that the fulcrum of the clashes is based, precisely, on repetition. Initially the challenge seems to be all in the user's ability to have quick reflexes, but from death to death it turns into remembering where and why an objective will appear after destroying the previous one. The fact of having to retrace each route from scratch every time is not necessarily the most elegant of design solutions, even if the deaths are not particularly punitive and it takes little to recover the lost position. The three very similar phases to each boss then don't help. Furthermore, speaking of design, there are other less marginal problems compared to the successful structure of the giants. Solar Ash: some areas are poorly lit, but always full of atmosphere When the game works, after all, it does so beautifully, and the fluidity with which Rei skates from place to place is almost hypnotic: a perfect current from platform to platform as you take in the scenery and the natural unfolding of the its secrets. Sometimes, however, the flow undergoes sharp interruptions (and not necessarily calculated to force the player to stop and breathe). The cause is usually to be found in indirect passages towards the indicated objectives that are all too hidden, or in deliberately inflated paths to give the player a sort of sense of estrangement (amplified by the already too alien nature of the Ultra-Vacuum). Even the enemies scattered across the maps - outside of a few occasions where their presence represents the primary obstacle - tend to be little more than a nuisance to be eliminated quickly, which only really becomes worrisome when Rei runs out of shield charges and with each death the dangers respawn in full. Let it be clear, our criticisms are not meant to belittleand what the team did: we loved the gameplay of the game and found the map design brilliant most of the time; we are only sorry to see some inelegant solutions and some jolts in a work that is still very pleasant to play. Technical sector, and narrative: Wonders for the eyes, but not for the palate Solar Ash: Ultra Void is not uninhabited. And sometimes even the dead speak There is no criticism that holds instead with regard to the technical sector and the art direction of the game. While on the one hand Solar Ash boasts an extremely stylized look, often excessively exploited by indie productions to hide the scarce production values, here its use is so masterful that it does not make the game seem like a minor title even for an instant. The Ultra-empty is extraordinarily rich and fascinating, and its various biomes are extremely varied despite the very limited color palette of the game being rather limited; the animations of the protagonist are always excellent, and the general direction of the game often manages to surprise for the beauty of the glance offered. We also tried the title on PS5, where the frame rate was granite without the slightest bump, and we found no bugs of any kind. Perhaps we were particularly lucky on this last aspect, but the performances seemed to us to say the least excellent. There is only one really negative aspect of the production, and that is the narrative. Although the Ultra Vacuum contains various fascinating characters and the maps are scattered not only various documents that outline its nature, but also recordings of the Voidrunners necessary to fully understand the unfolding of events, the common thread that binds everything is weak to say the least . The motivation? Twists and turns so obvious that they can be understood in the very first minutes, and the attempt to touch on rather profound themes with dialogues that are most often empty and banalotti. Sadly the Italian localization doesn't help, with multiple translation errors and poor overall care. Too bad, because Heart Machine's work also had potential in this last aspect.", "date": "2021-12-02", "grade": "8.0"}