{"name": "Il gatto e il topo", "ref": "https://multiplayer.it/recensioni/82701-chuchu-rocket-il-gatto-e-il-topo.html", "text": "There is no doubt that the Dreamcast has remained in the hearts of many video game enthusiasts, and one of the reasons why it is still remembered with great affection is its ability to innovate. In the case of ChuChu Rocket!, released ten years ago, we saw one of the first console titles with an online multiplayer mode. Thus, despite the poor quality of internet connections of the time, players could challenge each other with the aim of scoring more points than their opponent, using mechanisms that are still very current today. The conversion of this particular puzzle game for iPhone and iPod Touch took a while, but now it is ready to take its rightful place within the rich offer of SEGA titles present on the App Store, and from gamers of the ~old guard~ we can only be happy about it. Only a couple of elements perplex us: firstly, we are dealing with a ten-year-old product that has not been updated in any way, neither from the point of view of design nor from that of gameplay; secondly, the much vaunted online multiplayer that made the original version of ChuChu Rocket unique! has mysteriously been phased out and replaced by a simple four-person local competitive mode. Space mice In ChuChu Rocket! we have a pack of mice (ChuChu) who, in each of the twenty-five stages available, must embark on a space rocket and escape from a planet evidently inhabited by huge ravenous cats. For those unfamiliar with the SEGA puzzle game, it is a title fundamentally based on ~trial & error~, equipped with a button to start the action and one to reset it, so that you can observe the movement of the characters to decide what operations to perform. Once ~start~ has been pressed, the aforementioned mice come out of their holes and begin to move within the scenario, always turning right when they encounter an obstacle. What we can do to allow him to get on the rockets (positioned in a random area of the screen) is to place ~mandatory directions~ which will break the normal path of the animals to make him take a decisive detour. The number of ~signs~ at our disposal is limited, however, so there will be only a few solutions to the problem that we will be called upon to solve from time to time. The ~mandatory directions~ also influence the movement of the cats, and in certain cases we will have to use them in this way to prevent them from coming into contact with the ChuChu: losing a single mouse implies game over. The map is divided into square boxes, so it is not difficult to understand what the paths of the characters are, unless the obstacles present are not so abundant as to make everything difficult to ~read~. Unlike the original Dreamcast version, in which you had to use the controller to select the box in which to place a ~mandatory direction~, on the iPhone you just need to touch the affected area with your finger and ~slide~ in the direction in which you want the mice ( or cats) move. A much simpler and more immediate control system, therefore, but the bitterness remains for the lack of online multiplayer mode: the local alternative is very fun and moreover can also be played alone against the AI, but it is clearly not the same thing. As for the technical realization, the weight of time is felt especially with regard to the design of the characters. The tested version is 1.0.1 Price: 3.99 App Store links", "date": "2010-11-29", "grade": "6.8"}