{"name": "Schiacciate d'altri tempi", "ref": "https://multiplayer.it/recensioni/82669-nba-jam-schiacciate-daltri-tempi.html", "text": "Tested version: Xbox 360Okay, nobody cares about verbose ~historical~ introductions, but here you really can't avoid doing it because nostalgia is a basic ingredient of NBA Jam, a game that comes back with arrogance from the colorful years of 16-bit shouting ~Boom shaka-laka!~ in the face of today's modern and serious sports simulations. It was nearly the mid 90's when the almost perfect conversion from the arcade Midway arrived on Super NES and Megadrive, enthralling everyone with its irresistible hyperbolic approach to the world of basketball. A title that prompted the purchase of the multi-tap to play in four, bodies squeezed around a 14-inch Mivar, comrades/opponents easily within reach of insults and blisters on the hands due to the intensive use of the not too ergonomic pads of the era. After such glories, it is strange how the series has remained shelved for all these years, even if it clearly falls within the crisis that has affected many arcade titles from the advent of 3D to today. It took the direct initiative of the original creator Mark Turmell, who in the meantime moved to Electronic Arts, to give a new chance to a game that inexplicably didn't seem to want to fall within the usual mechanisms of an easy and sure-impact revival, thus managing to increase the expectation over the years. More than 15 years later, the opportunity has not been wasted: the new NBA Jam is an excellent transposition of the original spirit in a modern key, indeed it is an update both of the concept and of the same gameplay of the time, which remained practically unchanged with the addition of a few extra modes and - fundamental introduction - the application of online multiplayer which gives the game continuous and easy to access lifeblood. He's on Fire! NBA Jam represents a very particular approach to basketball, to tell the truth with very few points of contact with the sport itself, apart from having to throw the ball inside a basket and some other basic rules. The matches take place in rather faithful reproductions of real fields, but the teams, to begin with, are made up of only two elements intent on fighting with a ardor that is hardly allowed in a regular match. The aim is always to win a game made up of four halves (of variable duration and of your choice) with the traditional scoring system assigned to baskets, i.e. 2 or 3 points depending on the distance from which you shoot, but apart from this, the the need to conclude an attacking action in 24 seconds, the impossibility of blocking the ball and continuing to move (the ~steps~) and goal tending (blocking the ball on a downward flight towards the basket), all means are lawful to achieve victory. The result is a spectacular and extremely exaggerated interpretation of basketball, in which players are able to make absurd dunks that defy the laws of physics, leaping from virtually any position as they step just inside the two-point box, as well as a shooting capacity which, depending on the characteristics of the player, is rather increased compared to reality. As if that weren't enough, with a button it is possible to activate the ~turbo~ (linked to a bar that runs out and recharges) which increases the speed of the characters exponentially, while the lack of any behavioral rule imposes the use of pushes and elbow strikes as standard defensive and offensive maneuvers, in an attempt to intercept or protect the ball. There is even an ~on fire~ mode that is triggered when the same player scores three consecutive baskets, which increases his speed and accuracy when shooting, making the ball flaming in his hands. So let's forget about a realistic reproduction of the sport in question, because beyond the official licenses on teams and players (whose characteristics are moreover reproduced quite faithfully both in the faces and in the typical assessments of the fundamentals) the gaming experience is something completely different . It is an old-fashioned arcade, which sacrifices depth in favor of the immediacy and frenzy of the action, abandoning any strategy by focusing on the speed of execution and quick reflexes, becoming almost a fighting game in the continuous physical fight in search of the possession of the ball up to the cathartic resolution of the actions in the impossible dunks accompanied by the classic ecstatic comments of the exalted commentator. New possibilities Beyond the new graphics, the fundamental contribution given by this new version to the classic structure of NBA Jam is certainly the introduction of multiplayeronline, which allows you to always make the most of the game, considering that the single-player experience does not represent lasting enough fun, lowering the level of challenge and lacking that unpredictability and additional emotion given by the presence of human companions and opponents. The game modes are not very many and, after an initial period of guaranteed enthusiasm, longevity is probably the biggest sore point of this product, being its extremely simple and not very articulated structure, based on immediate fun, however commendable improvements have been applied additions. There is the classic career which essentially proposes several challenges in sequence for each division of the NBA, culminating each with a challenge against the ~boss~, represented by a historic pairing of the American baseket which will become, if beaten, then usable by the player . The ~Remix Tour~ instead presents a set of all the various mini-games included in this new version: ~Smash~, for example, looks like a normal game but the aim is to destroy the opponent's basket with dunks before the others , ~Elimination~ is a competition for points in which whoever has the lowest score is gradually eliminated, ~Domination~ requires us to take control of various areas of the field by scoring from pre-established positions in order to multiply the score and so on in a series of variations on the theme which, especially played in multiplayer, offer a good diversion from the main action. The situation in which NBA Jam is most enjoyable is therefore the possibility of playing with friends, possibly, in order to recreate the original atmosphere that characterized the arcade and 16-bit console version, although the single mode is present on its side, in each case, the push offered by the possibility of unlocking a large number of players and secret options, also in line with the progenitor in this case. Xbox 360 goals NBA Jam curiously contains a double system of objectives, between the standard Xbox 360 and the specific one of the ~challenges~ of the game, which do not always overlap precisely (indeed, almost never). The actual achievements are much rarer than the challenges within the game, being only 26 compared to the usual 1000 points, a rather small number compared to the current norm. As in any sportsman, a large part of the objectives is linked to particular performances to be achieved on the pitch, while another part is unlocked by progressing between career and Remix Tour. Ode to the pixel Stylistically, an excellent job has been done in EA Canada to try to bring the original spirit back within the modern gaming context. Instead of messing around with the polygons looking for a linear evolution of the original graphics in line with today's standards, a particular vision was chosen with the players apparently crushed on two dimensions and a caricatured use of digitized elements that somewhat recalls the solutions adopted from South Park. In fact, the heads, taken directly from real images, seem glued to the bodies, giving a ~mannequin~ effect amplified by the more or less unnatural movements, giving a truly hilarious effect. It's a game with few pretensions from a technical point of view, but which has managed to make simplicity a real strength, thanks to excellent planning from a stylistic point of view. It must be said that it is a title that would seem to fit perfectly in the digital delivery sector, both for the not excessive technological ~weight~ and for its very arcade essence, whose spirit seems to make it more suitable (and initially it seemed that this was also the case in the publisher's plans) as a downloadable product than as a full-price retail and this puts us in a different perspective also in the evaluation of the game. In any case, there is an underlying compactness and coherence in this project that is not common to find, especially since it is a remake which, as such, finds itself mediating between the old and the new, understood as technologies, concepts and public. From this point of view, the work done by EA has been truly commendable, finding the happy medium between fidelity to the original spirit and openness to the modern. The audio sector is also noteworthy, both as regards the ~electro-funk~ style soundtrack also derived from the original and for the characteristic and inevitable commentator who dusts off the old repertoire of famous exclamations, which have now become part of the ~ popular video game culture.", "date": "2010-11-26", "grade": "8.0"}