{"name": "Lavoro di coppia", "ref": "https://multiplayer.it/recensioni/82563-majin-and-the-forsaken-kingdom-lavoro-di-coppia.html", "text": "Version tested: PlayStation 3Extremely eclectic and independent, Game Republic has produced very different titles with mixed success on many platforms, both on nextgen consoles and on laptops. Alternating between not very successful genre productions such as the Clash of the Titans tie-in and personal projects of much different thickness such as Folklore, the Japanese software house this time brings Majin and the Forsaken Kingdom to the shops, a sort of interesting hybrid between platform, puzzle game and action adventure, which takes us to the parts of the very recent Enslaved, all stylistically very close to Ico. The story underlying the events of the two protagonists, narrates the journey of the thief (later hero) Tepeu together with the Majin, a mythical creature with great powers, awakened from its centennial sleep in what was once a prosperous and luxuriant kingdom, but which now it is invaded by Darkness, a black and viscous liquid that has made the different regions of the world inhospitable and deadly. Tepeu, together with his friend will therefore have to embark on an unexpected mission, to make the Majin regain his powers to go to the origins of Darkness for the rebirth of life in his country. In between, dozens of environmental puzzles to solve and gigantic bosses for more than twenty hours of gameplay. Friends for life The heart of the game is the relationship between the two, which is not limited to fighting alone, but which finds the distinctive element of the Game Republic project in the puzzle/platform phases. The kingdom is in fact a huge environmental puzzle to be explored following a certain order but still with a lot of freedom, where the powers to be acquired and the upgrades for them are all linked to the solution of puzzles in which to exploit the Majin's abilities. Our ~big puppy~ at the beginning can only count on the strength of his fists, but as he progresses in the game he will be able to exploit the power of wind, electricity, fire and crystals. Very cleverly, the developers have created a world in which the various bonuses and skill upgrades scattered around the map are not all immediately reachable, but at the cost of heavy backtracking sessions, can only be achieved after acquiring a certain power. These bonuses are then decidedly necessary because they amplify the powers of the Majin, making the numerous fights shorter, which is decidedly welcome because in our long wanderings through the huge world we are witnessing a heavy phenomenon of respawn of the opponents, which also seems to follow rules all his own, but which can be really annoying in the long run. The fights are therefore the cross and delight of the game: our two heroes gain experience after knocking out their opponents, and this leads to an increase in their stats and an increase in the level of friendship which is directly proportional to the amount of damage inflicted by the combos ~finals~ that the two can achieve together. The more you fight, the more you level up so, the more you level up, the more life and strength you gain. A sort of necessary vicious circle in which one is forced to fight ~infinitely~, both because one often retraces one's steps in order to be able to take that fruit which guarantees us an enhancement of one's powers, but also and above all for the pure spirit of exploration or because we are not clear where we have to go and what we have to do. Furthermore, always in terms of hero customization, the game world is littered with chests (in addition to those full of experience stones) which hide parts of clothing that give us bonuses to strength, health, our athletic skills and so on. A world to solve This then brings us to the puzzles. It's not just about looking for a key to open a door or moving a chest, on the contrary, many elements are brought into play. Before examining the strong point of the title, it is necessary to explain how the two protagonists interact with the world. The control method is really immediate and does not force us to memorize long key sequences to fight and command the Majin. Tepeu, the hero does not boast a particularly large set of attacks, in fact a simple button mashing complete with a one-button quick time event, while our partner fights completely automatically if we are in danger. The Majin does not need to be sent to a place, it can follow us or wait for us, the only way to make it go to a specific place is to make it interact with a particular object present. Simply push R2 and square to activate a mechanism or attack someone, or use triangle and X for movement, while to use powers on enemies, use R1 in combo with the front keys. Really easy and immediate and without detailsimplementation problems, obviously the timing for the actions must be the right one: each power needs a few seconds of ~evocation~ to be launched, therefore be careful of enemy attacks and only in very rare cases have we encountered pathfinding problems for our partner. The variety of situations that we will face is really high, Majin and the Forsaken Kingdom does not do the homework in this sense, it does not make us arrive in an empty arena where we can put the pieces of the puzzle back together in peace, but it mixes fights and dizzying stages in ease platform, all in function of understanding how to take that fruit or to operate the door unlocker. The only note that can be adduced to this setting is that the various puzzles are linked to the newly acquired power and they never see us use the various skills together, in short, they are used in watertight compartments, something this is very evident in the interesting boss fights that are they defeat using one, and only one of the powers. However, the situations are varied. We use the wind to move cabins and suspended barrels, or to daze our enemies; electric current, in addition to being devastating in combat, is necessary to put doors and gates into operation, which is often made difficult by having to create real circuits with small conductors; the fire, once inhaled, burns the enemies, can trigger bombs or set fire to particular explosive cases; the crystals, well as the word says, crystallize the enemies giving way to a real final move or allow us to reach inaccessible areas by (temporarily) clearing the Darkness. Easy to master The feeling is that the game mechanics work really well, and that the various puzzles aren't too bizarre even if to be honest the game is really sparing in showing us all the elements and skills available and often, as in graphic adventures, we we will find ourselves probing the area by pushing the key combination responsible for interacting with the environment to understand which objects can be used. To make things easier, fluttering butterflies or geckos indicate ~points of interest~ but it also happened to solve a puzzle using an ability we didn't know we had and this is decidedly specious and not very ~honest~ towards the player . Honest or not, what matters is that overcoming the various puzzles is really rewarding, especially after furious fights and several minutes in which our brains have been put to the test, and in this perspective the feeling of ~exhaustion~ after a nice trip backwards, perhaps only partially mitigated by the teleportation, is completely canceled by being able to finally grab a bonus fruit that we had eyed ten hours of play before. The focus of the title is therefore clear: the resolution of the puzzles by exploiting the coordination of the two is the pivot on which all the components of the title rotate. In this sense, the fights are the weakest part of the Game Republic production. This does not mean that they are deficient, but it is noted that, despite their variety, they are subdued compared to the complexity of the exploratory / platform part. However, applause goes to the diversification of the opponents. Some enemies are vulnerable to only one spell, there are real mid bosses to hit in one place, others to kill silently, mages who respawn their acolytes to crash first and others that see us use our stealth skills to an instant kill and arenas in which the environmental puzzle dynamics are the basis of the resolution of the battles by acting on various elements of the scenario by activating traps and much more. However, zero combos, simple dodging and a lot of button mashing, this is the stylistic code of the action moments of Majin and the Forsaken Kingdom, then spread on backtracking and respawn. In short, in the long run they could become a nuisance, we would say mandatory, given that the level advancement of the two protagonists is highly recommended. Playstation 3 trophies Majin and the Forsaken Kingdom rewards the player with forty-two trophies. Among these, many are secret, the others refer not so much to the progression in the game, but to the variety of situations encountered. So here are the trophies related to killings with traps or those in stealth mode, how much we have ~leveled~ Tepeu or the Majin, how many times we have been saved by our partner, how many orders we have given or costumes we have found and so on. The Darkness Another thing that we didn't like much is the inhomogeneity of the difficulty level. The game when it comes to beating hands is not particularly difficult and also the bosses, except for the second one, the ~electric~ one toofrustratingly, they run smoothly despite their complexity and only towards the end, when you are close to the source of Darkness, does the difficulty skyrocket almost suddenly. This is a strange choice because if for three quarters of the game the actual combat phases are almost ~a necessary evil~, perhaps long but never too demanding (provided you can involve the Majin), actually going hand in hand with our level, in the last moments they become absolute protagonists and bring to light the limits of the combat system which enters a crisis when too many enemies are upon us, with our partner who is not as reactive as he should be, and who risks succumbing under the hails of blows from opponents who lock him in a corner. From a technical point of view, the work done by Game Republic is certainly valid, but it certainly cannot be taken as a touchstone for textures, lighting and modeling. Majin and the Forsaken Kingdom does not surprise for its special effects, and looking at it casually we cannot fail to notice a little exuberant and not too lively impact, but where the game wins its bet is in the stylistic field, and obviously in the level design, which gives us puzzles and really well done puzzles. The enemies, whether they are simple soldiers, dogs with an overdeveloped nose or gigantic bosses are all equipped with a very valuable, rather original character design, with the black Darkness that covers them that seems to bubble and move above them. The same can be said with the protagonist Majin, a sort of cross between a troll and a bear, more tender than dangerous, very powerful but clumsy (when he stumbles for the fiftieth time you want to shoot him...), with the voice of the same dubber of Marrabbio from Kiss me Licia, or from Jeremy Clarkson from Top Gear, who in addition to performing improbable flying attacks, with the progression of the game will gain more and more vegetation on his back, ending up with a small forest complete with trees like horns on the head.", "date": "2010-11-23", "grade": "8.2"}