{"name": "Ancora una partita", "ref": "https://multiplayer.it/recensioni/82540-pro-evolution-soccer-2011-pes-2011-ancora-una-partita.html", "text": "At the beginning of the review we can only run into a rather annoying practice, but sadly necessary in this case: the glorification of the past. Watching the growth of Winning Eleven, which over the years would be known in Europe as PES, was a unique experience: first of all because it was the first truly simulative football game - so much so that we realized how arcade ISS was, previous point of reference, only with his arrival - secondly because every year Konami published (at least) a new episode full of news and updates, getting ever closer to the perfect football simulation. Over time the process has weakened, with editions increasingly similar to the previous ones and Konami unable to exploit the potential of Xbox360 and PS3, so much so that in recent years FIFA - in a completely unpredictable way - has overtaken PES under any point of view. From 2000 to 2007 (approximately), every year the series climbed one step, delighting football fans from all over the world: it is above all this constant evolution that we miss. Playmaker We wrote that FIFA recently overtook PES; however it surpassed it on Xbox360 and PS3, with what we could consider the ~mainstream~ version of the game. On the Wii, however, the story is different: the Nintendo console has generated a sort of parallel dimension, to which every company has had to - forcibly - adapt, given the technological limits and, at the same time, the innovative possibilities guaranteed by the Wiimote. EA has failed, despite the efforts and countless attempts, to reconcile FIFA with the Wii; Konami, on the contrary, met with a resounding critical success (and, with the first episode, also had a decent economic return). Although based on the PS2 version - with all the (large, even from a Wii perspective) constraints of the case - the Japanese company has managed to give life to the most original football game of recent years: the big news of this ~spin-off~ lies in the possibility of controlling a large part of the team in real time, rather than a single player. PES Wii, abstracting the playful mechanics from the football context for a moment, presents itself as a successful mix between an RTS and, of course, a classic football game. With the analog stick you manage the player in possession of the ball, with the Wiimote pointer your teammates, in order to articulate the offensive/defensive maneuver in its entirety: you can make overlaps, select markings, call offside, double and much more , much more. Konami then found a clever way to use the Wiimote in a soccer game, and it wasn't easy; his use of it has deepened the mechanics of PES, but has not simplified them. The general complexity of the work, which takes a long time to understand, has prevented the series from taking off: if an occasional player tries PES Wii for a few minutes, he will hardly have the desire to go back to it - and this, beyond the commercial issues, has made and still makes it difficult to appreciate the game in multiplayer, at least offline. Equal to itself Another reason why this PES failed to enter the hearts of football fans, most likely, is the ~point of view~. Regardless of the higher or lower quality compared to traditional simulations, there is no doubt that the feeling of playing football in the Wii title is less strong: it is true, you also control the ball carrier, but the core of the game is having clear the overall trend of the action, which can be manipulated and directed ~from above~, an aspect - as we said before - which makes it in some ways more similar to an RTS than a football game. At the same time, the sporting context distances most of the ~hardcore~ players, who perhaps could have appreciated these mechanics (while not liking the setting). In addition to the commercial implications, the anomalous point of view also influences the nature of the actions in the field, which, compared to reality, having the possibility of observing - and maneuvering - everything from above, are more elaborate and reasoned; in short, it is not impossible to see teams playing as if they had Xabi and Iniesta in midfield. Also for this reason, from the 2009 edition onwards, Konami has inserted the ~traditional mode~ - which is substantially identical to that of the PS2 version - but it is only with this episode, PES 2011, that it is finally possible to clash using the two different control systems (previously either both players used the new one, or both the old one). Although these comparisons - at least online - are infrequent, the mechanics are iThey cross each other better than one might have expected: the resulting game is rather balanced, and in general it is the strongest/luckiest who wins, without the control affecting the challenge too much. Of course, the two methods, placed in direct comparison, reveal each other's limits: penetrating the defense of others, as well as dribbling, is much simpler and more immediate with traditional commands, while making the ball go round (in the offensive phase) and organizing goals (defensively) is easier with pointer controls. This modality is the most important novelty of the 2011 edition; for the rest, these are small additions, both from the point of view of the options (Copa Libertadores, multiplayer also in tournaments), and from that of the interaction, which has been further improved compared to the predecessor. Even at a technical level, over three years - and four episodes - the changes have inevitably been marginal: Konami has all the justifications for the case (hardware in primis) the fact remains that looking at a PES (visually) almost identical to that of about ten years ago is not very gratifying.", "date": "2010-11-23", "grade": "7.8"}