{"name": "Boom Boom Boom Boom", "ref": "https://multiplayer.it/recensioni/82554-mafia-ii-joes-adventures-boom-boom-boom-boom.html", "text": "Tested version: PCThe review of the last additional content for Mafia II began with a heated tirade against the very logic of paid DLCs, especially when this comes at not exactly indifferent costs such as around ten euros, to be paid to take advantage of features which until a couple of years ago would have been included in the boxed version. The rating at the time, relatively low, also paid the price for this cost while introducing into the gameplay of Mafia II all those free roaming components that were missing in the main story and finally presenting a deeper character than a blow-up doll. With Joe's Adventures we are again faced with a DLC, and again the fundamental question is: are the adventures of Vito's snack buddy worth 10 euros (or 800 Microsoft Points)? Again yes, but with the usual reservations. I'm gonna shoot you right down As anticipated in the news and videos of the previous days, Mafia II: Joes's Adventures shows players what happened to Vito's inseparable friend while he was in prison, in order to justify his luck and above all trying to untie the most hidden knots of the plot original. In fact, the additional content turns out to be the ideal meeting point between the excessive linearity of Mafia II and the totally free free roaming of Jimmy's Vendetta, presenting both a good plot complete with cutscenes, and an open structure with a series of challenges and missions unrelated to the main story, to which to add a large cast of characters on which the protagonist Joe Barbaro stands out for his exuberance and sympathy. After a first level with prologue functions, in which among other things we will be able to admire the city covered by a blanket of snow again during the freezing winter of 1945, the possibility will open up to move freely through the streets of Empire Bay in the years ' 50, facing numerous secondary missions until ~activating~ a new slot in the main storyline which, once completed, will in turn give access to new minor adventures. As in Jimmy's Vendetta there will be unlockable objectives and a complete count of the points scored for each mission, depending on the number of enemies killed, kilometers traveled at high speed or by performing reckless maneuvers, without forgetting the time limit, an almost constant presence in the adventures of Joe but, fortunately, more than enough to complete them without risking failing some task a stone's throw from the goal with the very annoying wording ~too slow~ or ~the target managed to escape~. Right over your feet Speaking of the gameplay of Joe's Adventures, it is pleasant to observe how there has been a good attempt to give as much variety as possible to Joe's outings, reintroducing the fistfights and stealth sessions that have almost disappeared from Jimmy's Vendetta and increasing the number of chases, whether they are on foot or by car, and adding a discreet variety to the objectives without removing the action which, as per tradition, is always present and adrenaline-filled at the right point, with among other things a greater involvement of the police in the clashes. All of this is underlined by continuous, irreverent comments from the good Joe, adding, among other things, that pinch of parodic irony that has always distinguished the character. Unfortunately, the two major defects of the original game remain, which then dragged on for both DLCs: first of all, despite the variety of objectives, the missions remain very linear, either due to the time limit which forces you to follow the shortest routes, or due to improbable insurmountable limits in the playing area, an aspect that is felt more than in Jimmy's Vendetta. The second, unsolvable problem remains the Artificial Intelligence of the adversaries and in particular of the police forces in charge of patrolling the metropolitan area of Empire Bay: if it is true that during a shooting the enemies try to keep themselves covered and avoid doing as a target while reloading weapons, it is also true that each character follows scripts in their own right, without being able to conceive a real group strategy. There is therefore no shortage of enemies who ignore their companions falling or who do not notice that they have good Joe (who is not really a twig) walking behind them, ready to knock them down with a well-placed blow or to push them into the icy waters of the bay. Sometimes the opposite happens, i.e. that the adversaries inexplicably feel the presence of the protagonist, screwing up the entire attack plan, an eventuality often subject more to predefined scripts (if I'm in point A they don't see me in point B, yes, so I have to force to pass through A) than to the skill of the player.Usual pitiful veil on patrol officers, who can witness murders and shootings, or catch players in the act in front of a still fresh corpse or inside a room that has just been robbed without having any reaction, and, in the rare cases where should the manhunt ensue, it is always enough to turn a corner or keep the accelerator pushed to lose any pursuers. To solve a minimum of these now more than well-known problems it is advisable to set the difficulty on the maximum level, so that at least the firefights give the player a fair amount of challenge, even knowing that the number and not the cunning remain to make the difference of the enemies (at least the armament), in order to increase the longevity, which still settles on 10 hours of play. In terms of graphics and sound, there are no news worthy of mention, having remained the same as the base game, to report the complete Italian dubbing with the same cast as the original story.", "date": "2010-11-23", "grade": "7.5"}