{"name": "Un porcospino tridimensionale", "ref": "https://multiplayer.it/recensioni/82000-sonic-adventure-un-porcospino-tridimensionale.html", "text": "Version tested: PlayStation 3Sonic Adventure was one of the flagship titles of the never forgotten Dreamcast, the unfortunate and unfortunately underrated SEGA console. Indeed, to be honest, it was also one of the best, if not probably the best according to most, of the three-dimensional titles dedicated to the popular blue hedgehog. At least until the recent Sonic Colors for Nintendo Wii. Precisely because of what has been written, the Japanese software house has decided to re-propose it, like its other successful titles from the 90s, in high definition for PlayStation 3 and Xbox 360 users through their respective online services. However, let's say immediately that this Sonic Adventure is a mere porting from Dreamcast, so we shouldn't expect who knows what improvements in terms of playability or graphics: the game is as it was conceived over ten years ago, no more, no less, with all its strengths and weaknesses. Starting with a fun gameplay but sometimes battered by a dancer and non-optimal camera in the position that creates too many problems especially during the more chaotic phases of the game. If anything, the novelties must be sought elsewhere, as we will see later. The plot is, as tradition dictates for most genre products, rather simple, and serves as a pretext to justify the actions performed by the protagonists as well as the presence of certain scenarios. In summary: in a distant era seven powerful Chaos Emeralds ensured the planet an inexhaustible source of energy and well-being, but since they also aroused the interest of unscrupulous individuals eager for power, a tribe of echidnas, the ancestors of Knuckles , the guardian of Angel Island, decided to create an eighth of green color, the strongest, able to limit or even cancel the strength of the others. Dear old Sonic Along with this emerald called the Master Emerald also came a guardian spirit. Who, following the attempt of a certain Pachamac to steal all the artifacts, an event which then resulted in the total destruction of seven of them and of the sanctuary where they were kept, enraged disappeared into thin air. And from that moment he was called Chaos, the God of Destruction, in reference to the stone he guarded. Centuries later, aboard his deadly flying fortress, the Egg Carrier, the evil Doctor Robotnik (Eggman) finds and destroys the Master Emerald, freeing the terrible Chaos. Dr. Robotnik's goal is to control the latter, and use his destructive power to find and subjugate the other seven magical objects to conquer the city of Station Square. But that didn't count on Sonic and his friends, led by an echidna spirit called Tikal. Sonic Adventure is structured in different scenarios within which six different storylines take place. Each of them is dedicated to a specific character and is characterized by several levels that change according to the heroes used. Some levels must also be completed and replayed several times to get 100%, others are shared by the characters themselves, so that their situations intertwine, forming a single story. But who are these fearless and how is the gameplay diversified through them? Sonic is obviously the main protagonist of the adventure, as well as the one who is used the most in the game. The levels that see him in action are many and largely characterized by his proverbial breathless runs far and wide, complete with loops of death, precision jumps and rings to collect. Only that all this takes place in three-dimensional environments, with some automated sequences to avoid any problems in the control. Sonic is then also engaged in more exploratory game phases. In addition to the blue hedgehog are the two-tailed fox Tails, usually usable in areas where his speed is required. Curiosity For those who want it, SEGA has also released a DLC for this game. It is none other than a package recycled from the features included in Sonic Adventure DX for Nintendo Gamecube and PC, containing 60 additional missions as well as a new playable character, Metal Sonic, the robotic replica of Sonic created by the evil mind of the usual Dr. Robotnik. The cost? 4.99 Euros on PSN or 400 Microsoft Points on Live. Not a real makeover Then the sweet Amy Rose, who with hammer blows must protect her beloved bird from the clutches of Dr. Robotnik until the end of each path, and Knuckles, whose primary purpose is to recover all the pieces of emerald scattered in its levels . In this case the style of play is more like an adventure than a platformer. Finally there are E-102 Gamma, a robot that has become good, created by Dr. Robotnik, which transforms the gaming experience into a kind of shooterall in which you have to reach the end of the level within a time limit while destroying the greatest number of enemies to gain seconds. And Big the Cat, a big anthropomorphic blue cat with which to face a sort of simplified fishing simulation whose purpose is to catch his frog. The gameplay is also varied by some mini-games, including futuristic go-kart races in Twinkle Park or the challenges at the pinball machine of Nights in Casinopolis, as well as puzzles, the collection of particular objects to collect points or unlock special prizes and the Chao Garden where to raise these cute little creatures. Playstation 3 trophies Sonic Adventure features twelve trophies for the base adventure plus three more within the DLC. In all cases they are mainly related to the recovery of the emblems during the courses or to the completion of the various stories of all the playable characters. Like then The additions to the old, original Sonic Adventure for Dreamcast are to be found, as well as in the package mentioned in the separate box and in the trophies or objectives inserted for the occasion, in the presence of an unprecedented online option relating to a world ranking where to record the times of the speed tests performed with Sonic, Knuckles and the other characters, measuring themselves against other human players in exciting challenges. And in the purely technical aspect. Even if the graphics sector, perhaps it seems superfluous to underline it, does not change much compared to the original if not for the definition that has moved to 720p (but not wide-screen), it still appears more interesting thanks to the enhancement of the bright color palette , very bright, and the comic style of the characters and scenarios. Unfortunately, some of the defects already seen on the Sonic Adventure for Dreamcast remain, including the dancer framerate in some situations, and low resolution textures. The soundtrack, despite its simplicity, is now confirmed as then rather spot on, with very nice musical pieces that are perfectly integrated into the context of the action. Among other things, in these special edition audio can count on the support of Dolby Digital sound. While the voices of some characters do not seem to suit them, resulting in some cases, see Tails, perhaps too childish.", "date": "2010-11-22", "grade": "6.5"}