{"name": "Acqua in bocca", "ref": "https://multiplayer.it/recensioni/82365-hydro-thunder-hurricane-acqua-in-bocca.html", "text": "The Game is available for download on the Xbox Live Arcade service. Raise your hand if you remember Hydro Thunder. Probably there will be few palms in the air, yet behind this name there is an arcade racing game produced by the defunct Midway Games which was released back in 1999 in arcades and on Dreamcast, and the following year also on Playstation and Nintendo 64 In short, stuff from a geological era ago or almost. The peculiarity of the title basically lay in the fact that the competing vehicles were not glittering four-wheeled racing cars, but very powerful motorboats destined to challenge each other on rivers, seas and stretches of water in improbable, decidedly over the top locations. A bizarre formula but capable of reaping good success especially in the American audience, evidently more inclined to this type of product. The fact is that, using a way of saying that has never been so apt, a lot of water has passed under the bridges; 11 years later the brand is back on the market with this Hydro Thunder Hurricane, exclusive to XBLA and made by the small and rookie Vector Unit team. I don't want to get wet Usually we talk about retrogaming in relation to 16 and 8-bit era titles, but in reality it would not be wrong to expand the concept more generally to games characterized by outdated gameplay. Accepting this assumption, it can be said without hesitation that Hydro Thunder Hurricane is pure retrogaming, with a style and approach deeply rooted in its origins from the arcade of the 90s. In this sense, the choice of Vector Unit to focus on the same feeling as the original is appreciable and at the same time courageous; because if it is true that as it is, Hydro Thunder Hurricane is paradoxically a game endowed with a certain originality in the year 2010, on the other hand the risk of proposing a title unable to strike the right chords of modern users is inevitable. Apart from these kinds of reflections, which actually leave their time, there is no doubt that Hydro Thunder Hurricane is a product packaged with care and attention; the structure is fundamentally based on the need to face the various competitions to obtain points with which to unlock other competitions and boats. A very linear and simple progression therefore, which leaves little margin of freedom to the player; apart from the choice of which challenge to face first, the need to collect the aforementioned points obliges a defined path that often passes through the repetition of competitions until the objective is reached. The latter can be either classically against 15 other opponents on who crosses the finish line first, or timed with the request to pass through the rings arranged on the track (under penalty of precious seconds penalty), or always against the clock but with the 'additional difficulty of having to avoid explosive barrels cynically placed right in the most challenging points. Finally, the championships combine these different categories in more organized sessions. The game itself, provided you appreciate this kind of product, is undoubtedly fun and quite intriguing; beyond the aquatic element that with waves and movements requires continuous adjustments to the trajectory and trim of your outboard, it is the track design and the presence of the turbos to be collected that contribute to giving greater depth to the gameplay, especially in the more advanced. For example, the many shortcuts to discover, or the structural modifications of the routes lap after lap, or the elements that suddenly appear (like improbable giant sea snakes, just to name one) are aspects that keep the tension high and give greater depth to otherwise rather superficial mechanics. The already mentioned turbo, essential on several occasions as well as to be able to control the motorboat even in the air, can also be used to make improbable and useful jumps, both to avoid obstacles and to reach otherwise inaccessible areas. The speech is completed by an online multiplayer mode quite reduced to the bone, and especially suffering a few months after its release due to a bleak lack of players. In this sense, the very recent DLC with additional content has helped little.", "date": "2010-11-22", "grade": "7.2"}