{"name": "Devil May Cry 3", "ref": "https://multiplayer.it/recensioni/devil-may-cry-14.html", "text": "Brothers Knives Prequel to the two previous adventures, Devil May Cry 3 sees a young and even more tamarro Dante grappling with his evil brother Vergil, within a storyline that is initially rather generic but which gradually becomes decidedly compelling and well done. Leaving the user the pleasure of enjoying the plot at the base of the Capcom action game, it is right to dwell on the cutscenes of which the game abounds, and which in most cases manage to effectively enhance the decidedly over-the-top character of the protagonist. Dripping in slow-motion and stylish framing cuts, the real-time sequences show Dante in his always exaggeratedly cool attitudes: even seemingly simple gestures such as picking up the phone or putting on a raincoat are exploited in Devil May Cry 3 as occasions to underline the bravado of the character, which reaches its peak in the exciting action scenes. But already from this point of view, the Capcom title does not skimp on showing signs of precarious balance, with several cutscenes that far exceed the limit that separates the spectacular from the ridiculous (from hands to hair a sequence in which Dante surfs on a missile), resulting rather distant from the common concept of ~style~. Sequences aside, however, Devil May Cry 3 expresses its exaggerated character in a far from positive way right from the first bars of the game, presenting an excessive level of difficulty which, combined with an almost non-existent learning curve, makes the first approach to action. In addition to the questionable use of simple fixed screens for the explanation of the tutorials, Devil May Cry 3 proves to be able to soon make the user fall victim to a deep frustration dictated by the continuous game overs ringed in the first levels. What's worse is that this isn't due to any particular skill of the AI of the enemies present on the screen, but rather due to a whole series of game design deficiencies. To begin with, it is not possible to save during a mission: the serious implications of this choice (evidently desired by the developers, but extremely reckless) are evident in the light of the high challenge offered by the boss battles at the end of the level, which almost always require several attempts before being defeated. In Devil May Cry 3, therefore, it becomes a hateful habit to have to repeat the same sections of the game over and over again in order to reach the room of the monster on duty again. Someone could justify this by seeing in this aspect of the Capcom title an incentive for the player to improve progressively through repetition: but objectively the omission of save points turns out to be a completely counterproductive gameplay choice, which makes Devil May Cry 3 a less enjoyable than it could have been. Of course, there is the possibility of buying special yellow Orbs that act as continuous: but their price in terms of red Orbs is almost prohibitive - as is the case with most of the objects on sale - forcing the user who feels the need having to deal with backlog missions again in order to raise currency. Again, a simple save point would have made a huge difference. You make me cry Sadly, Devil May Cry 3's series of shortcomings doesn't stop there. In fact, the game behaves in a rather approximate way in some of the most important elements for an action game worthy of the name. First of all, the camera system, made up of an alternation between fixed shots and others that can be managed using the right stick: in both cases, the view is often too narrow, thus preventing the user from identifying the attacks of the opponents. It therefore happens to see your energy indicator being consumed due to blows coming from outside the screen, which not even Dante's evasive moves can avert. In this regard, there is also a control system that could have been decidedly more agile and better studied, and which above all badly manages the process of lock-on to enemies: the operation turns out to be particularly imprecise and confusing dedicated to the switch between one target and another, with the hook passing in an apparently arbitrary way to the opponent further away rather than to the one in the immediate vicinity of Dante. Just make a comparison in terms of cameras and control system with the excellent God of War to understand how the work done by the developers of Devil May Cry 3 has not been entirely up to a production of such a caliber. A series of lightnesses that weigh even more when compared with the excellent quality of the action that the Capcom product is capable of.able to offer: always based on the joint use of blades, firearms and spectacular acrobatics aimed at obtaining the greatest possible number of Stylish Points, the gameplay of Devil May Cry 3 offers entertainment and satisfaction to those who manage to turn a blind eye to the its obvious shortcomings. The moves that Dante can perform, although not too numerous, always turn out to be pleasant to see (even here, however, with some deviations too ridiculous), and to perform; the game also rewards the variety expressed by the user in terms of combos with a greater distribution of points, discouraging the repetition of more ~comfortable~ shots. The possibility of changing Dante's weapons on the fly then paves the way for the creation of attacks as complex as they are devastating: an example may be to send an enemy into the air with a saber, keep him in flight with a couple of pistol shots and then pierce him with a quick nunchuck-based aerial combo and finish him off with a deadly shotgun blast. There is the devil in me The main novelty of the gameplay of Devil May Cry 3 is the presence of four distinct fighting styles that allow you to perform different special moves during the game. The Trickster includes sprints and various dodges, useful for escaping enemy attacks; the Swordmaster offers different sword techniques; the Gunslinger focuses on the use of firearms; finally, the Royalguard provides the user with the ability to parry and counterattack. Using a particular style, experience points are accumulated which end up causing it to increase in level, with lots of new moves bestowed at each evolutionary stage. The introduction of the styles is interesting and paves the way for different approaches to the game as well as a series of spectacular stunts, but it doesn't fail to leave some perplexities: in particular, it would perhaps have been more sensible to include dodges and parries within the repertoire standard Dante moves, rather than limiting them to a single style. A similar argument could be made about the upgrades that can be purchased using the famous red Orbs as currency: the object of the upgrades are the various weapons and not Dante himself, so to take advantage of certain skills it is forcibly necessary to equip a particular offensive tool. For example, the double jump technique is linked to the Rebellion sword, so it cannot be used when wielding Cerberus nunchucks: the paradoxical thing is that if another weapon supports the same move, it is still necessary to repurchase it. In short, a uselessly stupid and cumbersome quibble. If Devil May Cry 3 has ups and downs from a gameplay point of view, the same can be said for the technical profile. Graphically, the Capcom product is substantially good, with detailed polygonal models of the protagonists and with a remarkable set of animations. The various levels also offer complex and often impressive scenarios, and the fights are embellished with discreetly made special effects. What is not fully convincing about Devil May Cry 3 is the generally rough aspect of the entire cosmetic sector, thanks to the poor definition of the textures, a use of colors that are not always up to par and the infamous aliasing, present albeit not massively . The sore points also include the design of the enemies, absolutely to be forgotten: in addition to stylistic paucity, Dante's opponents in Devil May Cry 3 surprise in the negative for their modeling, which most of the time is resolved in a jumble of polygons hardly definable. On the sound front, nothing to say about the English dubbing (excellent) and the effects, of great impact. The musical background, monotonous and repetitive ad nauseum, definitely deserved more attention. Comment Although undoubtedly superior to its predecessor, Devil May Cry 3 turns out to be a far from perfect title on balance, which fails to completely bring the series back to the glories of the first episode. And this is a shame, considering the excellent qualities of the Capcom product in terms of the pure and simple action presented on the screen. Exhilarating and adrenaline-pumping, Devil May Cry 3 is unfortunately penalized by some absolutely unfortunate gameplay choices and by a series of technical shortcomings that are not indifferent for a title of its caliber. In short, Devil May Cry 3 claims to be stylish, but it is up to a certain point: and the third episode of Dante's adventures ends up giving way to more refined products such as Ninja Gaiden or God of War, while remaining a recommended choice for action game lovers. Pros: Fast-paced and spectacular fights Well-crafted cutscenes Engaging storylineCons: Some risky gameplay choices Questionable cameras and control system Can be too difficult and frustrating After the great success of audiences and critics obtained by the original Devil May Cry, no one would have expected from Capcom a sequel as superficial and disappointing as the second episode of the series actually was. Burnt by such a negative surprise, the gaming community could not help but turn up their noses and welcome the news of the arrival of a Devil May Cry 3 supervised by the same producer with distrust. Now let's see if this third chapter will be able to make people forget the recent past and bring Dante back to the throne of action games.", "date": "2005-04-16", "grade": null}