{"name": "Angry food?", "ref": "https://multiplayer.it/recensioni/82427-floop-angry-food.html", "text": "With something like ten million purchases on the App Store alone (to which must be added the approximately two million on the Android platform), Angry Birds is undoubtedly one of the most striking examples of how it is possible to create a fun, accessible and low-cost video game for then sell it all over the world thanks to word of mouth and positive reviews, both from the press and from the users themselves. Ours, for the record, can be found here. Developed by Rovio Mobile, the game had us using a catapult to launch birds with different abilities at small gatherings of pigs. The goal was to defeat them using the shots at our disposal, all in a convincing and well-packaged inertial context. Floop's gameplay is practically identical, from inertia to the launch system, even if the game structure at a certain point takes different paths compared to Angry Birds and seeks interaction with the environment rather than the differentiation of ~bullets~ . Naturally, the underlying ~story~ also changes: instead of the enraged birds, here we have food (acorns, bananas and cheese) which, with the least number of ~throws~ possible, must reach the gaping jaws of a squirrel, a and a mouse, all through fifty stages of increasing difficulty. We are what we eat That animals go around to get food is an established truth, but that it is the food itself that strives to be eaten by the animal on duty appears to us to be a novelty. As mentioned above, Floop faithfully reproduces the gameplay of Angry Birds as regards the launch system and the inertial context, even if it does not introduce variables as regards the ~bullets~ and leaves the scenario the burden of mixing a little cards on the table. To make a throw you have to touch the touch screen where the acorn, banana or piece of cheese is, then drag in the opposite direction to the one in which we want the object to move. As in a sort of catapult, therefore, it will be enough to lift your finger for the shot to be carried out, bending to the laws of gravity during its journey towards the target. In some stages it is possible to reach the animal's mouth with a single well-calibrated throw, while in others two or three necessarily are needed. The goodness of our performance depends precisely on the number of maneuvers performed, and at the end of each level we will be assigned a rating of one to three stars, an assessment which however does not affect the possibility of accessing the next challenge. Therefore, that control mechanism which in Angry Birds was identified with the number of birds available to complete each stage, after which it was necessary to start over, is missing. The food does not vary its characteristics, as already mentioned, and it is therefore the scenario that offers some breaking elements with icy surfaces, traps, air currents, cannons and so on. The final result, in terms of gameplay, unfortunately cannot be compared to the greatness of the Rovio Mobile title, which for a whole series of details (the limit of the launches, in fact, but also the visible trace of the last trajectory in order to better dose the next iro) remains superior by many spans. The technical realization is discreet, with some nice visual solutions (parallax scrolling of some elements of the background, for example) and an effective drawing style. The tested version is 1.02 Price: 0.79 App Store links", "date": "2010-11-19", "grade": "7.2"}