{"name": "Dal ping pong ai racchettoni", "ref": "https://multiplayer.it/recensioni/82313-racket-sports-dal-ping-pong-ai-racchettoni.html", "text": "The game requires Move for PlayStation 3 Whether Move is able to attract the casual audience that has had a Wii in their living room for years to PlayStation 3 remains to be seen, but with the arrival of the new controller in stores, someone took the opportunity to immediately grab the leap ball. Literally. In the light of the success achieved by Wii Sports, which for many has become a simulacrum of casual gaming, Ubisoft immediately converted its Racket Sports to PlayStation 3, a sort of clone of Wii Sports which now, on the Sony console, doesn't have to share the stage with established names. Before turning up your nose, however, it should be emphasized that the game tries to enrich the classic experience of the Nintendo title thanks to an infinite number of unlockable contents, many objectives, various tournaments to face and a rich selection of sports which, as can be guessed from the name, they all require the use of a racket. In addition to tennis, therefore, the player can face the CPU or friends in ping pong matches, badminton matches, squash matches or even beach tennis matches. Ace! Let's clarify a few things right away: those who are looking for a realistic experience, which takes full advantage of the incredible precision of the Move and has instantaneous responsiveness of the controls, would do better not to go further. Racket Sports exactly copies the mechanics and tennis feeling of Wii Sports, thus passing through a very simplified control system or a deliberate delay between the player's movement and that of his alter-ego; moreover, just like in the Nintendo game, the athlete's movements are completely managed by the CPU, leaving the user only the burden of hitting the ball at the right time and in the right direction. As much as this extreme and almost trivializing simplification of the genre may seem unacceptable to the most intransigent gamers, it is exactly the type of approach that the audience Ubisoft is addressing wants. In short, what would panic at the mere idea of having to move an analog stick and simultaneously launch shots with the Move; the multitasking player would therefore do better to wait for a real tennis simulation, but in this particular case we don't really feel like criticizing the choice of the developers who, on the contrary, have managed to offer a much more varied, rich and lively experience than the one of Wii Sports. How did they do it? Simply thanks to a roundup of achievements and unlockable content, ranging from new clothes for the athletes to additional courts, new characters, wacky hairstyles or customized rackets. There are also several competitive modes and a few different types of tournaments and leagues, so you can challenge your friends in single elimination or points matches: it must be said that, due to poor presentation, the order of the matches is the only thing which distinguishes one competition from another, making it almost unjustified that an entire section has been dedicated to each of them. The five sports available are all tackled in a more or less similar way, and it takes a few moments to become familiar with the speed of a ping pong ball or the much slower and more parabolic motion of a badminton shuttlecock. Once you've found your favorite discipline, you're naturally driven to play that most of the time, but the unlockables offer enough incentive to complete tournament after tournament in other sports as well. Graphically we are faced with a significant evolution of the Nintendo Wii counterpart: Racket Sports runs at 1080p with a very high and stable framerate, while the scenarios appear decidedly richer, more lively and more detailed than before. Too bad that, despite the progress, the game does not impress much if you consider the hardware on which it runs, while the ear also suffers from music and sound effects that are repetitive in the long run. Finally, a party game mode should make matches with multiple friends even more lively, but unfortunately it is limited to random matches in which players constantly switch partners. Like it or not, the comparison with Wii Sports, and in particular with its tennis mode, is inevitable. Everything from the graphic style to the simplicity of the controls is reminiscent of the Nintendo game, although Racket Sports goes the extra mile to give the player that little extra: surprisingly, unlockable achievements, stats and extras are more than enough to achieve the goal, while the five disciplines different ones are able to satisfy all racket lovers a little. Ubisoft's title probably won't please the average hardcore at all, but that doesn't matter, because it's not him that it's aimed at. One wonders if there are still any families in the world with so muchwant to turn the living room into a tennis court, but doesn't already own a Wii.", "date": "2010-11-16", "grade": null}