{"name": "Robots", "ref": "https://multiplayer.it/recensioni/robots.html", "text": "We started well and I started playing with a positive spirit but after three hours the waxy expression on my face betrayed what would have been the final judgment An overly homologated robot There are no great films which can be compensated for by watching the film, but there are at least some dialogues in Italian, even if the voice actors are certainly not the same. The delicately fairy-tale design of the characters is the stuff of a fine sack, considering the excellent artists who created them for the big screen and the visual impact therefore does not betray expectations. Let's also start from the story, held together by a voiceover that unites the game sections in which you will simply have to recover mechanical pieces, between platforms and ledges. This means climbing crates, sliding under openings, running this way, running that way, and sometimes hitting enemies to get them out of the way. Once you have obtained all the pieces required by the section you are in, you will be allowed to move on to the next one. Of course we started with the headboard but it soon became clear that trying twelve times to hit a platform wasn't the spirit of the game, at least it wasn't up to this point. So thrown keys we moved on to the joypad, so that we can describe the sequel. Repetita iuvant but tired We want to emphasize it: if you don't have a joypad, immediately abandon the idea of playing Robots. Just to clarify, the mouse was not even imagined by the developers and to say that as soon as we realized the eccentric framing system we instinctively moved the mouse but nothing: two keys with rather limited control over the camera must be enough for you. What are we left with at this point? However, the game is frustrating at times in the way that platformers and all the ~try-fail-try-and-if-you-can't-try-again~ games can be. Between a handhold and a rope you will also find yourself piloting a rotating vehicle on highways that should break the monotony of the action, but if we exclude some puzzles, which are also well thought out, you just have to collect the pieces back and forth without too many difficulty and with fights reduced to the basic mechanics. It's a shame because when the city appeared with all the robots walking around and talking, the thought immediately went to who knows what adventure sides of the game, but it's just an excuse to trigger submissions from junk collectors. Turning it from side to side, only the models and the general inspiration of the visuals remain, but the credit certainly does not go to the developers, who limited themselves to reproducing them in the game, albeit in great abundance. A final icing are the rare sequences of the film that are completely without audio. One would like to say pity, it could have been Comment What can I say, 5.2 but also 5 or 5.7... little changes. It would make all the difference if an ideal audience came to mind but to say that some children who are passionate about the film could appreciate it would be to save any video game. Instead Robots fails in its attempt to be a quality platformer or at least in step with the times. Unfortunately it lacks bite but also just some real mechanism designed to entertain and keep you glued to the screen. If the thought was only to exploit the license, at least the graphic aspect is faithful to the film and the models are as fun as those of the film. Our advice is to see the film and if you have already done so and you have girls or boys at home, at least make sure they have a joypad in their hands. Pros: Models well made and faithful to the film Cons: Almost no consistency As a platform it is mediocre Too repetitive An overly homologated robot A film of probable success comes out and they follow it closely, especially if there are children, pencils, backpacks and of course a custom-made video game in the audience. Perhaps in remote times Robots could have been a point and click adventure and I must say that the anthropomorphic robots that live in their absurd city reminded me a bit of that unforgettable game that was Grim Fandango (in which, however, there are no robots 'was one). Apart from this, the similarities between the two games end immediately, and unfortunately I would add because Robots left me at least perplexed.", "date": "2005-04-14", "grade": null}