{"name": "Che paura mi fa!", "ref": "https://multiplayer.it/recensioni/82308-wackylands-boss-che-paura-mi-fa.html", "text": "That of giant monsters is a theme very dear to cinematography, but also to the world of video games. How can we forget a classic like Rampage, for example? In the Midway arcade you controlled one of the three available creatures and completed the stages bringing death and destruction to the city, devouring its inhabitants and destroying the buildings with your fists. And more or less the same happened in the entertaining King of the Monsters for the Neo Geo platform, whose sequel successfully explored the ~monsters against aliens~ trend that still today has converts in Japan (and elsewhere, see the animated film DreamWorks ). Wacky Lands: Bosses! interprets this theme in a fairy-tale way, and just like in a book of fairy tales it tells us about a big bad monster who one day sees the beautiful landscape of its mountains disfigured by a castle built by men. May it never be that those useless little beings can ruin the landscape for him! So he walks towards the stakeout to tear everything apart, but is greeted by hundreds of knights, archers, amazons and even ninjas (yes) intent on defending their stronghold. In short, cleaning will not be a simple undertaking: better roll up your sleeves. The king of monsters In the title developed by Fair Play Labs our task is to raze three different scenarios, each consisting of four stages. We will have to face many enemies and defeat them with our powerful blows, up to measure ourselves with the fruit of human magic, or a creature of our own size that will try to prevent us from continuing. The control system adopted for the occasion is at least original: without the virtual analog stick and basic buttons, we have to hold down right or left on the touch screen for the monster to walk in the relative direction, make a quick touch to make it throw quick punches and swipe your finger horizontally to deliver a powerful shot. A vertical slide down allows us to quickly roll left or right, avoiding being hit, while a slide up allows us to grab objects such as cows, barrels, explosives and so on, and then throw them at enemies using again the same gesture. This also works to grab the princesses and devour them, a useful maneuver to recover half of our vital energy. As we progress through the stages, our huge character levels up and acquires new skills that are loaded through combat: a stomp capable of shaking the earth, the ability to breathe fire or a super move that wipes out all that which is on the screen. Between one battle and another, we will have the opportunity to customize the monster in many different ways, changing its appearance for fun but also to allow it to acquire particular skills. There are also weapons, clothes and armor that can increase its strength, endurance and speed: they can be purchased by spending the experience points earned in the field. Finally, completing the areas allows us to access three different and nice minigames with a ~survival~ structure: a nice extra compared to the main game mode. The graphics of WackyLands: Boss! it's really very pretty, colorful and designed with an effective style: it's like watching a children's animated book, the overall effect is outstanding. There has not even been spared in terms of variety, given the high number of enemies and the presence of ever-changing scenarios. The tested version is 1.0 Price: 0.79 App Store links", "date": "2010-11-16", "grade": "8.3"}