{"name": "Siamo in undici?", "ref": "https://multiplayer.it/recensioni/81922-fifa-11-siamo-in-undici.html", "text": "Version tested: PSPC There are people who have devoted so much time to the various Pro Evolution Soccer and FIFA that they have contracted a serious form of rejection towards any football simulation. It goes without saying that when such people are faced with a title capable of not getting bored after a few minutes due to the usual deja vu, it means that something in this videogame vein is really changing. This is precisely the case of the EA Sports series, which also in its portable version for PSP shows that it pays attention to substance rather than form, not only thanks to a certain attention to the methods present (always abundant), but also and above all for the introduction of game dynamics that are anything but trivial. A real breath of fresh air compared to years and years of center forwards who also break through walls, through balls that are never intercepted and deadly triangulations two meters from goal, in short. After an initial wary approach, FIFA 11 lets itself be played with pleasure and shows us all its facets, giving matches a depth and variety that are difficult to find in portable football. However, to say that the Electronic Arts product is perfect would be wrong: on the one hand, there are really too many points in common with the 2010 edition, so whoever owns it will have to carefully consider the transition to the new version; on the other hand, the inexplicable elimination of a fundamental mode such as online multiplayer, together with a series of still unsolved problems, constitutes a factor of no small importance for the purposes of the global assessment. The teams take to the field Already from the classic ~quick game~ it is possible to access some of the novelties of FIFA 11, unfortunately not exciting novelties but which nonetheless constitute an interesting starting point for the future. In fact, you can play a game by controlling the entire team, in professional mode (therefore in the role of a single player) or as a simple goalkeeper. In the latter case, the action is not very fun (to put it mildly), given that you are forced to watch the whole match between the posts and only intervene when the opponents enter our penalty area. The ~career~ mode is, as usual, the fulcrum of the game: after selecting a player (who will also play the role of coach on the field), we will have the possibility to play matches as a simple simulation, playing them in the more classic way or by impersonating the single character. The lack of constraints is interesting, that is, from time to time it will be possible to freely experiment with one of the three approaches and thus make their way within the season. Positive results will also translate into improved team performance, similar to the PES 'master league' but with real squads. The offer of modes is completed by the numerous ~challenges~ (historical scenarios to ~straighten~, with an increasing level of difficulty), by the ~practice~ mode and by local multiplayer. As already mentioned, online multiplayer is unfortunately missing; once on the pitch, however, FIFA 11 knows how to make excuses thanks to its undoubted qualities. The ball is round The pace of play is generally low and a greater attention to the tactical aspects is immediately noticeable, in fact the teams always remain rather covered and do not stretch except in rare cases. It goes without saying that organizing effective counter-attacks proves to be a feat, and often our striker will find himself facing at least two defenders before being able to find himself face to face with the opposing goalkeeper. The introduction of ball protection and 360-degree dribbling produces substantial differences in the approach to scoring, with the most skilled players managing to take advantage of even the smallest spaces to fly onto the wing and make a cross. A ~predominance~ of the defensive phase compared to the offensive one is clearly perceived, i.e. the situations in which a weight center forward manages to ~break through~ the defense simply by running forward are almost completely absent. In the same way, goals are not very easy to score: the goalkeepers manage to cover the spaces well, even with some limitless saves on the most insidious balls. The biggest problem, however, is getting to the shot: the through balls are very often intercepted, the triangulations are difficult to execute due to very tight markings and similarly the crosses do not find our teammates free to hit the ball: it is counterbalanced in this way a management of perhaps simplistic shots on the fly, which when it occurs leaves no way out for the opponent One of the things on which football EA Sports historically chases PES isthe physics of the ball, especially in the eleven meters, and unfortunately FIFA 11 for PSP is no exception. In fact, the ball produces unexpected reactions, proceeding very slowly after a violent tackle with a rebound (so much so that it doesn't even leave the field) and instead taking flight during most of the crosses. However, it is the goal shots that are less convincing: the sensation of impact is poor and the sound effects do not help, which in this situation see the audience fall silent as in the presence of a phantom goal, even when perhaps it occurs at the end of a long action. The sound sector in general is not crazy, it needs a refresh in the commentary and greater attention to this type of situation. Furthermore, the ~signed~ soundtrack of this edition is perhaps among the least brilliant in recent years. The graphical interface is the same as FIFA 10 and unfortunately it turns out to be heavy, slow to load and anything but intuitive: team management in this sense is a disaster that leads to always playing with the default squad and module while not wasting time. The polygonal models of the players themselves are well done, but there are emblematic cases regarding the similarity with the real counterparts: if you present me with a Sneijder with hair, it means that something is really wrong. Finally, there are some problems with the animations, which become jerky in certain situations, and some small but annoying bugs.", "date": "2010-11-12", "grade": "8.0"}