{"name": "Rock o lento?", "ref": "https://multiplayer.it/recensioni/82174-rock-band-3-rock-o-lento.html", "text": "Tested version: Nintendo DSRock Band on Nintendo DS is a technically successful product, there's no doubt: bringing the multitrack dynamics that have always characterized the series to the console from the dual screen will not have been easy; and, beyond the limits represented by the obvious audio compression, the quality level of the songs appears more than fair. For this reduction, the Harmonix developers did not want to focus on ad hoc peripherals and limited themselves to assigning the basic gameplay actions to the d-pad and the X and A buttons, i.e. the reproduction of the ~notes~ that scroll on the screen, but the end result is still excellent and guarantees a fun and engaging experience. Those who have tried LEGO Rock Band, also in the Nintendo DS version, will find themselves extremely at ease with this Rock Band 3: the controls are the same, as are the conditions that determine the completion of the songs and the possibility of switching between one instrument to another using the dorsal keys. In some situations, this feature is placed almost as an obligation, unfortunately, but you just need to practice a little to realize that you can play a song even while always remaining on a single ~track~: just resort to the ~mode~ as often as possible overdrive~, which not only multiplies the score but also affects the results of the other three tracks without having to bother to raise the average manually. The animal beat This third portable episode of Rock Band contains a tracklist of twenty-six songs, among which ~Bohemian Rhapsody~ (Queen), ~Break on through (to the other side)~ (Doors), ~The hardest button to button ~ (White Stripes), ~I got you (I feel good)~ (James Brown), ~Just like heaven~ (The Cure) and ~Midlife crisis~ (Faith No More). As usual, the three difficulty levels imply a greater or lesser accuracy in the phrases to be played, giving even novices the possibility to become familiar with the controls and then gradually proceed to a higher degree of challenge. From this point of view, it must be said that the feedback from the buttons and the d-pad unfortunately creates some difficulties, the stroke of the keys is different and respecting the timing in the busiest situations is not very simple. The ~Go on tour~ mode is once again the fulcrum of the game, and sees us form a customizable band (but the elements available are not many, on the contrary) that sets off on a live tour, trying to build its own fan base. after performance. If things go well, they will move from small suburban venues to stadiums, gaining an extraordinary audience following. The rest of the modes are more of an accessory, the songs are freely accessible from the start and the standard gameplay has been joined by the ~professional~ mode, based on single notes instead of phrases, and clearly endowed with greater complexity. At this juncture, in fact, great precision is required, given that the tracks are not ~reset~ by the completion of the sentences and one therefore remains confronted with the piece without pauses. In the ~standard~ mode, on the other hand, the attention is focused on identifying the multipliers: if we are playing the bass and we successfully complete a phrase, we will be able to ~latch~ on the fly to the drum track to gain a multiplier, and then pass to the vocal or guitar/keyboard track. The bar under each instrument allows us to invoke the overdrive and to enjoy a further multiplication, a mandatory procedure to recover a ~failed~ track. The technical realization of the game is really good (always limited to the capabilities of the Nintendo DS) as far as the audio sector is concerned, while the graphics are simply functional to the action. Too bad for the multiplayer, only locally.", "date": "2010-11-11", "grade": "7.5"}