{"name": "Il sapore antico delle corse", "ref": "https://multiplayer.it/recensioni/82180-need-for-speed-hot-pursuit-il-sapore-antico-delle-corse.html", "text": "Tested version: Xbox 360 For some years the Need for Speed series had embarked on the path of slow decline that seems to distinguish the more mature video game franchises and therefore more easily victims of serialization. On the one hand, thanks to the contribution of the guys from Slightly Mad Studios, Electronic Arts had tried to patch it up by dodging the habit and betting everything on an interesting simulation attempt that made physics its spearhead. We are obviously talking about Need for Speed: Shift. Not happy with the good result obtained, the publisher also wanted to offer a new opportunity to the most typical gameplay of its series, strongly investing in arcade driving, the eternal struggle between outlaw drivers and policemen, the most desired cars by any car lover and leveraging the experience of a developer who has arcade racing games firmly in his DNA. It is precisely from the union between Electronic Arts and Criterion Games (software house creator of the Burnout series) that the Need for Speed: Hot Pursuit that we are now reviewing was born and that right from the title, deliberately the same as the third chapter of the series, demonstrates the precise willingness to return the saga to its former glory by offering the arcade gameplay of the origins in its purest declination. Let's start with the numbers... Hot Pursuit is structurally set up as a racing arcade where the player accesses an increasing multitude of racing events that are unlocked as the game progresses. There are two different careers, that of the pilot (with a decidedly criminal attitude) and that of the policeman, each consisting of twenty levels of experience that the player can climb by completing the various races in both single and multiplayer. The system takes into account not only the placement, but also any bonus actions depending on the driving style, the number of accidents caused, aggressiveness and so on. In total it will take no less than 15-18 hours for each career to unlock and complete all events (there are 60 as a pilot and 48 as a policeman) and it will be absolutely essential to play a lot of multiplayer (or repeat numerous times in single the races already carried out), to reach the maximum level, given that at a first pass you will hardly go beyond the thirteenth level. However, it is essential to immediately clarify the method of selecting these events. Forget the free roaming typical of the last Burnout: in Hot Pursuit you limit yourself to selecting certain ~unlocked~ areas of Seacrest County (the fictitious city in which the game is set) from a general static map and from there you access a number event variable to deal with. In reality there is always a mode called free that allows you to get on board one of the unlocked cars and go around the County but it is completely an end in itself: the damage is disabled, you do not earn points and there are no opponents to to challenge. Obviously put aside even those stories bordering on B-Movies to which some past episodes of the series have accustomed us: in Hot Pursuit there is no plot, you just run; and this is done by boarding a rather large number of racing cars in full respect of the Need for Speed tradition. In the role of the outlaw driver we will have access to 52 cars divided into five different categories, from sports cars to exotic cars to hyper cars, real racing cars that often exist in reality only in the form of prototypes. As a policeman we will have practically the same number of cars (also in this case divided into five classes), given that in the vast majority of cases these are the cars available as a driver but in a ~set~ version as a law enforcement officer with reinforcing bars , sirens, flashing lights and obviously very precise colors and writings (for a partial list of available vehicles, please refer to the dedicated box). The machines are obviously unlocked by gaining levels and it is precisely in the reward system that one of the main points in favor of Hot Pursuit lurks. In fact, each level of the ranking has 3 or 4 prizes that are earned by reaching certain score ranges: obviously we find the cars but also upgrades of the weapons supplied and a good number of extras including promotional and advertising films of really existing racing cars. In this way, at the end of each event completed with a good placement, the player finds himself always having something new in his hands to try immediately. Xbox 360 goals Need for Speed: Hot Pursuit offers 50 achievements for the classic total of 1000 points, half of which are easily acquired by simply playing all the events in the enboth careers with good placement. A dozen objectives are then related to online multiplayer while the rest are linked to particular challenges (called goals) that force the player to be particularly aggressive and precise in driving. ...we face the events... And after so many quotations let's describe these events in detail. As a pilot we will have six different modes available: we start from the classic eight-man race and the 1-on-1 duel, then we find the Time Race where, alone, we will have to reach the finish line within a time limit. Then there is a small variation on the theme, the so-called Preview which allows us to face a timed race but forcing us to choose a high-class car that we will usually only be able to afford many levels later. Finally there are the Hot Pursuit and Caccia modes where the challenge with the police finally comes into play: in the first case we will find ourselves in the company of a variable number of other pilots, in the second case we will only be the protagonists of the escape. In both cases we will find ourselves with the guardians of order on our heels who will try in every way to get us out by crashing into us and unleashing us against every possible weapon and trick. In these last two types of event the legacy in common with Burnout comes out, with a succession of highly spectacular incidents and expertly underlined by the excellent direction that Hot Pursuit stages when we manage to destroy a policeman's car, or to highlight the arrival of a police helicopter, a particular law enforcement vehicle or yet another road block on a bend. The action is the protagonist and even if sometimes these scripted micro-events and the continuous change of camera can be repetitive or displace the player who finds himself driving his car a few seconds later to where he left it perhaps in the middle of a curve , the adrenaline and the frenzy of dirty driving become decisive by earning the game numerous points on the scale of the fun generated. In the case of the policeman, the range of methods narrows: we will have the so-called Quick Response which perfectly follows the driver's Time Race but introduces small penalties in seconds in the event of collisions or caused accidents (and also in this case the Preview variation is not missing ), the Hot Pursuit and the Interceptor. Naturally in the latter two cases the objective changes: it will no longer be necessary to flee but to kill the greatest number of riders before they reach the finish line, effectively blocking the race in progress, or to prevent the escape of a single criminal who usually appears extremely more aggressive and resistant than when there are more cars to send in Takedown. And if in the previous paragraph we highlighted one of the most positive aspects of the game, in the rather small number of event types we probably find one of the most criticizable aspects of Hot Pursuit. Concretely, in fact, the multitude of events just described is reduced to two, three truly distinguishable game modes with an additional handful of variations on the theme. The title seems to lack imagination by forcing the player to always face the same type of challenge in a rather mechanical way and without offering a real sense of progression in the game structure. The system of unlockable prizes and constant rewards mentioned above is of little use given that after a dozen hours of play you still find yourself carrying out the same race or pursuit formula simply with a faster or more manageable car. And in this regard, unfortunately, the online game reduced practically to a minimum in terms of variety with only three game modes does not help: the Race with a maximum of 8 pilots, the Hot Pursuit 4 criminals against 4 policemen and the Interceptor 1 vs 1. However, the total absence of lag that we found during the tests carried out during the review is commendable. The autolog Conceived by Criterion and potentially already present in Burnout Paradise, the autolog is a particularly sophisticated warning system that constantly correlates the results obtained by the player on individual events with those of his friends, effectively creating a sort of asynchronous multiplayer with the precise objective of stimulating the desire for competition that everyone harbors intimately. In this way, any lack of time or fear of facing the typical difficulties and frustrations of the online competitive environment are circumvented, while still offering a new dimension of challenge. Did you beat a new time on a particular race? The friend on duty will be notified of the matter and will be offered to try tobeat it again through a recommendation system. Want to report a particular achievement or show your pictures in-game? It is possible to do this through the photo section and the Wall, a real Facebook bulletin board. Do you have few friends who play Hot Pursuit? Autolog will compare friends of friends in order to suggest possible new people to add to the list. The idea is absolutely great on paper and looks well done but its full potential is too dependent on the number of people connected with the player and willing to invest a lot of time on the title. ...and we come to the driving model Need for Speed: Hot Pursuit is a return to the origins even in what most distinguishes the arcade nature of a racing game: the driving style. There is absolutely nothing simulative here starting from the available views: forget the one from the cockpit since in addition to the classic one from behind we find one from the hood and one ~from the ground~. But in particular the game seems to wink at the Ridge Racer series and the never forgotten OutRun. The cars are in fact very heavy and woody to control in normal situations but the light touch of the handbrake is enough to make them skid and thus make them extremely reactive and manageable after, of course, the classic handful of hours necessary to become familiar with the system . However, everything is rather intuitive right away and above all very satisfying provided you enter the perspective of this driving style. It certainly makes a scene to do the entire motorway entrance ramp at 250 km per hour in full skid without ever taking your foot off the accelerator and also dodging the opposite traffic and when everything succeeds perfectly, your self-esteem earns several points. In addition to not being affected by the normal laws of physics, the car is also not affected by damages which are exclusively aesthetic and well reproduced without ever being excessive in terms of gravity; forget that bonnets that fly or doors that are torn off, just to name a few. And since we are talking about dents and various ~paint stripping~, it is right to mention the weapons that the player has at his disposal during the pilot versus police events. As an outlaw we will have a turbo of about ten seconds, a jammer to disable the opponents' equipment and radar, the spiked strips to be released from the rear and an electromagnetic pulse that is fired from the front after a few seconds of acquisition of the enemy vehicle. These last two weapons are also part of the policeman's equipment who, however, possesses as an alternative to the turbo and the jammer, the road block which is placed a few hundred meters ahead of his position and the helicopter which intervenes on the scene to quickly reach the lead pilot and drop him a little further on a hard-to-avoid spiked strip. All these weapons are available in very limited numbers during the event, are summoned through the four directions of the digital cross and add a little tactical and strategic vein to the pursuits since their careful management can determine victory or stupid defeat. Obviously there is also the classic Nitro which is recharged by driving recklessly and which can be used at any time by pressing the A key to get a small acceleration boost. The racing cars The 50 plus cars included in Need for Speed: Hot Pursuit draw liberally from the imagination of the average EVO reader or from that of the Top Gear spectator. Porche Boxter, 911 S4 Targa, Carrera 3, BMW Z4, Mazda RX 8, Lamborghini Revanton, Pagani Zonda Cinque, Nissan Z350, Aston Martin One-77, Ford Interceptor, Audi TTRS, R8 and Maserati Gran Turismo are just a few names among those put on the road by Electronic Arts and including the legendary Lamborghini Murcielago of our Italian Police complete with logos and colors faithful to reality. Unfortunately, any form of tuning or personalization of the car is missing, with the exception of choosing the paint color before starting the race, but for true fans of the series this won't be a problem. And technically? Need for Speed: Hot Pursuit runs smooth as water and stable as a rock on Xbox 360 (and presumably also on PlayStation 3 and PC) but, and here comes the news that will probably make racing game super fans turn up their noses, it doesn't snap from thirty frames per second. Thanks to the absolute fluidity mentioned above, there are no particular consequences on the latency of the commands or on the responsiveness of the vehicle to our inputs but there is no doubt that the 60 FPS would have left us with a better feeling. However the vehicles are realizes", "date": "2010-11-10", "grade": "8.9"}