{"name": "Sonic comanda color", "ref": "https://multiplayer.it/recensioni/82182-sonic-colours-sonic-comanda-color.html", "text": "For too long, Sonic seemed to have lost his compass, forced between action games of dubious workmanship and even worse spin-offs, moving further and further away from the gameplay fundamentals that decreed his enormous success during the 16-bit era. In recent times, however, Sega has decisively taken the road back to its origins, first with the discreet Sonic the Hedgehog 4 - Episode 1 and now with the present Sonic Colors, an exclusive chapter for Wii and DS that places it in a modern context the mechanics that all fans of the series have come to love. And if it is still too early to talk about a real rebirth, certainly the famous blue hedgehog gives its audience one of those platformers that they really missed. Back to the basics In his latest adventure, Sonic is once again forced to face the evil Dr. Eggman, guilty this time of having built a huge amusement park in space as a cover to kidnap the Wisp, aliens with enormous powers, undisturbed. It will be up to our hero to solve the situation, launching himself into eight different worlds which are in turn divided into seven stages (including bosses) finally distinguished by a single constant: speed. Leaving aside the questionable adventure ambitions that have seriously undermined the quality of the most recent releases, Sonic returns to dealing with what he does best of all, that is to run like a wretch along levels with a two-dimensional structure, collecting rings and power-ups and destroying robots with its typical homing attack. The basic structure of Sonic Colors therefore follows in all respects that of the classics for Mega Drive, with scenarios that must be tackled literally at a hundred per hour, dividing between platforms, loops, trampolines, rails and so on, without forgetting of the numerous bifurcations that will push the most passionate fans to retrace their steps to scour every nook and cranny in search of the fastest route. However, the sources of inspiration for the title are not limited to the older exponents of the series, but also involve the most recent iterations of the franchise: with careful evaluation work, Sonic Team has extrapolated the best ideas that came out during the fluctuating adventures of the hedgehog blue in the 3D environment, and has skilfully poured them into this product. Thus, the various stages denote an excellent structural variety, emphasized by spectacular framing changes: it therefore often happens to proceed normally from left to right on a two-dimensional plane, to then find yourself in the blink of an eye with the camera switching third-person in almost rail-based sections, with the user only needing to worry about collecting rings and avoiding enemies while Sonic runs wildly towards the next section. Again, certain portions of the level bring to mind that Sonic Adventures released on the Dreamcast (and recently revived with disastrous results), thus proving to be more related to the conventional concept of three-dimensional platform and allowing the player to move freely in the scenario, perhaps looking for the solution to simple environmental puzzles. The beauty of the mix just described is that all these different styles blend perfectly within the individual stages, making the progression during the adventure very varied, as well as fast and frenetic as in the best tradition of the series. These will not be elements capable of changing the mind of those who have never particularly loved Sonic, but they are more than enough to finally give some bread for the teeth of fans who have remained dry-mouthed for too long. Wisp me up The one concerning the Wisp, the aliens that Sonic will have to save during the adventure, easily fits into the effective gameplay mechanics just described. Each of them guarantees our hero a particular power to be exploited by shaking the Remote, even if in fact their use is not exactly free, but regulated by precise level design choices: even if scripted, therefore, this is an element that definitely works good, and which rolls out a red carpet to the replay value since as you collect Wisp it is possible to go back and exploit their abilities to open new paths. Between power-ups that transform Sonic into a rocket, others that generate platforms in a vacuum and still others that allow you to literally pierce the surrounding scenario, here too we are faced with a discreet incentive for variety, which adds pleasure to the gameplay without surprising. The levels of Sonic Colors run off so well that one is almost not shocked by the substantial brevity of the adventure, all in all a necessary evil given thehe extremely fast and frantic nature of the gaming experience, which makes it possible to finish some stages in just a few rounds of the clock. The only discriminating factor is represented by a level of difficulty that tends to be calibrated downwards (especially as regards the fights with the bosses), but capable of sudden and unjustified surges in some sections that can cause you to lose a few too many lives and thus become rather frustrating. As mentioned above, however, the most avid fans will be able to devote themselves to discovering all the roads, collecting power-ups and hidden bonuses, reaching new hi-scores as well as completing a sort of Challenge Mode made up of stages specially studied for the occasion. These are also usable by two players in co-operative, but frankly the realization of everything leaves enough to be desired, making them much more enjoyable in single player. Before closing, however, the merit of having made the series reverse the trend also from a purely technical point of view must be given to Sonic Colors. From a graphic point of view, we are dealing with one of the best products available on Wii: the game is a real feast for the eyes, thanks to very rich and detailed scenarios showcased by extremely dynamic shots, all without not a single frame is lost along the way. The sound is less memorable but still satisfying, which always features very rhythmic music and the typical sound effects of the saga.", "date": "2010-11-09", "grade": "8.5"}