{"name": "Uno skateboard ci render liberi", "ref": "https://multiplayer.it/recensioni/82022-shaun-white-skateboarding-uno-skateboard-ci-rendera-liberi.html", "text": "Version tested: PlayStation 3 Halfway between ~The Matrix~ and ~V for Vendetta~, the gray world created by the Canadian division of Ubisoft for Shaun White Skateboarding is controlled by a political entity, the Ministry, which condemns enterprise, passions , colors and everything that makes life worth living. People are walking around the streets like automatons, their destiny is to work to maintain the status quo and, to make sure they don't get any strange ideas, they are kind of brainwashed. Those who rebel against the system are identified, captured and silenced, just like the famous skater (and snowboarder) Shaun White did. Conducted in prison, Shaun does not call his lawyer (provided that the totalitarian regime of the Ministry provides for a lot of guarantees), but Nick, our alter ego, who goes to visit him and receives a skateboard with a question engraved on it as a gift of paramount importance: ~Who are you?~ At this point the game editor starts, which allows us to draw the character we control starting from a base of faces, hairstyles or caps, shirts, trousers and shoes. Clearly, a certain importance is also given to the skateboard: we can choose the lower design, the upper non-slip texture, the color of the uprights and wheels. Hurrying out of prison, we will find ourselves facing a dead world and we will quickly learn that thanks to our actions we can change it. And it's not just a figure of speech: by dint of tricks, jumps and grinds we will be able to influence and change the reality of things, adding designs and colors to the gray walls (a bit like in De Blob), unhinging the oppressive tools of Ministry, giving new life to areas that were once dedicated to entertainment and even giving people their enthusiasm back. Red pill or blue pill? As explained to us by a mysterious man, therefore, our actions have the power to change things, to give society back to people. It is precisely with this in mind that the mission structure of Shaun White Skateboarding develops: by following the indicator on the screen, we will be able to access new challenges which in most cases involve the complete transformation of a place through the execution of jumps and various stunts. Everything around us can be ~grinded~ and modified, in principle, but there are things that require more effort to be converted. This is why the ~flow~ bar comes into play, which is located at the bottom of the screen and fills up as we successfully perform the various tricks. When the bar is full, we just need to go to the place to be transformed for the mission to be completed and a passage to a new area of the city appears. In addition to sidewalks, railings or even parked cars, there are ~virtual~ objects that we can use to reach otherwise inaccessible areas: these are grindable lines that develop as soon as we jump on them, ramps that ~stretch~ at the same way to allow us to jump and others that instead stretch following our commands to make us climb on raised structures. The missions that follow the storyline are joined by other, secondary ones, which take on the classic function of ancillary challenges and which must be completed for the pure sake of doing it. The control system of Shaun White Skateboarding is quite simple and is based on a few buttons: the left analog stick is used to move the character and accelerate, the right one to activate certain tricks and to perform grabs while we are in the air, the X is deputy for jumping and the Triangle allows us to get off the table if necessary. The back buttons prove to be useful for resorting to supplementary maneuvers, and in any case the introduction of new stunts is accompanied by short challenges that are used precisely to learn how to perform them. Ministry vs Resistance Shaun White Skateboarding includes three different online multiplayer modes. The first sees us challenge another player to the tune of points achieved, thus performing as many acrobatic maneuvers as possible in the time available. The second is based on the concept of an ~influenced~ surface, therefore in the same way it is necessary to perform many tricks but with the aim of transforming the environment around us. The third, and most interesting, is a team mode where one is part of the Resistance, the other of the Ministry: the aim of the first is to transform the landscape with tricks, while the second has to try to get things back to normal. Playstation 3 trophies There are forty-five unlockable trophies in the latest title developed by Ubisoft Montreal. The nineteen bronze trophiesor they are obtained by completing quite simple challenges: collecting fifty different items of clothing, converting one hundred citizens, completing thirty-five challenges and so on. For the twelve silver trophies the stakes rise, in fact we are asked to get seven thousand five hundred flows in the story mode, discover all the secret challenges, make one hundred perfect landings, etc. The only gold trophy is obtained by earning the gold medal in all challenges, while the platinum trophy as usual comes once all the others have been collected. Fifth power The narrative aspects of the game have a great initial impact and create great expectations, but throughout the first phase they tend to diminish and get lost, ultimately revealing themselves as a simple ~excuse~ to give the short missions a goal. Can our tricks restore an old skate park to its former glory? Well, but in terms of gameplay, what we will see will be precisely a sequence of maneuvers repeated until the flow bar is filled. In short, there are quite a few limits precisely as regards design. Such a powerful scenario on paper required at least some variation; the Ministry remains a dormant presence for too long, while suppressive police raids could be brought into play and our character who on occasion had to at least flee, without leaving these tasks to the final phase alone (and without even exaggerating). The controls, however simple, in some situations prove to be unresponsive and problematic, for example a different acceleration management would have been welcome to make the challenges that require the execution of high-speed tricks less cumbersome and frustrating. Then there is the discussion on the technical realization, which unfortunately moves between ups and downs. The polygonal models, beyond some details, are unfortunately very ~old gen~: angular, devoid of particular detail and animated in a barely discreet way. In some moments it seems to be faced with a good title for PlayStation 2, and the pop-up effect of some textures against the background of locations that are not all in all very extensive and not even who knows how rich in objects does not help. The transformation effect of the scenario is rendered well, but it is not enough by itself to raise the technical level of the Ubisoft product. Fortunately, the sound appears more refined, with a good dubbing in Italian, average effects and a decent musical accompaniment.", "date": "2010-11-09", "grade": "6.7"}