{"name": "Disco labirinto", "ref": "https://multiplayer.it/recensioni/82025-just-dance-2-disco-labirinto.html", "text": "Big-budget projects, big-name names uncomfortable for the occasion, leading game designers and famous protagonists? No, what Wii users want is just one thing: to dance. Or at least this is what it might have seemed looking at the sales ranking of games for the Nintendo console about a year ago, with Ubisoft's Just Dance taken lightly as if it were yet another casual title from the supermarket bin, and instead capable of entering the homes of something like 4 million or more users, maintaining the top positions in the sales charts for months on end. No less important is the fact that Ubisoft production has given birth to a new genre, destined in all likelihood to expand and evolve on all platforms, even more so in the face of the casual turn that Move and Kinect have brought in recent months. With flared trousers It is normal and obvious that gamers who like to call themselves ~serious~, and who entered the world of electronic entertainment a little earlier than the day before yesterday, look at a phenomenon such as Just Dance with disdain and snobbery. A game where you dance? Unacceptable, the real gamer does not dance. He stands motionless on the sofa, pad in hand, at most a few smug expressions in front of his own ability. And no game over even looking for it with the little light? A real affront that is not even worth commenting on, after years of dodging bullets by eliminating the final boss on the 156th attempt. Yet those who base their beliefs on these assumptions are probably missing out on something. Because the market has evolved, it has changed, and new genres have arisen which, if it is true that on the one hand they have opened the doors to a flood of titles of questionable quality and without art or part, on the other they have in any case allowed programmers and quality designers to create valid and above all fun productions. And Just Dance, and therefore also its sequel Just Dance 2 are above all this: fun, and a lot too. The fulcrum lies in the very simple concept of following the choreography of a silhouette on the screen that dances to the tune of dozens of more or less recent pop and dance songs; a bit as if we were in front of a mirror, with the only difference that reflected there is a sort of Heather Parisi (or male equivalent) of the best times, while the player tries to run after her, more or less awkwardly mimicking steps and movements from Saturday night Fever. This alone could be enough to have a couple of solo laughs, but it is obvious that a game like this literally explodes in multiplayer, with up to 4 players ready to make a fool of themselves in the same living room. And, aware of the fact that sharing shame with friends is more beautiful, hilarious duets have been introduced for this second chapter; in summary, 11 of the 44 songs on the disc have a choreography created specifically for two dancers, who interact with each other during the performance. A very welcome novelty, which certainly isn't the only one in a sequel that doesn't appear as a simple data disk with new songs; although the gameplay has remained almost unchanged - in a rather obvious way given the success achieved in the first instance -, additions such as the online store for downloading new songs become essential to guarantee the product a wider scope in the long run. Currently populated by only a dozen songs that can be purchased, the store will hopefully increase in size, thus becoming a fundamental resource of Just Dance 2. Not that Ubisoft production lacks content on disc, mind you; on the contrary, the 44 songs all immediately available are already a good number, and above all they offer a variety of artists and songs capable of satisfying anyone's tastes (obviously always within the pop sphere). A neo in this sense can be found in the fact that not all the songs are original, but on the contrary there are several covers of rather fluctuating quality. Instead, what is difficult to criticize is the goodness of the choreography, different for each single motif and impeccably created by real dancers from which the silhouettes were then drawn. However, it is clear that Just Dance 2 is not an accurate simulation or a precise teaching tool for learning to dance, but rather a ~light~ product to be taken simply as a source of carefree entertainment, preferably with friends. An obligatory premise in the face of the movement detection system, certainly not very refined or impeccable, relying simply on the feedback of the Wiimote alone squeezed in the right hand of each user. The tracklist 1. Avril Lavigne - ~Girlfriend~ 2. Bangles - ~Walk LikeAn Egyptian~ 3. Beastie Boys - ~Body Movin' (Fatboy Slim Remix)~ 4. Benny Benassi presents ~The Biz~ - ~Satisfaction~ 5. Blondie - ~Call Me~ 6. Bollywood - ~Katti Kalandal~ 7. Boney M. - ~Rasputin~ 8. Charleston - ~Mugsy Baloney~ 9. Cher - ~The Shoop Shoop Song (It's In His Kiss)~ 10. Digitalism - ~Idealistic~ 11. Donna Summer - ~Hot Stuff~ 12. Elvis Presley - ~Viva Las Vegas~ 13. Fatboy Slim - ~Rockafeller Skank~ 14.Franz Ferdinand - ~Take Me Out~ 15. Harry Belafonte - ~Jump In The Line~ 16. Ike & Tina Turner - ~Proud Mary~ 17. James Brown - ~I Got You (I Feel Good)~ 18. Jamiroquai - ~Cosmic Girl~ 19. Junior Senior - ~Move Your Feet~ 20. Justice - ~D.A.N.C.E.~ 21. Ke$ha - ~TiKToK~ 22. Mardi Gras - ~Iko Iko~ 23. Marine Band - ~Sway (Quien Sera)~ 24. MIKA - ~Big Girl (You Are Beautiful)~ 25. Outcast - ~Hey Ya!~ 26. Quincy Jones & His Orchestra - ~Soul Bossa Nova~ 27. Reggaeton - ~Baby Girl~ 28. Rihanna - ~S.O.S.~ 29. Snap! - ~The Power~ 30. Sorcerer - ~Dagomba~ 31. Studio Allstars - ~Jump~ 32. Studio Musicians - ~Crazy In Love~ 33. Studio Musicians - ~Jungle Boogie~ 34. Supergrass - ~Alright~ 35. The Frighteners - ~Monster Mash~ 36. The Hit Crew - ~Holiday~ 37. The Hit Crew - ~Toxic~ 38. The Jackson 5 - ~I Want You Back~ 39. The Pussycat Dolls - ~When I Grow Up~ 40. The Rolling Stones - ~Sympathy For The Devil (Fatboy Slim Remix)~ 41. The Ting Tings - ~That's Not My Name~ 42. The Weather Girls - ~It's Raining Men~ 43. Vampire Weekend - ~A-Punk~ 44. Wham! - ~Wake Me Up Before You Go Go~", "date": "2010-11-03", "grade": "8.0"}