{"name": "Per arrivare all'alba non c' altra via che la notte", "ref": "https://multiplayer.it/recensioni/82006-the-sims-3-late-night-per-arrivare-allalba-non-ce-altra-via-che-la-notte.html", "text": "The Sims 3 expansions led us for the first time to explore holiday territories, in search of relaxation and adventures, making us feel a little bit archaeologists and a little vacationers. The second instead led us to analyze another of the cornerstones of human life (and simina): that of the working career. This third expansion, The Sims 3: Late Night, instead takes us to experience all the frenzy, charm and sparkle of modern nightlife, between high-fashion clubs, others a little more underground and some surprises around the corner , especially if the bartender offers us a Bloody Mary. In short, everything is aimed at exploring the night, at our Sims' desire to party and also, why not, at the drive that always leads them to aspire to success, taking advantage of the starlit stage of a slightly less bucolic and a little more urban. If you are city animals and indecorously suffer the charm of the night, continue reading to find out if this expansion will be able to satisfy your appetites revelers. Stardust The first thing we have to talk about is certainly the setting in which this new expansion leads us to take our steps. We are talking about Bridgeport, a modern town that gives a nod to Manhattan, with skyscrapers where the nightlife is expressed in all its characteristic city life. There is obviously no shortage of suburbs, for those who instead of living in an apartment prefer to maintain their living habits in the more classic country houses, but it is clear that the urban center remains the one who wants to set the tone. In fact, it is precisely in it that real life meets its development, with shops and services and even a subway network that whisks us from one point of the city to another. Not that it's particularly useful, to be honest, considering that its dimensions are quite small and that today even the smallest of Simmers owns a car, a bike, a scooter or any means of locomotion that doesn't force you to go on foot . A applause to the realistic effort, in any case. It should be noted that skyscrapers, although theoretically they should house numerous family lots, in reality they apparently behave like houses, thus allowing only one family unit to be hosted at a time. The same thing applies to those occupied by commercial premises such as night clubs: it is not possible to live in them as they are somehow already ~occupied~. The choice is obviously only pertaining to personal taste: the writer prefers to live on the edge of urban centres, where he can afford a beautiful swimming pool, which this time can be built in all shapes, including curves, and it is even possible to apply windows to being able to do underwater exhibitions that our guests can enjoy from the basement. Of course, in the countryside the car becomes necessary, in the city it is not possible to keep it due to the lack of a garage, and in this case the subways can be really useful. Medals with various reverses, in short, it's up to you to decide what is an advantage and what is a defect. But obviously the focal point of Late Night is not where to live, but what to do with your Sim-life. In this sense, a ~new~ celebrity system intervenes, to be honest already glimpsed in the first chapter of the simulation trilogy, the ~old~ Superstar, which among other things introduces a series of benefits to the daily grind, such as the possibility of hiring a butler who, however expensive, will take care of everything that pertains to domestic life: washing, cooking, giving us a massage and, if necessary, satisfying prudence. There are of course new careers added, basically focused on the world of music and cinema: we can become symphonic or rock musicians, learn to play various instruments including piano, bass, electric and classical guitar and drums and thus climb the peak of success to become real stars. There's also a new profession added: it's called ~mixology~ and basically it's the job of the barman and the ability to create new and perfect drinks. Please don't bite me on the neck And when the sun goes down our stars better be up. Let's talk about those that characterize the focal point of the Late Night Celebrity System and also the one that most poses a level of challenge to us: becoming an absolute celebrity and literally having all the doors of ~people who matter~ open. Celebrity star status is particularly important because it allows us to enter exclusive venues that would otherwise be closed, unless of course we manage to sneak inside by evading the surveillance of the bouncer. A good way to increase our stars is to meet otherand star and try to impress them, thus gaining their attention and consequently making us famous of their fame. Among other things, we must consider the factor ~paparazzi~ who circle the stars and who will notice us if we are in their company, helping us on our way to stardom. This is naturally one of the coins with a double reverse: if on the one hand photographers and self-styled reporters help us ride the tiger, on the other hand they will be able to gossip about us and publish indiscretions about us which could lower our level of fame, throwing us mud on that it will be difficult to shake off. Among the advantages of being famous, among other things, we cannot fail to notice the various discounts that we will get both in clubs and in shops or in other public establishments and which will help our finances. As our fame spreads we will also receive a series of gifts that are not purchasable in the store, such as exclusive pieces of furniture such as a really nice hot tub but too big for our apartment on top of a skyscraper. If you choose a musical career or even if you just like to play, then the option that allows you to form a band with friends or other stars that we will meet here and there or with whom we have enjoyed entertaining ourselves in various jam sessions should not be overlooked . At this point it will be possible to perform with the full band and continue to project our Simmers on the red ribbon of glory. But perhaps the funniest part of this expansion is that relating to the true lords of the night: the vampires. They hang around us, and they're not satisfied with a can of True Blood it seems. Vampires can be found in various places in the city and we can make friends and relate to them exactly as we would with ~normal~ Sims. With one more option: that of asking him to turn us into vampires, which also has advantages and disadvantages in this case. As vampires we can move faster, we can choose to feed from plasma bags to keep in the fridge or from other sims, even if friends don't bite unless they ask us to. You can also grow ~bloodfruit~ or buy it in the shop. The real problem is that as vampires we are forced to hide in the light of the sun, a problem that can even seriously afflict our working careers if we fail to organize ourselves in the best possible way. Preferring stone sarcophagi over beds may also be considered a problem, and marriage to an untransformed Sim may suffer. On the other hand, however, vampires can have children and the children are born apparently normal, except for having red eyes and a pale complexion. When they become young adults, however, they may transform automatically. There are many, although not very many, the additions of this new expansion. For the umpteenth time we find ourselves talking about the sides of a coin in our overall considerations: if on the one hand Late Night has the advantage of taking us out at night and giving us something more interesting to do than previously possible, leading to a new level the social interaction sector of the game, on the other hand it doesn't add much and risks running out much sooner than the previous two expansions did. It is decidedly a purely subjective factor, even if our impression is that the meat on the fire is decidedly less. A must, without a doubt, for fans of the series but probably not as appreciable as the other expansions by those looking for a greater variety of gameplay, such as that offered by the explorations of Travel Adventures or the bizarre careers of Ambitions.", "date": "2010-11-03", "grade": "8.0"}