{"name": "La Guerra del Clone", "ref": "https://multiplayer.it/recensioni/81865-star-wars-il-potere-della-forza-ii-la-guerra-del-clone.html", "text": "Tested version: Xbox 360Creating a game based on the Star Wars universe has never been easy and this since the dawn of the first videogame productions for cabinets and consoles. Over the years, these difficulties have then been accentuated both by the evolution of technology and by the change in the tastes of gamers, certainly much more sophisticated than in the past, who required much more sophisticated productions in terms of quality. Without forgetting the objective difficulty of creating something new from a narrative point of view without going too far from the tracks of the main story. Yet two years ago, in 2008, LucasArt succeeded in the titanic enterprise, and with its Star Wars: The Force Unleashed, set between the III and IV chapters of the films, created an all in all valid product, awarded with seven million of copies sold. This element has obviously influenced the design of a sequel, the one we will analyze in this article, like George Lucas's desire to expand the universe he created in new directions. In this second episode, titled Star Wars: The Force Unleashed II, players will return to impersonate Starkiller, to be precise a clone of him (but will it really be like this?) created by the evil Darth Vader on the planet Kamino, a world of the Outer Ring above which stands a clone factory. While the galaxy is on the brink of civil war, a group of rebels is ready to launch the attack aimed at overthrowing the Galactic Empire, and the Jedi Knight Rahm Kota has been captured by enemies who have thus deprived the Alliance fleet of its leader. In between Darth Vader has a plan in place that will put an end to his apprentice's legacy but the latter manages to escape to try to give an answer to those flashbacks about the past that hover in his mind. The fugitive And it is precisely the escape from Kamino that constitutes both the first of the nine chapters that make up the story around which the facts narrated in Star Wars The Force II revolve, and the leitmotif of almost the whole story. The basic formula of the product is always that of the previous chapter: an adventure that places a strong emphasis on the action phases without particular concessions to other genres or variations on the ~fight and advance~ theme. But this time, however, everything is built on a cinematic structure that evolves and makes events evolve as if it were a film, without interruptions of any kind, involving the gamer with very captivating gimmicks, shots and situations. Basically Star Wars The Force Unleashed II therefore recalls those old two-dimensional hack & slash of the past, although obviously here we are faced, in many respects, with a clear evolution of the genre. Except perhaps for the combat itself which remains underdeveloped in the melee part, since as a tradition for the genre it almost always resolves itself in the usual frenetic push of a button at the expense of a certain strategy which is consequently reduced to a minimum. And this also because of the few offensive variants proposed by the enemies, from the smallest to the biggest, which turn out to be always the same on balance, and their artificial intelligence, a real Achilles' heel of the previous production. The CPU performs slightly better this time around, with Empire soldiers either taking cover or chasing Starkiller to a certain extent instead of standing still when he moves out of range, but still there's not that leap forward that would he expected. So much so that in principle the computer always relies on increasing the number of opponents on the screen to increase the level of challenge, rather than on tactics or logic. Which among other things sometimes leads to repeating certain passages several times with a certain amount of frustration. If nothing else the checkpoints are well distributed. Attack on the Empire On the other hand, the speech is better for the many variations offered by the protagonist's skills. Here are the most consistent novelties of the production. First of all, the protagonist can now wield two lightsabers. Thanks to this feature, the gameplay varies from the previous game, especially as regards the creation of the combos. The above weapons can be upgraded with the help of particular crystals which not only modify their color, but give additional powers in attack or defense. In this sense, the possibility of being able to equip each lightsaber with a different artifact is interesting, for example you can insert the one called Meditation, which allows each successful hit to restore the energy of the Force, in the first while in the secondfrom the one called Heal which allows you to recover health. Also from the point of view of physics, the new engine used for the game does its job very well. Making crates, enemies and pieces of iron fly left and right is a real pleasure and all the movements are extremely realistic, as well as cutting enemies to pieces by seeing their limbs roll on the ground or performing deadly combos that are finally extremely fluid compared to the old episode and at the same time with a more marked sensation of spectacularity. Furthermore, they can be interrupted at any time, thus solving that tedious problem that existed when fighting for example on the edge of a platform and because of a series that could not be interrupted, one ended up falling into the void. In Star Wars: The Force Unleashed II the use of powers has also significantly improved, which are also less cumbersome than in the past and more varied, given that in addition to those we got to know in the previous chapter there are new ones . Xbox 360 goals Star Wars: The Force Unleashed II offers 50 achievements to unlock. As always, to obtain them you have to satisfy various requests with increasing difficulty of the game, such as eliminating a certain number of mechanical spiders or convincing 10 Stormtroopers to throw themselves into the void or still shooting down a dozen TIE fighters. The Force be with you For example, we find the Mental Trick, an ability thanks to which Starkiller can take possession of the minds of his opponents, forcing them to fight for him against the Empire or making them commit suicide. All these powers, as always, can be improved through the appropriate menu that can be called up with the select key. Proceeding in the adventure you can recover through the holocrons - virtual boxes of various colors - the points of the Force that are used to level up and various other types of specific points to learn new skills such as for example combos or expansions of the powers of the Force. expendable through a progressive and role-based enhancement system. However, the development is rather free and therefore you can choose what to improve based on your way of playing. It is also possible to unlock new costumes, some to be used immediately during the game. Despite the variety of possible combinations for the moves, they remain easy to use. The left analog stick serves as in the first episode to move Starkiller, while the right one is used for camera movements. The four upper buttons of the pad, proceeding clockwise, are instead assigned to jump, lightsabers, throw lightning and push, a devastating shock wave that hurls enemies or smaller objects away. Finally, the back keys are associated with other commands such as blocking and levitating enemies and objects, which can even be eradicated from the scenario, shooting and locking opponents. The system of hooking objects and enemies although improved compared to the previous episode, however, still appears imperfect. Although extremely useful and fun: it is still a good experience to block a missile in flight and to throw it back to the robot that launched it. Graphics and sound From the combination of the various keys it is then possible to carry out all the moves related to the power of the Force, such as Grip or Repulsion to repel enemies, while pressing the two analog levers at the same time enters Force Fury mode, a phase which gives the protagonist a enormous power making him invincible and stronger for a few seconds. The flow of the game is finally enriched by short platform and puzzle sections in which to combine agility and use of powers, and by boss fights, some of which, like the Gorog, are enormous. In these cases, in addition to carefully using the combos and Strength, perhaps carefully planning how and where to strike, the user can take advantage of a series of inevitable quick time events that allow him to inflict further damage to monsters or the coup de grace (depending on the moment in which they are performed) with that touch of spectacularity that never hurts. Given the absence of options for online or multiplayer, and a longevity that stands at six, eight actual hours of play, other modes have been added in addition to the main one: they are Select Level, which allows users to choose any session of the adventure to be completed, and Challenge, which consists in facing some particular tests to collect points, such as for example preventing the soldiers of the Empire from escaping from a training area or resisting attacks as much as possibleby Darth Vader. Then there is an extra session containing a database full of information on all the characters, good or bad, of the video game with cinematics and concept art. But nothing more, and it's a shame. We conclude this article talking about graphics and audio. The only suitable term to define the visual appearance of Star Wars: The Force Unleashed II is ~spectacular~. Graphically, in fact, the product turns out to be of excellent workmanship, much improved compared to the previous episode to the point of being able to compete without problems with the best productions of this generation of consoles, with very accurate and detailed characters, refined textures, breathtaking views and successful quotes . Without forgetting a direction that, supported by excellent cinematic sequences, manages to make the whole interesting from a narrative point of view, completely immersing the gamer in the universe created by George Lucas. To further corroborate the feeling of total identification with the story, a sound sector is added which offers, in addition to the usual excellent soundtrack taken from the film saga, an excellent dubbing in Italian and a sampling of high-impact effects.", "date": "2010-10-29", "grade": "7.5"}