{"name": "Cut the Rope Remastered", "ref": "https://multiplayer.it/recensioni/cut-the-rope-remastered-recensione.html", "text": "If you are reading the review of Cut the Rope Remastered, you are probably familiar with the puzzle series developed by the Russian team ZeptoLab, which made its debut on mobile devices in 2010 and immediately met with extraordinary success, totaling over a billion downloads to date Over the years, the franchise has produced several episodes in which the developers enjoyed creating ever new challenges that the likeable protagonist, Om Nom, would have to overcome from time to time to munch on the much coveted candies, a successful mix of physics , reflections and experimentation which is now also available on Apple Arcade. Structure Cut the Rope Remastered, Om Nom and the stars to collect in a level. Cut the Rope Remastered is a reinterpretation of all these experiences, a real ~memory book~ that the family of the funny green character dusts off thinking about the adventures of the past, as part of a short-lived campaign, currently made up of five thematic chapters each divided into twenty-five stages. The formula is always the same: each level represents a problem to be solved, there are three candies that we must somehow get to Om Nom's mouth and as many stars to collect to total those necessary for the unlock the next world, in the most traditional of progression systems on mobile. Cut the Rope Remastered, a stage where bubbles, bellows and suction cups are introduced. The presence of hidden prizes places an emphasis on the replayability of certain sections, adding extra challenges that will not be easy to overcome and which imply a trial & error approach, however limited to the desire to obtain everything, absolutely everything the game has to offer . In fact, it is also possible to proceed expeditiously, collecting the minimum of stars and still enjoying the journey. This type of setting clearly lends itself to various interpretations: those who simply want to relax with the puzzles of Cut the Rope Remastered will be able to complete the stages as they see fit and quickly move on to the next ones to find out what the authors have gone to fish out from the classic chapters of the series, but nothing will stop him from retracing his steps and perfecting his performances. Gameplay and graphics Cut the Rope Remastered, a stage with chains: to break them you have to hit them with blades. Also on the gameplay front we find the usual mechanics, which is completely normal considering the nature of this production, which, as mentioned, re-proposes situations present in the various episodes of Cut the Rope. We will therefore have to cut strings, observe the oscillation of the candies tied to them, interact with various different devices and find the right method each time to complete the challenge. It is true: sometimes one gets the feeling that the puzzles proposed by the game slip away in an far too fast, and in fact completing the campaign doesn't take long; or that the many hours spent with the classic chapters may have ~saturated~ us, making this reinterpretation less attractive. Certainly the Cut the Rope Remastered system still works very well today: the touch controls are simple and precise, but above all the proposed situations offer a large number of variations on the theme, introducing from time to time suction cups, bellows, soap bubbles , chains and even spells to give life to ever new and different puzzles. As for the graphics, the remaster created by Paladin Studios abandons the hand drawings and the cartoon style in favor of a polygonal solution, again very colorful and nice, but generally devoid of the original charm of Cut the Rope, which was also related to those techniques.", "date": "2021-05-19", "grade": "S.V."}