{"name": "A caccia di non-morti nel Far West!", "ref": "https://multiplayer.it/recensioni/81808-red-dead-redemption-undead-nightmare-a-caccia-di-non-morti-nel-far-west.html", "text": "The Game is available for download on the PlayStation Network and Xbox Live service Tested version: Xbox 360Here finally comes the latest expansion pack for Red Dead Redemption, an unprecedented and new ~world~ immersed in the Far West macrocosm expertly created by the Rockstar studio. Despite being faced with a finely detailed and alive sandbox precisely by virtue of all the countless clichs that characterize the American West, this time (perhaps to celebrate the arrival of Halloween worthily?) the new events, enemies and settings wink to the horrorific imagery rather than spaghetti-western: an unpredictable infection is turning people into zombies! As John Marston it is once again our task to ~take the reins~ of the situation (and of the horse!) to try to stop the unstoppable bleeding of the virus. Find them... kill them... burn them! Undead Nightmare introduces a brand new single player campaign that will see us take on the role of the old tobacco chewer John Marston, but with totally new and at least bizarre objectives and challenges. New enemies, undead, zombie animals and never-before-seen creatures are the leitmotif of this brand new DLC that will delight all thrill-seekers, and of course the Far West. Although the idea of using the zombie universe is certainly not new in the world of video games, no title had ever exploited it in an ~open~ world like that of the sandbox belonging to Red Dead Redemption. Not only cities, shopping malls and cemeteries therefore, but a huge open space to explore full of totally new details, settings and twists. The creatures encountered are of various types and types: they range from the ~normal~ undead to the smaller and faster ones, passing through the more robust and violent, albeit slow, up to the ~retchers~ who have the ability to strike from distance with shots of toxic green bile (someone said Left for Dead?). The cities are literally stormed and the survivors resist inside the protective fences, with increasing difficulty. Among the many of the new missions to be accomplished, that of helping countries in difficulty and freeing them from the zombie attack. Even the cemeteries, located outside the towns, are infested with putrid and rotten hordes, acting as a ~gathering point~ and ~birth~ for new creatures. It is our task, during the main adventure, to find and destroy them to ensure that the number of the undead population is constantly calibrated downwards. To face the army of evil, conventional weapons may not have been sufficient for the purpose, which is why the developer Rockstar has introduced new and exciting killing methods: holy water, which literally makes them vaporize, explosive mines to eradicate entire hordes ravenous, plunger rifles that have triple firepower, more devastating shells. The arsenal, thus renewed, is much more effective for the cause. Basically, the main adventure of Undead Nightmare consists of the nefarious killing of creatures and undead, but not only. In addition to saving entire villages, like a good bounty-hunter we also have to search and find missing people in the ~clean zones~, areas virtually cleansed of zombies, but still devastated by the resistance. The gameplay though, could bore many after a while as it's basically go-kill-find-come back. It all just depends on your passion for killing zombies. To cheer up our outings in the haunted territories, fortunately for us, bizarre and very powerful mythological creatures get involved: the four Horses of the Apocalypse, each of which with specific destructive characteristics. The Horse of War, with its flaming cloak, can take out hordes of zombies just by passing; the Horse of Death can explode the heads of the undead instantly; those of Famine and Pestilence however, have infinite stamina and cannot be slain by evil creatures. To complicate things a bit, to face our blessed Horses of the Apocalypse, however, there will not only be people in an advanced state of decomposition and the like, but also animals whose psycho-physical characteristics have been drastically changed by the virus. Here then appear the grizzly-zombie, the infected cougars, and why not, the zombie horses (yours too, if he dies!), which represent a real problem when encountered in the wastelands of the West. Curiosity At the end of November, Rockstar will launch a standalone package (that does not require the original game) containing all the additional downloadable content already released for Red Dead Redemption. The list is long and quite intIt is exciting since this special packaged version will contain the Outlaws to the End, Legends and Killers, Bari and Budgiardi DLCs and all the free roam multiplayer modes released. All at the recommended price of 29.90. Stay tuned to our pages for more details that will surely not be long in coming in the coming weeks. Not just zombies Undead Nightmare, as well as the previous DLC of Red Dead Redemption, is not just a few more weapons and enemies: it is a completely new story, many unpublished items and weapons, new locations, settings and characters (in addition to the return of some old ones... unexpected!): almost a totally new game that refreshes the original gameplay even with additional game modes, in addition to the single player one. By connecting to Xbox Live, in fact, the ~Undead Assault~ mode appears, very similar to the ~Horde~ of a Gears of War 2, in which in the company of three other friends we have to resist continuous and incessant zombie attacks, with a exponential growth of difficulty and number of enemies. There is no end, other than the one where all players die or time runs out. This mode also has its own online leaderboard to compare scores and achievements with our personal friends list. The other mode included in this DLC pack is called ~Land of Conflict~, and although it has nothing to do with the zombie-like characterization of this chapter, it adds a new type of gameplay to online multiplayer. To start playing it, just visit one of the seven places where the mode can be activated (Armadillo, Blackwater, Chuparosa, Escalera, Las Hermanas, MacFarlane Ranch and Thieves' Den), look for the activator and enter the game. In this case it is a sort of ~conquer the territory~, in which we must defend a given area from the intrusion of enemies, who, in turn, can conquer our fort. At the end of the game, the CPU distributes experience points to all those players who have maintained control of the territory, in percentage proportion to the time spent dominating. Just like the previous DLC dedicated to the Red Dead Redemption universe, this Undead Nightmare too represents exactly what every software house should do with downloadable content from the internet: not mere extensions of the base game hidden by the physical release, but real stand games -alones that use the graphics engine and the pre-existing world of the title purchased on physical support, adding not only weapons and enemies, but also unpublished stories, characters and adventures.", "date": "2010-10-28", "grade": "9.0"}