{"name": "Una sala giochi in casa", "ref": "https://multiplayer.it/recensioni/81376-great-party-games-una-sala-giochi-in-casa.html", "text": "The Nintendo Wii toy library is well stocked with collections of family games contained in a single DVD. And basically it is also normal that it is so considering the very nature of the console, which has always been oriented mainly towards an audience of so-called casual players and which for this reason too has been able to conquer the hearts of millions of users over the years, weaning and enticing them to play even those who had never tried a video game until then. Great Party Games, the game we are about to analyze, belongs to this category of products. Basically, the title created by the O Games team offers users the beauty of twenty different sports or activities to tackle alone or in company: among them, in addition to the classic ping pong, you will find our table football (here called fussball), darts, bowling, air hockey, dodgeball and many more. Each of them is clearly characterized by a different playability, by its own rules and by levels of difficulty related to both the type of sport and the user (that is, you can select the difficulty in advance taking into account your age and ability and that of your friends). How to play: first of all you have to position yourself in front of the TV with the Wii Motion in your hand. The latter in relation to the game you have chosen to play will act from time to time as a virtual hand to throw darts, as a cue to move the fussball men or as a racket to hit the ball, just to name a few. Based on the movement of your limbs, thanks to the detection that the appropriate peripherals and the console perform on them, everything will then be coordinated with the actions performed by the virtual character or by the reference element on the screen (for example the viewfinder). Parlor games room In these situations, the general response of the commands, except in rare cases where there is a slight delay between the player's movement and that on the television, is good. And this regardless of the possible use of the Wii MotionPlus which is supported by the game, but whose presence on balance does not seem to increase the accuracy of shots or shots as much as it normally should. As if it were an option added at the last moment. However, the controls are confirmed to be intuitive and accessible to anyone, even beginners, which fits perfectly with the idea of a product which, as we mentioned in the introduction of this article, clearly does not aim to realistically simulate the aforementioned sporting activities, but rather seeks an easy way to entertain people in an interactive and dynamic way. But without taking yourself too seriously and stressing the player with dozens of options or exaggerated difficulty levels. Given its nature as a video game strongly aimed at group use, Great Party Games gives its best in the multiplayer mode both with the screen split in half simultaneously and in turns, i.e. each player will complete a challenge and then give way to the turn next to friends. Graphically, the game can be defined as fluctuating, in the sense that the qualitative level of the scenarios varies according to the activity that takes place. In practice there are environments and scenic elements that are more cared for than others which instead seem to have been created with less accuracy. In all cases, however, the visual aspect of the production is not the best, especially if we compare the graphics of Great Party Games to that of other similar products. While from the sound point of view, if we exclude the audio effects inherent in the environments and noises, all in all similar to the real ones, we note the presence of the classic tunes typical of almost all titles of the genre: repetitive songs tending to get annoying after hours listening, but paradoxically catchy and appropriate to the context in which they were inserted. In conclusion, wanting to give a final judgment on the game, we can say with certainty that it is not at the level of the best of this type of product such as the always valid Wii Sports. However, it remains a decent title to try, to play in the company of a group of friends or relatives to spend a few carefree hours, especially now that the cold autumn has arrived.", "date": "2010-10-18", "grade": null}