{"name": "Luci e ombre", "ref": "https://multiplayer.it/recensioni/81551-la-torre-delle-ombre-luci-e-ombre.html", "text": "Much awaited by Wii owners, The Tower of Shadows finally arrives in stores and does not betray expectations, actually presenting itself as an original product, full of interesting ideas and full of atmosphere. The introductory sequence sees a boy suspended in mid-air, on top of a very high tower that stands in the middle of what appears to be a desert. At one point a masked man approaches him, a sort of halberd materializes in his hands and with it he effectively ~detaches~ the shadow from the young man, to then grab it and throw it into the void. The player controls this shadow, which after being awakened by the touch of a tiny fairy named Spangle decides to face the tower and its dangers, climbing from floor to floor until it reunites with his body. It will not be an easy undertaking: the world of shadows, as it is easy to imagine, reflects reality in an often distorted way, and it is enough to move a light source for everything to change radically. It is a concept to which the title developed by Hudson Soft is particularly fond, and which in the end constitutes the only element capable of proposing variations within an otherwise rather classic and linear gameplay. Indeed, in its basic mechanics, The Tower of Shadows is very reminiscent of the original Prince of Persia (or the unforgettable Flashback by Delphine Software): our character jumps from one platform to another, clings to the ledges and pulls himself up , at one point he picks up a sword (or rather, the shadow of a sword!) and uses it to fight against the numerous creatures that infest the scenarios. The display of a certain simplicity in the approach to the fights is also a clear reference to the platform classic created by Jordan Mechner: the shadow performs three-hit combos, but is forced to retreat quickly when the enemy counterattacks and this makes the duels a sort of ~hit and run~ without particular depth. Each floor is a puzzle However, the fights are not the strong point of the game, on the contrary they play more of a side role than the resolution of puzzles based precisely on the contrast between dark and light. To pass a stage and move on to the next, continuing the climb to the top, you have to collect three special objects essential to break through a dark wall at the end of each level. The search for these objects is clearly very simple at the beginning, and involves moving from one platform to another in a sort of introductory phase which aims to familiarize us with what we see on the screen, i.e. to interact with the shadows of the platforms rather than with the platforms themselves. As you go up, however, things get more complex and new elements are introduced. First of all, the switches, which must be identified by moving Spangle on the screen (the fairy moves following the infrared pointer of the Wii-mote) and holding down the B trigger: once activated, they can move portions of the scenario, consequently modifying the shadows projected on the walls and creating handholds or platforms that we can use to reach otherwise inaccessible areas. Secondly, the selectors, vertical or horizontal, which move the light sources, distorting the reality to which our character must refer with the aim of opening passages or decreasing the distance between one point and another. And finally the ~portals~, which transport us to a parallel dimension almost completely devoid of light, a place from which we must try to get out using a series of mechanisms which rotate the environment creating fascinating optical illusions. However, there is no shortage of levers, timed mechanisms, traps and occasionally some ~fragment of memory~ that reveals small slivers of the plot while making us more resistant to attacks. To understand all the background, however, there is no other way than to complete the climb and face the fearsome shadow monster who will start chasing us at a certain point... Alone in the dark After a few hours of play it becomes clear that the true protagonist of La Torre delle Ombre is its artistic direction: the character we control is a simple shadow, and as such has no real characterization, but draws its strength from the set of elements, interactive or not, which constitute the scenario and which carry forward the particular narration of the Hudson Soft product. The constant alternation of more or less complex puzzles inevitably makes the experience a bit heavy, especially if we decide to face it through long sessions, but the gameplay remains enjoyable and the presence of a few checkpoints in this case manages to make the adventure an a little longer lasting, given that sometimes in the event of death it will be necessary to start the internship all over again. Graphics and sound play an extremely important role within the project, due to a series of stylistic choices that make both very essential and ~delicate~ in their own way. Perhaps more was expected in terms of variety and detail, considering the fact that there are no complex polygonal models to manage, but in the end the result is perfectly functional to the action and perhaps a different approach would have clashed with the atmosphere.", "date": "2010-10-18", "grade": "7.8"}