{"name": "Sonic the Hedgehog 4: Episode I", "ref": "https://multiplayer.it/recensioni/81490-sonic-the-hedgehog-4-un-ritorno-supersonico.html", "text": "Despite the halo of skepticism that now accompanies every new release of the blue hedgehog, the expectations for this fourth chapter of Sonic The Hedgehog were quite high. In fact, the mere fact that it was a platform with a totally two-dimensional structure was enough to fuel the hopes of the fans, while the substantial delay in the release restored confidence even to those who turned up their noses at the sight of the first moving images. A few days before the XBLA, PSN and WiiWare version, we thus tested the iPhone and iPod Touch port, enhanced by SEGA and Dimps both thanks to a slightly anticipated debut and the addition of small ideas that make use of the device's accelerometer and touch interface. The first chapter of a full-bodied trilogy, Sonic 4: Episode 1 is neither a remake nor a sequel, since the developers have taken the levels and style of the first Sonic for Mega Drive and enriched them with some more or less new interesting. Back in blue In a clear attempt to attract longtime fans like a magnet, SEGA has revived four worlds present in the first historic chapter of the series: from the green hills of Splash Hill to that Lost Labyrinth full of traps, from the chaotic Casino Street to the sinister Mad Gear. Some changes were inevitable, but the feeling of being back in 1991 is quite strong. For better or for worse, of course. Each area is made up of three levels that the player can complete in any order, but only once they have all been completed is it possible to face dear Dr. Eggman aboard his improbable inventions. However, the fact that even the boss battles have remained almost unchanged turns out to be a bitter disappointment: dodging Eggman's huge wrecking ball is no longer as fun as it was twenty years ago, and underneath you miss the little ones ideas that tried to refresh the clashes of the controversial Sonic Rush. The iPhone version of Sonic 4 offers two different control systems, one using the accelerometer to move, and the other a virtual stick. If the first is a real disaster, often leading to falling from small platforms or failing even the most trivial jumps, the second solution turns out to be much more comfortable and, ignoring some rare occasions, one has no nostalgia for the tactile feedback given by an analog stick and keys. The Seeking Attack is a new ability that allows you to lock onto an enemy in an instant and strike him in flight, useful both for getting rid of long lines of opponents and for moving faster. Some extra levels are then the pretext to make the iPhone user gloat: in these special scenarios it is necessary to lead Sonic towards the Chaos Emerald, rotating the labyrinth in which he is located thanks to the movement sensors present in the device; the time limit imposed on the player adds a pinch of anxiety and frenzy to these sessions, but in the end they remain rather simple-minded and certainly not very stimulating. A much more interesting addition is on the stylistic level: unlike the other versions of the game, when you do a loop the loop on the iPhone the camera follows Sonic step by step and rotates in turn. Nothing striking, it is clear, but it is a surprisingly pleasant gimmick to see, if not, and here comes the pain, one of the few things that have succeeded in the entire artistic realization of the game. In fact, several scenarios are dull, devoid of any charm, while everything is ruined by poor and neglected backdrops, and even the model of a slightly too lanky Sonic manages to be very little charismatic. The result is a Sonic chapter without a clear personality of its own, which wants to be a remake but also a sequel, wants to propose new graphics but remain faithful to the original, unfortunately ending up being neither fish nor fowl. It rounds off, so to speak, an all too neglected technical achievement, which starts from the total lack of support for Retina Display and arrives at the sensational drops in framerate on certain devices: on several occasions, in fact, the game has shown slowdowns both on an iPod Touch 2G than on a very modern iPhone 4. It is clear that, with a little effort, one can turn a blind eye to certain shortcomings and appreciate a game that ultimately manages to entertain as only a Sonic chapter in 2D can do, but the impression is that the developers have not valued enough a portable version which, with more care and less questionable stylistic choices, would have nothing to envy to the console counterpart. The tested version is 1.0.0 Price: 7.99 App Store links", "date": "2010-10-14", "grade": "7.8"}