{"name": "Tiger Woods PGA Tour", "ref": "https://multiplayer.it/recensioni/tiger-woods-pga-tour.html", "text": "Spin the ball, spin the ball Perhaps not many would have bet on it, but the EA Sports game is one of the few for DS that can also be controlled using only the stylus and touch screen. What benefits above all is navigation in the menus, intuitive and pleasant even if sometimes the program seems to respond with a millisecond of delay; but it's above all once you get off the Tee that this DS version shows what it's made of. First, however, a reassurance, namely that the simulation is all there: all the parameters to consider are present, some beautiful and readable on the game screens, others to be appreciated more carefully by taking a look at the hole. The physics of the ball is also the realistic one to which all Tiger Woods players are used to, a little less those who only play more arcade golf; the challenge that Tiger Woods offers on DS is therefore not absolutely ~watered down~ by the fact of being a portable version, and novice players will probably have to acquire a lot of experience before starting to master clubs and balls decently. We were talking about the game action: the first thing to do after having carefully considered all the above parameters (shape of the hole, differences in height, wind...) is to choose the area of the hole in which to direct the ball; this can be done with the stylus, but you will soon realize how much the directional pad is more precise and less ~inertial~, even if slower. Not bad And then we come to the actual pitch; by operating the practical ~pocket Caddy~, in addition to receiving valuable advice, you can select the club, but it is probable that you have already changed it in the previous phase, and the type of shot among the five that the game offers, not all of which can be used with all clubs. The effects also vary a lot and each game situation has its most suitable shot: the experience and advice of the Caddy will do wonders. Once all the choices have been made, we arrive at the Swing, the true heart of golf and, as always, also of this series. Let's Swing again While practically all the golf titles of this Earth juggled between improbable bars and indicators, EA Sports exploited the analog sticks to create a simple and ingenious system that returned as much as possible all the true feeling of the sport; it was always the momentum of the swing, plus the seriousness of the simulation, that made Tiger Woods THE game of golf par excellence. Faced with the possibilities offered by the DS, EA didn't hesitate and adapted its system: to perform the swing we will have to follow a parabolic path with precision and speed that is indicated to us on the touch screen. The descending part represents the backswing, i.e. the backward movement of the club: depending on where we start on the indicator, it will be more or less accentuated for a greater or lesser power of the blow; but also the speed with which we will execute everything will determine the power of the blow. The upward movement towards the ball is instead the actual shot, at the end of which we can decide the effect to be impressed by directing the nib to the right or to the left. Also present is the ~boost~ to be given to the shot for greater power, in the form of a bar to be filled by rubbing it with the stylus. The idea itself is excellent, and has the double advantage of exploiting the DS setup, not all the games on the market do, and of restoring the ~physicality~ of golf: the swing we perform on the DS is in fact, still more than what to do with the analog sticks in the other versions, an athletic gesture (very small, of course) exactly like the real swing, and like the real swing it needs experience, mistakes, trials after trials to be mastered at its best. Remaining precise and fast at the same time is something that can only be acquired over time, and even further on in the game every so often we will come up with real shooting miscarriages, too fast or too weak, or with a simply ~banana effect~ ; we could therefore consider the Tiger Woods of the DS even more simulative than the larger versions, which however in our opinion represented the perfect compromise between the immediacy of a video game and the return of such a delicate gesture as the swing. This wouldn't be a problem for all those interested in trying out the new system, were it not that the implementation isn't perfect, especially since the precision of the touch screen doesn't seem able to handle the fastest stylus strokes. Furthermore, it would be better to establish, perhaps in the next iteration, with regard to the power of the shot, what is the importance of the amplitude of the backswing and what is the importance of the speed of the whole movement: in fact, it will often happen that we give too much power to the shot, despite havingopted for a limited backswing because the movement was too fast, or vice versa. the swing we perform on DS is in fact [...] an athletic gesture Let's Swing again All the other problems of this peculiar system derive from its lack of immediacy, from the fact of having to find a decent position to have maximum precision on the touch, from the fact of having to master it well to obtain constant results Sometimes the title becomes frustrating because it seems that not a shot goes as you would have liked, you are obviously in a bad moment. As if it were a real sport, and this point, of the similarity between videogame gesture and athletic gesture, is by far the best thing that the title offers, a very interesting path, to try and to encourage beyond the imperfect realization of this first try. It could be the future of sports games, at least on DS, always considering that such an approach seems to be less videogame, and consequently less immediate. On the Green, however, the system is quite similar to the usual one: you give strength and direction to the ball by following the advice of the caddy, and only that, since it is difficult to appreciate any undulations. Green Line The greatest difficulty of the title is undoubtedly represented by the mastery of the swing; not that the virtual opponents are stupid, the first ones inevitably are but the challenge becomes more accentuated as you progress, rather the AI suffers from obvious oversights on the part of the programmers, such as when, for example, the golfer controlled by the CPU is in a very deep bunker or in front of a tree and practically ignores these obstacles, continuing to shoot towards the hole until the rebound against the obstacle causes him to find himself in a more favorable position. Longevity is favored by the save that takes place after each hole. In our test we also encountered a couple of bugs, a sign of a little thorough beta testing which in the European version should have benefited from the greater time available; fortunately, these are rare situations. The multiplayer game modes complete the picture, up to 4 players each with their own cartridge, and the analysis of statistics, once again much less complete and maniacal than the series usually offers. Graphically Tiger Woods is a nice title: the golfer models are from N64 but on the small screen they still make an excellent impression, above all by virtue of very fluid and realistic animations. The holes are also very well done: taking advantage of the fact that it doesn't take many polygons, many elements remain two-dimensional and don't bother the small laptop screen, we focused above all on the textures, which it wouldn't be an exaggeration to define as excellent. bright and clean. In general, the effect that the title makes is one of great clarity, fluidity and cleanliness, a rare thing so far on DS and therefore all the more to be appreciated. The sound is instead disappointing: no commentary, few effects during the game, few music during the menus. Localization in Italian non-existent: only English, French and German are present and the manual also remains in the Beowulf language. It may seem paradoxical to someone, but the EA Sports game is a great idea not made to the fullest, and with little ~side dish~, which can only disappoint those of the overseas giant's games who appreciate the most external aspects. Without prejudice to the attention for all the parameters and eventualities to consider in golf, the swing is the moment in which this Tiger Woods will be able to capture you or to reject you completely: if you want to commit yourself, and to come to terms with some little problems , you will not detach easily; if, on the other hand, you are looking for something simple and immediate for DS, you probably won't understand this game by pointing it out to have more demerits than it has. But the attempt is still to be applauded, and pursued with the next episodes which, we are sure, will not be long in coming. Pros Swing is an idea of great value Make good use of the touch screen Excellent clean graphics Cons Does it require a lot - too much?  dedication The swing suffers from imperfect implementation Little customization, little sound, few statistics A tiger striped sweater The first episode of Tiger Woods for DS lacks many things that instead distinguish the editions for the larger consoles, starting from the year in the title; you can still see steps forward compared to the bare, always considering the opulent parameters EA Sports, edition for GBA, and in reality there is a good number of things to do, but if you are used to the home versions you will remain dumbfounded for a moment : Quick Play allows you to set up in four and foureight a competition by choosing rules, course, holes and participants: the game modes are limited, just as the number of courses and that of the legends of golf featured in the title are not very high. Among other things, both courses and champions will be unlocked by proceeding in the Legend Tour, the true heart of the game, in which, as has become a tradition, you take a novice golfer and accompany him up to the challenge with Woods himself. The first phase is therefore that of the creation of the character, but forget the wonders of the Tiger Woods at home: here you can only choose between very few combinations for the physical appearance and the clothing (and moreover the faces are all particularly ugly...). Once our alter ego has been given life, numerous competitions await us divided by difficulty levels, Rookie, Pro and Legend, to be faced in a very rigorous sequence that cannot be altered at all; perhaps those who were taken aback by the enormous customization possibilities of their careers traditionally offered by TW will feel reassured by this linearity, all the others will be left with a little bitterness in their mouths The main objective is obviously to win competitions, but also to earn a little money, with which we can only improve the athlete's parameters. No new equipment, no elegant or excessive clothing, no ~treats~ to be bought by showing off eccentricity as befits any overpaid and ultra-famous sportsman. But, to tell the truth, this is not the raison d'tre of the PGA Tour", "date": "2005-04-08", "grade": null}