{"name": "A colpi di incantesimi", "ref": "https://multiplayer.it/recensioni/81217-lapprendista-stregone-a-colpi-di-incantesimi.html", "text": "Disney Interactive is not new to video game transpositions of its film productions, whether they have been great box office successes or semi-flops without distinction. This is the case of The Sorcerer's Apprentice, a film that despite the certainly not exciting receptions from the public and critics sees itself dedicated to a video game on Nintendo DS. The plot of the product is obviously linked to the film in question even if the characters represented despite being the same as in the film have anonymous faces and not those of the actors who played them on the big screen, even if the development of the facts follows its own personal path. It broadly tells of the Magician Merlin who is betrayed by one of his three disciples, Horvath, and who instructs the others who remained faithful to him, namely Balthazar and his beloved Veronica, to stop him before he and his ally, the Fata Morgana, they can do damage. After a violent clash, Veronica captures Morgana's spirit within herself but is imprisoned with her in the Grimhold, a sort of matryoshka doll that encloses various evil spirits in its layers. Merlin then instructs Balthazar to keep the artifact and find the High Merlinian, that is the heir of the prodigious Master, the only one capable of killing the terrible Morgana in case she should return one day and... we leave the rest to you the pleasure of find out. Let's just add that the events then move to the present day and that the player will find himself controlling the young protagonist of the adventure, Dave Stutler, a student engaged in fighting Maxim Horvath. The game is divided into different modes, with the main one called Story which is basically nothing more than a shooter adventure with two-dimensional graphics and a top-down view. The action takes place on the upper screen of the DS where you move between scenarios divided into watertight compartments, in which you move from one fight to another until you get to the boss at the end of the area. While on the touch screen at the bottom wheels are highlighted from which it is possible to select with the stylus, during battles, the various types of spells to be used then with one of the back buttons. The latter can be of various nature, for example elemental, i.e. linked to frost or fire, or space-time, explosive. Magic Fury They can also be enhanced by unlocking new elements to combine with each other perhaps through nice mini-games on the touch screen and consume a certain number of accumulated magical energy by sucking it away from special objects that are found around the game areas. And it is precisely here that a large part of the game resides: juggling enemies by firing on them, while fiddling on the touch screen to change the type of magic and use it, taking advantage of the automatic coupling system of monsters in aiming management so as not to lose them never out of sight; finally using the character growth system to unlock new abilities throughout the course of the adventure. The most interesting aspect of the combat system is related to a factor that causes each type of enemy to be related to a particular element and consequently to a color. In other words, if the monster in front of you is yellow, it means that it is a creature of the Matter category and consequently, to defeat it, it will be appropriate to use types of magic of that color. Conversely, to defend yourself from his blows, you will need to equip objects that have yellow among their components. The Sorcerer's Apprentice offers other game modes such as the one called Pass the DS which consists of taking a Nintendo DS with a single copy of the game and facing the various levels with the help of friends, passing the console to them in rotation at the end of each round. Or the Time Attack where you have to shoot down many monsters while recording the best possible time or Countdown, where instead you need to defeat as many enemies as possible within a certain amount of time to win, and many others. Despite the discrete variety of challenges present, however, the product unfortunately fails to take off and after the initial interest the gamer risks getting bored and seeing the attention towards this title quickly diminish. Some levels are in fact quite repetitive, the enemies from a certain point onwards tend to always be the same and if even the plot does not make you want to continue much, there is very little left. And the presence of objectives to unlock on the model of those of Xbox 360 is of little use to convince the user to replay the adventure or even to complete it the first time. Just for the record, let's say that the aforementioned objectives are used to obtain objects and clothes for the avatars that can be used in the DGamer, the social network (social network) exclusively reserved for Disney video games on Nintendo consoles. For the uninitiated, it is in simple terms a web space where each player has his own personal profile and therefore can meet people from all over the world, exchange content and chat.", "date": "2010-10-11", "grade": null}