{"name": "Il ritorno di Grey", "ref": "https://multiplayer.it/recensioni/81171-hybrid-2-saga-of-nostalgia-il-ritorno-di-grey-ottimo-direi.html", "text": "Violence, like any other animal instinct, is inherent in man; on the contrary, precisely in the species Homo Sapiens Sapines it usually reaches aberrant peaks, above all when compared to the rest of the animal kingdom where it is often used exclusively for purposes of defense or for food. Years of social struggles and evolution of customs have led (at least on paper) to rightly stigmatize violent behavior, delegating coercion to special state apparatuses (such as the police force) and categorically forbidding any form of private justice. Fortunately, however, the primordial animal instincts, not at all dormant, can still find an outlet in a completely harmless way thanks to video games, despite the useless and hypocritical battles of the various bigoted associations, committed to finding other people's straws, not seeing the closest beams instead. Naturally without elevating Hybrid 2: Saga of Nostalgia (henceforth only Hybrid 2) as a symbol for the venting of human frustration, we can safely say that a game based on slashing combos potentially includes great fun, especially then if Rounding it all out are numerous RPG elements. Yes, life is all about a quest! To talk about the history of Hybrid 2, it is necessary to make a necessary premise: if you have not been able to play the first episode of the series, in fact you do not understand anything. In fact, the story of the protagonist, despite being self-contained, is based on premises that can only be understood by knowing the first title; moreover, the game is completely localized in English, a further obstacle to the clarity of the general narrative plot (of course this does not apply to those who are familiar with the language). For the record, it is enough to know that in the prequel Hybrid: Eternal Whisper the protagonist is Grey, a young solitary hero, in charge of saving the world of Platina from the Dark Spirits, powerful evil entities who command the various monsters present in all levels. In this sequel, therefore, Gray is already fairly well known and lives new adventures to save the beloved and prosperous Fairy, trapped in a sort of frozen circle. Only the power of fire can free it, but to acquire it you will have to face countless difficulties through interdimensional travel, quests and, of course, fights. Hybrid 2 is in fact, as anticipated, essentially a decidedly old-style scrolling fighting game: the movement commands are entrusted to a precise D-pad placed on the left while on the right side there are 3 action buttons, inspired by the PlayStation ones (circle, square and triangle, geometric figures for which Sony certainly cannot claim rights since those of Pythagoras and Giotto have expired). The absence of the jump stands out, which in fact is traditionally associated with the X key, even if in the economy of the fights it is certainly not necessary (and there are not even platforms). Moving on a three-dimensional Gray background, which is instead drawn in 2D, it can also move in depth, an ideal function for avoiding shots from afar (like arrows) but which becomes an obstacle during attacks, as it is necessary to stay aligned with the enemies to see hit their blows. Therefore, if in the game mechanics there is no big significant novelty compared to other exponents of the genre, there is however a big flaw to report for a title that makes action its main point: unfortunately, during the race it will not be possible to attack, in the same way (with due proportions) as Resident Evil 5; the substantial update recently undergone has at least improved the precision and immediacy of the commands, also slightly increasing the speed of the movements. The role-playing component of the game appears to be very accurate: the growth of the character is well structured and the experience points will arrive both at the end of the quests and gradually by defeating the various enemies. Obviously it will be possible to increase the classic parameters such as strength, defense, attack and so on as well as managing a rather large inventory. You can choose between different weapons and armor, revitalizing potions of various types and other similar samples of traditional objects. A small note goes to the respawn system in case of death during the course of a level: given that, due to the developers' choices, it will often be necessary to redo the same stages to acquire experience points and skills in order to face the more difficult ones, the choice shown after a game over appears entirely questionable. In fact, the option will be given to be reborn maintaining the damage inflicted on the monsters up to that moment but sacrificing the Origin of Life (a sort of additional bonus), or to start over with the monstersreinvigorated, excluding only those already dead. However, the problem arises from the fact that after very few recoveries the Origin of Life ends and to use it again it will be necessary to purchase it separately at a cost of 79 cents per dose! Certainly not a happy choice even if, with a little foresight, you can easily go on without using this small advantage. Each city visited during Gray's wanderings will see characters lined up with whom you can interact, among which the merchant stands out, useful for buying potions, and the messenger, able to deliver real messages via the web to other previously known users of the game ; this interesting function, already present in the first episode, should serve to create a community around the series but, with the introduction of the Game Center (which is not yet supported), it now appears fundamentally useless. Where Hybrid 2, however, would need a decisive revision is in the technical sector: the 3D backdrop, with coarse and grainy textures, is a real eyesore when compared to the two-dimensional models of the characters, which on the contrary appear quite well designed; even the variety and characterization of the monsters is more than sufficient while the sound, limited to a few effects and some music, certainly does not stand out for its quality. The biggest flaw, however, is undoubtedly the size of the recreated world, forced to be limited by the 3.5-inch Retina Display. Everything is in fact too small, due to the proportions to be maintained, but in the case of the inventory it has really gone too far: the icons are microscopic, almost colored dots just sketched, absolutely non-functional. To make the picture even worse, there is an annoying bug that prevents you from seeing the upper side corners in the scenarios, replaced by portions of white. Finally, although formally compatible, the game is incomplete in terms of framerate on the first iPhone and iPod Touch models. Price: 1.59 The tested version is 1.1 App Store links", "date": "2010-10-08", "grade": "6.5"}