{"name": "The Coolest Game on Earth", "ref": "https://multiplayer.it/recensioni/81205-nhl-11-the-coolest-game-on-earth.html", "text": "Tested version: Xbox 360Among the current trends in the gaming market, very often seen negatively, there are also aspects that must be recorded as actual substantial evolutions. One of these is EA's commitment to its annual sports series, which while all too blatantly reflecting the reliance on wild serialization and licensed marketing revived every year, have recently shown clear signs of recovery. and progressive improvement. On the other hand, when it comes to sports simulations that come out 12 months apart from each other, it is quite obvious to expect marginal changes to a structure that makes the fixed user base and the lure inspired by licenses its real motor. And yet, even compared to what happened a few years ago, today we are witnessing an effective evolution that seems to spring from a true passion for the subjects examined by the various simulations, from soccer to American football to hockey. The latter, represented by the NHL series, is probably one of the best products currently in force in the EA Sports catalog, universally recognized as the best simulation of the sport in question for at least three editions now, although the competition is neither thick nor particularly fierce. The road is the one taken at the time by the 2009 edition which laid the foundations for the rebirth of the series, a trend confirmed by the following chapter and carried further forward by this one. There are no substantial changes to the structure of the simulation, but over the course of these three years the improvement has been clear and aimed at all aspects of the game: from modes to control systems, from physics simulation to artificial intelligence management. Not just simple updates to the rosters and current championship data, therefore, but a good job of polishing, testing and improving the dynamics that have led NHL, today, to be undoubtedly the best ice hockey simulation on the videogame market . A cornucopia of content That the series represents the flagship of EA Sports sports productions is also clear from the quantity of materials included in NHL 11, which combine the quantitative factor with the basic qualitative one. All the discoveries, experiments and certainties developed and consolidated during the various EA sports series are available here, forming the well-known and well-established backbone of game modes and options, a real platform on which to install the various sports simulations. In addition to the simple game we therefore find the careers, divided here into ~Be a Pro~ (management of a single player during his career) and ~Be a GM~, or the managerial declination of the previous option in which we will find ourselves managing the team from the coach's point of view. In both cases we find ourselves climbing the rankings and gaining notoriety through the game on the pitch or team management, starting from the minor leagues up to the NHL, in a similar way to what happens in the career modes of FIFA 11, for example . Note here the introduction of various additional tournaments and leagues, such as the Canadian Hockey League, which add extra thickness and materials to the entire game. To these modes is added the particular Hockey Ultimate Team, to which the EA Sports UHL is connected, which represents the respective online multiplayer mode: it is a mixture of classic game and managerial management, all characterized by the use of stickers from buy, modify and exchange. These stickers normally represent various players, who will become part of our team, with their own characteristics taken from reality, but these are flanked by ~consumable~ stickers that act as modifiers for the former, with the possibility of applying particular types of training, of strategic management to the team and of the contract, leading to a control of one's ~deck~ similar to a managerial simulation. The stickers can be purchased by spending the reward points earned by playing, but it is also possible to go directly to the purchase with real money, with packages with variable prices depending on the value of the cards they contain. Each single mode then corresponds to the possibility of playing in online multiplayer, which is valid for the quick game, the possibility of using your own ~Be a Pro~ player online and the multiplayer version of the Ultimate Team, or the aforementioned EA Sports UHL . The netcode also in this case stands out for its solidity, allowing deci online gamesmindfully satisfying. Shots prohibited In this chapter the excellent control system already introduced in version 09 is perfected, which allows a rather complete management of the club and the player's movements by delegating most of the movements to the sticks. It is a system that appears a bit complex at first, which requires a certain amount of application to be fully managed. Basically, the left stick controls the player's body and his movements on the skates on the pitch, while the right is dedicated to the movement of the club, with the possibility of making fakes, quick touches on the puck to maintain control and shots of various types in the phases attacks, or attacks, interceptions and tackles as defensive moves. A whole series of different nuances in terms of pressure duration and stick movements determine a wide range of shots and defensive actions which, combined with the excellent management of the physics in the contacts between the players' bodies and between players and the puck, contribute to an extremely realistic simulation of the sport. The almost total control of the movements (between regular and other ~forbidden~ shots) allows you to interact in various ways with your opponents and with the puck, also allowing the construction of always different actions given the vast range of movements and the possibility of interceptions given by the realistic reaction of the puck in case its trajectory crosses any part of a player's body. In addition to new possibilities of ~dekeing~ and shooting possible with the expansion of the control system and the evolution of physics, also the contacts between the players now allow you to hit, touch and push in various ways both the body and the club of the player. opponent, with absolutely credible results. So gone are the times when the disk remained firmly glued to the bat and only through more or less fake contacts it was possible to get hold of it, the system introduced by EA allows you to build ever-changing actions making the gameplay somewhat unpredictable. The evolution of artificial intelligence has made the construction of choral actions by the team more satisfying, which is obviously more visible in the ~Be a Pro~ mode in which the whole team with the exception of the protagonist is managed by the CPU, but they present themselves still sporadic gaps especially as regards the ability to finalize the attack actions, often too prolonged and with a delayed conclusion. In general, we do not notice a substantial change in the control system, in the AI and in general in the fundamental gameplay phase, during the game, with the whole structure that is clearly derived from the excellent results achieved by the 09 and 10 editions of the game . This is not necessarily a defect, given the excellent starting point, but those who already own one of the two previous versions and are not exactly a fanatic of the updated NHL roster, may not find great ideas for buying this NHL 11. Xbox 360 goals There are 40 unlockable achievements for the usual total of 1000 points to collect. Being a game with many different modes, these are distributed equally between one and the other making it necessary to apply to all sections of the game in order to proceed with the collection of all achievements. Full score is no easy feat, especially requiring a lot of time to switch between modes. Ice show The usual emphatic spectacularization typical of purely American sport is reproduced here once again by EA Canada, with interlude sequences, stadiums, audiences, audio and shots that combine to make the game particularly lively. There is also here, and perhaps more than in other sports series, an evident devotion to the simulated world, a real passion for hockey that allows the environment in question to fully ~breathe~ both in the game phase on the field and in the numerous screens and menus on which we will find ourselves spending several minutes for each session. The graphics engine is substantially the same as the previous edition, with some more smoothing but also some defects that have remained unchanged, such as the loss of framerate in rare cases but generally it performs its duty in an excellent way, considerably bringing the on-screen representation closer to a real match broadcast on TV, in terms of realism. In the same way, the sound effects between players and the public and the audio commentary (entirely in English in the tested version as well as the texts) help to create the atmosphere of a real match which will certainly exalt the user, moreover with a credible progression interms of spectacularity from the minor leagues to the major championships, up to the play-offs and the final stages of cups and championships. There is also a slight reduction in speed for the entire game action, probably desired by the developers to allow greater control of the player's activity on the field, a somewhat acceptable choice. The new animations introduced with the addition of further movement possibilities, such as clashes during face-offs or against side barriers, only further complete the total simulation work that EA Canada has set out to complete with the NHL series and as far as graphics are concerned, the results are excellent. An interesting introduction, however, is given by the possibility that the club breaks right in the middle of the game, which determines particular situations such as the control of the puck with the skates and with the hands or the ~body to body~ defense until fetch a new bat from the sidelines or given to us by a teammate.", "date": "2010-10-04", "grade": "8.8"}