{"name": "Miami Vindication", "ref": "https://multiplayer.it/recensioni/81083-gangstar-miami-vindication-grand-theft-iphone.html", "text": "With the Gangstar series, Gameloft has always tried to reproduce the feeling and frenetic action of Grand Theft Auto on mobile devices, trying in every way not to make it look like the dumb and penniless brother of Rockstar games. A bogeyman who was partially removed from the iPhone release of Gangstar: West Coast Hustle, a 3D chapter which, despite several defects, was widely appreciated by critics and the public. After only a year away, the franchise is back on the App Store without too many ambitions or delusions of protagonism, but with the sole purpose of further refining and improving the new formula introduced. However, it is useless to hide your head in the sand: however desperately trying to assume its own identity, Miami Vindication seems to have the initials GTA branded on its forehead, since every street corner, every game situation and every dialogue with the others characters winks heavily at the famous Vice City. Whether this is good or bad is obvious. Question of appeal Technically, very little has changed compared to the previous chapter, and those who have played West Coast Hustle will find it hard to notice all the innovations introduced in this new episode. But just so as not to offend anyone, Gameloft has this time catapulted the player into a new and big city, making him take on the role of a new character: Johnny Gainesville is not the anonymous African American from the ghetto portrayed in the old title, but a slightly ' forced and with long greasy hair. The developers then decided to play the classic card of the kidnapped brother, with the clear intention of giving more personality to an otherwise flat protagonist with no background. Continuous research acts as a glue for all the missions faced, and the steps forward compared to the previous chapters are evident: unfortunately, however, it is never possible to fully explore the character, who looks like a rubber doll when compared to the charisma of Tommy Vercetti or Niko Bellic. The missions to be faced almost always consist of reaching a certain area, often within a time limit, and most of the time they end with a furious shootout; escapes, tailings or espionage actions help make the experience more varied, although the poverty of secondary missions is really felt. The city is quite large and certainly more interesting than the previous one, but offers very few pastimes and the impression is that of being in a huge amusement park where the rides are all turned off: by stealing a taxi, an ambulance or a timed mini-games, but all of them are limited to listless races from point A to point B. The music changes if you look at the available vehicles, significantly more varied and numerous, ranging from racing cars to SUVs, from motorboats even up to a helicopter; moreover, the differences between one and the other are no longer just aesthetic, but are also reflected in acceleration, resistance and handling. However, this last gear deserves to be heavily oiled: using the motion sensors to steer the car is nothing short of impractical, and the only solution to avoid crashing is to change the control system in the options. Finally, like its predecessor, Miami Vindication is also plagued by various technical problems and some stylistic naiveties; in addition to the obvious and often annoying pop-up effect on the buildings a little further away, it is not uncommon to come across more or less sensational bugs, which sometimes give life to simply hilarious scenes. An example? During a very normal intermission scene in which Johnny converses with his contact, we were incredibly overwhelmed by a police car passing by, while in the distance we could admire an electricity pole spinning freely in the middle air. The tested version is 1.0 Price: 5.49 App Store links", "date": "2010-10-04", "grade": "6.8"}