{"name": "Il bug magico", "ref": "https://multiplayer.it/recensioni/81072-elemental-war-of-magic-il-bug-magico.html", "text": "We'd like to talk extensively about the contents of Elemental: War of Magic, how beautiful and complex the kingdom management system is, how many playful possibilities it offers the player and how, since the day of publication, we can't play anything else. Unfortunately the reality is quite different. The first thing to note is that we have waited a long time before submitting this review. The reason is very simple: in its current state, even after applying the first four patches, released in a hurry (the version of this review is 1.08), Elemental: War of Magic is simply unplayable. Imagine what the basic version was like. But we were patient, because the title has great untapped potential and we hoped that Stardock would publish a resolving update in a reasonable time. This was not the case, although a mega patch has been announced for the foreseeable future. In the meantime, we welcome you to the fantasy bug festival, an explanatory gallery of all the problems that can afflict and sink any video game, with all due respect to the promises and hopes of those who believed in a new Master of Magic. Love your desktop The situation is quite dire. We're not talking about simple graphical glitches or occasional crashes here: on the test machine, Elemental: War of Magic reverted to Windows several times within an hour. This alone would be enough to crush him, also because one enters the paranoia of continuous rescue so as not to lose the progress made. We also tried switching computers, using a very light one to check if there were conflicts with some other software, but the situation didn't improve much. We said to each other that maybe yes, you play a little at a time, the crashes are continuous, but it could be worth it. And then it does not necessarily happen on all PCs. Ingested some sedatives to avoid hysterics about the bugs, we continued. Played a bit, luck assisted us and we managed to do a few rounds in a row. Then freezing. Some wizard probably cast an ice spell on the computer because it froze everything. Let's restart. Let's reload the game. We load the last save and... it's corrupted. After a couple of thousand loud curses, we loaded the previous save. A few more turns and another freeze. Better to go back to the desktop, we immediately thought, as we cursed Manitou and Yoda in langue d'oc. It looks like an anthill Now, what has already been described would allow Elemental: War of Magic to be crushed without thinking too much about it. Luckily there's plenty more to throw at him. The Stardock title is, quite simply, an alpha version of a game. It lacks finishing touches and has several problems in any field. Let's take for example the interface, often too cumbersome and not very versatile, asphyxiated by graphic bugs of various kinds (text that ends up outside the windows, screens that cover other essential ones), or let's take the lack of a tutorial worthy of the name that leaves unaware of many game mechanics. In the latter case, the solution is to proceed at random, but doing it is not fun, especially if you have the stability problems described above (we checked on the official forums and there are many players who complain about them). Another problem that afflicts the game is the dancer frame rate. Now, just look at the images to understand that Elemental: War of Magic is anything but a technically stunning title. Not bad, given the genre, but then why do we have to witness reckless collapses in fluidity, which arrive sudden and unjustified like punches in the stomach? You forgot the scaffolding It is a pity to have to speak ill of the Stardock title, which evidently has enormous potential by virtue of the advanced management of city growth and the versatility of its complex mechanics. He is potentially one of the best strategists to come out on the market, but, in fact, it is difficult to get passionate about any aspect. If all the problems listed were not enough, we must also add an artificial intelligence that is deficient from various points of view and unable to engage the player. Another element that highlights the alpha state of the game are the quests, overall few and flat. In a game like this is not a small flaw. It is evident that the developers have not been given time to create more, but the general question remains: why release a reduced title in this state? Wasn't it better to delay the release for a few months and bring out a full game? To these questions we add another one, much more pesante: if even in two or three months a resolving patch came out, who would care anymore? And would those who bought the game when it came out still be willing to re-evaluate it? Imagine buying a computer today and being able to fully use it only after several months, would you be happy?", "date": "2010-10-01", "grade": "3.0"}