{"name": "Larve dal sottosuolo", "ref": "https://multiplayer.it/recensioni/80800-super-mega-worm-larve-dal-sottosuolo.html", "text": "Thanks to cult novels such as Dune or cinematic sagas such as Tremors, giant worms and monstrous underground creatures have become part of the collective imagination of science fiction enthusiasts, influencing and inspiring more or less evidently works ranging from Star Wars to Half Life 2. However, rather than the sand worms born from Frank Herbert's pen, the disturbing monsters of Tremors seem to have influenced the two developers of Super Mega Worm; Ed Britton and Chau Wang, main developers of the Deceased Pixel team, have in fact decided to create one of the most frenetic and fun games seen so far on the App Store, recycling ideas and part of the code from their disappointing Snake HD. At this point it will already be understood that, and this is the most interesting premise, the player does not play the role of a marine dealing with a gigantic monster. Not anymore. Except for rare or disappointing exceptions, among which the forgettable Rampage saga undoubtedly stands out, over the years video games have accustomed us to impersonating little David against the imposing Goliath. And if instead for once the roles were reversed? Curiosity Those who don't have an iOS device and want to try Super Mega Worm can take a look at the PC game from which it seems shamelessly inspired. We are talking about Death Worms, created in 2006 with Game Maker and distributed for free by the developer known under the pseudonym of JTR. Soon after the announcement of Super Mega Worm, the PlayCreek team announced that they are working on an iPhone and iPod Touch version of Death Worms, built with the approval of the original author and which will include numerous aesthetic and mechanical improvements. Let the war of the worms begin. Size matters Such particular premises cannot fail to be introduced by a hint of a plot that is equally out of the ordinary. It is 2012 and, as predicted by the Mayans, the Earth is fast approaching the time of its destruction, but not because of a meteorite, the pole shift or the sudden thawing of the ice. The ruin of the planet has been caused by the human race, which like a parasite has consumed all natural resources, cut down forests and extended its cities. The last weapon Earth has at its disposal to survive is Wojira, a powerful creature that has been sleeping deep underground for millennia. After the brief introduction and the hatching of the egg containing Wojira, the game immediately goes live; the lack of a tutorial or any type of indication causes a few moments of disorientation in the player, who finds himself writhing underground while trying to become familiar with the control system. The gigantic worm advances automatically, and the only key present from the beginning allows you to increase your speed: it is possible to move the worm using both a virtual lever and using the accelerometer of the device, but the latter option proves to be rather awkward and inaccurate as levels progress. The more time passes, the more the energy gauge empties, and the only way to recharge it is to put something on your stomach soon. Among not very athletic men, naive mothers, fat cows and other animals, the surface is transformed for Wojira into a buffet full of delicacies. However, humanity does not stand by and welcomes the giant earthworm with the same treatment reserved for Godzilla and King Kong: law enforcement, soldiers, helicopters and tanks soon join the party, throwing bombs or setting traps. Just a few minutes and the game turns into a real chaos. To pass each level, the player must devour an ever-increasing number of human beings, while his body becomes even larger, his hunger more uncontainable and the forces of men more and more numerous. The more it grows, the more devastating the attacks of the monster are, while with a jump it can reach airliners or go even further: on balance, the only thing to bring it back into the underground depths is the constant danger of death. After a few levels, new and devastating abilities are unlocked, such as throwing fireballs or EMP explosions; the latter, rechargeable by collecting some minerals underground, as well as destroying everything in their range, allow you to enter a slow motion mode and obtain a score multiplier. Then when it seems that Wojira can grow infinitely and reach other planets with a single leap, the game ends with a nice and inevitable ending able to evoke one of man's most recurring fears with goliardia. To give polish to all this chaos of explosions and devastation we think a graf styleico fits perfectly, made of lively animations and a pixel art able to communicate all the humor at the base of the game, enriched by small goodies and funny balloons. Unfortunately, the variety of enemies is counterbalanced by a scenario that is always the same and repetitive in the long run, where it would have been an excellent idea to see the planet deteriorate as the levels progressed. The total absence of unlockable achievements or alternative game modes doesn't help, although it is possible to activate the Tremors option to add some spice: just like in the feature film of the same name, in this mode the monster is completely blind, and the only way to flush humans out is to come out or listen for their footsteps. The tested version is 1.25 Price: 0.79 AppStore link", "date": "2010-09-22", "grade": "8.6"}