{"name": "Battaglie all'ultimo turno", "ref": "https://multiplayer.it/recensioni/80719-civilization-v-battaglie-allultimo-turno.html", "text": "Reading the aphorisms of some famous leader always seems to be in the presence of the most sagacious sentences in the world, sentences written in stone from which to learn timeless lessons. Bullshit, the truth is that you can consider yourself a real man (or woman) only after having spent hundreds and hundreds - and hundreds and hundreds... - of shifts moving around huge maps, oiling them all as if they were perfect mechanisms aspects of its government and trying to dominate the world not for a few decades, as told about the names mentioned in history books, but for dozens of centuries, those necessary to pass from prehistory to the conquest of space. Real life, dear readers, is therefore not made up of words to be spent to make oneself beautiful with friends, it is a path that imposes continuous choices, even difficult ones, in an adverse, changeable and today tendentially hexagonal environment; a path that we have finally been able to take again with Civilization V and that we invite you to take, closed the books and forget the lessons taught by others, to show yourself what it means to be true leaders. Which direction? The approach to a new chapter in a series like Civilization is something that always puts us in awe, because it's not just a question of satisfying or disregarding hopes, but of playing one of the few cards within a genre, that turn-based strategy, not as thriving as it used to be, having at the same time to lay the most solid foundations possible for what will be the additions of the years to come and the relative support for what is produced by the community; there is not too much room for errors in short. For the fifth chapter Sid Meier and associates have however decided to push quite hard on the innovation pedal, at least the one inside the series, and after the first menus and the feeling of being in the presence of the same game as always, the news does not take long to show. What is unchanged - and immutable - is therefore the approach to the experience: whether you choose to create a quick match or waste tens of minutes configuring the morphology of the terrain, the rhythm, the number of participants and so on, the the aim always remains to take on the role of leader of a civilization among those present and lead it to the conquest of the final victory, in any way it has been decided to obtain it. A classic formula which, shift after shift, shift after shift and choice after choice, has now been able to involve more than one would expect for almost twenty years. Old fans will soon feel at ease between technologies to be developed and productions to be activated, however finding themselves faced with the first major changes right away, from the moment in which they will be asked to move on the pieces that make up the playing field and fight the first battles. As known by now, in fact, it was decided to switch from a squared map to hexagonal boxes, a standard for the genre, while setting the limit of only one military unit per space - they can instead overlap with units not used for combat, such as workers or settlers. Two modifications for one revolution, given that the impossibility of accumulating forces in a single point both offensively and defensively, such as inside a city, imposes a more sophisticated tactical approach made possible by the greater freedom of movement made available by the two new directions. In practice, a whole series of situations are created in which, for example, it will be necessary to pay great attention to the disposition of the archers with respect to the normal infantry, or to put into practice the new possible techniques of approach to the maritime clash in order not to succumb to the ships that will shoot even far from the coast, playing a role that has never been as important as it is now. In short, the arguments in favor of Civilization V are not limited to what has been done in terms of major changes to the gameplay, but also to how these elements have been deepened by refinements that could give them more depth, for example the return of ranged combat in similar way to how we had known them in the third chapter or the addition of an internal arsenal to each city, sufficient to ensure that it can be defended even when without a military unit. Add and remove Once the impact with the two big introductions above has been overcome, what remains is a set of other beautiful ideas, aimed at making the title deeper without at the same time complicating it too much, indeed trying to take a step back from the past so as to make it digestible even to newcomers. The steps that lead to victories by military or scientific domination have remained unchanged or nearly so, mentre the whole sector of options linked to internal politics, therefore to aspects such as espionage or religion, have been replaced by Social Policies, i.e. guidelines to be assigned to one's own government and verifiable in terms of bonuses which can lead, to the completion of the political fifth, to cultural victory. The challenge to other civilizations will then, as always, pass from diplomacy and its relative successes and failures, with the path that points to the first seat of the UN which is now managed by a new set of better organized options and by the presence for each leader of a larger bouquet of character traits. The different civilizations and who commands them, in fact, are now better characterized, beyond just the two features of the past, focusing more on their peculiarities: for example, the British will invest a lot in their fleet, compatibly with their geographical position, while the Japanese will tend to fight to the end the clashes that had begun, without fear of suffering a crushing defeat. We also wanted to add the presence of city states, or autonomous entities within the map that cannot compete for victory like civilizations but will enter into subtle political games, making agreements and being repeatedly called into question; this, in theory, would be a rather compelling aspect, but it is a pity that in practice it is resolved as one of the weakest elements of the title, given that they will spend most of their time complaining about some lack or asking for help for something, resulting a bore rather than a reason for immersion. The presence of barbarians, or of enemy units to be defeated and prevented from regenerating by occupying their camp, is for example more significant in playful terms than that of the, theoretically much more important, city states. The second factor that leaves more doubtful is the artificial intelligence, or rather its behavior based on the level of difficulty chosen: the study of the AI itself is in fact more than good, the problem is that by decreasing the degree of challenge it seems that the opponents lose in variety of moves and not only in their effectiveness; therefore not a defect in absolute terms, rather a possible reason for monotony for those who are only now starting the adventure in the world of Civilization. Excluding these few critical elements, what remains is a gameplay that in the approximately 35 hours of testing made for this review was amusing, highlighting itself for its variety and freshness despite the years behind the concept, and above all by developing the proverbial dependence that always manages to paste to the screen turn after turn. More than perfection, which is difficult to find - to be expected upon release in such a vast and complex title, it is impossible not to appreciate how much Firaxis Games has wanted to refine and add, fielding many ideas even if not of enormous dimensions, such as the new system of unit upgrades which, from level to level and with the addition of supplementary skills chosen by the user, are never really useless, always remaining usable on the battlefield despite the passage of time, and therefore of technologies. Civilization and Civilopedia Eighteen are the civilizations inserted in the game and selectable by the user, excluding those added by the various pre-orders, bonuses and the like; the complete list contains: America, Arabia, Aztecs, China, Egypt, France, Germany, Japan, Greece, India, England, Iroquois, Ottomans, Persia, Rome, Russia and Siam. Each has a leader and two special units and buildings, capable of giving unique bonuses or possibilities, as well as a whole series of characteristic traits that influence the game when controlled by artificial intelligence. To find out all the information on civilizations and on Civilization V in general, the Civilopedia is once again available, very rich in entries and texts, completely in Italian, really interesting both for deepening the game mechanics and for having possibly unknown notions on the history of the peoples and their protagonists. The extra interface The technical sector of Civilization V is not dominated by aesthetics, in any case more than good, or by the work done to optimize the engine, but by the interface which, like the additions to the actual mechanics, heavily affects the entire experience: bars, icons and menus have been revised in order to put only the most important elements on the screen, turn after turn, while using a notification system that signals the main events, while the left half of the frame can be customized so as to highlight , depending on the need, the productions of the cities or the technological researches and cso off. In short, everything is in the right place and depending on how deep you want to go in search of numbers and statistics, there is something for all tastes and needs. From an aesthetic point of view itself, however, the game is nothing more than a carefully made modernization of what we have seen in the previous chapters, with models detailed to the point of highlighting the developments made in the different eras and, similarly, the signs of technological progress on the colonized land, with the fields that gradually become better cultivated, the roads that are formed and the most imposing buildings of one's empire, the Wonders, which are arranged to make a fine show of themselves next to buildings with increasingly modern look. However, the new engine appears to be very scalable in such a way as to be usable on PCs and Macs, even those that are not brand new or particularly performing, rather leaving the problem of stressing the processor at even rather intense levels to the complexity of the calculations: as often happens in the genre - and it is happened other times in the series - as the rounds go by and the map opens, the loads become gradually longer, making the use of a multi-core CPU mandatory. The sound sector is done in a workmanlike manner, composed of effects of good variety and quality, as well as thematic music, divided by civilization, even if perhaps after a while too repetitive. The text and discreet dubbing are entirely in Italian. Multiplayer and editor As with the single player experience, the multiplayer one takes advantage of new game mechanics rather than offering revolutions in terms of modes: there are all the usual options to customize the game in terms of size, starting era, rules and so on, then leaving the human users against each other to challenge each other for the final victory, without particular additions to what has come to know over the years. Support for mods could not be missing which, as announced, is also backwards compatible with those of the fourth chapter - so get ready to dust off Dune Wars and Planetfall - even if these options as well as the tools for content production were not available in place of review, postponing the judgment.", "date": "2010-09-21", "grade": "9.2"}