{"name": "Shin Megami Tensei 3: Nocturne HD Remaster", "ref": "https://multiplayer.it/recensioni/shin-megami-tensei-3-nocturne-hd-remaster-recensione.html", "text": "PlayStation 2 was a sensational era for the JRPG genre. We could talk about it endlessly, and this review of Shin Megami Tensei 3: Nocturne HD Remaster reminded us why Kazuma Kaneko's artistic style is at the basis of the success of a brand as fascinating as Shin Megami Tensei, a franchise that right on PlayStation 2 he really gave his best. On the second Sony flagship, Atlus published an enormous number of chapters, opening a new and more sought-after artistic parenthesis: the forerunner was this Nocturne, set in a solitary, anomalous, almost delirious world, in which the apocalypse has bent humanity to a heap of souls. What many considered the perfect and symbiotic maturation followed, the pair of Digital Devil Saga, true symbols of the past of a franchise so capable of merging myth, religion, philosophy and a spectacular dreamlike setting. Widening the view, it was a tremendously prolific era, in which the Shin Megami Tensei even fought in a melee of exponents of other JRPGs so strong that they did not come out victorious. Without forgetting a certain Persona 3 and Persona 4, coming out some time later and the Devil Summoners. Do you realize how many top quality Shin Megami Tensei have been released on PlayStation 2 in six years? A home console market scenario practically opposite to the desert in which the splendid Persona 5, some time ago, managed to win hands down and represent the quintessence of a genre that has returned to its niche, not in terms of sales, but of weighty releases. demonic dialectic 3D models and backdrops completely remastered in HD are the most evident novelty of Shin Megami Tensei 3: Nocturne HD Remaster Contextualizing the title, we will try to evaluate Shin Megami Tensei 3: Nocturne HD Remaster above all for what it deserves: a good way to present Shin Megami Tensei 3: Nocturne in an improved guise, an exceptional, unique work, if we want to break it and capable of open up a whole new line. This time we have a solitary protagonist, flanked by many demons to fight for him. We are therefore far from the Persona combat system, to which perhaps many readers are accustomed, while the tradition of numbered chapters is respected, albeit in the third person. Nocturne, exactly like 4, supports the protagonist with all the classic demons that you will have come to know and appreciate, thanks to a combat system based on weaknesses that makes the fights fast, dry, immediate, without downtime. The ability to suspend the game and save at any time is now a must in the Remastered of old JRPGs If we want, this system would then have been refined and perfected in the Digital Devil Saga, but already here everything runs smoothly and is highly enjoyable even almost 20 years later. You recruit, you talk to demons, you merge via Cathedral. Nocturne's air is neither heavy nor claustrophobic: Tokyo is an enigmatic city, where human souls turn to the protagonist with a mix of emotions: anger, fear, amazement, mockery, reverence mix in immediate but not trivial dialogues. What one breathes is the almost total absence of the social dimension that many newcomers may have experienced in Personas, a characteristic that Atlus would in any case have followed and refined later: the loneliness of a protagonist who has become a demon, in a narrative scheme between supporting characters of other times, artistically and psychologically very children of a PlayStation 2 era where Japan made its twisted mentality a pride, a little fetish to show to the West. Nocturne in HD Nocturne represents one of the most atypical and dark episodes of the Shin Megami Tensei series Nocturne HD is a good remaster of an outstanding game, perhaps a little too basic for the price it is sold at. It is always complex, especially for a JRPG enthusiast who has lost a titan like Nocturne along the way, to mediate between price, update and added value. Loading times - especially between fights - are fast and we can confirm that technically it doesn't look bad on PlayStation 4, the work on textures and aliasing works, while the framerate is predictably solid and without uncertainties. Nocturne is a product that does not make environments its strong point, as they are more scenic than anything else: a minimalism that is the result of the team's first experience on PlayStation 2 skilfully transformed into a design feature, capable of transmitting an empty world and surreal. Thanks also to the work of colors, saturation and textures, the models of the demons remain convincing as well as the characters, made eternal by a unique and immediately identifiable design, on which the team has certainly worked on an update. Play it on a modern TVor native 16:9 is certainly a step forward, while the interface and sound have not aged one iota. Composer Shoji Meguro is top-notch, and traveling between menus, abilities, and the ~roster~ of demons is quick and easy to master. It will be possible to choose between English or Japanese dubbing, while the texts and dialogues are in Italian The response to the pad seemed identical to us but perhaps we would have spent a few more minutes of development on the camera, which unfortunately remains quite old and could definitely be improved. There is therefore an enormous number of good reasons to return to Nocturne's Tokyo, but at the head of this more or less subjective list there is always her, the obvious: if you have never played it, this opportunity is tempting. It is that, after all these years and at 50, we expect perhaps less essential work and more substantial novelties (or extras), it being understood that we are talking about a JRPG, a genre capable of withstanding the advance of progress very well. This is a historical moment in which the brand has good momentum and could open up, taking advantage of the appeal of Persona on the one hand, and on the other the arrival - hopefully - in the coming months of Shin Megami Tensei 5. In any case, this remaster adds a new difficulty level (Clemente) and brings with it a new story with Raidou Kuzunoha from the Devil Summoner saga, as well as Dante, who however - despite being included in Lucifer's Call on PlayStation 2 - is only included here in the Deluxe. We add, for completeness, the ability to manually select skills during fusion and the ability to create suspension points. For those wondering, you can buy the DLC separately: both the Piet and Aspettative maps pack, Dante, and the ability to change some tracks with those of other numbered Shin Megami Tensei, but if this were your wish, a at that point it makes sense to spend less with the Deluxe. Backstory, insights, interviews and other extra content should be a must in Remastered of this type, but unfortunately there is no trace here", "date": "2021-05-18", "grade": "7.8"}