{"name": "Il caso zero di Dead Rising 2", "ref": "https://multiplayer.it/recensioni/80721-dead-rising-2-case-zero-il-caso-zero-di-dead-rising-2.html", "text": "The Game is available for download on the Xbox Live serviceDead Rising: Case Zero is set three years before the start of the events narrated in the main game, due out soon in stores. This small but full-bodied preview therefore represents a sort of prequel, the ~zero case~. Completely overturning the idea of DLC normally used up to now by any software house, Capcom today uses this powerful means not to ~expand~ the primary adventure after it arrives on the shelves, but to deepen its history even before starting it, thanks to a respectable narrative trick. In fact, Case Zero tells the odyssey of Chuck Greene, the thoughtful and fearless father of the beautiful and blonde Katie who arrives with his pick-up near Las Vegas, in the remote and haunted village of Still Creek. His car is stolen by a survivor, and Chuck finds himself besieged in a warehouse in the company of his little daughter who, bitten by a zombie, needs to take Zombrex medicine every 12 hours, the only one capable of not doing it. transform and maintain it in a human state. Just like the first Dead Rising, Case Zero is also a timed game, but above all there are more timers to consider at the same time: apart from the Zombrex to be administered every 12 hours to Katie, in fact, we have to look at the clock to check the arrival of the army (which will clean up Still Creek), all while we look for spare parts for the motorcycle that will allow us to escape the country. Xbox 360 goals This tasty prequel chapter of Dead Rising 2 provides the player with the usual 200 points for each Live Arcade title, once again divided into just 12 objectives. The points are absolutely simple to obtain, and can be unlocked simply by finishing the adventure. Nothing complex or complicated this time. All (un)dead passionately The gameplay of this little prequel, sold for the modest sum of 400 Microsoft Points, does not differ much from that of the first chapter, and serves as a real tutorial for the second. Almost all the objects that we find on the street or in buildings can be used against Zombies: from playing cards to spiked clubs, from succulent plants to shotguns, from shampoo to grilled sausages, basically everything that happens to us within reach can be thrown or used as a white weapon, with often hilarious effects. In some workshops it is also possible to ~mix~ several elements to obtain new weapons: a box of nails goes wonderfully with a baseball bat, for example. Each new weapon created is also saved as a ~card~ and usable in Dead Rising 2. Experience level, up to fifth, is also stored. There are various ways to get points and grow your character. First by creating mixed weapons, but headshots also increase experience. Another way is to devote yourself to the numerous sub-quests that are a pleasant side dish to the adventure. Sometimes, in fact, it is possible to come across some survivors of Still Creek and it is our concern to decide to save him, give him Zombrex or leave him to his fate (eaten by the undead). The amount of situations is absolutely varied, and leaves the ending of Case Zero open to more than one variant, based on our choices and how we decide to tackle the main mission (to repair the bike and escape), and the secondary ones (to save Katie and the villagers). Where Case Zero does not excel, however, is in the technical sector that we must say will have to be improved before the release of the main game. As far as the context is concerned, the DLC is clearly above average, it is true, but considering that it is a chapter of Dead Rising 2, some perplexities remain: the direction lingers a lot on long shots, aware of the fact that some polygons flicker a little too much and mysteriously disappears. Many textures are not exactly up to par, but animations and quantity of elements on the screen are absolutely more than excellent, especially since the graphics engine generates hundreds of zombies on the screen, each apparently uninterested in the other but all ready to run towards us to make us out. Entering or leaving some buildings or parts of the map (always viewable by pressing the back button) we see some loading too many, quite short but still frequent. Ultimately, Case Zero is a pleasant surprise in the varied world of DLC on Live Arcade, and represents a real independent game, so much so that the usual two hundred points divided into 12 objectives to unlock have been linked to it. A must have, for all fans of Zombies, blood and gore!", "date": "2010-09-17", "grade": "9.0"}