{"name": "Il mio amico ninja", "ref": "https://multiplayer.it/recensioni/80322-ninja-training-il-mio-amico-ninja.html", "text": "Anyone remember that old show called ~Master~? With the legendary Lee Van Cleef (the ~bad guy~ in Sergio Leone's ~The Good, the Bad and the Ugly~) in the lead role, the series tells the story of an American ninja master who decides to leave his dojo to seek America the daughter she didn't know she had. Hunted by his former students, he finds a willing young man to teach ninjutsu and decides together with him to help the needy people he meets along the way. Here, the young man quickly learns that the road to becoming a ninja is all uphill, and that it takes years of training just to be able to wear the characteristic ~balaclava~ that conceals the identity of these experts in the art of war. The funny little protagonist of Ninja Training is faced with a very similar situation: despite having already ~qualified~ as a ninja, he must undergo a deadly skill test to prove that he is capable of completing even the most complex of missions, become faster than the wind and as elusive as an eel. Other than kneading the chakra... The game boasts the ~survival~ structure typical of ~ultra arcade~, therefore of those titles that offer us a challenge that lasts a few seconds or several minutes depending on our skill, with the score that multiplies accordingly and can be compared with that of our friends (or complete strangers around the world) thanks to the integration with the now popular social network OpenFeint. Our goal during the game is simply to dodge the objects that the other ninjas throw at us from an elevated position, objects that do not descend towards the ground following a pre-established trajectory but which can even take unpredictable directions. The first things that will fall on us are boulders, followed closely by soccer balls (which we can hit on the fly rather than dodge, to get extra points) and secondly by knives, shurikens and incendiary bombs. The situation becomes more complicated as the seconds pass, we have a single chance of survival (the character doesn't have an energy bar, in fact: just one touch and it's game over) and we have to try to play it in the best way possible , perhaps taking advantage of the special techniques that occasionally rain down from above along with everything else: once collected, we will be able to shake the iPhone to instantly disintegrate all the objects on the screen. The control system is based on the accelerometer by default, so you have to tilt the device left and right for our ninja to move accordingly: reactivity and precision are discreet, even if they do not reach the level of the most famous products. The touch screen is called upon to activate the jump (essential, from a certain point onwards, to dodge knives thrown horizontally), producing a different result depending on the duration of the pressure, but it is also possible to select it from the options screen as the main control system, with two arrows appearing on either side of the screen. Unfortunately this second solution turns out to be more problematic than anything else, given that we often end up jumping without wanting to; moreover, its activation triggers an annoying bug that actually ~turns off~ the accelerometer of the iPhone, forcing us to restart the device to solve the problem (but we are sure that the problem will be solved quickly). As regards the technical realization, graphics and sound are functional to the action but are distinguished by some nice and pleasant solutions. The tested version is 1.0 Price: 0.79 App Store links", "date": "2010-09-17", "grade": "6.9"}