{"name": "Da grandi poteri...", "ref": "https://multiplayer.it/recensioni/80590-ultimate-spider-man-total-mayhem-da-grandi-poteri.html", "text": "The Ultimate Universe was born in 2000 with the debut of the ~Ultimate Spider-Man~ series. It was in all respects a reinterpretation of the classic Marvel Universe and its characters, which in this new guise appeared in many ways more realistic and in step with the times. Some of the Ultimate series have represented the best of international comics in recent years (see the first two ~seasons~ of Ultimates, signed by Mark Millar and Bryan Hitch), proposing decidedly different ~superheroes~ to us, as well as plots and dialogues worthy of a film production. The reinterpretation of Spider-Man has been curated by one of the most fervent minds of the new Marvel, that Brian Michael Bendis who thanks to a series of spectacular sagas and crossovers (~Avengers Disassembled~, ~House of M~, ~Secret War~, ~Secret Invasion~) has relaunched the comics of the ~house of ideas~. The new Peter Parker is younger than the original one, attends high school and works part-time at the Daily Bugle as a web designer, but is ready to wear Spider-Man's clothes when needed and to leap to the aid of anyone in difficulty. The new action game developed by Gameloft is based precisely on the Spider-Man of the Ultimate Universe, and although the animations and atmospheres of the game rather resemble those of the films directed by Sam Raimi, all the most famous enemies of the little spider are present with a new design (the ~Ultimate~ one, in fact) and even different powers (see Goblin). A day to forget The game opens with news of an assault on the Triskelion, SHIELD's base of operations, which has caused the most dangerous super-villains to escape. Spider-Man therefore finds himself chasing his old enemies one by one, getting rid of the numerous minions hired to weaken him along the way. The control system of Ultimate Spider-Man: Total Mayhem is based entirely on the touch screen, with a virtual stick placed on the left side of the screen and three buttons on the right: one for throwing punches and kicks, one for throwing webs and the last to jump (pressed twice, allows us to swing between buildings with a cobweb). The physical and canvas-based attack can be combined, resulting in maneuvers that are as spectacular as they are effective. The elimination of each opponent, but also the destruction of the numerous interactable objects present within the scenarios also leaves red spheres in place which can be used to purchase upgrades that improve power, defense capacity and effectiveness of the special attack (which is activated by filling a special bar and can be released to rout entire groups of enemies). Right from the start you notice the excellent gameplay optimization work carried out by Gameloft: the combat system is based on the automatic engagement of targets (one a bit like the one seen in the extraordinary Batman: Arkham Asylum) and therefore gets around the obstacle of a virtual stick dedicated almost exclusively to movement. And in this sense, our friendly neighborhood Spider-Man can perform all of his most representative actions: sticking to walls, hovering with his web and even resorting to his ~spider sense~: when an opponent is about to hit us, a icon which, if pressed in time, allows us to counterattack instantly, without suffering damage. In the end, the clashes are reduced to a mere exercise of reflexes, but nevertheless they return an excellent sensation of physicality and impact, thus resulting truly satisfying and fun. Then there are the quick time events, special situations in which you have to make a gesture with your fingers on the touch screen to remain unharmed. Finally, there are the boss fights, the moment of truth in which Spider-Man is confronted with his fiercest rivals. Well, it is precisely in these situations that the game, unfortunately, shows its side to a series of uncertainties. The control system all of a sudden becomes ~stick dependent~, and the systematic imprecision of the virtual interface (which also tends to ~enchant~ itself in the most agitated situations) creates rather frustrating situations. The fight with Rhino, for example, as it was designed, is really bad, and already at the medium difficulty level it requires numerous attempts to be completed successfully. All in all, however, these are negligible defects, compared to the exceptional quality of the product: the graphics can count on a very high number of polygons and therefore on truly convincing characters and buildings, while the musical accompaniment on more than one occasion mentions the film adaptations of the Marvel superhero. The tested version is 1.0.0 Price: 5.49 App Store links", "date": "2010-09-14", "grade": "9.0"}