{"name": "Avventura geografica", "ref": "https://multiplayer.it/recensioni/80333-lost-horizon-avventura-geografica.html", "text": "The adventure began in 1933, when James Hilton published the novel Lost Horizon, of which Frank Capra then shot the film of the same name in 1937. It's not over: in 1973 Charles Jarrott decided to shoot the remake and now, in 2010, Deep Silver pays tribute to this glorious legacy with a video game that could only be a graphic adventure. The theme is so classic that it has become a clich, but the developers show that they are aware of it. Thus, instead of a minestrone heated more than the oil in a McDonald's fryer, the result is a valid tribute to adventure cinema. The protagonist himself, Paddock Fenton, a former soldier of His Majesty who is a bit of a hero and a bit of a villain, inevitably resembles Professor Jones, even if the game takes advantage of the first whip at hand to joke about it and exorcise the comparison. On the other hand Paddock is the typical individual who attracts trouble and disasters and who resorts to irony to distance himself from what is happening around him, even if behind the light-hearted air there is a traumatic past that allows us to appreciate him as a character less caricatured. However, it is better to get used to his irreverent humor, because we will spend a lot of time in his company. In fact, Paddock is forced to abandon his Sunday life as a smuggler who led to Hong Kong, at the request of the English governor, who has no more news of his son Richard, who has left on an expedition to Tibet. Paddock accepts only because Richard is a close friend who has gone through dramatic experiences with him. Thus begins a long and intense adventure, a real world tour that will take us to Shambala, a legendary place that hides a power that is too great and dangerous for humanity. Of all the powers too great and dangerous for mankind, we must admit that the one at Shambala is one of the most suggestive and believable that we have heard. Unfortunately, as expected, they will put a spoke in the wheel, the enemies with the least sense of humor that history has known: the Nazis. In all places and in all lakes Lost Horizon is above all a beautiful story told well, thanks to the pen of Claudia Kern, a novelist who can well be said to have made a crucial contribution to the success of the game. After a few minutes you enter the heart of the action, with Paddock closed in a wooden box thrown on the seabed by the Triad thugs. From here begins the adventure, long and articulated, never boring, which plays to restore the balance and then immediately break it with a twist, in a crescendo of threats that will obviously culminate in the final confrontation. Even with all the classic elements of adventure cinema, Lost Horizon is such a compelling journey into the exotic themes of colonialism that it awakens a sense of discovery, something we men accustomed to Google Earth can only imagine. The curiosity to know after Berlin and the Himalayas what our next stop will be and what surprises await us makes us want to return to the world of Paddock. Of course it's not just him: there are well-defined supporting actors, such as Kim, whose character is very reminiscent of Nina from Secret Files, or the governor of Hong Kong, or even the cold and calculating Nazi scientist. But it is above all the minor characters who leave their mark, native inhabitants or immigrants of the many lands we will visit, bizarre and ineffable extras who seem to enjoy making fun of the hero. Unfortunately the dialogues are often full rivers, too rich in information. While on the one hand they let us know all the details of the story in depth, on the other they are not brilliant enough to be able to afford such delays. Furthermore, they mostly take place automatically, except for some occasions in which we can choose the answer to give, without this affecting the story anyway. Traveling with gps If you have played the Secret Files series you will recognize many elements of the interface, which remains an example of tradition. In addition to the classic puzzles, Lost Horizon offers some diversion, which however remains inexplicably confined to the early stages of the game, precisely those contained in the demo. In the first chapter we can have fun escaping from a crate thrown under water, losing our pursuers in an action scene, and collaborating with a supporting character. This last possibility actually exists also in the final phase of the game, but on that occasion objects cannot be exchanged between the characters. How the best mechanics are all concentrated at the beginning remains a mystery. The real sore point, however, are the puzzles. They are so easy that we have rarely stopped for a few minutes to reflect, even in the face of the less logical ones. Paddock often gets away with saying itor ~I don't know why I'm doing this, but I'm doing it anyway~. And in any case it's enough to try different combinations of inventory items to find the right way. This aspect is subjective, there are always those who find the puzzles more difficult, but those who have played many graphic adventures will finish Lost Horizon effortlessly. Even on the only two occasions in which the game asks us if we want to try the test on a difficult level, the challenge still turns out to be laughable. Not to mention the string of iron cables, sticks and lockpicks with which to open an infinite number of chests and doors, as if the developers had run out of ideas. Despite this there are some intriguing situations, such as the enigma of the tiger that threatens the village, even if they don't give the necessary satisfaction. The point is precisely this: after such an exciting and tortuous journey, it would be nice to be able to say that you have worked hard, feeling tired from sweating but proud of having reached the top. Promises well already from the poster Another ace up Lost Horizon's sleeve is the visual frame. There are so many screens, all hand painted and embellished with beautiful animations, such as snowstorms or water from waterfalls. Crucial details for graphic adventures, which often suffer from excessively rigid environments. Some images in particular are beautiful, and all the actions of the characters are visually represented, without who knows what fluidity but with sufficient realism. The models are only discreet, but the artistic direction has focused on the comic style, thus compensating for the technical deficiencies. In particular, the narrative sequence that illustrates the story of the Eye of the Dragon has been designed with very captivating tables. The attention to detail is also recognized by the choice of fonts, the portrait of the character near the text of the dialogue, the loading icon and the title screen. Furthermore, at the end of the adventure we find out if we have won an honor (we will not reveal which one) and we can play the Lost Horizon prototype. The similarities between Secret Files and Lost Horizon made us suspect that this adventure arose along the way from the stories of Nina and Max. This would explain why some mechanics are present only in the early stages of the game. It is no coincidence that a puzzle in the extra menu item acts as a teaser for the release of Secret Files 3, perhaps Deep Silver's most anticipated title. In the meantime anyway, let's enjoy Lost Horizon.", "date": "2010-09-09", "grade": "7.8"}