{"name": "Buscar el levante per il ponente", "ref": "https://multiplayer.it/recensioni/80530-commander-conquest-of-the-americas-buscar-el-levante-per-il-ponente.html", "text": "At the beginning of the 16th century, when the first settlers arrived in what had already been baptized the New World, they hardly imagined what they would really find: a continent rich in resources and precious goods, because even the remarkable autochthonous civilizations hardly exploited them and at the same time they excelled in the working of precious metals and gems. In this article we will not judge the shameful massacre perpetrated by us Europeans against the Native Americans, which would be quite ridiculous considering that in several games, including an excellent package for Medieval II: Total War, he really took sides of the European conquerors behaving even worse than the historical conquistadors. Instead, what we will do is analyze a title that will put us in the shoes of those first settlers, viceroys and admirals in a good attempt to obtain a successful mix between the management phase and the war phase (fought only on the sea) trying to give us a fairly complete picture of what it's like to start from scratch and desperately need the motherland until the moment is reached when it will be possible to be totally independent of it. One colony after another It must be said that it is not the first time that one thinks of setting a managerial strategy in the New World (Port Royale should say something) nor of inserting the motherland as a fundamental element for the development of the colonies (Age Of Empires III), however, the attempt of Commander: Conquest of the Americas is not bad at all and there would be all the features to interest, from naval battles to the numerous problems with the natives. The strategic game produced by Paradox is a rather difficult title right from the start: only 3 cargo ships, 50 inhabitants and a place of choice where to found the first colony (it is also possible to decide the names). Not even the time to lay the last stone before the various advisers (military, trade, diplomatic and so on) will begin to give advice and missions to be completed, from the opening of a first trade route with the motherland (also essential to go and collect new settlers) to the construction of a government and tax building, to the development of a proto-industry to collect and process resources up to obviously the need to arm a discreet fleet to protect the routes and ports. In words it seems complex, and at stake, in fact, it is, especially since the money sent by the king has the tendency to vanish with incredible speed and therefore the first objective must be precisely to get busy with the routes and export the goods that are so much requested by the beloved sovereign, and when the colonies will become two (to found a new city ~just~ bring a ship with 50 settlers to a free slot on the map, the problem is that then this second city will also have the same problems as the first, and then the third and so on) things will become very complex indeed. In fact, it is inadvisable to think of Commander: Conquest of the Americas as a game where you can let off steam for a few minutes, also because that is not what it was created for, but unfortunately we cannot avoid noticing that in various situations the game can get bored, especially at the beginning, not so much because the problems are insurmountable, but because the times required for construction, travel and training lead to several minutes in which the player has two choices: either he makes a coffee , or whirlingly accelerates the speed of play, through a special command, risking however to miss important warnings from the advisers. In these cases, the distance between difficult and frustrating is very small and the beauty of good management is precisely being able to never cross it, while maintaining the traditional challenge that the genre offers, but without risking that the player's attention drops due to dead time or the overlapping of too many activities. For the king and for the booty! Inevitably, sooner or later in the 150 years you have to set up your own colony, you're going to run into problems with other European nations - thought you had the exclusive? Tsz - because they will have the bad idea of establishing new colonies in ~slots~ where you were just about to go and settle yourself, and, since we all depend on our respective homelands and we all reach them via the ocean, it is right on the sea that the controversies. With cannon fire. We start with caravels and flutes, but, as the years go by, it is possible to unlock carracks, galleons, frigates and ships of the line, unfortunately for better or worse the same for all deployments. In the event of a naval battle, the isometric view of the tactical map will narrow down to the point where the battle takes place and from there it will be possible to command single shipsclearly as in a three-dimensional real-time strategy game. Sound like Total War? Yes, and in fact this mode is a not so well done clone of what we saw in the last work of Creative Assembly. Although the graphic aspect of the ships, of the water and of the environment (of the coasts for example) is quite pleasing to the eye, in fact, it is decidedly unthinkable to compare it to the magnificence seen on Napoleon Total War, both at the level of the textures of the individual models ( including crews) and when it comes to special effects. And if we talk about sinking, not even to talk about it: if in the Creative Assembly game you sometimes find yourself losing a fight because you get lost observing in what an extremely realistic way the hulls invaded by water deform before sinking, in Commander: Conquest of the Americas the risk is not taken, since the ships simply tend to sink Asterix-style pirates, with a not exactly idyllic visual effect. On the other hand, the game tries a slightly more strategic approach than Total War's ~whoever has the biggest is a bully~ mob, allowing the player to constantly monitor the resistance values and the severity of the damage suffered from each ship via good panels modeled on the style of the ship's blueprints. Too bad that the laudable intention is ruined by an AI in enemy ships that to define as light seems euphemistic, unless taking a course against the wind is part of some abstruse unknown naval tactic: in general, once given to each vessel a worthy target, maybe avoiding unlikely caravels to assault galleons, just watch to enjoy a landslide victory. In case of difficulty, however, it is possible to manually control a single vessel by deciding its route, level of sail and giving the order to fire only via a click of the mouse. Few ships governed by a mediocre AI therefore complete a rather bleak picture of marine battles, and, in general, of a title that perhaps should have been worked on for a moment more before being released at full price.", "date": "2010-09-09", "grade": "5.8"}