{"name": "Sempre in giro con un Apache", "ref": "https://multiplayer.it/recensioni/80210-chopper-2-sempre-in-giro-con-un-apache.html", "text": "Even in video games, as in other fields of life, fashions dictate the law. In fact, lately any new war bond, to be defined as such, cannot fail to have, within it, at least one mission starring an assault helicopter. And just two of the most awaited FPS, i.e. the giants Call of Duty: Black Ops and Medal of Honor have recently dedicated large trailers to their way of understanding battles with these means, both with certainly very spectacular effect. In a more modest way, however, it has been possible for some time to maneuver war helicopters on the iPhone, thanks to the nice game Chopper; its sequel, Chopper 2, seems to promise even more action and variety if possible. 2D shovels in a 3D world Chopper 2 is a mission-based arcade war game in which you will have to maneuver a single attack helicopter engaged on multiple fronts. Controllable both via accelerometer (with the possibility of calibration) and with a virtual analog stick, moving the supplied vehicle will never be a problem: in fact, the aircraft responds promptly to all stresses, resulting in light and agile maneuvering. In reality, perhaps the behavior is so fast as to seem quite unlikely, but given the purely arcade nature of the title, a realistic and ~heavy~ approach to the medium would certainly have gone out of tune. The intuitiveness of the controls is also confirmed by the ease with which it is possible to fire, i.e. by touching any free corner of the screen with your finger and directing the powerful automatic machine gun with half-moon movements; the always present laser sight will allow to further increase the accuracy of fire. On the contrary, the launch of explosive devices is more demanding: in fact, the bombs can be of two types, either vertically dropped without propulsion (and in this case they will be launched first towards the targets considering the speed of the helicopter) or the classic missiles with an oblique trajectory, to be fired after aiming. The type of enemies present will vary from the single soldier equipped with the rocket launcher to much more dangerous defense turrets, passing through armored tanks equipped with heat-seeking missiles; in the latter case it will be necessary to be careful to avoid the missiles with rapid movements as well as, obviously, to try to eliminate the means. To move even more quickly it is necessary not to fly too high even if, risking a low flight, you will then have to deal with the unpredictable flocks of birds, which if hit will damage the aircraft. In the middle of each mission there is a respawn platform, landing on which it will be possible to recharge with health and ammo. There are 4 levels, with different settings (desert, mountain, city and forest) that can be tackled by choosing the usual three types of initial difficulty; in each of them it will be possible to select three different missions and as many sub-missions, for a total of 36 campaigns. However, the nature of the objectives is very varied: they will go from the classic ~kill all the enemies you meet~ to real rescue and recovery missions of both civilians and important military objectives; moreover, there will be sections for armed escort for a convoy or for the demolition of strategic buildings. The helicopter, as already mentioned, moves in a very agile way but only in 4 directions, thus ignoring the depth: although set in a three-dimensional context, the game is to all intents and purposes an old school 2D shooter. In this sense, however, it is fair to point out that the cleanliness of the graphics reaches very high standards, as well as the speed and stability of the framerate; thanks to the Retina Display of the test iPhone 4, the sharpness is very high, much higher than the previous version. On the other hand, the backgrounds, although well done, are decidedly too bare and absolutely devoid of life or particular details. Even the music certainly doesn't shine for originality, getting tired in the long run. There is also the Open Feint points sharing system, even if there is no multiplayer mode. The glass sphere of Multiplayer.it After the ominous forecast (later proved to be spot on) of the various online passes for used cars announced in the past weekly podcasts, the editorial staff of Multiplayer.it, thanks to an April Fools' Day, confirms itself as prophets and guess so, months in advance (albeit only partially), a function that on Chopper 2 has actually been activated, starring the two most loved and hated Apple devices of the moment such as iPad and iPhone. Basically, thanks to the ~Remote Control~ item in the game options, it is already currently possible to use iPad as oneconsole on which to run Chopper 2 and control the helicopter directly with an iPhone or iPod Touch connected to it via bluetooth. It being understood that such a solution, for now limited only to this title, has an explosive playful video potential, the costs to implement it remain to be evaluated: the total, considering an iPod touch and an iPad 16 GB Wifi would in fact start from a minimum of about 700 euros, higher than any console currently on the market. However, the situation is different for those who already have both devices: in this case, unknowingly, the lucky user would find himself in his hands a sort of ~modular~ Apple console ... nothing but April Fools! The tested version is 1.0 Price: 2.39 Apple Store Links", "date": "2010-09-07", "grade": "7.0"}