{"name": "Dopo Mother Brain", "ref": "https://multiplayer.it/recensioni/80472-metroid-other-m-dopo-mother-brain.html", "text": "Metroid: Other M was awaited with particular curiosity not only by all those Wii owners who do not find themselves in the casual, family and party trend that constitutes the majority of the offer on the Nintendo console; the interest in Samus' new adventure was also linked to the name of the development studio in charge of the project, that Team Ninja to which we owe the birthplace of series of the caliber of Dead or Alive and Ninja Gaiden. Productions, the latter, not always universally appreciated or capable of making all gamers agree. In reality, between levels of difficulty at times exasperating, unmanageable cameras, bouncing boobs and the over the top inspiration of the deus ex machina Tomonobu Itagaki, the works of Team Ninja have almost always been able to offer at least valid playful contents enhanced by a graphic component of great level. However, the abandonment of its histrionic founder in mid-2008 was a jolt that the Japanese group has yet to demonstrate that it was able to assimilate and digest; Metroid: Other M therefore also constitutes a testing ground, a turning point from which hopefully to be able to start again. The long history of Samus Metroid: Other M is placed in the chronological narrative of the series immediately after Super Metroid, therefore after the death of the little Metroid at the hands of Mother Brain; Samus, aboard his spacecraft, intercepts a distress signal with the code name ~the cry of the little one~, coming from a remote area of space. The first thing that distinguishes this chapter, and which appears evident from the first minutes, is the great emphasis placed on the plot within a franchise that up until now had relegated this component to an accessory element. This happens through a considerable number of well-made computer graphics sequences to unravel a quite interesting script, even if too verbose and not particularly original. Everything revolves around the meeting between Samus and a group of soldiers of the Galactic Federation led by Adam Malkovich, former commander of the same protagonist at the time of his enlistment in the body in question. A complex relationship, that between the heroine and Adam, which is narrated in great detail and thus filling Samus with an emotionality and a characterization that for some may even be excessive, in memory of the aura of mystery and silent omnipotence that she had so far outlined the heroine. The fact is that Samus ends up collaborating with the team of old comrades, trying to find out what secrets the mysterious alien ship hides inside. Just Adam's command position constitutes the solution through which the programmers have chosen to manage the progressive discovery of Samus's powers, one of the fundamental points of each Metroid; in this case, in summary, the poor protagonist continues to possess all the skills present in the game at all times, but their use is subject to the kind ~concession~ of the leader when he deems it appropriate. A narrative solution that is frankly not very credible, if not frustrating to support; the fact that, for example, you find yourself constantly losing energy due to the excessive heat of the area with the lava, and that you have to wait for ~permission~ to be able to use the protective suit you already have, is an absurdity that it forces you to shift your attention elsewhere in order to be able to accept it and at the same time respect your own intelligence. Beyond these rather marginal elements, the most interesting aspect of Metroid: Other M is undoubtedly that sort of ~throwback~ that returns Samus to the third person, after the excellent episodes of the Prime series made by Retro Studios in in which the players have literally worn the role of the protagonist. In fact, Team Ninja has preferred to choose the solution that accompanied the beginning of the franchise, or at least this is the first impression; in reality, although there are a good number of corridors and areas to go through horizontally, as in the classic two-dimensional chapters, Metroid: Other M is basically a 3d action game. In fact, there are many and frequent areas, more or less large, to be explored in all directions on a three-dimensional plane; in a similar way one can often come across platforms on which to jump, or areas to be reached with good precision. In all these occasions it becomes difficult to accept the solution in the control system chosen by the programmers, who have opted to rely only on the Wiimote without any alternative possibility. The reasons for this decision are understandable in view of the desire to give the game that retro and ~classic~ sense that evidently wanted to be associated with this episode; when tested, however, it is difficult not to consider it a stretch, for a whole series of reasons that compromise the quality of the gameplay. In the first place, it soon becomes evident that the directional cross is insufficient to guarantee the necessary precision in moments in which the latter is instead fundamental, giving rise to situations of anachronistic frustration. The second questionable aspect is instead the management of the transition to the first person view, which takes place by pointing the same Wiimote directly on the screen; by doing so you can visually explore the settings or shoot the missiles (and this is the only way in which you can use this weapon), but the price to pay is the total immobility to which you are condemned, an obviously deleterious factor during a fight or in the most excited sequences. Probably the Ninja Team has seen in this choice a challenge for the player, called to a constant and continuous coordination, but the experiment does not appear frankly successful; on the contrary, it is perceived that the fluidity of the action is affected, not to mention when the sensor that detects the pointing of the Wiimote does not do its job perfectly. Samus, answer! Samus! SNAAAAAKE! But the reasons for perplexity do not stop there, and touch on other aspects of this Metroid: Other M. One of the most criticized in forums around the world, and rightly so, are the passages in which one is forcibly blocked on the view in first person looking for a precise clue that allows to continue. You can't move, shift or change your view: very simply you have to look for an element that is almost never clearly highlighted, which is almost never clearly highlighted, which acts as a ~trigger~ for the next sequence, by moving your gaze and with the Wiimote pointed. The problem is that we often find ourselves not knowing what to look for, and above all in most cases they are elements of microscopic size that solve everything with a sort of ~pixel hunting~ that recalls the less fun moments of adventures point and click graphics; a real treasure hunt that adds nothing to the gameplay and does not provide any particular fun. Similar speech also for the sequences during which the camera moves behind Samus' shoulders, to Resident Evil 4, which should underline some moments of particular pathos; the heaviness and woodiness that the control system assumes on such occasions also makes these passages something that struggles to find a positive meaning in the game economy and which one would gladly have done without. And the need, to reload missiles and energy, to do that concentration maneuver with the controller placed vertically doesn't seem so better to us than the good old supplies released by killed enemies, as happened in previous Metroids. Faced with so many criticisms, where Team Ninja could have shown what it's made of is undoubtedly in the combat system, thanks to the experience gained with those Ninja Gaiden who based their substance precisely on this component; and actually a great job is perceived above all in balancing difficulty and depth, which should have found the right compromise to interface with a user who is not so totally hardcore - not to say masochistic - like that of the series starring Ryu Hayabusa. Therefore, if the not always perfect auto targeting takes away a lot of strategy, limiting the clashes with minor enemies to a simple repeated pressing of the 1 key, in battles with thicker opponents it is necessary to organize a slightly more elaborate technique , studying the weak points and exploiting them in one's favor. If things work roughly on such occasions, however, the implementation of the dodge is imperfect; in a nutshell, by pressing the directional cross at the right moment, you can avoid bullets and shots from enemies and at the same time get immediate availability of the Reload Ray. Timing, however, does not have to be sought with painstaking precision as in the best action games, but on the contrary it can simply be ~fished~ by continuing to press the d-pad rapidly. A shortcut that debases this component a bit, and consequently resizes the entire combat system. The spectacularity of the boss fights partially overshadows this criticality, and all in all we are far from a bankruptcy result, but given the developer's pedigree, perhaps something more could have been expected. What about the level design? Discreet, but far from the quality of Nintendo works; much of it is far too linear and utterly poorof the exploratory element, with the possible exception of the last part of the game, but this is not the biggest problem but rather the perception that the touch of genius is missing, the crystalline quality of the products made internally by the great N. Finally, the technical component, not certainly sensational; the Wii has been used much better in the past, and beyond the console's limitations, subdued texture quality and little more than sufficient general art direction are evident. The Metroid universe remains fascinating and able to support the aesthetic system, but this element is certainly not the merit of Team Ninja. Finally, the sound is didactic, far from the evocative power of the best chapters of the series.", "date": "2010-09-07", "grade": "7.5"}