{"name": "Ventimila leghe sotto le Isole Medas", "ref": "https://multiplayer.it/recensioni/80138-dive-the-medes-islands-secret-ventimila-leghe-sotto-le-isole-medas.html", "text": "The Game is available for download on the WiiWare service Ah, the allure of underwater treasures! The mystery of what is hidden in the depths of the Mediterranean has moved many adventurers in history in search of fortune or celebrity, and the same drive leads us, new Jacques Piccards with wetsuit and rifle, to explore the seas near the islands in this game medas. As the atlas teaches us, these are fascinating Mediterranean islands off the coast of Catalonia, Spain. We don't know exactly if the story is true, but in the premise of the game we learn that ~hundreds of ships, of all flags, have been submerged by the power of the Ocean~ and that their secrets have remained hidden, hidden in the depths of the sea ... ~until now~. The plot is not elaborated that much, but the crux of the matter is the desire to explore the particular marine area around the Medas Islands in search of various treasures and possibly in an attempt to discover the legendary ~Temple of the Order of the Medes Islands~ , of which clues will be discovered with the continuation of the game and the dives. At first glance Dive: The Medes Islands Secret looks like a variant with a human protagonist of the legendary Sega's Ecco the Dolphin or a 2D reinterpretation of Endless Ocean, but a few minutes of virtual swimming are enough to understand that the game structure actually draws on others shores. The term ~metroidvania~, of uncertain coinage but increasingly used, gives a rather precise idea of the structure that characterizes this game, with a type of exploration and action that recalls precisely that of Castlevania and Metroid. In essence, it is a question of guiding our diver towards various points of interest in the depths of the sea, in correspondence with areas where the various treasures scattered in the seabed are hidden, with the need to go back and forth several times in exploration to discover new passages and reach further areas of game thanks to the progressive evolution of the available equipment. Maps, treasures and water The control over the character is quite particular: with the pointer, moved by the Remote Control, the direction in which to swim is indicated, with the possibility of imparting an acceleration by pressing the B key twice. The diver is armed with a tranquilizer shotgun with which possibly put out the various marine creatures that will appear on the road, while for deeper areas it is possible to use an underwater torch. At any time it is possible to call up a handy map that clearly shows, albeit deliberately approximate, the direction to follow to reach the treasures, but the complexity of the underwater routes and corridors makes it quite difficult to move from point A to point B. The element to always take into consideration throughout the progress of the game is the amount of oxygen available, clearly visible in the indicator at the top of the screen. Strangely, the oxygen level decreases both by simply swimming underwater and by contact with the various marine creatures which must therefore be avoided by various means, dodging them or hitting them with sleeping pill darts (note the naturalistic concept that seems to permeate the product) . Another element that closely recalls the aforementioned Metroid is the possibility of increasing the power of the equipment, increasing the number of shots for the rifle or expanding the capacity of the oxygen cylinders, for example, evolutions that are essential for completing the exploration of the various play areas making it possible to access otherwise closed areas. The possibility of returning at any time to visit already explored areas in search of new passages and secrets significantly increases the longevity of the game, giving greater strategic depth to the simple exploration of the environments. The fundamental problem from the point of view of gameplay is given by the lack of variety in the game mechanics and the fundamental simplicity of the actions that can be performed, which risk quickly depleting the initial interest in the game. A nice trip Despite an honest structure, perhaps the gameplay is not the element that emerges most from this Cosmonaut Games product. The atmosphere, supported by an excellent graphic sector, is probably the main characterizing point with regard to the submarine journey of Dive: The Medes Islands Secret, an element from which it takes on a large part of its identity. Beyond the clean design adopted for the representation of the landscapes, the choice of colors and the effects of light and shading help to stage an excellent interpretation of the underwater scenarios, full of life and mystery. The will to discover new scenarios and secrets undertomarini represents the real driving force that pushes you to return to the game and explore the levels already visited previously, with the sole purpose of seeing what is hidden deeper or in the darkest corners of the abyss. Therefore, the work carried out on the construction of the scenarios and on the animation of the main character and of the various sea creatures is good, although the control system adopted, combined with the game structure which often requires extremely precise movements to pass through shoals of sea creatures or avoid lurking dangers, often makes maneuvering quite difficult, especially in the more advanced levels where the number of enemies and the relative danger significantly increases. Little to record in terms of the audio sector, which between suitably ~underwater~ sound effects and a few background music repeated according to the different situations (menu, dive, moment of danger) does not stand out for its qualitative depth, carrying out the task without infamy and without praise.", "date": "2010-08-27", "grade": "7.0"}