{"name": "Polarium", "ref": "https://multiplayer.it/recensioni/polarium_a.html", "text": "The power of ideas From the very first moments of the game, Polarium reveals a minimalist and retro nature that will surely not make lovers of on-screen fps and polygons dizzy; the graphic style is essential to say the least with an overall aspect that, except for some effects, could be managed without major problems even by the first monochrome Game Boy. Yes, because the Nintendo production distances itself from the titles that make the aesthetic component their workhorse, then putting the exclusive peculiarities of the DS into the background. In contrast, Polarium completely dispenses with visual gratification to offer gameplay that relies entirely on the touch screen; although it is also conceivable with a traditional control system, already after a few minutes of playing you realize that such a solution would be uncomfortable, not very functional, as well as light years away from the -apparent- simplicity that the programmers have sought. On the other hand, even the game structure takes only a few minutes to learn, it is so crystal clear and clear. In a nutshell, Polarium puts in front of the player a screen more or less covered by black or white squares arranged next to each other. Clicking with the nib on one of these squares will change its colour, with the aim of creating horizontal rows of the same colour. Black or white does not matter, the effect is the same, that is the elimination of the line itself. A bit like tetris to be clear, even if the DS game has enough personality to prove to be much more than a trivial clone of the masterpiece of the genre. However, clicking on a single square, one at a time, is certainly not the ideal technique for overcoming even just the first level of the game; on the contrary, the Nintendo puzzle game requires you to draw a continuous line with a single stroke of the nib, to then obtain the simultaneous inversion of the color of all the small squares touched. Easier said than done, we assure you... To each his own game Polarium itself includes two distinct game modes. The first, called Challenge, is certainly the one closest to the classic mechanics of the genre since the aim is to eliminate as many lines as possible before the screen fills up. Although the challenge with oneself and with the will to improve one's records is sufficient to keep the interest alive, the repetitiveness of the action soon puts this mode in the background in favor of the one called Puzzle. It is precisely in the latter that Polarium gives its best, offering 100 puzzles of increasing difficulty with which to use all one's neuronal capacities. In practice, it is a question of dealing with pre-established and fixed grids of variable size, one for each level; the difficulty lies in the fact that these must be solved with a single stroke of the stylus, in order to invert the ~right~ boxes and eliminate all the lines on the screen in one fell swoop. If the very first stages are nothing more than an elementary introduction to the modality, the real problems begin between the twentieth and thirtieth. It's not uncommon to lose tens of minutes in front of the screen, magnetized by the challenge offered and exalted by the satisfaction you feel once you complete an unsettling puzzle at first sight. It's really about racking your brains, imagining the path to take in perspective and then following it with a single stroke of the nib. A real puzzle therefore, capable of throwing even subscribers to ~The Puzzle Week~ into crisis, and for this reason destined in the same way to irreparably alienate those who prefer to turn off their brain and relax in front of a video game. Last but not least, the appreciable implementation of the wireless multiplayer with which the Nintendo laptop is equipped should be mentioned; In fact, Polarium allows you to set up challenges against an opponent with a single cartridge, with a rather trivial game scheme through which the lines eliminated from your screen go to that of the challenger and vice versa. On the other hand, the implementation of the possibility of sending, obviously always via wireless, a sort of ~demo~ of the game containing 10 ~puzzle~ levels to any other DS is very clever. In other words, a small taste to understand if you are the right pasta to face the challenge... Comment Polarium is a really interesting and challenging puzzle game, which exploits the touch screen features in the ideal way. While the Challenge mode proves appreciable but certainly not exciting, the Puzzle mode offers a genuine and original interpretation of the genre, offering a series of 100 ~puzzles~ that require a completely unusual brain effort for the modern world of video games. But as well as ~The Puzzle Week~causes morbid attraction or spontaneous repulsion depending on one's personal inclination towards a type of entertainment based on reflection, in the same way Polarium is a product capable of immediately capturing or alienating players without the possibility of returning, even more so considered a graphic design which does nothing to tease the uncertain. Take it or leave it, on or off, black or white: Polarium is like this, from head to toe. Pros Stimulating puzzle mode Authentically based on the touch screen mechanics Extremely durable for fans of the genre Cons Like holy water with the devil for action lovers Hyper minimalist technical aspect Weak Challenge mode Although equipped with excellent technical characteristics and with a ductile and adaptable control system for every kind of game, Nintendo DS certainly finds fertile ground in the puzzle game vein for expressing the characteristics of the double screen and the sensitive technology in the most immediate and intuitive way. touch. It is no coincidence that within this genre numerous titles have not been slow to appear, including the semi-unknown Polarium produced by Nintendo which in the European line-up has earned the cheapest game slot available on the market. In fact, with less than 30 euros, every new user of the new dual-screen console has the opportunity to take home an intriguing, challenging but certainly satisfying title.", "date": "2005-03-31", "grade": null}