{"name": "Lascia o raddoppia?", "ref": "https://multiplayer.it/recensioni/79633-tv-show-king-lascia-o-raddoppia.html", "text": "Version tested: PlayStation 3Although specialized in the creation of video games for Java-compatible mobile phones and iPhone, the French Gameloft has for some years now begun to enter the world of consoles, first with some conversions for Nintendo DS and then moving towards the interesting WiiWare platforms and PSN. TV Show King, which has been available on PlayStation Store for some time now, has done more or less the same process: first released in 2008 as part of the WiiWare launch lineup, it was ported to iPhone before arriving even on the Sony console. It is, as it is easy to assume, a multiple-choice TV quiz that can be played alone (against three AI-controlled opponents) or with friends, both locally and online. Once the game has been downloaded and installed (which costs 4.99 euros), the start screen presents us with three options: ~play~, ~leaderboards~ and ~competitor aspect~. This last item allows us to create a new character by modifying his name, gender, face shape, eyes, hair, etc. It is also possible to determine the look based on pre-set themes or by relying on random combinations. cheer! The ~play~ option is divided between local and online matches. The former can be played in four different modes: ~classic~, divided into rounds which are marked by a round of questions and a spin of the wheel; ~face to face~, necessarily played against a human opponent; ~quiz attack~, i.e. a skill test which consists in correctly answering the largest number of questions in sequence; ~the last one wins~, an elimination race also to be played with friends. There is clearly a propensity for multiplayer, but the ~classic~ single mode still offers some satisfaction and is based on a rather articulated structure. By simulating the television broadcast of a prize quiz, the presenter announces the competitors and immediately starts with a first round of questions, which we can answer by acting on the directions of the d-pad or on the main buttons of the Dual Shock. The answers of each competitor are visible to everyone, so it sometimes happens that you simply rely on the number of consents to guess the right answer. However, it is clear that there are big differences in terms of points between those who select an answer first and those who do it later, ergo not only must you be good with questions but also rather quick. As mentioned above, each round is punctuated by an optional spin of the wheel: if we are lucky, this operation can give us extra points overall or by subtracting them from an opponent of our choice, while if we are unlucky it can make us drop points or even lose all those won so far. Starting from the second round of questions, things get a little more complicated, because you have to use the controller's motion sensor to make the answers visible before choosing one. This can be a little difficult at first, but you learn quickly. The last stages of the game see the two competitors with the highest score compete in a competition with direct answers which will decide the final winner. The numbers of the game guarantee an always fresh experience, with a large number of questions that hardly tend to repeat themselves and six different categories (general knowledge, entertainment, history and geography, science and nature, school, sport) to satisfy everyone. Playstation 3 trophies TV Show King offers nineteen trophies: most of them are bronze and are obtained by achieving basic objectives (playing two online games, creating four characters, spinning the wheel a certain number of times, etc.), while the two trophies of Silver can only be won by correctly answering all questions in a nine-round quiz and playing for more than thirty (clearly non-consecutive!) hours. Who doesn't play together... We played several matches online with TV Show King, but found opponents rather quickly. In this case, there are three modes available (~classic~, ~face to face~ and ~the last one wins~) and are decided by whoever hosts the game and creates the waiting room, together with a series of details about the number of rounds and the difficulty level of the questions. If the four human participants are not reached, the system can replace those missing with virtual competitors in order to guarantee the execution of the quiz even in non-optimal conditions. Comparing yourself to other people results in a very different experience than playing single-player, with the gameplay also allowing you to implement strategies to mislead your opponents. For example we can selectquickly an answer that we know is wrong to get others to follow us, then changing choice at the last minute. The points system based on the speed of the answers makes the matches very balanced, opening the door to any final scenario as it is possible to recover very quickly. The introduction of the ~wheel of fortune~ also adds a welcome surprise factor to the dynamics of the quiz. The technical realization of the Gameloft quiz unfortunately reflects the ~budget~ nature of the product, with a limited number of animations that tend to repeat themselves, very simple polygonal models and an almost embarrassing audio commentary in Italian.", "date": "2010-08-25", "grade": "7.0"}