{"name": "Io la vostra offerta", "ref": "https://multiplayer.it/recensioni/79883-mafia-ii-io-la-vostra-offerta-la-rifiuto.html", "text": "Tested version: PCExactly one month ago we were here writing a huge preview based on a rather advanced but absolutely not final code of the PC version of this long awaited sequel. Expected by longtime players who were lucky enough to play the original title developed by that software house which at the time responded to the name of Illusion Softworks and which managed to leave its mark within a genre, that of action with a free roaming component , which was slowly establishing itself thanks to the disruptive force of a recently released Grand Theft Auto III on the market. Expected, also, by the ~fresh~ players who seem to see in the title the perfect mix of freedom granted to the player and highly cinematic plot. It is here that the heavy legacy of Mafia II lurks and all that hype that has been created around the title in the long years of its development. But even if you've read the thousands of characters in the aforementioned article, a minimal summary is in order before judging the game. This is the story of one of us Born in Italy but emigrated to America as a child, Vito Scaletta is our enterprising protagonist. Belloccio, of few bold and pungent words, his life is immediately linked with Joe Barbato, also Italian-American but with friendships clearly of criminal tendency. Together they grow up committing petty crimes also thanks to an extremely poor and tiring family life for both. In the middle of a heist in a jewelry store, however, Vito is captured allowing only Joe to escape and, after a brief interlude between prison and the front of the Second World War, here we are in his shoes upon returning to Empire Bay due to a wound in battle. From now on we will follow the evolution of a criminal life within the mafia hierarchy and through two different historical periods interspersed with another break, this time rather long, in jail. The story of Mafia II is in fact gutted through 15 different chapters, just under half set in 1945, in a cold, snowy and austere Empire Bay due to the Great Conflict, and the remaining part focused instead on the beginning of the 50s in the full of a colorful and lively economic boom that completely changes the colors of the city also thanks to a spring that has just blossomed. The player will therefore experience two different ways of experiencing the city by getting his hands on more than thirty different vehicles that will be unlocked following the historical evolution of the period and on a good quantity of pistol weapons of various types (Colt, Magnum and various automatics) passing through shotguns and war rifles (such as the Garand) to get to various automatic machine guns including the tragically famous Thompson with disc magazine. There will also be a couple of throwable weapons such as grenades and Molotov cocktails. There will be no limitations on the number of transportable weapons that can easily be collected by enemies and armed using the various ammo shops scattered around Empire Bay. On some sporadic occasions it will also be possible to buy new ones by exploiting a military activist with a small operational basement, but their use will be linked to certain plot situations. Being cops in Empire Bay In Mafia II the police are a crucial element of the gameplay and are able to give the player a different hard time. If a patrol car or foot cop catches the player red-handed while stealing a vehicle or robbing a store, or even while committing minor offenses such as speeding or hit-and-run, they pounce immediately in pursuit of him to capture him. In the wake of what was seen in GTA IV (also in this case the comparison is a must), depending on the seriousness of the crime, up to 5 stars will be awarded to the player and obviously the impetuosity of the police will be proportional. In Mafia II, however, there is a peculiar element of difference from the competition: if you are chased for a long enough time or are seen up close when on foot, Vito or his vehicle will be marked as wanted. When you are in this condition, it will not be enough to leave the pursuers behind to be safe: as soon as you pass a policeman for more than a few seconds, the pursuit will be activated again. To be truly free it will be necessary to get rid of the vehicle or change its license plate or even paint it in a workshop while you are not seen or, if Vito is the wanted element, it will be essential to buy new clothes. The system offers a good element of challenge and encourages the player to behave more prudently during missions, while at the same time suggesting careful management of one'sor garage and the cars contained within it. We always get too involved And precisely the story is the strong point of Mafia II thanks to an extremely accurate cinematic cut especially in the details. The numerous dialogues punctuate the chapters involving the player also thanks to their decidedly adult tone, sometimes grotesque, but always cruelly anchored to a reality of a period that many of us have known also thanks to the numerous gangster movies that have teased that ~mafia~ imaginary on which cinema has long fed. Vito will be at the center of a dense network of forced criminal connivances, of fratricidal infighting wanted by the godfathers who share the blood and money of the mafia organizations of Empire Bay sometimes respecting absurd self-imposed moral and ethical codes, other times not looking at anyone and stimulating the sale of drugs, prostitutes and weapons. Even if the game sometimes seems to pass too quickly and without big twists, the last chapters in particular manage to inject an incredible dose of adrenaline and suspense into the player's head and hands (it is impossible not to mention a wonderful reminder of the final of the first Mafia: City of the Lost Heaven), who won't be able to tear himself away from Mafia II until he has completed it. A unique and bittersweet ending as the series teaches, which comes after about 15 abundant hours of undoubtedly intense gameplay but, we cannot hide it, given the size of the project, we would have expected a greater longevity. The game is in fact exclusively single player and, once completed, offers very little in the way of extras that could stimulate replay value. There are three difficulty levels in all, available right from the start (and in this regard we strongly advise you to start immediately on the maximum difficulty) and the only collectible items concern the Playboy magazines scattered throughout the Empire Bay, 50 in all, and the wanted posters, 159 in all, which can be found by wandering the length and breadth of the city's alleys and neighborhoods. However, we feel obliged to praise 2K Czech, the developer of the game, for having solved the problem of in-game saves very well. In fact, we weren't the only ones who complained during the preview about a frustrating quicksave management but now everything seems to be solved: within each chapter the game is saved after each important event. Certainly it will not fail to repeat some particularly difficult fights or a certain driving section if you were particularly clumsy during a chase, but you will hardly find yourself facing particularly long sections of gameplay several times. Furthermore, all cutscenes and most of the dialogues (with the obvious exception of those made while driving), can be skipped. Empire Bay as Liberty City? Unfortunately, the answer to the question can only be negative. Mafia II manages to be free roaming only on paper, in the theoretical notion of the term. In fact, Vito Scaletta's daring adventure takes place inside an Empire Bay which, on the one hand, is entirely practicable far and wide and shows an attention to detail and an attention to detail that Liberty City (protagonist city of Grand Theft Auto IV) can only be dreamed of, on the other hand it lacks a total lack of secondary and accessory activities capable of giving it personality and, above all, variety. It's not just a matter of geographical extension, Empire is in fact decidedly smaller than Liberty, but precisely of location available to the player: there are a handful of clothing stores, some armories and a very small selection of bars where you can refresh yourself, as well as obviously to the apartments that Vito will change during his life as a gangster. The variety is in fact all poured into the environments that the player will visit in carrying out his missions and which, once the latter have been completed, will no longer be accessible. In short, Mafia II distances itself significantly from GTA IV, becoming in all respects a ~simple~ action, at the limit an action adventure, which in free roaming finds an accessory element to give greater depth to an extremely linear gameplay. The same mission system betrays the sequential nature of the story told in Mafia II: practically every chapter opens with a sleepy Vito about to get out of bed because he was awakened by a phone call or someone at the door. So, once we've got our favorite car, we'll have to head towards the character who will start the actual mission. As soon as the latter is completed we will have the only possibility of returning to itOur apartment to go to sleep, an action that determines the completion of the chapter. There are no real activities that can be carried out other than those imposed by the narrative and the same system of jobs (a sort of secondary missions) is extremely reduced to the bone since in our gaming experience we managed to find only two, between the other rather marginal in terms of duration and bite. Even the interaction with the secondary characters is practically absent outside the mission in progress: you will always have only a single interlocutor to reach in each chapter and not the handful of ~letters~ to which the GTA map has accustomed us IV each to identify a different supporting actor to interact with. Curiosity What does Playboy have to do with 2K Games? Much more than you can imagine given that the alliance between the videogame publisher and the famous adult-only magazine had already been disclosed several months before the release of the game. The result of the agreement is literally there for all to see: playing Mafia II you will find fifty magazines scattered throughout the premises which, once collected, will reward your effort with a beautiful full-screen image of a famous playmate of the time. The photos are in color, freely zoomable and with very high detail and even if very often the poses are quite chaste (today we are used to something else), it is always nice to see a beautiful little woman in skimpy clothes between one shooting and the next . New pilots or new assassins? However, there are two aspects in particular that convinced us in Mafia II and that well represent the natural evolution of gameplay elements not yet perfectly finished in the genre. Let's start with the controls and combat. Vito is controlled in a rather natural and usual way (on PC it is possible to use the mouse and keyboard combination or the Xbox 360 joypad, perfectly compatible) with the classic analogs to manage movement and view and the triggers to control the fire and the view more or less zoomed depending on the weapon being held. What works quite well, especially when compared to the heavyweight of the genre, GTA IV, is the management of covers. Vito ~glues~ himself to any surface to protect himself by pressing a button and automatically leans near the edges, in the classic Gears of War style, but with an additional button to turn the corner while remaining under cover. Although the system may appear a bit cumbersome at first use, it works particularly well indoors, avoiding the classic situation in which the protagonist ~hooks~ on the wrong wall, ending up perfectly in the opponents' line of fire. Unfortunately, the possibility of shooting ~blindly~ from behind a cover is missing, but the excellent realism of the weapons in their use, reload times and damage to the bodies, still manages to make the shootings very engaging and particularly dynamic, especially when the enemies on the screen are many. Unfortunately, the level of challenge during the fights seems to be calibrated downwards, thanks to the automatic recharge of the protagonist's energy when not hit for a few seconds. However, there is one peculiarity: life tends to restore itself in ever smaller quantities, making it more risky to come out into the open without particular prudence. Furthermore, it does not happen infrequently at the highest difficulty level to be killed with one shot if, for example, you are hit at close range with a shotgun. The other strong point of Mafia II is certainly the driving model which, if set on simulation (compared to the normal one, the other available) offers many satisfactions. First of all, each vehicle has its own characteristics of power, performance and stability which among other things can be partially improved through upgrade packages available in the workshops, but the reactivity of the vehicles, the reactions to accidents and more generally the physical weight of the cars return a good driving sensation that reacts credibly even to changing weather conditions. Everything then blends perfectly with the system that manages the damages which, while remaining largely anchored to the aesthetic level alone, are very credible. And fortunately, we take the liberty of adding, given that the driving sections in Mafia II are predominant in the gameplay and you will find yourself wandering the streets of Empire Bay for many, perhaps too many, hours. Cosa Nostra in 3D Just a few hours before publishing this review, wandering around the stands of GamesCom in Cologne, we had the opportunity to try the same demo released via Steam, but using the Nvidia 3D Vision Surround system. Empire Bay plays", "date": "2010-08-20", "grade": "9.0"}