{"name": "Radiocomandi in punta di dita", "ref": "https://multiplayer.it/recensioni/79371-touch-racing-nitro-radiocomandi-in-punta-di-dita.html", "text": "The golden age of the 80s has recently undergone a particularly lively phase of customs clearance and revaluation, with dedicated television programmes, photo shoots, music and, of course, video games. One of the entertainment reasons for the kids of those years, in addition to the stickers and cartoons with Japanese robots, were certainly the remote-controlled electric cars, produced by the Italian Gig Nikko and already the cause of bitter clashes over the regularity of the races of the time. Touch Racing Nitro tries to recreate the charm of those epic competitions on the iPhone screen, putting us at the wheel, or rather at the remote control, of powerful and colorful electric racing cars, the undisputed rulers of the handcrafted tracks built with great care in the various courtyards and terraces. Little big cars In Touch Racing Nitro, therefore, the goal of the game will be to bring your car to victory in the various races present, not by directly piloting the vehicle but, more properly, by remotely guiding it and directing it just as if we were maneuvering the original remote control. Adapting this concept to the sensitive screen of the Apple device was not easy and certainly the initial tutorial, which starts immediately after launching the application, can be misleading in this sense. According to the suggestions displayed on the screen, to direct the cars, the telephone should be held with both hands, directing the cars with the two thumbs; in reality this position proves to be quite uncomfortable right from the start, precisely because of the type of control chosen by the developers. In fact, to drive it will be necessary to physically touch the display along the portion of the track in front of the car, not the car directly; the position of the finger will indicate the exact direction in which the vehicle will go, considering the specific steering capabilities of each vehicle. The acceleration (and therefore the speed) will instead depend on the distance of the finger from the car: the farther it is pressed, the greater the sprint will be and vice versa; by sliding your finger back and forth you can adjust the brake and accelerator. A double tap will also activate the turbo, short but effective in case of need. Contrary to what is suggested, therefore, the best position to manage a race is by holding the phone from the back with one hand, swiping the index finger of the other to direct the toy cars without ever detaching it from the display; however, all this involves a certain degree of effort for the busy finger, so much so that obtaining the first results will cost a lot of practice on the track. There are 2 types of races, in addition to the already mentioned not very useful Tutorial: the Time Trial, in which you will compete as usual alone against the clock in all the available tracks, and the Tournament Mode, necessary to unlock extra tracks and cars . The tournament is structured in three categories: Indoor, Off Road and Super Car, with 6 races per event involving 4 cars at a time. Winning a competition unlocks the next one and at each difficulty level (selectable as usual between easy, medium and hard) a new car will become available for each category. Already at this point it is possible to notice the first problem of Touch Racing Nitro, linked to the scarcity of the available modes: alongside the various Tutorials, Time Trials and Tournaments, in fact, the possibility of carrying out a quick quick race is inexplicably missing, as well as any type of multiplayer online or local. The only way to face the race will therefore be to start a tournament, which however in a rather absurd way cannot be saved during its course: not finishing the 6 races in one breath for each event will in fact result in the cancellation of all progress achieved and the obligation to start all over the competition from the beginning. Needless to say, this choice is frustrating and not very appropriate, especially considering the extremely portable nature of the iPhone. Other perplexities are caused by the behavior of the toy cars on the track and by their interaction with the circuits: obviously no one expected extreme physics or incredible realism, but apart from the higher top speed of the super car category, all the other cars behave in practice in the same way, definitely undermining the fun. As if that weren't enough, it will happen more than once to get stuck in dead zones of the circuit or worse to take the wrong road, given that the edges of the tracks are not well defined and certain crossings could cause confusion; unfortunately, in the event of an error, it will not be possible to quickly move the car in reverse, which is not foreseen, but you can only touch the Reset button at the top, which will automatically reposition it in the freest point of the track.it's close. The speech regarding the technical aspect is decidedly better: the three-dimensional graphics are accurate and colourful, with a slightly lateral top view, similar to that of the old Super Off Road arcade. The car models, although inspired by the legendary Gig Nikko cars, are actually rather sparse while the framerate is generally fluid (although as usual the best performance will come after a phone restart). A pitiful veil on the music and audio effects, more like the buzzing of insects than the traditional hiss of electric cars. Finally, the increasingly popular Achievements Open Feint, which can be synchronized online, should be mentioned. The tested version is 1.2 Price: 1.59 Apple Store Links", "date": "2010-08-09", "grade": "6.0"}