{"name": "Jurassic World Evolution 2", "ref": "https://multiplayer.it/recensioni/jurassic-world-evolution-2-recensione.html", "text": "A management software on Jurassic Park in the hands of Frontier is a project with immense potential that was only partially expressed in the first chapter. So this second game had the opportunity and the responsibility to become perfect: mission accomplished? Almost. As we will see in this review, Jurassic World Evolution 2 in fact represents a real evolution of the progenitor, but still lacks a little something to reach the degree of perfection that a title with these premises could offer. After having tried various avenues in different genres, the management version version seems to be truly the best interpretation of Jurassic Park/World in the videogame field, with the brand that continues to meet enormous consensus over the years and certainly greater attention from part of the developers, who are now trying to exploit it for something a little more substantial than a simple 90s tie-in. On the other hand, dinosaurs are always great and the series based on the books by Michael Chrichton in turn has generated a real cult that can also be exploited properly in the video game market. The first Jurassic World Evolution was seen a bit as a wasted opportunity, as also reported in our review, because it was still a bit rough in some respects and above all incomplete, unless you bought the numerous and expensive additional expansions. With Jurassic World 2, Frontier Developments has created a much richer and more complete experience, although one gets the impression the game is rather a complementary product to the first chapter than a game that is finally complete in all its parts. This is because, curiously, the second episode corrects several defects of the first, but also introduces critical elements, such as a Campaign limited to a sort of short tutorial and a sandbox locked behind the need to complete the other modes, while remaining set according to the principles seen in the progenitor. Overall, Jurassic World Evolution 2 is certainly a substantial evolution that properly expresses, although not yet fully, the enormous potential of the franchise and the concept behind the game. Hammond's legacy Jurassic World Evolution 2: an overview showing the greater richness of the scenarios, the large aviaries and the aquatic areas In Jurassic World Evolution 2 we have to build and manage paleontological theme parks, that is to introduce over 70 species of dinosaurs in protected environments, trying to make everything work as best as possible. Not a simple thing, as we also know well from the events of the film series and from the books, given that the animals in question seem very unwilling to be locked up, having however considerable size and power. The result is a very particular simulation, which has its roots in the tradition of Theme Park and Zoo Tycoon, but with peculiar characteristics that derive from the subjects of the attractions, which require truly complex management. Generally speaking, it is a question of building areas enclosed by fences in which to insert the various species of dinosaurs, trying to satisfy their different needs in terms of habitat and physiological needs: it is not just a question of placing mangers, but of also the type of vegetation to be associated with the various species, reproduce their original environments as faithfully as possible, avoid incompatibilities between the different animals, respect hunting and food procurement habits and adopt the best control and safety systems. The lizards in question are obtained by recovering them from the surrounding environment, through a combined action which first requires sending a team to sedate the specimen and then sending a helicopter for transport to a prearranged fence, or they can be created directly in the laboratories, once we have reached a certain level of experience and breadth of the park. Once inside the structure, the dinosaurs must be satisfied, otherwise they can take very little time to demonstrate their discontent, destroying fences, fleeing into the open and wreaking havoc, or simply falling ill and dying, so it is always necessary to keep the dinosaurs under control. various parameters and learn the best way to build the different habitats. In general, it is always a question of finding a balance between the need for spectacularisation, linked to visitor satisfaction and therefore to the park's income, and the needs of the dinosaurs, to be treated in a constant. However, even this second chapter tends above all to focus on the second aspect, given that the specific management of the dinosaurs clearly takes precedence over the controlthe various structural and economic aspects of the park in terms of the entertainment system. Park construction and management Jurassic World Evolution 2, another overview of the structures that can be installed in parks As per tradition for the genre in question, the game action is divided between the construction of the structures and the constant micro-management of the various aspects of the park, which in this second chapter have also increased to become almost too many. The creative part has evolved substantially and allows considerable freedom in the construction of the various areas intended for the dinosaurs: it is possible to modify the terrain with real terraforming, to place mirrors of water, rocks, vegetation of different types with influences of paleobotany and obviously containing structures of different types depending on the species of dinosaur we want to place, which in this chapter also include birds and aquatic creatures. Then there are the support structures including research centers for scientists, response centers for security personnel, observation points, electric generators, roads and more. The constructive possibilities are very interesting and allow for the creation of rather different parks, thanks also to the different geographical areas with their own settings and climatic characteristics. The micro-management of the various components of the park has been further explored in this second chapter, introducing new things to keep under control. In addition to the need to take care of the needs of each dinosaur, with the controls that can be partially automated by assigning them to the various keepers, the direct management of the scientific staff assumes a certain importance, which now must be hired and controlled through a new series of menus and options. You need to recruit the ideal candidates so that they cover various areas of interest such as scientific research to increase the speed in new discoveries, genetics to correct problems that can arise in the creation of creatures in the laboratory or medicine, so as to prevent epidemics or treat animals more effectively. Each dinosaur has various parameters to keep under control, between health and satisfaction Among the parameters to keep under control there is even the stress of the scientists, who in some cases have to be put to rest to prevent them from freaking out and sabotaging the park, an idea perhaps a little excessive, but which obviously serves to provide an additional front to pay attention to among the various micro-managements. Among these we also find other aspects to always keep under control such as refueling for the structures, all small activities that complicate the action but serve to provide additional fronts of attention in addition to controlling the dinosaurs. To all this there are also unforeseen events such as storms and extreme weather conditions, which vary according to the geographical area in which we find ourselves, which can have catastrophic effects and force us to act promptly to stem the problems and start again. second chapter, a more specific attention to the spectators of the park and therefore all the part more pertaining to the tradition of the Tycoons or of the simulations of structures for entertainment. It is clear that Frontier has chosen a different interpretation for the series, which appears to be all about the care of dinosaurs rather than their display, which further pushes this game towards fans of the Jurassic series or dinosaurs in general more than fans of theme park simulations. History and news between Campaign and Chaos Theory The mosasaurus in its huge tank is one of the new elements added in Jurassic World Evolution 2 Last month we published a trial of Jurassic World Evolution 2 in which we introduced some basic elements on its structure, in particular as regards the Campaign, Chaos Theory and Sandbox modes, so we also refer you to that for a more in-depth view of some aspects. The second chapter of the Frontier management system is totally immersed in the ~lore~ of Jurassic World, so to speak, representing a world in which dinosaurs have now returned to live with the current animal species, as happened at the end of the last film in the series. For this reason the story, told above all within the Campaign, sees us go from one country to another trying to solve various problems that have arisen with the colossal reptiles now scattered among national parks and various geographical areas. This game mode is essentially a long tutorial that gradually introduces different basic aspects of the game and new features introduced in the second chapter, but fits us perfectly into the spirito of the franchise also thanks to the use of the various well-known characters, played by their respective actors: we are therefore dealing with the legendary Dr. Ian Malcolm, for example, played by Jeff Goldblum, with Claire Dearing (Bryce Dallas Howard) and with Owen Grady (Chris Pratt), among others, as well as various others from the established 'Jurassic' world. In addition to demonstrating the scale of the production, this continuous accompaniment of dialogue also provides some narrative basis, however there is no real story at the basis of the succession of missions, in the sense that there is no progression of significant events. The Campaign mainly serves to familiarize yourself with the game systems and show the new features introduced, preparing the player for the Sandbox, which in fact fully unlocks all its features only once the objectives in the other modes have been completed. Chaos Theory transports us directly to places and situations typical of movies By transporting us from one place to another, this allows us to have a direct vision of the variety of settings and situations in which it is possible to find ourselves, but it is also very fragmented given the relative brevity of each mission, unlike the same mode of the first chapter which is still more organic and continuous. Other narrative elements are found within the interesting Chaos Theory mode: in this case we are dealing with scenarios derived directly from the events of the five cinematographic films, staging real own ~What if~, alternative events that place us as protagonists of situations in which we try to avoid the disasters that have happened in the films or to remedy those that have already occurred. It is a very interesting mode because it ties more clearly to the famous elements of the franchise, making us immerse ourselves in those stories and putting us in contact with known and loved characters and creatures, which will make fans of the series particularly happy. Sandboxes and challenges Facilities dedicated to research, development and safety in the construction of the park The sandbox mode is the most canonical for a management system, probably the favorite of the great fans of this genre, which makes the limitation with which it is presented in Jurassic World Evolution 2 at the beginning a little bizarre. In practice, in order to access each element of the game in free mode, it is first necessary to have completed most of the other modes present, which can represent an annoying strain for purists, who may not be interested in the other game options. The various geographical settings with their specific environmental and climatic characteristics, but also the single sectors of the park, among which the specific innovations introduced in this chapter such as the new aviaries or lagoons for aquatic dinosaurs, are all blocked behind the achievement of certain objectives in the other game modes. It is true that the Campaign is not very long and still has the useful purpose of introducing and explaining the mechanics of the gameplay, but the choice of Frontier can be questionable in this respect. After all, the sandbox is basically the purest interpretation of the game and, once fully unlocked, it becomes the clearest demonstration of the amount of content and depth of structure that characterize Jurassic World Evolution 2.Many elements are linked to overcoming the Challenges, which therefore become an element of great importance in the general economy of the game. This is an interesting mode, although this too is very fragmented, since it focuses on specific situations with pre-set starting conditions and a time limit in which to reach the expected objective. The various scenarios must be completed in sequence are available at different levels of difficulty, offering the advantage of varied settings and situations, even if with less characterizations than Campaign and Chaos Theory in terms of events and narrative elements and more limited than the Sandbox as a breath. Graphics, audio and interface Jurassic World Evolution 2's interface is very simple and intuitive Also from a technical point of view, the evolution implemented by Jurassic World Evolution 2 on the first chapter is exponential, both in terms of complexity, richness and variety of scenarios and structures and in the reproduction of dinosaurs in 3D. The appearance of these is obviously derived from the tradition of the Jurassic Park / World series, with all the possible inconsistencies with respect to the new paleontological theories, but it is the now star look that these impressive prehistoric monsters have. Seen up close, they really make a splendid impression and the level of performance is impressive", "date": "2021-11-18", "grade": "8.2"}