{"name": "Silent Hunter III", "ref": "https://multiplayer.it/recensioni/silent-hunter-iii.html", "text": "A U-Boat cruise is never forgotten, especially if you come back alive The main game screen mirrors the interior of the submarine with great detail and a remarkable graphic cleaning. Scrolling with the mouse you will have a complete overview of your crew, while with a simple click you can access the external bridge, the communication room or the command room. To give orders to the officers, all you have to do is use practical menus with the relative icons, and this is where the different approaches to the game unfold. In fact, it is possible to reduce the manual tricks to a minimum, making the interaction as arcadey as possible, while the more experienced (ahem) can calculate the angle of the torpedo trajectory, the speed, the amount of oxygen and many other parameters. Between one extreme and the other (no I won't say ~there is the sea~), each player can find his own balance and change the gaming experience over time. As a demonstration of how much Silent Hunter III has really been made with love, a magnificent tutorial will educate you in a short time on the complex activity of a submarine, complete with video files that show ~in practice~ what you have learned from the theoretical instructions, and then move on in hand the commands to obtain a series of licenses. The key moment of so many efforts is of course the one in which the target sinks; I can assure you that you will cheer on the chairs toasting with the virtual crew for all the damn times that something went wrong. The progression of the missiles towards the damned enemy hull is a moment full of that tension that you would feel wandering around the Vietnamese jungle. At least that's what I've been able to experience in dozens of war games. A large part of the work consists in hitting the target, there is no doubt about this, but then you will have to take home the skin and the enemy has developed a very high level Artificial Intelligence over the years, making your life very difficult. Surely a merchant ship is a tasty prey that bad things can escape you, but a team of anti-submarine aircraft or a fleet in full warfare is quite another thing. After a little practice, however, you will find yourself wanting to take all the controls personally and the satisfactions will increase hand in hand with your skill A U-Boat cruise is never forgotten, especially if you come back alive However, not only is the challenge against the computer of a high level, but also the missions themselves I noticed that allow a real personal approach to the action, so that you don't feel forced to achieve the objectives by following one strategy rather than another and all for the benefit of personal satisfaction. The key point to understand is that a submarine is not invisible and becomes even less so when sailing with thrusters at maximum speed or when opening fire on an enemy convoy. On the other hand, in certain cases it is inevitable to have to emerge, because the amount of oxygen is limited and other factors prevent you from remaining infinitely hidden under the seas. Once on the surface it is true that you can rely on the guns of the bridge, but you will become an easy target for enemies who will have a clear advantage over you. You will therefore have to rely on a bar that indicates how invisible you are to detectors based on various factors, some of which we have already listed. Being able to sink a boat and then disappear into the darkness before being bombarded by depth charges is the best result you can achieve. In naval engineering school with Ubisoft If there's one thing that drives me crazy about this simulator, it's the graphics. As I said the 3D interiors are beautiful and perfectly animated to account for what happens when you are under depth charges, but the feast for the eyes comes from the external visuals which you can switch over to follow the damage done to your target: in this Silent Hunter III it reaches its peaks of visual impact, thanks to the stupendous polygonal models reproduced with the joy of a consummate model maker. Allied vehicles sink in ever-changing ways, jamming, capsizing, exploding with high flames obscured by smoke, without even being denied the pleasure of following them as they sink underwater into the depths of the Atlantic. An entire section called the Museum allows you to admire the vehicles of 20 nations divided by gender, walking around comfortably with the camera, also considering that the type of U-Boat you are going to pilot will also change with the course of the campaign. That's not all though, because the sea deserves a special mention and certainly candid Silent Hunter III title with the most beautiful wave animations everseen, splendidly reproduced as they crash or as they explode upwards from the crash on the sea surface of the downed aircraft. The icing on the cake is a powerful mission editor and a cooperative or competitive multiplayer mode, which together with the main campaign and single battles guarantee almost infinite longevity. Comment There is nothing better in this field than Silent Hunter III which is already a title of great value in itself: full of details for every true enthusiast but also manageable by anyone who wants to try a game that is different from the average, full of tension and set in an unusual context. A lot of love for simulation has not prevented the developers from enriching it with high impact kinematics, accompanied by a brilliant, clean and attentive to detail graphics. Its main flaw perhaps remains that linked to the particular nature and mechanics that you may very well not love, due to a certain monotony in some phases and due to the context of the submarine itself, which does not reap converts among the masses. That said, it would be a shame if even those who don't live for the genre didn't consider this alternative, which could even end up enthusing them. Enthusiasts should of course have already bought it before reaching the bottom of this page. Pros: Simulation adaptable for any need The submarine experience is fascinating Fun and beautiful to watch Cons: Certain mechanics are monotonous Like deadly shadows in the depths of the seas Some games present themselves well right away: a convincing cover image, a geographical map with the relative indications referring to the context of the Great War and a card with the summary of the commands that reproduces your entire keyboard. Yes, more or less all of it and I actually pulled my hair into my hair thinking I should spend hours on nautical charts, when in reality Silent Hunter III offers an experience suitable for everyone, with a customizable level of immersion (this is the case to say it) modifiable for all needs. After a little practice, however, you will find yourself wanting to take all the controls personally and the satisfactions will increase hand in hand with your skill. If you haven't already taken a look at the photos, I'll tell you that Silent Hunter is a submarine simulator, probably the only one on the market capable of making you relive an experience as intense as that of submarines with such approximation. In fact, playing it with the lights off, I experienced the anguish of being closed in the dark, crushed by the ocean, during the tense silences to escape detection. One could compare a submarine to a shooter: both are long-awaited, lethal if unseen, and very vulnerable once discovered. I think I have made the idea, so let's see precisely the Silent Hunter III scenario, in which you can choose to enter the game in career mode during two key nodes of the Second World War, 1939 or 1943, driving a notorious German U-Boat. In both cases you will stop naturally in 1945, but the situations on the two dates will be completely different, reflecting the real progress of the war. For the campaign mode, a dynamic development has been foreseen that will influence the course of events based on the decisions you make during the missions. This way no two careers will ever be the same as each other.", "date": "2005-03-29", "grade": null}