{"name": "Spazio", "ref": "https://multiplayer.it/recensioni/79008-ultraviolet-dawn-spazio-ennesima-frontiera.html", "text": "Although the offer of ~ultra arcade~ titles on the App Store is notable, there is no shortage of thicker products, designed for impromptu use but equipped with respectable numbers and characteristics. This is the case of Ultraviolet Dawn, a space-based shooter developed by Sad Cat Software in which we take on the role of a pilot who is confronted with a universe made up of more than a thousand explorable stars. Each of these scenarios presents itself with an aspect but above all with a different ~population~, which can consist of peaceful transport ships rather than surly interplanetary pirates. From the starting screen it is possible to decide whether to start a new game or load the last save, then the interface presents us with a star map with our momentary ~field of action~ highlighted, ie the maximum distance we can cross in the current conditions . At this point, just select a star within this range and touch the appropriate button on the touch screen to embark on a new adventure... Stars sons One of the most interesting features of Ultraviolet Dawn undoubtedly lies in the freedom of action that we can enjoy within the game. In fact, there is no predetermined path that we are forced to follow, the stars are there at our disposal (fuel permitting) and we can visit them in the order we wish, practically without constraints. We can also choose a line of conduct, therefore engaging in combat only with hostile ships or attacking anyone in front of us, sometimes putting ourselves in very dangerous situations (try shooting at a large, well-escorted cargo ship...). Each successful battle translates into the earning of a certain number of credits, which you can spend between one expedition and another to buy weapons and equipment, hire support units or change your ship by choosing one of those available. In this sense, the numbers of the Sad Cat Software product speak for themselves, the possibilities for customizing the vehicle are many and the results can be seen immediately. So what are the limits of such a full-bodied game on paper? In the first place, the freedom of action we talked about earlier, which as it is proposed soon translates into a lack of references, even with the missions that force us to manually find the interested area instead of letting us go automatically. In short, the need is felt for a classic story mode, capable of making the experience more engaging and multifaceted. Secondly, certain choices in the gameplay make the fights in space a mere ~hit and run~ style sequence, with the perpetual motion of our shuttle (albeit adjustable) which prevents us from implementing credible maneuvers. Perhaps an Asteroids-like approach (recently taken up on the iPhone by the excellent Space Miner: Space ore Bust) would have worked better, in which to assign a specific command to the reactors, while managing the movement of the opponents differently to make ends meet. From a purely technical point of view there isn't much to say: the graphics are well done (despite the obvious limitations of the 2D approach in rotations) and the touch screen controls respond promptly. The sound, unfortunately, despite being discreet, is immediately very repetitive. The tested version is 1.0. Price: 1.59 App Store links", "date": "2010-07-29", "grade": "7.0"}