{"name": "Nel segno della gallina", "ref": "https://multiplayer.it/recensioni/79419-deathspank-nel-segno-della-gallina.html", "text": "Version tested: PlayStation 3DeathSpank might have gone unnoticed if it hadn't been surrounded by the mythical aura of Ron Gilbert, historical creator of one of the most loved series by gamers: Monkey Island. The gestation was, among other things, rather long and daunting: for over four years Gilbert and Kauzlaric, creators of the DeathSpank character, struggled to find someone interested in publishing the game. In the end it fell to Hothead Games, former developers of Penny Arcade Adventures: On the Rain-Slick Precipice of Darkness, under the supervision of a more eclectic Gilbert than ever. A clone of Diablo emerges, which also looks a bit like the recent Torchlight, enhanced by over-the-top humor and situations bordering on the absurd. But will it be worth playing it for around fifteen euros? All in one hero In case it wasn't already clear enough, let's specify that the protagonist is called DeathSpank, a name that already says a lot about the character: pompous, naive, heroic bordering on idiocy... essentially the clich of the spotless and fear that plunges headlong into the most absurd and dangerous adventures since it was created for this. DeathSpank is looking for an ancient relic known only as an Artifact and his adventure will lead him to explore a world full of bizarre characters who will all take advantage of his altruism, rewarding his help with objects or money. Between hen's lips and demon dung, DeathSpank travels through a colorful world that offers a successful mix of three-dimensional and two-dimensional elements that almost recalls a pop-up book: the variety of settings, creatures and colors make the adventure a joy for the eyes, despite the simplicity and essentiality of the polygonal models, which contribute to the decidedly cartoonish visual rendering. To further characterize this abstruse fantasy world there are also the magnificent dialogues, imbued with humor and quotations: the player can almost always choose from a variety of answers that lead to further exchanges of jokes and sometimes you find yourself just selecting the most useless answer and bizarre just to enjoy the relative reaction of NPCs on duty. If on the one hand it is a pity that the texts have remained localized only in English, on the other one can only be satisfied by the integrity of the puns and puns that distinguish dialogues and names of places, characters (among many, a character called Pippin Apple -like the defunct console of the bitten apple- and continuous references to Monkey Island, World of Warcraft and even BitTorrent nd Tanzen) and equipment. Speaking of the latter, it is important to mention their importance, not only from a practical point of view, but also from an aesthetic point of view: in fact, the game offers at least a hundred different weapons, armor, helmets or shoulder pads, which will delight players with a passion of collecting. Playstation 3 trophies DeathSpank offers 12 Trophies: 7 Bronze, 4 Silver and 1 Gold. Earning these Trophies isn't particularly complicated: some only require you to kill a certain amount of enemies or complete various quests, while others have more specific goals, for example drinking 50 potions or killing 100 chickens. A delivery boy armed to the teeth DeathSpank presents a rather classic structure with regards to the actual gameplay, essentially built around the quests that the player must solve to continue the story, identified in the appropriate menu as ~Important Things to Do~. The ~Un-Important Things to Do~ (obviously) are secondary and non-mandatory quests, which the player can skip or complete to get money, experience points, items or weapons: generally they require the killing a certain amount of monsters or collecting various items, sometimes through a little strategy or solving a puzzle; the secondary quests are quite pleasant to carry out but soon require continuous movement from one point to another on the map, often in already visited locations, which make them quite repetitive and not very immediate, even if it is possible to move quickly thanks to some structures that also have the checkpoint function. However, side missions are the best way to increase DeathSpank's abilities: with each new level earned, it is possible to obtain bonuses, in the form of strange tarot cards, which guarantee, for example, greater offensive power, an increase in our hero's speed and more Still. Not to mention the various pieces of equipment released by enemies or hidden inside the boxestreasure chests require a certain level to equip. DeathSpank can simultaneously wield four weapons, each assigned to the four front keys of the controller: the combat system is therefore that of a frenetic hack'n'slash, with the difference that the player, alternating the use of weapons, can obtain bonus to damage dealt. What looks like chaotic button-mashing soon requires a certain amount of attention and timing, especially against the more lethal enemies against which it is wise to interrupt the combos to parry their attacks. To deepen the gameplay we also think about the special attacks of some weapons, which can be performed when the appropriate indicator reaches the maximum level, and the Runestones, which suggest combinations of weapons capable of unleashing devastating blows if the relative keys are pressed simultaneously. As if that weren't enough, DeathSpank also offers the possibility of playing together with a friend, even if not online: at any time the second player can grab his controller and go into action, impersonating Sparkle, a wizard capable of casting some simple spells or strike enemies from a distance. Sparkle cannot equip any items and his spells have to recharge before they can be used again, in short, it is only a simple but very welcome addition.", "date": "2010-07-28", "grade": "8.5"}