{"name": "FPS su iPhone", "ref": "https://multiplayer.it/recensioni/79219-archetype-fps-su-iphone-atto-secondo.html", "text": "A few months ago we had proof that making a high-quality first person shooter for iPhone and iPod Touch is possible, both from a technical point of view and from a practical point of view. Bypassing its lack of originality and simplistic storyline, N.O.V.A. it had the defect of not going into multiplayer much, with deathmatches for only four players in small scenarios. Instead, it is exclusively on online multiplayer that Archetype is based. Developed by MunkyFun, an eclectic team that also deals with video games for PCs and consoles, the game wastes only a few moments telling us its ~plot~ through an animated introduction, and then presents us with a really ugly and badly translated startup screen in Italian. Luckily, this is the only mediocre interlude within a production that technically lives up to expectations, moreover created in such a way as to be fully compatible with the resolution of the Retina Display of the iPhone 4. Only online multiplayer, we said, and only one mode gameplay (the classic team deathmatch), however available for two teams made up of five elements, all via Wi-Fi or 3G connection (although in the latter case the quality of the experience tends to deteriorate). Natural born killers The lack of a single story mode, let's clarify it immediately, is certainly one of Archetype's limitations, and goes hand in hand with the presence of a single multiplayer mode. The game intuitively manages the friends list and it must be admitted that the servers work well, with a fast matchmaking where you never wait more than a minute for the match to start (even if the maximum number of players is not reached). There are five maps available (inside the waiting room it is also possible to ~vote~ to skip the ones we don't like), of generous dimensions; but these are closed environments, characterized by chromatic choices that are not always happy, to the detriment of visual variety. You become part of the blue or orange team, then you start the attack and within a time limit you have to score as many kills as possible. The game is won by the team with the most points, and each player gains ~ranks~ according to the experience gained. The ranking system, however, is unfortunately an end in itself: moving from one level to another does not imply any gain in terms of weapons, equipment or anything else. Speaking of weapons, Archetype boasts a good selection ranging from the standard machine gun to the shotgun, from the rocket launcher to the light machine gun, passing through the inevitable sniper rifle and even a huge axe. It is possible to carry two weapons with you at the same time and switch from one to the other by pressing the relative icon on the touch screen, an operation which is especially useful when you run out of ammunition. Three grenades are also available as extra weapons, the launch button of which is however located in an area that is not easily accessible (top left of the screen). The control system uses two virtual analog sticks to move the character and the aiming reticle, while the fire is set by default to automatic: as soon as an enemy enters our viewfinder, we shoot. It is possible to select manual fire (which is activated by pressing on the right stick), but on balance this is a disadvantage during deathmatches. Technically the game stands out for its excellent fluidity and for the design of the weapons, quite convincing, while it loses points when we see the other players move: animations are not Archetype's strong point. The quality of the scenarios has already been mentioned previously: they boast respectable dimensions and offer some nice solutions, but the choice of colors and variety are not their strengths. The version tested is 1.0.5. Price: 2.39 App Store links", "date": "2010-07-27", "grade": "7.0"}