{"name": "Lerba del vicino nasconde un cecchino", "ref": "https://multiplayer.it/recensioni/78795-sniper-ghost-warrior-lerba-del-vicino-nasconde-un-cecchino.html", "text": "The story is always the same: terrorists threaten the world and we must stop them. Maybe put a bullet in his forehead. Don't expect too much from Sniper: Ghost Warrior from a narrative point of view. But perhaps it's for the best, given that militaristic shooters are unlikely to be able to offer decent stories and are easy to fall into the ridiculous (see the flashback of the first Modern Warfare). After all, the latest effort by City Interactive does nothing to deceive in this sense, but offers a series of well-calibrated and well-structured missions, which bring to life the various businesses of a special military group, with an eye to the trade of the sniper. Now try to imagine: we find ourselves hidden behind a bush wearing camouflage uniforms and holding a very modern sniper rifle. After crawling for a few meters remaining in the vegetation, we notice the presence of a lookout on a turret. It is not very far for our rifle, but several factors must be taken into consideration before shooting. First you have to try to check if he is alone or if there are other soldiers around. Secondly, we need to evaluate if we are in a convenient position to shoot, or if we are in a well covered area or if any enemy would be able to discover us immediately after the shot. Then the shot: aiming the rifle with the right mouse button (or with the appropriate button on the joypad), you have to center the red dot of the crosshair on the target's body and shoot. If the victim is not very close (it often happens) or is moving, you can concentrate by holding down another key in order to slow down the swaying of the weapon. Once fired, if the shot is particularly precise, a scripted sequence will start in which we will be able to follow the trajectory of the shot up to the victim's head in slow motion, complete with a stream of blood that splashes into the air at the moment of impact. The Alternatives While there's no first-person shooter without a sniper rifle, there aren't many games that are completely dedicated to this dangerous and fascinating war profession. The most valid alternative to Sniper: Ghost Warrior is certainly Sniper Elite: Berlin 1945 (PS2, Xbox, PC) from 2005, easily available for PC via Steam or in some budget collections. As the title suggests, it is set during the attack on the German capital that ended the Second World War. It is an interesting product, even if a little underrated. A remake for the Wii will be released in 2010. To be avoided like the plague, however, are Sniper: Path of Vengeance (PC) from 2002 and Sniper Assult (PS2) from 2007 which, for various reasons, are considered disastrous. Even Sniper: Art of Victory, the first chapter of the series which also includes Ghost Warrior and published in 2008, is a bad product that should be avoided as if it were a used underpants from Rubbini. Shooter sequences Let's say that this is a typical situation that one often encounters during the game and it is also what one expects from a sniper simulator. However, the developers probably thought that an entire game lived at the slow pace described above could alienate some players, so here comes the traditional shooter sections, or those in which you advance wildly shooting with large automatic weapons and injecting yourself with a strange liquid to heal wounds. These are sections that closely resemble some schemes of the two Modern Warfare (the obvious point of reference of the genre, given the commercial success that characterized them), even at a purely choreographic level, but with much fewer scripted sequences. They are not badly made, but they are weaker than the others due to the underlying mechanicalness by which they are characterized. Basically they are designed in a schematic way and offer a much lower challenge than the sniper levels, which are more tense and more tactical, as well as more open to diversified approaches. The island that exists The visual aspect of Sniper: Ghost Warrior resembles in many ways that of Crysis, which is good since the Crytek title is still unsurpassed from a technical point of view. So expect lush environments made of ruins wrapped in vegetation or enemy outposts that arise immediately under a lush mountain. There is no shortage of urban sections (the weakest in terms of scenography) and a mission on an oil platform. Let's say that, in general, the visual impact is remarkable and some landscapes leave you speechless, despite some subdued moments and a certain rigidity of the three-dimensional models that don't make it very well in the interlude sequences. The richness of detail in the vegetation then, rhe manages to make the idea of camouflage effective so as not to frustrate the action: when you are lying down in tall grass or behind a bush, you feel truly hidden, with all the problems that this can entail, above all the poor visibility to deliver the blow which in some cases obliges to expose oneself more.", "date": "2010-07-21", "grade": "7.3"}