{"name": "Un amore sensoriale", "ref": "https://multiplayer.it/recensioni/78802-pixn-love-rush-un-amore-sensoriale.html", "text": "As insensitive as it may seem, there is no doubt that a game like Pix'n Love Rush would never have ended up in the spotlight of critics if not for its particular graphic style. Born as a sort of spin-off of Pixel!, the third game in the Arkedo series for Xbox Live Indie Games, Rush is based on the same and identical basic idea: take the mechanics of the simplest platformer and decorate them with psychedelic graphics and catchy music chiptune. It was therefore foreseeable that, among the players and the press, the fear of finding themselves with so much smoke and little fire was high. In addition to the entire artistic direction, the title for iPhone and iPod Touch also borrows from the older brother the little protagonist, a chubby cat made of large neon pixels. However, perhaps to better adapt to a portable platform, this time the scope of the game has been heavily revised, giving what was a pure hard platformer an evident arcade imprint. The traditional levels littered with enemies, power-ups to collect and ladders to climb have been replaced by short and rapid scrolling scenarios, in which to collect the greatest number of bonuses (yellow icons with the ~+~ sign) while avoiding tripping over a malus (purple and with the ~-~ symbol). The more bonuses are collected, the more the score multiplier increases, while touching an enemy or collecting a malus loses the objects taken up to that moment. Much like Sonic the Hedgehog's rings, the game ends if you are hit again after losing all bonuses. Matter of style These simple mechanics represent the foundations on which a frenetic timed mode is structured, in which various levels are proposed to be overcome in just 5 minutes. Excellent for short game sessions, this option also manages to offer rather varied and original levels: in some it will be necessary to run madly to avoid leaving the screen, jump over platforms before they disappear or defend small golden creatures from the attack of those that look like purple bats. The player will in fact be able to jump or shoot small seeds upwards, although the graphical interface does not help him at all: both the two arrow keys and the two action keys are too small and, above all in the very first minutes of game, it could often happen that you press one key instead of the other, accidentally fall off a cliff or crash into an enemy when the intention was to take him out. Once the 5-minute mode has been completed, an almost identical variant will be unlocked, but without any time limit and in which the goal will be to score as many points as possible by trying to cross as many levels as possible; the scenarios will be more and more difficult and fast, soon turning into a big challenge for the player. But, as anticipated at the beginning, Rush's strength and charisma are entirely connected to his stylistic direction, made up of explosive colors, huge pixels and very rhythmic and dynamic electronic songs. Like a psychedelic mosaic, every piece of the scenario and of the characters is pulsating and hypnotic, while everything is destroyed and recreated from scratch when a new multiplier is obtained: after a certain number of bonuses collected, as if to reward the player, the style the graphic changes drastically, passing from green and black shades in Matrix style to monochromatic scenarios that give a nod to video games of the 80s, and in particular to the unmistakable Game&Watch and Nintendo's Virtual Boy. As if that weren't enough, the background song also changes along with the visual style, while a single mistake returns everything to the way it was before. The result is a hallucinogenic audiovisual twist, which switches from one style to another every few seconds, finally giving life to that experience that makes the title developed by Bulkypix so original. Unfortunately, after a 5-minute session, another and another, however, one realizes that the two skimpy game modes absolutely do not honor such a disruptive explosion of pixels, colors and notes. The tested version is 1.1. Price: 0.79 App Store link", "date": "2010-07-21", "grade": "8.2"}