{"name": "Una citta Pacifica", "ref": "https://multiplayer.it/recensioni/79096-crackdown-2-una-citta-pacifica.html", "text": "In 2007, an Xbox 360 game seemed to have been released only as a profitable vehicle for the Halo 3 beta. Crackdown, at least before launch, looked more like an experiment than a finished title, even if it had a team behind it from the creators of the first Grand Theft Auto and the Lemmings. Between word of mouth, however, and the fortune given to them by the aforementioned beta, the deeds of the super policemen of Pacific City were able to conquer hundreds of thousands of players with an all-action version of a free roaming, in which history was little more than the glue for the events and in which the elements of collecting secret items and the platform phases were the masters, without forgetting a dose of destruction well above the guard levels. After three years, here comes the sequel, Crackdown 2, released after a change at the helm, given that the Ruffian Games took care of it, after Realtime Worlds, the old team, dedicated themselves body and soul to APB. The result is a concentrate of the experience of the first episode, which, despite some pleasant additions, does not treasure some of the most interesting ideas of the previous chapter, having fun, but leaving a bitter taste in the mouth. What happened to Pacific City? Crackdown 2 begins ten years after the end of the prequel, with Pacific City dominated by the Super Cops Agency and with all the gangs, which vied for the city, completely subjugated to the established order. The press, however, suspects that the Agency is also experiencing rampant corruption and, having just reached the point of bursting the media ~bubo~, the providential spread of an epidemic emerges which transforms the inhabitants of the city into Freaks, a kind of bloodthirsty zombies. At that point, the Agency regains control of the situation and the player is asked to take on the role of the super soldier who will have to eradicate the threat, activating transmitters capable of destroying the creatures forever. To fight all this, a secret organization, called La Cella, which wants to stop the Agency believing it to be in bad faith and partly responsible for what happened. The plot, which for what should be an action does not seem too improvised either, , has been told to you, broadly speaking, thanks to the fact that in playing we dedicated ourselves to collecting a fair number of audio recordings, scattered throughout the map of Pacific City, which report testimonies from the various factions (the press, The Cell and the 'Agenzia) and which help to reconstruct a picture that would otherwise be limited to an initial film, which shows a press conference interrupted by an explosion, perhaps manned, and the rampant destruction of Pacific City and almost nothing else, without any film or cutscene. Where in the first episode, each gang was introduced by a short story, which described its characteristics and the gang leader to defeat, here, after the beginning, we are only asked to reactivate the transmitters and to eradicate the hordes of Freaks that invade the underground city. In addition to these missions, there are Cell outposts around the different areas, which must be reconquered in order to activate as many respawn points, where you can also ask for supplies of weapons and vehicles with which to roam around the city. Pacific City, among other things, shares the same map as before, transformed, however, by the ~civil~ war going on in the streets, but which remains unchanged in essential lines. That slight thread that guided the experience, consisting of the escalation of difficulty given by the different gangs, is therefore almost completely dissolved, in favor of the heart of the game, or the naked and raw action, which remains almost unchanged, fun and fast , but the only engine of the whole story, with the player who is faced with increasingly large hordes and increasingly large Freaks up to an epilogue which, however, adds little to the whole. Genetic evolution As mentioned, the substance of Crackdown 2 has remained almost completely unchanged. The soldier has five skills divided between physical strength, proficiency with firearms, with explosives, with driving and agility. While the former grow by driving and fighting, in proportion to the use made of each one, agility grows by collecting the green spheres of which alleys and buildings are scattered, allowing the protagonist to climb ever higher peaks, forcing the player to some moments of forced collection under penalty of not being able to reach the highest locations. The novelty of Crackdown 2 is that, once you reach the maximum level of agility, you are equipped with a suit that allows you to glide and perform evolutions over Pacific City, complete with timed courses in the skies of the city. Precisely these timed races constitute oneof the most successful aspects of the game, since they allow you to practice in what is a series of almost pure platform sessions and which require a study of the buildings to find grips and paths, as well as increasingly stringent precision and timing as you the difficulty intensifies. This also happens for the flight races, those that ask you to perform stunts with the agency's vehicles and the real racing ones, also to break the rhythm of the game which would otherwise be a succession of fights to free the strongholds of the Cell , activate the Transmitters and close the gaps from which the Freaks emerge. Just the freshness of this structure had made the fortune of the first chapter, but after three years it was reasonable to expect a deepening of the most successful aspects of the game and not their mere re-proposition with even a few less elements, as happens for the evolution of the vehicles . Previously, these grew in size, with a morphing effect, as the player's driving skill increased, while here, everything is simply replaced by the unlocking of new vehicles that can be requested from the collection points. This too, unfortunately, contributes to diminishing that personality that had made the fortune of the first chapter, a consideration accentuated by the persistence of some defects such as the lack of the possibility of setting destinations on the map to be displayed on the radar or by a lock system that still does not allows you to switch between enemies except by deactivating and reactivating it after targeting another opponent. Xbox 360 goals Of the 1000 Crackdown 2 points, about 400 can be unlocked by simply beating the game and dedicating yourself to a normal collection of items around the maps. To get all the nest egg you have to finish all the races, play online with friends and, of course, collect all the orbs hidden in the city. In short, it is not impossible, but it is definitely a matter of time. Force 4! In addition to the ability to fly, the other most relevant novelty of Crackdown 2 is the possibility of playing in four and thus tackling any mission of the game in cooperative mode (in addition to the presence of arenas in which 16 players can fight each other missile in versus mode). The progression in the story will be recorded only for the main player, but any collection of spheres, even the secret ones or those specific to Xbox Live, will be valid for all players who will thus be able to indulge themselves and have fun wreaking havoc and destruction around Pacific city. This novelty further enhances one of the strengths of the game, i.e. the great interactivity of the environment, thanks to widespread use of the Havok Engine, which animates the ruinous consequences of explosions and shootings around the map with spectacular results, above all thanks also to the new weapons that have been added. Crackdown 2 itself takes about 13 hours to complete with most of the ancillary missions to be finished and the collectibles to be collected, therefore signifying a good longevity. In short, that mechanism of progression and collecting mania that was already one of the qualities of Crackdown returns here even more present, enhanced by the new four-player mode, which among other things runs smoothly without lag when connected to Xbox Live providing hours of entertainment for those who get caught in the gear. Certainly not helped by an engine that is a revival of the 2007 one, apart from an even higher number of enemies on screen, and which after what has been seen in free roaming like Assassin's Creed 2 can only appear dated. The game is all translated and dubbed in Italian for the main dialogues, with the exclusion of the ambient voices of the inhabitants of the city.", "date": "2010-07-16", "grade": "7.5"}