{"name": "Il puzzle dei faraoni", "ref": "https://multiplayer.it/recensioni/78714-jewel-master-cradle-of-egypt-il-puzzle-dei-faraoni.html", "text": "This is one of those reviews that causes problems, as whatever one may write, the reader probably already knows. Jewel Master is in fact a puzzle game in the wake of Bejeweled and the like, and adopts a concept that is so widespread on the Net that it is unlikely that some of you, perhaps in a moment of boredom, have not played at least one game just to pass the time. The point is that, as a good rule, the various ~toys~ clones of each other on the Internet are in the vast majority of cases free: what did Cerasus Media and Rising Star have invented in bringing the concept to DS and thus justifying an outlay that averages around 30 Euros? It all started with Columns... ...for those who remember, sure. In Jewel Master we are faced with a grid divided into several square boxes, each of which is occupied by a particular symbol. The player's goal is to create, horizontally or vertically, a sequence of three, four or five symbols of the same type, and the goal is achieved by exchanging places between adjacent symbols, which is possible, however, only where the result of the operation leads precisely to the creation of the famous row. When the row is created, the symbols concerned disappear, those that were above take their place and, by dropping new symbols ~from above~ a ~cascade~ effect is created which in some cases can give rise to really serious combos. imposing. In the grid there are some boxes colored in blue, and it is on these that the player's attention must be concentrated since, when the row of three or more symbols affects these boxes, they lose their blue color: when all the blue boxes have become ~normal~, the level is passed. And that's it, as many of you know. What makes Jewel Master special compared to the dozens of versions of the same concept? First of all, the presence of a Story Mode with an Egyptian setting, which always makes its appearance: along a hundred levels of increasing difficulty (thanks to little things such as the shape of the grid, the presence of boxes to be eliminated more than once, ~chained~ symbols that it is impossible move and so on), in addition to the normal score, which would represent money, you will also accumulate resources of various types introduced as symbols along the course of the game. With money and various resources it is possible to buy different structures for the village you are in charge of, in order to ensure its expansion until it becomes a real metropolis: the ultimate goal would be to buy everything before the end of the hundred levels , and thus be acclaimed Pharaoh by the people in celebration. And then there are the bonuses: from the Star which cannot be moved but which is practically equivalent to a wild card good for replacing a symbol when it comes to creating a row, and which is bestowed following combos of a certain level, to the possibility of eliminate a box at will after filling a sort of bar after many well-chosen moves. That's all? Well, more or less yes... Baked guinea fowl What has been described so far is, at least on paper, so ~easy~ and immediate to excite the so-called casual audience, so potentially difficult to delight puzzle game enthusiasts. In fact, the game has both an extremely accessible side, it is the classic game that you play when you have five minutes of free time, also thanks to a control system that is as simple as it is well done, and a truly diabolical one, with the difficulty a heavy surge already just beyond the tenth level. Sadly though, various issues tend to frustrate the development team's goals. First of all we can notice that there doesn't seem to be a precise order, no artificial intelligence to control which symbols are entered on the game screen, and this underlying randomness prevents any attempt at strategic planning which is the element which, as players of Tetris distinguishes Masterpieces of the genre: it will never happen that it is not possible to associate three or more elements, but often we find ourselves having to move pieces away from the area we are interested in with the hope that, who knows when (while time passes ), that stirs something up. Secondly, and this is also the limit of a graphics department which otherwise is sufficient for the little it has to do, the symbols are very small and some even quite similar, and this becomes a problem when they start to come into play different types, or when the ~chained~ ones we were talking about a little earlier enter the scene. The biggest flaw of the product, however, remains the absence of even a minimal multiplayer option: a retail puzzle game, albeit a child of the browser game philosophy, cannot afford the prese exclusive to single player play, it has to do something extra to try to attract the attention of an audience who, faced with the choice, will in all likelihood continue to prefer a free version. Two words, again, on the sound, simply to signal the presence, in a perfectly average overall panorama of the genre, of a piece of music in the mood of quotations from Pink Floyd's psychedelia, damned anxiety-provoking and which, by itself, will be able to make you lose more than one game.", "date": "2010-07-14", "grade": "5.8"}