{"name": "Robot col wiimote", "ref": "https://multiplayer.it/recensioni/78709-transformers-le-avventure-su-cybertron-robot-col-wiimote.html", "text": "Given the terrible design that characterizes the Transformers in their film reinterpretation, many fans of the series (born in the 80s from a partnership between Hasbro and Marvel) anxiously awaited the new Activision title, which tells the endless battle between Autobots and Decepticons representing however the protagonists according to a style which, despite its modernity, incorporates the classic connotations of the so-called ~Generation 1~. This time the theater of war is not our planet, but theirs: Cybertron, a world made of transformable metal in whose cavity an Energon heart beats. In fact, the events of Transformers: The Adventures on Cybertron take place well before the eventual arrival of Optimus Prime, Megatron and their respective subordinates on Earth; and the transformations also demonstrate this, which we know are based on the reality of the place where this alien race settles and which in the game are a riot of futuristic vehicles that move on the ground or in the air, and which have little to do with cars, trucks, guns or portable radios. In any case, the Wii version distances itself from what was seen on Xbox 360 and PlayStation 3: technically unable to compete with that type of experience, the developers of Next Level Games have decided to completely change their approach and create a shooter on rails. including sections of racing that are completely free from the point of view of the controls to break up the linearity of the action. Autobots, roll out! In command of the various Bumblebee, Ironhide, Air Raid, Optimus but also Megatron, Starscream, Barricade and Soundwave we therefore find ourselves facing two different single player campaigns, one for each faction, consisting of a series of missions that can also be tackled with the support from a friend. Unfortunately, this is not a real multiplayer, because the second player limits himself to shooting on the screen using an alternative viewfinder, without managing a different character from ours: the experience turns out to be very chaotic and very little fun for those who are play the role of the ~support~, with the only exception of the driving sections, where the weapons are handled solely by the turn partner. Each mission mostly consists of a series of stakeouts: our character sneaks into an enemy outpost and from area to area he must quickly eliminate the enemies within range, while trying not to get damaged. The control system uses the Wii-mote / Nunchuk combo: the first is used to take cover (button A) and to open fire (trigger B) aiming on the screen using the infrared pointer, the second only to select the weapon among the four available (via the analog stick); but it assumes greater importance during the driving phases, where the C and Z buttons are used to brake and accelerate, while the stick controls the direction of the vehicle and with the Wii-mote we can shoot at obstacles or at the enemies who are chasing us. From the point of view of the controls, the game proves to be quite precise and responsive, with enemies who suffer much greater damage if hit on the head and a large number of interactable objects in the background that we can hit to earn extra points. Size doesn't matter? As mentioned, there are four weapons at our disposal (blaster, sniper rifle, gatling and missile launcher) and they are all available immediately. Unfortunately, there is no progression in this sense: we start with a certain arsenal that remains the same throughout the game, without the possibility of earning new weapons or upgrading the ones we have. Instead, it is nice to see that each weapon has its own why, and with the exception of the blaster alone (really useless, in fact) you end up using them all in rapid succession, depending on the moment and the amount of opponents present. Difficulty management is another controversial aspect of the Activision product: it is possible to take cover from blows indefinitely and the vital energy is restored in a few moments, which makes the game far too easy and linear. A minimum of challenge can only be enjoyed when a time limit is imposed and during the final bars, indeed to be honest the campaign with the Autobots becomes too dark and demanding in such situations, forcing us to continue a large number of times and to always put up with the same cutscenes without the possibility of skipping them. Technically, it must be said, an excellent job has been done: beyond the extremely spot-on design of the Autobots and Decepticons, the result of a common gestation between this version of the game and those for the Sony and Microsoft consoles, we have always very fluid graphics, with very few uncertainties, which undoubtedly takes advantage of the gestion ~on tracks~ but which also manages to express itself at its best in the ~active~ driving sections. The animations are very well done, the cel shading lends itself great to this kind of situation and the Italian dubbing is well made.", "date": "2010-07-12", "grade": "7.0"}