{"name": "BlazBlue: Calamity Trigger Portable", "ref": "https://multiplayer.it/recensioni/77838-blazblue-calamity-trigger-calamita-portatili.html", "text": "Tested version: PSPThe fighting game genre, apart from Street Fighter IV (but not that much), has been in great difficulty for years. The reasons behind this crisis are various: on the one hand we are looking for titles of greater depth, on the other the ~hardcore~ character that characterized the average gamer of the 90s has been lost. However, there is a hard core of enthusiasts who do not give up adding a few games with their favorite beat 'em up to the various Red Dead Redemption or God of War III. The developers of ARC System Works undoubtedly belong to this circle, who grew up feeding on the healthy rivalry that saw Capcom and SNK opposed a decade ago and then became, in turn, authors of advanced two-dimensional fighting games and in many ways ~exasperated~ as precisely BlazBlue: Calamity Trigger. The Portable version of the game arrives on PSP in a relatively quiet period for the Sony portable console, proposing itself as the ideal pastime for fast and exciting game sessions; perhaps under an umbrella, since the beach is not so far from our thoughts. Compared to what was seen on Xbox 360 and PlayStation 3, the ARC System Works title offers a new, interesting mode (Legion) which joins the ones we already know: Arcade, Story, Score Attack, Versus and Network. The latter, unfortunately, is only present locally and not online. Here comes a new challenger! The plot of the game, which in many sequences seems to be clearly inspired by Neon Genesis Evangelion, sees a team of scientists engaged in an experiment that should open the doors to a new plane of reality. But things go wrong, and the forces coming ~from the other side~ unload on the earth a quantity of energy sufficient to devastate entire regions. The event ends up affecting, in a more or less direct way, a series of characters who find themselves having to fight to survive or simply to give meaning to their existence. The first and most important is Ragna the Bloodledge, nicknamed ~Grim Reaper~: a warrior equipped with a mechanical arm and moved by the desire for revenge against those who took his sister Saya away and took control of his brother Jin's mind. Ragna is comfortable with close-range attacks, and his special moves allow him to effectively cover the space immediately in front of and above him. Then there is Jin Kisaragi, Ragna's brother possessed by an evil creature: thanks to his sword and above all to its energy projections, he can attack from a long distance in a very short time. Noel Vermillion is a girl-soldier who fights by holding two rifles (which she also uses as sticks) and who, for her super move, pulls a huge and devastating machine gun out of nowhere. Rachel Alucard is one of the most ambiguous characters, it is in fact a young vampire who fights accompanied by a funny little creature. His fighting style involves throwing traps in the air and on the ground, in order to limit his opponent's movements. Taokaka is a cat-woman with very dangerous claws, she can throw objects from a distance and perform a ~lightning attack~ by bouncing off walls; while the young Carl Clover is a sort of improvised Harry Potter complete with round glasses and top hat, who takes on opponents using a mix of magic and technology (see the puppet he can call to his aid). Litchi Faye-Ling is a bit of a clone of Mai Shiranui: beautiful and busty, she fights with a rather effective chain stick from short range; completely different from the bizarre Arakune, a ~semi-solid~ being that looks like something out of a Hayao Miyazaki film and can change shape at will. Iron Tager represents the category of ~giants~ in an authoritative way: it is a cyborg equipped with devastating close-quarters moves, able to eliminate any opponent in a few seconds despite being able to count on a low speed. Bang Shishigami is the ninja of the situation, he can throw small smoke bombs into the air but above all he has the ability to ring together deadly combos of kicks and punches. The picture is completed by V-13 and Hakumen: the first is a powerful cyborg built in the image of Saya, Ragna's lost sister, and has the classic long-distance moves, as well as two mechanical wings that hurt a lot up close; the second is a sort of ~superhero~ dressed as a samurai from the future, who fights holding a long sword but without disdaining martial arts. Only one will remain We spoke at the beginning of the game modes available, all of the classic type (in Story mode you face enemies following a particular plot interspersed with text sequences, in Arcade mode instead you just fight) to paEnter Legion Mode. It is a small novelty that comes from the usual survival but offers us a broader structure: within a sort of board, we can move our character and decide which group of opponents to challenge, then try to eliminate them relying on a only energy bar. When the fight is over, we can recruit one of the defeated characters into our group and use it instead of the starting one, who in the meantime will be able to recover the lost energy. The control system sees the presence of three different attacks (weak, medium and strong) supported by an ~energy projection~ that changes from case to case, while the back buttons are used to provoke the opponent or grab him. To perform the special moves, as usual, you have to draw crescents with the d-pad, which on the PSP just doesn't work comfortably. The developers therefore thought of assigning the same number of moves and super moves of the characters to the four directions of the analog stick: a solution that is perhaps too simplistic and demeaning, but certainly effective. From a technical point of view, the game defends itself well with regard to the backgrounds, sometimes really evocative and full of moving elements, and the extremely aggressive and engaging music. An extraordinary and tasteful job has been done for the interface, moreover, while the sprites appear too ~pixelated~ to make it better: too bad.", "date": "2010-07-08", "grade": "9.0"}