{"name": "Naughty Bear", "ref": "https://multiplayer.it/recensioni/78719-naughty-bear-orsetto-psicotico-con-istinto-omicida.html", "text": "Tested version: Xbox 360Naughty Bear is based on an oxymoron that could worry even the most experienced player, representing the cruellest and most gratuitous violence within a context of tenderness and cuteness. On the Isle of Perfection, everything seems to be going great in the teddy bear community. Colorful houses, picnics in the woods, cakes and balloons mark the rhythm of a life of joy more gooey, at least until the fatal explosion of anger Naughty Bear. This is the bear who is regularly excluded from the quiet social life of the country, neglected if not even publicly mocked, being seen as the black spot of the perfect island, practically a time bomb. After the umpteenth teasing, the day of ordinary madness begins for the little bear: no longer able to bear the ill-concealed wickedness of the neighbors, Naughty Bear decides to take justice in the most atrocious ways. At this point, that is after a few minutes of introduction, one of the most violent experiences seen in recent times in a video game, made up of heinous killings, torture and abuse, but all in a cuddly key. Now, the irreverent and ironic intention of Artificial Mind and Movement with Naughty Bear is clear, nevertheless the violence pushed to paroxysm in the game can be excessive even for the most expert players and for those with a more open mind who have always sided in favor of the unconditional freedom of expression of this medium, especially since the age group indicated by PEGI is ~12+~. The concept, in itself, is somewhat extreme and needs a good dose of irony to be fully digested: it is basically about being as bad as possible, since based on the amount of terror we spread around the island we get the necessary points to unlock levels and new content. This, rather than the simple total elimination of opponents, leads to a more creative approach to the game world, although it still fails to avoid a fundamental monotony. The basic idea may be interesting, the choice of ~soft toy violence~ is fun, but the execution shows several shortcomings. Teddy Bear is not amused Within a rather limited quantity of scenarios which in any case always remain rather similar to each other, the various levels are inserted, which marginally vary the basic plot by inserting new gameplay elements. The juice always remains the same, that is the elimination of the other teddy bears in order to instill an ever greater terror in the souls of the fellow villagers. Naughty Bear is able to use various objects to carry on his work, or mainly weapons of various types with which to strike (single or combo, as per tradition) or traps to be placed strategically, but it is also important to learn how to exploit the elements of the scenario to carry out the ~contextual killings~. It's up to the player's perverse creativity to find out what can be done with a telephone, a lit barbecue or a candy machine, for example. Eliminating enemies isn't everything in Naughty Bear, as the gameplay instigates a wise dose of psychological and physical violence, rewarding more the psycho-physical destruction of the opponent rather than instant death. Various commands are therefore entrusted to ways to scare the other teddy bears, which also include the possibility of hiding in the scenario and appearing suddenly brandishing knives or whatever, making the unfortunate ~enemies~ reach a degree of extreme terror up to definitive madness and, in some cases, to suicide, with a large reward in terms of points, of course. The use of contextual killings also introduces a remarkable tactical element, with the possibility of tampering with various objects and, taking advantage of the teddy bears' innate propensity for bricolage, waiting for someone to work to put them back and at that point hitting the unsuspecting lover of the do-it-yourself. The accumulation of points determines the opening of various access points that allow you to reach new sections of the island in which to spread new terror, although the game areas tend to look a bit similar. A dark sitcom The various levels are characterized by a different background in terms of plot, but basically we always start from Naughty's house which acts as a hub for accessing the various areas of the island. Whether it's killing the mayoral candidate, exterminating the spy pigeons sent by the army or simply taking revenge for not being invited to a birthday party, Naughty will still make a clean sweep of the local fauna in various ways. Just the killing methods determine the fundamental variants on which the gameplay of the game is based: oeach level must be played several times, following different objectives and behaving differently each time, following the precise indications given in the initial briefing. In some cases we must be careful not to let certain subjects escape (the teddy bears often try to escape aboard boats or cars, unless they have been tampered with beforehand), in others we must carry out as many killings as possible, in some cases we we find ourselves racing against time while in still others we are prohibited from using weapons, which forces us to sharpen the tactical spirit and make the most of the elements of the scenario for contextual killings or suicides. Everything is aimed at collecting points, which determine the conquest of new costumes for the protagonist (linked to various statistics such as strength, precision, resistance and the like) and access to new levels (7 in total) and different sub-levels . The lack of a real progression in the story and in the game structure as well as the evident similarity of the various settings contribute to determining the sense of monotony that grips Naughty Bear after the first hours of the game, when the repertoire of moves and modalities begins to run out of killings (albeit very varied) that you have available. The presence of multiplayer could partially remedy this fundamental repetitiveness, but by providing the classic modes normally found in shooters, this collides with the game structure itself, which prevents an approach that is too much tactical and competitive, based on a dynamic combat quite confusing. Xbox 360 goals Naughty Bear contains 50 unlockable achievements for a total of 1000 Gamerpoints. The objectives are located in a rather logical way in the game path, between those related to the normal progression for the levels and those, numerous, reachable through particular performances. In general, the hunt immediately proves to be quite fruitful. bears! bears! The comic characterization is obviously a cornerstone of Naughty Bear, entirely studied on the clash between the ultra-violent content and the representation of a joyful and childish world. Seeing the various ~fatalities~ and the most heinous killings within this context, accompanied by the emphatic comments of the reporter who highlights the deeds of the protagonist, actually manages to put a smile on the face despite the fact that the actions actually shown on the screen are anything but. how cheerful. However, the graphic sector shows rather evident limits in several respects. If the simple modeling of the characters and scenarios can be justified by the graphic style adopted, annoying defects remain such as the rather confusing management of the camera, which makes the clashes with fleeing enemies even more frustrating to arrive at the obvious interpenetrations between polygons well highlighted by the zoom in at key moments, up to occasional framerate drops that have little justification given the not excessive amount of elements on the screen. All in all, the game has its own specific graphic identity but the thought remains that more could have been done to avoid the defects present, in particular as regards the management of the camera which often negatively affects the gameplay. The audio accompaniment is at good levels, with music appropriately halfway between carefree and disturbing and an excellent localization in Italian complete with a commentator who highlights the most ~gore~ moments with enthusiastic comments.", "date": "2010-07-02", "grade": "6.0"}