{"name": "Quando Hamtaro incontra Marble Madness", "ref": "https://multiplayer.it/recensioni/77257-hamsterball-quando-hamtaro-incontra-marble-madness.html", "text": "Take an intricate labyrinth suspended in the void, full of obstacles and traps. Set a time limit to reach the exit, under penalty of game over. Now take a sphere and stick a cute and tender animal inside it. No, you will not get Monkey Ball but his newest clone, HamsterBall. The new PSN offer does not have great pretensions and imitates the concepts behind the historic Marble Madness and the fun Monkey Ball series quite well: part puzzle, part action game, HamsterBall is certainly the most hated video game by the little ones domestic rodents. Roll roll roll roll HamsterBall is truly an arcade game and it doesn't take long to engulf you in its basic yet addictive gameplay. In fact, the approach is embarrassingly direct: from the main menu you immediately switch to the selection of game modes and from there you are immediately on track. The options are very limited, the game modes few but diversified. The aim remains the same in almost all of them: to reach the other end of the maze by controlling the movements of a small sphere containing a hamster, moved mostly by inertia and gravity, with the right analog stick. The player can slow down or speed up his movements and tilt the ball to orient his movements. It is also possible to perform a small jump, but you will have to wait several seconds before making another one and therefore it is a risky move to be used rationally. The variety of ~tracks~ is remarkable: each labyrinth is extremely intricate and develops both in height and length through tunnels, slides, mobile platforms and other amenities. There are literally tons of obstacles, from the most harmless barriers that slow down the movements of the ball to deadly hammers and drills capable of mercilessly putting an end to the life of our hamster. In Push mode, the player will have to lead the hamster through dozens of labyrinths within a certain time limit: fortunately, the seconds remaining at the end of a path will be added to those allowed to complete the next stage; in this way the skill of the player is rewarded with an extra chance to complete the following levels. The Trial mode is the typical timed challenge, which can also be played against our own records re-proposed through the ~ghost~ of our last race. The Acrobatics mode, on the other hand, is perhaps the most interesting: there is still a time limit but the mazes are much more intricate and require you to think about your movements rather than relying on your reflexes. There is also a simple multiplayer mode, which is expressed in a race of speed or ~sumo~ ... in the sense that our hamster will have to push his opponents' hamsters off a platform before ending up in the void himself. Argh. Hamsters Without Borders HamsterBall is all in all a fun and quite varied title, but not without its flaws. First of all, nothing but the technical realization: mind you, HamsterBall is a low budget title that can be purchased for a handful of euros, and it is certainly not the scarcity of polygons or the essentiality of the labyrinths that we want to criticize. Indeed, the design of the various tracks is even brilliant on many occasions. However, the color combinations are quite questionable and the speed of the development together with an unfriendly camera (fortunately fixed in Acrobatics mode) sometimes manage to induce a sense of nausea. Dizziness aside, HamsterBall's other problem is clumsy handling of physics. In a game of this type the physics of the interactions between the rolling ball and the environment is fundamental, unfortunately in HamsterBall this doesn't always happen and there are plenty of opportunities for unthinkable jumps or unrealistic detours. Sometimes this gap makes the simplest of obstacles a seemingly insurmountable mountain: try sliding down a spiral slope just wider than your little sphere... it will take a lot of patience to get over that damn rock.", "date": "2010-07-01", "grade": "7.7"}