{"name": "Asphalt Urban GT", "ref": "https://multiplayer.it/recensioni/asphalt-urban-gt_a.html", "text": "Gran Turismo who? Asphalt Urban GT was born for N-Gage and mobile phones at Gameloft studios, probably the most prestigious name when it comes to mobile titles, but a DS version was announced practically simultaneously with the presentation of the handheld, although neither in perspective nor in the proof of the facts the setup of the Nintendo console, with its double screen, tactile functions and all the rest, let us imagine who knows what benefits to the game formula. It is an arcade car racing game, so arcadey that it is not even possible to choose to run with the manual gearbox, that the turbo is present in the form of the imperishable ~Nitro~, that even around the circuits you will find cheerful trucks with al instead of the trailer, an accelerating and ~jumping~ ramp, in the sense that it will make you make leaps that not even K.I.T.T. could never have done... There are realistic ambitions, but all in, if you like, the ~surrounding~, and we are referring to the thirty or so cars built under license from some of the world's largest manufacturers (Lamborghini defending our colours). In truth, even the structure of the Evolution mode, the main one of the game, would like to be realistic, even if then the development of the action completely wrecks the intentions: it is verbatim a copy of the super-famous formula of Gran Turismo, with tournaments each with its own theme and specific requirements and the cars to buy and modify with the money earned in the races, only the licenses are missing. Once you get on the track, we were saying, we are in the name of almost pure arcade: the cars are immediately fast (apart from the very first category, real virtual wrecks), you don't tackle a curve that is only one if not skidded, the damage does not even remotely exist, even if the bumps can waste a lot of time. Even, taking a cue from Burnout, using one of the two external views in the event of particularly spectacular accidents or breathtaking jumps, the camera cuts off to show us the Hollywood-style event. DS goes fast To mitigate what might seem to be the prevailing simplism, there is the fact that cars actually seem to respect in practice what the differences are on paper, some are heavier, others more reactive and so on, and to make the most of the player will have to adopt approaches, we are talking above all about entry, mileage and exit from corners, different from each other, even though they all fall within the classic ~Ridge Racer~ scheme. Above all, however, there is the fact that all this works, and also very well: the title is fast and adrenaline-pumping, the driving fun and pleasant, without too many frills and a harbinger of that ~brute~ fun which is all that should be ask an arcade. The opponents can prove to be real tough bones, even quite slothful when later on they try to send you towards the guard rail without too many compliments, but in the end they are always a relative problem given the modification system that allows us, scraping together some money, to develop an elusive racing car that will gain on the straights all that you could lose in the curves, if you really are a fearful sucker; this is where the presence of traffic intervenes, always numerous on the roads of Asphalt, which often and willingly becomes the main obstacle: hitting a van can waste a lot of time, and spectacular chain accidents are also possible. the title is fast and adrenaline, driving fun and enjoyable DS goes fast The Gameloft production sins more on the longevity front, not so much for the scarcity of game modes (Evolution provides a good number of tournaments and different types of competitions, and beyond that there are several challenges in the Arcade mode), but for the limited number of vehicles and tracks: the latter are well done allowing the title to show off all its speed potential, but they are repeated so often that it will take you a while to learn all their secrets. The presence of a few vehicles also means that the player has to master a modest number of driving styles, all based on the same arcade system. But it's not a serious problem, since, even after having sifted through everything that can be sifted through, the gameplay itself of Asphalt Urban GT, so immediate and fast, pushes you to play a small game every now and then, perhaps to fill five minutes of emptiness between commitment and the other; in this, it must be said, AUGT proves to be simply perfect in its conception for a portable console. However, we are not talking about a ~normal~ portable console, and it is immediately clear that the title was not born for DS: the touch screen is there just to navigate between the menusu, all the controls are entrusted to the classic push-button panel, and the fact that a large and detailed map of the circuit, as well as other information, is reproduced on the same touch screen during the races, ends up being counterproductive because with the action taking place so fast on the upper screen, the player hardly has enough time to shift his gaze, take note of the next curve and perhaps the position of the opponents. The wireless features aren't at their best here either: multiplayer is for four players, but everyone needs their own copy of the game. Just enough, however, to satisfactorily increase fun and longevity. Engine power Except for a notable dirt of the image in some situations - let's be resigned, on DS it will be a constant for 3D games - and for the obvious problem of the small screen that makes it difficult to distinguish objects further away, the graphics system is formidable. The backdrops are even spectacular and rich in polygons (the pop-up is evident but does not affect playability at all), especially those in the city with a New York and a Paris which, also thanks to the always spot-on textures  there are few really good ones first of all that of the asphalt (given the name of the game ...) - are reproduced in a surprising way for what is the common perception on the capabilities of the DS hardware. Even our car is well made, with a wealth of details, and we even allow ourselves special effects such as the debris raised by the skid and the wake of the turbo; the opposing cars are less detailed while the vehicles that make up the traffic are little more than virtual cardboard boxes, but expecting more would have made little sense for how long they remain on the screen. Everything flows at a granite fluidity, 60 fps very constant that never decrease Engine power Everything flows at a granite fluidity, a very constant 60 fps which never decreases, and which are decisive in guaranteeing both driving pleasure and such a good visual impression; really a great job. To signal some totally busted collisions, the car passes quietly through some elements of the backdrop, but intentional, as these are small elements that scanning on such a small screen would have led to frustrating moments, which instead are totally absent from the game action. However, unlike in the vast majority of titles of the genre, the replay is much shorter than the normal game action: perhaps due to the limited time available, in fact, during the replay the only car to be displayed is ours, all the highs are completely absent while the effects of the impacts we had during the race remain on the screen; the final effect is quite surreal... Furthermore, the often fixed shots of the replay highlight the defects, read ~pixelated~, of many textures of the backdrop much more than what can happen in the race and, again, during the replay the machine, very fluid during play, he often moves jerkily. Definitely a poorly maintained part. The music is in pure Gran Turismo style, and is few but pleasant, while the sound effects return to amaze us, from the engine of our car to those of the other vehicles that we pass by and which skilfully exploit the stereophony, as well as the horns of the cars arriving in the opposite direction (but in reality we are the ones going against the flow), which can even be defined as realistic. We could say that Asphalt Urban GT doesn't put a lot of irons in the fire, but what there is is undoubtedly of very good quality and also, if you like, with a surprising taste. Leaving aside the gastronomic comparisons, we cannot help but notice how much the team in question knows the mechanics of the portable game, creating an immediate, streamlined, fun and adrenaline-pumping title that on a home console would have left something to be desired but which on a portable let it be appreciated for what it is. To this we also add graphics and sound that already make good use of the DS to give us moments of sensory satisfaction that are also perhaps unimaginable at a first distracted glance. In short, a nice surprise and a game recommended to anyone looking for a representative of the genre: good strength, on DS it is the only one waiting for a European Ridge Racer, but the fact remains that it is undoubtedly of solid quality. The only truly negative note is the lack of exploitation of the many peculiarities of the DS.Pro Immediate, fast and above all fun Technically very good Cons Little else besides the ~pleasure~ of driving Ludically it is not as daring as other DS titles In life as well as in videolu criticismsay there are ideas which, we don't know how, we don't know why, stick to your brain and never want to leave, even though you don't have direct experience of the object of that idea; it cannot be said that it is the fault of someone or something in particular, these ideas almost seem to be born spontaneously and have a life of their own, and are the hardest to die. Let's talk about prejudices: many have them, many are victims of them, and only first-hand experience can break them down. The video game here, who knows why, has probably fallen victim to the entire population interested in a DS, but just put your hands on it for a minute to understand that", "date": "2005-03-21", "grade": null}