{"name": "Abbattiamoli ancora a colpi di Poker", "ref": "https://multiplayer.it/recensioni/78050-sword-poker-2-abbattiamoli-ancora-a-colpi-di-poker.html", "text": "Some time ago we broke up with the review of Sword & Poker, a title that followed in the footsteps of Puzzle Quest games and derivatives and that offered an atypical RPG in which turn-based combats were tackled using some poker hands according to a mix that it turned out to be absolutely functional and fun, as well as unreleased on the iPhone. So riding on the success of the original title, which arrived a little quietly also due to the lack of translation at least in English of its features on the Western App Stores, here comes Sword & Poker 2, which remains in the same structure as its predecessor, but tries to make the side dish is more appetizing and structured, indeed very limited in its first incarnation. In this second chapter, in fact, to welcome the player there is a short introductory sequence in which the events of the game are narrated, focusing on a tower occupied by dark forces and on the attempt by the main protagonist to regain a magic stick capable of to give unlimited powers to whoever possesses them. At this point it is possible to access a sort of World Map which indicates different locations, and with the tower above which requires the recovery of four keys (one for each suit of the French cards) before being able to explore its interior. Pokerissimo is served Once the first available location has been selected, the game structure is very similar to that of the first chapter, where there are several floors to face, each populated by monsters of various kinds and visually represented in the form of chessboards within which to proceed you must have best the displayed opponent. The dedicated clash transports the player within a scheme that has a 3x3 grid of face-up French cards in the center, ~enveloped~ by an empty 5x5 perimeter. The statistics of the two contenders are at the ends of the screen, while at each turn the player can select 2 cards from his deck of 5 and place them on opposite sides of the grid and in the empty positions in order to form one of the typical combinations from which poker is composed , starting from the pair up to the royal flush. Each player has some credits that represent energy and of course whoever manages to completely reset those of the opponent wins. For each completed floor, gems are obtained which can be spent at the shop which becomes available after a few fights, inside it is possible to buy bags to increase one's maximum energy, but also weapons, which change the attack power of each combination of cards, favoring linear growth rather than those of lower or higher importance. Continuing in the adventure it is also possible to face enemies in possession of some magical powers (among many that of going berserk for a turn rather than shuffling the cards on the grid) or weapons that have the most disparate side effects, such as that of stealing additional points to the opponent with the classic poison. To close the circle, it is possible to fill the combo bar in the lower right corner, which transforms a card from your deck into a Joker when used, the use of which is vital to inflict the greatest possible damage. The gameplay of Sword & Poker 2 is therefore very similar if not identical in terms of basics, improves structure and variety, supported by the fact that at the end of each location it is possible to face the boss on duty, equipped with much more lethal attacks and a large amount of energy. In any case, the final result, beyond the above similarities, is once again exceptional for how the Japanese developer Gaia has managed to expertly mix the poker component in an RPG structure, providing the fights with interesting, strategic and generally never tiring, which become engaging when you are at least taken by the ~gambling~ component that supports the game. Longevity can therefore easily settle on several hours, while we point out, like the first chapter, the presence of a multiplayer component on the same iPhone screen and the complete absence of any online or accessory mode. The tested version is 1.0 Apple Store Links", "date": "2010-06-15", "grade": "9.0"}