{"name": "La casa dei puzzle", "ref": "https://multiplayer.it/recensioni/78065-rooms-the-main-building-la-casa-dei-puzzle.html", "text": "You know those games that some call ~puzzle~ others ~dominoes~ and still others simply the ~game with boxes~? The one where we have before us a variable number of sliding tiles, top/bottom right/left, where one is missing and we have to recompose images or numerical sequences? The one present in almost all platformers, and not, a few years ago? No? So the contagion hasn't arrived on Mars yet... Don't trust... Rooms: The Main Building is nothing more than the videogame transposition of the aforementioned puzzle. Fortunately, however, Handmade Games have decided not to limit themselves to putting everything on a screen; the original formula was, in fact, enriched by many elements that would otherwise be impossible to insert. Here, on DS, it is even distributed by Nintendo itself and is proposed as an exponent of the Touch Generation that adults could also like given its more reflective nature. The names of Hudson and Nintendo should therefore presage a high quality product, and in part this Rooms: The Main Building is as well, albeit with all the limitations that we will see. First of all, to tie the puzzles together there is a bland and superficial story that sees us play a certain ~Mister X~, strictly in a black raincoat, imprisoned in a world made up of rooms. In order to escape from this prison, puzzle pieces must be recovered which, when correctly inserted into a book, open the way out. However, these pieces are hidden in various places and to understand their allocation and be able to take them you must use the objects that are bestowed by solving, obviously, as many pictures as possible. These paintings are contained in different mansions, each puzzle piece found unlocks a mansion. The real protagonists are obviously the games formed by the tiles and here it is a must to deepen. First of all there is a character to govern and to bring from a starting point to an exit box with a door; the path to be tackled must literally be built by moving the various tiles. What makes the formula intriguing is the fact that each room is configured in a different way and can contain various elements that influence the path. From simple closed walls we move on to those that can be detonated, to wardrobes that invert rooms, to telephones that teleport, to metro stops that move in aligned boxes, to fire hydrants that move water. Then, again, stairs to go up to higher rooms, cell phones that allow you to teleport even in the absence of corded phones, mirrors that allow you to rotate the box and little else. The combination of all these elements has made it possible to create excellent solutions and puzzles that are intriguing and not too boring. However, each tile composes a drawing and has its correct place. By putting everything in the right order you get a gold in the overall evaluation, otherwise the canonical silver and bronze. There are also small and pleasant sections in which to use the objects found in ways similar to those of graphic adventures. ... by Mister Books! Once the story is completed, the game can be tackled again in two different ways. In the first there is a time limit, in the second a maximum number of movements that can be made. Both allow you to make the game more difficult and intriguing, but these features would have been more enjoyable if combined with specific levels diluted along the story rather than forced into already seen paintings. Once the structure has been described, all that remains is to see if everything works correctly; Rooms The Main Building turns out to be a pleasant title, well thought out and with puzzles that are never too difficult but still challenging. It remains, however, too tied to its own nature. The load-bearing structure is the major limit that does not allow passing from a discrete game to an excellent game. To explain better: the possibilities offered would be enormously greater if untied from the tiles and the feeling is that of facing a compressed and limited adventure rather than an enriched puzzle. Furthermore, having well-defined movement possibilities, and therefore limited number combinations, sooner or later the solution can also be reached by attempts, debasing a bit the high care taken in the realization of the puzzles. However, these criticisms are only valid in the case of long game sessions, in which a little repetitiveness is also felt, and they partially decay if the title, as it should, is faced as a small distraction of a few minutes. From the technical side it should be noted that the particular realistic and detailed style goes badly with the low resolution of the DS. If from the point of view of the active and functional elements there aren'tor problems, some doubts remain about the backgrounds and paintings to be completed where, too often, relatively little is understood. Even some animations, first of all the metro, are too slow and long for the repeated and fast attempts required. To close, the musical side, with well thought-out effects and the few pieces of music that are too repetitive and decidedly unpleasant in the long run, better to keep the volume down and listen to something else.", "date": "2010-06-15", "grade": "6.2"}