{"name": "La guerra dei funghi", "ref": "https://multiplayer.it/recensioni/77237-mushroom-wars-la-guerra-dei-funghi.html", "text": "PlayStation Network continues to churn out and release games which, despite the graphics that appear dated for many users, often turn out to be authentic little gaming gems on balance. Titles that are anything but despised and that deserve greater attention especially from those gamers who want to enjoy a few hours of fun without worrying too much about particular options, ultra-realistic scenarios and excessive difficulty levels. As in the case of the ~strange~ RTS by Creat Studios entitled Mushroom Wars, a game that despite not having the depth of more serious products such as Starcraft or Command and Conquer still manages to involve the user with its cartoony environments and scenarios characterized by missions fast and not too complex. There is no story or plot behind Mushroom Wars. Immediately you are catapulted into a world in which you find yourself in charge of a kingdom of animated mushrooms and you must avoid being subdued by three other neighboring states. To defeat the latter and avoid their invasion, it is necessary to occupy neutral villages and cities to increase one's troops, strengthen positions and create protective buffers around one's borders, building on the spot, if not already available, defense towers, storage centers for supplies, troop support, etc. The subtraction of territory from the enemies constitutes the key element of the game structure given that it is in fact vital to make good use of the conquered resources. Some of the occupied buildings can for example be modified and converted to other functions than those for which they were originally conceived. The right transformation of a building can become a rewarding choice: in fact, through the appropriate modifications some structures can create faster or more resistant to attacks, faster or better equipped soldiers and improve their combat skills. Occupy and convert But even those that cannot be modified, such as the fortified towers in Mushroom Wars, have a vital importance for an army and this goes beyond the mere defensive aspect of the occupied area. The more there are in a village, for example, the more the morale of the allied soldiers present in the area increases, strengthening the self-confidence of the warriors. To the point that these will react much better in the event of an enemy attack by fighting more decisively and quickly to defend their positions. But how do the controls work? The commands are quite simple: with the left analog stick you choose the objective to reach, with the R1 key you send the troops and with L1 you call up a menu which, depending on the moment in which it is loaded, will have different functions. The four buttons that appear by pressing the left backbone, in fact, each represent an upgrade option for the occupied bases when you have taken possession of a building, allowing for example to convert or improve the same into a military fort that shoots catapults or a other than increasing the army by ~building~ soldiers, as mentioned at the beginning. Or the percentage of warrior mushrooms to send at the enemy when attacking. Too bad it is not possible to withdraw an order after having given it, so it could happen that you realize that you have sent a column of soldiers to the slaughterhouse without being able to at least divert its path on the fly. During the actual battle phases (except in some game modes) the general number of soldiers on the battlefield is indicated on a bar at the bottom of the screen which is divided into two parts and characterized by different colors, each representing an army . The colored parts grow or decrease in relation to the losses of the player or his enemy. It should be noted that users do not physically see the mushrooms being beaten as all the fights take place inside buildings. Playstation 3 trophies There are 18 Trophies available in the game. They are divided as follows: 3 of Silver and 15 of Bronze and to obtain them you must satisfy what is required by the game such as, for example, completing the Skirmish mode on the Hard difficulty level or upgrading an entire village up to level 5 or still capturing 2000 buildings in Single Player. Cartoony Therefore, also for the losses or the number of reinforcements to be sent in a given environment, you have to rely on the small numbers above the buildings where you are fighting and which indicate any losses. Upon completion of each mission you get certain rewards and a score calculated in relation to the way in which the battle was conducted. All this is visible and summarized through a screen in which nine mushrooms are represented with a small number next to them to indicate the score, each of which is in its own rightChoose a sort of specific ~reward~: Defender if a building is well defended, Architet if a certain number of buildings are converted, etc. You can also save and upload a replay of the battle that just ended on YouTube. Which in many respects is interesting both for those who want to show their skills to the whole world and for those who want to help other gamers in difficulty in that particular mission by showing them the most effective method to complete it. As for the technical aspect, Mushroom Wars has colorful and beautiful graphics to look at. The characters are very cute, nice to command and see jumping, fighting, making sounds, laughing and celebrating for victories. In some moments he personally reminded us, with due distinction, of the splendid Cannon Fodder. Then there are mountainous scenarios, bridges, precipices, forests and so on and so forth, all discreetly made obviously in relation to the type of engine. Repetitive but catchy music that doesn't clash in the context especially when the little voices of the warrior mushrooms complete the technical picture of the product.", "date": "2010-06-10", "grade": "7.0"}