{"name": "Una nuova stella del Football", "ref": "https://multiplayer.it/recensioni/77578-backbreaker-una-nuova-stella-del-football.html", "text": "Version tested: Xbox 360In many ways, Backbreaker is something of an outsider in the gaming market, the unknown you don't expect. After 20 years of the all-time supremacy of the Madden series, if a team with no previous football experience decides to embark on an American football experiment, they can be expected to have at least a few tricks up their sleeves to survive the impact of the EA battleship. . Let's also add that NaturalMotion is with this at its first real videogame development experience and, as if that weren't enough, they are also based in Oxford, in the United Kingdom, not exactly the beating heart of the world linked to American football. The team in question is best known for its work with the Euphoria 3D middleware, a physics and ~behavioral~ simulation software used to reconstruct the behavior of large numbers of virtual characters in games such as GTA IV and Star Wars: The Power of the Force. The application of this know-how to the game in question is evident, which by staging 22 players on a field with the recurring tendency to fight in contacts of various kinds can greatly benefit from a system such as the Euphoria Engine. Indeed, it is easy to think that it is precisely the union between the typical nature of American football and the experience in that particular field of animation that has prompted a team that has so little to do with the world linked to this sport to choose to embark on this adventure, although the recent lack of competitors, beyond the cumbersome EA brand, could represent an unsuspected extra stimulus. Every damn Sunday Broadly speaking, we can safely say that Backbreaker represents a decidedly more immediate and ~arcade~ approach to the world of American football. There are tactics and strategies, of course, as these characteristics are closely related to the sport in question, but various NaturalMotion initiatives lead in a different direction compared to Madden's absolute simulation and strong managerial connotations. Here too there is the possibility of creating a team and managing the various evolutionary aspects of the players, but it is immediately noticeable that the heart of the action is in the middle of the field and the direct control of the players is the main focal point of the game. On the other hand, the aesthetic choices and the gameplay reflect this trend. The main shot, for example, represents a discreet - although not very sensible - novelty within the genre, positioning itself very low behind the controlled player and making the action more vivid but decreasing the view range, this being squashed to the level of the field. This determines an aesthetic gain but also a greater difficulty in setting the actions, with a visibility that is often too poor to bring the game tactics to a successful conclusion. Before starting the action it is possible to take a more distanced look at the position of the players and at the various trajectories foreseen based on the tactics in progress, but once the ~snap~ has been taken, we find ourselves in the player's perspective, very different from the 'easy overhead shot of Madden. Sacrificing a more strategic overview, Backbreaker's view takes full advantage of the spectacular action, expanded by the possibility of triggering the ~aggressive mode~ by simply pressing the right trigger. In this case the camera zooms in even closer and swings in the style of Gears of War's 'roadie run', amplifying the sensation of speed and danger complete with amplifying the sound of panting from the incumbent player. One centimeter at a time In the attack phase, the first role to be interpreted is obviously that of the quarterback, with whom we call the attack strategy (which can be selected from a menu extended by the possibility of ~ask the coach~ or recalled with the favorites linked to the arrow keys) and we carry out the pass or we try to run, depending on the tactic chosen. Also in this case we are witnessing an interesting innovation, even if this too is not implemented perfectly: instead of associating each player with a key, or in any case using a simple key to trigger the pass, the latter is performed with a movement of the right stick. Before the ~snap~ (or after, but in this case we have to take into account the much shorter times given the risk of the opponent's blitz) we can review the various receivers, once we have chosen the right one, the camera will focus on it while we execute the passage, with the possibility of entering ~focus mode~ by pressing the left trigger. In this case, u triggersn slow motion which helps to better analyze the situation and increases the accuracy of the pass. The downside is that the excessive zoom on the receiver reduces the field of view and increases the risk of finding opponents close by, surprisingly, furthermore the time spent in reviewing the various available receivers is too long and often takes us to suffer a tackle, given the not excellent efficiency of the protection line, which almost always makes it preferable to throw towards the first available receiver, greatly reducing the tactical depth of the game. Depending on the movement made on the right stick it is possible to make various types of passes, more or less tense or lob, although the control seems very limited and entrusted above all to the automatisms of the CPU. In the role of runner, we can use the ~aggressive mode~ which increases the player's reactivity and speed, but also in this case by reducing the tactical vision of the playing field. While we set the direction with the left stick, with quick taps on the right we can make evasive movements to dodge blocks and tackles from opponents. In the defensive phase, we find ourselves on the basis of the chosen role (it is possible to switch from one player to another by pressing a button) and the selected tactic to mark an opposing player or a particular area, in case you simply want to contain the advance or attempt to intercept a pass. Otherwise, the blitz option leads us to implement a direct attack maneuver on the ball carrier - presumably the quarterback - in order to cancel the attacking action, with an undoubtedly satisfying choice from a playful point of view, given the satisfaction that comes from the simulation of contrasts. The Euphoria engine actually does its job when it comes to contact between players, with realistic and spectacular clashes and contrasts. There is a certain woodiness in the response to the commands given which can make it difficult to choose the precise timing for a block or a tackle, also in this case aggravated by the non-functional framing. Dream team The various options present allow you to create your own team, perform in a single match, organize a championship (with a variable number of participating teams), dedicate yourself to training or launch yourself into online or local multiplayer. The managerial component is much less developed than the one present in Madden, as already mentioned, and above all concerns the possibility of recruiting new players and a certain management of the credits earned with the results on the field to improve one's athletic resources. The options present are therefore generally very immediate and tend to launch the player onto the field with as few preambles as possible. The main mode is obviously the championship, in turn divided into two possibilities: ~Season mode~ simply allows you to organize a season with 8, 16 or 32 teams to face from turn to turn, while ~Road to Backbreaker~ introduces some more complex. First, you have to build the team from scratch, using the Forza Motorsport-style editor or with the help of the CPU in the various choices. Then, a career-style progression system is introduced, whereby at the end of each season the top three teams move up to the top football league (with any team and stadium unlocks as a reward), while the bottom three are relegated, thus inserting an ~evolutionary~ element into the game structure. There is multiplayer, which allows you to play locally through the horizontal split-screen (a choice that is not too traumatic given the normal framing downwards) or online through Xbox Live or PlayStation Network. In the latter case there are no particular negative influences on game dynamics. A special mention should be made for the Tackle Alley, or a set of fun mini-games set up to familiarize yourself with the various controls and game tactics, resulting in a sort of very interesting tutorial. Xbox 360 goals On Xbox 360, Backbreaker features an unusually low number of unlockable achievements compared to the norm. In fact, we find 29 achievements for the usual total of 1000 points. In general, as is good practice in sports games, objectives are unlocked above all through good performance on the pitch, by performing a certain number of actions or by winning certain games. A challenge quite within everyone's reach. A new perspective A notable handicap of Backbreaker against the competitor Madden is the lack of any official license, being all the circus dell'NFL firmly in the hands of the franchise millionaire EA. To respond to this, Naturalmotion has focused on a large number of invented teams and on a rather vast editor that allows you to modify characters, teams and various logos, without however the possibility (apparently always linked to the limitations on rights) of being able to share user creations online. Also due to the need to maintain a detachment from realistic references as regards faces and elements of the playing fields, the general look has been modified in order to be as anonymous as possible, with helmets with darkened visors and stadiums with a futuristic look that create a sort of almost sci-fi style. The result does not fully satisfy as it excessively flattens the representation of sport, further mortified by the poverty of the elements on the sidelines and the lack of emphasis in the outline, between dull replays and an almost total absence of care in the presentation of the players and teams ( we are light years away from the intense climate that characterizes matches in EA sports productions, so to speak). The animations, the focal point of the entire graphic system, on the other hand make an excellent impression, as do the contacts between the players and the consequent reactions: the scrums and tackles are the most realistic seen in this field lately. Likewise, the voices and sound effects during the game are studied in such a way as to make the player feel right in the middle of the field, amidst the cries of opponents and teammates, heavy breathing, creepy noises from the tackles and ovations from the audience. Aesthetically, in short, the game is characterized by ups and downs, partly due to the need to keep distances from realism and partly due to the intrinsic limitations of the graphics engine, which seems to focus almost exclusively on animations and contacts between players. The general fluidity is also noteworthy, which does not seem to suffer from framerate drops even in the most crowded situations.", "date": "2010-06-09", "grade": "6.0"}