{"name": "Mazze", "ref": "https://multiplayer.it/recensioni/77741-tiger-woods-pga-tour-online-mazze-palle-e-buche-online.html", "text": "It's been a few years now that the best known and most complete golf simulator hasn't appeared on the PC. The official reason concerns the low sales. Of course, seeing a series born several eons ago on personal computers no longer having dedicated versions for this platform puts a certain sadness. Fortunately, after months of silence and rumors, Tiger Woods PGA Tour Online has arrived, a browser-based golf MMO that aims to fill the gap created in the recent past. Once we reached the game address (tigerwoodsonline.ea.com) we synchronized our EA account (if you already have an EA account it is not necessary to create a new one, otherwise the classic registration is required) and we started studying the extensive menu of options available. Obviously, you have the option to play a limited version for free, or to pay for a subscription that allows you to access all the options. We will talk about paid content in a separate box, so let's focus on the gameplay. Once the graphic settings have been modified, which only allow you to adjust the resolution of the window, we decide to enter the field immediately by choosing one of the three free routes available. Game mechanics The game system is extremely simple and is one of those already tested: a circular bar at the bottom measures the strength and precision of the shot. The first click of the mouse initiates the shot, the second determines the force and the third the accuracy. Obviously, before shooting you have to take into account all the typical difficulties of the discipline, i.e. the club to use, the conformation of the course, the strength and direction of the wind and, above all, your ability to click precisely in the right points to make the wanted shot. The interface is easy to read and contains all the information needed by the player. If desired, it is possible to examine the point of arrival of the shot in detail, so as to make the necessary adjustments. The aim of the game is always to make the hole with as few shots as possible, so as to have a lower score than your opponents. Some help comes from buying better equipment that allows you to increase your strength, accuracy, and other stats. Unfortunately, to equip yourself properly you have to spend real money, so it is better to practice using standard equipment, focusing only on the growth of levels to improve yourself. I pay for? Let's see what you can buy for real money in Tiger Woods PGA Tour Online. So let's arm ourselves with a credit card and start counting. There are three subscription options: Annual: costs 54.99 (practically the price of a full high-end game), gives unlimited access to all competitions and gives away 500 points to spend in the shop; Monthly: costs 9.99 per month and gives access to all competitions; By competition: access to a single competition is paid for by spending points (100 or 150 points, or around 1.00/1.50 per competition). Subscribing allows you to have access to all courses and all competitions, unlike the free mode which gives access to only three courses which EA rotates regularly. The points, required to make purchases in the Pro Shop, cost: 1000 points for 10 2500 points for 25 5500 points for 40 The points can be spent to buy better equipment (clubs and balls that give strong bonuses, but which are no longer usable after a certain number of rounds), various bonus multipliers and some exclusive clothing items, in addition to the aforementioned individual competitions. Shadows Technically we are dealing with a good browser game, calculating the target it is aimed at. Obviously it was designed to run on as many systems as possible, so don't expect the wonders of a commercial game. However it can be seen and in general the work that has been done is more than good, both in terms of three-dimensional models and in modeling the routes. Too bad only for the dancing shadows that come and go or start flashing in a rather annoying way. Of course, this could be a bug that will be fixed in the future. Being a browser game we were able to test it on four different systems and in all cases we encountered the same problem. However, it should be emphasized that the game has proved to be fluid even on systems that are several years old, as it is logical and right that it should be, and that therefore it is accessible to all, also by virtue of the already described game system designed to be the simplest and immediate as possible.", "date": "2010-06-03", "grade": "7.5"}