{"name": "Il signor quindicipalle", "ref": "https://multiplayer.it/recensioni/77252-pool-pro-online-3-il-signor-quindicipalle.html", "text": "Basically two approaches to the genre of billiard simulations can be distinguished: on the one hand, the arcade interpretation with characters, career modes extremely rich in content, skill challenges and so on; on the other, the most rigorous realism, the aseptic reproduction of a three-dimensional gaming room and a physics of the balls that is as convincing as possible. Pool Pro Online 3, the new title developed by the ~Apple division~ of Namco Games, opts in no uncertain terms for the realistic approach, bases its appeal above all on the interesting and valid online multiplayer mode but loses sight of the single player, consisting of only a single game with a variable level of difficulty. No characters, no careers, no skill tests, just a short registration procedure that allows us to challenge other players around the world and use a virtual shop in which to spend the experience points earned. Royal triple 3-in-a-row returned with a dot! The touch screen offers great possibilities in terms of controls, and in the case of Pool Pro Online 3 we are faced with an almost perfect implementation. The power of the shot is dictated by the movement of the cue, positioned on the left of the screen, while a horizontal bar allows us to rotate the position until we frame the ball we intend to hit, as well as the forecasts of movement of the same and of the cue ball (displayed in view, as usual). In the upper part of the screen it is possible to notice an icon in the shape of an eye, which once touched changes the game view according to our tastes: from above, three-quarters from the long side of the billiard table or three-quarters from the side short. Unfortunately the framing remains fixed, this means that in many cases the consequences of our shots will end up out of view and will not be followed by the system. As mentioned at the beginning, we can access three variants of billiards: ~8 ball~, ~9 ball~ and ~snooker~. The first is usually called ~carambola~ and is probably the best known even by non-enthusiasts: one player takes the solid colored balls, the other the striped ones, and the winner is whoever pockets them all and then does the same with the number ball 8. In ~9 ball~ there are instead no distinctions between the marbles, and the goal is to put them in the hole in ascending order according to their number. Finally, ~snooker~ has recently become popular thanks to some television broadcasts despite being the most complex of the three specialties, in which each player must pocket the balls in an order based on color, with a certain number of points assigned to each marble. The multiplayer mode, the flagship of the product published by Namco Games, allows us to play in two on the same device, challenge a friend locally or try our hand at online. The latter works very well: the waiting players are displayed, complete with accompanying statistics, and you have the possibility to challenge them by giving away a certain number of experience points. Once the game has started, each participant has a time limit to complete his move (therefore there is no risk of waiting forever for the opponent's turn) and it is possible to communicate via text chat, add the user to the list friends, view leaderboards, etc. The technical sector perhaps lacks from the point of view of quantity and imagination, but it has on its side a truly exceptional three-dimensional realization of the table and the marbles: in some moments it seems to be watching the television shot of a real match. The players have not been represented visually and in their place we find only the cues moving around the table, an element that pushes even more in the direction of realistic simulation that concedes little or nothing to the spectacularity of arcade interpretations. The tested version is 1.0.4 App Store links", "date": "2010-06-01", "grade": "7.3"}