{"name": "Ma che bel castello", "ref": "https://multiplayer.it/recensioni/77679-legio-ma-che-bel-castello-marcondirodirondello.html", "text": "Preparing an introduction that could serve as a tradition wants to open the doors to the review of Legio is really difficult, given that the newly launched game does nothing but throw the player into the heart almost immediately, putting only the choice between us and the action of a few options related to the graphics and to that of the modality, however limited to the possibility of selecting between the single player and the multiplayer game, with the choice for the latter whether to play locally or via the Internet, upon registration. End of the (short) preamble and direct catapult into the actual game, where unfortunately we immediately notice the complete absence of a tutorial that was even minimal, but which in any case is by now rightly a fundamental requirement for every strategy, even the easiest to understand. The player is therefore immediately left to his own destiny, made at first essentially of choices. The fight is tough but it doesn't scare us Everything starts from the choice of your castle-map, in which to carry out the second round of the game in case you lose the first, but above all the initial deployment of your forces. To do this, we have at our disposal a series of unit points to spend to choose between the different types at our disposal, divided between the great classics warrior, archer, mage, priest and assassin, plus some additions such as the knight and the giant: given the absence of the game tutorial, one might expect an explanation at least in the unit selection phase, which is not there. All that we are given to know is instead the attack strength, the hit points and little else: for the more experienced it could be enough, all right, but for those who arrive in front of Legio without a solid background in its kind could be seriously displaced . In any case, once chosen who to field it is time to start getting serious through the first round which takes place on a neutral field between the castles of the two opponents: the movements are carried out in turn on a grid that closely resembles a chessboard, choosing whether to move, attack or remain in place in a defensive position, following a series of rules for the movements of the various characters as chess tradition would have it, even if this level of complexity is not reached at all. Apart from the close combat classes, we find mages and archers who can carry out ranged attacks, the first anywhere on the map with an area effect (including any of our ~pawns~ present in the area), while the second with the classic arrow , to shoot which, however, must necessarily have a free field towards its goal, a perhaps questionable choice but which on balance offers an extra element to the strategy of the movements. All attacks of all classes are completed with a small action interlude (big word), with a target in the center of the screen to be hit by blocking another moving circle with the mouse: a detail that could have been much more pleasing if at least customized for each class. Once the first round is over, we move on to the second, as we said in the castle of those who lost the first, with the possibility for those who won it to keep their troops who survived in the battle: it should however be kept in mind that for the effects of he outcome of the match the first part has no weight, so the winner is whoever takes home the second even if he was killed in the first round. The game is practically all here, since the only things we haven't said so far concern the difficulty level of the single mode, to choose between the three classics easy-normal-difficult, plus the multiplayer one both online and in two on the same PC, where care must be taken that the second player does not have the advantage of seeing the forces chosen by the other before bringing his own into play. Look but don't touch Technically Legio shows more than one limit, starting from the (little) zoom level that one would expect to closely observe the units, for their part designed not so badly: however, the animations turn up the mouth, far too few and mediocre to be appreciated. Some aliasing problems are combined with an uncongenial map control, which although this is not huge in size makes it difficult to point the mouse in a certain area in some cases. A similar speech with the necessary changes can be made for the sound: the motifs that accompany the action are quite repetitive, while the audio effects of the units after a couple of games definitively push the player to hear some music instead of relying on the game sound.", "date": "2010-05-30", "grade": "6.0"}