{"name": "Accelera", "ref": "https://multiplayer.it/recensioni/77553-blur-accelera-derapa-spara.html", "text": "Tested version: Xbox 360 If in Split/Second we made entire cities collapse with power play blows, in Blur we will ~only~ limit ourselves to destroying the opposing cars by hurling at them all the power ups that we manage to collect in the race, with violence and with a tactical vision of the battle on the track that is more reminiscent of the best vintage shooters than a simple arcade racing game like Mario Kart (or Wipeout). The difference between this product and the average standard of this genre is all in the way in which you fund your arsenal, in real reasoned combat built like a clockwork mechanism by the guys from Bizarre Creations. The winning choice of the developers was to create a perfectly balanced set of weapons that can be used regardless of the type, both offensively and defensively, both front and rear. Lightning wins download If in the Chinese morra the stone is opposed to the scissor, in Blur to the discharge, the incoming homing missile can be contrasted with a volley of lightning bolts, or three rapid projectiles in succession fired backwards, or the burst of impact energy which in addition to be useful when overtaking or in an initial tussle, if used with timing it destroys the discharge. In short, it is enough to always keep an eye on the mirror and choose what to use at the right time. The combinations and attacks don't end there, we also have the mine, to be released backwards or usable as a short-range unguided missile, the shield and the repair kit of which it is not necessary to write anything else and the nitro, too it has a dual use since if operated ~backwards~ it temporarily stops the car being able to move it on its axis, blocking whoever is following it and then sprinting forward at full speed, which is particularly useful in the tightest curves. To allow us to manage our inventory (it is possible to collect a maximum of three weapons at the same time) the game gives us the possibility to choose which one to use, and if space is not enough we can throw away the one we don't need. All this serves to give additional depth, keeping the repair kit or shield close at hand can make the difference in the most frenetic moments of the race. The result is a picture with very high tactical possibilities, without prejudice to the high rate of frenzy that is reached thanks to the twenty cars present on the track, which force us to think quickly, and to curse the other competitors when we see the world arriving in the mirror on him, thwarting a first place earned with blood in the last corner. In short, frustration could often peep out. Distractions in the race The progression in the long and full-bodied single player career (with a low level cap, set at the 25th level) is the daughter of this approach and as per Activision tradition, or rather in the wake opened by the perks and challenges of Modern Warfare, the advancement in nine championships is not only based on finishing at least third at the end of the race, but also (and above all) on being able to overcome particular objectives, some standard for each race, others that vary from track to track. The simple progress in the championships is guaranteed by the quantity of lights won depending on the placement, from a minimum of three up to a maximum of five for first place, to unlock new cars it is instead necessary to accumulate fans, using weapons in a creative way , performing combos or adopting a racing behavior full of drifts and so on. The extra objectives (which unlike the fans are added to our palmares only in case of placement) are really varied and they engage us in the race by making use of both driving skills and the skilful use of power ups. In addition to conquering the fans, in each race there is a challenge that sees us darting as we pass under some arches, while as previously written, those that change from race to race are very many, and in addition to being well thought out, they are really ~bastards~ since among driving, attacking and dodging opponents' attacks you have to perform some particular moves, all as fast as possible, given that as time decreases, the fans earned decrease. If executing a combo with a double forward mine is quite easy, it is certainly much less easy to hit someone from distance with the bolt in full drift or reach two hundred miles per hour with a single turbo if you haven't put another one away first. The interesting thing is that these objectives must be activated in the race, collected as if they were simple power ups. In practice it is possible to compete for the first time for placement, and then do the same race again to devote yourself to the ext challengesra, it being understood that if the placement (or the other minimum ~victory~ conditions) has not been earned, we will only have the fans as a prize. Being able to do everything at once is quite complicated, but when you do it is a source of great gratification. To close the challenges there is the global one, different for each championship, which is in fact a longer and more difficult version of those present in the individual races. How can we forget in this sense, among the many that contribute, pushing a car into the water with the collision in only two points without a guardrail on a track? The reward for achieving the conditions is the challenge with the organizer of the championship. In case of victory we will have his car complete with a special attribute supplied. The first two unlocked gave us the choice between increased impact force and four bolts instead of the standard three. Here too it is necessary, race by race, to choose the most useful one. At breakneck speed On the car side, Blur defends itself quite well, with about fifty cars divided into four classes based on power alone and not on the type of car: from 1950s pick-ups we move on to Camaro, Corvette and Viper, but they make a fine show of also the Volkswagen Scirocco, the Audi A3, Hummer, the Skyline, beetles that seem to come out of an episode of Pimp my ride and real luxury supercars like the Swedish Koenigsegg. The choice of car is very important both for the driving style you decide to adopt (in any case decidedly arcade), given the presence of more or less stable, fast and drifting cars, but above all depending on the track. From this point of view, in the Barcelona oval it is preferable to have a fast car, perhaps not too slippery in the corners, while in the city tracks with many tight curves and not too long straights it is preferable to choose a car with good resistance and power in the counters ( read an SUV or a jeep) given the tussle that will invariably arise in the presence of the many funnel points that the track designers have inserted. The choice of car and the attribute to use are essential conditions for success, perhaps a little too much as many cars seem to be completely unpresentable and made available only for show. There are four types of race, the standard one, at checkpoints, the one called destruction in which it seems to be in a sort of scrolling shooter having to destroy the opposing cars paying attention to their incoming attacks, and the final head-to-head with the championship organizer. It would seem like a meager menu, but in light of the dozens of things to do on the track, including fans, placements, races between the arcs and activatable objectives, there is little to complain about, with many hours to try to unlock all the unlockables. Speaking of tracks, we are dealing with around twelve tracks plus any other ones in reverse, a respectable number, with some that stand out for their kilometre-long leaps, such as the hills of San Francisco, or the long and successful shortcuts of the financial district of Los Angeles. Pad in hand, all of this translates into a barrage of explosions, collisions, unwanted trajectories and sudden drifts and rollovers that can frustrate more or less impeccable race conduct spent in search of the perfect race and the coveted placement or missing goal. Although very often all this could be translated into sensational and uneconomical throws of the pad out the window, in the end Blur turns out to be very fun and engaging, and in some situations less arcade than one might think. The check point races in which you have to collect the nitro and the precious chronometers scattered in the most difficult points of the track, are a triumph of the brushstroke curve and the partialisation of the braking and even if incorporated in a rather permissive context, progressing in the career we will find ourselves facing races against the time to face with your heart in your mouth and attention to a thousand, all played on the thread of the hundredths of a second. 20 rowdy in the race The other side of the coin is multiplayer, which starting from the dynamics of the career adds a substantial section of customization of the cars, plus a series of new game modes. Having decided which car to take to the track, it is possible, similar to the perks of Modern Warfare, to vary the approach to the race and the balance of the vehicle, choosing dozens of attributes, which all revolve around the characteristics of the car and the use of weapons and various power ups. We were able to see some of them, in addition to those that give a bonus to the speed, resistance and grip of the car, some very interesting ones stood out, such as the one that rains fake power upsexplosives, the one that fragments the mines, the one that makes it more difficult to trace part of the discharge, or the one that converts the destruction of the opposing car into restoring its own energy, or the one that resets the opposing power ups. There are so many, the more you play, the more you win, the more challenges you bring home, the more you unlock others, radically changing your style of play. All those who have consumed the beta will be able to confirm the effectiveness of the enormous range of possibilities that this system offers. As for the game modes, Blur in addition to the race, with or without power ups, in teams or not, from ten to a maximum of twenty players, also allows you to get involved with engine wreckers, in which instead of the track there we find in a sort of gigantic arena, in community events and in those of the world tour. Very cleverly Bizarre has made the various game modes available to level up in order to make everything even more competitive and well structured. The whole social aspect of the game is also really spot on, with the inclusion of Twitter and Facebook to directly challenge your friends by choosing the objectives to be achieved in addition to all the usual matchmaking filters. All then in a hyper-competitive ranking since our progress, and those of our friends can be compared at any time. Xbox 360 goals Blur rewards the player with 50 achievements for a total of one thousand points. The easier ones are almost all related to the simple use of weapons and progress in the game, while the tougher ones are obtained by playing multiplayer, unlocking them when certain conditions are met, some decidedly difficult. Nice, but not beautiful From a graphic point of view, the game looks pretty good, with excellent models of the cars and good special effects to highlight crashes and explosions. In terms of frames per second, it doesn't miss a beat even in the most crowded and pyrotechnic moments and gives us a truly effective and satisfying sensation of speed. The representation of the trackside elements fluctuates, if the city of Barcelona is plagued by flat and ugly textures, the same cannot be said for Tokyo, not to mention the desert lands of the Amboy track or the slums of Los Angeles, in which is raced in the gutter seen in a thousand movies. The split screen for up to four players is functional and not too penalized by the calculation, which unfortunately does not contribute to the progression of our state, but is revealed as an end in itself, detached from the context of growth of the game. We are therefore faced with a well-made game, with a good impact but certainly not at the top of the sector. Special mention for the track design, with very varied tracks where the placement of weapons and challenges has been carefully chosen, never too difficult and penalizing for the player.", "date": "2010-05-26", "grade": "9.0"}