{"name": "Combatti linchiostro con linchiostro", "ref": "https://multiplayer.it/recensioni/77333-freaking-inkies-combatti-linchiostro-con-linchiostro.html", "text": "Of all the titles that populate the App Store, Freaking Inkies is probably the least able to alarm the player: with its colorful graphics, its funny cartoon characters and the melodious opening jingle, the one by Atakama Labs can seem apparently a harmless game with which to while away some time. Absolutely wrong deduction, actually, because a few minutes are enough before being overwhelmed by one of the most frenetic and incessant experiences ever seen on a mobile platform. Still, the idea behind it is anything but complex. Once the iPhone or iPod Touch is placed in landscape mode, six colored buttons will appear on the sides of the screen, two for each primary color (red, yellow and blue). The goal is to use the buttons to shoot colored ink at the Inkies, the small creatures that roam the play area: these, as you can imagine, only disappear if hit by paint of their own colour. The real big deal, however, comes with the appearance of orange, green or purple enemies, forcing the player to dig into everything they learned as a child about secondary colors. Colorful ideas To get rid of the mestizo enemies it is therefore necessary to quickly mix the different colors, while moving the viewfinder by swinging the device in various directions. Needless to hide the fact that, especially at the beginning, combining the right colors while aiming is not immediate, and tackling the more advanced levels will require a bit of practice: fortunately, it is soon possible to associate a certain color combination with each position of the fingers, while each enemy can be distinguished by both their color and appearance. The developers have in fact managed to create characters with instantly recognizable silhouettes, a feature that proves to be quite useful in different parts of the game. However, what makes Freaking Inkies a unique title is its incredible variety: in fact, 17 books must be 'cleaned' of the horde of colorful creatures, each of which is divided into five chapters. These are basically timed mini-games in which you eliminate enemies by following particular instructions. Among the most successful there is certainly the one in which you have to protect three brains in the center of the screen from the attack of zombified enemies; sometimes it happens that these levels are in grayscale, and that the opposing creatures can only be recognized by their aesthetic appearance. Some chapters that push the player to reflect are also worthy, perhaps by solving equations on the screen and hitting the Inkie that brings the correct result with it. Surely less inspired are the scenarios in which, not being able to stop one's barrage of colored bullets, one must avoid hitting the enemies on the screen; or those that require the player to make a jackpot with an unlikely slot machine. The fact is that Freaking Inkies gives its best especially in the first half, when each level always offers new things and the game seems to be a source of endless ideas: you go on scenario after scenario, curious to know which weird mission the chapter will reserve following. Then, unfortunately, the game shoots all its cartridges, the novelties end and the levels already seen begin to repeat: the damned slot machine and that completely dark level are back again, but this time they are much more difficult. The difficulty rises inexorably, until it becomes almost impossible to complete a chapter without failing even once (a fundamental requirement for being able to obtain maximum marks). The rare battles against gigantic bosses, if they initially contribute to making the game more varied and original, soon end up being too much of a challenge, both for your nerves and for the iPhone screen. Surely the most determined players will be able to find bread for their teeth in the main mode therefore, where instead in the less demanding Free Play it is simply necessary to survive as long as possible, eliminating the little Inkies to earn more time. The tested version is 1.15 App Store links", "date": "2010-05-26", "grade": "8.0"}