{"name": "Zombie non avrete la mia torre!", "ref": "https://multiplayer.it/recensioni/77295-monster-mayhem-il-tower-defense-si-trasforma-in-action.html", "text": "Despite the fact that in this period we are witnessing videogame productions of the highest level, easily comparable to those for the more traditional consoles, the developers of applications for the iPhone certainly do not forget the immediate nature in the ~hit and run~ style that a title destined for a mobile device. Monster Mayhem seems to make this simple but fundamental principle its own and, although theoretically falling within the now abused tower defense genre, it tries to make itself more original, changing the point of view and giving the category a decidedly more action drift. In fact, contrary to the classic tower defense scheme, in Monster Mayhem it will not be necessary to place strange pseudo-war devices around to passively repel the enemies: it will be the player, materially, who takes care of the physical elimination of the waves of monsters. The aim of the game is in fact to keep the various ~inhabitants~ who infest the place away from the gate of a cemetery, using the weapons available with your fingers directly on the bodies of the nefarious creatures. The best defense is offense Having effectively lost the tactical part of positioning the armaments on the battlefield, the only remaining strategic component is given by the management of the arsenal. We will therefore have the knife, the only white weapon always available, the pistol, the shotgun, the automatic rifle, the hand grenades, the flamethrower and the electric shock launcher; in addition to the ordinary armament it will be possible to purchase the atomic bomb, with an evidently devastating effect. All of these tools of death will be selectable once unlocked from the icon menu at the top of the screen. Unfortunately it should be noted that due to the icons being a little too small, especially for those with not exactly tapered fingers, in the most agitated phases problems of inaccuracy could arise if you change weapons too quickly; considering that this will often happen especially in the final, it is certainly a nuisance of no less importance. All weapons can be purchased as the action continues, thanks to the cash bonuses that the various victims will randomly release on the field. Each of them can then be upgraded up to the third level, which will give them greater effectiveness and firepower. Although reduced, the strategic component in Monster Mayhem is still fundamental: the enemies are in fact very different and vulnerable from time to time only to some types of attack, well indicated in their personal file (which will be displayed at each first appearance of a new enemy) . A further burden on the player will therefore be not only the obvious one of keeping the ammunition but, above all, that of dosing it well during the various waves so as not to find himself then, in key moments, without the bullets for the necessary weapon. Among the 20 different types of monsters present, we will be able to find, for example, zombies with armor, sensitive only to shotguns or hand grenades, but not to knives or pistols; insects, which can only be eliminated thanks to powerful stabs or invulnerable flowers, which, although harmless, will create a protective barrier for the enemies who will cross them. As if all this were not enough then some monsters will be able to hit the cemetery gate from afar, shooting grenades or casting spells, while others kamikaze-style will not hesitate to blow themselves up carrying a barrel of dynamite on their back! At the end of particularly challenging sections, some nice elves will come to our rescue, who, once hit, instead of dying, will release all kinds of bonuses for a few seconds. A certain unpredictability in the advanced levels is also given by the appearance of ice sheets, which will make even the usually slow enemies move more quickly, forcing us to change our strategy on the run. Then there are the inevitable battles with the bosses at the end of the stage, in truth not very interesting compared to the rest of the fights due to a certain basic repetitiveness and the not very high level of challenge offered. Technically speaking, the 2D isometric view gives the title an excellent graphic cleanliness and a very pleasant cartoon-like visual style, also thanks to the general humorous atmosphere that the game transmits; however, the scenarios are practically all the same, differing only in the hours of the assaults between day and night. On the other hand, the characterizations of the various monsters are very original, whose animations and bizarre verses will often give a smile during the massacres. Finally, in line with the goliardic spirit of the game, the music, which ranges from epic songs for the menus to nice catchy tunes during the games, never repetitive or invasive. The tested version is 1.0.1 Link Apple Store", "date": "2010-05-25", "grade": "7.7"}