{"name": "Sotto Assedio", "ref": "https://multiplayer.it/recensioni/77218-uncharted-2-siege-expansion-pack-sotto-assedio.html", "text": "Naughty Dogs seems to have decided to squeeze its goose that lays the golden eggs as much as possible, as evidenced by this new downloadable content that further expands the multiplayer mode of Uncharted 2: Among Thieves. Mind you, if you have no interest in the online component of Naughty Dogs' masterpiece, you can also close this browser page and dedicate yourself to something else. But if you are a regular player or, simply, from time to time you love to drill holes in friends and strangers, Sotto Siedio could be a good way to spend 5.99 euros. The Skyscraper and the Museum The two new maps are really excellent, and demonstrate the level design skills of the softco, which seems to be really taking a liking to creating intricate environments for player challenges. The Museum is inspired by the homonymous location where Nate and Flynn infiltrate one of the first chapters of the game. This map is decidedly particular, designed to accommodate various styles of play but, above all, stealth action. The exterior is full of ambush places that will delight snipers, in short, the usual story. The area therefore lends itself to a fairly traditional pace of play, destined to change decisively in the innermost area, essentially made up of dark corridors and shaded areas. The very few points of cover and the less obvious passages make the interior of the Museum an area definitely suitable for close combat and surprise ambushes. The Skyscraper map, based on one of the central chapters of the game, is completely different. From that sequence, the map also inherits the infamous helicopter that will occasionally bomb the tall tower that goes from heaven to sniper hell in moments. In fact, the map develops in height and although it favors ambushes for snipers, on the other hand it also guarantees them a deadly weak point, often forcing them to move and abandon their position. The amount of points to climb, chasms to jump and covers make the Skyscraper map one of the largest, most varied and most enjoyable in the game. It should be emphasized that both maps above all reward teamwork: good communication is the key to dominating the battlefield. Playstation 3 trophies Also this new add-on of Uncharted 2: Among Thieves adds various Trophies, to be precise 11: 10 Bronze Trophies and 1 Silver Trophy. The tests to be overcome are quite typical, requiring for example to complete the Under Siege mode or to collect a certain amount of medals. Siege Mode Another additional content of this expansion consists of the Siege cooperative mode of the same name. In a certain sense this mode is far from new and the players will not be particularly surprised: it is practically a variant of the Survival mode, however quite reworked and complicated. Essentially, a team of three players will have to work together to survive numerous waves of enemies. And so far, nothing new. The catch is that players will have to stay inside a colored circle, waiting for a timer to run out and a circle to appear elsewhere. And in the meantime they will be besieged by various AI-controlled enemies. So here is the goal: to survive ten waves, moving from time to time to the next besieged area. However, not only do the waves become increasingly aggressive and powerful (complete with helicopters towards the end of the game), but also the areas to be defended often offer few points of cover as enemies mercilessly attack from every possible side. The Under Siege mode therefore requires lightning-fast reflexes and steady nerves, rewarding both the player's offensive prowess and his strategic patience. Exposing yourself too much, even just to restore the energy of a fallen comrade, can be fatal. Under Siege is therefore also a mode that greatly rewards communication between players. We close with the only sore point of this additional content, or the new skins. The previous Multiplayer Pack had added some excellent characters such as Navarro or Eddie Raja, unfortunately Under Siege is limited to re-proposing simple variants of existing skins. There are six new skins: two new costumes for Drake (baseball shirt and diving suit), three ~new~ zombies (Pratizor, Lumizor and the Dead Explorer) and unpublished there is only the skin of the enemy Prakoso. Nothing particularly interesting, really.", "date": "2010-05-24", "grade": "8.0"}